{
    "answers": [
        {
            "answer": "I am not physician, but the mom of type one diabetic, who is also an asthmatic. The first part of your question sounds very familiar  to what happened to us with our daughter. Our daughter had the same problems with her asthma and we thought that she was have a reaction to the asthma meds.I would HIGHLY suggest that you see a pediatric endocrinologist or have your doctor test your daughter immediately for type one diabetes.   We were lucky that out pediatricians partner is a pediatric endocrinologist.  He immediately did a test.  We caught it so early that when was not in Ketoacidosis and we did not have to put her in the Hospital.  Most kids when they are diagnosed are in Ketoacidosis and have to be hospitalized for several days to a week or so.  This is because the child is so sick and they parents learn how to take care of the diabetes.  If your daughter",
            "post_id": "2431445",
            "timestamp": "1167631200",
            "votes": 0
        },
        {
            "answer": "I am so glad that you commented. I did not say that I am a nurse, and have been for almost 15 years. I have only been a parent for half of those years as a nurse. I am actually a school nurse and I take care of a very brittle type 1 diabetic, and a couple of children who have type 2. Our family doctor has done some blood work, but I think we need to get antibodies test. I just have this feeling, along with my mother-in-law, that she has diabetes. I will be an advocate for her as long as I live. I spoke to my husband and he also agrees that we should not play around with this, and tomarrow morning I will call and have our family doctor refer us to Children's Hospital -- Ped Endocrinology. I hope and pray that I am just over-reacting, but I have to follow my gut feeling. Thank you again for giving me the encouragment.",
            "post_id": "2435702",
            "timestamp": "1167631200",
            "votes": 0
        },
        {
            "answer": "Well, I made that phone call today to talk to our family doctor. She was not in today, so we have an appointment tomarrow morning to see her and discuss with her our options. The nurse did tell me that her C-Peptide was 1.0 with the reference range being 0.8 - 3.0. Her level is within range, but is in the low end of normal (only being 0.2 points away from low). Can anyone give me some encouragment? I really think that this is a very early Type 1 diabetes in the honeymoon phase, and all the research I have read says that insulin therapy as soon as possible is the only way to help have less stress on the pancrease. Is this right or am I just over-reacting? She goes back to school on Thursday, and I am terrified. I have been watching her like a HAWK counting her carbs, and the school will not do this without a doctor's order. PLEASE SOMEONE GIVE ME SOME ADVICE AND ENCOURAGMENT TO KNOW THAT SHE WILL BE OK!",
            "post_id": "2435704",
            "timestamp": "1167717600",
            "votes": 0
        },
        {
            "answer": "I am glad that you are going to the doctor, you are right that the sooner you go on insulin the better.  We did the same with our daughter watching what she was eating till we started her on insulin. We found that it prolong red her honey moon phase.  Our daughter was in that phase for almost 2 1/2 years, being on very low doses of insulin.As for school as you know you will need to have a 504 and they have to follow the doctors orders.You are on the right track.  I hope things go well at the doctors tomorrow. Please check back and let us know how things are going.Also, checks with you",
            "post_id": "2435705",
            "timestamp": "1167717600",
            "votes": 0
        },
        {
            "answer": "Well, we just got back from our family doctor. We have an appointment with a Pediatric Endocrinologist tomarrow at 10:00am. Our family doctor was so great, she went through all the blood sugars for the last 2 weeks with her adverage being 127 on her meter. She finally told me that she does have diabetes, but she still leaning towards Type 2. All the research I have been doing leads me to believe that she has Type 1. I guess we will know more tomarrow. Thanks again for the encouragment. I will keep you posted!",
            "post_id": "2435709",
            "timestamp": "1167804000",
            "votes": 0
        },
        {
            "answer": "Thanks for checking back.  I am glad to see that you are going to the endocrinologist tomorrow.  I am sorry to hear that she was diagnosed with diabetes, but I can tell you that you are not alone.  We are always here to help you.  You might also want to check out some other websites that will help you.www.jdrf.orgwww.childrenwithdiabetes.orgYou might also want to contact your local chapter of JDRF to see if they have a coffee or support group that you can join.If not call your local hospital or ask the endocronoglist if they know of one that you and your daughter can go to.",
            "post_id": "2435710",
            "timestamp": "1167804000",
            "votes": 0
        },
        {
            "answer": "It sounds like he is explaining the honeymoon phase of type onediabetes.  if you are lucky like we were we did not start insurlinfor about 3 weeks and then it was small doses.   after about 2 years my daughtetr wanted the pump and now life is so much easier on the pump.I hope all goes well and  tha the transition is eay for you",
            "post_id": "2435719",
            "timestamp": "1167890400",
            "votes": 0
        },
        {
            "answer": "Well, we went to the endocrinologist today. The news was what we already knew, that she is diabetic. He is leaning more towards Type 1 in the very early stages. He did talk about a type of diabetes that is genetic that she could possibly have. The way he explained it was that the pancreas produces only a certain amount on insulin, and it does not know to produce more insulin when the blood sugars are up. This sounds like what is happening to my daughter. Has anyone ever heard of this type of diabetes? He told us that it is not Type 1 or Type 2. We are going to do more blood work (anti-insulin, anti-GAD, and anti-islet cell) and a glucose tolerance test with both glucose and insulin levels. We will hopefully get a definite diagnosis within the week. I am still hoping of the possibility of controlling this with diet and exercise, but so far it looks like we may end up on insulin. Thanks again, just for listening.",
            "post_id": "2435718",
            "timestamp": "1167890400",
            "votes": 0
        },
        {
            "answer": "I felt the fear in your words and it compelled me to empathetically reach out to you. You are not alone, I too live with fear... on a daily basis. I often find myself withdrawing because I cannot seem to find anyone that I can relate my daughters situation to. I have not posted here in a while but this forum was such an enormous support to me during my initial shock. I have accepted that diabetes is possibly looming over us but at the same time I want to enjoy the time we have left disease free, if that is what is meant to happen.I have a 5 yr old daughter who experiences very unpredictable blood sugars. She has not yet been clinically diagnosed and I pray it never happens... but she is positive for all 3 diabetic antibodies (GAD 65, ICA 512 and Insulin Autoantibodies). In fact, the only reason we found this out was because my daughter was having some pretty frequent and sometimes severe hypoglycemic episodes (along with a few highs up in the 200's) which prompted the doctors to take her in for testing. To the doctors surprise, these antibodies were found. We have no history of Type 1 in our family, either side. More recently, my daughters readings (her orders recommend that she is tested 6X's a day) have been frequently in the high 200's mg/dl after meals. They always come back down eventually but after dealing with very low numbers for so long, it is extremely unnerving to see these readings. Her A1C went up a bit over the past 2-3 months but its still in the good range at 5.3%. The rise in her numbers is good on one hand because her hypos are much less frequent, almost non existent! But on the other hand, I cant help but wonder if the rise will continue... leading to the inevitable? :-(  It feels much like roulette for lack of a better description. I truly, truly feel for you! Testing for antibodies when you have not yet been clinically diagnosed is not very common apparently, understandably so.... but for those of us who DO know, its a very lonely road because there aren't any travel companions to lean against. :-(I can not tell you anything more then what I have learned over this past year and its not in my power to promise you anything... I just wanted you to know that you have a shoulder if you ever need one and I wanted to wish you and your sweetie the best in the world. Dont ever doubt yourself or your intuitions, what they say is very, very true... you know your child best! Huggs!",
            "post_id": "2435722",
            "timestamp": "1167976800",
            "votes": 0
        },
        {
            "answer": "TO: MOM of 4Thank you so much for the thoughtful words of encouragment. We just returned from the hospital doing our GTT and antibody testing. We should have some answers by Thursday or Friday of this week. I was very hopeful because I did the GTT readings on my glucometer: Fasting = 96, 30 minutes = 166, 60 minutes = 125, and 120 minutes = 113. This to me seems to be in the borderline range, and leads me to believe that she is still producing some insulin. I am not sure how many grams of sugar they gave her, because she only had to drink about 5 ounces of the orange drink. So, I am still very hopeful that it could possible be Type 2 or even maybe a pre-diabetic. I spoke to my friend who has a child with Type 1 diagnosed at age 4, and she told me that he had near normal results with his GTT, and it was not until the antibodies came back positive that the doctors made the official diagnosis.I don't know what to make of all this, and I feel like I have no control of anything right now. Am I in denile to think that maybe she has Type 2 or maybe even just pre-diabetic?Someone give me an opinion! We are still hoping for a miracle that maybe the doctor is wrong.",
            "post_id": "2435729",
            "timestamp": "1168063200",
            "votes": 0
        },
        {
            "answer": "I wish you the best of luck hun, but as a mother i would have to say to go with your gut feelings here.  If it looks like a duck, and quacks like a duck, then its 100% a duck.  I felt compelled to write this true little story just for you.  I am a mother of a 13yr old diabetic little girl.  Here's our story.  One week prior to Hurricane Katrina, my daughter called me to go get her at school because she wasnt feeling well. Of course, i went.  She slept on the sofa where i work all day long.  I thought she just wasnt getting enough sleep.  Also, 2 nights that week, she urinated in the bed while she slept.  I thought she had a bladder infection.  Things were so busy here getting ready for the fast approaching hurricane that she didnt get to see the doctor for the presumed bladder infection.  The night of the hurricane she threw up all night long.  Nerves-I chalked it up to nervousness from the scarey winds and sounds of the hurricane.  Two days later, throwing up on and off, no doctors in any near vacinity, no electricity, no cellphones, no nothing, and a no driving on any road after 7pm curfew, it happened.  She got up at 2am in the morning, drank 1/2 a gallon of water in 1 big gulp, and fell to the floor in convulsions.  Can't call 9-1-1 from the house phone, cellphones dont work, and its dark and dangerous outside.  I put her in my car and drove 100mph to the hospital.  I CARRIED her in and told the doctors that she had West Nile Virus.  Thats the only thing that made sense to me with all the mosquitoes around after the big storm.  Doctor ran blood work, told me her sugar was 750! He said that HAD to be a mistake!  Of course they did the whole test over again, only this time her blood glucose level was over 1000!!!!  We were sent straight to the Critical Care Unit for 3 days. ANd to top it all off, she was in Keacidosis.  ( If you don't know what that is, please look it up, it isnt pretty)You see, every symptom she had early on, i had an answer for.  I knew it, it was in my gut, but my heart denied it.  This poor child of mine was diagnosed at 11yrs old with Type 1 Diabetes.  Not that i laugh, but that year was a hell of a year for her.  She grew boobies, started mensing, turned 12, AND became a diabetic all the same month - WOW.  I just wanted you to know that you are NOT alone, and neither is your child.  Yes, i know i know, i KNOW, how it feels to \"PRAY\" at the meter everytime you take a reading.  Just remember this, trust your gut and dont find out the way i did, and for goodness sake, PLEASE do NOT make excuses for what your instincts tell you like i did. Denial is your biggest enemy, facing it head on, is a bunch of steps ahead from finding out the way i did! Good luck to you and your child. Lastly, please remember this, Diabetes wont stop her from doing anything that a normal little girl wants to do.  She can do ANYTHING and still be a diabetic.  My daughter does it ALL!  Good luck and thanks for listening to my story. Remember ~~QUAAAAAAAACK~~",
            "post_id": "2435734",
            "timestamp": "1168149600",
            "votes": 0
        },
        {
            "answer": "My dear charmaine:Your story made me think a whole hell of alot! I have had this gut feeling about my child since she was 3 years old. I always thought had the feeling that she was going to be the one I would have trouble with, and I have spoken to many people and every mother I have spoken too tells me the samething. If it is in your gut something is wrong 9 times out of 10 you will be right. People keep telling me to continue to think hopeful but not to think unreasonable. So, I have decided to wait and hope for the best and pray that we NEVER see the worst. My heart goes out to you, not only because your daughter had such a terrible time with getting her diagnosis. But, to have to deal with just the destruction of such a terrible storm like Hurricane Katrina.Thanks again for sharing your story with me, and hopefully we will get a definate diagnosis before this happens to us!",
            "post_id": "2435736",
            "timestamp": "1168149600",
            "votes": 0
        },
        {
            "answer": "Dear tie030369,Your very welcome! If there is anything I have learned this past year, its that while I may not be able to control my daughters fate where diabetes is concerned, I sure as heck have an advantage to be thankful for! Even though it feels like roulette sometimes, I know enough and have the equipment (her monitor and urine strips) to prevent her from being diagnosed under emergency conditions. The only downfall to this that I can see(besides not being able to stop whats happening to her) is merely watching it happen to her. I dont know how long it takes for diabetes to finally give way or if it will at all... it drives me batty each time I see her monitor reading above 200 mg/dl or below 70... but all the same, I savor the fact that she is still ok at this moment and even if it takes her body a while, she still returns to normal sugar readings. I hate that this is happening or appears to be happening rather... but I will love her and be there for her no matter what the outcome. In fact, I admit that this has drawn me to her in a more powerful way then I ever thought possible. I did not think I could possibly love my kids anymore then I loved them prior to finding this out.The best advice I can offer you at this time is to just hang on tight until you know something concrete. Dont deny yourself the right to feel validated but at the same time dont condemn your baby until you have to. Its a delicate balance and it takes a while to find it, I can attest to that! While the circumstances are not the best and I regret that we've met this way, I want you to know that I am very thankful that I've gotten to talk to someone else who has lived my own emotions. I've often thought of starting a support group for parents in this very situation... those of us who have a \"pre diabetic\" child or a child with auto-immune antibodies/ symptoms but no clinical diagnosis. Its only natural for us to worry and agonize over our kids, so please dont doubt yourself. Seeing the symptoms but not being able to do anything about it... honestly feels like torture.If you go into the archives you will find two threads about my daughters situation... they are titled;1) Hypoglycemic or diabetic symptoms in my 4 yr old daughter?2) Hypoglycemia and type 1 diabetic antibodies??... 5 yr old daughter... Please!!You can read about my daughters tests and her results in those threads, it might not help you other then letting you read someone elses story but I actually found that to be helpful to me personally. Its been a pretty hectic road for Allie but shes a little trooper and she loves her doctors, which really helps the situation. My daughters care is through the Endo department at the Childrens Hospital of Philadelphia so I am pretty confident in their assessment but still, none of this has been easy to swallow.To charmaine,Your story gives hope when hope is hard to find. Your a very strong person, always remember that! Hugs to you and yours!",
            "post_id": "2435747",
            "timestamp": "1168495200",
            "votes": 0
        },
        {
            "answer": "Dear Mom_of_4I have read the posts that you have had, and your story sounds so famillar. I am glad that we met, and it is nice to know that it is not all in my head. It is nice to know that I am not alone.Well, we did get some of the blood tests back. Dominique is negative for all three antibodies (GAD, insulin, and islet cell). I missed the phone call from the endocrinologist yesterday, which I had been  waiting for all day long. I am finding that if I control her diet by limiting the amount of carbs she eats. Her blood sugars are rather good staying in the mid 100's after eating.Something happened yesterday, and I was really confused. I have been counting her carbs and she is bringing her lunch to school. Well, she did not want to eat breakfast, but I forced her to eat 1 toast bread with butter, a piece of sausage, and 1/2 cup of milk. She really ate probably 1/2 of her food. Her blood sugar that morning, fasting, was 135. I was really not worried about her not eating much, because her fasting sugar was a little high. The teacher called and told me that she did not want to eat her lunch, and I packed her usually 50 to 60 carbs in lunch bag for lunch and snacks. She did not eat anything accept she had a bananna and drank her sugar-free cool-aid jammer. We have dancing, so our doctor said to check her before she goes. She was very cranky, irritable, and crying. She told me that her tummy hurts. Much to my suprise, when I checked her she was 77. I was confused, I think she was having a low because she really had not eaten that day. I forced her to drink a regular CapriSun (26 carbs) and gave her peanut butter cheese crackers. We went to dancing and she was still complaining of tummy ache. After dancing, she was starving and we went eat tacos. She ate 1 taco and drank a diet pepsi. She was out of control being very hyper, silly, active, and just out of control. When we got home we rechecked her and she was 178, which was about 4 hours after the low after school. I cant imagine how high she was after dancing. This is crazy! I really think that she definately has a insulin problem. I think that her body doesn't know how much insulin to produce. That is the only think I can think of to explain this.Tell me what you think.Thanks again for your input!Tie",
            "post_id": "2435752",
            "timestamp": "1168668000",
            "votes": 0
        },
        {
            "answer": "Hi again! Sorry its taken me eons to write back! I had a terrible toothache over the past few weeks and had to visit the tooth repair monster! Ack, I can not tell you how completely frightening the dentist is to me! Common sense says 'go fix your tooth before it gets too bad to simply fill'  ..... RIGHT, common sense flies through the door when it comes to dentists in my mind! lol  Four natural childbirths and I am deathly scared of a dentist... go figure! ~shrug~ ;-)As for your daughters sugar swings, I cant explain it half the time in my own daughter (so don't feel like your the only one) but I've heard it could be similar to a car backfiring. I think someone here used the term \"sputtering\" and I found that term to fit my daughters situation very precisely! It's like her pancreas is sputtering and I'm seeing it in her readings! I've asked our endo about this and he did tell me that its possible that the sugar swings we see are due to sudden surges of insulin (after a meal) or even due to short periods of pancreas inactivity. In our personal situation (being that my daughter is positive for all the antibodies) our endo told us that these swings in blood sugars possibly signify beta cell damage. If my daughter is indeed developing type 1, more and more beta cell damage will occur as time passes (more sugar swings and other related symptoms) until finally her pancreas stops developing insulin enough to where she's given a clinical diagnosis.I just got my daughters Dec 12th endo report the other day and again he states that she is an \"unusual and unique case\". He also said that she lost 1.5 lbs over the past 2 months, I'm not sure if this signifies anything important as far as \"weight loss\" being a symptom of diabetes or not but this is the first time she has lost weight at a check. He also said that her readings in the mid 200's are concerning but that she can not be treated with medication or insulin at this time and that she will remain under his close supervision.Being that your daughter has been given the diagnosis, I wonder if she is experiencing the 'honeymoon' stage? I don't know how the honeymoon stage works as far as other types of diabetes go (MODY etc), but I've read tons of research and articles on the honeymoon stage for type 1-ers. It can be a really really touchy, unpredictable time in your daughters condition if that's what she is dealing with?I don't know if you read here, but I've found this site to be extremely helpful as well!!http://www.childrenwithdiabetes.com/index_cwd.htm",
            "post_id": "2435782",
            "timestamp": "1169704800",
            "votes": 0
        }
    ],
    "post_id": "2431444",
    "question": "I am the mother of a 5yr old who had a respitory illness and asthma episode approx 6 weeks ago,and at that time she required both steroids & antibotics. Two weeks later she relapsed and had to be placed back on steroids for asthma. Well, this leads us to about 3 weeks ago, when I started to notice that she was drinking more, urinating on herself at night, and having cravings of bread, sweets, and anything with carbs. The red flag went up the day before Christmas, when she urinated on herself not only at night but also 2 times during the day. My mother in law works at the hospital, so we went there just to check her blood sugar which was 217 (random). I panicked! I went out and purchased a machine until we could talk to our family doctor. Her fasting blood sugars were 99 to 144 over the next few days with her random sugars being (2 hours after meal) 105 to 178. We did bring her to the doctor, and she suspects that she has diabetes. We did blood work and that confused me even more. Her fasting blood sugar was 92, and the same morning on our machine her sugar was 93 (which tells me that my machine is accurate). Her thyroid functions were normal, cholesterol was normal, and blood count was all normal. Her HgbA1C was 5.5, which falls in the normal range. We are still waiting for her C-Peptide level. I have a good relationship with our family doctor, and I respect her so much. I just have this feeling that there is something wrong with the picture, and I would want her to be checked by a pediatric endocrinologist. Can someone give me an opinion -- am I over-reacting?",
    "timestamp": "1167631200",
    "title": "5 year old with symptoms of diabetes"
}