{
    "answers": [
        {
            "answer": "I don't know but all I can tell you is my body CRAVES sugar day and night it's pathetic and disgusting and I can't stop.Someone accidentally took a sip of my coffee the other day and almost dropped it...the look on her face was priceless it was just so confused...but I can't help it.",
            "post_id": "672685",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Thanks for your reply.  That is very interesting because up until treatment I craved sugar like mad.  I mean, I left the grocery store with something sweet every single time I went in.  Now, I blow right past all the sweet stuff and can't wait to get to the cheese/nuts/chicken - you know, all the high protein stuff.  It's bizarre how our bodies react to this stuff!!!!",
            "post_id": "672686",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "It's got to be something like that.  I find that every month or so while I've been doing this it's a different \"craving\".  I go through the most bizarre spurts and I don't want to eat ANYTHING else!  Then after a while I get tired of that and HAVE TO HAVE something else. And again I want nothing else at all!It's horrible - it really can drive you crazy but...at least we are eating that is a good thing no matter WHAT IT IS~ :)",
            "post_id": "672687",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "I do not believe they have checked my levels,so I guess I'm not certain whether mine are high or low or what, but I sure don't feel right.  I did some searching last night for info about blood sugar levels and treatment but did not turn up anything pertinent.  Who knows?!  I keep telling myself that somehow it is a good thing and it must mean the tx is working :) lol I guess that is one way to make it through the days!",
            "post_id": "672691",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Diabetes can become a side effect of treatment.  Normally the liver dr will not automatically check your sugar levels on the regular scheduled lab tests, unless you tell him you think your having a problem.In many people after tx diabetes will stabilize and \"go away\" but for some it doesn't.  You can get a sugar glucose machine at Wal-Mart (I use the Rely On brand) for $10 and 100 testing strips for $40.  If you think your having a problem this early you should probably start checking your blood sugar levels.  Normal levels are between 90 - 120.  After you eat not over 180.  If your running higher than 120 first thing in the am you might have a problem and need to contact your GP.ScheringPlough's Commitment to Care website and TX side effets talk about sugar levels on TX.",
            "post_id": "672698",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Shortly before I started TX I was dx'ed with diabetes. I believe it (blood sugar wackiness)was due to the HCV. I've never been overweighth, not a drinker, all blood stuff (other than liver) in good shape. Blood sugar just real high.  Went on daily insulin ( I called my HCV diabetes 'adding insulin to injury'. Started tx and continued the insulin.  After about week 12 went to the endocrine guy who said that glucose level (AIC and other related) were all in normal range and to discontinue the insulin. At the same time the 12 wk pcr came as non-detect. My belief is that the HCV giveth and the clear pcr taketh away.  There is someone else here (new sojourn if I remember correctly) who had similar tale. Next time you get a rx for tx blood work ask your doc to add the 'A1C' test.  The results give you a blood sugar reading that is expressed as a number which reveals your blood sugar over the past 3 month span.  If you take the A1C when they do a CBC keep in mind it's a 'fasting' test. Go in the AM.",
            "post_id": "672699",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "The feeling you are getting could be your rbc lowering. It can leave you light headed and dizzy. The meds also make you feel that way, you may be due for a blood test to check all your levels. But a certain amount of this is normal.Eating is good, so I say whatever you can get down. Prior to tx I was put on a low animal protein diet due to enceptholophy, on tx I crave meat like crazy. My ammonia levels are now normal although I'm eating more meat. It just must be something my body needs right now.   Peace",
            "post_id": "672700",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "amommy- wow thanks for your nice thoughts. This forum does work. All of you helped me the other day. Sometimes, just putting things down into words and sharing it takes the bite out a little. Disperses the load a little too. The last couple of days I",
            "post_id": "672720",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "I have been learning a lot about insulin resistance, apparently it is common among hep c active people, I wonder if that is what you had and that's why once tx it cleared, interesting to say the least....",
            "post_id": "672754",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Wow, I'd say so.  You certainly got my attention.",
            "post_id": "672757",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "That's my belief. This is one of the situations in which I had a 4 wk pcr. I would have liked to track progression of tx with sugar and bp.  It seems almost like too much of a coincidence that normal sugar and virus free would get there so abruptly.  During tx my diet was good, just not much of it though due to lack of appetite.  Sometimes the favors that you are thankful for are not so small.",
            "post_id": "672760",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Although I don't think I have a problem in this area, I have gotten a lot out of this thread.  Lots of things to watch for with this insipid disease.  I seem to crave meats more than sugars lately too.NY girl - my husbands dad drinks his coffee and tea like that -- and he, like you is skinny.  Wow - I don't like picking up his glass by mistake.",
            "post_id": "672765",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "I found your story interesting.  My mother does have diabetes and so it is in my family, but I've always tested okay with my sugar levels.  Last May I was dx with hep c.  On July 20 I was at a friends house and she asked if she could test my sugar level.  It was 402.  In May it had still been at normal levels.It took me a little over two months of strict eating to bring it back down to normal levels.  Luckily I haven't had to go on meds for it (yet).  After I started tx I haven't been eating as strict as I should.  My first A1C was very good.  But I'm due for another this Fri and I'm a little scared it's going to be higher.  My liver dr said to keep a close eye on it cause the TX can cause sugar levels to raise.Did you see the study that said people with Hep C have a 60% or higher rate of Diabetes than the general public?  I wish I still had it.  I've always wondered if the Hep C didn't spike my levels this summer, but why would it choose that particular time to spike?  The dr never could give me an answer either.",
            "post_id": "672725",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Perhaps in time doctors will develope a HCV diet like diets that are geared toward people with other health issues. HCV mainly attacks the liver, with compromised liver function everything your body has to metabolize is compromised. Things you eat, meds, even odors(chemicals) are processed by the liver. Knowing this there has to be things we must avoid so we won't contribute to diabetes, heart disease, or anything else. Compromised liver function has also been known to contribute to high cholesterol levels, which leads to heart disease.It took me 25 years to get sick while drinking my weight in alcohol, those that catch it early will realize there are many things we can do to live a long healthy life. Whether you treat or not, or achieve SVR or not.    Peace",
            "post_id": "672729",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "The docs, with respect to the blood sugar, basically said - it happens to some with HCV. And mine was pre-tx.  My fear was that tx brought it down to normal people levels and that end of tx it would go back to pre-tx (bad levels). Six weeks post tx and sugar is good. See the endo in April when all this stuff is out of my system and hopefully in some state of balance (good balance).  Similar with high BP although still on BP meds but am now on the lower end of BP scale without high med dosage. Hope to get stome stability, without meds, there too.  Of course, could be the inevitable march of time on these 'ol bones.  These kinds of 'extra' impacts - aside from liver condition alone need to be in folks' minds as they decide what to do when dx'd with HCV.  It's not just about the liver.  When my average daily blood sugar was recorded at 380 (or so) doc freaked. He said 'you've got HCV, diabetes, high blood pressure. If you don't take care of 2 and 3 you may not have to worry about 1'. He got my attention.",
            "post_id": "672734",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Over 99 is outside of normal according to Quest Labs. The normal range is 65-99. A fasting glucose of 120 would be considered diabetic today or at best borderline. Post prandial (after meals) readings should ideally not get up to 180 according to very recent guidelines. The whole trend of the guidelines is downward. I read an article which stated that as glucose levels increase so too do cadiac events and that obtains even in the nondiabetic population. Sugar in the blood just ain't a good thing so watch it closely. Mike",
            "post_id": "672773",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Hey Veg, thanks for the props! although this stuff is pretty prevalent and well recieved information now, way back then it was practically unheard of....when I told conventional docs about small meals and reactive hypo stuff, they would look at me like I was bananas, well, I am bananas on other issues but that's beside the point...I just was happy to go to forward thinking integrative specialists way back then...Hey, as far as your hormone issues, this is another topic that has a lot of takes on it, by the medical establishment as well, I read a really good book on this, Uzzi Riess, yo can google it, they have it on Amazon...he's a big believer on natural bio-identical hormones...there are some women here who take them and there are different delivery methods...I for one would not do the patch, there were some articles on it fairly recently that had me concerned, I'd just punch in the type youre going to get in a yahoo or google search engine and you can read up on it...this hormonal issue is controversial, like hep, (aren't we just so darn lucky???) so it would be really good for you to educate yourself on it.they have every thing you could ever imagine on menopause, peri-menopause, HRT, PMS and every other darn acronym, symptoms, every kind of hormone, you name it. And they have a huge panel of experts that give chat talks there every week, with all of this info archived. You could just punch in your prescription in their search engine and you could hear a lot, pro and con. We'll be okay Veg....just educate yourself on these issues as much as you can, we need to do this as patients, as the docs all have different take so this, so we have to be able to navigate....",
            "post_id": "672780",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "yeah I agree, I have been \"goggling\" it all day, very controversial, one says it's okay, other says it's not....go figure  lol",
            "post_id": "672783",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Hi amommy, read your post with great interest. I have been a reactive hypoglycemic since the early-eighties (I think I contracted hep c in the late 70;s as a point of interest.) I have been through the ringer with this diagnosis. Many doctors have told me it is all in my head because my blood sugar readings on the glucose tolerance tests are in the normal range mostly, and I don't have diabetes (well, at least not yet knock wood.) There are different types of hypoglycemia (low blood sugar) the most common, \"diabetic hypoclycemia\" happens when your body doesn't make enough insulin on it's own, (insulin is a substance that lowers blood sugar in the blood because youre blood sugar is too high when youre diabetic) and you have to take oral or injectible insulin to make up for this, and you perhaps inject too much insulin (which lowers your blood sugar too much.) This is the diabetic kind of hypoglycemia.The kind I have, reactive hypoglycemia, is less common and only in these last few years has been widely recognized. Seems that illnesses that can't be tested through common testing don't acquire a lot of validity until enough docs themselves come down with it, and there are so many, many patients that complain of the exact same symptoms...that they can't just write it off as mass hysteria, although a lot of docs still do, belive me, I have felt the frustration of trying to ask docs what is wrong with me??? and getting blown off... I finally went to a \"integrative specialist\" a doc who has an MD but still utilized alternative methods. He asked me to fill out a questionarre with what I eat for 3 weeks on it, and what times I eat it. When he looked at it he said, \"Says you don't even eat your first meal till the afternoon.\" I said, yeah, if I eat breakfast I get fat. He told me, \"well, youre gaining weight so easily because you put your body through a mini starvation, if you eat 6 or 7 small nutritional meals a day, you'll actually keep your weight down, and your panic attacks will go. Youre a reactive hypoglycemic.\"Well, I followed his advice even though it was soooo counter intuitive, and low and behold, my panic attacks were gone, 2 years of torture gone in a few weeks, and I could keep my weight down easily. This is one reason why I have a lot of faith in many integrative specialists, many are able to think outside of the box because they just don't blindly follow conventional medical doctrine. I paid big, big money to go to 3 Beverly Hills \"specialists\" over a years time and this guy is the only one that diagnosed me and helped me, without just handing me a bunch of valium. Many docs just have a \"pill for every ill\" type of treatment method.Now he also told me to stay away from sweets, simple sugars, and even keep my fruit down a little because of it's high sugar content, even though fruit is much better than simple sugar. To concentrate on veggies, etc. Eat a certain amount of carbs with a little protein, especially before and after I exercise (exercise can bring your sugar levels lower) and this has been my life since then. (A good snack is a multi-grain cracker with almond or peanut butter with a V-8 or some other kind of veggie juice, this can count as a meal.) Sometimes I forget to eat cause I'm so wrapped up in something, and pow, I get it, the feeling like I'm going to lose it, the shakes even if it goes too long without eating, all the symptoms of panic. Then I eat some protein, maybe nuts with a piece of goat cheese, or a meal, and I'm fine, I get this feeling of well being again.Now, what does cause me alarm is this thing I've read in the lit for these tx drugs. One thing it says that it can cause diabetes \"and\" hypoglycemia (opposite conditions though flip sides of the coin for some.) One woman I spoke to said she was like me, she had hypoglycemia for years, and once she went on the drugs, it lifted and she didn't have to eat as often and didn't get the shakes when she didn't, even though she still kept to the 6 meal a day thing. (Of course I'm hoping that happens to me.) Then others who say like you, that they develop hypoglycemia while on the drugs. This has me very, very concered, I don't see how I could handle being any more hypoglycemic than I am now. I know everyone is different, and it makes sense that their are blood sugar issues with the liver being the general of the hormones and pancreas.Also, it seems on my hormonal days on the first of the month, that my hypoglycemia gets even worse, so it seems to be tied in with menopausal issues with me as well. On these hep c flare-ups my hypoglycemia gets a little worse too, so I do have reason to believe it's tied in with the hep, it's anyone's guess, because the docs can only tell me so much, this area is not really studied like it should be. So I probably confused you more then answered any questions, but here is a good article on this...http://diabetes.niddk.nih.gov/dm/pubs/hypoglycemia/there are also many good books on hypoglycemic diets (which are just foods that everyone should eat but prob don't, ha ha. As I said, for optimum good health, everyone should eat smaller, healther meals more frequently to keep your blood sugar levels constant.) Hope this helps...Stator, once again I was blown away with your sense of metaphor and description, I really think your metaphor for \"getting spritual\" (with the little boy on the beach) is publishable. (I'm an editor/writer of sorts, so I think I have some knowledge on this, though little.) Please write these things down (maybe even register that particular one so no one else could use it, it's easy, you just send it to the writer's guild to register it),  apart from here, though we all enjoy them too I'm sure  along with your other musings. Even if it doesn't get published, and you never know, I think you should be keeping these for posterity....",
            "post_id": "672776",
            "timestamp": "1138687200",
            "votes": 0
        },
        {
            "answer": "Angie gave me the advice of eating smaller meals a few hours apart several months ago and I have to say it was great advice...I have been doing it ever since and I feel a lot better, I have an appointment with a dietician in a few weeks to discuss many things about proper diet and one of the things I will get input on is the \"4C's guide to nutrition advice\"  If it gets the gold seal of approval I think Angie should do a weekly thread on MH regarding nutrition, so many could benefit by it, don't you all think?*slim dip*",
            "post_id": "672777",
            "timestamp": "1138687200",
            "votes": 0
        }
    ],
    "post_id": "579308",
    "question": "Hope everyone is feeling well today!I have a question, and I hope some of you have some experience with this!  I am going to be doing shot 6 on Thursday.  For the past week or so, my blood sugar levels are really wacked out.  Now, I don't actually check it because I have never had a problem, but I can tell.  If I don't get up in the morning and eat protein immediately, it's like I can't recover for the rest of the day.  My body is craving protein like crazy.  The other day, I was in the car, it had only been 2 hours since I had eaten, and I literally felt like I was going to pass out.  So, I guess my question is, is this normal/common on treatment?  Or is this perhaps not related to tx at all and just another thing to add to the list?  Just looking for a little insight.  I realize that it is a matter of opinion :) Thanks for any thoughts :)Strator- thanks for your post the other day re:emotions/faith.  I hate to see anyone struggle on this tx.  You are such a wonderful person, and it is so thoughtful of you to share such important details about your journey through this tx.  Thanks for making a difference in my journey.  I have ALWAYS been someone who struggles with faith and you gave me reason to pause and reflect a bit.  I came out feeling a bit stronger :)",
    "timestamp": "1138687200",
    "title": "blood sugar levels?/strator"
}