{
    "answers": [
        {
            "answer": "Dear Hollywood,I am not sure you are going to get the answer that you are looking for here either.  We at Medhelp are not medical professionals, and I do not have any personal knowledge of Ecstasy to share with you (and for that I am grateful).  Because of your diabetes, you are more prone to high blood pressure, thyroid problems, blindness, neuropathy and amputation due to poor blood glucose control, so why you would want to ingest a substance that could impair you from making good judgement calls when it comes to taking care of yourself is beyond me. I wonder why, if you have over educated yourself on what Ecstasy does to non-diabetics, you would even consider taking it.  I wish you good luck on making the right choice.",
            "post_id": "2430381",
            "timestamp": "1128142800",
            "votes": 0
        },
        {
            "answer": "The first line should have read: I have a simple question that I am having problems finding out the answer to without getting a \"just don't do it\" answer.",
            "post_id": "2434629",
            "timestamp": "1128142800",
            "votes": 0
        },
        {
            "answer": "ALthough I don't support anyone's use of Ecstacy, I do understand that some folks like to take risks and will do this drug regardless of what common sense tells them.  I'd like to take a different approach with you -- if your goal is to enjoy a more exciting & satisfying sex life, you surely don't need a crutch like Ecstasy.There are many safe and creative ways to get a bit \"more\" out of a normal, healthy sex life.  For centuries -- dating back to the 4th century BC(!), Kama Sutra has provided a wealth of information on the subject.  Before you leap to drugs, consider this rich alternative -- all the fun, all the pleasure, with none of the risk!  It's worked for over 2000 years, being handed down thru the generations.You can find many books on the subject -- most illustrated -- at bookstores or online bookstores.  Since you asked, tho', here is some information about Ecstasy too: http://www.nida.nih.gov/Infofacts/ecstasy.html",
            "post_id": "2434632",
            "timestamp": "1128142800",
            "votes": 0
        },
        {
            "answer": "Hi Hollywood,I don't know if you have other health issues, but there's no reason that having a drink once or twice a year would be any worse than taking Ecstasy a couple times a year!My husband has been Type 1 for over 15 years and he has a beer with dinner several times a week. In fact, we just returned from a Beer Tasting event in Denver. He checks is bs and adjusts his insulin as needed. He has excellent control and his Ha1c is always below 7. So, it can be done safely.Of course, I'm not advocating that everyone who is diabetic go ahead and drink! As long as it's in moderation, it can be controlled.I'd think that would be safer for you than Ecstasy.",
            "post_id": "2434635",
            "timestamp": "1128315600",
            "votes": 0
        },
        {
            "answer": "Dear Hollywood5150,I am not a doctor and can't give you medical advice, but I have researched ecstasy in the past. My knowledge comes from my son attending raves or club's in his past and his understanding that this is something very dangerous for him. We were lucky he decided to not try it.It can cause dehydration, which can bring on heart failure with anyone, not to mention someone with type 1.I would also like to bring up the issue that when you try a street drug you never know the substance's that are included. The damage can be be lasting or fatal.As an adult in your 30's, I truly hope you think about this. You also need to protect your kidney's (and this is another concern).I do wish you the best and would like to hear back from you.dm",
            "post_id": "2434636",
            "timestamp": "1128402000",
            "votes": 0
        },
        {
            "answer": "Dear Hollywood,I too am not a medical professional, however, I am a \"surviving mom\" who lost her diabetic son at the age of 33 to complications of type 1 diabetes two years ago.  When we were told my son was in end stage organ failure (heart and kidneys) we were also told that my son's drug use had \"sped up\" his complications from his diabetes three fold.  As a mom who is still hurting very much I would like to remind you that your life is very valuable to everyone, but most especially to your family.  Please make wise choices to protect yourself.  Your life does matter and I care.",
            "post_id": "2434650",
            "timestamp": "1129006800",
            "votes": 0
        },
        {
            "answer": "hi. now, i would like to actually address the original comment slash question posted. i myself have in the past done e and certainly survived. the simple key is start slow!!!! always have a water bottle and a coke with you and drink it constantly. this will aid in keeping your blood sugars up, as when you are high, you sometimes will not notice when you are going low. if you have any allergies then consult someone first, you may even talk to your pharmacist. mine helped me in the past. i am not fooling around with e now, but admittadly always had fun when i did. k, i no that the admin people on this site might not like this letter, i'm sorry. but i would rather you are safe and educated than just deciding to **** around. cheers!!!",
            "post_id": "2434700",
            "timestamp": "1130997600",
            "votes": 0
        },
        {
            "answer": "Dear Crazyclimber,There is absolutely nothing safe about the drug ecstacy.  Providing a means for someone to compromise their health is disrespectful in the least.  I cannot be diplomatic about this topic.  I've lost and have had to learn the hardest way possible that life is far too precious to waste.  This is a harsh reality, but I care alot about diabetics and their well being.",
            "post_id": "2434701",
            "timestamp": "1130997600",
            "votes": 0
        },
        {
            "answer": "Well... lets see... I've done it once, it was either ecstacy or speed but its pretty much the same thing and it was at a festival in québec city where I didn't sleep all night and when I decided to get some sleep the day after at 7 o clock, it took me 10 minutes to go into a severe low blood sugar and so quickly that I couldn't wake up due to the fact that I was so tired and my mother found me in my bed dying and making unconscious and deranged calls in seek of help... you can try it if you want but to me it's a 50/50 chance it works out well because I did it once before this time and it worked well, but since that last time I'm NEVER doing it again....ecstacy accelerates the nervous system which requires sugar...it takes 10 minutes in sleep for you to come close to death, make SURE that if you do this **** that your gonna have some people watching over you because if it wasn't for my mother finding me dying in my room I'd be dead, and I'm sick of her bringing that topic up saying that she was so tromatised and etc... so really if you wanna know more about this just msg me or some...",
            "post_id": "3908071",
            "timestamp": "1232731263",
            "votes": 0
        },
        {
            "answer": "I'm type 1 diabetic and tried E last night. my blood sugar was about 250 when i took the pill, then i checked my blood about 1 time every 40 min-1 hour. my blood stayed at about the same level, untill the end when it shot up to 300, then i was just able to give myself a shot (it dosent hurt). however later on after i went to sleep at about 5 a.m. i woke up with slightly low blood sugar, and had 2 boxes of apple juice.all in all it isnt too dangerous, i set alarms on my phone plus my friends were there (sober) to remind me to \"test\".ALSO!!!! YOU CAN\"T EAT ANYTHING!!!!!! if you do you throw-up / gag...... so if your going low you should sip on juice or sugar water. something without bubbles. dont try and drink it all at once. just 2 sips every minute or so.",
            "post_id": "5032637",
            "timestamp": "1257006838",
            "votes": 0
        },
        {
            "answer": "Sorry, don't get it. Is it worth it? Why do you want to risk it that bad? I almost lost my son 3 weeks ago from a heart attack and all he had was one of those energizer drinks. He had palpitations of 230 and blood pressure of 50. That was just caffeine, I can't imagine what could happen if he takes that drug. Thank God he's a smart guy and he's taking care of himself. Do you have anybody that cares about you, a partner, children? Why would you make them suffer if something that you have control of happens to you?I'm not judging you, just trying to understand. God bless, take care.",
            "post_id": "5034328",
            "timestamp": "1257067969",
            "votes": 0
        },
        {
            "answer": "Hey, So I have type I diabetes, and I like to drink. I do it fairly often, and in moderation. Sometimes, I like to get wasted like everybody else. and I keep water bottles with me to stay hydrated and my glucometer and Insulin to use as needed and im fine. try having a drink instead of taking mind-altering drugs.",
            "post_id": "5043369",
            "timestamp": "1257295296",
            "votes": 0
        },
        {
            "answer": "I totally agree with the fact that drinking and taking ecstasy probably have about the same risk levels when associated with Type 1 Diabetes...I am a Type1 and I can tell you that both rarely produce adverse affects on blood sugar if they are taken with care and understanding of how blood sugar WILL react while taking part in such activities..With drinking, be sure to eat something beforehand.. or if you don't be sure to snack at the bar, separate drinks with water, and drink one or two of your drinks without diet or soda.. tonic has about the same calories as a full-sugar soda. I drink vodka-soda with half soda/half sprite. Also.. If I drink.. I always make sure to take my night insulin and have a good bit to eat without fast acting insulin and some good hydration before passing out.. I always play it safe and make sure I'm close to 180ish before going to bed as sugars may continue to drop overnight. It isn't surprising for me to go to bed with a bg of 230 and wake up in the high 70s and low 80s..Treat ecstasy the same way you would if you weren't diabetic. Be sure to keep hydrated. Make sure you test often.. because the high may cause you to be unresponsive to lows or not recognize them as easily. Finally, be sure to take your night insulin, drink some water and sleep as long as necessary to feel rested afterward.As with any recreation, precede with care and have a great understanding on BG. It baffles me the people that have this disease and don't fully understand it. I could not live with this and not know as much as I can about it. And once you figure out YOUR diabetes.. it's cake. Just another routine with meals and at bedtime.Good luck in your mischief! :)",
            "post_id": "5222635",
            "timestamp": "1262319209",
            "votes": 0
        },
        {
            "answer": "JDRF-Team-gg - your lack of education on MDMA is astounding, as is your willingness to speak without knowing what the heck you're talking about.  The original poster was not asking for a blind \"dont do drugs\" response.  Its clear based on what you've written that you've done little or no research on MDMA, nor its safety profile, nor its benefits, nor the purpose of its use.  You are grossly undereducated, and as such, you really should not be commenting.The original poster, based on the content of his post, is clearly educated on MDMA and its responsible and safe use.  He was asking for any issues tied to diabetes and the MDMA itself, and / or the effects of serotonin depletion on the system of someone with an ongoing diabetic condition.  Your clueless reaction that its simply \"bad\" is more dangerous than having said nothing at all.  The total MDMA experience is a whopping 4 hours, and MDMA has been routinely administered in clinical settings for years by doctors and psychotherapists for the treatment of numerous conditions.  Its clear to me you have no knowledge of this, and blindly associate MDMA with dangerous drugs such as Heroin or Meth.  MDMA does not impair ones ability to judgment enough to cause any adverse effects even remotely related to an ongoing Diabetic condition.The only thing in your response that even comes close to being helpful was the topic of high blood pressure, as MDMA does increase this.  However I am not sure its significant enough to be of any concern to an ongoing Diabetic condition during such a miniscule 4 hour window.  In the future, if you haven't done sufficient research on a topic, please DONT speak.",
            "post_id": "5826320",
            "timestamp": "1277252623",
            "votes": 0
        },
        {
            "answer": "EFFECTS OF MDMA ON TYPE 1 DIABETICSsimply it will raise your blood sugar.Im going to skip the just dont do it cause its just like abstinence only sex ed..(aka not educating at all)...IM NOT a doctor. nor do i advocate using any statement as basis for any decision - health or otherwiseby reading any of this you are agreeing not to hold my words accountable for ANYTHING...that being saidi am a type 1 diabetic.NONE OF THIS IS SCIENTIFIC PROOFit is simply my thoughts to why my body actsand when i was younger i used mdma alot..not proud of it..between the other diabetics who used, doctors ive spoken with, and the endless forums ive been on. of research groups and medical research ive read throughnot proud of it.Im currently a Scientist with bachlor and i advocate the spread of informationwhen i became diabetic i decided to use it to spread education on diabetiesthis is perhaps a darker side of that pledge but iand i haveno i do not advocate taking ecstasy and especially as a type 1diabeticbut i am a type 1 diabetic with an a1c of 6.9(and i can relate to all feelings of \"im human and not perfect\"--this is the part you are most likely looking for--PHYSICAL effects heres the big part:mdma is an amphetamine and as such speeds up your body. meth, coke, mdma, these all increase your heart rate.as such they are also increasing other body functionsthe one most important to diabetics is your liver.remember how if you dont eat and dont get insulin over say a day, your BG will still rise? thats the reaosn for a basal rate if youre on a pump. its the reason for longterm insulin such as lantiswell thats because your liver outputs small amounts of sugar ALL DAY.well when your on any upper..this is increased as your liver is acting faster.SO MDMA WILL RAISE YOUR BLOOD SUGARbut not from the drug itself..from how it acts on your body(by speeding up your liver.this is also the explanation to why alchohol LOWERS your BGbecause your liver processes alchohol and while it is doing so it stops the output of this sugar.so when you get basal insulin or lantis to counteract liver sugar, the sugar is not there and you crash from the insulin you shouldnt have taken for it.to counter act the effects of alochol you should dorp your basil rate or eat something before drinkingto counter the effects of mdma you should increase your basal just a tad or honestly..just test often.as for drinking and mdma at the same time...well i swore by it...moderation key.by your body processing alchohol your liver isnt producing the sugar...so the increase form mdma of energy instead is processing the alchohol faster..itll never \"cancel out\" but it will atleast dampen change in bg strictly due to drugs/alchohol--------im also offened by a few of the commentators here...how is dont do it educating someone or helping this problem?the man is 30...lets not treat him as a child.directed towards the person saying \"why you would alter your ability to make correct judgement calls on your diabetes\"..you dont. and heres a few reasons why:unlike alchohol, when you take MDMA, it itself doesnt alter your state of mind. it releases your own serotonin...a LARGE amount of it..a chemical that your brain releases all day every day. you just break open a dam to your reserves.ecstasy effects on diabetics (non physically)you CAN still make the same judgement calls while on ecstasy.ecstasy also isnt done just to have a better sex life, thats a misnomer...(if you used it to do that..it be the same as trying to get your partner drunk before having sex..which unless your partner is ok with this long before you get intoxicated its more or less the same as date rape with alchohol)ecstasy brings your emotional and pshcological walls down..ecstasy would encourage you to be more open about anything involving yourself..including your diabetes if you are shy about it.imagine taking someone your really close with.now imagine being with someone who youre not as close with...imagine feeling as safe and trusting with the ladder.nowhere in tha feeling do you feel like you shouldnt be yourself.and if yourself is a disciplined diabetic that wont change.",
            "post_id": "6035775",
            "timestamp": "1282025583",
            "votes": 0
        },
        {
            "answer": "From what I've found with MDMA at raves with all the dancing and drinking, the best thing to do as before any physical exercise, eat high carbohydrate meals, any starchy foods like pasta or lots of potatoes, even chinese and pizza.  With those type of foods, as you should know as a diabetic, you can give yourself the required amount of insulin (i'm on a pump, so I just count carbs) but in another hour or two you find that your blood sugar is high, right?  So for raves when I take MDMA I will eat pasta, rice, etc. and just continue to drink sugary drinks as long as I'm continually dancing and moving around.With Mushrooms and pot I have yet to have an issue with my diabetes.  With mushrooms I am pretty constant with BG testing to make sure it's not going up or down.  I try to keep it around 10-12 (sorry, I'm Canadian). With weed I'm pretty slack.  That does **** all to your body in a diabetic sense.",
            "post_id": "6863878",
            "timestamp": "1304012272",
            "votes": 0
        },
        {
            "answer": "It seems a lot of the people that have commented here are strictly against drugs which is fair enough, they are entitled to their opinion but they don't really help you or answer your question (sorry guys).First of all I would recommend taking MDMA in powder form rather than a pill as it is more likely to be what you've paid for. Second as above stated, start slow and just don't be stupid with it. Check your glucose levels regularly and have a sugary snack or drink.I'm type 1 as well and have done MDMA a couple of times and it's fine as long as it's done in moderation (I'm not saying its not bad for you but its very rarely fatal).But at the end of the day it's your choice and all I can say is; enjoy your self man and live your life how you feel is fit :)",
            "post_id": "7224756",
            "timestamp": "1315578867",
            "votes": 0
        },
        {
            "answer": "MDMA raises your Blood Glucose levels. If your blood sugar levels are not well managed, taking the drug could send you into DKA (Diabetic Ketoacidosis), which requires hospitalization. Taking the drug and dancing dehydrates you, making you more susceptible to DKA. Vomiting and stomach pain is a symptom of DKA. The more you vomit, the less you are able to control your BG levels and you require sick day management. After a bout with DKA, your BG levels do wild swings, making testing like nailing jello to a wall. DKA can kill a diabetic - and in the best case scenario, it can make you feel like crap and rack up huge hospital and ambulance bills. Alcohol and MDMA makes the jello analogy even worse. There are so many things you can experience in life without risking your life - if your child was a diabetic, would you want them to take a risk that could potentially kill them if it wasn't necessary? I don't think so. Don't take the chance. Accept that diabetes is a disease that can manifest itself in many different ways - put those negative aspects can be prevented. You are not immortal and never will be. You can try to be at age 30, but you probably won't make it to 60. Bag the MDMA and go climb a mountain or sky dive - the risk is much less.",
            "post_id": "9454360",
            "timestamp": "1378353323",
            "votes": 0
        },
        {
            "answer": "are you kidding me??? \"try having a 'drink' instead of mind altering drugs.\"Do you research please, alcohol is the ultimate mind altering drug, robbing you of your decision making capabilities and collectively doing more harm than any other drug on the planet...yes MDMA can affect you as well but I have tried both, done years of research and self education, and I find it ignorant and offensive for you to act like alcohol isn't a mind altering drug.  The negatives of alcohol on the nervous system and conscious mind are tenfold to any other \"mind-altering drug\" such as LSD, Psilocybin, MDMA, THC.  Real MDMA is not as bad for you as people think...millions of people have tried it and only hundreds have died...how many people were killed by alcohol last year??? I would venture to say last MONTH more people died from alcohol than people died from THC, MDMA, LSD, Psiloybin combined.  Educate yourselves people.  I do truly feel for those that have lost a loved one because of a drug...ESPECIALLY alcohol since my alcoholic grandfather killed himself 20 years ago.  These other conscious expanding drugs can be beautiful if used in moderation.  I don't believe the nature of the addiction of alcohol allows for a positive affect from any amount.",
            "post_id": "9514896",
            "timestamp": "1380175820",
            "votes": 0
        }
    ],
    "post_id": "2430380",
    "question": "I have a simple question that I am having problems finding out the answer to without getting a \"just do do it\" answer.  What I want to know is are there any adverse effects on taking MDMA (Ecstasy) for type 1 diabetics?As an adult in my 30's I know all about what MDMA does to normal people.  The fact of the matter is I'm over educated on the topic.  It's something myself and a partner might use once or twice a year once or twice a year given that drinking is completely out of the question.  Are there any specific risks beyond the normal ones associated with the drug for type 1 diabetics?",
    "timestamp": "1128142800",
    "title": "Diabetes and Ecstasy"
}