{
    "answers": [
        {
            "answer": "I may be an old lady with diabetes (53) but I also know what it is like to be a teenager with diabetes and have to figure out how to be with my friends and take care of myself too. I was 13 when I was diagnosed.First of all, I am really proud of you for even asking and for trying to figure out how to live your life the way you want to and take care of your diabetes, too.  it's not always an easy balance.  The fact that you are asking the questions means that you are a responsible kid and that means a lot.The big problem with marijuana is, that like alcohol, it loosens up your inhibitions and your judgement, so it's hard to keep track of all the things you need to keep track of when you have diabetes if you are high.  Marijuana also tends to make people hungry and they want to eat junk. If your judgement isn't so great, it's easy to say \"what's one litle binge\" and that can really be a set-up for trouble with high blood sugars or even low ones if you are not paying attention.  Someetimes, marijuana can also be mixed with other drugs and that can be really dangerous since you don't know how you will react unitl it's too late. Truthfully, we don't really know much about how marijuana affects your brain, with or without diabetes.  We do know that it is a mind altering drug and that is something that should make you think twice before using it, particularly because we all need all the brain cells we can get to deal with this high maintenance disease we have.I guess my other concern for you is that you are still only 15 and with or without diabetes, that is a little young to messing around with drugs.  Not only is your brain not fully developed, but you may not have enough life experience to know how to handle certain situations you might find yourself in when using drugs or alcohol.  I would say, if your feel you must try it, to at least wait a few years until you have a better sense of yourself, and a little more maturity.If you do decide to try marijuana, make sure you are with people you trust, who know you have diabetes and who know what to do in case you should get into any kind of trouble.  This is really the same advice I give to my teenage daughter, even though she does not have diabetes.  I would also encourage you to find friends who are OK with you being with them even if you don't smoke or drink and they do.  You can still have as much fun as long as you are with people who like you and don't care what you do or don't do.  Once you learn to drive, you can always offer to be the designated driver which your friends will really appreciate.  You can always use the excuse that you have diabetes and can't participate, but you'll be happy to make sure they are OK.I know it's tough to say no, and to not be doing what you think everyone else is doing. That is really the most important thing that all of us have to learn in life...to figure out what is best for us regardless of what everyone else thinks we should be doing.  There are plenty of kids out there who are not doing any drugs and alcohol, there are plenty of kids who drink in moderation and there are plenty of kids who drink and do drugs until they don't know who and where they are.  Life is full of choices and you already have lots of experience in making healthy choices for yourself and I know you can deal with these choices too.Lots of luck to you.  Please stay safe and I wish you a long and healthy life ahead.ES",
            "post_id": "2430176",
            "timestamp": "1120712400",
            "votes": 0
        },
        {
            "answer": "Marijuana will not affect your blood sugar level.  However, when you alter your consciousness, it might make it easier to forget to check your blood, forget and leave some item behind, etc.   Therefore, you should wait until you are 18 first.Drinking alcohol does not affect your blood sugar UNLESS your drink contains something sugary like fruit juice or soda.   Drinking alcohol without sugary ingredients will put a hold on your blood sugar level.  Therefore I never drink alcholic beverages if my blood sugar level is above 120 mg/dL or below 80 mg/dL.",
            "post_id": "2434412",
            "timestamp": "1120885200",
            "votes": 0
        },
        {
            "answer": "By now, you've probably attended that party and made your choice as to whether to use marijuana, alcohol and other things.  It's a tough time to be growing up thru teen years; there is so much casual drug & alcohol use, it's easy for young people to think it's both normal & okay.Marijuana, by itself, will not affect your blood sugar.  As a mind-altering substance, however (as Mr. Gatorade points out), it can make folks more susceptible to give in to temptations & to succumb to the powers of suggestion.  Many folks \"get the munchies\" (at least that's what we called it in my college days) and think they're hungry for everything and anything in sight.  For a diabetic, this can be very serious.The double-whammy for using drugs & alcohol in a teen setting where typically a goal is to \"get wasted\" is that there'll be no one around who will care or will be capable to help you if your BG crashes or gets so high you can't function well.Alcohol without sugary mixers can cause severe lows, and because the liver is busy cleaning the toxin (alcohol) out of the system, it DOES NOT work well to release glycogen as it normally does.  This can make a low extemely dangerous.It's unfortunate that so many teens feel pressure to fit in by drinking or using drugs.  You sound like a sensible young person and I hope you gradually migrate to the great circles of folks who do healthier things and still have a great time, laugh a lot and are not frightened to \"get caught\" by what they're doing.  Good luck.",
            "post_id": "2434416",
            "timestamp": "1120971600",
            "votes": 0
        },
        {
            "answer": "One reason not to do it--it is against the law.",
            "post_id": "2434417",
            "timestamp": "1121058000",
            "votes": 0
        },
        {
            "answer": "well sorry for reposting so late but i didnt do any drugs this weekend. i was just posting to find out if marijuana effected a diabetic differantly then some1 else more because i was curious. i have never taken drugs or drank alcohol. i manage my diabetes well with excersize and through my insulin pump. i dont plan to do any drugs or drink alcohol in the neer future so you guys dont have to fret for me. my mom is an EMT and i have seen the effects that lots of alcohol can do to a person but ive never heard of what marijuana +does to one. thanks for the info guys it helped ;-)",
            "post_id": "2434460",
            "timestamp": "1121835600",
            "votes": 0
        },
        {
            "answer": "i'm a college student, and i was diagnosed w/ type 1 when i was 14.  i was randomly surfing the web on the topic, and i figured i should share my experience.  i've found that when i drink alcohol, about 5 hours or so afterwards my sugar drops really low, like around 40 depending on how much i've had, so i HIGHLY recommend carrying something sugary around w/ you if you drink.  as for smoking marijuana, i'm still not sure if there's a pattern, but you do tend to get hungry and eat when you're high.  so, if you decide to do that, just remember to take care of yourself and always carry around like a juice box or coke or something, cuz it can hit you really quickly.  the worst part is that when you are in an \"altered state\", you tend not to be so aware of your sugar levels changing, so you need to be prepared before you go out.  of course, don't do anything illegal ;-)",
            "post_id": "2434478",
            "timestamp": "1122267600",
            "votes": 0
        },
        {
            "answer": "lol yea i always do carry arond 2 juices and a snack just in case.....also my shot if my pump doesnt work and a bunch of life savers lol so dont worry, im controlled",
            "post_id": "2434486",
            "timestamp": "1122613200",
            "votes": 0
        },
        {
            "answer": "greetings in the name of the MOST HIGH, i am a 29 year old black male and i've been smoking marijuana for 10 years now. when i was 27, i was on a 1 year probation( driving on a suspended license). I refrained from smoking marijuana for 6 months then i found myself urinating frequently at night, like every 20 minutes or so through out the night. my mother took me to the hospital (upon my refusal) there i was diagnosed with type 1 diabetes ( my mom has it also). I spent a week in the hospital and was told that i would have to take insulin. well being on probation i couldn't smoke (that changed because i violated probation). one month after being diagnosed, I started smoking marijuana again and never took insulin. for the past 2 years (from 27-29) i never took one shot of insulin. I just smoke herbs twice a day. in my honest opinion, marijuana is a great cure for taking insulin. I don't get the munchies, don't feel tired or get the giggles or any of that stereotypical stuff that goes along with marijuana. I feel alot of people would say smoking herbs is bad because if they told the people the truth then there would be no need for \"America's Drugs and Cure's\". My point is, if you have diabetes (as well as other sicknesses) marijuana is the cure. Everyone with diabetes knows what can happen if you don't take insulin. for 2 years after being diagnosed, i'm as fine as ever. The only thing i have to work on now is excercising and loseing weight(i'm like 160 pounds over weight) i don't attribute that to herbs either, i've been big from the age 11. but that's another topic.....my brothers and sisters with diabetes....marijuana is the cure.......................peace and blessings to all in the name of our lord and saviour....YESUS KRISTOS.....one love to all",
            "post_id": "2434501",
            "timestamp": "1123909200",
            "votes": 0
        },
        {
            "answer": "Hello everyone,While kebranegast is certainly entitled to his opinion, as one of the moderators in this forum with many years of experience with type 1 diabetes, I am compelled to jump in and tell anyone who may take his post to heart that type 1 diabetes can in no way be cured by marijuanna. It is a medical fact that with type 1 the beta cells are destroyed in the pancreas and require insulin to sustain your lives. Marijuanna can't cure it.While I know that all of our posters and readers already know this, I would hate anyone to think that this is a possible solution. Without insulin, people with type 1 diabetes cannot survive.JDRF is committed to finding a true cure, but this is not it.Sincerely,dm",
            "post_id": "2434502",
            "timestamp": "1123909200",
            "votes": 0
        },
        {
            "answer": "greetings in the name of THE MOST HIGH, well even though my last statement is my opinion, i am living proof that marijuana does help people with diabetes. As i've stated before, everyone with type 1 diabetes knows what would happen if you don't take your insulin. I've been diagnosed with diabetes at the age of 27, as a-matter-a-fact, when i went into the hospital(again, upon my refusal) the doctors told me that i could've died. They even told me that i would have to take insulin. Not taking insulin could result in my death. Again i have NOT taken insulin in the last 2 years, all i do is smoke marijuana, maybe this does not work for EVERYONE with type 1 diabetes but it sure does work for ME. If it didn't, I would be or should be dead by now, I'M ALIVE and WELL. No insulin just marijuana. I AM LIVING PROOF THAT SMOKING MARIJUANA DOES WORK. It's safe to say that either marijuana is working for me or the doctors lied to me by saying that i do have type 1 diabetes and gave me an 80 thiusand dollar hospital bill. Marijuana is also not addictive because when i was on probation (driving on a suspended license) I never felt the urge to smoke marijuana and it's also NOT a gateway drug. I dont smoke or ever have the intentions of smoking cigaretts or doing any drugs whatsoever....all i do is smoke marijuana 2 or 3 blunts a day. so once again, smoking marijuana DOES WORK FOR ME IN PLACE OF INSULIN....TO EACH HIS/HER OWN.... PEACE and LOVE in the name of our LORD and SAVIOUR.....YESUS KRISTOS",
            "post_id": "2434505",
            "timestamp": "1123995600",
            "votes": 0
        },
        {
            "answer": "Greetings in the name of THE MOST HIGH. I just wanted to add to this message board that in no way do i condone teenagers smoking marijuana(or anything for that matter). In the case of teenagers, i recommend the insulin. This is not to say that there is something wrong with marijuana, I just think it sould be used by ADULTS 18+........PEACE and LOVE in the name of our LORD and SAVIOUR........ YESUS KRISTOS",
            "post_id": "2434510",
            "timestamp": "1124082000",
            "votes": 0
        },
        {
            "answer": "honestly i think that nobody should smoke marijuana like people do cigarrettes. Yeah theres nothing wrong with trying it. Everyone should experience. I know that i did it because i thought it was cool but then i got in trouble for it and its not really that cool. If you have diabetes or something else dont try it, its not worth taking your life or coming close to taking your life. Its not worth it............",
            "post_id": "2434542",
            "timestamp": "1125032400",
            "votes": 0
        },
        {
            "answer": "I used to live in both South Australia and Amsterdam - two locations where cannaboids both decriminalised and overly analysed.  Thus, as a Type 1 diabetic I have come across quite a number of diabetics who have mostly consumed cannaboids such as hash and ganja with their meals or with their drinks as healthy alternative to smoking.  Although I cannot speak for the effects of the plant in regard to Type 2 diabetics (the internet has a substantial amount of info), as a Type 1 diabetic I have on the odd occaision been prone to hypoglycemia after fainting from low blood pressure connected to having too much THC in my tea.  After consulting with my doctor he reckons that on the odd occasions where I have fainted (5 times in the last 2 years) I have in comination 1) consumed too much THC in my drink whilst; 2) already being fatigued and 3) because of being quite tall am already susceptible to low blood pressure.  His loose recommendations are that the next time I know I will be allotted the night shift I should not consume as much cannabis or at least if I plan on getting really high I should  increase my carbs to insulin ratio for the nearest meal that I will be consuming THC.cheers!",
            "post_id": "2434553",
            "timestamp": "1125637200",
            "votes": 0
        },
        {
            "answer": "hello i am  diabetic. I have been a diabetic for 13 years and going strong. My mother also has it too. I am a type one diabetic. I believe that medical marijuana should be legal. I have been smoking marijuana since i was 14 i am now 20 i have had no problems and i mean none. i am currently in college as a soph. The only time i have been in the hospital for my diabetes was when i was diagnosed with it. I have a minimed 508 insulin pump and had only one problem with it. but that was due to scateboarding. The way i see it is it is all up to you. The ball is in your court, you have to take responsibility for yourself and your own actions. As long as you know what you need to do and you do it you will be just fine. Its all hog wash that you don't have control of yourself. You always have control your world is just kinda hazy or fog. You can still be very responsible you just have to be strong have self-control and know what you need to do. I wouldn't do it if you are a new diabetic. See the key is knowing your body like what a low feels like and a high blood sugar. So new diabetics this is not for you. But if you choose to try it or smoke it be careful it is harmless but you have to be resposible.\"THE BALL IS IN YOUR COURT\"",
            "post_id": "2434579",
            "timestamp": "1127106000",
            "votes": 0
        },
        {
            "answer": "hey there i am a diabetic...33yrs... i smoked pot and the only problem i really had was the munchies from it. it never made my BS high or low. It just made me hungry..I dont smoke anymore, but if you do smoke maybe you just eat something healthy. celery and carrots worked ok for me....even though your stoned you still think about your diabetes...i  know i did.",
            "post_id": "2434625",
            "timestamp": "1128056400",
            "votes": 0
        },
        {
            "answer": "I've been a juvenile diabetic for 43 years.   I'm in good health except for neuropathic pain in my feet and hands.  No solution so far.   I've smoked marijuana off and on for at least 40 years.   My experience is that it DOES lower the blood sugar - the reason, I think, that so many smokers get the munchies.  I learned a long time ago to test my blood before smoking and to  be AWARE of where it sat and be ready with some carbohydrate handy.    I think it's a beneficial drug in general though I wouldn't recommend it to anybody who hasn't yet got a life.",
            "post_id": "2434634",
            "timestamp": "1128142800",
            "votes": 0
        },
        {
            "answer": "I've been a juvenile diabetic for 43 years.   I'm in good health except for neuropathic pain in my feet and hands.  No solution so far.   I've smoked marijuana off and on for at least 40 years.   My experience is that it DOES lower the blood sugar - the reason, I think, that so many smokers get the munchies.  I learned a long time ago to test my blood before smoking and to  be AWARE of where it sat and be ready with some carbohydrate handy.    I think it's a beneficial drug in general though I wouldn't recommend it to anybody who hasn't yet got a life.",
            "post_id": "2434633",
            "timestamp": "1128142800",
            "votes": 0
        },
        {
            "answer": "Once again, such a wide varaiety of answers.  How is one to get a handle on the truth about diabetes causes or treatment?",
            "post_id": "2952165",
            "timestamp": "1211719535",
            "votes": 0
        },
        {
            "answer": "BACK to the original question - does marijuana affect type 1 diabetes?no.I've been type 1 diabetic for 9 years and between alcohol and marijuana, I will ALWAYS choose marijuana since alcohol lowers my blood sugar and sometimes leads to me having seizures.Smoking pot will not have any affect over your blood glucose levels, but as everyone else said, it will give you the \"munchies\" - and you are less likely to count your carbs and watch what you're putting in your body when you're in this state.  That's pretty much the only danger - oh, that and the fact that it's against the law, blah blah, wah wahh.And whoever said that alcohol doesn't affect your blood sugar if there's no juice or sugary drink in there???  You're an idiot who obviously doesn't have tight control, because that is never EVER the case... even in \"normal\" people - alcohol LOWERS your blood sugar (longterm like 8-12hrs later) and when you have a lot of it it can lead to seizures!",
            "post_id": "2970469",
            "timestamp": "1212084771",
            "votes": 0
        },
        {
            "answer": "Wow, I posted my original comment back on Jul 07, 2005. Thats almost 3 years ago now. I can't believe the amount of responses from it as well so thanks to all that gave their oppinion.",
            "post_id": "3105007",
            "timestamp": "1214926906",
            "votes": 0
        }
    ],
    "post_id": "2430175",
    "question": "Ok ive had diabetes for 5 years this coming week and i am 15 years old. Diabetes has deffinently changed the way that i go out with friends and i relieze that i cant do all the things that they do to have fun, like drink alcohol. I know that alcohol and diabetes doesnt mix but im curious to know if marijuana has any other side effects on a person with diabetes or if it is still the same as a non diabetic. I have never smoked marijuana before but i might be in a situation next week where people will have some. I wanna know that if anything does happen and i do take some that im not risking myself to an extreme high or low blood suger.Thanks,Tyler",
    "timestamp": "1120712400",
    "title": "diabetes and marijuana"
}