{
    "answers": [
        {
            "answer": "Hi Scarlet.  The information you obtain on this website does not come from medical professionals, so any information should be reviewed with your daughter's healthcare team.  We consist of people who are either living with diabetes themselves or are directly related to someone who has diabetes.Anyone living with a chronic disease such as diabetes, can be prone to anxiety, depression and mood swings.  You ask if it's normal, and I would think that we all deal with one or more of these at some time in our lives.  It's how we deal with it that's important.  If your daughter has good blood glucose control and manages her diabetes well, she may not have as much of a problem handling such distresses.  If she is not in good control, then what may typically be a part of life for most of us may become a major issue for her and may require professional help.  Whatever her circumstance is, she will need your love and support to help her through it.  I am glad that you've taken a step toward helping your daughter by trying to educate yourself through out website.  I hope that others who may have dealt with anxiety, depression or mood swings will share their experiences with us to help you more.",
            "post_id": "2431267",
            "timestamp": "1160197200",
            "votes": 0
        },
        {
            "answer": "I agree with the answer given above, and just want to add that if glucose levels are either higher OR lower than normal, this physical problem can affect moods. Many people comment that their type 1 children become irritable or cranky when glucose levels are out of whack, and so a very physical reason may be behind some of her problems if her glucose levels are not in good control. So even if the problem is mostly rooted in her emotional inability to cope with stresses in life (and maybe with having a disease like type 1 diabetes), maintaining very good glucose control will certainly help remove any possible physical reasons for irritability or depression. It can only help to look closely at how tightly her sugars are controlled.But that being said, many people with chronic illnesses do require professional help, for the emotional toll is great when dealing with a daily tightrope walk that we can never get a break from walking. Some doctors actually believe that ALL type 1 diabetics should be under the care of a therapist to help us deal with this stress in a healthy manner. Feelings of anger, depression, and denial are really very common.",
            "post_id": "2435515",
            "timestamp": "1160283600",
            "votes": 0
        },
        {
            "answer": "My husband is a Type 1 for 20 years now.  Mood swings are VERY common when the blood glucose is not right.  When his is high he is very irritable, cranky and short tempered.  We go check it and sure enough, it's high.  After he takes some insulin, he's back to his happy go lucky self.",
            "post_id": "2435521",
            "timestamp": "1160542800",
            "votes": 0
        },
        {
            "answer": "Hello-type 1 for 30 years and depression has been with me since my teens. Sadly, I didn't ask for help until my 30s. My Diabetes control actually became better after starting an antidepressant. My health improved greatly in one year with treating the depression, getting a new pump, and dropping 20 pounds. My only regret is not getting help in my 20s.",
            "post_id": "2435645",
            "timestamp": "1164866400",
            "votes": 0
        },
        {
            "answer": "I am so glad I have found this site. It is now 2 years since I was diagnosised with Type 1 and I am having a really hard time with mood swings. Im am having similar feelings I had before I was diagnosed but my blood sugar levels are relatively under control never very high. I am having regular emotional outburst- very angry, very frustrated, very abusive, a lot of crying and screaming. I feel completely out of control, like im going crazy (losing my mind). I feel so down. Im actually jealous of people who have a healthy pancreas - how sad is that!?I feel angry with myself that im not doing a better job. If I was life would be rosy. I beat myself up over why , if im doing everything  correct then my sugar levels should be perfect. It has started to affect my relationship with my husband. Im giving him such a hard time - i feel really guilty about this. He doesnt deserve it as he is such a loving and supportive husband. Its almost like my personality has changed and i dont like who ive become. Im due to have an insulin pump fitted in a couple of weeks i hope this will help me get tighter control. I take regular exercise, im not overweight, most of the time my sugars range from being in 'the zone' to as high as 14 - I dont know why im behaving like this. I feel embrassed bringing this up with my consultant as I get very emotional. Is this part of being diabetic?",
            "post_id": "2435680",
            "timestamp": "1166853600",
            "votes": 0
        },
        {
            "answer": "Hi, my son has had diabetes for 4 years now.  He is 6 years old.  He gets very angry and irritable when his blood sugars are high or low.  He will start screaming, sometimes goes around and punches furniture, and says very angry words.  Im not sure if this is normal with type 1 diabetes in kids.  I feel helpless when this happens.  I treat the high or low sugars immediately, when insulin goes in affect or i need to give him food for low blood sugars, and he starts to feel better he is back to himself.  When he gets in these moods i let him get his anger out!!  Anyone have any suggestions?",
            "post_id": "3814472",
            "timestamp": "1230527154",
            "votes": 0
        },
        {
            "answer": "I am so glad everyone agrees that diabetes has a profound effect on your moods.  My son was diagnosed with type I almost one year ago.  I have never seen a 5 year old with so much anger.  His HgbA1c was 8.2 at his last check up.  He's had a pump since July, so his diabetes management is getting better--but there is much room for improvement.  Honesty, comparing the lifesyle changes including diet, insulin, exercise--the mood swings have been THE MOST difficult change.  I ask my son why he thinks he's so angry ,and he answers \"I don't know\".  This breaks my heart because I feel so helpless.  I'm afraid these mood swings are going to affect our relationship. I've decided to ask our endocrinologist for a consult to some psychiatrist, psychologist, therapist--whatever, to help us figure it out.  Maybe some meditation classes?  I don't know...any advice or experiences would be appreciated.  I feel like a horrible parent because I cannot seem to help my son.",
            "post_id": "3895971",
            "timestamp": "1232466763",
            "votes": 0
        },
        {
            "answer": "I am a 22 years old and I have Type 1 Diabetes for coming up to 3 years: feels like I’m part of AA writing this! But saying that I’m glad I am and not really that ashamed but pleased that I am taking the first steps to improve my life and those affected by my mood swings! The biggest effect it has it on my fiancée and I only know that as he has told me that’s it’s my sever mood swings with him that are the problem with our relationship. After reading this website I believe this also. I think my family think this too but try to be supportive and wouldn't mention them through fear of approaching me about them. Although I researched type 1 diabetes a lot when diagnosed and think I know a lot I have either been in denial or just not known these were such a Big problem for diabetics. My control is slacking and I’m not that consistent with my diet and exercise, generally my levels are around 15, Part of the day in the correct 7 - 10 but sometime reach 22. I know I should be better and today is the day when I begin from the beginning. I shall call my specialist in the morning to book an appointment to discuss this with someone in person. My partner thinks I have changed lots and after reading how we can discuss something and then forget all about it Is worrying but makes sense that I’m soo forgetfully of conversations we have, probably because my levels were high. I have just left my partners after a row and handed the engagement ring back. Checked m level it was 19.9. That’s why I’m now researching and writing this. I know I have a problem and really want to address it and fix it. I have never been angry or sad the fact I have this condition until more recently when is ruining a good thing. I hope that in a few weeks/months my life will be back on track. Good Luck to one and all!! xx p.s sorry its so long lot to get off my chest!",
            "post_id": "4426183",
            "timestamp": "1241467204",
            "votes": 0
        },
        {
            "answer": "Also, ANY comments, good or bad will be soo greatly appreciated. I want help and want to be hapy in all my life again. :) xxx",
            "post_id": "4426227",
            "timestamp": "1241467896",
            "votes": 0
        },
        {
            "answer": "this can happen I've been diabetic since I was a kid almost 10 years now actually,....when my sugars are low I experience anxiety and get disorented easilyand when my sugars are highit makes me hyper or tired from haveing to over exet myself which normally makes me aggitated very easilymy advice is to tell your daughter to check her sugars 6 times a daywhich avrages out to about once every 2 hours basicly it makes it much easir to treat your sugars before they spin out of control also she can provide her sugars to her doctorwho can make adjustments to her medicine",
            "post_id": "4440715",
            "timestamp": "1241786538",
            "votes": 0
        },
        {
            "answer": "Hi all, thank you for sharing so much.  It has helped me tremendously.  My 13 year old daughter was diagnosed 1 and a half months ago and her mood swings, irritability, aggression, anger, and back talking have been the worst symptoms so far.  She has such a good and loving heart so when she behaves in such extreme ways I don't know how to react.  I try to keep calm but I have to let her know that she's behaving inappropriately.  Where do I draw the line between a reaction to a high or low and blatant disrespect? I love her so much and I don't know what to do to help her with this part of her newly diagnosed condition.  Please helpBibi Miami",
            "post_id": "6025262",
            "timestamp": "1281749779",
            "votes": 0
        },
        {
            "answer": "Hi BibiYour daughter has several things that are influencing her emotions and behavior right now: She is dealing with the emotional response to getting a diagnosis that is life changing and scary; she is possibly having the influence of both high and low blood sugars that create unstable emotions and she is in puberty which is stressful in and of itself as she is trying to define who she is and now has a chronic condition to add into the mix. So she has a lot going on, and she may not even be aware of what she is feeling or able to express it in words.None of the above, however, excuses bad behavior and I encourage you to continue to parent and set limits as you did before her diagnosis; she possibly needs the reassurance of structure even more now than before!What she may also need is some support for what she is going through: Perhaps a counselor, one aware of the impact of a chronic condition on a teen. What also might help is to meet other young people with type 1 diabetes so she has role models to relate to. There are diabetic camps which are a great experience for someone her age. Contact your local branch of the JDRF to find out the location of camp or of a support group for type 1's or type 1 teens. I will also send you by PM the name of a website where she can talk with other young people with diabetes and you can talk with other parents. It's a hard adjustment but together you can do it!",
            "post_id": "6025440",
            "timestamp": "1281753750",
            "votes": 0
        },
        {
            "answer": "Hi my son was diagnosed with Type 1 Diabetes at the age of 3,he is 10 now. I noticied a change in his mood especially with high blood sugars,which seem to be getting worse. He is attending a psychiatrist and child psychologist,in the hope that we can get our relationship back on track. My lovely sweet boy is gone at times replaced by a monster i dont know. Last week he purposely missed his injection to avoid school(he has a problem with his teacher) Ended up with ketones of 6.9!! I prey that we get through this,but it's broke my heart,i try not to fight or argue back but that's easier said then done!! I just wish i understood his illness more,and could help him more. i love him so much,but can't handle this behaviour. He bit,kicked and punched me on Friday......how hard it must be for him!!",
            "post_id": "6236631",
            "timestamp": "1286833143",
            "votes": 0
        },
        {
            "answer": "My heart goes out to you. This condition is hard enough to handle for an adult, I can't imagine what it is like for a child and for the adults who are responsible for his well-being 24/7. I'm glad your child is in therapy and I assume that the therapist will ask you to attend some of the sessions so he can help you to communicate with each other. I also encourage you to contact the JDRF branch in your area and get a referral to a group for parents as I think it will really help your stress to talk to others who truly understand what it is like.",
            "post_id": "6237149",
            "timestamp": "1286843532",
            "votes": 0
        },
        {
            "answer": "My daughter has terrible mood swings & was diagnosed 2 1/2 years ago.  It hasn't improved.  We have adjusted her insulin, but what people do not understand is the fact that, at times, it isn't what she has eaten...it's simply a high blood glucose number due to stress or hormones.  She will sometimes experience a high because she is overly excited perhaps to attend a party, dance or talk to a boy!  This disease is aweful.  We do the right things, but to no avail.  I wish I could help her.",
            "post_id": "6274948",
            "timestamp": "1287753919",
            "votes": 0
        },
        {
            "answer": "Hi! I'm also a parent of a preteen (12 yr old girl), who's also having serious mood swings and other health issues only 5-6 months into this disease. I've been dealing with an ignorant school system, who refused her any accomodations to assist her in keeping up with school.  She's missed on average 15 days per quarter, which is too much. Due to the school's ignorance, she was not offered a 504 plan and now I'm being fined for 'truancy', which is a joke because she was so sick that she often wouldnt get out of bed. BTW, my fines have been on average $100US per day that she was absent! It's a money-making racket - Believe me! It's always about money.What I can't seem to get the nurses and school to understand is that she's so agressive towards herself (out of frustration with this awful disease), especially when she's got a high BG, that she actually hits herself in the head. I just found her cutting her arm last night, I've called the doctor's office and am waiting.  She's begged me not to tell her father or anyone, who will probably either erupt into anger or cry himself to sleep over it. She's hurting badly and I can't seem to get anyone to see it or do anything for her! I've even threatened a major federal lawsuit via the 504 act of 1973 against the school district for their violation of federal (united states) law and discriminating against a disabled person.I'm a wreck, as I have my own chronic health problems, I do my best to take care of my own mom (who's now had 4-5 strokes overthe past 3 yrs, not to mention 3 stints) and my husband who doesn't want me discussing his issues (which is fine) but he's not working, not able to work and very depressed most of the time. Not to mention helping with the operations of both of our family businesses! Ugh!  I understand this uphill battle all to well.I've contacted the JDRF and can honestly tell anyone who will listen that they are an invaluable resource!! Without their help and information, I'd be left with no accomodations for my child to try and have a normal life (ha!) at school and be given the same opportunity to learn as other \"normal\" kids. She actually had teachers tell her that she would fail school if she didn't get to school everyday! Some support network! What is wrong with some of these people?? Are they that heartless? She's failing 2 classes and her IQ is 129 and she made honor roll 1st qtr even missing 14 days! She was dropped from the gifted learning support, due to her attendance, which cut her deep! It's a matter of pride and accomplishment to be a part of that group and being dropped was a major blow to her psyche! I have listened in disgust too many times to the comments from school, only to get angry and proactive!  Now, I AM MY CHILD'S ADVOCATE!  Please hear me when I say this, only a parent (or a truly caring guardian) can be their own child's best advocate!  Who else loves this child more than you and who else would walk thru fire for this small, helpless being! You! That's who! After all, you're the one reading this - right?!After the school principal (who's a PhD \"professional') told me that \"diabetes (type 1) is NOT a disablility!  I lost all inhibition and went for the jugular!  Please don't assume that the school knows best, they often DON'T!  Take a tip from me and make sure your school (in the U.S.) provides you with the opportunity to obtain a 504 plan, which outlines accomodations for your child. Simple things like: your child will not be failed out of school for poor attendance (nor will u be fined!) and the school will provide support for your child thru any means necessary to keep your child on track at school and home, eg: tutors, homework notes, etc..I'm sorry for the length here, but there's soo much to know! Knowledge is power, people!  Rise up and make things happen for your child and NEVER give up!  I almost did and it nearly killed us both! Please feel free to write to me anytime, especially if you have a diabetic child, my address is ***@****, I'm in the US, but don't let that stop you!  ;). Many blessings to all parents of special children, know you are loved and appreciated for everything you do for your child, even if they can't form the words yet to thank you - they will! Hang in there and make lots of friends with other parents of diabetics and things will improve.PS - I've recently adopted a 'whole foods approach' to my diet and I'm feeling so much better (I have fibromyalgia & PTSD - very bad with all this stress) lately and I don't CRASH like I used to on processed foods. I can't seem to get my child to follow it consistently, but when she does she feels great and her BG is a lot more normal. Even if you just cut out all the processed crap, you will feel tons better! Someone told me to shop around the edges (walls) of the grocery store and that will keep you in the right food choices, but that's not always true. Just remember, if it's already in a box, bag, plastic container - read the label and if you can't pronouce it - don't buy it. Don't be fooled by the fron tof the package - it'll say it's healthy all day long then slip some god-awful preservative in there. Preservatives are for the recently deceased, not the living. Ugh!Thanks for letting me really vent!  Blessings and Peace to you all!",
            "post_id": "6603958",
            "timestamp": "1296565551",
            "votes": 0
        },
        {
            "answer": "I'm 20 years old, and in college and it's getting close to finals...Of course around this time i develop a foot problem that makes my sugar crazy, and my car decides to break down, so I'm beyond stressed. My mom and some of my friends do not understand why I get so mad...before...I used to take my anger out on people this is when I was spilling acid three years ago, but now that I can actually remember the things I say I feel bad....but I get so mad that they don't understand or say that I'm using my \"diabetes\" as an excuse. I've tried telling them so many times, but I feel that the only way they will ever truly understand how I feel is if they are actually in the position themselves...I feel like everyone thinks I'm lying ad before I found out I had a foot problem I had been going through a bad depression mode. I had a few days that I just cried almost all day long...This was close to my menstrual cycle....I've seen a counselor at school, but lately I've been pretty busy...I just wish that my mom would understand and try to help me instead of yelling at me when I get mad...she tells me just to relax...I don't know how! Someone please help :(",
            "post_id": "6831920",
            "timestamp": "1303015764",
            "votes": 0
        },
        {
            "answer": "My daughter was diagnosed with type 1 @ 5. She is almost 14 now.  She has been hospitalized many times. She also has hypothyroidism. She started cutting almost a year ago. Then she spent a week in psychiatric hospital for being suicidal.  Zoloft helped but now she started pulling out her hair. The school nurse has been awful at times over the years even calling me a bad parent many times. Her dad is also type 1. He has severe insulin reactions weekly and has been unemployed for nearly 3 years.  I work nights caring for Alzheimer's patients. I spend almost $7000 per year for health insurance, but still owe over $10,000 in medical bills. I'm so stressed out! It helps to know we're not the only ones.",
            "post_id": "7276321",
            "timestamp": "1317170970",
            "votes": 0
        },
        {
            "answer": "I am exactly the same as you. I am 33 and was diagnosed when I was 19. I suppose I rebel in a way :-( I don't want to have diabetes and the day to day problems of it, so I almost pretend I don't have it and do as I please. I have 4 injections a day but my sugars range from 5-30. I am so moody and my partner has started having a go at me lately. I am scared I will lose him, but also don't want to admit I have a problem. Thanks for listening.Louanne.",
            "post_id": "8037467",
            "timestamp": "1339403848",
            "votes": 0
        },
        {
            "answer": "My father has had type 1 when he was 5 years old (he is now 57). He was told by his doctor that he would die at the age of 20. He suffered a long depression that was not treated when he was a teen. He also has always had very intense mood swings.My suggestion to any parent of a child with diabetes is to seek opportunities for the child to meet other diabetic children or adults with whom their child could share experiences with. My father has always said that the feeling that no one can understand him is one of the hardest things to deal with. Knowing that he-she is not alone and that it is not their fault too.",
            "post_id": "8217391",
            "timestamp": "1344397163",
            "votes": 0
        }
    ],
    "post_id": "2431266",
    "question": "My daughter has had diabetes for 25 years (type 1) and is having a battle with anxiety, depression and terrible mood swings.  Is this normal?",
    "timestamp": "1160197200",
    "title": "Diabetes and Mood Swings"
}