{
    "answers": [
        {
            "answer": "Several people with hcv have blood sugar issues too.  To tell you the truth, I'm not sure how connected they are with current liver condition (cleared hcv but early cirrhosis).  I tx'ed twice since being D2 diagnosed. Life style or liver? Probably both for me.Assuming he's not on tx it might be a good idea to get full analysis by an endocrine doc before tx.  No doubt, tx will skew some readings used to monitor bloods sugars.  Likely hemoglobin A1C readings will be whacked as well as daily blood sugar values.  I have recently gone back to monitoring my levels after tx ended (am and pm) and clealry have some actions to take like getting back on the track with diet (not real bad now) and crank up the exercise further.  Bad thing is that it's Girl Scout Cookie season around here.",
            "post_id": "2479819",
            "timestamp": "1202410615",
            "votes": 0
        },
        {
            "answer": "I have diabetes ...I believe it may have been caused by the HCV,.. also,I'm type 2I have it under control with just diet...no meds needed,....fwiw I just replaced my diet with whole grains sugarless things....I'm also on treatment...I don't think so far no complications from the diabetes? 3 months treating so far...hope that helpsGL",
            "post_id": "2482519",
            "timestamp": "1202446122",
            "votes": 0
        },
        {
            "answer": "I have diabetes as well.  It's probably caused by a combination of heredity and the hcv.  The most important thing to do is to get a glucose meter and use it one and/or two hours after meals to see how various menus affect your husband.  In general, it's ideal to be below 120 by the time 2 hours have passed.  There are all sorts of guidelines - either at the American Diabetes Assn. website, or better yet (because they have higher standards) the website of the American Association of Clinical Endocrinologists.Because most of my family is diabetic, I have become very aware of some of the mistakes doctors can make.  The main one is a common attitude that patients won't comply with difficult regimes, so why not make it easy for them - even if their glucose readings remain somewhat high.  This can cause tremendous damage.  Your hubby should try to adhere to the Clinical Endocrinologists' standards if possible.While I was on tx, I didn't do much about my diabetes, principally because I ate so little that my readings were reasonably low.  Now that I'm SVR, I'm working on my blood sugar.  The best way to start seems to be with metformin, diet and exercise.  I find that a half mile to mile walk after a meal helps a lot.  If your hubby is overweight, the pounds have to go.  If he's not, then a change of diet and possibly meds will be necessary.  I am personally against using sulfonureas because they wring out your pancreas and ultimately leave you in worse shape than before.  I am using metformin and a little bit of lantus insulin before bedtime; this seems to work fairly well, but my diabetes is progressing (as it usually does) and pretty soon I will probably take shots of novalog insulin with my food.BTW, a couple of Girl Scout Cookies are okay - just don't eat any other carbs with that meal - and don't pig out.  Oooh, those peanut butter ones and the chocolate mints.  I hope one of the kids on my block is a scout.Best of luck...",
            "post_id": "2482851",
            "timestamp": "1202459029",
            "votes": 0
        },
        {
            "answer": "Thank you all for your help. It's very encouraging to hear that tx is still possible with diabetes. We are still in the process of waiting for all the testing supplies. My hubby will be on 30 mg of Actos daily. I will do some research to make sure it's not too hard on the liver.Pigeon, thank you for telling me about sulfonureas. I need to know about meds for diabetes as I have no clue right now. I'm sorry your diabetes is progressing, but at least it is treatable.Rangle, I'm glad your tx is going well. Keep it up :)!Flguy, I saw an article saying that some older studies linked more severe fibrosis to diabetes, but that further studies didn't back it up. Sooner or later we'll find out what my hubby's liver condition is. His mom had diabetes, but his eating habits were also really bad. Now that I'm reading the labels on food, I'm shocked! Hubby used to eat 3 or 4 yogurts a night- they had 36 grams of sugar EACH! Now I'm supervising his diet and he's being surprisingly compliant. I'm making a chart to keep track of everything. Just making breakfast seems so complicated now, but I'm sure I'll get used to it.And the about the Girl Scout cookies- they are just too good. My daughter isn't into being a Girl Scout, but I would force her to join if I could get free cookies. Hell, I'd force my son to join if I could get free cookies!Thanks again for the help and advice.Best wishes and prayers,Dee",
            "post_id": "2483896",
            "timestamp": "1202490800",
            "votes": 0
        },
        {
            "answer": "You might try to worry less about the sugar content right now, and concentrate on the net carbs; things like processed flour, potatoes, pasta, and the like will push me up as badly as Snickers bars (yum!).Fruit juice can be a problem; whole fruit in moderation is better due to fiber content. I could go on and on, but you probably get the drift. Ask for a referral to a diabetes education class- they will have a educating RN, and possibly a dietitian to help you plan meals.For instance, I eat 7 times a day; breakfast, lunch and dinner: 60 grams carbs each. Then 4 between meal snacks of 30 grams carbs each, for a total daily carb intake of 300 CHOg.These requirements will vary according to individual needs, but it’ll give you an idea to start with.There is a strong connection between HCV, type II DM, and metabolic syndrome- some studies show even moderate IR (insulin resistance) can have a significant adverse effect on HCV treatment. Make sure this is discussed with the treating doctor.All things being equal, I’d rather manage HCV than diabetes any day. Proper DM management requires constant patient vigilance, and remember that DM kills FAR more people than HCV ever will- it’s not something to be dismissed, unfortunately :o).Grrrr, DM is a b!tch to manage, LOL- can you tell by my rant :o)?Rant done, take care—Bill",
            "post_id": "2483975",
            "timestamp": "1202492169",
            "votes": 0
        },
        {
            "answer": "I have to disagree with you here Bill. My HbA1c was 4.2 from labs 1 week ago. I can manage DM a whole lot easier than I could ever manage my HCV - obviously.Mike",
            "post_id": "2484032",
            "timestamp": "1202492937",
            "votes": 0
        },
        {
            "answer": "With a 4.2 we should pass the Snickers and GS Cookies to Mike.  He could use them. 4.2 equates to about 70-75 glucose. Wow.",
            "post_id": "2484137",
            "timestamp": "1202494077",
            "votes": 0
        },
        {
            "answer": "Last month my A1c results were 3.8; however, I’m in treatment, and this test result is discordant with my finger-stick testing, which is showing an avg. BG of about 125-130 mg/dL. Besides, I can almost *smell* the Lantus pouring out of me, and I’m maxed out on metformin and glipizide :o). I need to get more exercise, but treatment is making it difficult. My doctor noted that while my *net* Hgb is within limits, he suspects that gross hemolysis is still occurring… it’s just that my endogenous epo production is strong, and keeping pace with everything. That would explain the discordance in test results, I guess.You’re right Mike… DM management is doable, but I’ll be a neurotic mess trying to accomplish it :o). A nut with low BG, LOL!Take care gents—Bill",
            "post_id": "2484179",
            "timestamp": "1202494892",
            "votes": 0
        },
        {
            "answer": "I'd be happy at 125-130.  I'm back to regular readings and in the 140-145 neighborhood and not influenced by any kind of meds these days.  I expect that I will be back to fairly low-dose lantus soon.  Going back to a non-hep (yay!) doc and endo to get back on a solid post-tx track. In some ways, almost miss some part of the undisciplined lifestyle of tx.  Got to get more serious now.  With the weather now and the way I feel otherwise, no more excuses.",
            "post_id": "2484223",
            "timestamp": "1202495502",
            "votes": 0
        },
        {
            "answer": "Your hubby is my story 5 years ago.  From there I found out about the hep-c.  If infact the diabetes if from hep-c it is more likely liver induced insilin resistance.  The key is diet and exersise and the right meds.  The normal meds are meds to get your pancress to pump out more insilin.  Not really needed if the problem isn't your lack of insilin but the inability of your body to use what is being made. Your doctor will more than likely perscribe Glyburide or Metformin.  There is a new med called Januvia that I believe works the best for hep-c people.  The draw back is very spendy.  Do some research and my advise is the less meds and the more diet and exersise is the ticket.Ron",
            "post_id": "2484300",
            "timestamp": "1202496540",
            "votes": 0
        },
        {
            "answer": "Wow!  You are amazing, adhering to what is actually the best regime for a diabetic: frequent meals, carbs spread out throughout the day - and your wonderful A1C numbers attest to that.  I have to admit to hovering around 6.0, which is acceptable but not admirable.  Maybe your example will inspire me to do better (after girl scout cookie season).BTW, I'm a tad leary of the nurse educators - since the one Kaiser sent me to was from the Year One.  She told us to only test before meals, not after.  Ideally of course, it would be best to do both, but most HMO's don't prescribe enough test strips.  Pre-meal testing is mostly for type 1's, who do it to regulate their insulin.  We type 2's should also occasionally test before we eat, just to see how low we go, but mainly we want to know our fasting and post-prandial readings.The nurse educator also gave us a food exchange diet, which wasn't much different from the way I normally eat - AND it didn't do a thing to lower my blood sugar.  So take what they say with an open heart, but you'll have to do your own research on your own body to really learn what's needed to lower your glucose readings.best wishes,pigeon",
            "post_id": "2484969",
            "timestamp": "1202505170",
            "votes": 0
        },
        {
            "answer": "Thank you all so much- I'm sure you all know how I felt today. A new dx to deal with, tons of questions and confusion, not really sure how upset I \"should\" be or how this will affect our life... but every time I check back on the board I feel better. Because you all are here to give advice and share experiences, and I know I'll learn (slowly, of course!) what I need to know to keep hubby well. I was as ignorant about Hep C as I am about diabetes when I found this forum- now, while I still get lost on the more \"technical\" discussions- I know enough about Hep C to run circles around my husband's PCP. Hmmm- that's not such a good thing, is it?Upbeat- Y'know, as soon as I started reading about diabetes and how the liver is involved in managing insulin, I thought there had to be a connection. I mean, if the liver isnn't functioning right, at least a couple things are bound to go wrong as a result. Looks like this is one of them. I appreciate your mentioning those meds. I'm very nervous about the med my hubby's doctor prescribed- Actos. It says to consult your phsician if you have active liver disease. My hubby's PCP has already screwed up with a dx and a med with my husband, so I'm not letting him take this Actos until either one of you on this forum says it's OK, or hubby's gastro calls me back and gives me the green light.Pigeon, I will be sure to kinda doublecheck the info the nurse advisor gave me, just in case. And I'll remember about taking the readings after meals- thank you!Bill- Thank you for the guideline on how many carbs my hubby should get. I was puzzled over that, since I read to be careful of carbs but know that everyone must have a certain amount. That will be a great help as I plan my husband's meal/snack schedule. Sounds like you really have it down :).Mike- Funny you should say that, about thinking HCV is harder to manage than diabetes. When I was discussing his diabetes dx with my hubby, I said,\"Look, I'd way rather be dx'ed with diabetes than Hep C!\" My thinking was that diabetes can't hurt you as long as you keep your blood sugar in control, whereas Hep C sometimes just takes over no matter how healthy your lifesyle is. But I'm beginning to see that diabetes is not always within control... I guess the bottom line is that it sux to have either of these diseases, but life must go on.Flguy- Good for you on your plan to take the best care of yourself possible. Hey, you earned the right to be healthy! But I know what you mean- during tx, anything that makes you feel better is justified (to a point- lol)- and now that you're done you hafta go back to fighting yourself on whether or not to have that icecream, Girl Scout cookie, etc etc.Well, I guess I'd better go start dinner. I feel like cooking is so important now- that if I don't feed hubby regularly or put too much butter or sugar in something, the world is gonna end. I'll get the hang of it though- and I'm thinking of all the weight I'll lose too!Prayers and hugs to all of you,Dee",
            "post_id": "2485226",
            "timestamp": "1202509232",
            "votes": 0
        },
        {
            "answer": "I believe that Actos is one of the better meds; it's not a sulfonurea, which is good, but they do say to watch it if you have liver problems.  Then again, they say to watch it with almost every drug if you have liver problems.It really sounds like you guys need to go looking for a hepatologist who knows what they're doing, and possibly - before your hubby treats - get his endocrinologist and hepatologist to coordinate his treatment.Just out of curiosity, what are his usual readings - fasting, and an hour or two after an average meal?",
            "post_id": "2486986",
            "timestamp": "1202550767",
            "votes": 0
        },
        {
            "answer": "usually they can set you up with the nutritionist at the hospital to help you out with sorting through all the carbs.  My son was diagnosed prediabetic about two or three years ago with an unfortunate hypoglycemic dip.  He cut all refined sugar and never has high blood sugar but can have dangerously low blood sugar now and he becomes quite sick so he has to work hard to make sure to eat small meals with a healthy mix of carbs and proteins so he keeps a stable blood sugar.He also uses fruit or fruit juice (never sucrose) if his sugar gets too low.  when we are home together he eats very well because i remind him but when i'm in the hospital things can get bad sometimes.",
            "post_id": "2487000",
            "timestamp": "1202551756",
            "votes": 0
        },
        {
            "answer": "Hi Pigeon,Well in the past my hubby's glucose readings on bloodwork were about 170. The bloodwork he got on Tuesday- after a 12hour fast- came back at 340. I guess that's pretty high. He took his 1st Actos pill this morning, and I'm not sure if the doctor is gonna give us the blood sugar testing stuff- or if I should go buy it. Our health insurance should cover it, but I'm gonna look in the drugstore today anyway. Thank you for your info on Actos- I feel better about him taking it now. I'm working on a meal/snack plan now- it's hard cuz I don't want to seem punishing, like \"No, you can't have this- no, none of that either!\" I know my hubby already thinks I'm a big beeotch much of the time- don't wanna make it any worse ;)! Oh yeah- I saw an article today on Yahoo about diabetes and heart health. It said it is very difficult to get A1C levels below 7, and that most people never accomplish it. It also said that a recent study on the benefits of diabetics lowering blood sugar to non-diabetic levels was halted due to some unexplained deaths. The study seems somewhat contradictory, as it also said that for each point the blood sugar is lowered it cuts the risk of heart and kidney failure by 20-40%.But that now there is some doubt on whether going extremely low is desirable- I can't remember everything exactly, and don't want to give wrong info though. You could check it out- I don't know how to cut & paste links- but it's on the Yahoo home page today.Alagirl,That must be quite a worry with your son, but it sounds like you're handling it great. The fact that you motivated him enough to stay on a healthy diet much of the time is wonderful! It must be difficult when you're in the hospital, but hopefully as he matures he will become more responsible about his diet on his own. As for my hubby's diet, we are going to see a nutritionist on the 12th, and until then I'm just doing my own research and following the advice of my friends on Medhelp :). From the chart I looked at, he needs 7 starches, 3 dairy, 4 veggies, 3 fruits, and 4-6 ounces of meat a day. Yikes- I feel like I'm never gonna leave the kitchen!!  But I'll get used to it. I figure if you can do all that for your son with everything going on in your life, I can do it too.",
            "post_id": "2488023",
            "timestamp": "1202578703",
            "votes": 0
        },
        {
            "answer": "If your looking into meters be sure you get one that can read on your arm and not your finger.  Up until a couple of years ago there was no choice.  Very painful with your fingers.Ron",
            "post_id": "2488106",
            "timestamp": "1202580160",
            "votes": 0
        },
        {
            "answer": "I actually cleared diabetes while on tx ,  I developed Type II diabetes a few years after doing tx the 1st time.  Gained alot of weight.    14 years later, treated again  ( just finished up on thanksgiving)  And now , no longer have diabetes.And just got my 3 month post results.  Undetected..",
            "post_id": "2491059",
            "timestamp": "1202651797",
            "votes": 0
        },
        {
            "answer": "340 after a 12 hour fast is pretty darned high.  A fasting blood sugar from 100 to 125 indicates pre-diabetes, 126 and over usually means the real deal - so 340 is nothing to trifle with.Getting an A1C below 7 is very achievable.  My HMO aims for us to be 6.7 or lower, and even my brother, who is much more diabetic than I am, is able to adhere to that rule.  Type 1's, on the other hand, do find it difficult to go below 7.If your insurance gets stingy on you and doesn't provide a meter, I would become insistent and remind them that it is far more expensive to treat the consequences of uncontrolled diabetes than it is to treat diabetes itself.  The meters are cheap, sometimes free, but the strips are rather expensive.  Once your hubby obtains good control, he won't need as many strips, but at first he's going to need to test at the very minimum four times daily (fasting and after each meal).  I do not find pricking my finger to be very painful, whereas my arm is somewhat sensitive.  I guess it's how you're wired.There is a lot to learn here, and there's a lot of bogus information out there, especially on the internet.  So be careful.  Medhelp has a diabetes forum, plus there's a wonderful news group called \"alt.support.diabetes,\" which is very active and friendly, much like this forum.  I encourage your to visit these sites, as well as www dot aace dot com (Clinical Endocrinologists) and of course the American Diabetic Assn.'s website.Be well,pigeon",
            "post_id": "2493123",
            "timestamp": "1202690488",
            "votes": 0
        },
        {
            "answer": "Just wanted to add, the ADA is not as up to date as the Endocrinologists - in many ways they're the ones who perpetuate the idea that it's difficult to get an A1C below 7.  I believe it's because they assume that most people will not comply with the rules, which is insulting.Regarding nutrition, you might want to take a look at info on glycemic index.  White bread and rice, for example, have higher glycemic indices than refined sugar, and I know from experience that my numbers shoot way up after eating Chinese food, which unfortunately I adore.  Also, stay away from \"diabetic\" or \"sugar free\" pastries, because the flour alone is as bad as the absent sugar.  In other words, such products are usually a scam.  But some sugar free candies, although high in fat content, may have low carbs.  Just be careful and read the nutrition info on the packages.",
            "post_id": "2493221",
            "timestamp": "1202691948",
            "votes": 0
        },
        {
            "answer": "Hi Everyone! Thank you, as always, for your help.Upbeat, I appreciate the info about those meters. I hate pricking my hubby's finger so much -except of course when he's being grouchy, then I set the lance at it's deepest setting and enjoy- heehee ;)!Elaine, thank you so much for the prayers. You and Nick have been on my mind and in my prayers. I hope everything is going along and the day that Nick will be healthy with his new liver comes soon. The expression \"grace under pressure\" really comes to mind when I think of you. Here you are, taking time to reassure me in the midst of all you're going through. You're an exceptional person- I'm so glad I \"met\" you on here.Dperry, congrats on conquering your diabetes and being UND at 3 months!! Those are two GREAT accomplishments- I'm really happy for you. And it's good to know that some people can actually get rid of diabetes. I knew that tx could improve insulin resistance as it improved the histology of the liver, but I wasn't sure if it could actually eradicate the diabetes. Good news! My hubby keeps asking me about that and now I can honestly tell him that if he treats, he may get rid of his diabetes.Pigeonca,  thank you for all the help! I will check out the glycemic index. I need to know more about everything, especially food that my hubby should and shouldn't have. I know he must eat some starches, so it's good to find out which ones are best. Lately I've been cutting out the rice/pasta with his dinner and limiting him to 1 piece of toast in the AM, and his blood sugar was 163 after breakfast today!!! You're right, the 340 was really high- i scared me cuz I felt like my best efforts weren't helping. But, thanks to all you very smart people here, it's going much better! I have been reading the nutrition labels on everything and keeping a daily list of what hubby eats. Thank you for warning me about the sugarfree desserts- that really is a scam! People who fall for that probably can't figure out why their blood sugar keeps going skyhigh even though they're eating \"sugar free\" stuff. But the carbs are still there... I will also check out those websites- now if only I could get my husband to join one ;)! Thanks again for all the info!",
            "post_id": "2506428",
            "timestamp": "1202936504",
            "votes": 0
        }
    ],
    "post_id": "2479728",
    "question": "Hi Everyone,Well my hubby has been dx'ed with diabetes. He had been having excessive thirt, URGENT urination, and had lost 12 lbs without even trying. I kinda knew what it was before we even went to the doc, so I prepared him for it. Basically, nobody likes to be dx'ed with anything, but this is not too bad. It just means that our eating habit must change for the better, I have to stop whining to go out to eat all the time for a while, and he HAS to start taking daily walks with me, as I have been begging him to do forever :) As long as he keeps his blood sugar under control, I think he'll be fine.But I do have a lot of learning to do. I did a quick search online and found a couple articles linking hep c infection to diabetes type 2, which is what my hubby has.My questions are, has anyone else been dx'ed with diabetes 2, and do you have any advice for us? And, had anyone tx'ed for hep c with diabetes? Are there any special complications?Thanks!-Dee",
    "timestamp": "1202409566",
    "title": "Diabetes w/ hep c"
}