{
    "answers": [
        {
            "answer": "I too have type 2 diabetes, and fibro, and also throw in degenerative osteoarthritis.  At one time I was seeing a phusical therapist, for the fibro. I had lots of fatty lumps as you describe them. The PT  said they were from myofascial spasm syndrome. He would exert hard pressure to break them up. Stripping up and down my arms, legs, ribcage, exc. Left lots of bruises. Over the years they have come back. My feet hurt too, You DO need to work on your diabetes at least with diet, as it can cause so many dire consequences, kidney failure, loss of limbs, even death. I don't exercise much either, it's all I can do to work 8 hours. Fibro is so awful, but if you can control your blood sugar you may find a lessening of the painful symptoms of fibro. Good luck and God bless, you are not alone.",
            "post_id": "1976610",
            "timestamp": "1192170825",
            "votes": 0
        },
        {
            "answer": "Thank you for your response. I am very interested in knowing if others have these lumps as they never talk about lumps when giving the symptoms of fibromyalgia. They say that you have \"pressure points\". I want to know if this is the same as having actual lumps that can be clearly felt with slight pressure and hurt like crazy! It sounds like you have the same thing. If enough pressure is excerted on some lumps they feel like they are going down but come right back nearby. I wonder if we both have Dercum's or if these lumps are symptoms of fibromyalgia? I hope that I get more responses. At least I know that one more person has them now! I am taking four shots of insulin a day now along with the metformin and my sugar is going down but my feet still swell a lot and hurt  so I went off the Lyrica to see if the swelling will go down and that is the only drug that I was on for the fibrymyalgia. I send good wishes and I am very glad that you responded.",
            "post_id": "1979192",
            "timestamp": "1192235546",
            "votes": 0
        },
        {
            "answer": "No, the trigger points are different from the lumps. I have the lumps in arms and legs. Trigger points are a distenct pattern than when pressed are painful. There are 18 recognized points. Most fibro websites will show you the pattern. At my last neuro exam, I exhibited pain at 16 out of the 18. Big time flare. Good luck.",
            "post_id": "1984626",
            "timestamp": "1192440002",
            "votes": 0
        },
        {
            "answer": "My rheumatologist said today that I have fibromyalgia but also Dercum's. The painful lumps in my fat are Dercum's. He put me on Neurontin and I will gradually increase the amount which may help the pain but won't cure the diseases. He also gave me shots near my tailbone in two trigger points, just a temporary help. My trigger points now cover my body in addition to the ones they always show on the charts, but I have had it for forty years. I can't take Lyrica for my diabetic neuropathy as it makes my ankles swell too much.",
            "post_id": "1994480",
            "timestamp": "1192655476",
            "votes": 0
        },
        {
            "answer": "I hope that you read this as you also have Dercum's Disease from your description of the fatty tumors that you also have. I will let you know if I find any help. My foot pain is diabetic neuropathy as I was just tested. You may also have neuropathy and we are in danger of losing our toes or feet. You need to inspect and protect your feet. I have no reflexes now in my legs or feet. It came on fast within the last few years. Now my feet feel like they are asleep and I have shooting pains in them. I can't walk at all or my ankles really swell up. I have both fibromyalgia and Dercum's. My grandparents came from Sweden and most of the research on Dercum's is being done in Sweden. I wonder if this disease is more common over there.",
            "post_id": "2058686",
            "timestamp": "1194081441",
            "votes": 0
        },
        {
            "answer": "In my experience  it took a long time to realize I had lumps that were causing specific symptoms with the fibromyalgia, and after many many years I am almost pain free   most of the time.  Hard as it was I started using pressure massage in the general area where the pain/pressure/tingling seemed the worst.  After persistent messaging the swelling lessens and I would actually feel a lump, (nodule) about the size of a pea, that was at the centre of the lump.  I have found that heat (I use microwaveable bags) applied to that area and then more massaging would give a lot of relief and eventually the lump would dissipate.  Sometimes the lumps move while massaging them and sometimes they move on their own,  thats a weird feeling I can tell ya...lol.I'll leave it at that for now and if you have specific questions I am adding this to my watch list 'don't give up'.",
            "post_id": "3446803",
            "timestamp": "1222281346",
            "votes": 0
        },
        {
            "answer": "I don't know anything about Dercums, but over thge last year and a half I have fought with a fibromyalgia lump in my left foot.  The feeling that my foot is 'asleep' as you say accompanies  pain and swelling in that area.  I found the lump in the center of my instep and used the same pressure/heat/message technique on it as well.  In the last year or so it flares up from time to time and I just apply this technique, even just the heat when I'm resting and not messaging it, and after a few days or whatever it calms down.  As soon as I get the tingling like my foot or arm or whatever is 'asleep' I know I need to poke around in that area and apply these techn iques that have worked for me.Dont give up!",
            "post_id": "3446909",
            "timestamp": "1222282834",
            "votes": 0
        },
        {
            "answer": "Hi, Sylvia, I'm Judy. I want to encourage you, because I've been in similar circumstances to what you are describing. I know how it feels to be hurting physically, and to have so many things going on with your body that you can't keep up with them. It's frustrating and depressing, and just plain sad!I'll speak a little bit to the fibromyalgia issue. I've had it for 30 years. I don't have the kind of lumps you are describing, and it sounds like some of the other posts are helping you with information about that. I do get lumps at some of the trigger points, like in my upper back between my shoulder blades, and the only thing that helps that is massage and alternating ice and heat. I tried Lyrica last year, and it did manage the pain fairly well, but it made me feel bloated and it also dulled other physical sensations like the urge to have a bowel movement and sexual sensation. It works wonderfully for some people, but I wasn't one of them. I returned to a higher dosage of my old standby....amitriptyline. It's an old fashioned treatment, but it works for me, with few side effects. Part of why it works is because it helps me sleep like a log, which really can make everything better. Sleep is so important for so many of the physical issues you and I have, and for mental, emotional, and spiritual well being.I've been borderline diabetic for many years and was recently diagnosed with Type II Diabetes. I am on Metformin. I was worried I couldn't take it because I have had issues with IBC and poor GI function for years, but I did fine. I had GI upset for a time, but we used the Met ER and began with one, then added another. I don't have any problems unless I eat poorly, and then my GI system lets me know I need to shape up. My blood sugars run 110-125 in the morning, which is still a bit higher than I want, but my doc is very happy. I usually drop down in the afternoon, sometimes too far, if I don't remember to snack in the afternoon. Last week, I had an 81 and a 66. I've been on Met for almost four months now and my sugars have gradually come down, my appetite has gradually lessened, and I finally am seeing a bit of weight loss...nothing spectacular, but spectacular isn't what works in the longrun...it's that slow and steady progress that is so good for us.The most encouaging thing I think I can share with you is how much better I've done by viewing myself as an intricate WHOLE. I view all of my physical maladies and diseases as related, and I pursue solutions that help with multiple issues. Not only do I view the physical things as related to each other, but I view them as related to my mental/emotional state, and to my spiritual condition. Even taking control of small things helps on so many levels. Let me give you some examples...First and foremost, do what your doctor says! Then, communicate the results to him/her, and get ongoing advice for adjusting dosages, changing meds, etc. There are many solutions to each problem, and some work better than others for each individual. Make a commitment to work closely with your doctor and don't put off going in or give up or neglect to communicate promptly and clearly. There is something very empowering about taking the initiative to get treatment and to ask to adjust treatment in view of your results.One example of how one small lifestyle change has made a huge difference in my life is that I noticed that my skin was very dry, my heels calloused and cracked. This is common with hypothyroidism, and with diabetes, both of which I have. I also know that diabetics need to be particularly careful with their feet. So, I made a commitment to solve this problem, no matter what it took. I sanded my heels, moisturized my entire body every day, and discovered that drinking lots and lots and LOTS of unadulterated water not only made my skin and heels better, but it did a lot of other good things for me. It reduced my appetite, made my food digest better, made my hair and nails healthier, and so on.An example of the physical/emotional/mental/spiritual connection issue is that I knew all of my physical issues were made worse by stress. So I set about reducing the stress in my life by learning to say no. Consequently, I feel better, I find I have more time to devote to taking care of myself, I can spend more time in prayer and meditation, I can think more clearly, and I have more peace.Make 2010 your year for getting healthier. Take on one or two things at a time, and follow through until you have a satisfactory result. Be excited about small victories! I had a hard time learning to set my goals low enough. I wanted to be at my ideal weight in a year. That would have meant losing 80 pounds! How unrealistic is that for someone with all my problems? My doc told me, \"Judy, if you lose just five pounds this year and keep them off, I'll be ecstatic.\" So I have stopped looking at the ultimate goal, and begun to look at the short term goal that involves a lifestyle change. If you do that, the results will come, slow and steady. You said you can't exercise, and it hurts to move at all. So forget exercising, and instead, put a sticky note in each doorway of your house that reminds you to stretch a part of your body when you walk through it. You'd be surprised how much difference that one thing will make. And don't forget to pat yourself on the back each day you meet that goal (that in itself is a good stretch!).I want to keep watching on this post and keep encouraging you, Sylvia, because encouraging you encourages myself, too. Good luck!Judy",
            "post_id": "5256826",
            "timestamp": "1263236775",
            "votes": 0
        },
        {
            "answer": "himy name is dee and for many years i have been a victim of diabeties, fibromyalgia, sleep apnea, muscular skeletal disease, and other associated conditions. i also have a deteriorating spine with some collapsed discs. particularly in my neck with bone spurs both anterior and posterior. needless to say i also have debilitating widespread pain.i sleep with a cpap machine helping me breath,and struggle to get through normal daily chores.there are some days i am in pain litterally from the top of my head to the tips of my toes. on those days i am kind to myself and do only those chores that have to be done then comfort myself with something i enjoy,computor tv a good book or a chat to friends on the phone.on a good day when the pain is down to a dull roar i make an effort to do at least one extra job like clean the fridge or oven or if im lucky spend a half hour pottering in my beloved garden.each day i find something beautiful too look at.could be a flower or a puppy or a baby. your soul needs some beauty in the day. laughter also helps to make you feel better.my muscles have shrunk almost to the point of disapearing and i am now a bony old bird.unlike the majority of fibro sufferers i have never suffered from depression.there is still too much to see and do to cheer me up.if a little low i read the book i wrote of all the funny things my family have done over the years. it never fails to make me laugh and keeps the best memories alive. it was also huge fun writing it and picking everyones brains to remind myself of things that were growing faint.in the last month my left hand has become paralysed and they cant even make their minds up about what is wrong.remember they are the ninnies and you are the patient saint.it is others that dont understand not you.i also give myself permission to not feel guilty if i am unable to make the bed or clean the loo as the pain is too bad. one thing i have learned is the chores will wait for me. i often feel most able to do housework late in the evening so that is when i do it. whatever works on the day.if u feel medication is not working tell your doctor it is inadequate for the level of pain you are still experiencing and make him either change it or give you something to work with it to give you better relief.i too have lumps or benign tumours throughout all the soft tissue of my body some quite large.i was told it was calcified calcium as my body cant process it. who knows. no biopsy has ever been done. mamograms do show the ones in my breasts are not cancerous so i just assume none of them are. that is a nice silver lining in the cloud of my life loli wish you the best and hope you find the answers you are looking for. just remember you are important to those who love you no matter how little you can do for them. you can still give time and love.",
            "post_id": "5772740",
            "timestamp": "1276076954",
            "votes": 0
        },
        {
            "answer": "i think you wanna make it sound worse than it actually is, i think u wanna be sicker than u actually are... in other words i think u r a hypocondriac. Alot of people out there have alot of problems... we all deal with it and suck it up because complainig and looking for other ailments will not help it.... so do me a favor u r probably 64 by now act your age, deal w the problem, stop making up more illneses and stop looking to have more things wrong with you, u r looking for pitty and people that look forpitty are sickening. I have suffered of fibro for yrs and diabetes and other med conditions u dont see me trying to find more things wrong and arguing a point everytime someone gives me a solution, i just suck it up and deal w it. hope u grew up by now have a great day",
            "post_id": "5808712",
            "timestamp": "1276862935",
            "votes": 0
        },
        {
            "answer": "I have lumps pretty much every where as well.  I was told it is in my connective muscle tissue but I am sure it is related to FIbro. I was told it feels like it is in my fat but is not. I too was very concerned it was Dercums.   I have severe pain in my legs especially in my feet, migraines, lower bag pain, tons of Kidney infections, lumps and pain in my neck and shoulders, IBS, chronic fatigue sometimes I can't walk but always manage to just work through the pain.  I also have tingling and numbness in my fingers, and hands which makes me a little concerned about diabetes.   I was diagnosed with Fibro when I was 32.  I am now only 34. I Unlike the last post from beba214 think your concerns are valid! I think in this day and age you have to be your own health advocate and it is troubleing to have these thing's happen to your body.  If you are not completely comfortable with a Doctors diagnosis then it your right and probably smart to get a 2nd and 3rd opinion.  Some Doctors will be able to look at you differently and see something the other one missed!  I spent all of my life ill before I was diagnosed with Fibro.  It took a lot of Doctors. Not all Doctors care or even know what they are doing so I agree with you in wanting to be sure however I would try not to stress your self out and create more health issues because stress is a big problem and can lead to more problems.  I would not listen or let the last post bother you!!! YOU ARE NOT A HYPOCONDIRACH!! I think that shows a persons character of not being to favorable for anyone that would call you such vicious thing's!  I hope you feel better on your Journey to well being. I would definatly reccomend swimming, accupunture, and Chinese eastern medicine.  Eastern/Chinese medicine is completley different then western medicine and has helped a lot!  Hope this helps. I wish you health and happiness in 2010!",
            "post_id": "6216494",
            "timestamp": "1286313511",
            "votes": 0
        },
        {
            "answer": "I too am a diabetic with fibro.  I have stopped taking all med except for the ones that control diabetes and my hormones for menopause.  I also had to stop taking the metaformin due to bloating and not eliminating properly.  Dr prescribed actos and now my fibro pain is bad.  I feel so much better without the drugs but then blood sugars are out of control.  I am on insulin and I try to walk but lately I have not been able to do as much.  What kind of treatments are used with diabetes and fibro??  I well not take any of the drugs for fibro.  They are all too new and have too many side effects.",
            "post_id": "7875402",
            "timestamp": "1334818570",
            "votes": 0
        },
        {
            "answer": "Sounds more like you're a survivor instead of a victim.I have Fibro and, without a diagnosis yet, diabetes.  My fraternal grandmother and my father had it.  My hbA1c, at last check over a YR ago, had risen from 5.2 to 5.7.  Naughty me, I haven't been checking my blood sugar for well over a YR but recent events changed my mind.  After dinner the other night, I literally passed out (sleep) heavily for about an hour.  My sugar hasn't been below 108 and has been as high as 156.This morning, it was waking 108.  Had a boiled egg and 1 cup of oatmeal.  126.  Did a 10 minute cardio which was difficult at best and painful but my sugar went down to 92.  So I'm trying.My question is this:  is type II, once diagnosed, a forever thing or can it correct itself with weight loss?",
            "post_id": "7879731",
            "timestamp": "1334936597",
            "votes": 0
        },
        {
            "answer": "Hello,once diabetic, always diabetic. However, for type 2 you may be able to control it very successfully for a long time or even forever if you take care of your weight, follow a lower carb and healthy diet, and exercise.Exercise is critical to helpign manage sugars.However, even if you have to use meds do whatever it takes to successfully control your sugars.If you have fibro, please make sure you have had your thryoid tested.  This should include TSH, FT3 and FT4. Results for TSH likely should be 1 - 2 range and Ft3 and Ft4 should be mid-range.   Many people with diabetes and fibro also have thyroid issues and treating the thyroid could make you feel much better and help with the blood sugar control.next time,  please do start a new post.  It will make your question more likely to be seen and answered.",
            "post_id": "7882249",
            "timestamp": "1335015074",
            "votes": 0
        },
        {
            "answer": "I already do the routine for thyroid plus myriad other blood tests.  Old news.  I'll think twice before responding to a thread next time.  Thanks.",
            "post_id": "7882941",
            "timestamp": "1335031857",
            "votes": 0
        },
        {
            "answer": "Sorry I did not answer your post in a way that you wanted.We don't know your history so I can only give general advice that may or may not be applicable.Yes, diabetes is forever.Be well!",
            "post_id": "7884416",
            "timestamp": "1335075523",
            "votes": 0
        },
        {
            "answer": "Try reading up on Myofacial Pain Syndrome. \"Myofascial pain syndrome is a chronic pain disorder. In myofascial pain syndrome, pressure on sensitive points in your muscles (trigger points) causes pain in seemingly unrelated parts of your body. This is called referred pain. One symptom:Deep, aching pain in a musclePain that persists or worsensA tender knot in a muscleDifficulty sleeping due to pain (all of the above from Mayo Clinic)Elsewhere:Many of those already suffering from the pain of fibromyalgia also suffer from myofascial pain syndrome. Myofascial pain syndrome is another form of chronic pain that can affect the entire body, particularly the face and jaw. Myofascial pain can add to the already annoying symptoms of fibromyalgia, and can contribute to disability and a poor quality of life if not diagnosed properly.I have had fibro for years and most likely also have MPS as well although not diagnosed. I rarely go to a doctor.  Many now say that fibromyalgia is a nerve disorder. The other one I previously mentioned tends to deal more with the muscles and they tend to be comorbid conditions. From what you are stating you most likely have MPS as well, most do.",
            "post_id": "9545959",
            "timestamp": "1381083316",
            "votes": 0
        }
    ],
    "post_id": "1969515",
    "question": "I went on insulin two months ago. I have early kidney disease and diabetic neuropathy. My ankles and feet are so swollen I can't find shoes. My feet and ankles sometimes hurt so bad I can't sleep or walk. I am on Lyrica for fibromyalgia and it makes the swelling worse.My blood sugar is coming down slowly with the insulin.I was put on another blood pressure pill but it made the swelling worse. I take Lisinopril and a water pill and am trying another new pill. My blood is still high. I wonder if I should go off the Lyrica? I was diagnosed with fibromyalgia 40 years ago. I have lumps in all the adipose tissue on my body. They are extremely painful and I have bands of them everywhere. My hips and lower back hurt so bad I can't walk more than a few steps. Some of the lumps are so big that you can see them like on the back of my neck. If you press on me anywhere you can feel them.I think that I have Dercum's but my rheumatologist said he has never seen a case of Dercum's. I have Sjogren's and IBS and migrains. I have to drink water all the time and still feel dehydrated. I have gained 100 pounds in the last five years. It hurts so much to do anything that I don't exercise. I had to quit working and am 62 and on Social Security.I have sciatica so bad I can hardly sit upright and lots of lumps in my lower back and buttocks. Do other people with fibromyalgia have lumps? This is the one question I would love to have answered. I of course have all the pressure points associated with fibromyalgia but also I have lumps from little to as big as walnuts in all of my fat especially around my joints and rib cage.I don't feel up to working on my diabetes as I am in so much pain from the fibromyalgia or Dercum's.",
    "timestamp": "1192011278",
    "title": "diabetes and fibromyalgia"
}