{
    "answers": [
        {
            "answer": "Polyuria can happen from different problems other than diabetes.Are you drinking too much coffee, too much alcohol - these drinks will dehydrate you.In diabetes, if you your sugar levels are too high, you will want to urinate more often.  This is the kidneys trying to rid the excess glucose in the body.Having a urinary infection can also cause frequent urination.You should make an appointment to see your doctor.  Take a morning mid stream urine sample to be tested.  The doctor can do this at the surgery with the dip stick and also send it to the laboratory for analysis.Tell our doctor the symptoms that you have noticed and ask for him to refer you for a fasting glucose test.  The results would show whether you have a glucose intolerance, diabetes or diabetes.If the results come back fine, you may need further investigation and a referral to a urologist.  Get your prostate checked too.Stop stressing and getting anxious to the point of it marring your relationship with your girlfriend. If you have a problem, the doctor is there to help you find it and to provide any treatment that is required.Stop trying to self diagnose yourself and obsess about what you may or may not have.  Make an appointment to see your doctor with your symptoms.Let me know how you get on.",
            "post_id": "13278838",
            "timestamp": "1442872878",
            "votes": 0
        },
        {
            "answer": "Hey Austin, welcome aboard!  I've misplaced my glasses so I only really scanned your post.  Excuse me for that but I will try to offer a few suggestions.  Jemma gave you some good ones as far as I can tell.First off, please, please, please seek professional help.  Places like this are wonderful for pointers but I'm pretty sure nobody he is a doctor and can give medical advice legally.You sound really obsessive about this.  let me offer you this.  If you do indeed have diabetes, there is help out there and diabetics lead healthy normal long lives when they stick to their programs and listen to their medical advice.  Your glucose levels to me would be a blessing!  I eat 20g of carbs a day or less and struggle to keep levels below 130.Please speak to a health care professional.  Its not worth losing sleep or a good relationship over.  Relax...  You don't even have a diagnosis so you're worked up over things you might not even have!Talk to a doc.",
            "post_id": "13279120",
            "timestamp": "1442877108",
            "votes": 0
        },
        {
            "answer": "Jemma,I know I didn't mention this initially, but I have seen plenty of doctors already following a hospitalization for Pneumomediastinum and a subsequent infection that ensued in my chest & throat about a month ago. They prescribed me penicillin which did not knock it out after a one-week course, so my primary later prescribed me 875 /125 Augmentin (amoxicillin) to finish it off. The Augmentin certainly knocked the infection out of my throat, but since that time I have noticed unexplained weight loss, low body temps, bradycardia, and lower blood pressure than I'm accustomed to, with occasional blurry vision and increasingly frequent lightheadedness.Now, I didn't mention this initially because my CBC with differential came back with vastly improved WBC, neutrophils, and lymphocytes following the antibiotic treatment and I recently had my CRP, ESR, and Procalcitonin levels checked via blood work, all of which came back clean---indicating no systemic infection. I was more concerned with my recent polyuria, increased wound susceptibility (I cut my hands and bruise all over my body much easier now), and my vitals continuing to be way off. It is really affecting all aspects of my life right now, and I just want to get things normalized by any means necessary.Again, I know my blood sugar indicates prediabetes, but is 97 (fasted), 104 (1 hr), 124 (3 hours), and 102 after almost 5 hours following a high carb, high protein, moderate fat meal really going to cause my kidneys to dump glucose from my body at all times of the day---including all throughout the night? This just seems like it was too sudden to induce such a volume of urine (5-6 liters measured and confirmed everyday...normal is 1.5-2.5). By my understanding, UTIs could induce more frequent urination, but not polyuria to this degree.I'm seeing my doctor Thursday regardless, I just wanted some feedback on my glucose measurements and whether such modest numbers could induce this kind of excessive urination. I figured the body only started excreting excess glucose once you got into the 140+ range, not with a fasted glucose right around 100...but I don't have a lot of expertise here, so I was hoping someone could help clarify whether it sounded like DM1, DM2, DI, or none of them. The urine appears foamy and varying degrees of yellow to amber when peeing into a bottle, but less dark and foamy when peeing into a toilet bowl.Also, I recently (2 weeks ago) had a urinalysis done which came back clean, and a metabolic panel which also looked clean, with an eGFR of 102, BUN of 19 mg/dL, Creatinine of 0.99 mg/dL---all within reference range.Thanks again for everyone's help!",
            "post_id": "13279216",
            "timestamp": "1442878107",
            "votes": 0
        },
        {
            "answer": "I apologize for trying to self-diagnose and I am trying not to obsess about this, but I have lost 15 pounds while eating 2000 calories a day over the last month and while my circulation numbers appear healthy, they are very low for me and have been causing me a myriad of problems---from lightheadedness, to numbness in my extremities, and numerous myalgias throughout my body that plague me on a daily basis. My heart rate drops into the mid 40s while I'm in bed now and my blood pressure is 95 /60 in the mornings now, and beyond it being disconcerting, I can feel these effects throughout my body and I notice the difference from when I had a bp of 135 /75; blood just isn't circulating like it used to.The polyuria is only the most recent symptom, but I figured since my hemoglobin A1C was in prediabetic range and my blood glucose was a little high, that maybe diabetes was a good place to start.And listen, I know I probably seem crazy, but as someone who is very in-tune with their body (I exercise frequently, eat right, and have always maintained a healthy physique and body), I know that something is awry; all the measurements provided earlier were not estimates, they were confirmed via multiple instruments and measurements prior to the infection. When my body temperature stays in the 96 degree range (confirmed with multiple thermometers), trust me when I tell you that I can FEEL that temperature permeating through my hands, feet, and entire body---even while wearing a jacket and pants in a 77 degree room. This is all new to me, so I feel compelled to figure out what's causing it.My faith in the medical industry has been eroded by several misdiagnoses over the last month alone, so forgive me if I appear paranoid or anxious, but I have to be my own advocate and try to figure out what's going on inside my body right now.",
            "post_id": "13279306",
            "timestamp": "1442879489",
            "votes": 0
        },
        {
            "answer": "Hello,hba1c of 5.8 could get you diagnosed with diabetes as it is an average blood sugar higher than 125.  You should be eating a lower carb, higher healthy fat diet.  Diabetes is certainly a valid concern.  And type 1 diabetes can be triggered by a recent illness, particularly if you were already predisposed / prediabetic.    This an develop very quickly (over a period od days to weeks).  I think you need a new Hba1c and you should also request a glucose tolerance test.  Has there been any new changes in your fasting blood sugar or post eating blood sugars (do you have a home meter?  If not, you should, and you should be using this to determine which foods are ok).I think you need to have a thorough work up for thryroid disease.  At least this should include FT3, FT4 and TSH.  FT3 and FT4 should be at least middle of the range.  If they are in range, but at the bottom, then it indicates a problem (you can go across to the thyroid forum for more information when you have test results - and make sure you give the test range).Yes absolutely we must be responsible for own health.  And for anything chronic we must know as much or more than our doctors, particularly as it relates to ourselves.Please come back and let us know.",
            "post_id": "13279570",
            "timestamp": "1442884949",
            "votes": 0
        },
        {
            "answer": "Thanks for your response, Sally! I eat about 200-250 carbs a day, but I may have to lower that number. I already eat plenty of healthy fats and proteins. I already had some thyroid work done but I am certainly open to speaking to an endocrinologist about getting a more thorough workup done, as free T3 and T4 were not included on the last one. My results were as follows:TSH:                              0.75 (ref. range: 0.40-4.50)T4 Thyroxine total:          6.60 (ref. range: 4.5-12.0)T3 total:                         81    (ref. range: 76-181)I've been told TSH under 1 combined with a lower T3 could signal pituitary issues, but I'm not sure about that. Does age influence where I should fall within that range? I'm 29.",
            "post_id": "13279771",
            "timestamp": "1442888018",
            "votes": 0
        },
        {
            "answer": "Hi Austin,age doesn't affect where you fall in the age group.  Your tests are old tests.  Next time ask them to test Free T3 and Free T4 (you tested total T3 and Total t4, which don't give us any indication of the available thyroid hormone to your body).Just looking your T3 is right at the bottom or the range (it should be around 130 if it is mid range) and your t4 is also below middle of the range (would be 8.25 if it is mid range).  So definitely you should see an Endo complaining about how you feel.  And testing the proper things.  Btw not all endos are good and look at Ft3/Ft4.  Go on over to the thyroid forum and they may be able to refer you to a decent endo.  With low TSH it does point towards a possible pituitary cause rather than a direct thyroid cause.Anyway, I think you should greatly lower the amount of carbs you are eating, as you are already close to diabetic if not already (you can't be a little bit diabetic - you are or you aren't - a bit like being pregnant).Target your carbs to be , 100 g / day (lower if you can) and observe the impact on your blood sugar.  The best way to manage this is to cut grains and any added sugar.  Then eat plenty of veges.  Look at Paleo  or primal way of eating.Do get properly retested for diabetes sooner than later (a good endo should be able to help), particularly if you continue to lose weight and urinate so much.Let us know the results of your latest home blood sugar testing.",
            "post_id": "13280413",
            "timestamp": "1442902204",
            "votes": 0
        },
        {
            "answer": "Your Haemoglobin level of A1C 5.8 according to EMedicineHealth is classed as pre-diabetes.HbA1C level of 5.7 to 6.4 is classed as pre-diabetes.HbA1C level of 6.5 and higher is classed as having diabetes.Ask your doctor to refer you for a fasting glucose test.Pre-diabetes is usually treated by lifestyle changes.Your symptoms of light headedness and feeling shaking could be caused by low sugar levels called hypoglycemia.  Always carry a healthy snack with you to avoid low sugar levels and don't wait until you get these symptoms before you eat something.  If you do get those symptoms a bar of chocolate or a glucose sweet may make you feel better quicker, but these raise the sugar levels very quickly for it to plummet down again quickly.To stop your blood sugar levels dropping low and causing symptoms, you need to eat little and often.  The types of foods you should be eating are the slow release energy foods.  Cut out or cut down on all sugary foods, processed and junk foods as well as fruit juices, squashes, energy drinks, alcohol, fizzy drinks.Although fruit contains fructose, which as you will know is a type of sugar, when you eat the whole fruit, you also get the fibre in the fruit that is broken down more slowly than if you were to drink a fresh fruit drink.Wheetabix, Shredded Wheat, porridge are good slow release energy foods. You can add some soft fruit, and sprinkle with cinnamon if you like.Look at food labels to make sure that the sugar content is low.  Low fat and some \"healthy\" foods are laden with sugar, so do read the food labels.You can find more information on healthy eating and slow release energy foods on the web.Even with an HbA1C level of 5.8, you doctor would not put you on any medication for diabetes.  He will tell you to change your lifestyle and will monitor your sugar levels.  Do bear in mind that the HbA1C blood tests show the average blood glucose levels in a period of 9-12 weeks.  Every 9-12 weeks the red corpuscles get renewed and the glucose sticks to the old corpuscles.I agree with you that you can experience skin issues and other ailments like nerve damage with prediabetes or glucose intolerance.I appreciate that you have had a bad experience with doctors and have lost your trust in them (I have had a similar experience more than once with misdiagnosis), but the doctor is your first port of call to refer you for the appropriate tests or to specialists, unless of course, you pay privately to see a consultant.If it helps, keep a food diary of what you eat and drink and how you feel. Have a healthy breakfast, followed a couple of hours later with a healthy snack.  Have a well balanced and healthy dinner and again a healthy snack a few hours later and your evening meal, which should also be a healthy and balanced meal.  Healthy snacks include fruit, vegetables, handful of nuts, natural unsweetened yogurt.Do bear in mind that sugar levels can also be influenced if you feel unwell, have any steroid medication or injections.  The colour of your urine can also change from some medications and some foods and drinks.  For example, eating beetroot will discolour your urine to a pinky tinge.Some foods are natural diuretics - celery, cucumber for example.If you bruise easily, it may be worth checking your liver function.Make a list of your symptoms and your concerns to present to your doctor when you see him.  The doctor may prefer to read your written list rather than you tell him verbally your concerns.  He will then ask you questions.  I find giving the doctor a list of symptoms is better than telling him.I know that you feel very anxious about your health concerns, but try and stay calm.  Stress and anxiety is no good for your health.  I am sure your girlfriend is also very worried about your health issues, but try not to let your ill health take over and mar your relationship with your girlfriend.If you do any type of work that can cause cuts or puncture wounds to your skin even by bugs, cover up.  Do bear in mind, that bacteria can enter through any breaks in the skin, no matter how small they may be.  If you do notice any reddening of the skin, pain to touch and the skin feeling hot, that could be an infection called Cellulitis, and a course of antibiotics or treatment by penicillins would be needed.  Do not neglect any cuts, scratches, or other puncture wounds to your skin.I did not comment about your HbA1C levels before, as I have had to check the UK and US measurements.  You can find more information about the HbA1C levels and your home glucose monitor levels on diabetic web sites.I hope the doctor listens to your concerns on Thursday and is able to help you.Let me know how you get on.Best wishes.",
            "post_id": "13280460",
            "timestamp": "1442905279",
            "votes": 0
        },
        {
            "answer": "Lower card.  You are eating 10 times the carbs I am.  I eat 20g of carbs a day or less.  You can still be \"athletic\" and get by with less carbs.  Athletes do it all of the time.Your faith in the medical field is understandable and I am sure you are frustrated.  A friend of mine was having thyroid problems and 3 different doctors misdiagnosed or didn't diagnose any problems.  He went to a doctor who practices traditional medicine along with holistic medicine and told him in less than 3 minutes that he was a poster child for a thyroid problem.  They did a different blood panel that traditionally used to measure the thyroid function and it proved that there was indeed a pretty big issue with his thyroid.  Under this new doctors care, his health improved dramatically.Find another doctor who will take the time and evaluate all of the information you have, plus run some more tests that are more current and you should be able to find out what needs to happen next.Good luck",
            "post_id": "13281129",
            "timestamp": "1442927912",
            "votes": 0
        },
        {
            "answer": "20 carbs a day is simply not possible with my metabolism; I already eat 150g protein and 120g of fat daily, and even with the carbs lowered I continue to pee a ton of foamy urine and lose weight. If I lower that carbs that much I will be dangerously thin (I am completely shredded in the morning and my body doesn't have much more water or mass to give). At this point, I am concerned with maintaining proper levels of hydration and electrolytes. \"Feeling better\" has taken a backseat for the moment. I recently started eating foods with higher sodium to promote water retention, but that has not worked as effectively as I had hoped. Should I be limiting my salt or potassium intake until I figure out what is causing this?",
            "post_id": "13281582",
            "timestamp": "1442936388",
            "votes": 0
        },
        {
            "answer": "Hello,You should be having a 'normal' amount of sodium and potassium.However, given the peeing and the weight loss you need to see your doctor and be properly tested for Type 1 Diabetes (and have your thyroid looked at).   You may also need kidney function tests (they can look at your sodium and potassium levels)  THIS IS A PRIORITY and URGENT.Are you going  to the Dr today or tomorrow?  You mentioned Thursday.    Let us know what happens.  I think the peeing and weight loss should now take priority to everything else.  If the doctor does not voluntarily test for diabetes, you must insist that it is done.  The recent illness and antibiotics may have triggered type 1 diabetes. This is a potential medical emergency.Your current diet:-200g of carb x 4 cal/carb = 800150 g of protein x 4 cal/g = 800120 g of fat x 9 cal/g = 1,080 caloriesTotal Calories is around 2,680 which may even be on the low side for a big active guy.  But in order to increase calories you should increase fat not increase carbs.With your current metabolism which is carb burning you cannot eat that little carb.  But your metabolism can totally change to preferentially burn fat and you will feel much better (if you are diabetic, then this is the best way of eating.As an example:-50g of carb x 4 cal/carb = 200150 g of protein x 4 cal/g = 800200 g of fat x 9 cal/g = 2800 caloriesTotal Calories is around 2,800 - your metabolism will be fat burning.  IF you need more calories, then increase the amount of fat.How do you get this much fat?1. Avocado2. Fat with your veges (olive oil, coconut, nut oils)3. Full fat dairy: Butter, cheese, cream4. Coconut cream to cook veges in or as dessert (Yum)5. Nuts as snacks6. Select fatty cuts of meat and eat the fat, and eat the skin on chicken etc.",
            "post_id": "13283679",
            "timestamp": "1442973829",
            "votes": 0
        },
        {
            "answer": "Sally, thanks again for being so diligent and following up. I have been trying desperately to make an appointment with an endocrinologist, but the earliest appointments are more than a month from now, and I frankly can't wait that long to be seen given the water loss I'm experiencing. My appointment with my primary is tomorrow, but best-case scenario I will get a urinalysis and metabolic panel ordered during that visit. I WILL go in fasted though to try and obtain a reliable fasted glucose reading.I lowered my carbs today and I'm still peeing a substantial amount (about 70 ounces so far). The pee is dark yellow and somewhat foamy, but I have consumed 72 ounces of water already. I am hesitant to just keep drinking a surplus of plain water to counteract this because I don't want to continue flushing out my electrolytes. Regardless, I am planning on making long-term lifestyle changes to get my health back in order. I clearly can't keep shoving carbs down my gullet just because I'm thin and in shape, as this is having serious consequences in my body right now.I just don't understand how this could have started so seemingly abruptly when my last 4 random readings were just slightly above 100. If I have modestly elevated blood glucose levels, why would my kidneys be dumping this much sugar out of my system---and why would it persist all night long? I still have yet to see my blood sugar exceed 125 even at peak blood glucose levels, so I'm not sure how this could have happened so quickly, or if it's even possible to experience severe polyuria with such mild hyperglycemia. I'm also not sure how this explains the lower blood pressure, heart rate, and body temperature, and all the circulation issues I've been experiencing. I definitely do not have advanced diabetes, so this is all very confusing to me. Thyroid tests will probably be my best bet, but I can't see an endo for a while, so I'm not sure exactly how I'm going to approach this moving forward. I'll see if my Primary will order the Free T3 and T4 tests for me, despite the fact that I just had the \"total\" of each type measured not long ago.Finally, why does my blood sugar not spike until 3 hours after a meal? Is it the fat and protein content that are causing that? I will do more finger pricks, talk to my doctor tomorrow, and report back. Thanks again for all your help.",
            "post_id": "13286161",
            "timestamp": "1443033771",
            "votes": 0
        },
        {
            "answer": "Oh, BTW Sally: My earlier infection was bacterial (as indicated by the elevated Neutrophils and lower lymphocytes numbers on my CBC). I thought it was only Viruses that could cause Type 1. Is this not correct?",
            "post_id": "13286181",
            "timestamp": "1443033946",
            "votes": 0
        },
        {
            "answer": "LAST THING, and this is pretty wild (although I know it's going to sound crazy): I've noticed an interesting pattern recently where my kidneys stop going into overdrive when I lift weights. I peed full bladders (16-20 ounces) every few hours during the morning and afternoon yesterday, but between the hours of 4:30 and 9:30 (I lifted from 5-6), I didn't pee once, and was actually a bit heavier this morning since I skipped a urination and went those 5 hours without peeing (which is the longest I've gone in several weeks). I actually felt the desire to urinate wane substantially after I did a few sets of bench press sets which sent blood traveling to my upper body, and the urgency was diminished even several hours after my last set. I would call this a fluke if not for the fact that I've observed the same effect during my previous 2 workouts. I think the blood is being diverted to my muscles somehow---and to my stomach post-workout when I typically have a large meal. Crazy, huh?",
            "post_id": "13286230",
            "timestamp": "1443034824",
            "votes": 0
        },
        {
            "answer": "Hello,given that your blood sugar doesn't go above 125, then you frequent urination could be due to something other than diabetes.Your noticing that you don't have to pee after exertion could be related to the metabolism that happens when you work out, and also the distraction.  When you are working out you are not drinking...Also, if you drink so much, you are going to pee so much.  Maybe the drinking so much is a habit?  Just asking?Peaking blood sugar after 3 hours shows that your pancreas seems to be ok at first, but can't keep putting out enough insulin to keep things stable.  In persons who are non-diabetic, their blood sugar will be pretty close to the fasting levels all the time.  Eating very low carb will help keep your blood sugars stable.The standard tests are:-Fasting1.5 - 2 hours after breakfast  (this tells you your peak)Before lunch (this tells you did your sugar come down again to fasting level between meals)1.5 - 2 hours after lunch  (Peak)Before dinner1.5 - 2 hours after dinner (Peak)Bed time.YOu don't need to test each of these every day, but these will guide you in what foods don't have impact on your blood sugar.   Maybe you can one day eat a standard meal.  See what happens to your blood sugar.  The next time tweak that meal to make it lower carb, and then test again.  Until you find that your blood sugar is stable.Any infection can cause type 1.  However, your blood sugar not obviously going above 125 is very reassuring.Are you taking any vitamins or supplements?  These can affect urine colour and consistency?Good Luck Tomorrow.  let us know how you go.Tomorrow, do a repeat Hba1c.  Ask about the frequent urination and they can do basic kidney function tests.  Get a referral to an endrinologist.  Though it is frustrating, you are not at critical level, and a wait of 1 month should be bearable.Work on this low approach.  You really do need to cut the sugars and carbs (see my example above).  When you feel stressed.",
            "post_id": "13288198",
            "timestamp": "1443075320",
            "votes": 0
        },
        {
            "answer": "Type 1 diabetes is when the pancreas does not produce any insulin.Even with any type of infection, the blood sugar levels will be difficult to control, but it is still Type 2 diabetes.At the moment, you have NOT been diagnosed as having diabetes and the sugar levels your last HbA1C showed were that classed as pre-diabetes.There is no point in speculation and worrying and stressing yourself out unduly.Like I mentioned previously, keep a written record of everything that you eat and drink and the exercise that you do and keep a note of how you feel.There is no point in having a blood test to check your HbA1C levels more than 1 every 3 months.  The blood corpuscles get renewed around that time and the glucose sticks to the old corpuscles to get the average read out in that period.Let us know how you get on at your appointment.Best wishes.",
            "post_id": "13288305",
            "timestamp": "1443077437",
            "votes": 0
        },
        {
            "answer": "Update:  Doctor basically told me that my blood glucose levels are not adequate to stimulate polyuria (said it required hyperglycemia well over the 120 level), yet didn't know how to explain the Hemoglobin A1C number... also told me that peeing over a gallon a day is not that unusual (which is flat-out wrong), and ordered a CBC, Metabolic Panel, Urinalysis, testosterone and prostate test. Wouldn't order additional thyroid tests and didn't believe anything was wrong with my heart rate dropping into the low 40s and said I was just fit and that's why my heart rate was so low, completely ignoring the fact that it never dropped this low prior to my infection over a month ago and that I've been largely sedentary over the last month and can't put any weight on. Oh well, not much I can do at this point besides waiting for my results to come back and staying hydrated, but there was no glucose in my urine and I still can't stop peeing. Told me to make an appointment with an Endo, but (as mentioned earlier) the earliest I can do that is a month from now. I'll just keep trying to make sooner appointments I suppose and figure out what's going on with my heart. Thanks for everyone's help, but it looks like I'm not gonna be able to determine much from this bloodwork unless the metabolic panel reveals something new from 3 weeks ago (which I don't think it will). Very frustrated...",
            "post_id": "13289664",
            "timestamp": "1443110119",
            "votes": 0
        },
        {
            "answer": "Well, I certainly would be happy with your doctor.  He is referring for lots of tests and you can't grumble about that.I am glad that he is going to check your prostate.Do bear in mind that the heart rate will drop if you are sedentary and will then pump faster when you start to exercise and move about.Like Super_sally888 mentions, the more you drink, the more you will pee.  Limit your fluid intake to no more than 2 litres a day, unless you are sweating.  Drinking excessive amounts of fluids can be very dangerous.You mentioned in your previous post that when you do a workout, you do not go to empty your bladder.  This is very strange, because if you had a urinary problem, it would still happen even if you were working out.The other thing is then whether you drank less that day, ate something different, or was not stressed and anxious due to concentrating on your workout.  Do bear in mind that stress and anxiety will also make you go more often for a pee.Dip stick sugar levels in the urine are only detected when the levels are 11 mmol/L and above (UK levels); 198 mg/L and above (US levels).If you are concerned about losing weight and not putting any weight on, increase your calorie intake for the day eating a healthy and well balanced diet.   Weight loss and lack of weight gain can simply be to the fact that you are not taking in enough calories and burning more calories that you are taking in.Be thankful that the doctor has ordered lots of tests and has not just fobbed you off, despite the fact that he was not concerned about your low heart rate and decided not to do another thyroid test.If all the tests come back fine, and you are still not gaining weight, get checked out for parasites, like tapeworm.Learn to relax and enjoy your life.",
            "post_id": "13290018",
            "timestamp": "1443114978",
            "votes": 0
        },
        {
            "answer": "Thanks Jemma, I definitely do need to relax! It's very difficult though when I'm constantly cold regardless of apparel and my blood pressure remains presistently low. I just want to figure this out quickly in case it has something to do with my heart or if it's diabetes. If my fasting blood glucose comes back in the mid-90s and my at-home glucose monitor doesn't reflect a reading over 140 taken 1 and 2 hours after eating straight glucose, do you think can I confidently rule out diabetes and diabetes-induced polyuria? Prediabetes is another story I know, but this would be helpful to figure out sooner rather than later so I can modify my life accordingly. I don't want to have to wait another month to see an Endo if high carbohydrate intake is causing all of my problems. I guess I will continue eating higher fat for the time-being and lower my carb intake accordingly.",
            "post_id": "13290289",
            "timestamp": "1443119397",
            "votes": 0
        },
        {
            "answer": "To be honest, I feel you are obsessing too much about checking your sugar levels at home.  I had been glucose intolerant for 6 years before the sugar levels rose to the diabetic levels.  I have Type 2 diabetes and my doctor and diabetic nurse does not supported me to have a home monitor - this is because my HbA1C blood levels that are checked yearly are under control.  The nurse did say to me that the problem with home monitors is that people can get too obsessed with using them.   As you have not been diagnosed as having diabetes, there is no need for you to obsess about checking your sugar levels.I would suggest the time you could consider checking your sugar levels at home is if you started to feel unwell and your vision became blurry which could indicate hyperglycaemia.  Or when you feel nausea, feel light headed and cold to see if your sugar levels are too low.  But if you do feel like this, then eat something healthy.Unfortunately \"Rome was not built in a day\", and a month for an appointment with an Endo is not that too long.I cannot answer your question as I am not a doctor.  Your doctor has already given you his answer.Did you tell your doctor that you feel constantly cold?Wear a thermal vest and rather than wearing one T-shirt or jumper, wear a few layers.  You can also get some long johns to keep your legs warm, these are worn under the trousers.With you still feeling the cold, this could be due to not having gotten over the infection that you have recently had.  I start to feel cold when I feel tired or when I need to eat something.Eat foods that contain healthy fats (polyunsaturated fats).  These are avocados, nuts, seeds, vegetable oils, fish.  Although coconut oil is a saturated fat, it is still a healthy option.  Eat the saturated fats in moderation, these are the fats that are not good for a healthy heart and can also increase your bad cholesterol.  Keep away from fast foods - an article about a certain fast food outlet has revealed that there is too much corn syrup and salt in the bread buns that can spike up sugar levels and leaving you feeling hungry to buy more.  In the UK corn syrup has been banned in the buns and the salt is much lower.  You will find this article on the MSN page.Read food labels, because some vegetable oils are also saturated fats.  Eat lean white meats.You can find lots of information on the web with regard to the different fats and how they work on the body.When you eat carbohydrates, choose the ones that are not refined.  Have brown seeded bread instead of white for example, brown rice instead of white, eat high fibre foods.   Lots of information on the web and on the diabetic web sites.Your last HbA1C result of 5.8 already indicates that you have pre-diabetes.Remember that the doctor has referred you for further tests, so just put your health issues to one side and have a relaxing and enjoyable time with your girlfriend.",
            "post_id": "13290676",
            "timestamp": "1443126074",
            "votes": 0
        }
    ],
    "post_id": "13278597",
    "question": "Hello all! This is my first post here and I really appreciate any clarification that can be provided for me, as the last month has been very stressful and is on the brink of ruining my relationship with my girlfriend.Before I get into my DM concerns, I wanted to provide some observations I've had: I am a 29 year old 6 foot male who was (until recently) fit, somewhat-muscular, and generally in good shape. I was 178 lean lbs. at the beginning of August, and I am now 163---all with a slightly but not greatly reduced caloric intake. Lately, I have noticed LOWER vitals in terms of my blood pressure (usually 130-140 / 75, lately it's been 110-115 / 60-65), resting heart rate (48-55, usually 60-70), and body temperature (96.2 to 97.5 degrees throughout the day). For many people, this would be a welcome change; but I have felt weak, a little shaky, and perpetually cold. I also have started getting light-headed quite easily whereas before that was a very infrequent observation. I have been largely sedentary but have lifted weights approximately 5 or 6 times over the last month, yet I am more vascular and lean in appearance, have lost significant strength, and again, my heart rate is markedly slower than it was prior to all of this. I also noticed this while exercising, where my heart rate was about 13 beats slower at the same power walking speed than it was a month ago. In general, I'm just experiencing a general malaise lately that is permeating all facets of my life.Now, most of my bloodwork came back fine, but my Hemoglobin A1C was 5.8 and my random bloodwork glucose readings (all taken around 3-4 hours after eating) have been 102, 103, and 109. I bought a home glucose monitor and tested my level recently and conducted a test following one of my typical breakfasts (which included 20g fat, 75g carbohydrates, and 50g protein. I measured a fasting blood glucose of 97, 104 1hr. postprandial, 124 3 hours postprandial, and 102 4.5 hours after the meal. I assume the blood sugar spike was delayed due to the fat and protein content of my meal, but I'm not sure. Regardless, my Hemoglobin A1C and fasting glucose around 100 tell me I am prediabetic, depite my lack of obesity and no family history of type 1 (type 2 in several grandparents).The most concerning symptom that I've had over the last 2 weeks is polyuria and nocturia. I have measured urine output between 5-6 liters a day, and my water consumption is nowhere near that high. My understanding is that polyuria is comorbid with diabetes, but I don't believe that my modest blood glucose readings would lead to this much urination. I am literally peeing full bladders (16-24 oz.) 10 or more times a day, and 3-4 times at night alone ( I wake up to pee every few hours). I've also noticed some circulation and issues with skin sensitivity, for whatever that's worth, along with decreased wound healing expediency. I shake uncontrollably in the middle of the night also, but I am thinking that that has more to do with my withdrawal from Ativan (a benzodiazepene) that anything else. Is it possible for this kind of polyuria to accompany prediabetes, or is that more of an advanced symptom? I am losing water weight quickly and becoming dehydrated, and I don't have much more water to spare, so I want to figure this out quickly.Thanks in advance for everyone's help, it is much appreciated!",
    "timestamp": "1442867596",
    "title": "DM 1, 2, Insipidus, or something else? Confused..."
}