{
    "answers": [
        {
            "answer": "My daughter turns 21 next month and has been type 1 since third grade.  Although alcohol is not her problem (as far as I know), she is also extremely irresponsible with her diabetes care.  More likely, you would call it denial.  She tolerates us doing her blood tests and her injections but she will do nothing herself.  We drag her to her doctor appointments.  When we attempt to get her to show some interest in her own health care, she screams \"You shouldn't have had me!  I'm going to die so just leave me alone.\"  We, like you, have tried everything we can think of to help her, but it just may require time.  My husband and I have never had a vacation alone since her diagnosis because we are afraid to leave her alone as she cannot take care of her testing and injections.  We have planned a vacation for after her 21st birthday and she knows that she will be left alone for a week.  We have told her we will leave her prepared syringes, but if we aren't there to insist, I don't know if she will take them.  I am scared about leaving her alone but feel we have to make some attempt to force her to take some responsibility for her health.",
            "post_id": "2434397",
            "timestamp": "1120366800",
            "votes": 0
        },
        {
            "answer": "I am going to play devils advocate here. I am sure you are doing your very best. But could be getting just a bit too protective? And provoking a negative response in the process.The only way you will get your young adult children to take responsibility for themselves is if you stop rescuing them. They are hiding behind a veneer of imaturity. And they will continue to do so as long as you desparately try and protect them from the consequences of their poor judgement.I have no doubt that you your protective stance is well intentioned. The irony is that it does not do the intended beneficiaries (your children) any favours. The sooner you let them stand on their own two feet, the sooner they will come to terms with their diabtes and deal with the challenges involved.Cheers,Mark",
            "post_id": "2434400",
            "timestamp": "1120453200",
            "votes": 0
        },
        {
            "answer": "Markie,I know you are right about letting them sink or swim so to speak on their own.  All I think about is that with diabetes letting them sink or swim just one time can kill them.  That seems like a rather extreme way to teach a lesson.  Even so, we are trying to figure out a way to do just that.  Thus, the vacation.  We feel that this is something we can do that requires her to \"respond\" to our behavior, not just us ordering her to do something.  She will have to respond (negatively or positively) when we leave her alone for five days.  I was thinking of hiring a part time nurse to come in and do her testing and injections and check on her; my husband says that would defeat the purpose.  I just don't know how I can enjoy a vacation when I am worried sick about how she is doing.  I just found this forum and just knowing something like this exists has lifted my spirits enormously.Bless you,par2323",
            "post_id": "2434401",
            "timestamp": "1120453200",
            "votes": 0
        },
        {
            "answer": "It's soo tough to watch our kids steer toward self-destruction.Alcohol binging and abuse is dangerous even without diabetes, and with it, it can be much worse.It's not inevitable, but it's common that DMers who've been constrained by well-intentioned rules, docs, fear, parents, etc. will eventually break out of their \"shackles\" and attempt to experience life on their own terms.  It's a normal part of maturing to distance ourselves from our parents, to find our own voices, etc.  \"Kids\" with DM also understand that the most effective way to get a rise out of their parents is to manipulate them thru DM denial.  The goal, of course, if for DMers to **internalize** the rules and not continue to respond with adolescent habits.Two folks writing in this thread give painful, common examples of how it plays out.  I'm convinced (thru my own experiences, not a medical degree of any kind) that most often, the \"issue\" these kids are battling is NOT diabetes, per se.  It's depression grown out of less-that-adequate skills to cope effectively with a chronic illness and I would recommend pursuing options that focus on the emotional & psychological aspects of it, rather than the physical stuff.To the person whose 21 year old daughter will not take meds or test herself, I wonder if she is developmentally disabled or if your family has enabled her to create this unfortunate situation.  Since your vacation is not yet \"here,\" how 'bout preparing for the vacation by NOT stepping in at all between now &  then?  By age, she is an adult. YOu can impose rules on adults living in your home.  \"live by our rules or live on your own\" ... It's excruciating, I know.I've had DM since teen years and am now 50.  I know the emotions of a DM teen.  As an adult, I know the emotions & very real, terrifying risks of dealing with a teen who went too long without the right diagnosis (bipolar) and treatment.",
            "post_id": "2434402",
            "timestamp": "1120453200",
            "votes": 0
        },
        {
            "answer": "Dear anniem47 and par2323,My heart goes out to both of you. This problem is too common with kids, teens and young adults with type 1. I am not a physician and cannot give you medical advice, but like the volunteers and people posting comments we do have alot of life experience in many different situations dealing with our own children with type 1 or from personal experience from type 1's themselves. I can only try to add to the wonderful postings already here.I was in the same position as you are both in when my son was younger. His case was more of a matter of denial and not taking care of his diabetes. He was also dealing with depression. It did take a complication to make him realize that he is not immortal and that nothing could happen to him. This is what many teens and young adults go through. It is also a denial of dealing with any chronic disease. No one at that age wants to be considered different from their peers. Who can blame them, but as we know the dangers of one drinking incident with type 1 can have terrible results. Not to mention a refusal to take personal responsibility to manage their diabetes without us as parents constantly on top of them. Markie is correct that at some point we have to back off. As a Mom this was the hardest thing that I ever did, but I have come to believe that it is not all or nothing. The research that I have found is that up to 75% of anyone dealing with a chronic disease will experience some form of depression, especially with type 1. We were able to get our young adult son help with a wonderful doctor who he was able to talk to about his diabetes and his personal feelings about it. It made a difference to him to connect with a person other than parents, relatives and friends. In his case he was put on an anti-depressant that did help. This is not always neccesary, but in his case it was a great help. Lee07 has hit the mark on this one.Although both of you are coping with children that are young adults, I would recommend trying to get them into therapy with a qualified therapist who specialise's in depression. Hopefully their endos can recommend someone. I know that this is easier said than done, but it is worth a try.Par, I truly hope that you can get your daughter into a therapist who deals with type 1 and depression. They may then have resources with a diabetes educator who can help her with managing her own diabetes. It is obvious that she needs to get to have help accepting her diabetes first.There are young adults out there that with age came wisdom. I encourage everyone not to give up hope and know that you are not alone.anniem47 and par2323, The Juvenile Diabetes Research Foundation has a sister outreach program that matches you to a volunteer that have gone through the same issues. This is a one on one communication called the Online Diabetes Support Team. Go to http://www.jdrf.org/ and click on the right side of the page. Someone will be in contact with you if you like. Please keep looking for further comments.I wish you both the very best,dm",
            "post_id": "2430170",
            "timestamp": "1120539600",
            "votes": 0
        },
        {
            "answer": "If your child is taking responsibility for testing and shows interest in his care, I think that is great!  I can't imagine too much backsliding when he reaches adolescence, but I could be wrong.  My daughter was diagnosed in third grade and she never has taken responsibility for or shown interest in her own care although we have tried everything (nurses, therapy, diabetes camp).  She doesn't want anyone to know (especially neighbors, family friends, etc.).  We have no family close by so that is another reason I am fearful of leaving her alone when we go on vacation.  My husband wants to leave her NPH preset in syringes for her to take each morning, but I would rather she be tested and given an appropriate amount of NPH and H for her blood sugar level.  I know we are going to have to discuss this with her before we go, but any discussions that involve diabetes with her usually end up in a major fight.  She screams and retreats to her room and we can't the information across.  I keep seeing her 21st birthday approaching and hoping something miraculous will happen with her attitude, but common sense tells me otherwise.par",
            "post_id": "2434406",
            "timestamp": "1120539600",
            "votes": 0
        },
        {
            "answer": "Hello all,My son was diagnosed at age 3 and is now 10.My heart goes out to everyone dealing with type 1 diabetes, whether you have it yourself or you are a parent of a child, teen or adult child with it.I have heard of kids hitting their teens and going into denial and not wanting to take care of their diabetes because they are sick ot it.  Reading the 2 posts about similar situations really scares me.My son, now, very agreeable, counts carbs, tests for ketones when over 250, etc., could rebel later.  Please tell me, will gradually giving him more responsibility lessen the chances of him going into denial or rebelling as a teen or young adult?My heart goes out to you parents who are doing your very best and want to let go, but are afraid because you know the seriousness of this disease.  The mom who mentioned hiring a nurse while you are on vacation - Do you have a neighbor or relative or family friend who lives nearby that could check on your daughter without nagging her?  I cannot even imagine what you are going through.Warm Regards",
            "post_id": "2434405",
            "timestamp": "1120539600",
            "votes": 0
        },
        {
            "answer": "Lee07 has knocked the nail on the head here. Depression is a really  difficult problem to deal with in DM teens. It is common with young diabetics. And the hardest part is to recognise it. Our 18 year old daughter, who was diagnosed with T1 in November last year, became very depressed. But we didn't realise it until after the second suicide attempt.Fortunately, Caroline has recovered remarkably and continues to make great progress. I now recall her asking me before the crisis if it was possible to kill someone with insulin. But at the time, Caroline appeared to be cheerful and in control of her life. Then, out of the blue, she injected herself with about 500 units of Novolog. And I only just got to her in time. She was taken to hospital and put on an IV glucose drip. And it took three days to get her blood sugar to stabilise.In retrospect, we should have listened more carefully to what Caroline was telling us. There were warning signs that we missed. We may have been able to get her to go for counselling and avoided the crisis altogether. But, on the other hand, Caroline doesn't tolerate interference in her life. And she probably would not have responded favourably to such a suggestion anyway.Having said all that, I still believe that the best way to empower your children to take responsibility for themselves is to take a step backwards and put them in control. Just be sensitive to what may be going on with them. And be ready to pick up the pieces if there is a problem.Cheers,Mark",
            "post_id": "2434404",
            "timestamp": "1120539600",
            "votes": 0
        },
        {
            "answer": "Dear Annie,We all have concerns at times. It's part of parenthood. We need to know that our children are safe. I know that my husband and I have had the same conversations. It sounds like his Endo is on top of this, as you are. What has impressed me is that you both have the lines of communication open and he is willing to talk. I can't tell you how important this is. I hear from so many young adults that refuse to talk to their parents for whatever reasons. I hope you will continue to post comments for others at this site and if you ever have concerns, please feel free to contact us. Excuse me if I am amused at your reference that he is a trooper. It has been my own saying about my son for years. What else can they be?dm",
            "post_id": "2434409",
            "timestamp": "1120626000",
            "votes": 0
        },
        {
            "answer": "To the Team SSIf you read my post, you know that my son was also only 3 years old when diagnosed.  He is now a healthy 21 year old, who is trying to be a little bit too undiabetic right now.  However, when I had a sit down with him the other day over my concerns, many were alleviated.  Though Danny is far from perfect in his control, it has never gone over 9 for his A1c, ever.  Before college, up until I'd say his senior year in highschool, it had never gone much over 7.  His endo told me that he is doing well for a college aged child.  When he was in 3rd grade he started doing his own injections just like that, it was unbelievable.  Since he grew up with the disease I think it is really 2nd nature for him to simply whip out his meter and test, along with drawing up his shot.  Though I don't like him giving his shots through his clothes, it is a battle I let him win and up till now have never had any problems with it. This has been going on since highschool, when he didn't want to be dropping his pants to do a leg or butt injection.  The ONLY time he developed an infeciton at a site was from the pump, and it could have been quite serious, but we (including him) really kept on it, including some antibiotics.I know I complained about him the other night, but since talking to him I realize what a great little trooper I have.  Like I said, far from perfect, but I know I don't have to worry about him checking himself or doing his shots.  I know he should be keeping a record book, and be more careful about what he eats but so much of this is his age and lifestyle right now.  At least when he does eat, he covers it with insulin even if it means more than 4 injections a day.As far as 'par' was talking about with her daughter, I think there must be some depression going on there.  Just the fact that she mentioned she is going to die is quite an announcement of where her state of mind is. She should indeed be doing her own shots and checking at nearly age 21.  If she is rebelling then she needs to speak to a professional to help get her through this. Danny never stopped checking, doing shots, counting carbs, checking his urine when ill, etc.  These are things that should be a normal routine for her now.  I don't know if the answer is going on vacation, I'd be afraid of leaving her alone with just her negative state of mind.  I'm not trying to scare you 'par' but I would at least have someone stay with her; i.e. a family member? I hope you have spoken to her endo about her neglect and feelings?As far as Markie's remarks on how perhaps I'm pestering him too much, I really don't think that is the case at all.  I rarely mention it anymore unless it's a little reminder here and there.  Danny really is what I'd consider completely on his own taking care of it.  That is why my concern rose, from observing from the sidelines.  I'd actually forgotten that we made the agreement that we would talk every 2 weeks about his diabetes if I wanted to.  Once I brought it up to him, he was quite willing to discuss it.One time not too long ago, I said something to Danny regarding something he was either eating or drinking, it may have been a beer.  My husband was quick to let me know that I shouldn't be getting on Danny, that he is 21 now.  Danny replied that it was ok to his dad, that he knows that I just worry about him and he expects that.  It was incredibly sweet and mature.Annie",
            "post_id": "2434408",
            "timestamp": "1120626000",
            "votes": 0
        },
        {
            "answer": "Hello,Thank you for your follow up response.  I really appreciate it.  One of the reasons I posted is because I realized your son was around 3 when diagnosed just like my boy.I am glad to hear that your boy is doing better than you first anticipated.  He does sound like  trooper!I agree that the woman with the almost 21 yr. old should possibly find someone to stay with her daughter and talk to her endo about a referral to a social worker.  The hard part is getting someone who is depressed to do something.  I have dealt with depression myself.Take care,SS",
            "post_id": "2434410",
            "timestamp": "1120626000",
            "votes": 0
        },
        {
            "answer": "Hey. I'm not a doc, and I tend to be wordy and hope no one gets irritated. I was diagnosed Type 1 when I was 5. I have found a therapist (social worker) who deals w/ the issues that diabetics have, and they are many. She suggested to me that maybe I had never gone through a grieving process because I was so young when I got it. She says that happens w/ early diagnosis Type 1's sometimes. Another thing she has helped me with is the issue of codependency in family systems with a chronic illness such as diabetes. Although most people associate (who are even aware what it is) codependency with addictions, it can also manifest itself in families with a chronically ill person to a greater or lesser degree.",
            "post_id": "2434442",
            "timestamp": "1121576400",
            "votes": 0
        },
        {
            "answer": "Oh...not finished...sorry. Codependency as I understand it (NOT A DOC or THERAPIST) can make folks do things that aren't really welcome or even supportive but actually aggravate the situation. Ask yourself, \"How would I feel if someone were doing this to me?\" And be honest. Codependency occurs because the person feels lost, alone, maybe betrayed, like they do all the work and no one else does any, etc., like they have the weight of the world upon their shoulders. It's excrutiatingly painful and no wonder, right? And everyone seems to manifest it in one way or another at some point in their lives. There's a really, really, good book out there by Melody(sp?) Beattie called -Codependent No More. A lot of folks who live with emotionally trying situations have gotten help from her. I have found through personal experience that the more I tried to control something that wasn't my responsibility (like trying to get someone sober ot take better care of himself, for instance) the worse it got. Period.",
            "post_id": "2434444",
            "timestamp": "1121576400",
            "votes": 0
        },
        {
            "answer": "Ugh ok I promise to be quiet after this one...I am so sorry, but I keep remembering things. I made it sound like the people in the post about the 21 year old were controlling, and I didn't mean to, so I hope you don't get upset when you read what I wrote. Wow...when I reread the post about the daughter, I felt a little queasy myself. How does it feel to have someone just talk about their death like that? I would be very frightened and angry. It sounded very hurtful and angry. Why is she so mad? There's some interesting stuff about Borderline Personality Disorder (definitely not a doc or therapist or even a psychologist, just have my own experiences w/this) having to do with rage. It blew my mind that someone said that. It almost sounded like a threat, frankly. And manipulative. Not that all BP's are like that. And if she is, you might think about checking w/Dialectical Behavior Therapy, created by Marsha Linehan. It was originally created to help with chronically self-destructive women to create a life worth living. Folks w/BPD have a very difficult time comforting themselves or staying in the gray area of emotional life. This therapy teaches them how do self-soothe. It works.",
            "post_id": "2434446",
            "timestamp": "1121576400",
            "votes": 0
        },
        {
            "answer": "Sorry--I am verbose and I hope no one gets irritated.And I know it's tempting to think worrying is going to change something (I used to believe that if I worried hard enough about something, it was like the price I paid for everything to turn out ok). Nope...all I was doing was abusing myself. That goes for someone who is ill and not taking care of him/herself as well. How do you help someone and be supportive of their wellness and better decisions without 'enabling' them to further self-destruct? By letting them live their lives and make their own decisions...I think, anyway. Easier said than done. But very, very freeing. The trick seems to be where to draw the line. I know that if I was 21 and someone was refusing to let me draw my own insulin (and forgive the bluntness of this) but I would be mad as heck and want to fight. However, maybe this person is disabled in some way. Has she ever gotten the chance? And camp is not always fun, you know. I had some heinous experiences at diabetic camp. The iron fist approach does not work. Letting go will not only save someone else, but you as well. It will feel completely foreign and unnatural if you struggle with control, but it will pay off in the end. And I am not calling anyone codendent or anything else...Also, a practical tip for those who are adults and drink w/diabetes. If you have to drink, at least eat some bread and drink plenty of water. It helps. But I wouldn't recommend it. I paid a heavy price, myself. What's the official suggestion by the ADA?",
            "post_id": "2434445",
            "timestamp": "1121576400",
            "votes": 0
        },
        {
            "answer": "You're post caught my eye more so than others and not in a way you might think.  I am 40 and have been a \"drinker\" since before 21.  I got diabetes at age 11.  I feel that I am unlike most of the people on here as I do not folow all the diabetic rules that I should and much like your young son I think I am sort of in a denial if that is what you want to all it.  I like to have a beer now and then, quite a few once in a while...  I find that a low carb making sure that I have some pretzels somewhere through the night works best.  I went to my doctor and told him this.  Instead of having a doctor that scolded me for wanting to have an alcoholic beverage with diabetes he gave me a few ways to try and \"work with it\" so I could have a drink and not crash by moring.  I am in no way telling you to give this advice to your son.  THe scary thig is that alcohol makes your sugar rise up quickly and drop to dangerous lows by morning.  You may not agree with his drinking but since he is an adult, I think he may be too old to control his actions.  You have in NO WAY failed.  My mom still gets upset with me but I live the way I want and she hopes I make the best choice, but it's not her choice.  When I was younger and had everyone around me constantly telling me what to eat and when, it just made me all the more frustrated that I had to live with this disease.  My advice, however cold it may seem, is to let him find out for himself the consequences of his actions.  Maybe then, hopefully, he will see what can happen.  Please, though, try and have him discuss this with his doctor.  I am ure they would be more than willing to explain the affects of alchohol on a diabetec, if you have a doctor thatwill \"discuss\" instead of preach.  Good luck",
            "post_id": "2434458",
            "timestamp": "1121749200",
            "votes": 0
        },
        {
            "answer": "Sorry, I didn't think that I explained what I meant quite as well as I should have when I said \"just make sure I have a few pretzels sometime during the night.\"  Whether this information is correct or not, it works for me.  Since the alcohol drops your glucose levels throughout the night, it seems that if you eat some type of food that will get you through the night, it saves you from crashing by morning.  Does that make more sense?  I am not saying that what your son is doing is right, my post is to just say that if he is going to do it anyway, try and find a way that he can do it without crashing.  Thanks.",
            "post_id": "2434459",
            "timestamp": "1121749200",
            "votes": 0
        },
        {
            "answer": "This is all so very interesting for me. I have never checked my newly diagnosed son. I wouldn't even know how to give him a shot of insulin nor check his blood sugar level! He is 20 years old. I know I would not be welcome in his room ever at all. Is there something I am doing wrong here? It sounds like I am being neglectful, but since my son is a young adult, I feel that he has to take responsibility for his actions. He eats whatever he likes, drinks alcohol and I try to stay out of it all, because if I don't I find that I get too upset with him and our relationship suffers. Perhaps I should learn to check his sugars, and give him his insulin.",
            "post_id": "2434482",
            "timestamp": "1122440400",
            "votes": 0
        },
        {
            "answer": "I have a 21 yr old adopted Daughter who has had Diabetes since she was 5. Her birth parents were huffers and drinkers.And she is a bit delayed and she lies alot about her blood sugars because she doesnt want to get me upset with her..It always was in control until the Dr. said she is a big girl let her do it on her own.So it went okay as long as I monitered her. Then she moved out and within 2 months she was in ketoacidosis Dr's werent even sure she would make it .Thankfully she did !! I moved her home and 3 months later she moved out and within 5 months( I had been looking at her monitor weekly) she was going down hill again. I Since have moved her home again and have to try and get past her lying (so we dont know her real BS ) She turned 21 a week and a half ago and now its worse then ever I checked her meter this morning and I saw Breakfast 8 AM ..38, 8:20 AM 48 and at 8:52AM 52, Then NOTHING until 9 pm ..>What the HECK is a parent to do when they worry they will miss something in the 2 minutes it takes to do BS and Insulin...I am at a loss.Worried Mom",
            "post_id": "6156704",
            "timestamp": "1284846158",
            "votes": 0
        }
    ],
    "post_id": "2430169",
    "question": "My son, who has had diabetes nearly 18 years, & has been in college for a full 3 years doesn't seem to take the drinking thing seriously.  Though he has gotten sick at least 3x to my knowledge from it, still I see him taking much liberty with alcohol.  Even when I'm out with him, such as tonight, he drank one corona and a mixed drink (long island iced tea of all things!)  I don't know what to do.  I hardly see him check, though I do see him whip out his kit to do his insulin.  He is Humilin and Lantus.  The other night at his brothers wedding, for which I cut him lots of slack, he drank so much that instead of staying at a hotel with his counsins & friends that night (for which they were supposed to be up checking him) he ended up coming home instead with no argument.  All night long I was up checking him every 2 hrs.  He went from 39 to 400, and back again.  I'm very upset with his lack of seriousness on his diabetes in general.  He keeps no rec. books, doesn't check his avg on machine, and most times doesn't check to see before he eats.  He covers the amount of carb he thinks he is eating, disregarding whether he may be low or high before doing so. I spent my life teaching him to do things right.  I must have read most books on the subject when he was diagnosed at a baby age.  Now I feel I have failed, that all my work and dedication to helping him lead a healthy adult life was useless.  What do I do before it is too late? He believes my small use of alcohol is the reason I am so \"overly\" concerned, which is certainly not the case.  Worried sick in Chicago. AA",
    "timestamp": "1120366800",
    "title": "Drinking and Diabetes in a just turned 21 year old"
}