{
    "answers": [
        {
            "answer": "THERAPY OF CHRONIC HEPATITIS C WITH INTERFERON AND RIBAVIRIN",
            "post_id": "765967",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Sorry, forgot to post link to EASL 2007 Search page:http://www.easl.ch/liver-meeting/Program/search.asp",
            "post_id": "765969",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "I can't seem to link the page, but if you to to the search engine in the link, mentioned (http://www.easl.ch/liver-meeting/Program/search.asp) and insert \"Hepatitis\" in the \"text search\" box and then check\"Abstract Title\" , then \"search\", you will get 248 abstract title links.-- Jim",
            "post_id": "765971",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Great post.  Thanks.  After this study I would think anyone with either hep-c caused Diabetes or Diabetes from natural causes should avoid Tx at all costs.  I mean really if treatment can cause Diabetes just think what the affect would be with someone who already has it.Ron",
            "post_id": "765972",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "CANNABIS USE AS AN INDEPENDENT PREDICTOR OF SEVERE STEATOSIS DURING CHRONIC HEPATITIS CC. Hezode 1,2, E.S. Zafrani 3, F. Roudot-Thoraval 2,4, C. Costentin 1, A. Hessami 3, J.M. Pawlotsky 2,5, S. Lotersztajn 6, A. Mallat 1,61 Department Of Hepatology, Hopital Henri Mondor, Creteil, France; 2 INSERM U635, Hopital Henri Mondor, Creteil, France; 3 Department Of Patology, Hopital Henri Mondor, Creteil, France; 4 Department Of Public Health, Hopital Henri Mondor, Creteil, France; 5 Department Of Virology, Hopital Henri Mondor, Creteil, France; 6 INSERM U581, Hopital Henri Mondor, Creteil, FranceWe recently found a significant relationship between daily cannabis use and fibrosis severity in chronic hepatitis C (CHC). Cannabis Sativa binds two receptors, CB1 and CB2, and recent experimental data suggest that activation of CB1 receptors increases steatogenesis (Osei-Hyiaman et al, J Clin Invest 2005). The aim of the present study was therefore to evaluate the impact of cannabis use on steatosis severity during CHC.311 consecutive na",
            "post_id": "765973",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Don't know if I'd go that far, but definitely something to take into serious consideration, esp if you don't have significant liver damage.-- Jim",
            "post_id": "765975",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Conclusions: Treatment of chronic hepatitis C with combination therapy was comparably effective between patients aged = 60 years and those aged < 60 years in the same grade of hepatitis, although the ribavirin discontinuation rate was higher among the older patients than among the younger patients.----------------------------------------------------------------------EFFICACY OF RIBAVIRIN PLUS INTERFERON-ALFA IN ELDERLY PATIENTS WITH CHRONIC HEPATITIS CT. Honda 1, Y. Katano 1, F. Urano 2, K. Hayashi 1, M. Ishigami 1, I. Nakano 1, K. Yoshioka 3, H. Toyoda 4, T. Kumada 4, H. Goto 11 Department Of Gastroenterology, Nagoya University School Of Medicine, Nagoya, Japan; 2 Department Of Gastroenterology, Toyohashi Municipal Hospital, Toyohashi, Japan; 3 Division Of Liver And Biliary Diseases, Department Of Internal Medicine, Fujita Health University, Toyoake, Aichi, Japan; 4 Department Of Gastroenterology, Ogaki Municipal Hospital, Ogaki, Gifu, JapanBackground and aims: In Japan, patients with hepatitis C virus (HCV)-associated liver disease are getting older, and thus the number of deaths due to such disease is increasing. The efficacy of combination therapy with ribavirin and interferon for chronic HCV infection in elderly patients has not been fully clarified. The aim of this study was to evaluate the efficacy and tolerability of combination therapy in such patients. Methods: Two hundred twenty consecutive patients with chronic hepatitis C were treated with combination therapy. These patients were divided into two groups according to age: patients = 60 years (n = 66) and patients < 60 years (n = 154). Clinical characteristics, the sustained virologic response (SVR) rate obtained by intention-to-treat analysis, and the rate of reduction or discontinuation of ribavirin were compared between the two groups. Results: The hemoglobin level was significantly lower in patients aged = 60 years than in patients aged < 60 years (p = 0.0056). Creatinine clearance in patients aged = 60 years was worse than that in patients aged < 60 years (P < 0.0001). However other clinical characteristics of patients were not significantly difference between two groups. The ribavirin discontinuation rate was significantly higher in the patients aged = 60 years than in the patients aged < 60 years. However, the SVR rates did not differ significantly between patients aged = 60 years and those aged < 60 years (31.8% vs 38.3% by intention-to-treat analysis). According to multivariate analysis, genotype and HCV viral load were significantly associated with SVR while patient age did not affect SVR. Conclusions: Treatment of chronic hepatitis C with combination therapy was comparably effective between patients aged = 60 years and those aged < 60 years in the same grade of hepatitis, although the ribavirin discontinuation rate was higher among the older patients than among the younger patients.",
            "post_id": "765977",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "How did the treated and not-treated groups differ in grading and staging / fibrosis? What was the reason to treat or not? Sorry, if I missed something. It is known that HCV itself can cause Diabetes and many other extrahepatic manifestations. We should know more factors of group mastching than age and gender.",
            "post_id": "765978",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Something else to show your doctor before he tries to reduce your riba dose.Conclusion:Adjuvant therapy with Epo and GCSF as an alternative to dose reduction of peginterferon or ribavirin achieved an SVR of 89% for genotype 2/3 and 55% for genotype 1 in treatment na",
            "post_id": "765979",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "I was told to take Losartan (Cozaar) for high blood pressure on treatment. I've since gone off it. This study is interesting and if I do go on BP meds again, I might choose Losartan. In any event, something to discuss with your doctor if and when the BP issue comes up.-----------------------LARGE POPULATION STUDY IN LIVER STIFFNESS MEASUREMENT: PREVALENCE OF SIGNIFICANT FIBROSIS AND CORRELATION WITH LIVER BIOCHEMISTRY IN CHRONIC HEPATITIS BJ. Fung 1, C.L. Lai 1, J.C. Yuen 1, D.K. Wong 1, C.T. Cheng 1, D.Y. But 1, M.F. Yuen 11 Department Of Medicine, Queen Mary Hospital, University Of Hong Kong, Hong Kong, Hong Kong-S.A.R., ChinaBackground and Aim: The prevalence of fibrosis in a large population of chronic hepatitis B (CHB) patients is not known. The aim of this study was to investigate the prevalence of significant fibrosis in a Chinese population with CHB by liver stiffness measurement (LSM), and its correlation with liver biochemistry and demographic factors.Methods: All CHB patients seen at Hepatitis Clinic, Queen Mary Hospital, Hong Kong for CHB between January to July 2006 with LSM by transient elastography were included.Results: Of the 898 patients included with a median age of 44, 323 (36%) had significant fibrosis as defined by LSM of >8.1 kPa. Males had a higher median liver stiffness measurement (MLSM) than females (7.3 vs 5.9 kPa, p<0.001), and those positive for HBeAg had higher MLSM than HBeAg-negative patients (7.3 and 6.4 kPa respectively, p=0.017). In patients =25, 26-35, 36-45, 46-55, 56-65, and >65 years of age, the MLSM was 6.0, 6.0, 6.4, 7.6, 8.7and 11.6 kPa respectively (p<0.001), with 56% of those aged over 55 years having significant fibrosis. LSM scores correlated well with serum bilirubin, ALT, AFP, and albumin levels (all p<0.001). In patients with ALT<0.5 upper limit of normal (ULN), 0.5-1xULN, 1-2xULN, 2-5xULN and >5xULN, the MLSM was 5.7, 6.7, 8.4, 11.7 and 19.1 kPa respectively (p<0.001). After multivariate analysis, age, bilirubin, ALT, albumin and gender remained significant factors associated with significant fibrosis. Using a combination of serum ALT, bilirubin and albumin levels to predict the presence of significant fibrosis, the sensitivity and specificity were 19% and 98% respectively, with positive predictive value of 84% and negative predictive value of 96%.Conclusion: The prevalence of significant fibrosis in Chinese CHB patients was high, affecting more than half of the patients over the age of 55 years. LSM correlated well with known factors associated with more severe disease, including older age, male sex, higher bilirubin and ALT, and lower albumin. The combination of serum bilirubin, ALT and albumin levels may be used to predict significant underlying fibrosis.",
            "post_id": "765982",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Drofi: \tHow did the treated and not-treated groups differ in grading and staging / fibrosis? What was the reason to treat or not? Sorry, if I missed something. It is known that HCV itself can cause Diabetes and many other extrahepatic manifestations. We should know more factors of group mastching than age and gender.-------------The author's of the study acknowledged the fact that previous studies suggested HCV itself can cause diabetes, therefore I assume they factored in some of the variables you discuss in their conclusion. Maybe the complete article will be available online at some point, or you might want to email the authors with your questions after the meeting.-- Jim",
            "post_id": "765983",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Interesting abstract on declining liver stiffness via Fibroscan for RVRs.EVOLUTION OF LIVER STIFFNESS MEASUREMENT DURING ANTIVIRAL THERAPY IN PATIENTS WITH CHRONIC HEPATITIS CC. Hezode 1, I. Rosa 2, L. Castera 3, D. Roulot 4, V. Leroy 5, M. Bouvier-Alias 1, F. Roudot-Thoraval 1, C. Douvin 1, A. Mallat 1, J-M. Pawlotsky 11 Hopital Henri Mondor, Creteil, France; 2 Centre Hospitalier Intercommunal, Creteil, France; 3 Hopital Haut Leveque, Pessac, France; 4 Hopital Avicenne, Bobigny, France; 5 Hopital A. Michallon, Grenoble, FranceLiver stiffness measurement with the Fibroscan is a non invasive method that assesses the severity of chronic liver disease, in particular fibrosis, in patients with chronic hepatitis C. Whether or not the virologic response to antiviral therapy is associated with concomitant changes in liver stiffness remains unknown. OBJECTIVE: To assess the dynamics of liver stiffness relative to the dynamics of the virologic response during the first 24 weeks of antiviral therapy in patients with chronic hepatitis C. METHODS: 78 patients (57 men, 21 women, mean age: 52+12 years, HCV genotype 1: 47.5%) with significant fibrosis defined by a liver stiffness measurement > 7 kPa were included. 68 patients were treated with the combination of pegylated interferon and ribavirin at the standard doses, whereas 10 untreated patients served as the control group. Liver stiffness and the HCV RNA level were determined at day 0 and at weeks 4, 8, 12, 18 and 24 of therapy. The rapid virologic response (n=40) was defined by a viral load < 615 IU/mL at week 4. The slow virologic response (n=17) was defined by a viral load > 615 IU/mL at week 4 but < 615 IU/mL at week 24. The nonresponse (n=11) was defined by an HCV RNA > 615 IU/mL at week 24. RESULTS: Liver stiffness at baseline did not differ between the treated and non treated patients. Liver stiffness at baseline was higher in the nonresponders than in the slow and rapid responders, but the difference did not reach significance due to the small number of nonresponders. Liver stiffness did not change significantly in the control group, in the non responders and in the slow responders. In contrast, it decreased significantly in the rapid responders (13.9 to 12.3, p=0.028). CONCLUSION: the rapid virologic response to pegylated IFN and ribavirin therapy is associated with a rapid improvement in liver stiffness as measured by the Fibroscan in patients with chronic hepatitis C.",
            "post_id": "765984",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "THE VALUE OF PEGINTERFERON ALFA-2A THERAPY FOR CHRONIC C HEPATITIS IN HEMODIALISED PATIENTSF. Ionita-Radu 1, P. Nuta 1, F. Fanea 1, L. Petrescu 2, C. Klein 2, D. Popescu 1, I. Nicolescu 1, T. Nicolaie 1, A. Rotaru 1, R. Ionescu 31 Department Of Internal Medicine 2, Gastroenterology Unit, Central Clinical Emergency Military Hospital",
            "post_id": "765986",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "INJURY WITH HEPATITIS C (HCV)-CONTAMINATED NEEDLES IN HEALTH CARE WORKERS: WHAT IS THE TRUE RATE OF SEROCONVERSION?A. Kubitschke 1, C. Bader 2, M.P. Manns 1, S. Kuhn 2, H. Wedemeyer 11 Department Of Gastroenterology, Hepatology And Endocrinology, Hannover Medical School, Hannover, Germany; 2 Betriebs",
            "post_id": "765987",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "TELAPREVIR (VX-950) IS A POTENT INHIBITOR OF HCV NS3 PROTEASES DERIVED FROM GENOTYPE NON-1 HCV-INFECTED PATIENTSC. Lin 1, B.L. Hanzelka 1, U. Muh 1, L. Kovari 1, D.J. Bartels 1, A.M. Tigges 1, J. Miller 1, B.G. Rao 1, A.D. Kwong 11 Vertex Pharmaceuticals Incorporated, Cambridge, MA, USABackground: Telaprevir (TVR, VX-950) is a highly selective HCV NS3",
            "post_id": "765988",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Jim, thanks, these are great. Here is the abstract for the losartan article (Dr. D put me on losartan even before I started treatment)LONG-TERM TREATMENT WITH LOSARTAN REDUCES THE INFLAMMATORY ACTIVITY AND THE EXPRESSION OF KEY GENES INVOLVED IN LIVER FIBROGENESIS IN PATIENTS WITH CHRONIC HEPATITIS CJ. Colmenero 1, R. Bataller 1, X. Forns 1, P. Sancho-Bru 1, M. Bruguera 1, M. Dominguez 1, M. Moreno 1, V. Arroyo 1, D.A. Brenner 2, P. Gin",
            "post_id": "765989",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "RESULTS OF AN INTERIM ANALYSIS OF A PHASE 2 STUDY OF TELAPREVIR (VX-950) WITH PEGINTERFERON ALFA-2A AND RIBAVIRIN IN PREVIOUSLY UNTREATED SUBJECTS WITH HEPATITIS CJ.G. McHutchison 1, G.T. Everson 2, S. Gordon 3, I. Jacobson 4, R. Kauffman 5, L. McNair 6, A. Muir 71 Division of Gastroenterology, Duke University and Duke Clinical Research Institute, Durham, NC, USA; 2 Department of Hepatology, University of Colorado Health Sciences Center, Denver, CO, USA; 3 Henry Ford Health System, Detroit, MI, USA; 4 Division of Gastroenterology and Hepatology, Weill Medical College of Cornell, New York, NY, USA; 5 Vertex Pharmaceuticals, Cambridge, MA, USA; 6 Vertex Pharmaceuticals, Cambridge, MA, USA; 7 Division of Gastroenterology, Duke University and Duke Clinical Research Institute, Durham, NC, USABackground: The VX05-950-104 study (PROVE1) is a randomized, placebo-controlled Phase 2 study of telaprevir (TVR), in combination with peginterferon alfa-2a (Peg-IFN-2a) and ribavirin (RBV), in naive subjects with genotype 1 hepatitis C infection. We report the results of a planned interim safety and data analysis. A total of 250 subjects received study drug.Methods: Subjects were randomized into 4 groups; 3 groups were randomized to receive TVR 750 mg q8h, Peg-IFN-2a 180 ug/week, and RBV 1000-1200 mg/day for 12 weeks followed by 0, 12 or 36 weeks of Peg-IFN-2a and RBV (TVR/PR groups). The control group was randomized to receive up to 48 weeks of Peg-IFN-2a/RBV, with TVR-matched placebo for the first 12 weeks. This planned interim analysis was performed when the first 80 enrolled subjects had completed 12 weeks of dosing. All subjects in the TVR groups received the same treatment through Week 12; these groups were pooled for this analysis.Results: The total incidence of adverse events was similar in the control and TVR/PR groups (75% vs. 80%). Discontinuations due to adverse events were more frequent in the TVR/PR group (9% vs. 3%). Rashes were more common and some were more severe, and gastrointestinal (GI) events were more common, in the TVR/PR group. In subjects for whom results were available at Week 12, the proportion of subjects with undetectable HCV RNA at Week 12 was 88% in the TVR/PR group, and 52% in the control group (p=0.0001). (Taqman assay: LOD 10 IU/mL).Conclusions: TVR/PR produced a higher frequency of HCV RNA undetectability than Peg-IFN-2a/RBV alone, in this 12-week interim analysis. The adverse event profile was similar in type of events, but rash and GI events were more common in the TVR/PR group. The Independent Data Monitoring Committee reviewed the data and recommended no changes to the study. An interim analysis, including data up to 12 weeks on-study in all subjects, as well as SVR12 data in subjects who have stopped all treatment at 12 weeks or earlier, will occur in March.* PROVE1 Publication Committee, for the study team.",
            "post_id": "765990",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "RESULTS OF AN INTERIM ANALYSIS OF A PHASE 2 STUDY OF TELAPREVIR (VX-950) WITH PEGINTERFERON ALFA-2A AND RIBAVIRIN IN PREVIOUSLY UNTREATED SUBJECTS WITH HEPATITIS CJ.G. McHutchison 1, G.T. Everson 2, S. Gordon 3, I. Jacobson 4, R. Kauffman 5, L. McNair 6, A. Muir 71 Division of Gastroenterology, Duke University and Duke Clinical Research Institute, Durham, NC, USA; 2 Department of Hepatology, University of Colorado Health Sciences Center, Denver, CO, USA; 3 Henry Ford Health System, Detroit, MI, USA; 4 Division of Gastroenterology and Hepatology, Weill Medical College of Cornell, New York, NY, USA; 5 Vertex Pharmaceuticals, Cambridge, MA, USA; 6 Vertex Pharmaceuticals, Cambridge, MA, USA; 7 Division of Gastroenterology, Duke University and Duke Clinical Research Institute, Durham, NC, USABackground: The VX05-950-104 study (PROVE1) is a randomized, placebo-controlled Phase 2 study of telaprevir (TVR), in combination with peginterferon alfa-2a (Peg-IFN-2a) and ribavirin (RBV), in naive subjects with genotype 1 hepatitis C infection. We report the results of a planned interim safety and data analysis. A total of 250 subjects received study drug.Methods: Subjects were randomized into 4 groups; 3 groups were randomized to receive TVR 750 mg q8h, Peg-IFN-2a 180 ug/week, and RBV 1000-1200 mg/day for 12 weeks followed by 0, 12 or 36 weeks of Peg-IFN-2a and RBV (TVR/PR groups). The control group was randomized to receive up to 48 weeks of Peg-IFN-2a/RBV, with TVR-matched placebo for the first 12 weeks. This planned interim analysis was performed when the first 80 enrolled subjects had completed 12 weeks of dosing. All subjects in the TVR groups received the same treatment through Week 12; these groups were pooled for this analysis.Results: The total incidence of adverse events was similar in the control and TVR/PR groups (75% vs. 80%). Discontinuations due to adverse events were more frequent in the TVR/PR group (9% vs. 3%). Rashes were more common and some were more severe, and gastrointestinal (GI) events were more common, in the TVR/PR group. In subjects for whom results were available at Week 12, the proportion of subjects with undetectable HCV RNA at Week 12 was 88% in the TVR/PR group, and 52% in the control group (p=0.0001). (Taqman assay: LOD 10 IU/mL).Conclusions: TVR/PR produced a higher frequency of HCV RNA undetectability than Peg-IFN-2a/RBV alone, in this 12-week interim analysis. The adverse event profile was similar in type of events, but rash and GI events were more common in the TVR/PR group. The Independent Data Monitoring Committee reviewed the data and recommended no changes to the study. An interim analysis, including data up to 12 weeks on-study in all subjects, as well as SVR12 data in subjects who have stopped all treatment at 12 weeks or earlier, will occur in March.* PROVE1 Publication Committee, for the study team.",
            "post_id": "765991",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "Did you have high bp, or for liver-related reasons per study? If for high bp, what was your bp before and after Losartan, what dose did he put you on, and are you still on it. Any side effects? Also, did you take Losartan by itself or with a water pill. The water pill/Cozaar combo is called \"Hyzaar\".-- Jim",
            "post_id": "765992",
            "timestamp": "1176267600",
            "votes": 0
        },
        {
            "answer": "HYPERHOMOCYSTEINEMIA (high levels of homocystene in blood) IN CHRONIC HEPATITIS C : ROLE IN STEATOSIS, FIBROGENESIS AND RESPONSE TO ANTIVIRAL TREATMENTX. Roblin 1, V. Ducros 2, M.N. Hilleret 1, N. Sturm 3, A. Plages 1, J.P. Zarski 1, V. Leroy 11 Departement DHepato-Gastroent",
            "post_id": "766002",
            "timestamp": "1176267600",
            "votes": 0
        }
    ],
    "post_id": "585070",
    "question": "Data for the VX-950 presentation everyone is waiting doesn't look like it will be released until Sunday afternoon. Other abstracts are available on the EASL site. I'll try posting some I think relevant, but the more help the merrier, so please search and post whatever you seem interesting.First abstract that caught my attention shows the relationship between treatment and Type II Diabetes. When I saw my liver specialist after treatment, he warned me that the treatment drugs could cause a worsening of the metabolic syndrome, including type 2 diabetes. I've posted previous studies on this before, but here is the 2007 EASL abstract. Folks, SOC treatment can save lives, but it isn't without a cost and therefore one should really ask the question -- of self and doctors -- do I really need to treat now?The conclusion of abstract reads:\"Conclusions: This study revealed that the current treatment for HCV with Peginterferon and Ribavirin is associated with an increased risk to develop T2DM. The underlined mechanism is not clear.\"Cont...",
    "timestamp": "1176267600",
    "title": "EASL 2007 Abstracts -- Type II Diabetes and Treatment"
}