{
    "answers": [
        {
            "answer": "Hey Cheechee!I want to give you my perspective as the Mom of a 16 year old girl who has had diabetes since the age of 21 months, and also the Mom of a 20 year old boy(non-diabetic).  Hopefully, I can add to the insightful response from JDRF-Team-LRS.  There are also quite a few terrific and interesting responses in the Diabetes Forum's archives that you may want to read before approaching your son.At the age of 20, it is going to be very difficult for you to get through with anything new that he should not already know about drugs.  After years of being educated in school as to the ill effects that drugs can have on their lives, it seems amazing that kids are still willing to try them.  So much for the tax dollars spent on the War on Drugs!  Anyway, I feel that the importance of your discussion should be your sons' diabetes and taking good care of himself.  You didn't mention how long he has had diabetes, but this may have some bearing on why he may be willing to jeopardise \"good health\" for a \"good time\".  My daughter was diagnosed at such an early age that she doesn't remember what it was like to not have diabetes.  We have always taught her that she needs to take good care of herself now, so that she will be healthy and complication-free when she grows up.  Many kids that are diagnosed when they are pre-teen or teenagers, have a much more difficult time accepting this major change in their lives.  Think about it, at a time in your life when you are supposed to be becoming more independent and responsible for yourself, you have to become so reliant on others for your well-being (your parents, your endocrinologist and other members of your healthcare team).  Talk about stress!  Perhaps, talking to him about his feelings regarding having diabetes and about how taking good care of himself is so important to his future welfare, might just be the key to opening the door and talking openly about his possible marijuana use.  Talk...talk...talk and talk some more!  Don't give up the communication because even though they are 20 and they don't think that they need us or our advice anymore, we know that they do and being there for them will always be our job!  You've done a terrific job in coming to us (please make sure you check out the other responses posted in the archives)and I wish you much luck!",
            "post_id": "2429487",
            "timestamp": "1087621200",
            "votes": 0
        },
        {
            "answer": "Hello CheeChee,A number of months ago, this topic came up a few times.  Many of us adults here grew up with diabetes and so we faced the opportunities to experiment with drugs including alcohol and marijuana.  I'm among those who experimented during my college years in the 1970s ... to the chagrin of my parents once they found out.  Drugs today are stronger, scarier and the underworld that provides them to \"end users\" is so very dangerous, too.In the 1970s, I had no way to monitor my blood sugar -- no home testing, no a1c.  Despite my experimentation, I thought I was responsible about it ;-).  I maintained good grades, job, and active college life.  I simply ignored the fact that using marijuana was illegal -- that \"blind eye\" was opened VERY WIDE however, when a college acquaintance was arrested & sent to Dannemora prison.On an immediate & practical level, one result of using marijuana was that I was less able to/interested to resist temptations.  It's commonly reported that folks experience \"munchies\" ... our word in the 1970s for wanting to eat junk food and plenty of it.  Now while I doubt that marijuana by itself has any BG impact, certainly MUNCHIES do!  I actually \"preferred\" marijuana to alcohol for a \"high\" at that time, BECAUSE marijuana doesn't have calories.Most marijuana users who are teens/20s are just as deaf to the truths behind warnings & lectures by their parents.  If your communication is open with your son, you might engage him in a conversation about your concerns for him (and any of his siblings) and simply encourage him to strive to take good care of himself now that he's an \"adult\".  If you can draw parallels to, perhaps, the way you & his dad are responsible drinkers and ask him to think about what a responsible \"pot user\" looks like, that might well bring some interesting, fruitful exchanges.Just to put my experimentation into perspective, I completed college, grad school, and earned a PhD.  I'm now a professor, wife, parent, community volunteer, etc. etc.  I've had diabetes for ~35 years and am blessed to have had serious complications yet.  I no longer user marijuana, but honestly -- I think that, given my stage in life, it's largely due to the fact that it's illegal and that the supply chain lacks quality control.This is a very interesting topic and I expect you'll hear from plenty of others.  I particularly hope that some of the young adults who post here will contribute, too.",
            "post_id": "2433514",
            "timestamp": "1087621200",
            "votes": 0
        },
        {
            "answer": "Well, ive been a diabetic for a year, ya i know not long, but ive smoked marijuana threwout the whole year.  Not consitntly, but at partys, and whatnot, i smoke cause i cant drink safly. Marijunana isint a bigger risk to diabetics, then non diabetics, i dont think. Because the risk of u going low, is very very low, as you will have the munchies, and most likley go high.  I dont munch of junk food, barly at all. If im at home, id reach for a diet coke, some crackers and cheese maybe, i dono, but even that is reallllly good when your stoned.",
            "post_id": "2433515",
            "timestamp": "1087794000",
            "votes": 0
        },
        {
            "answer": "Thanks for your question.I hope no one will mind my adding some info here as I do know alot about the subject, sensitive as it is.I have over the past 12 months done a lot of research on this subject and to my surprise there is a surprising amount of literature on this subject out there:Let me pre-emt this discussion by saying that I do not advocate the use of drugs, however, I have used Marijuana before my Type 1 diagnosis and cocnsistently (thougfh moderatly) since, I have discussed this at length with my doctors who given the results that I have experienced are happy for it to continue.I have been experimenting on my self with BG test every 30mins or so, eating exactly the same meals at the same times to check the BG curve whist using and not using cannabis.The result, startling at it was, consistently was the amplitude of the curve was considerably shallower with cannabis, I took it one step further and found that with a combination of cannabis and X-4 units of insulin my BG would simply not get above 11(198)where as with the X units (4 more than previously) and the same food,(no canmnabis) the BG 15-60 mins after a large meal (identical meal to prior) would surpass 13.5 (243) for brief periods.the conclusions and this is consistent with previous findings is that cannabis can be used in conjunction with insulin to \"smooth out \"the BG curve, this is why despite a relatively high sugar diet, my control is exemplary, my HAb1c is always well sub 6.0but most importantly the curve, ie the extremities of high and low are never beyong the 4.5- 10 region (81-180).I am a succesful entrepreneur and MD of my own company, the use of marijuana is the UK is legal for personal. (though not for sale). In conclusion, some groups advocate the use of Marajuana for treatment of diabetes exclusively, see medical marajuana .com though  obviously for type 1 insulin should not be used to replace insulin though can be used succesfully to complement it.Let us not forget that it the high and lows that cause diabetic side effects, if one can keep the range of BG within the aforementioned ranges, the risk of complications tend to zero or at least decrease considerably.The \"munchies\" as they are often refered to are just a healty person's way of dealing with a very mild Hypo, Cannabis LOWERS BG level, though an immunity will develop in time, this lowering normally causes the body to crave sugar and sweets in order to correct the low. In diabetics, it is not difficult to beat this feeling with will power, it ceases to be an issue after a short while.I hope this info has been in some way helpful.Kind regards,",
            "post_id": "2433526",
            "timestamp": "1088398800",
            "votes": 0
        },
        {
            "answer": "I'm 25 years old and have had type1 diabetes since i was four. I've smoked cannabis regularly for the last few years and, as a result, have indeed developed greater control over my condition. I used to have a problem with alcohol which has led to some retinopathy complicatons as well as depression and often violent moodswings. It amazes that, despite a wealth of evidence I have found for cannabis, as well as a growing amount of use and support around the world, some people still regard cannabis as more dangerous than alcohol. I have read reports which seem to suggest that a lot of people are being fed anti-drug propaganda which lumps cannabis in with other illegal substances. For example, many reports warn of users being 'out of it' and unable or unwilling to test their blood levels. On the contrary, I have found that being 'out of it' is the time I feel more worried about diabetes and more likely to test my sugar. This is the exact opposite of being 'out of it' on alcohol which leads not only to no testing, but no injections and dangerous fluctuations in those same levels. It seems that a lot of govermental action against cannabis( labelling it 'wacky-backy' and reporting made up instances of ' reefer madness') has scared a lot of people into thinking that cannabis users are irresponsible, lazy or just plain crazy! I firmly believe the opposite to be true and that it's alcohol that leads to the irresponsible and crazies on the street( here in Britain, we have an escalating 'yob culture as proof of this) I strongly object to being persecuted for my method of relaxation as I refuse to use alcohol now as it clearly leads to depression and violence( for myself and, I guarantee, many others) I will continue to campaign for the legalisation of this relatively harmless drug.",
            "post_id": "2433570",
            "timestamp": "1090299600",
            "votes": 0
        },
        {
            "answer": "I just wanted to add to this ongoing discussion by first stating that I am grateful to be living in a country where we are free to express our opinions openly and without fear of retribution.  I am also very grateful for the volunteers who give so much of themselves in trying to help others and make a difference in dealing with diabetes in their lives.No matter how many discussions we have or how many different points of view are brought out, smoking marijuana is illegal and cannot be condoned.  It's that simple.",
            "post_id": "2433579",
            "timestamp": "1090558800",
            "votes": 0
        },
        {
            "answer": "as an adult on-set diabetic and avid smoker {see the name] ALOT  of your comments have to do with the fact that pot is illeagal{which is a topic for another discussion}.i've smoked since the age of 16 and been diabetic since 27 as some one mentioned earlier the only bad  of smoking and  being diabetic IS THE MUNCHIES and not having the suitable foods to go with this condition i find that nuts and mountain dew {diet of course} work really well for me or veggie mix and an lite dip. and please don't get me started on the legalities of this issue the goverment makes to much money from drugs to ever legalize it for its citizen even if it's what the majority want.",
            "post_id": "2920593",
            "timestamp": "1211130219",
            "votes": 0
        },
        {
            "answer": "I've been smoking reefer since 1969 and have had no ill effects from it.  I was recently diagnosed with type 2 diabetes and continue to smoke.  over th e years I've learned to dicipline my self well enough that now that i am diabetic and have to watch what I eat when I get the \"munchies\" i'm still careful about what and how much I eat.As to the legality well I just use discretion.  I don't sell it, I don't give it to minors and basically just keep it to my self.  I will continue to smoke it till I  die and advocate the use and legalization of it through annonymous donations to NORML because I see nothing wrong with it.  The biggest arguement I get from anybody (including the medical community) is \" It's illegal\"",
            "post_id": "2924031",
            "timestamp": "1211213097",
            "votes": 0
        },
        {
            "answer": "I have been diabetic type 1 for over 20 years, diagnosed when I was 7 years old. Due to that, my doctors, parents and others thoroughly implanted that drinking alcohol was one of the worst choices i could make. When I reached my teens, my doctor looked at me and said \"Are you drinking with your friends?\" I answered on occasion. He looked at me with a tear in is eye from my answer and said, if you have to do something like everyone in this world to reduce stress, the best thing is marijuana, and that this is completely off the record but as a friend.I didn't not take that as medical advise or approval, i had already experimented with it and other real drugs like cocaine, LSD, mushrooms, xtacy etc. You name it i tried it all other than smoking crack or shooting up heroin. After all my experimentation it was marijuana that actually helped reduce pain in my lower extremities in my legs and pressure behind my eyes. I don't suffer from neuropathy but the potential is always there. When i was younger i did stuff for fun, now it's more for pain and stress relief.Most people come home after work and have a drink, which is very very bad for diabetics. Sure smoking weed isn't the best thing either but their are upsides to the actual THC, just wikipedia THC. If anything, without munching out, it has lowered my blood sugar after smoking somewhat. Not greatly but enough to know that it did. Also my blood flow in my legs improved and nerval pain was reduced.Also, being diabetic and having a great set of parents made me grow up a little faster. When i was 14 i took opportunities that came my way in order to be able to support myself while in school. My parents are not rich, more like poor, but they always provided for us (thier children) by them being so adamant about my future health, i was able to get a jump start my career and college life, something i would not have been able to do drinking alcohol all the time. Marijuana is not like alcohol, you can function in society when you are \"stoned\" but you can not when you are drunk. Don't get me wrong, doing nothing is the healtheir thing, but who does nothing? Everybody has their weakness, wether it be sugar, caffine, carbs, drugs, alcohol, weed. Who made who God and put a value system in place that was given to us by our creator. Everything in moderation is good, it is what is taught by all major religions and philosophies, and abuseing anything can be bad.",
            "post_id": "3091367",
            "timestamp": "1214595563",
            "votes": 0
        },
        {
            "answer": "My husband was recently told that he is \"borderline\" Type II diabetic. He has been smoking pot (legally here in California) for the past year rather heavily. At about the same time as his diagnosis, he started having tingling sensations in his left leg, as if his leg/foot is asleep. This has been going on for the past two or three weeks.Since he had been smoking pot prior to his fasting glucose tolerance test, we are concerned that this might have affected the results. Our doctor wasn't sure about the results and gave him metformin, but he hasn't been taking it because he is not fully convinced of the diabetes diagnosis, and we are concerned that if he starts taking the medication that it could create more of a problem.So my questions here are numerous. How does marijuana affect blood sugar levels? Does it raise or lower it? Does it have any affect on circulation, or nerves in the legs/feet?Does anyone have any experience with using edibles and their effects on blood sugar?I am really worried about this, and would like some solid information so we can make appropriate decisions regarding his health.Thanks",
            "post_id": "3153636",
            "timestamp": "1216048970",
            "votes": 0
        },
        {
            "answer": "does weed lower the blood sugar has anybody done studies on this my son who has type one smokes and i would like to know what brings on the munchies is it a side effect of thc please some scientific answers not politics or rough opinions",
            "post_id": "3427821",
            "timestamp": "1221878522",
            "votes": 0
        },
        {
            "answer": "As far as the effects of marijuana on diabetes well- it is not going to hurt as cited by http://www.ihop-net.org/UniPub/iHOP/pm/12720881.html?nr=10&pmid=18092149 in short it enables insulin to be produced at least to a small scale.The effects of marijuana on circulation, well it helps regulate blood, be that in a cancerous tumor (where you REALLY want regulation) or in your eyes which are faultering. It helps keep things at their normal levelsWhile I am sad to hear Godardess that your boyfriend recently was diagnosed I am sure it was a long time in the making and would be in worse shape if he had not started.",
            "post_id": "3479449",
            "timestamp": "1222940012",
            "votes": 0
        },
        {
            "answer": "As a college student and a type I for almost a year now, I have not noticed any detriment effects of pot on my BG control. Although I don't smoke very often (few times a month), I do go out with friends to bars, etc but my sticking to only the few beers I can drink without worring about my BG swinging up or down, I am able to forget about the disease and have a good time out. Also, as long as you're mentally strong enough to stick with your diet, you'll do fine.",
            "post_id": "3845191",
            "timestamp": "1231301138",
            "votes": 0
        },
        {
            "answer": "i have had diabetes since i was 3i myself cant rememebr ever not having diabetesi have a pretty controlled A1c at 7.4to answer the question straight upmarajuana doesnt effect your blood sugaralthough the munchies you may get after canbut to take care of that try to eat meat protein stuff without to much carbs or sugar (which yo hould be doing anyways)if you do happen to stumble apon a reeses or some kind of candytake a few units for itmake sure its the right dose!and dont smoke alone if you get lowyour gonna be to out of it to help yourselfi think personally smoking marajuana is better for diabetics than drinkingwhen drinking there is carbs and sugars that effect your blood sugarand you have less control if you get drunk than highi myself have experimented with bothwhen drinking my sugars went from 375 to 86 to 280just terriblesmoking nothing just some much that i bolused for with my mini med pumpI also watched a show on marajuana use today on the national geographic channel and they talked briefly about how marajuana use has been studied with diabetes and it can help maintain bloodsugari myself play sports and choose not to smoke often for i need good lungs to run and i will probably never test this theory outi dont recommend smoking marajuana muchone its illegaland two its not good for your lungsif ur diabetic you should definently do sum sort of fund raising thing for diabetes there are plenty out therein your generation hopefully they find a cure, but your helping other generations of diabetics out!well thats all i have to say",
            "post_id": "4005792",
            "timestamp": "1235024595",
            "votes": 0
        },
        {
            "answer": "i want to know more about inhaling the smoke and its affects on the blood vessels    what about the important things    like this?????",
            "post_id": "4030756",
            "timestamp": "1235608445",
            "votes": 0
        },
        {
            "answer": "To respond to your post, honestly I think that the only danger with marijuana is overeating due to the munchies(that term definitely survived long past the 1970's haha). Honestly though, I don't know if you have ever been high before, but it isn't usually like you can't do anything, in fact people can't always even notice when I am high. I am still able to test my blood sugar and accurately bolus for food that I eat on my insulin pump even when I'm stoned (and I can verify this accuracy later when sober, it has never failed me). Also, when smoked, you can \"dose\" yourself on how high you want to get, as the effects hit fairly quickly. While many people are scared of the fact that marijuana potency has increased it is actually healthier to smoke very potent marijuana. Like I said, you can \"dose\" yourself while smoking and think about it, is inhaling less smoke to get the same effect bad for you? No, quite the opposite actually. I would however tell him to steer clear of other drugs that are much more dangerous, but again, if he must he will probably do what hes going to do and should research anything extensively before trying it.",
            "post_id": "4571050",
            "timestamp": "1245225532",
            "votes": 0
        },
        {
            "answer": "I'm 19 years old, in my second year of college and have been smoking pot since I was 14. I was diagnosed with Type 1 when I was 16 and personally I haven't found any problems with the marijuana itself raising or dropping my blood sugar levels; as most people say on here, it's the munchies that'll bite you in the butt. my a1c level is at a 7.2, so I can really say I've got things pretty well under control (although still not where I'd like to be). When I have a pretty bad case of the munchies and don't feel like going through giving myself a shot (because of the laziness pot enduces) I simply eat some veggies, peanuts or some sort of meat (I personally LOVE peppered beef jerkey). Although when there is a pizza sitting on the table, taunting me with its delicious smells, I'll just suck it up and have a few units of humalog lol.I will agree with the folks on here stating that pot is NOT that bad. Diabetics should NOT drink alcohol under any circumstance! I advocate marijuana use for everybody if they choose to be intoxicated (let alone diabetics!!!)... people have been ingesting THC for thousands of years and they're not going to stop any time soon. Just because some politician on a stand in D.C. says that it's illegal doesn't mean that it's \"bad\". It's just his opinion, which unfortunately has power. Be free thinkers! ... and if you're worried about the smoke that causes lung damage, there's these things called vaporizors you can buy either online or in a head shop. If you have problems inhaling THC even at that point, make yourself a decent batch of sugar-free brownies or something.Anyhow Cheechee, before I get on a rant, I don't believe there's a diabetic pot-smoker in existance who well say that the marijuana itself has a detrimental affect on their health... It's just the munchies, which is quite easily managed.Thanks for the post!!! :):)",
            "post_id": "4975485",
            "timestamp": "1255554703",
            "votes": 0
        },
        {
            "answer": "I am 59 yoa.  Been smoking pot over 40 yrs.  I used to smoke cigarettes too. I quit them 36 yrs ago with the help of marijuana.  When I 1st quit cigs i smoked more pot at first but after a few weeks went back smoking same amt as before I quit cigs. I was diagnosed type 2 2yrs ago.  Still smoking pot but it doesn't affect my BG either way.  I just have to watch what I eat for munchies.  No problem.  I practice self dicipline all the time.",
            "post_id": "5066398",
            "timestamp": "1257896255",
            "votes": 0
        },
        {
            "answer": "What a brilliant thread !!Hi, I'm a 51 yr old male & was diagnosed 2 years ago as a Type 2.  I've smoked dope on & off since University & I can certainly endorse all the comments above that run along the lines of ...pot is NOT that bad, I just have to watch what I eat for munchies, I have not noticed any detriment effects of pot on my BG control etc etcI have never actually checked but will now do a personal \"calibration check\" with the BG over 24 hours.  Great idea guys, Thanks!I've been lucky so far ... I do suffer night time leg pains & I can honestly say that they are less troublesome when I am gently stoned.I found this thread after reading    http://news.yahoo.com/s/nm/20091114/ts_nm/us_oregon_potcafe    which states that the cafe has been opened to provide for medical Mary Jane-ers.As far as the fact that this is illegal?  It is not illegal to smoke but posession & dealing carry increasing penalties.  Anyhow, who of us can honestly say that they have never enjoyed the occasional extra mph on an empty motorway?  That also is illegal.Another link that might be interesting (This is the Prof Nutt paper that caused sackings & resignations from the advisory panel here in the UK)... http://www.crimeandjustice.org.uk/estimatingdrugharms.htmlAt the end of the day it is all a personal choice as to whether you will or will not use the weed.  I am pro-and am very interested to hear whether anyone knows of specific medical evaluations ... both pro & con.Hope it goes well for you all !!!Keith",
            "post_id": "5079504",
            "timestamp": "1258222734",
            "votes": 0
        },
        {
            "answer": "I have been a diabetic for 17 years and I was diagnosed when I was 5. You are a fool if you think that being diagnosed early in life will make it any easier being a teenager with diabetes. The problem that, that 20 year old has probably stems from the ignorance of healthcare professionlas like yourself. Do you have any idea what it is like to not eat or drink (oh my gosh, yes I mean alcohol) like any of your friends. My advice to the 20 year old is go for it my man. You smoke that joint and get some relief from the **** that these doctors keep spewing out like their lives depend on it. At least you will have a few hours of happiness before you die of kidney failure or go blind from diabetic retinopathy becuase most of the time it is inevbitable no matter how well you look after yourself!",
            "post_id": "5259772",
            "timestamp": "1263308172",
            "votes": 0
        }
    ],
    "post_id": "2429486",
    "question": "HiI am new here and i hope i am not breaking any rules but my question ia about what effects smoking pot (marijuana) will have on my son (20yrs old) who is diabetic. I am not 100% sure that he is doing this but am sure he has tried it at least once and i want to be able to give him all the correct information about the dangers he is putting himself in before i speak with him about this.Of course there is the effects which will happen whether he had diabeties or not but i would be grateful for any advice which anyone may have on this subject.",
    "timestamp": "1087621200",
    "title": "effects of smoking marijuana and being diabetic"
}