{
    "answers": [
        {
            "answer": "I would try to keep an open mind when discussing your options with your liver specialist. I hope you're seeing a hepatologist (liver specialist) and not a gastroenterologist (digestive disease specialist). If you aren't seeing a hepatologist you should be as that is the only type of doctor qualified to guide your care at this stage.I have no idea what your underlying liver disease is or what other medical issues you have. It is possible that your other issues would preclude you from receiving a liver transplant but until you undergo a thorough evaluation and have an in-depth discussion with a hepatologist you should not foreclose any options and that includes a liver transplant if it is appropriate.Good luck Leeza,Mike",
            "post_id": "9384002",
            "timestamp": "1376402593",
            "votes": 0
        },
        {
            "answer": "I will echo what Mike has said.  It is essential for you to be seeing a hepatologist, as only a hepatologist is able to care for a patient with Cirrhosis and especially with ESLD.  I'm glad that you're taking all of your meds.  Would you mind sharing with us what kinds of things have landed you in the hospital?  Ascites?  Hepatic Encephalopathy? Ruptured varices?There are many very knowledgeable people on this forum:  Randy, Mike, and Hector just to name a few, and I encourage you to share more information with us.  You will find very knowledgeable and supportive people in the same situation that you are in who can guide you and answer your questions.Advocate1955",
            "post_id": "9385353",
            "timestamp": "1376429065",
            "votes": 0
        },
        {
            "answer": "You look really young. I'm sure all of this is frightening no matter what age.I have many friends who have had transplants and are living out their lives. You were put on this planet for a purpose. I hope you will just surrender to the doctors advice.I used those exact words 3 years ago today. I surrender. I told my doctor that I would do everything he said if he could save my life. He did. It was worth the effort on my part.Keep fighting hunnyo.xo Karen:)",
            "post_id": "9385524",
            "timestamp": "1376432405",
            "votes": 0
        },
        {
            "answer": "I am seeing a hepatologist, but today I went in to see him feeling scared and hopeless, only to get the most amazing news, my MELD score went down to 6 with a life expectancy of 5 years. I am still set with not getting a transplant just eating healthy taking all my meds and praying. I have uncontrolled diabetes, peripheral neuropathy, frequent flora in my bladder and gastroparesis. My hospitalization is always because of my elevated blood sugars. I have stage 4 liver cirrhosis!",
            "post_id": "9386080",
            "timestamp": "1376446277",
            "votes": 0
        },
        {
            "answer": "So this is great news Leeza. MELD 6 means that your liver is well compensated (performing all of its important functions). I don't know about the life expectancy of 5 years part. My husband has Cirrhosis and has been MELD 7 for for several years and we are not anticipating that he will die in two years. The progression of scarring on the liver is not linear, so there is no way for anyone to predict life expectancy, but with MELD 6, you probably have beginning Cirrhosis, and are nowhere near ESLD, which is a stage of liver disease when peoples' livers are failing and not performing all of their necessary functions. I'm glad that you are seeing a Hepatologist, since you do have Cirrhosis. In my husband's case, he is seen by his Hepatologist every 6 months to check his labs and do either an ultrasound or a CT scan to screen for liver cancer. He has a colonoscopy every 3 years and an endoscopy every 3 years, since there have been no problems in the colon or esophagus. But as I said, she does labs, imaging, and physical exam every 6 mo to look for signs of liver decompensation (meaning liver not working well) and/or liver cancer. He checks w his hepatologist before taking any supplements or prescriptions. He eats a lot of fresh fruits and veggies, exercises, and does not eat red meat or take a vitamin with iron.Advocate1955",
            "post_id": "9386197",
            "timestamp": "1376448432",
            "votes": 0
        },
        {
            "answer": "\"I was diagnosed in January with ESLD\"No one who has End-Stage Liver Disease has a MELD score of 6. Patients with ESLD have MELD scores in the 20s-30 normally. Your MELD score is so low that you are not even close to needing to have a liver transplant so I don't understand why you mention \"ESLD\", \"my decision which is to not have a transplant\". When you don't even need a transplant.The MELD score scale goes from 6 - 40. Meaning you could only have early cirrhosis at the worse since your liver is functioning normally and your blood counts for liver disease are normal. Both are shown by your MELD score.Talked to your doctor and you will find out you do not have ESLD. Whatever makes you think that is wrong.There is no life expectancy for someone with a MELD score of 6. Where you got that idea I have no idea. Many of us have much higher MELD score for for than 5 years and we still aren't sick enough to get a transplant.\" I am tired of feeling sick all the time, tired of feeling tired, I am scared but what else can I do?\"You may have other health issues that are affecting you but your liver disease is not advanced enough for most people to have any symptoms at all except minor fatigue because your liver is still able to perform all of its functions normally.You don't mention any symptoms of liver disease except fatigue which is a symptoms of many other diseases too or could be related to the drugs you are taking to treat your other ailments.Take to the doctor that are managing your other illness and find out why you feel the way you do.I realize that cirrhosis is new to you but your worries are way out of step with reality. You are not end-stage and not even close to liver failure. It will give you please of mind if you find out the true extent of your liver disease. Please educate your about cirrhosis so you won't have fear about things that have no reality to them. Find the cause of your liver disease and try to get treatment for it if there is some before your liver disease gets worse over time.Good luck.Hector",
            "post_id": "9386420",
            "timestamp": "1376453181",
            "votes": 0
        },
        {
            "answer": "Hello Leeza and welcome to MedHelp.I am sorry to hear about your diagnosis but as Advocate has so well explained a MELD of 6 is good as far as cirrhosis is concerned problem is it is very important to address the cause of your cirrhosis to prevent any further advancement. Though the information I have provided below does not pertain to cirrhosis it is some information I wanted to make sure you knew. This explains the spikes in your blood sugar and necessary hospitalization. I can imagine your diet is pretty strict now but if your cirrhosis continues to advance it will become even more complicated.It is imperative you do everything you can to get control of your diabetes or your symptoms will advance and so will your cirrhosis. Please visit our diabetes communities also, maybe they can help.TYPE 1 Diabetes:http://www.medhelp.org/forums/Diabetes---Type-1/show/220TYPE 2 Diabetes:http://www.medhelp.org/forums/Diabetes---Type-2/show/46Non-alcoholic fatty liver disease (NAFLD) is one cause of a fatty liver, occurring when fat is deposited (steatosis) in the liver not due to excessive alcohol use. It is related to insulin resistance and the metabolic syndrome and may respond to treatments originally developed for other insulin-resistant states (e.g. diabetes mellitus type 2) such as weight loss, metformin and thiazolidinediones.[1] Non-alcoholic steatohepatitis (NASH) is the most extreme form of NAFLD, and is regarded as a major cause of cirrhosis of the liver of unknown cause.---------------------------------------------------------------------------------------------------It's not always clear what leads to gastroparesis. But in many cases, gastroparesis is believed to be caused by damage to a nerve that controls the stomach muscles (vagus nerve).The vagus nerve helps manage the complex processes in your digestive tract, including signaling the muscles in your stomach to contract and push food into the small intestine. A damaged vagus nerve can't send signals to your stomach muscles. This may cause food to remain in your stomach longer, rather than move normally into your small intestine to be digested.The vagus nerve can be damaged by diseases, such as diabetes, or by surgery to the stomach or small intestine.Risk factors:Factors that can make it difficult for your stomach to empty properly include:•\tDIABETES•\tAbdominal surgery•\tInfection•\tCertain medications that slow the rate of stomach emptying, such as narcotic pain medications and antidepressants•\tCertain cancer treatments•\tAnorexia•\tBulimia•\tScleroderma•\tParkinson's disease•\tHYPOTHYROIDISMComplications:Gastroparesis can cause several complications, such as:Bacteria overgrowth in the stomach. Food that stays in the stomach can begin to ferment and disrupt the balance of good and bad bacteria. This can allow harmful microorganisms to grow out of control.•\tUndigested food that hardens and remains in your stomach. Undigested food in your stomach can harden into a solid mass called a bezoar. Bezoars can cause nausea and vomiting and may be life-threatening if they prevent food from passing into your small intestine.•\tBlood sugar fluctuations. Although gastroparesis doesn't cause diabetes, inconsistent food absorption can cause erratic changes in blood sugar levels, which make diabetes worse. In turn, poor control of blood sugar levels makes gastroparesis worsehttp://www.mayoclinic.com/health/gastroparesis/DS00612/DSECTION=complicationsI hope this information will help you and I wish you all the best! Take care,Randy",
            "post_id": "9386487",
            "timestamp": "1376454464",
            "votes": 0
        },
        {
            "answer": "my diagnosis is stage 4 liver cirrhosis, my meld scores are from March and unfortunately it wasnt",
            "post_id": "9386779",
            "timestamp": "1376462829",
            "votes": 0
        },
        {
            "answer": "disregard previous comment to Hector, trigger finger. Please excuse my bad use of grammar.my diagnosis is stage 4 liver cirrhosis, I have been seeing a liver specialist since I had my gallbladder removed in 2008 and the surgeon noticed that my liver looked abnormal and did a biopsy and was told I had stage 3 liver fibrosis. I have been sober since January 2013, I was hospitalized with abdominal pain and elevated blood sugar, I was told that I had stage 4 liver cirrhosis. I have a lot of health issues as a teenager up until I was 26, I was both anorexic and bulimic, a diabetic since I was 13, hypothyroidism, major depression with anxiety disorder, I take celexa and Ativan, an alcoholic (bourbon always, sober since January 2013), drug user, cocaine mainly (sober since January 2013), a smoker (not smoked since January 2013). I stopped cold turkey, its been hard but I am doing very good.",
            "post_id": "9386830",
            "timestamp": "1376464991",
            "votes": 0
        },
        {
            "answer": "Thank you for your kind words, yes I am scared, I am learning as time goes by and it's all new to me and it scares me a lot!.",
            "post_id": "9386887",
            "timestamp": "1376466854",
            "votes": 0
        },
        {
            "answer": "Leeza, congratulations you are dealing with more than your share of suffering and I am sorry. It appears you have taken a very bad situation and are now using your understanding of where that lifestyle ends up to improve your life. That is no small accomplishment. Unfortunately not everyone gets the \"wake up call\" in time. You have taken many major steps so far and I encourage you to continue to work to overcome the many challenges you have. It is great that you stopped drinking when you did as your liver disease may be able to reverse itself if you only have stage 3 or even early liver disease. When folks develop ESLD the liver can no longer be saved and that is why a liver transplant is the only option. I understand it is very hard to change our behaviors but I can assure you that life is well worth while even if we live in various types of pain.Just to let you know where I am coming from which may help you...I suffered with major chronic depression for many decades in my earlier life so I know what mental suffering is. I am very fortunate to no longer have depressive episodes thanks to the work I have done using therapy and medication.I have been waiting for a transplant for many years now and first decompensated in 2009 due to surgery for cancer in my foot. More recently (the last two years) I have been fighting liver cancer. This year my cancer has gotten out of control and I am no longer able to get a transplant. So I have been trying many cancer treatments in order to save my life. I have some of the best medical care in the country yet until less than 2 months ago no one could figure out why my cancer was behaving like it was, and not responding to repeated, standard treatments. I have hope now as the 5th cancer treatment finally worked partially in July. I just had treatment number 6 last week and am hoping to get back on the transplant list in September and get a transplant ASAP because I have been sick for almost 4 years now and people who have liver cancer for more than a year and a half have very poor outcomes. So I know what it is to struggle and be scarred of death as I have been planning on dying for many months and have put all my things in order. Until July's results I had less than a 12% chance of one year survival which is not a position anyone ever wants to be in.Taking it one day at a time and doing the best you can do everyday is enough to keep you going. There will be ups and downs. I'm afraid that is the nature of life and we all have to find our own ways to deal with that. Personally I rather be alive and suffering than dead and not suffering. I believe to be alive is worth suffering for.I wish you the best.Please get support from those around you. None of us can do this on our own. We needed medical and physiological help. That is why there are liver clinics and transplant centers, support groups for almost every illness and therapists to help you with the mental trauma disease and addiction can cause. Don't be afraid to seek it out  or ask for it. I assure you you are not the only only suffering. We all suffer in own own ways. Life is about learning how to deal with its suffering and taking pleasure in all of the \"taken for granted situations\" which really are quite beautiful if you choose to see it that way. Everyday to are alive is a gift that should be appreciated and cherished in my opinion.Best to youHector",
            "post_id": "9387068",
            "timestamp": "1376478335",
            "votes": 0
        },
        {
            "answer": "Hi there, welcome, you have received responses from the best people on this forum.I know how afraid one can be when they find out they have cirrhosis.  I thought it was a death sentence.I came here and I learned quite a bit.  It does get easier for your brain to wrap around the diagnosis.  Then you will realize this is not a death sentence and that there are things you can do to help yourself.I hope that you take the opportunity to get help.  You have done some great things so far to help yourself, as Hector said.Now you need to have the transplant center help you.  In 2008 I was told that I would need a transplant in 5 to 10 years if I did not get rid of the HCV I was suffering with.  I treated, it is gone and I and my liver are improving.  I believe you can too.While I understand this is all new, scary, confusing, try doing what the others above have said.  they have given you wonderful, helpful advice.My best to youD",
            "post_id": "9387197",
            "timestamp": "1376483810",
            "votes": 0
        },
        {
            "answer": "Thinking about you mentioning that you have been hospitalized for your sugar levels.  Are you on medication for your diabetes?  Have you been given a diabetic diet?  Some people can control their diabetes with changes in their diet.  Some with meds some have to do both.  Just a couple of thoughts.Good luck",
            "post_id": "9387217",
            "timestamp": "1376484278",
            "votes": 0
        },
        {
            "answer": "I am on an insulin pump, I have type 2 diabetes since I was 13 years old and have been on insulin since then. I am semi vegetarian, I eat chicken and fish and only organic foods and vegetables.",
            "post_id": "9388696",
            "timestamp": "1376515226",
            "votes": 0
        },
        {
            "answer": "I am stage 4, that is what my hepatologist told me. And thank you for your kind words. I am so sorry for everything you have been through and going through.",
            "post_id": "9388699",
            "timestamp": "1376515421",
            "votes": 0
        },
        {
            "answer": "Hi Leeza, and welcome to the forum! I am so impressed at all the tough changes you've made since Jan 2013! That is one huge list of major accomplishments! Is Jan 2013 when you were told you had stage 4 cirrhosis? I got that news in June of 2004 and I will never forget how it felt. I'd had major abdominal surgery for a choledochal cyst and as it was a particularly tricky surgery right next to the hepatic aorta, they assigned the head of the liver transplant team at Stanford to be my surgeon. Before surgery I knew I had hep C but believed my liver was still only stage 1 fibrosis. The first thing I  remember after awakening from surgery was the transplant surgeon telling me I had stage 4 cirrhosis, that my liver looked every bit as bad as the ones that are discarded during transplant surgery and that I should get my affairs in order. I remember ESLD being mentioned as well, though I can't remember exactly what was said about it. I know I was pretty sure it was just going to be a matter of time before I would need a liver transplant. I haven't had alcohol or used NSAIDs since then, and I've gone through two lengthy and difficult HCV treatments. The most recent one ended in Sept 2012, and it finally worked, so I no longer have the virus that did most of the damage. I've also learned a lot more about the liver and about cirrhosis since I was first diagnosed, most of that knowledge coming via this website and/or links people have posted here. The info on this site is extremely high quality, as we have some very well-educated members who are active enough to catch and correct those occasional glitches by less-informed posters. I now know what compensated cirrhosis means, and that the transplant surgeon was a little out of line in the severity of what he told me. I've never even been given a MELD score, but if I had been it probably would have been 5-8 at its worst, and now it would probably be under 5. I've had the compensated cirrhosis for 9 years now and instead of steadily declining as I originally was led to expect, I've actually improved significantly since I eliminated the virus. My hepatologist doesn't say my liver can still regenerate itself, but he does say it will \"remodel\" itself into a healthier form. The most important things you can do at the compensated stage are to make sure you have an excellent hepatologist who works with a liver transplant center, and to do everything possible to eliminate the factors that are causing the liver damage, so no new damage can occur. You've done a great job at eliminating alcohol, drugs and cigarettes, but its not clear to me whether those are your only sources of damage. If you aren't sure either, then you have important questions for your hepatologist. My main point in responding though is to encourage you to be more optimistic about your outlook. After 9 years of stage 4 cirrhosis I'm no longer expecting to eventually decompensate and need a transplant. I know its a possibility but I've learned that it isn't really a probability. Good luck to you!",
            "post_id": "9391354",
            "timestamp": "1376590651",
            "votes": 0
        }
    ],
    "post_id": "9383146",
    "question": "I was diagnosed in January with ESLD, have been under treatment taking all my meds, have been hospitalized too many times to count. Just turned 43 in May, I also have many other health issues! tomorrow I have an appointment to see my liver specialist and figured out what's my next step and discussed with him about my decision which is to not have a transplant at all and just lived comfortable until whatever happens happen! I will continue to take all my medicine as usual. I am tired of feeling sick all the time, tired of feeling tired, I am scared but what else can I do?",
    "timestamp": "1376370534",
    "title": "ESLD and scared!!!"
}