{
    "answers": [
        {
            "answer": "It may be improvement but higer FT3 can damage your heart and cause other \"bad\" things",
            "post_id": "7757843",
            "timestamp": "1331414915",
            "votes": 0
        },
        {
            "answer": "You really need to get some better info.  Such a general statement about Free T3 can be misleading.  I suggest that you read this letter written by a good thyroid doctor for patients that he sometimes consults with from a distance.  The letter is sent to the PCP of the patient to help guide treatment.http://hormonerestoration.com/files/ThyroidPMD.pdf",
            "post_id": "7757887",
            "timestamp": "1331415822",
            "votes": 0
        },
        {
            "answer": "As I understand it we are talking overt hypothyroid and subclinical. Here's a bit of a study.Research Journal of Pharmaceutical, Biological and Chemical Sciences Thyroid dysfunction and total cholesterol - experience in a tertiary care hospital\"Hypothyroidism is defined as a deficiency of thyroid hormones resulting from reduced secretion of both T4 and T3 [1]. Biochemically decrease in T4 and T3 concentrations lead to hyper secretion of pituitary TSH and an amplified increase in serum TSH levels. This is a key laboratory finding, particularly in the early detection of thyroid dysfunction [2]. Lipid abnormalities are reported to be more common in patients with overt hypothyroidism and are thought to contribute to the disproportionate increase in cardiovascular risk laboratory finding, particularly in the early detection of thyroid dysfunction [3]. Hence, hypothyroid patients are at high risk of cardiovascular diseases laboratory finding, particularly in the early detection of thyroid dysfunction [4].Levothyroxine replacement therapy significantly improved the lipid profile in hypothyroid patients laboratory finding, particularly in the early detection of thyroid dysfunction [5] indicating the possible relation between thyroid hormones and lipid levels in the blood of hypothyroid patients. Relation between thyroid dysfunction and cardiovascular diseases has been a subject of interest for many clinical investigators for a long time. Overt hyperthyroidism and hypothyroidism is the established risk factor for Cardiovascular Disease (CVD) but the relation between Subclinical Hypothyroidism (SHT) defined as an elevated Thyroid Stimulating Hormone (TSH) with normal thyroid hormones (fT3, & fT4) and hypercholesterolemia related to cardiovascular risk is still controversial laboratory finding, particularly in the early detection of thyroid dysfunction [6,7,8,9]. Thyroid has also important effects and influences in the Basal Metabolic Rate (BMR) and the metabolism of carbohydrate, lipid and proteins laboratory finding, particularly in the early detection of thyroid dysfunction [10]. Hypothyroidism has been generally considered as cardiovascular risk factor in majority of studies, mainly because of its association with elevated Total Cholesterol (TC) and LDL cholesterol. Hypercholesterolemia in hypothyroidism probably results from reduced catabolism of lipoproteins, a phenomenon that may be explained by a decreased expression of lipoprotein receptors laboratory finding, particularly in the early detection of thyroid dysfunction [11]. Hence, it is important to see the relation of total cholesterol and thyroid dysfunction. The result can also be useful for screening thyroid dysfunction in the patient having high total cholesterol level in the serum.Thyroid has important effect in the metabolism of carbohydrate, lipid and proteins. Level of serum total cholesterol is maintained by the level of thyroid hormone through its catabolism, by up regulating or down regulating LDL receptors.\"I think in getting the right balance in FT3 one would get the proper metabolism throughout and that should be considered as well in treating other problems such as cholesterol instead of taking statins and treating all these problems independent of one another. That's why I wondered if anyone who had their FT3 in a good upper normal range also happened to see an improvement in their lipid panel.",
            "post_id": "7758101",
            "timestamp": "1331421384",
            "votes": 0
        },
        {
            "answer": "My lipid panel worked in direct relation to my FT3/FT4 levels, for quite some time.  I never had a cholesterol issue until my thyroid \"whacked\"; once my FT3/FT4 went below what my body needed, my cholesterol levels went out of sight.  When FT3/FT4 levels came up, cholesterol levels went down.  There did come a time when thyroid levels were good, but cholesterol still high...... exercise has been my best friend recently......  in Nov 2011, my cholesterol levels were very high; the only thing I changed was increasing my walking to approximately 5 mi/day and in Feb my cholesterol levels were all in the normal ranges, with FT3 almost the same as in Nov.FT3 certainly seems to have a bearing, but, for me, that's not the only factor; exercise/proper diet seems to have to be included in order to get it all in sync.",
            "post_id": "7758211",
            "timestamp": "1331424613",
            "votes": 0
        },
        {
            "answer": "Higher levels of FT3 are only dangerous if they are WAY high for extended periods of time...... this would be hyperthyroidism and yes, all kinds of bad things can happen, but most of the time, the patient feels so badly, it doesn't progress to the extent you refer to.",
            "post_id": "7758216",
            "timestamp": "1331424741",
            "votes": 0
        },
        {
            "answer": "I agree there are many factors. But this may be one that the docs who only look at tsh miss. People who are subclinical hypothyroid probably have rising cholesterol and LDL but often aren't treated for the thyroid which might bring their lipids into normal. On the flip side the Dr won't allow them to get into subclinical hyperthyroid range because of the risk to heart and bone. The 2011 study shows that not to be the case. That's huge...a win win. A patient can get the FT3 in upper range but won't risk osteoporosis if remaining subclinical hyperthyroid and it may correct the lipids, along with proper nutrition and exercise.I just think it's almost irresponsible for Dr not to look at it all. Course I have a dog in this fight so I am interested.",
            "post_id": "7758320",
            "timestamp": "1331427051",
            "votes": 0
        },
        {
            "answer": "I have a dog in the fight, too, because of my low TSH and every doctor who sees that, wants to reduce my med(s), even though FT3/FT4 are not where they need to be.Of course, doctors that rely only on TSH will miss a lot of things.  When they test someone with high cholesterol, the first thing they want to do is put the patient on statins - that's how they wanted to handle mine and I refused.  I said that if my cholesterol doesn't come down with proper thyroid medication, I'll think about it.You're also correct that doctors won't let patients get anywhere near hyper; again, I can attest to this because of my lower than low TSH....... doctors see that and panic, no matter what my FT3/FT4 levels are!!Of course, it's irresponsible of doctors not to look at the whole picture, but I don't think they're trained to do that anymore.  It seems that they can only treat each symptom by itself; not looking at the entire body. For instance, high cholesterol \"obviously\" needs statin drugs, not thyroid medication or exercise; high blood pressure \"obviously\" needs bp med, not exercise or better diet, calmer lifestyle, etc; fatigue/exhaustion \"obviously\" needs anti-depressants, not thyroid medications or vitamin B12 shots (yes, I'm on both).  Of course, I'm being facetious; we patients have learned to connect our illnesses/symptoms much better than most doctors can do, these days.  All too often we get thrown into the \"depressed\"  or \"hypochondriac\" files.  Irresponsible?  Yep, for sure........Not to mention that you also have to follow a money trail; which drugs/treatments bring in the most $?  My Tirosint and generic T3 med aren't going to net any doctor as much as scripts for Lipitor, Crestor, or an echocardiogram, stress test, etc.My rant for the week............lol",
            "post_id": "7758425",
            "timestamp": "1331429624",
            "votes": 0
        },
        {
            "answer": "And thank you for that rant. My Dr suggested Lipitor then I read about muscle pains...really? Besides that she never thought to connect progesterone I was taking to fatigue and headaches, if i didn't have basement Vit D I might not have osteoporosis, and oh by the way, selenium is pretty important as well, no mention of it. I have in my own obsessive compulsive way connected my dots and researched my labs to get to the bottom of it. My rant for the week....lololol",
            "post_id": "7758626",
            "timestamp": "1331433715",
            "votes": 0
        },
        {
            "answer": "Statin drugs make me want to rant lol.  But i found one article that pretty much sums up the latest \"nail in the coffin\" on statins.   Memory loss, confusion, high blood sugar and type 2 diabetes are possible side effects of statins - all brand name and generic versions of statin drugs must now carry these warnings on their labels.\"Statins Cause Type 2 DiabetesFriday, January 20, 2012  -  Byron Richards, CCNThe statin scam is one of the worst examples of how Western medicine has sold several hundred billion dollars of a near worthless drug to millions of Americans, conning the gullible into believing that a better number on paper as the result of taking a drug somehow equates to an improvement in health.  The latest nail in the statin coffin shows that women who consistently take their statins, as their doctors so happily instruct them to do, have a whopping 71 percent increased risk of developing Type 2 diabetes.The research* is based on 161,808 postmenopausal women aged 50 to 79 years at 40 clinical centers across the United States.  The researchers are from the University of Massachusetts Medical School and Harvard Medical School.  In other words, this is mainstream Western medicine research.Just as important as the study results is the bewildering press release.  It tries not to alarm anyone, puts a bizarre spin on the risks and benefits of statins, and suggests that you “be sure to talk to your doctor,” (the same person who has been poisoning you).The question is, how can the “benefit” of a drug that causes a disease known to drastically increase the risk of heart disease be good for long-term heart disease prevention?  The answer: It’s only “good” if you are trying to put children and healthy people (the new target market for statin idiocy) on these drugs.Needless to say, the scholars at these prestigious think tanks could not figure out why statins cause diabetes.  They still haven’t quite figured out the basics of how the human body works and what statins are doing to it.Let me give them a few clues.  Statins are anti-energy by core means of operation.  Any time you reduce the energy function of a cell you reduce the ability of that cell to burn calories as fuel.  This creates metabolic inefficiency and insulin resistance, with increased fatigue and eventual Type 2 diabetes.The medical profession cannot be trusted to make correct decisions for patients when its fundamental philosophy of treating numbers on paper with drugs is more important than the person in front of them.  Certainly some people are in difficult cardiovascular situations wherein the many risks of statins may be offset by a short-term benefit.  Taking statins short-term would give a person time to get their act together.  This type of situation, however, represents a small percentage of people on these drugs.  For the majority, the serious risks of developing heart disease or Type 2 diabetes outweigh the benefits.  Of course you would like better cholesterol numbers.  However, you want those improved numbers because you are healthy, not because you took a sledgehammer to the core system of survival in your body.  There is no shortcut to a higher quality of health.\"",
            "post_id": "7759431",
            "timestamp": "1331470230",
            "votes": 0
        },
        {
            "answer": "Thanks for that....... I think I've also read/heard that bringing cholesterol levels down with drugs, does not necessarily, prevent heart attack or stroke.You're right; you want better numbers, because you're healthy.artms - my husband was on some type of cholesterol med for some time; he got the most horrible muscle pains, plus it did weird things to his mind.  Against the advice of his doctor, he went off them, and while his cholesterol does still remain somewhat high, he no longer has the muscle pain, etc.  He's quite slim and stays active.I think, for me, activity is a key.............. my cholesterol came down when I began walking 3-5 miles/day, in spite of my thyroid levels.",
            "post_id": "7759715",
            "timestamp": "1331479761",
            "votes": 0
        },
        {
            "answer": "\"That's why I wondered if anyone who had their FT3 in a good upper normal range also happened to see an improvement in their lipid panel. \"-Yes, huge improvident. As a past endurance athlete for 17 years (retired from that in 05) my lipids were sliding towards the not so good ranges and I was slightly hypo on a T4 med during those last 8 years. Lack of exercise or diet was not the problem. Hashimoto contributed to ending my competitive days in several ways, mostly body pain and diminishing energy. Thats also a good excuse to just spectate now, plus I'm not getting any younger LOLI still tried to remain in good physical condition but not like in the past, never gained weight but lipids continued to slide in the wrong direction. Until last summer, after one year on ERFA T3/T4 that is. A huge improvement on all lipid panel tests despite less exercise. My FT3 is around 1/3 into the range, fasting AM blood draw. Heart palps present on T4 med only, went away with the addition of T3 supplementation from ERFA.I dont think its a coincidence.Someone from my past had unhealthy lipids, had several strokes and then after was discovered to be hypothyroid. To late.LM",
            "post_id": "7759954",
            "timestamp": "1331485599",
            "votes": 0
        },
        {
            "answer": "I may have mentioned this before but if not here's a link to the study regarding low TSH and cardiocascular/osteo risks.This was a huge leap.This is an study of the affect of TSH on fractures and cardiac issues. Endochrinologists say low tsh levels lead to problems, but how low is problematic? Thought you might like to read the abstract.Maybe show your DocNote that subclinical low is .04-.4 mU/l\"We aimed to examine the safety of having a TSH which was either suppressed (≤0.03 mU/l), low (0.04–0.4 mU/l), ‘normal’ (0.4–4.0 mU/l) or raised (>4.0 mU/l) in a population-based cohort of patients all of whom were treated with thyroxine.\"\"People on long-term thyroxine with a high or suppressed TSH are at increased risk of cardiovascular disease, dysrhythmias and fractures. People with a low but not suppressed TSH did not have an increased risk of these outcomes in this study. It may be safe for patients treated with thyroxine to have a low but not suppressed serum TSH concentration.\"Read the full abstract here:http://www.endocrine-abstracts.org/e...a0021oc5.6.htm5 March 2010 - 18 March 2010Society for EndocrinologyBritish Endocrine Societies",
            "post_id": "7759973",
            "timestamp": "1331486345",
            "votes": 0
        },
        {
            "answer": "Hmmm.................Weve all heard that suppressed TSH is dangerous. One Dr wanted to make my hypo for that reason. I left him. Extremely suppressed with over the top free T3/T4, is a different story, then yes; thats hypo. When weight lifters keel over from illegal T3 use, they load up on it before lifting, kill themselves more or less.Studies should take note of T3 and T4 levels, not using TSH. If you dont feel hyper, your not. These studies seem flawed.Plus, the longer your on thy meds the more suppressed (artificially) TSH gets.My heart rate and BP also improved with FT3 in the upper third. I actually get high BP when hypo.Since I'm male, heart health is more important to me than osteo issues. After have \"video\" of my heart combined with a resting heart rate of 60-65, Dr said I'm in the top 10% of the population, 5% for my age. I'm not worried, heart palps when I was hypo made me worry.",
            "post_id": "7760036",
            "timestamp": "1331488296",
            "votes": 0
        },
        {
            "answer": "Many feel well with the FT3 in upper range. To get there the TSH often drops. It would be interesting to see if there is  a typical range of drop. Would it fall within the subclinical range? It did for me. Then if the drop is a little too much could you adjust to the low subclinical and still feel ok. Of course this may be more of an issue for women but still. It seems a good starting point for all the maladies would be the thyroid levels and then work out from there.What started all this for me was my dr dropping my dose at the mere hint of low tsh. OMG saw an endo and she wanted to get my tsh to 1 and my frees were in the basement at .30 Never knew till this happened that you have to do so much work on your own to figure it out.",
            "post_id": "7760096",
            "timestamp": "1331490248",
            "votes": 0
        },
        {
            "answer": "typing error - \"Extremely suppressed with over the top free T3/T4, is a different story, then yes; thats hypo.\" -obviously I meant thats hypEr.",
            "post_id": "7760138",
            "timestamp": "1331491646",
            "votes": 0
        },
        {
            "answer": "My TSH went to the basement, as soon as I was started on thyroid med, but with FT's either low or below range.  Doctors kept wanting to cut my med to bring up my TSH, regardless of FT's, and of course, every time, they cut my med, I went right back to hypo he// and had to start over.  My endo is the only one who adjusts my med and I don't have to fight too hard with him, because he goes by how I feel more than the TSH, even if he does cringe at my < 0.01 TSH.It's not the low TSH that causes heart trouble, bone loss, etc; it's high levels of FT3 that does it.  I've had both a heart workup and bone scans since I've been hypo with severely suppressed TSH.  Cardiologist says my heart is fine, even though I have a couple of leaky valves.  I've got my bp pretty much in control now and my resting heart rate is around 50 - 55, but my cardio says that's okay because I'm active; I do yoga, which actually centers on deep, rhythmic breathing.  My last bone scan showed that I had actually rebuilt bone, previously lost to osteopenia - yes, in spite of my suppressed TSH.  This involved implementing a regimen of calcium, magnesium and vitamin D.My FT3 is not quite to the upper 1/3 of the range yet, but endo did give me a slight increase in T3, in order to try to bump it up; I'll retest late this month to see where I'm at.I'm on synthetic med(s) - Tirosint @ 88 mcg with generic T3 @ 7.5 mcg; like some others who have been around for a while, I feel better than I have in a very long time.",
            "post_id": "7760218",
            "timestamp": "1331494164",
            "votes": 0
        },
        {
            "answer": "hi Barb...happy to pass that info on. I only know three women taking a statin drug and one has type 2 diabetes and two are pre diabetic!  75% who have a heart attack have normal cholesterol levels. The lipid hypothesis has more holes in it than swiss cheese. :)",
            "post_id": "7761935",
            "timestamp": "1331557929",
            "votes": 0
        },
        {
            "answer": "So good to know about statins and diabetes .Great article. Wow! One thing my Dr suggested as an alternative is red yeast. Anyone use that?",
            "post_id": "7762235",
            "timestamp": "1331565054",
            "votes": 0
        },
        {
            "answer": "Just wanted to throw in my two cents worth.The study mentioned by artms caught my attention as well, since my TSH has been about .05, very suppressed, for well over 25 years.  Yet I have never had any heart problems or bone issues.  Since I am unaware of any evidence of TSH causing any of these things directly, then what is supposed to be the real cause, for which TSH would only be an indicator?By inference, I suppose it would have to be Free T3 and Free T4.  Yet we all know very well the number of reports that we have on the Forum of members with suppressed TSH, yet their Free T3 and Free T4 are well within the reference ranges.  Also, we know conclusively just how poorly TSH correlates with Free T3 and Free T4 before taking thyroid meds, and even worse after medication.I also noted that patients with high levels of TSH also had similar, or higher hazard rates than the suppressed group.  So are we to conclude that both too little and too much TSH causes heart problems and bone problems?  Not likely.So what is the underlying possible cause for the different hazard rates?  Was there any attempt in the full study to try to explain why this would occur?  I don't know.  There was no indication of that in the abstract.   One thing that did come to mind is that if patients have underlying conditions for heart problems, or bone loss, then higher levels of Free T3 and Free T4, as reflected somewhat by lowered TSH, may exacerbate the existing problems,   I have no conclusion, just thoughts; however, based on my understanding of the fallacy of relying on TSH to accurately reflect the levels of the actual thyroid hormones, especially after taking thyroid medication, at this time I see no reason to lose any sleep over this study, or change my opinion about what a suppressed TSH represents.",
            "post_id": "7762311",
            "timestamp": "1331566613",
            "votes": 0
        },
        {
            "answer": "Running on EmptyGimel Subclinical hyperthyroid for this study is  .04-.4 with normal FT3 and FT4, no symptoms. Note that the etiology of subclinical status is more important as a risk. These findings were beneficial to those with \"exogenous\" subclinical hyperthyroid resulting from thyroid medication as opposed to \"endogenous\" or those whose condition would naturally progress to hyperthyroid.I understand your concerns about the TSH and am impressed that within the endocrinology community these findings do seem to validate what we already know. Here's some more info for you thyrogeeks out there.Sorry if it's long.Some may be repetitious. And BTW more heads are better than one so I offer this to you, have at it and thanks for your input. I've learned a great deal and am happier for it.Thanks guys!---------------------------------------------------------------------------------------------------------Note that low is .04-.4 mU/l\"We aimed to examine the safety of having a TSH which was either suppressed (≤0.03 mU/l), low (0.04–0.4 mU/l), ‘normal’ (0.4–4.0 mU/l) or raised (>4.0 mU/l) in a population-based cohort of patients all of whom were treated with thyroxine.\"\"People on long-term thyroxine with a high or suppressed TSH are at increased risk of cardiovascular disease, dysrhythmias and fractures. People with a low but not suppressed TSH did not have an increased risk of these outcomes in this study. It may be safe for patients treated with thyroxine to have a low but not suppressed serum TSH concentration.\"Read the full abstract here:http://www.endocrine-abstracts.org/e...a0021oc5.6.htm5 March 2010 - 18 March 2010Society for EndocrinologyBritish Endocrine Societieshttp://www.australianprescriber.com/magazine/22/6/132/4Risk of osteoporosisThere has been some concern that thyroxine given in doses that suppress serum TSH to undetectable concentrations might promote osteoporosis. Meta-analyses of various controlled studies in which thyroxine therapy has been (in some patients) excessive are difficult to interpret because of the heterogeneity of patients studied.12,13 One meta-analysis suggests that postmenopausal women with serum TSH concentration suppressed to below the reference range have a higher annual bone loss than healthy individuals not given thyroxine12; another suggests that thyroxine therapy, even when adjusted to give a TSH value within the range, is associated with bone loss in premenopausal women.13 However, a study of 1180 women (largely postmenopausal) on thyroxine for over 1 year found no increased rate of fracture when serum TSH concentration was suppressed to below 0.05 mU/L compared with those with a serum TSH concentration in the range0.05-4 mU/L.14It is likely that patients most at risk of developing osteoporosis from thyroxine therapy are those whose hypothyroidism has resulted from treatment of hyperthyroidism that might already have reduced bone mass. This view is supported by the results of a case-control study involving 148 women that examined the effect of previous thyroid history and thyroxine therapy on bone mineral density: thyroxine therapy alone did not represent a significant risk factor for loss of bone mineral density, but there was an increased risk of bone lost in postmenopausal (but not premenopausal) women with a previous history of thyrotoxicosis treated with radioiodine.15 The risk of osteoporosis from thyroid replacement therapy has probably been overestimated.http://www.ncbi.nlm.nih.gov/pubmed/8...?dopt=AbstractOur study suggests that slightly suppressive L-thyroxine administration in nontoxic goitre can activate bone turnover but constitutes neither an actual risk factor for bone loss nor, consequently, for osteoporotic fractures.http://www.ncbi.nlm.nih.gov/pubmed/8...?dopt=AbstractT4-suppressive therapy was associated with bone loss in postmenopausal women, which could be prevented by either calcium supplementation or intranasal calcitonin, although the latter did not provide additional benefit compared to calcium alone. However, careful titration of T4 dosage to maintain biochemical euthyroidism is a better way to avoid the adverse effect of T4 on bone.http://hormones.gr/preview.php?c_id=171In conclusion, the etiology of subclinical hyperthyroidism possibly affects BMD in postmenopausal women. Postmenopausal women with endogenous subclinical hyperthyroidism have significantly lower BMD, mainly at the distal and proximal cortical bone,versus healthy postmenopausal women. Therefore, endogenous subclinical hyperthyroidism (both of autoimmune and non autoimmune etiology) might be considered as an additional risk factor for oseoporosis in postmenopausal women. On the other hand, exogenous subclinical hyperthyroidism has no effect on BMD. Postmenopausal women with subclinical hyperthyroidism have a higher bone turnover rate in comparison with the control group, though they do not differ in biochemical parameters of calcium and phosphorous metabolism.http://www.ccjm.org/content/77/11/803.fullhttp://hormones.gr/preview.php?c_id=144The management of exogenous SubHyper relies on appropriate adjustment of T4 dosage taking into consideration a) individual requirements in T4, sex, age and the presence of cardiovascular disease or other co-morbidity, b) the recognition that small changes in serum FT4 have a logarithmic effect on TSH, c) the variability of FT4-TSH interactions between individuals, d) the instability of T4 preparations and its bioavailability, and e) the values of serum FT4 and FT3 that accompany a suppressed TSH. This last parameter is of importance since it is the free thyroid hormones values in the serum that generate and reflect the thyroid metabolic state of the organism rather than the degree of TSH suppression.http://hormones.gr/preview.php?c_id=171The etiology of subclinical hyperthyroidism influences B MD in postmenopausal women. Endogenous subclinical hyperthyroidism might be considered as an additional risk factor for osteoporosis in postmenopausal women, especially for cortical bone, whereas exogenous subclinical hyperthyroidism has no effect on BMD.Therefore, it is likely that not only low TSH level but also the etiology of subclinical hyperthyroidism affect BMD.exogenous subclinical hyperthyroidism has no effect on BMD.http://www.ncbi.nlm.nih.gov/pubmed/17324919Endogenous subclinical hyperthyroidism might be considered as an additional risk factor for osteoporosis in postmenopausal women, especially for cortical bone, whereas exogenous subclinical hyperthyroidism has no effect on BMD.http://endocrinetoday.com/view.aspx?rid=62295“Our findings confirm that it may be safe for patients with hypothyroidism to take marginally higher doses of thyroxine than our currently recommended,” Leese said in the release.http://www.endocrine-abstracts.org/e...a0021oc5.6.htmSociety for Endocrinology BES 2010Manchester, UK15 March 2010 - 18 March 2010Society for EndocrinologyBritish Endocrine Societieshttp://www.imt.ie/news/uncategorized/2010/03/thyroxine-safe-with-low-tsh-levels.htmlAnd finally on google booksRunning on empty: hypothyroidism, introduction to an underactive thyroid glandBy Robyn KoumourouThis was an interesting back and forth with therapist about depressionhttp://www.dr-bob.org/tips/split/Thyroid-replacement.html",
            "post_id": "7762595",
            "timestamp": "1331572293",
            "votes": 0
        }
    ],
    "post_id": "7757753",
    "question": "I have been reading that there is a correlation between LDL, Cholesterol and FT3 in particular. Yhat raising the FT3 level will improve LDL and cholesterol. With LDL it has to do with reducing receptor sites. Has anyone here seen an improvement in their lipid panels as the FT3 got in the upper normal range?",
    "timestamp": "1331412870",
    "title": "FT3 and Cholesterol"
}