{
    "answers": [
        {
            "answer": "The debate about the natural history of HCV infection and its significance on mortality seems to have lost favor recently. On the one hand, if the infection can be cured without a risk to the patient and at a low cost to the health care system, it may not be relevant how likely a given patient is going to develop serious liver disease with associated morbidity and mortality; treating everyone with the infection would be the best strategy. On the other hand, if therapy is associated with many adverse events and a high cost, attempts to direct treatment to patients who are most likely to experience poor outcome from HCV infection would make more sense. At the dawn of a new era of specific antiviral agents against HCV, we hope that the former scenario may materialize in the near future. However, as of 2008, we submit that it is still relevant for clinicians to make the best judgment as to whom to treat and whom to monitor while withholding therapy.There are limitations to the data by Neal et al and other papers such as that of Amin et al. First, the incidence of late consequences of HCV infection increases with the duration of infection (Lancet 1997;349:825–832). As many American (and likely European and Australian) patients with HCV infection may be in their 3rd or 4th decade of infection, the incidence of liver-related death among HCV-infected individuals may accelerate in the future. Second, most of these studies are based on death certificates for determination of the cause of death. At least in the United States, death certificates are often incomplete and data based on death certificates tend to underestimate the true burden of the disease in question. Thus, not all deaths from HCV infection are attributed to the same, resulting in a falsely low estimate of the burden. Last, epidemiology data based on disease registry, by definition, exclude individuals whose HCV infection has not been diagnosed. Further, the proportion of undiagnosed HCV is likely much lower in subjects with evidence of liver disease than those without. This leads to an overestimation of the mortality risk because the denominator population (everyone with HCV) is underestimated. These different biases introduce inaccuracies in the estimation of mortality risk attributable to HCV infection.Given these considerations, what are we to make of these data? First, it remains pertinent that the clinician exercise the best judgment to estimate the future risk of an individual patient. As noted, not all patients with chronic hepatitis C have premature mortality from the infection and, in fact, the majority of patients with HCV are likely to live their natural life span. Therefore, efforts to estimate the risk of progression to serious liver disease continue to be of importance. In this sense, measures to gauge the progression of fibrosis, such as a liver biopsy or noninvasive measures of liver stiffness continue to be important. As we await more effective pharmaceutical agents to become available, hopefully in the near future, watchful waiting may be a very good strategy in those patients with minimal to mild liver disease and low likelihood of response to current therapy. Second, in the opposite situation, where antiviral therapy is likely highly to be successful and well tolerated, estimating the future risk of morbidity and mortality becomes less critical. Examples may include patients with genotype 2 and those with genotype 3 with low viral load in whom it may be possible to shorten the therapy to 12–16 weeks. Finally, both Neal et al and Amin et al highlight the importance of comorbid conditions prevalent in patients with HCV infection, such as drug addiction and alcohol abuse. Management of these patients is a challenging problem for clinicians and a multidisciplinary approach is necessary to address not only their liver disease but also co-existent psychosocial conditions, including depression and chemical addiction.© 2008 AGA Institute. Published by Elsevier Inc. All rights reserved.",
            "post_id": "5441736",
            "timestamp": "1267860864",
            "votes": 0
        },
        {
            "answer": "Thank you for sharing this interesting article.  I will probably read it a few more times.  It seems loaded with information (and perhaps some opinion too) that will make for interesting discussion.  Just to kick it off, I will forward a few thoughts myself.It is interesting to me to read that some 90% of us may die of causes other than HCV.  I think while this is appealing to me for a few reasons I find myself both wanting to delight in this, but also to argue with it some.As a group we are all aging and we may yet see a different curve involved as immune response predictably drops.  Vertex, which has some financial benefit to gain in treating people has made several pitches using studies for the need to create a better treatment since this seems to be a looming potential time bomb, with many of us getting into the later stages.  I think that I love reading the rosy point of view, but there are also some studies that denote a different view, a more pessimistic view of what is in store for our group.In a sense, I am hoping that for most of the people who read this forum the real issue may soon become mute.  The new PI's are soon to be approved and may bring the cure rate to about 75%- give or take, for genotype 1's.  Other treatments, perhaps polymerase inhibitors will further improve other genotype response rates, such as for g-3's.Vertex continues to feel that the joint use of twin PI anti-viral agents will be approved by 2014 or 15.  If so, the SVR rate will dramatically drop even further, perhaps approaching a 100% cure rate.  If this is so it may dramatically reduce the number of us in the rolls.  We may not ever find out whether this projection made in this article is correct.The article does not attempt to quantify the issue of quality of life or extra-hepatic diseases and issues, some of which are very slippery, hard to detect, diagnose, treat.  Some of which may be depression (not that depression can't be diagnosed or treated, but is it caused by HCV, and if so are treatments or prognosis different than other types of depression).  Diabetes may also become a result of untreated HCV and it may be, like HCC, a ticking time bomb for a portion of us.  Chronic fatigue, increased rate of pulmonary issues, yadda, yadda yadda.  They are still finding negative issues related to being infected.  Will these less detectable issues increase as we age; quite possibly.I also noted that my age and sex as being risk factors for death.  ; )  Not much that I can do about either, (that I want to change at the moment).  I note that drinking even one alcoholic drink per week is something that we can fore go which may improve our lot.  Part of my view is that as an at risk group, if we just walk the line a bit better in the area of diet and lifestyle choices than the norm we could see improved heath, possibly more than the uninfected, but at least, better improved than the core of the HCV infected from which they base their statistics.Thanks for the article.Best,Willy",
            "post_id": "5442418",
            "timestamp": "1267891335",
            "votes": 0
        },
        {
            "answer": "Willy makes some great points, and I agree with most of them.Chronic HCV has significant impact on quality of life, especially as the years pass. Its not just the progressive liver damage and its consequences, but also the predisposition to other disease processes that arise from HCV.The new PI drugs are showing signs of considerable progress in terms of higher probability of SVR with shorter treatment duration. Personally, I had made the decision not to treat with SOC when diagnosed in 2005. A year of nasty treatment with a 45% success rate was not a reasonable proposition for me, even given stage 3 liver damage. I was lucky enough to get into an early clinical trial for a PI drug, and the result was SVR. Its only in the last year of two that I've appreciated how much the HCV was actually degrading my overall health, now that its gone.",
            "post_id": "5442470",
            "timestamp": "1267892336",
            "votes": 0
        },
        {
            "answer": "Good post:  gives some encouraging data, but also like Willy, I'm not comfortable with the rosy point of view.One part of the data I would much question is the 'cause of death' in the 180 deceased patients:\"The most common cause of death was liver disease (29%), exclusive of hepatocellular carcinoma (HCC), followed by unrelated medical causes (28%), drug-related events (18%), and HCC (12%).\"Particularly the \"unrelated medical causes\"... recent evidence has demonstrated a direct correlation between hcv and the incidence of both (1) insulin resistance and (2) hypercholesterolemia.  Would diabetic or cardiac death be considered 'unrelated medical causes'?  Can we conclusively and comfortably exclude hcv as a contributing factor in these conditions?From a personal standpoint, I don't think we understand the mechanisms of liver function well enough to assume that it is without some blame in other medical issues.  My husband, who had hcc/hcv diagnosed as a result of a near heart attack has no history of cardiac disease/hypercholesterolemia in his family.  Since becoming undetected, his cholesterol became so low they reduced his statin use by 50%.  Obviously nothing to draw conclusions from, but enough personal experience for me to question how 'deadly' hcv can be.  It is absolutely true that hcv infection will not be the cause of mortality for the majority of individuals with it; the study even makes the point \"The debate about the natural history of HCV infection and its significance on mortality seems to have lost favor recently. \"...but at 10% death rates? As long as the mortality rate is >0% I hope its significance never \"loses favor.\"Thanks for the article.~eureka",
            "post_id": "5442824",
            "timestamp": "1267899794",
            "votes": 0
        },
        {
            "answer": "May I ask your age, genotype and the name of the PI drug?Heh - I just deleted several paragraphs explaining why I desire this information because I realized you are probably very much aware of why I want the info.Anyway, thanks in advance should you decide to share the info.",
            "post_id": "5443737",
            "timestamp": "1267925992",
            "votes": 0
        },
        {
            "answer": "I was diagnosed in 2005 with Geno 1b, VL of 24,500,000 AST 79, ALT 124, and S3 liver damage. Was 56 at the time, and most probably contracted HCV in the early 1970s via transfusion during surgery.I treated in Prove1, which was the first Stage 2 VX950/Telapravir trial, starting July 200612 weeks of VX950 + interferon + Riba, then 12 weeks of interferon + RibaTested UND at day 15 of treatment, and have remained clear since then. Most recent PCR was Feb 2010 as part of the Extend trial. Most recent LFTs taken in Feb 2010 were AST 19, ALT 22.",
            "post_id": "5443844",
            "timestamp": "1267928020",
            "votes": 0
        },
        {
            "answer": "The main thrust of this study was to highlight the need for doctors to be very selective in who they treat right now in light of the newer PI's coming out. Watchful waiting is a valuable tool to use in this setting. That's really about all it says.As for \"dying with HCV not from it\", none of this is new. This 10% (8%-12%) mortality rate has been around for over a decade and has a few studies to support it. Most people believe HCV to be underreported. If you accept this as a fact, then the mortality rate is going to even be that much lower as underreporting artificially inflates the mortality rate. The rate of HCC occurrence in those with HCV is 1%-3%. This is just the occurrence rate. Many are transplanted which eliminates the problem. Many are successfully treated. So mortality from HCC is even lower than  1%-3%. In another study it was found that those who relapsed but maintained normal biochemical functions had lower rates of HCC than those with SVR who have persistently elevated ALT/AST after treatment.HCV can affect QOL especially in those with advanced disease when almost all extrahepatic symptoms will appear. I suffer from a few such as sleep reversal, fatigue, etc,etc, so I have a good understanding of the issue. I have diabetes type 2 and have to take a pill a day for it. My glucose levels have all been stable for 4 years now and it hasn't affected my QOL at all up to this point.We all know that our QOL also deteriorates as we age. Its natural and one has to be careful not to blame every little ill, ache, or pain to HCV when the known symptoms of aging mimic many symptoms of HCV exactly. Just  because you can no longer get out of bed in the morning in a single leap does not necessarily mean it is the end result of HCV infection.I'm not aware of any extrahepatic manifestations aside from esl symptoms that will cause death.True that HCV has been linked to diabetes resistance. But many, many people with HCV also drank heavily, and had poor diets, as well. How do you really know what caused it in these cases ? And recent reports say that 35% of women in the general population aged 40+ are prediabetic.  Diabetes is an epidemic in this country and it is a medical problem for 25 million people.  Its highly likely that many with diabetes and HCV would have had insulin resistance issues anyway without HCV. Although a link has been established it is not easy to get real hard numbers on the causal relationship between HCV and diabetes.\" In 2006, Amin et al reported a large, carefully conducted study about the impact of hepatitis C in the population at large in Australia (Lancet 2006;368:938–945). Linking data from their viral hepatitis registry with the National Death Index, they found a total of 78,468 individuals with hepatitis C diagnosis, of whom 4194 died during a 13-year study period. The incidence of liver-related death was 0.14% per year for those with hepatitis C alone and 0.29% for those with co-infection between hepatitis B and C. The SMR for liver-related death for HCV infection was 16.8. Importantly, among those with HCV infection, the incidence of death (0.27% per year) and SMR (19.3) from drug-related causes were actually higher than those from liver-related causes, a trend more pronounced in women and younger age (<40 years) groups.\"If you notice above it says \"liver-related death\". This includes all deaths that resulted as a result of a diseased liver. It's from an Australian sample of 78,000 people where they list much more detail than their US counterparts for 'cause of death' as it states in the above article.A sample size this large would allow for some fairly exacting measurements.Extrahepatic manifestations carry low rates of occurrence for those without cirrhosis. If the rates of occurrence are given then it helps to create a clearer picture. For example one disease directly linked to HCV is cryoglobulinemia. If you suffer from it you understandably will probably find this meaningless, but the prevalence rate in one study of  34,000 US vets found the it to be .08%. Less than one percent. About the same rate for suicide from taking IFN.This study illustrates what I've known for a long time---this is one of the most over-treated diseases in history. With newer drugs and better tests to determine the likelihood of treatment success coming soon this may change this. This will hopefully curtail or altogether eliminate the scattershot approach to tx which is used now by indentifying those with a high probability of SVR before commencement of treatment.The fewer people exposed to drugs which are known for their toxicity, the better. Thanks for all of the thoughtful replies.ML",
            "post_id": "5444504",
            "timestamp": "1267949580",
            "votes": 0
        },
        {
            "answer": "Having been one who was rushed into treatment, even though I treated successfully, I have begun to have some doubts about the attitudes about HCV in western medicine.  It seems that patients are very under-educated and physicians have been brainwashed into panicking every single patient into IFN/riba therapy; regardless of the unknowable futures for most of those infected. This would not be an issue if the treament were shorter and less traumatic.  I'm hoping that they can get the TX down to just a few months, and the therapy not involving the crazy, life-scrambling interferon option.  That would make the current goal of treatment of every patient who screens for HCV a lot more palateable.  Personally, I think it would be great if medicine would just get better at predicting who really needs therapy and who can just be given a bit of lifestyle advice and followup.",
            "post_id": "5444706",
            "timestamp": "1267963716",
            "votes": 0
        },
        {
            "answer": "ML: \"True that HCV has been linked to diabetes resistance. But many, many people with HCV also drank heavily, and had poor diets, as well. How do you really know what caused it in these cases ? And recent reports say that 35% of women in the general population aged 40+ are prediabetic.  Diabetes is an epidemic in this country and it is a medical problem for 25 million people.  Its highly likely that many with diabetes and HCV would have had insulin resistance issues anyway without HCV. Although a link has been established it is not easy to get real hard numbers on the causal relationship between HCV and diabetes.\"I knew I'd read that the incidence of diabetes was higher in those with HCV so I went looking.http://www.biomedexperts.com/Abstract.bme/12829986/Hepatitis_C_virus_infection_and_incident_type_2_diabetes\" A priori, persons were categorized as low-risk or high-risk for diabetes based on their age and body mass index, factors that appeared to modify the type 2 diabetes-HCV infection incidence estimates. The overall prevalence of HCV in this population was 0.8%. Among those at high risk for diabetes, persons with HCV infection were more than 11 times as likely as those without HCV infection to develop diabetes (relative hazard, 11.58; 95% confidence interval, 1.39-96.6). Among those at low risk, no increased incidence of diabetes was detected among HCV-infected persons (relative hazard, 0.48; 95% confidence interval, 0.05-4.40). In conclusion, pre-existing HCV infection may increase the risk for type 2 diabetes in persons with recognized diabetes risk factors. Additional larger prospective evaluations are needed to confirm these preliminary findings.\"The conclusion here is that HCV itself doesn't increase the incidence of Diabetes but put it together with someone in a higher risk category for Diabetes, the presence of HCV increases the likelihood considerably.This study also seems to bear this out - those in the study with SVR had lower incidence of diabetes and those with risk factors who did not respond to treatment had higher incidences of diabetes.http://cat.inist.fr/?aModele=afficheN&cpsidt=21181270\"Multivariate Cox proportional hazard analysis revealed that type 2 diabetes development after the termination of IFN therapy occurred when histological staging was advanced (hazard ratio 3.30; 95% confidence interval [CI] 2.06-5.28; P < 0.001), sustained virological response was not achieved (hazard ratio 2.73; 95% CI 1.77-4.20; P < 0.001), the patient had pre-diabetes (hazard ratio 2.19; 95% CI 1.43-3.37; P < 0.001), and age was ≥50 years (hazard ratio 2.10; 95% CI 1.38-3.18; P < 0.001). Conclusion: Our results indicate sustained virological response causes a two-thirds reduction in the risk of type 2 diabetes development in HCV-positive patients treated with IFN.\"It's entirely possible that the presence of HCV has the same contributing factor to other extra-hepatic illneseses also, that the presence of HCV exacerbates an existing risk however more conclusive studies would be needed to confirm that.",
            "post_id": "5444838",
            "timestamp": "1267969655",
            "votes": 0
        },
        {
            "answer": "You made the comments:\"I'm not aware of any extrahepatic manifestations aside from esl symptoms that will cause death... Extrahepatic manifestations carry low rates of occurrence for those without cirrhosis. If the rates of occurrence are given then it helps to create a clearer picture.\"Some recent rates & data for you to consider:Journal of Hepatology, Volume 50, Issue 5, May 2009, Pages 883-894.\"HCV replication suppresses cellular glucose uptake through down-regulation of cell surface expression of glucose transporters\" (Daisuke Kasai1, †, Tetsuya Adachi1, †, Lin Deng1, Motoko Nagano-Fujii1, Kiyonao Sada1, Masanori Ikeda2, Nobuyuki Kato2, Yoshi-Hiro Ide1, Ikuo Shoji1 and Hak Hotta.)Background/Aims:Persistent infection with hepatitis C virus (HCV) causes extrahepatic diseases, including diabetes. We investigated the possible effect(s) of HCV replication on cellular glucose uptake and expression of the facilitative glucose transporter (GLUT) 2 and 1.Methods:We used Huh-7.5 cells harboring either an HCV subgenomic RNA replicon (SGR) or an HCV full-genomic RNA replicon (FGR), HCV-infected cells, and the respective cells treated with interferon (IFN). We also used liver tissue samples obtained from patients with or without HCV infection.Results:Glucose uptake and surface expression of GLUT2 and GLUT1 were suppressed in SGR, FGR and HCV-infected cells compared to the control cells. Expression levels of GLUT2 mRNA, but not GLUT1 mRNA, were lower in SGR, FGR and HCV-infected cells than in the control. Luciferase reporter assay demonstrated decreased GLUT2 promoter activities in SGR, FGR and HCV-infected cells. IFN treatment restored glucose uptake, GLUT2 surface expression, GLUT2 mRNA expression and GLUT2 promoter activities. Also, GLUT2 expression was reduced in hepatocytes of liver tissues obtained from HCV-infected patients.Conclusions:HCV replication down-regulates cell surface expression of GLUT2 partly at the transcriptional level, and possibly at the intracellular trafficking level as suggested for GLUT1, thereby lowering glucose uptake by hepatocytes.",
            "post_id": "5445455",
            "timestamp": "1267986119",
            "votes": 0
        },
        {
            "answer": "Journal of Viral Hepatitis, 2009, Volume 16 Issue 6, Pages 430 – 436Prevalence of glucose intolerance in patients with chronic hepatitis B or C: a prospective case–control study (A. Mavrogiannaki, B. Karamanos, E. K. Manesis, G. V. Papatheodoridis, J. Koskinas and A. J. Archimandritis )Summary. Despite several studies, the association of glucose intolerance with chronic hepatitis B (CHB) or C (CHC) virus infection remains controversial. We evaluated the prevalence of glucose intolerance by oral glucose tolerance test (OGTT) in patients with CHB or CHC in comparison with matched controls. In total, 189 consecutive outpatients with CHB or CHC and 189 subjects individually matched for age, sex and body mass index (BMI) were included. OGTT was performed in all cases, except in known diabetics, and glucose intolerance was defined as impaired glucose tolerance (IGT), OGTT-diabetes or known diabetes. Most patients with abnormal OGTT had normal fasting glucose (IGT: 69.8%, OGTT-diabetes: 54.5%). Compared with their own controls, CHB patients had a higher prevalence of IGT (13.6%vs 2.5%, P = 0.018) and family history of diabetes (34.6%vs 16.0%, P = 0.011), while CHC patents had higher prevalence of glucose intolerance (37.0%vs 15.7%, Ρ = 0.001), mostly because of more frequent IGT (21.3%vs 6.5%, Ρ = 0.003). After age and BMI adjustment, patients with CHC compared with those with CHB had significantly higher prevalence of glucose intolerance (37.0%vs 29.6%, P = 0.037). In conclusion, increased prevalence of glucose intolerance is documented by OGTT both in CHC and CHB patients compared with age, sex and BMI matched controls. Glucose intolerance is more frequent in CHC than CHB patients, regardless of known risk factors. An OGTT might be necessary at the baseline work-up of CHB or CHC patients, as a normal fasting glucose value does not exclude IGT or OGTT-diabetes.",
            "post_id": "5445457",
            "timestamp": "1267986182",
            "votes": 0
        },
        {
            "answer": "Liver International, Volume 29 Issue s2, Pages 13 - 25Special Issue: Metabolic Abnormalities in Chronic Hepatitis CHepatitis C, insulin resistance and diabetes: clinical and pathogenic dataLawrence Serfaty 1,2 and Jacqueline Capeau 1,2,3ABSTRACT:Epidemiological data indicate a strong risk for development of insulin resistance (IR), and, ultimately, overt diabetes mellitus (DM) in patients with chronic hepatitis C virus (HCV) infection. Steatosis, or fatty liver, is closely linked with IR in persons without HCV, such as those with metabolic syndrome, primarily due to increased visceral fat leading to altered adipokine production and increased free fatty acid (FFA) release. Moreover, there is evidence that liver fat can have an impact on the development of hepatic IR independently of changes in adipose tissue. Multiple mechanisms can account for the development of IR in patients with chronic HCV. In particular, there is evidence for a triangular interaction between steatosis, inflammatory processes and IR. In patients infected by the genotype 1 virus, steatosis is strongly related to IR, leading to a metabolic steatosis, while, in genotype 3 patients, steatosis is related to viral load in the context of a viral steatosis. Chronic inflammatory processes in the liver may be mediated by persistently activated macrophages and other immune cells, with concomitant overproduction of pro-inflammatory cytokines such as tumour necrosis factor-α. Activation of inflammatory pathways, together with increased levels of FFAs, can disrupt hepatocyte intracellular pathways and inhibit insulin signalling, leading to IR. Molecular studies have also shown that the HCV core protein can directly inhibit the insulin signalling pathway and increase reactive oxygen species production, both of which can further exacerbate IR. The available data provide an understanding of chronic HCV whereby chronic inflammatory processes, steatosis and IR contribute to each other, leading to an increased risk of DM, and its associated poor outcomes, in persons with chronic HCV.",
            "post_id": "5445460",
            "timestamp": "1267986248",
            "votes": 0
        },
        {
            "answer": "And 'extrahepatic disease\" may not be limited to diabetes:EUROPEAN JOURNAL OF GASTROENTEROLOGY & HEPATOLOGY 21 (8): 902-907 AUG 2009 Year: 2009PREVALENCE AND TREATMENT OF HYPERLIPIDEMIA IN PATIENTS WITH CHRONIC HEPATITIS C INFECTION.  (Murthy, GD)Abstract: Background Patients with chronic hepatitis C (HCV) infection can also have hyperlipidemia. Glucose intolerance has been associated with HCV infection and treating hyperlipidemia in this and other high-risk groups is warranted. We hypothesized that hyperlipidemia is common in patients with hepatitis C and that it is under-treated for fear of worsening liver function.Design From the Stratton Veterans Affairs Medical Center computerized database, we collected information on patients with HCV infection enrolled in hepatology clinic. We collected information on age, sex, duration of HCV infection, concomitant diagnoses, medications they were on, laboratory values including hepatic function, glucose, and lipid levels. We collected information on the lipid levels and various cardiovascular risk factors.Methods This is a retrospective study involving record review. We analyzed the data collected from the records for prevalence of high cholesterol (as defined by the National Cholesterol Education Program) and for prevalence of various cardiovascular risk factors. We analyzed prevalence of treatment of hyperlipidemia in various risk groups. In the patients who were treated for hyperlipidemia, we collected information on any worsening hepatic function that led to treatment discontinuation.Results Six hundred and twenty-eight (70.5%) out of 891 patients with hepatitis C had hyperlipidemia. Of the 628 patients who had hyperlipidemia, 81 (12.7%) had positive antibody and RNA not tested; 162 (25.4%) had positive antibody but negative RNA testing; and 385 (61.3%) had positive testing for viral RNA. Two hundred and eighty-four (45.2%) of 628 patients with hyperlipidemia were eligible for treatment to lower it. Of 146 patients with hyperlipidemia and diabetes mellitus or arterial disease who were qualified for treatment (LDL>99), 95 (65.1%) were treated with lipid-lowering medication. Of 148 patients with hyperlipidemia and without diabetes or arterial disease who were qualified for treatment, 64 (43.3%) were treated with lipid-lowering medication.Conclusion A high prevalence of hyperlipidemia in patients infected with HCV is observed. Prevalence is highest among those who are positive for viral RNA. About half the patients with hyperlipidemia were eligible for treatment with drugs to lower it. Treatment of hyperlipidemia with medication though surprisingly common could improve. Eur J Gastroenterol Hepatol 21:902-907 (C) 2009By no means should my presenting this data be interpreted as encouragement for those with hcv to rush to treat; rather, it's my hope that as success in eliminating chronic hcv increases, we'll see an improvement in the epidemiology of other possible extrahepatic manifestations such as diabetes, etc.~eureka",
            "post_id": "5445476",
            "timestamp": "1267986757",
            "votes": 0
        },
        {
            "answer": "It is just a personal story, but it might be interesting to some of you. Recently a father of my good friend died at the age of 88 from heart attack. On the autopsy they discovered that he had hepatitis C. They have no idea for how long he had it and where he got it. But my friend mentioned several times that up until the last year or so, when his father started having heart trouble, he was very healthy, and nothing bothered him. He only took some blood pressure pills. Lived good, long, and productive life, and had no idea that he had hepatitis C.",
            "post_id": "5445754",
            "timestamp": "1267994247",
            "votes": 0
        },
        {
            "answer": "That is really good to hear.! Thanks.",
            "post_id": "5446389",
            "timestamp": "1268012342",
            "votes": 0
        }
    ],
    "post_id": "5441735",
    "question": "Part 1\"This indicates that 90% of our patients with HCV infection will die of a “natural” cause.\"Volume 134, Issue 2, Pages 635-637 (February 2008)Mortality in Patients With Hepatitis CSurakit Pungpapong, MD, W. Ray Kim, MDGary R. Lichtenstein, Section EditorNeal KR, Ramsay S, Thomson **, et al. (University of Nottingham, United Kingdom). Excess mortality rates in a cohort of patients infected with the hepatitis C virus: a prospective study. Gut 2007;56:1098–1104.Hepatitis C virus (HCV) infection remains one of the major health care challenges worldwide. In the United States, it is considered the most common chronic blood-borne infection, affecting up to 4 million Americans. Although the incidence of new cases of HCV infection has been decreasing, the prevalence of chronic liver disease associated with HCV infection is thought to be on the rise. This is because of a significant lag, often ≥20 years, between the onset of infection and clinical manifestation of liver disease. Consequently, chronic HCV infection is one of the most common causes of liver-related morbidity. In the United States, HCV-related liver disease is estimated to account for 8000–12,000 deaths each year. Additionally, it remains a major indication for liver transplantation worldwide.The study by Neal et al (Gut 2007;56:1098–1104) was conducted to estimate the impact of HCV on mortality by determining the standardized mortality ratio (SMR) of HCV-infected individuals for all causes and liver-related mortality. The investigators used the database from the Trent Hepatitis C Cohort Study, in which a population-based cohort of unselected HCV infected individuals in the Trent Region of England was followed since 1992 with the purpose of elucidating the natural history of HCV infection.There were 180 deaths among 2285 subjects infected with HCV after a mean follow-up of 6.7 years. The most common cause of death was liver disease (29%), exclusive of hepatocellular carcinoma (HCC), followed by unrelated medical causes (28%), drug-related events (18%), and HCC (12%). Of individuals who died of liver disease, 24% were noted to have chronic alcohol use in addition to HCV. The mean age at death was highest for those with HCC (64 years) and lowest for those with drug-related cause of death (36 years). The mean age of decedents with liver disease (without HCC) was 51 years. Overall, HCV-infected individuals had a mortality rate 3 times higher than that of the general population (SMR = 3.0 for both men and women). The number of deaths from unrelated medical causes and suicide in the study cohort was close to the expected number of deaths in the general population.Neal et al also identified several predictors of mortality by assessing multivariable logistic regression analyses. Factors associated with liver-specific mortality included age (hazard ratio [HR], 1.04 per year), male gender (HR, 1.42), mean alcohol consumption (HR, 1.01 per weekly unit of alcohol consumption), and advanced liver fibrosis—the risk of liver-related death associated with Ishak fibrosis score of 6 was very high (HR, 61.7, compared with a fibrosis score of 0), whereas the risk was somewhat lower with a fibrosis score of 5 (HR, 15.7). In subgroup analyses for HCV-infected individuals who received pegylated interferon and ribavirin, sustained virologic response significantly decreased all-cause mortality with a hazard ratio of 0.1 (95% confidence interval, 0.01–0.9) compared with those with no response.CommentPrevious cohort studies exploring the relationship between HCV infection and mortality have demonstrated an interesting dichotomy. In several studies conducted in selected population subgroups, namely, those who acquired HCV infection through blood transfusion (Hepatology 2001;33:455–463; BMJ 2002;324:450–453; Hepatology 2005;41:819–825) or contaminated intravenous immunoglobulin (N Engl J Med 1999;340:1228–1233), or in military recruits (Ann Intern Med 2000;132:105–111), no significant increase in mortality risk from HCV infection was demonstrated. In contrast, community-based studies have tended to show that individuals with HCV infection have a demonstrably increased mortality rate compared with the general population over time (J Hepatol 1999;31:800–807; Int J Epidemiol 2000;29:922–927; Lancet 2006;368:938–945).The study by Neal et al is among several recent studies in which population-based data were used to analyze mortality in HCV-infected individuals. In 2006, Amin et al reported a large, carefully conducted study about the impact of hepatitis C in the population at large in Australia (Lancet 2006;368:938–945). Linking data from their viral hepatitis registry with the National Death Index, they found a total of 78,468 individuals with hepatitis C diagnosis, of whom 4194 died during a 13-year study period. The incidence of liver-related death was 0.14% per year for those with hepatitis C alone and 0.29% for those with co-infection between hepatitis B and C. The SMR for liver-related death for HCV infection was 16.8. Importantly, among those with HCV infection, the incidence of death (0.27% per year) and SMR (19.3) from drug-related causes were actually higher than those from liver-related causes, a trend more pronounced in women and younger age (<40 years) groups.In the United States, although gastroenterologists and hepatologists have long been aware that end-stage liver disease and HCC are important causes of death in patients with HCV infection, reliable population-based data about the mortality impact of HCV are sparse. For example, although up to 4 million Americans are infected with HCV, it has been estimated that only a small proportion of those infected, approximately 10,000, are estimated to die of sequelae of HCV infection. This translates to a mortality risk of approximately 0.3% per year on average. If an average person with HCV infection lives 30–40 years after the onset of infection, the lifetime risk of liver-related mortality may be about 10%. This indicates that 90% of our patients with HCV infection will die of a “natural” cause. Moreover, as Neal et al demonstrate, a substantial proportion of those who died of liver-related causes also had excessive alcohol consumption, further reducing the significance of HCV as an important cause of liver-related mortality. If these estimates are extrapolated to the US statistics, one would surmise that the mortality risk in Americans infected with HCV is not too different from that reported by Amin et al (0.14% per year).",
    "timestamp": "1267860825",
    "title": "HCV and Mortality Risk"
}