{
    "answers": [
        {
            "answer": "You have been given accurate information about HPV; symptomatic HPV infection (genital warts, etc) can show up several months after exposure.  But you probably have already been infected with HPV anyway; over 80% of all people who have had 4 or more lifetime sex partners have been infected with HPV.  The vast majority of infections are asymptomatic, never causing recognized warts or other problems.  In other words, look at genital HPV infection as inevitable, not generally an important health risk, definitely not worth losing sleep about it.As far as herpes is concerned, many HSV infections are asymptomatic and remain that way. But the risk is very low from any single episode of sex with a random partner, and I agree with your dermatologist that there is no particular reason to be tested for it in the absence of symptoms.I don't recommend further testing for any STD.  However, 3 months is the officially accepted standard for HIV.  If you remain anxious about that possibility, you might want to be tested one more time.  The result will be negative.Good luck--  HHH, MD",
            "post_id": "1551046",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "thanks...that was a really fast response:)",
            "post_id": "1620693",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "doc-have u ever been wrong?has anyone ever come back to this forum with a positive result after you stated not to worry?ie- gonorrhea after \"low risk\" bj etcjust curious",
            "post_id": "1620696",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "Have I ever been wrong?  Of course.  But not, so far, in predicting anyone's HIV results based on their exposure history.  Several months ago, someone who I judged to be at low risk later posted he had tested positive, but it rapidly became apparent that he was not being truthful.  He stopped participating in the forum after being challenged--at least with the same username.  Otherwise, nobody on this forum who I judged as being at low risk for HIV has ever come back and posted a notice saying s/he in fact had tested HIV positive.HHH, MD",
            "post_id": "1620701",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "thanks doc!its just that i read these threads (i'm trying not to post my story because i know i'm not unique and i will be told to read the archives) and people are having all kinds of unprotected oral sex, giving, receiving, men, women, transgender, straight, gay and it seems that they are ALL safe, low risk, non-std transmissible events - come on - i just find it hard to believe that NO ONE gets stds from oral sex !i guess i can't get it through my thick head - if SOME ONE has an std and SOME ONE has oral with that person - then std WILL, MUST be transmitted !!!! Especially bacterial stds like chlam / gonhelp i'm going nuts - dont understand HOW it can be safe!!",
            "post_id": "1620703",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "Good question.  What explains the apparent discrepancy between overall HIV epidemiology and my responses to questions about HIV acquisition risk?1) Probably most important is that people at high risk don't ask questions here; websites like this tend to attract the worried well.  And internet users tend to be educated and, on average, better off economically than society's average--strong predictors of lower HIV risk.  So I get questions from people with 5 seconds of pentration, or protected sex (maybe with condom slippage at the end), or brief oral sex without ejaculation, and all of this mostly from people who describe partners that do not seem to be at high risk.  This forum gets few questions from people who account for most cases of HIV/AIDS in this country, such as the wives or girlfriends repeatedly exposed to an injection drug using partner or a guy on the downlow; gay men repeatedly having unprotected sex with multiple partners of unknown HIV status; inner-city, drug using commercial sex workers (or their pimps); and so on.2) Even in fairly high risk settings, the risk of HIV transmission is low for any single exposure--so individual reassurance over any particular event usually is warranted.3) Oral sex is inherently low risk.  If you could magically make genital and anal sex disappear, to be replaced entirely by fellatio and cunnilingus, HIV/AIDS almost certainly would cease to be a problem; the efficiency of transmission is not high enough to sustain transmission in any population.  In contrast, I have repeatedly advised people that there is a risk of gonorrhea from oral sex (but apparently not chlamydia).There are other, more complex epidemiologic explanations as well; and the situation varies widely across populations around the world.  In any case, all I can do on this site is weigh the risks based on what people ask.  To the best of my ability, I give a straightforward assessment of the likelihood they acquired HIV.HHH, MD",
            "post_id": "1620709",
            "timestamp": "1142229600",
            "votes": 0
        },
        {
            "answer": "Dr.I'm so pleased with your last post on this thread. It explains your reasoning (which someone in the past could be puzzzled by) and basically answers a great part (if not all) of every question that anyone could post in this forum.I wish it will be a prelude for everyone to read before entering this site.I'm saving the post forever.Take care and good luck!!!",
            "post_id": "1620767",
            "timestamp": "1142402400",
            "votes": 0
        },
        {
            "answer": "OK-Here's the problem I have - the good Doc has repeatedly said here that insertive oral is LOW risk for ALL std's (let's forget about HIV which we all know is virtually impossible to catch via insertive oral) - highest risk possible HSV-1 - but overall LOW LOW LOW risk - this has been said ad nauseam - told multitude of people not to worry, testing not warranted, forget about it, don't obsess, etc. etc. etc. People have discribed all types of insertive oral, with women, men, pre-op ts and on and on and still the doc says \"DON'T WORRY - LOW RISK - woundn't recommend testing, etc\"Now, in a response to this thread we have:\"In contrast, I have repeatedly advised people that there is a risk of gonorrhea from oral sex (but apparently not chlamydia).\"So which is it - low risk don't worry or risk get tested ???I'm not questioning the expertise of the Doc as we all know he is a recognised expert but i guess i'm looking for some consistency.  I've also found replies that state \"don't worry unless you get symptoms\" - but i was under the impression that symptoms are NOT AT ALL RELIABLE !!! - NO GUARANTEE - NO SYMPTOMS DO NOT EQUAL NO INFECTIONIve also found conflicting threads regarding syphilis/chlamydia: threads that state low risk because syp/chlam is RARE in the throat - other threads that state you infact can get syp/chlam via insertive oral because it is so common in the gay community.I'm just nervous and scared and looking to sort things out - I've tried to consult the archives because i know my situation is not unique but in doing so i've just confused myself more.I've gotten the nerve to schedule a screening at a local clinic on friday - i hope all is well",
            "post_id": "1620771",
            "timestamp": "1142402400",
            "votes": 0
        },
        {
            "answer": "It's all in the context of the question.  You cannot expect absolute consistency in every response to questions about, say, transmission risk for fellatio.  Some people provide different details about the risk, have selected partners in different settings, and so on.Few sexually active people should be tested every time they have a risky exposure.  As I write this, I am between patients at the Seattle-King County STD Clinic.  The patient I just served is a 30 year old straight guy; he had distant past infrequent episodes of mutual oral sex with other men, more than 10 years ago.  He comes in once a year for an STD checkup.  He has no symptoms.  Since his last visit (April 2005) he has had 8-10 female partners, and most of whom have other partners on a frequent basis.  He tries to use condoms for vaginal sex (he doesn't do anal) and actually puts a condom on about 3/4 of the time.  He does oral both ways, without condom or other barrier.My advice to him was to keep doing what he is doing in terms of regular testing.  That is, routine testing for gonorrhea, chlamydia, HIV, and syphilis ONCE A YEAR is about the right frequency.  For most sexually active gay men or for commercial sex workers, and others who are more promiscuous, something like every 3-6 months make sense.  But I don't recommend anybody get tested after every potentially unsafe exposure.Are there exceptions?  Of course, lots of them.  The two main ones are to be tested immediately if there are symptoms that suggest STD/HIV; and if exposed to a KNOWN infected person.  But the large majority of people who post questions here are at far less STD/HIV risk than the patient I just described, and they generally describe exposures that are trivial to zero in their risk--often with partners who seem to be at low risk.Your question about symptoms:  You are right that absence of symptoms is no guarantee against infection.  But that doesn't mean everyone should be tested after every exposure!Finally, a prediction:  This little essay will further confuse some people.  I can't help it if common sense reasoning doesn't always sink in.  The bottom line is that all online responses to risk questions involve weighing probabilities, and not making decisions or recommendations that guarantee of safety.  There are no such guarantees.HHH, MD",
            "post_id": "1620779",
            "timestamp": "1142402400",
            "votes": 0
        },
        {
            "answer": "I'll take diabetes anyday over hivyou can't catch diabetes from your partner and you can't infect someone else with itWith all due respect - STUPID ANALOGY",
            "post_id": "1620860",
            "timestamp": "1142575200",
            "votes": 0
        },
        {
            "answer": "I was checking the archives at 'thebody.com' (sorry if I mention another site - don't know if this is taboo) - it seems that the advise given out there (Dr. Robert Frascino) is a little more conservative - thread after thread regarding insertive oral and the advise there is hiv \"low risk\" BUT get tested at 3 mo for hiv and other stds.WOW - I find this a little more than disturbing - I would have thought that the advise there would have been even more liberal than what is found here. (BTW - this site is much better since you actually get RESPONSES to posts!!!)As an example (JayJay99): \"While in Asia, I twice had unprotected oral sex (I am a male and received it from a female) that involved a lot of kissing. I also fingered a girl who happened to be on her period (I didn't know that beforehand). I got a good amount of blood on my fingers...\" yada yada yadaResponse: \"...But put the STD idea out of your mind.\"I would imagine that 'thebody' would have handled it differently: (ie - test for STDs; test for hiv at 3 mo)Why the difference of opinion? - How are we to know what to do? Given any particular scenario - one doc says \"forget it - go home - dont worry\" another doc says \"risk - lets test for stds - come back in 3 months for hiv test\"now my head is really spinning",
            "post_id": "1620854",
            "timestamp": "1142575200",
            "votes": 0
        },
        {
            "answer": "Right or wrong, I've never worried about HIV, so I'd never been to www.thebody.com until someone here posted about it. I was surprised at how (overly) conservative their advice is, especially given how low risk most posters there are.I was especially surprised to read the response to someone's question about whether HIV wasn't like diabetes, i.e. just another a chronic illness. The doctor replied that HIV was far more serious, because diabetes is a manageable chronic illness while new side effects and new strains of HIV are always emerging. That may be true, but I disagree overall. I really like this analogy, because I think it actually highlights the unrealistic views people have of various diseases and health risks. A LOT more people (in this country, anyway) have *unmanaged* diabetes, and a LOT more of them are facing some pretty significant serious consequences. Vascular damage, heart disease, stroke, kidney damage, blindness, you name it. And a lot of them are dying from complications of unmanaged diabetes - far more than the number of people dying each year in the US from HIV. I'm not a doctor, but just comparing those two illnesses, I'd think most people are MORE at risk from diabetes than HIV.So I just went to look, and here you go:20.8 million people",
            "post_id": "1620858",
            "timestamp": "1142575200",
            "votes": 0
        },
        {
            "answer": "Lol. No, it's a GREAT analogy. My point is that most people on this board are at virtually no risk of contracting HIV, but at significant risk of developing an equally serious chronic illness. So which do they worry about? I don't get it.But if you don't like my diabetes analogy because of the contagion issue, how about the flu? Every year about 36,000 people in the US die from the flu (CDC)... more than double the annual deaths from HIV in the US.If you really want to be healthy, take reasonable precautions. Don't smoke, eat a mostly (if not entirely) vegetarian, lowfat diet, exercise regularly. Wear your seatbelt. Use smoke detectors in your house. Use condoms regularly for vaginal and anal intercourse. Talk to your partners about their STD histories and get tested regularly. Work to accept yourself as you are - and that includes your sexuality.",
            "post_id": "1620870",
            "timestamp": "1142575200",
            "votes": 0
        },
        {
            "answer": "Whyme2006 posted: \"I was checking the archives at 'thebody.com' (sorry if I mention another site - don't know if this is taboo)\"HHH, MD:  It's not taboo at all.  I welcome comparisons and contrast with any online source you can find.WM2006:  \"- it seems that the advise given out there (Dr. Robert Frascino) is a little more conservative - thread after thread regarding insertive oral and the advise there is hiv \"low risk\" BUT get tested at 3 mo for hiv and other stds.\"HHH, MD:  I read Dr. Bob's forum regularly and I disagree.  With occasional exceptions (you can't expect 100% unanimity), our answers are pretty much the same.  Indeed, there have several times when it is obvious the same person has asked the same questions of both of us.  In those cases, I have never seen a substantive difference in our replies--especially in response to frightened and anxious people at little or no risk.  (There are other kinds of differences between us, however.  Bob just about always tells people who have had sexual exposures outside their committed relationships to 'fess up to their partners, because \"honesty is always best\".  I often disagree with that.  I also wish he would restrict \"WOO HOO!\" a bit.  It's fine if it means \"I'm happy my test was negative\", but sometimes it seems to imply \"Hooray, I can be sexually irresponsible again\".  That's clearly not Bob's perspective or intent, but some of the questioners seem to me to have that slant and he doesn't call them on it.WM2006:  \"WOW - I find this a little more than disturbing - I would have thought that the advise there would have been even more liberal than what is found here. (BTW - this site is much better since you actually get RESPONSES to posts!!!)\"HHH, MD:  Thanks for the thanks.  But you shouldn't find any of this disturbing.  Where the data are soft, as they often are, you should expect different experts to have slightly different perspective from time to time.Finally, as always, Monkeyflower makes some great points.HHH, MD",
            "post_id": "1620871",
            "timestamp": "1142575200",
            "votes": 0
        },
        {
            "answer": "monk-his response was in regard to INSERTIVE ORAL SEX !!!!the conventional wisdom doled out by numerous sites has been that insertive oral is virtually ZERO ZERO ZERO risk - everyone who asks regarding this type of exposure is told over and over and over again - virtually no risk, you will win the next lottery before you get hiv via insertive oral, better chance of being struck by lightning twice etc - now Dr Bob has place a NUMBER on the exposure - 1 in 20,000 - those odds are NOT in the lightning strike / lottery win range - those are TERRIBLE oddsmy main question to all is are these numbers the result of a recent study? are these true numbers or just a guess?",
            "post_id": "1620933",
            "timestamp": "1142834400",
            "votes": 0
        },
        {
            "answer": "OK Doc-Comment on THIS recent reply from Dr. Bob (thebody.com):Thread:  \"A Huge Huge Result!!! Oh My!!Mar 19, 2006Hey Doc, thanks for posting this story. Could be a real help to many! I WAS one of the worry wells on this forum for the past 6 months absolutely convinced I had aquired HIV by unprotected insertive oral sex with \"worker\"....\"Dr. Bob Reply:  \"The estimated per-act risk for acquiring HIV from unprotected insertive oral with a partner confirmed to be HIV positive is 0.5 per 10,000 exposures.\"These are pretty crappy odds!  Definately not in the lottery win or lightning strike range!!  Those odds are 1 in 20,000.  Pretty good odds of getting hiv from unprotected insertive oral.  Since Dr. Bob does not reference where these numbers come from and since he will not answer my posts (I guess I'm too boring) do you know if these numbers are the result of a recent study or Dr. Bob just pulling them out of his ***?",
            "post_id": "1620919",
            "timestamp": "1142834400",
            "votes": 0
        },
        {
            "answer": "Come on. Did you actually *read* his response? I just checked it out, and here is the main paragraph in its entirety:\"As for testing the source of an exposure, it can be helpful in some situations occupational exposures for health care workers, for example. However, considering the estimated transmission risk statistics for exposures like yours, it would not make sense. The estimated per-act risk for acquiring HIV from unprotected insertive oral with a partner confirmed to be HIV positive is 0.5 per 10,000 exposures. Your estimated risk would have been even less because you did not know the HIV serostatus of your \"worker.\" With risk statistics like that, whether the source was positive or not, testing would not make sense on multiple levels.\"That risk is with someone who is CONFIRMED HIV positive, not someone whose status you don't know. And you can't possibly be serious when you suggest that these are bad odds. I think it bears noting that those odds basically translate to one in over FIFTY YEARS of giving oral once a day, every day, to someone who is HIV positive. Put it into perspective. You are FAR more at risk of developing cancer, diabetes, or cardiovascular disease. You are seriously freaking over literally nothing.",
            "post_id": "1620932",
            "timestamp": "1142834400",
            "votes": 0
        },
        {
            "answer": "I had unprotected sex with a guy nearly 2 months ago i didnt know he had any stds. about 3 weeks ago i noticed sum small bumps on my vagina area but didnt really think anything of them and jus thought they mite be skin tags. about 2 weeks ago i had sex with another guy that is an ex i was with a year so i didnt use protection with him as i knew him well enough. i have become worried about the lumps so i went to see a gp n she said they mite be gential warts n i shud make an appoitment to see a clinic so i have but that isnt til thursday. the thing i am worred about mostly is that i have givin it to my ex. can he be tested straight away and can they know if he has gential warts or the hpv virus without there been warts there i dont know if he has the warts yet and i avnt told him this as i dont know how to break it to him and i want to know if they can find out straight away if he has it or not. please can u help me.",
            "post_id": "1621313",
            "timestamp": "1144126800",
            "votes": 0
        }
    ],
    "post_id": "1551045",
    "question": "hello,i had unprotected vaginal sex exactly 11 weeks ago with a female of unknown status.  I was tested for HIV at 6 weeks and it came back negative.  I was also tested for all other std's and that came back negative as well.  Ive been scared lately about possible herpes/ hpv infections.  I didnt have any symptoms of herpes and spoke with a dermatologist who told me i would know whether or not i have herpes within a month...and that only a few cases ever show up later.  He said HPV could show up a bit longer but typically within 3 months.  Is this guy right??  i thought that many people could develop symptoms much later than a month...and would 11 weeks be a pretty good sign that i havent contracted herpes or hpv? I just cant stop worrying about the fact that i may be infected...i know its neurotic, but could you please shine some light on the subject.also, ive browsed through your archives and feel pretty good about my hiv status being negative at 6 weeks...should i be worry about getting tested again?thank you",
    "timestamp": "1142229600",
    "title": "herpes/gentital warts question"
}