{
    "answers": [
        {
            "answer": "Hello magkenmare,First I want to tell you that I am not a medical professional, so the input that I give you is not to be taken in place of medical advice.I am a mother of a 9 1/2 yr. old boy who was diagnosed with Type I diabetes at the age of 3.  Also, my sister was diagnosed (2 yrs. prior to my son) at the age of 24.  She is now 32.My sis takes lantus and humalog, just like your daughter does. I do not have diabetes, however, I do understand that the weight issue is frustrating and sometimes even depressing.  My sister has had a very similar situation to your daughter's.  It wasn't until recently that she lost some weight.  Like your daughter, she tried everything she could think of.  Although this is unhealthy and I am not at all suggesting this, but she told me there were days she barely ate anything and no matter what she did she could NOT lose weight.I have a question for you....is your daughter on any other medication in addition to insulin?  The reason I ask is that there are certain meds, like antidepressants that can cause weight gain and / or make it very hard to lose weight while on them.  I know this from personal experience.magkenmare, I am going to talk to my sister as soon as I can and then post again.  I know that my mother is doing the South Beach diet, but my sis, because she has diabetes cannot follow it to a \"t\".  She mentioned something like she is doing a variation of it.  Please do not perceive me as saying your daughter should do that diet.  I do really need to talk to my sister and find out exactly what has helped her to lose some lbs.  It has been over the past month to month and a half that she has noticed some weight loss.  I believe she is really watching her fat intake and carb intake, however, she is not doing anything like Atkins.  When someone with diabetes is low, we all know they need carbs and in general need a certain amt. to balance out the blood sugars when insulin is taken.  We know this disease called diabetes is a balancing act.Every time I have seen my sis take a shot, it has been in her arm.  Honestly, I am unsure if the injection site has any bearing on weight gain or where an individual gains weight.  I am sorry.  I am certain that you will get a lot of great responses to your questions.I am definitely going to talk to my sister, as I mentioned previously.  I do believe she is wathcing carb intake, as well as fat intake.  I do know that her weight loss has not been dur to exercise because she is not on a regular exercise routine since she has fibramialga and her legs sometimes really hurt.I will post again ASAP.Although I am not a person living with diabetes, I can relate to the frustration when you do not know what to do when your weight is not where you would like to to be.Warm Regards,SS",
            "post_id": "2429692",
            "timestamp": "1095742800",
            "votes": 0
        },
        {
            "answer": "You know what magkenmare?  I would also love to know how to lose weight.  For two months now I have cut back on my fat intake to about 20 grams per day, I am exercising every day (20 minutes per day) and the whole nine yards.  Over two months guess how much weight I lost.  I didn't, I gained a pound.  Anyway, I will be waiting for a response, because I am anxious to get rid of the \"junk in the trunk\" :)",
            "post_id": "2433777",
            "timestamp": "1095742800",
            "votes": 0
        },
        {
            "answer": "I have a few thoughts on this subject.  I'm also not a physician, but a long-time DMer.Two things come to mind (1) \"feeding\" our insulin and (2) sluggish thyroid.I'll talk about #2 first cuz it'll be short ;-)  Many DMers also have issues with our thyroid, so I'd recommend anyone with \"junk in the trunk\" issues (Great phrase!) be sure to have your endo check your thyroid functioning.  Thyroid is another endocrine gland and when it's not producing all it's supposed to, I think that our metabolism is slowed.  That can lead to weight gain.\"Feeding insulin\" results when we're unwittingly taking too much insulin adn therefore have to eat to cover it.  Sometimes, it shows up as going low; other times it shows up as simply eating too much all day.  When I first started pumping, I actually LOST weight ... I wasn't trying to.  In figuring out why I lost, I realized that I am no longer waking up 2-3 nights a week to drink a juice box cuz I'm low; or eating an extra snack at night to prevent going low.  Each juice box and extra snack (that I didn't otherwise want) were examples of feeding my insulin.  I think this is most common with long-acting insulins that have a peak, like Lente or NPH.  My suspicion is that Lantus, which has little, if any peak, is less likely to require feeding.Do either of these suggestions seem like fruitful paths to look into?As a final note, does this \"junk in the trunk\" look at all like similar body characteristics in adult family members?  Parents?  Siblings? Aunts, uncles or cousins?  If so, there may be some genetic component of body shape that'll be really tough to overcome.Well, I suppose I have one more \"final note\" ... It may be worth while to check your BMI or your weight/height ratios.  In the US especially, there is a diseased perception of what a good weight is.  Often, folks at a healthy weight want to loose to a point where they'd be underweight.  Young women are more prone to that misperception of good health, but it's not uncommon among men.  I know a fellow who suffered that way.  I'm not suggesting that either of you are \"off\" in your self-perception, but I wanted to add this note for the many others who may be reading and who may not have a healthy self-perception.I wish you well and hope that this has been of some help.",
            "post_id": "2433778",
            "timestamp": "1095742800",
            "votes": 0
        },
        {
            "answer": "Dear magkenmare and vprrchk,SS and LRS have both given you great information. Weight gain and type 1 diabetes is a very serious problem. I would like to suggest that if it is at all possible to bring in a type 1 diabetes nutritional specialist that may help out with information that can help with weight loss.There is another website that I would recommend dealing with this subject. It is www.childrenwithdiabetes.com/dteam/indexweight_2002.htm. This is a well known and very much respected site.None of us here are physicians, but volunteers that can give our life experience and knowledge in dealing with type 1.Please keep in touch and let us know how things are going.Best to you,dm",
            "post_id": "2433781",
            "timestamp": "1095829200",
            "votes": 0
        },
        {
            "answer": "What was posted (above) by JDRF-Team-LRS:\"I realized that I am no longer waking up 2-3 nights a week to drink a juice box cuz I'm low; or eating an extra snack at night to prevent going low. Each juice box and extra snack (that I didn't otherwise want)\" makes a lot of sense!My sister did switch from NPH to Lantus...not sure exactly when, however, I know there were and might still be times that she wakes up low during the night and munches and doesn't always even remember it until she finds something half eaten near her bed.  LOL....I am not laughing at the \"night low,\" or diabetes, but my sis and I always laugh about the time she woke up and there were a few squashed grapes on the floor that she must have stepped on during her grape eating and the time she found a cookie in her bed.I do know that ea. person living with diabetes is different and responds differently.  My son has never done the waking up and eating bit during the night...even before the pump when he was son humalog & NPH.  I have tested him during the night and he was (on occasion ) low and I squirted the gel frosting I keep on his night table and had him take a few sips of juice and then he went back to sleep (he was already half asleep) and I waited to re-test him.I am going to ask my sister when she changed from NPH to Lantus and if she is still having then night lows and doing the night eating.  To be honest, I believe that she is been on Lantus for several months now and that it was hard on lantus to lose the weight that she thought she needed to. (you know...it is the \"I need to get back into my normal or usual size\" thing)One thin gI do have to add about my sis who an adult living with Type 1 is that, as I mentioned, like magkenmare's daughter she is on Lantus and Humalog, but I believe that an antidpressent or similar med. may have caused some weight gain and kept her from losing even when desperately trying to.  I believe her other doc either cut back on that particular med or took her off of it.I agree with and relate to our perceptions of ourselevs are sometimes off.Here is a link where you can enter your current weight, height, whether you are male or female and your age range and click calculate and see what it tells you.http://www.halls.md/body-mass-index/av.htmand another that is a charthttp://www.med.umich.edu/1libr/primry/life15.htmI definitely agree with LRS about your daughter having her thyroid tested if that has not been done in a while.  While searching this morning, I found the same advice.I do understand that when you are trying to lose and nothing is happening , it can be depressing and very frustrating.I am on the Internet a lot and I will see my sister tomorrow to ask her what she changed in the last 2 months to help her lose some lbs. and then I will post again in hopes that it will help your daughter:)",
            "post_id": "2433779",
            "timestamp": "1095829200",
            "votes": 0
        },
        {
            "answer": "Hello magkenmare,It is SS and I am back:)  As I mentioned previously, I am not a medical professional, so my input is based on experience.My sister is here next to me and she is going to dictate some info. re: what helped her to lose some lbs.  She was diagnosed with Type 1 at the age of 24, 8 years ago.I am not sure how much weight your daughter has to lose, but my sister wanted to drop a couple sizes to get down to what was her usual size.  She said she was very frustrated because some days she would eat low carb bars and a normal dinner and nothing else (unless low) and still NO Results.  My sister found this very frustrating just as your daughter does.  As we know, insulin is fat-producing.  The one thing my sis wants to mention is, if your daughter is on any OTHER medications (non-related to diabetes) possibly look at those and see what their side effects could be.As I mentioned, my Mom started doing the South Beach diet and what my sister has done is a modified version of it because in the beginning of the diet you are not intaking carbs and as you know people with diabetes CANNOT do this.  Here is what she did and is still doing:She limits white flour and modifies her carb intake.  She chooses foods that are low in fat.For example, she might eat lowfat cottage cheese with fruit or sliced tomatoes in the a.m. depending on her BG.For lunch, she might have a salad with cashews or some type of protein in it and pita bread with some avocado or tuna in it.Throughout the day she primarily drinks water, limits morning coffee to 2 cups.  She avoids eating pasta, pizza, bagels  - anything that is high fat and too much white flour.Instead of eggs, she has egg beaters, turkey bacon instead of regular bacon.My sister also suffers from fibramyalga (sp?) and hasn't been able to stay on a regualr exercise routine (as I mentione din my earlier post), so the recent weight los has not been due to exercise, but has to be due to her change in eating.There are 2 books on the South Beach Diet 2 choose from.  One tells how it works, food choices, etc. and is only around $5-$7.The other one has recipes and my sis and my Mom did not buy that one at the beginning.  This one is approx. $12-$15.  Neither of us are saying your daughter should follow this meal plan, but the changes my sis has made have helped.She dropped approx. 2 sizes in clothing in 2 months, so she knows the food ahcnges have helped.My sister and I wish your daughter luck.Please keep us informed:)Warm regards",
            "post_id": "2433783",
            "timestamp": "1095915600",
            "votes": 0
        },
        {
            "answer": "Hi,Regarding injection sites and fat deposition, I have noticed that my 4 year old son has definate enlarged pads of fat over all his injection sites. I was aware that insulin played a role in fat deposition within the body, but surprised to see local deposits where the insulin had been injected.Some Thoughts On Weight Loss with Insulin:(These are personal thoughts drawn from life and observation.I am not offering medical advice):Regarding weight loss, I can't see that this can easily be done by a person with Diabetes, unless they make educated reductions in their insulin along with an informed and appropriate reduction in carbohydrate intake. This is so complicated for even a doc to do on someone else's behalf, and they will always be overly cautious, as it is preferable that you are a bit overweight than sick or dead!The fat reduction is generally a red herring(type of fat matters), and will only make you feel worse if you reduce it unduly.As I see it, one can opt for calorie control, which will make you miserable and probably regain the weight quickly,(and this would only work if  insulin was reduced aswell), or you can work along the principles of how fats and carbs are metabolised. If you take a certain amount of insulin, you must take a certain amount of carbs(feeding the insulin), and the end result will be weight maintenance or weight gain. As soon as we feed insulin with unrequired energy, it is deposited as fat.( or glycogen if you are short on the stuff.).Diabetics are regularly forced to take excess carbs to \"feed\" the insulin and raise the blood glucose level. Excess carbs lay down fat. Limited carbs burn body fat(but only if the insulin is appropriatly reduced).If a non-diabetic person reduces their carb intake, their insulin production is also reduced. No-one likes to suggest altering intake of insulin for fear that one might go overboard and become really sick. Ketosis could be a problem if extreme restrictions were made(Some degree of ketosis is normal if one is losing body fat). Dietary fat cannot be properly utilised in the absence or shortage of carbohydrate, and will not, therefore cause you to gain weight under these conditions.I guess your daughter needs to work out a plan with her endo,on principles that she really understands, and that allows her to reduce insulin on a sliding scale with her proposed carb reduction and exercise plan. Increased exercise will also reduce her need for insulin, and if she exercises so much that she goes hypo, then she'll end up feeding the BG and limiting her weight loss on that day. I guess there will be some trial and error required, and it would be good to have a close buddy know what her plan is and to be there incase she overdoes things and doesn't feel well. Weight loss for people with Diabetes is tricky but it can be done.I really sympathise with you, and hope you find a manageable and safe plan for weight control.J J's mom",
            "post_id": "2433788",
            "timestamp": "1096174800",
            "votes": 0
        },
        {
            "answer": "It took me so many years to understand I was feeding insulin, I can't even tell you how many. For a long-time diabetic like myself, I feel like I got a set idea in my mind of how much insulin I needed and simply stuck to it, regardless of the number of reactions, so the feeding and feeding went on. And no doctor ever mentioned cutting back on the insulin in terms of weight control.Anyway, I now feel like I'm closer to actually taking the amount I need. But it requires a ton of testing! Wishing you much luck.Lesley",
            "post_id": "2433837",
            "timestamp": "1097643600",
            "votes": 0
        },
        {
            "answer": "Some background: I've been diabetic since I was 3 and am now 25. I got an insulin pump about 5 years ago and it makes a big difference in my ability to control what I eat. I have played competitive sports my entire life - all star ice hockey, soccer at the provincial, national and college level, mountain bike racing, snowboarding, XC running, tennis and volleyball. I now rock climb, run and lift weights.Unfortunately, due to working on my grad degree, I put on about 25 pounds of unwanted weight. However, I discovered that by balancing my calories in with calories burned I was able to lose all of that weight.  Through reducing my food (and my insulin pump basal rate), increasing my workout times or intensities, and keeping a journal of what I ate, I lost all of the weight I desired.Here's the trick:1. you need to figure out how many calories you burn (your basal metabolic rate + activity level):For women: 661 + (4.38 x weight in pounds) + (4.38 x height in inches) - (4.7 x age)= Basal Metabolic Rate (BMR)Then add your BMR to the calories you burn during activities: look this number up on the internet - type in something like \"calories burned running\" (or more generally: BMR x activity level.Sedentary: BMR x 1.15,for light activity-normal everyday stuff: BMR x 1.3,moderately active-exercise 3-4 times a week BMR x 1.4,Very active-more than 4 times a week: BMR x 1.6,Extremely active-exercise 6 or 7 times a week: BMR x 1.82. You need to figure out how many calories you are eating (keep a journal and write everything down)3. If you want to lose 1 pound of body fat in 1 week, you need to reduce the calories you need to maintain your current body weight by 500 per day for 7 days (this is equal to 3500 calories or 1lb of bodyfat). 2 pounds of bodyfat per week = 1000 calorie deficit per day. Can't lose anymore than 2 lbs of bodyfat a week, most people with their activity level can only burn 1.4. Don't drop below 1300 calories a day or you'll lower your metabolism and gain weight.5. Most people think just becasue they exercise they'll lose weight. If you're just starting out, working out for 20 mins is great, but consider the average female will only burn about 200-250 calories during a 20 minute run. That's 1/2 a cup of granola or less than a full bagel in most cases.6. here's my personal example I started out weighing 160, I followed the above advice and lost 2 pounds of bodyfat per week. My schedule: Monday, Wed, Fri 5:45am - 30 min weight circuit, work 7:30-5:30, 6-7 bouldering at indoor rock gym for 1 hour (get to hang out with friends and family). Tuesday, Thursday, Saturday 5:45am - 1 hour run, work 8-6, occasional walk with the family and dogs 20 mins in the evenings. At some point in time in the evenings I also worked on my thesis - so weight loss can be done even with a very busy schedule.7. Figure out how many calories you need to eat per day to lose your desired amount of weight in a week. Adjust your insulin according to this new eating plan. Ensure you are still getting the proper percentage of carbs, protiens, fruits, veggies and fats. Remember not to drop calories below 1300 pounds for women or you'll put on weight.Hope this helps, good luck to all of you.",
            "post_id": "2433850",
            "timestamp": "1098162000",
            "votes": 0
        },
        {
            "answer": "I've been type 1 diabetic for 17 yrs, on tight control therapy for 16, I'm a woman and I'm a professional dancer. So the weight issue has always been a big one in my life.You've got some good info already. However, I didn't read through everything, there were some rather long posts...so if I'm repeating anything I apologize but here's my two cents ;)First off, insulin is a growth hormone, if you are taking more then you need, you will gain weight. So number 1 it's important to work closely with your physician to make sure your basal or base insulin is the right amount for you. (body type, lifestyle, diet and exercise all affect this)Secondly, cutting back on unhealthy fats is good, especially since its important for diabetics to have really good cholesterol numbers. But the biggest diet change that will help to lose weight is carbohydrates. If you eat a piece of cheese or some almonds do you take a shot? no, why? because there is no carb content and what you ate will not significantly alter your BG.Carbs are important for giving us energy, so I don't think it's healthy to cut them out completely as in the Atkins diet, but just being mindful of your carb intake can make a huge difference.Another factor is low blood sugars. The more hypoglycemic episodes a person has, the more excess calories and carbs one is taking into their body. It also means that the body is receiving more insulin then needed. So really that's a double whammy.For women we have a wonderful hormones called estrogen and progesterone which affects the bodies response to insulin. Now this is the tricky part, because it's different for each woman. Take me for example, I use an insulin pump and my Dr. and I recently figured out that I need 3 different patterns to go with my cycle. I have my base pattern, then I have another pattern for the week before my period and a third for the week of and after, then it's back the my base pattern.Each pattern has a different daily base rate, low, middle, and higher, to follow my hormone cycle. Until we set this up, I was constantly up and down with my BG. One week everything would be text book perfect numbers, the next I'd be getting low more then once/day, another week my numbers would sky rocket.Diabetes is a very complex disease, but the medical industry is learning more and more all the time and new technology is changing the face of diabetes for the better.The important thing is to keep on truckin! Work closely with a good Dr. and a diabetes educator (can't recommend that one enough) and hopefully you can stay on top of it.",
            "post_id": "3146375",
            "timestamp": "1215830699",
            "votes": 0
        },
        {
            "answer": "Hello :)Im 14 and i have had type 1 diabetes for nearly 10 years and i recently got an insulin pump about 5 months ago and have noticed that where I used to give myself injections has flattened out a bit....i also used to have about 5 injections a day and was taking novo rapid actrapid protophane and lantus.Im pretty sure ive lost about 2 kg without trying so yeah :)",
            "post_id": "6466523",
            "timestamp": "1292764898",
            "votes": 0
        },
        {
            "answer": "I have had type 1 diabetes for 42 years and over that period of time I have seen many changes in diabetic therapy due to the changes in technology.  I am 6'1\" at 220 lbs, and I worked as a stuntman in Hollywood for many years, so, there was a lot of stress on my body. I am not a doctor nor claim to know everything but I have found things that work for my diabetes and don’t work.  All diabetics are a little different due to our DNA make up so what works for one diabetic may not work for another.  The first step to losing weight is to get into a target range of your A1C hemoglobin if that is high it will be hard to lose weight. The second step once A1C is controlled, then lower insulin doses and decrease carbs until you find a good balance.  There are so many diet plans on the market and really none of them will work better then a diabetic diet set up by a diabetic nutritionist, most professional athletes follow a made to plan diabetic diet.  Exercising is the key ( something that I don’t do but need to).  There are so many complications with diabetes over the long term and I am sure most of you with diabetes know the complications. The key to the whole equation is the A1C or blood testing, lower the insulin, lower the carbs and calories and increase activity and you should lose weight",
            "post_id": "6554441",
            "timestamp": "1295282899",
            "votes": 0
        },
        {
            "answer": "word around town is...lantus makes you put on wieght? dont know how true that is?I was surprised to see the areas your daughter was putting on weight...i have noticed more than anything that my stomach and back are really fat! I have never had that before.i too have had D for 10+ years...taking lantus for the past 2-3...I suspect lantus is causing it or my once over-active thyroid has now become under active!?Stuntman...i think your advice might be the way to go....lower HBA1c...lower the carbs...lower the insulin...lower the tip on the scales :)",
            "post_id": "6724883",
            "timestamp": "1299813924",
            "votes": 0
        },
        {
            "answer": "I have been type one for 20 years.  I have had issues with my weight also.  I talked to my docs about it in 2008 and was told a lot  of it is based on the amount of insulin.. so the key is to cut it back, They told me to eat lunch dinner etc THEN work out.. this way you can reduce thee insulin need to cover the carbs and types.. It takes a few weeks to really get the numbers right and I recommend to eat the same amount of carbs and do the same work/ time every time.  It worked for me.. I was able to eat around 25 carbs for dinner and not take any insulin to cover it on the 3 days i worked out.   had a lot of highs an lows the first 2-3 weeks.. but after about a month it was easy and had good control over my sugars again while doing this.  I lost 60 pds over 1 year and as my weight went down was actually able to cut back on my over all insulin needs by about 20% for my normal daily usage. I tried for about 5 years before this to loose weight with out any results.",
            "post_id": "6739431",
            "timestamp": "1300259461",
            "votes": 0
        },
        {
            "answer": "Some of these posts have been so helpful.  Especially those talking about feeding lows, lowering your  A1C and lowering insuling dosages.  This makes so much sense.I have been a diabetic since I was 4 and have always battled my weight. I am only 4'11, so any weight gain on me is significant.  I was very heavy in high school and college, and then lost abour 40 pounds after college, and have been able to maintain a healthy weight since.  Until recently.  It is April, and since August I have gained 10 pounds, without any reason. My endocrinologist could find nothing in my blood work suggesting a thyroid problem, and basically tole me to exercise more and eat less.  Which I thought I had already been trying to do.  I exercise at least 4 days a week for 45 minutes, and I watch every bite that goes into my mouth.  I eat very little food.  For the last three weeks, my husband and I have been eating healthy salads for dinner 3-4 nights a week.  And still, I cannot lose any of the 10 pounds. Zero, zilch, nothing!!  Very frustrating!  I was about to just give up.  I know that my A1C is higher than it should be, and I also have a lot of lows that I end up \"feeding\".  So, I am going to work diligantly on lowering A1C and using less insulin.  This is such practical advice and I am really hoping that it will work for me.  I feel so fat and \"swollen\", and am anxious to get back to the weight I was in August.    Thank you to each of you for your posts and advice!  I will let you know how it goes, and if successful, I will \"give back\" and try to post additional tips that helped me.",
            "post_id": "6842269",
            "timestamp": "1303324846",
            "votes": 0
        },
        {
            "answer": "I've had type 1 since age 1 and am now 28.  I've always been just a little heavier than I wanted to be, but really gained weight during college.  No matter what I do, I can't seem to lose any of the weight.  A few years ago, I was also diagnosed with celiac (allergy to gluten).  Because of that, nearly all processed foods are off-limits, and I've also eliminated all refined sugars.  My diet consists of lean meat, fruit, vegetables, and small amounts of homemade soy-based bread made with Splenda.  That's it.  I've reduced calories (1800 max), carbs (maybe 90 on a high-carb day), fat, and work out at least an hour 4 days a week (used to be twice a day!).  I've stuck with this for the last 5 months without a single Valentine's chocolate or Easter jelly bean, and absolutely nothing has changed (the one bonus of this way of eating is that I have no cravings for sweets anymore!).  My thyroid tests perfectly normal and I've strictly followed my dietician/diabetes educator's advice.  I use a pump, and my control is decent, but pretty unpredictable--today's basal and correction rates may or may not work tomorrow, so I use the temporary basal feature a lot.Cardio exercise has the same impact--it might not effect my glucose levels at all, or it might send it crashing two hours later.  Therefore, I tend to stick with weight lifting instead since it's effects are much more consistent.  I realize that muscle weighs more than fat, but I'm not burning any fat either.  All of the fat is concentrated around my stomach and refuses to budge.  I don't use any other medications besides insulin, and am at a loss as to what to try next.",
            "post_id": "6867393",
            "timestamp": "1304115636",
            "votes": 0
        },
        {
            "answer": "My daughter is 16 and was diagnosed w/ type 1 diabetes a year and a half ago. She has put on weight and is very unhappy about it. She tried the Dukan diet for 2 months and only lost a pound!!! She does exercise. One problem she had on the diet is that even though she reduced the amount of insulin she was taking(she has an insulin pump) she would still crash and have to eat some carbs. Now she is thinking of stating the \"17 Day Diet\"  I suggested to her that she may wish to try a modified version of South Beach. I feel so bad for her as she is trying so hard to lose weight yet nothing is working. I have hypoglycemia so I too have to watch carb intake. I did tell my daughter that she should eat alot of veggies to keep her full(which Dukan did not allow!!!!), LEAN protein and then fruit and complex carbs in moderationIf anyone has any other suggestions please let me know",
            "post_id": "6965679",
            "timestamp": "1307376050",
            "votes": 0
        },
        {
            "answer": "Just a note for some people, I have had juvenile diabetes for 17 years and I am struggling with my weight more than ever. Although a lot of people talk about lowering carbs etc, please be careful, it is ok to cut out pastas and breads but ensure you are still eating fruits vegetables, dairy etc all of which contain carbs as your body needs them to function. My endroconoligist has warned that a diet that consists of less than 40-50% carbs could lead to many more complications down the road especially your kidneys and liver!Also I recently started working out, like 2.5 weeks ago, cardio and weight lifting, and well it turns out I need more basal when i work out. I freaked out at first wondering what was going on as I would get really high sugar levels a few hours after working out. Turns out muscles use sugar to work so if there isnt enough sugar in your body (due to us trying to control with insulin) yoour muscles will pull it from everywhere else, kidneys, liver etc and increase your sugars. I now have to set my temp basal rate at 112% during my 1 hour workouts and for an extra 30 mins after. SO if taking  insulin makes me gain more wieght I'm screwed! Just some interesting things Ive experieinced lately, no changes in weight though but I'm hopeful!",
            "post_id": "7248831",
            "timestamp": "1316297469",
            "votes": 0
        },
        {
            "answer": "I a teenage girl with Type 1 diabetes as well, and I have, like your daughter, been trying for YEARS to lose some weight, but to no avail.  My one question would be, is she finding that she is never getting full, or is constantly hungry?  I ask because that is what happens to me.  I find it very hard to stop eating, and even after I finish my stomach does not \"catch up\" as people say.  I have no idea if this is related to diabetes in anyway.  I do know that insulin is responsible for increasing appetite and also slowing metabolism, something that we are \"cursed\" wtih.I went to a dietitian to talk to her about my problem, and she gave me a meal plan.  The meal plan sort of worked, over a period of about 4 months I had lost about 4-5 pounds, however, the rest of my family (all non-diabetics), who stuck to the meal plan with me, lost about 10-11 pounds.  I was very frusterated about this, but was still happy that SOMETHING worked.  The key to this meal plan that made it different from other diets is that it didn't deal with carbs, fat, etc.  It did limit calories to about 1,500 a day, but that is beside the point.  The real difference was that all of the foods on the meal plan were low GI (Glycemic Index) foods.Low GI foods are perfect for diabetics whose blood sugar is out of control.  They specifically eliminate blood sugar spikes, and keep the blood sugar in a normal range.  Blood sugar spiking is another theory as to why many type 1 diabetics gain weight, and these low GI foods reduce it.  Just a side note however, when I was on the diet, my blood sugar constantly went low and i had to compensate by eating multiple snacks throughout the day, something that probably offset my pound-shedding.  So, if you are looking to try a low GI diet (I use the word \"diet\" lightly because it doesn't change much about the amount that you eat), I suggest that you adjust your insulin ratios and lantus dose accordingly, by lowering them.  I hope this helps your daughter, and that she knows that this happens to many of us!Also, one last thing, I have found that keeping a log of the foods you eat helps you to stay on track with a diet or eat better.  If you have a smart phone you can try the app Calorific, or you can just keep a small notepad or book as a log.  And a lot of the times when I found I was hungry it turned out to be that I was thirsty.  Try drinking lots of water or crystal light, or even chewing gum.  Sometimes these really help me.Hope some of this helps!",
            "post_id": "7407179",
            "timestamp": "1321235674",
            "votes": 0
        },
        {
            "answer": "I have been diabetic for 24 years and since being on the pump for 3 years have gained about 30 pounds.   I used to just keep my blood sugar high as weight control and now I am losing my eyesight because of it, so don't do it that way!  Recently, I have been working out and watching the biggest loser on netflix to help me stay motivated.  I've now lost 5 pounds in 2 months.  Doesn't sound great, but keep in mind that when I first started working out I had a lot of lows afterwards and had to eat and it was REALLY frustrating, but I stuck with it and began to see the results the second month.  A couple of things that haven't been mentioned yet... 1) drink lots of water.  Keeping your body hydrated will help get rid of the fat and help you use the insulin you take more efficiently. 2) Change your workout as you get more in shape.  Eventually your body gets used to what you are doing and won't shed the pounds as easily.  Try increasing the resistance on a machine, push how hard you are running or walking,  or try a new exercise.",
            "post_id": "7487202",
            "timestamp": "1323549227",
            "votes": 0
        }
    ],
    "post_id": "2429691",
    "question": "My daughter has had diabetes for 10 years and has experienced significant weight gain.  She has tried over the years to lose with diet and exercise but to no avail.  She has recently done Weight Watchers for one month and followed it religiously.  She lost practically no weight.  She also exercise at least five times a week for an hour and a half.  She is very frustrated and I don't have any answers.  Unfortunately, her doctors over the years don't seem to be able to help.  Should we be looking at type of insulin?  She presently talkes Lantus and Humalog.  Does high protein help?  Her weight is in her back across her shoulders, in her middle and thighs.  She usually injects in her stomach and sometimes her thighs.  Does site matter?  Any suggestions would be so appreciated.  Thank you.",
    "timestamp": "1095656400",
    "title": "How to lose weight with Type 1 diabetes"
}