{
    "answers": [
        {
            "answer": "Hello Surfin'USA. I am sorry to hear that you are going through so much drama in your life.  I myself am not a diabetic, just the parent of one.  I can however give you some suggestions.It sounds like you have found yourself in a vicious cycle.  You are sick so you relax on treating your D.  Then your blood goes all over the map and you start worrying about that.  Then you worry about what others will think.  All that stress can make your numbers even worse.My simple suggestion is to get back to the basics on this.  Track your blood sugar and carb intake on a regular basis.  Check your bolus and basal amounts.  Get with your doctor on tweaking those amounts.  Keep in mind that with the pump its normal to have to change rates.  You also need to realize that you are not alone.  There are millions of people with type 1 out there. A good support network is a must!Most importantly dont worry about others judging you based on your diabetes.  If they do, they are petty and small.  Any decent person would simply accept the fact and move on.",
            "post_id": "2429788",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "i can certainly relate with many of your problems. i am also manic-depressive and when i have a depressive episode my control faulters. But i do know that good control is an ongoing state of working for it. One never gets to a point where they have everything down to a few changes and getting back on track. So many things affect blood sugar, like what you eat and other medical problems and emotions as well.But i recommend you work with your doctor to help get back on track. This will take a lot of record keeping on your part of the meals and insulin you take for them. This will help you develop an insulin to carb ratio which will be helpful when you are in situations abnormal from what you experience at home.Good luck with your endevour and have a happy Christmas, bret",
            "post_id": "2433975",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "Hi Surfin'Another non-doctor here.  It may seem that \"everyone else\" has perfect a1cs and just does a tweak here & there to align anything that's amiss, but I'd be willing to bet that the truth is far from that.Type 1 is a delicate balancing act and unless each day is exactly the same (food, exercise, stress levels, sleep, health, ideas), then each day's management is a bit different from the next.AND, just when we think we've got ourselves figured out, our bodies often undergo some major change (teen-hood to 20s, 20s to 30s, etc.) that come with metabolic and other differences.  Sooo, we get are back to square 2 or 3, if not square 1.I'm a pumper, too.  My advice is to look first at fixing one thing if you're up for it.  My first focus was on waking up with a good bg.  What is your target for waking up?   I also was humbled and continue to be -- after being a DMer for over 35 years -- that I continue to learn the basics over & over again.  I get into a pattern and then I find that I've forgotten some basic stuff.Here's a great book that I reread sections of when life shows me I've become complacent.  It's great for pumpers but also has really really good tips & rules of thumb for folks taking shots, too ... like how to compute our Insulin:Carbo ratio and how to deal with a variety of circumstances.PUMPING INSULIN by John Walsh & Ruth RObertsand another book i keep in the kitchen and refer to over & over again as I try to learn how to deal with different foods, or foods I've forgotten how to deal with:BOWES & CHURCH - Food Values of Portions Commonly Used by Jean Pennington (The first edition of this book came out in 1937!!)Finally, I just discovered that this book exists, but I haven't read it yet.  I intend to, tho'. It's written by a fellow at Joslin Diabetes Center.  I attended one of his workshops at Joslin -- over 10 years ago -- and I *still* use some of the things I learned.DIABETES BURNOUT by William PolonskyDiabetes & depression are common companions and if we suffer from depression, I suspect we need to get that dealt with before we'll have the motivation & strength to get diabetes in line.  Good luck.  You've gotta lotta company on the issues you're dealing with.  Our details may differ, but the end result feels the same as you describe.",
            "post_id": "2433976",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "LRS, lately I've woke up in two modes,upper 300's and low (which came when I tried to adjust for overnight rise)Bedtime bg is usually around 100. So when I rose everything around the board (about 3 U more insulin) thats when I woke up low,  (around 6-7 am) overeat, go back to sleep,and wake up high again later on.I have pumping insulin I will check out those other two books,thanks.",
            "post_id": "2433978",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "Hi Surfin'USAI am 20, type 1 for 10 years now, not a physician (but hope to be someday).  Reading your post just reminded me of myself SO much that I had to reply.I completely understand where you are coming from, when no matter what you do you cannot maintain control.  I myself, have had plenty of other problems haunting me on top of the diabetes (unrelated), probably for the rest of my life.  For years, I had terrible control of my diabetes.  At the beginning of this year, I did not check my bg's for an entire 6 months (not once), and I was giving 50 units of Humalog at a time, three times a day.  My entire family was trying to get me back into control.  Even through all of the bickering with my mom and dad, and the arguments with my friends, and everything, nothing helped me to gain control.  Then, I accidentally gave two 50 unit shots, because I had forgotten about giving the first one.  I woke up in the back of an ambulance going to the hospital, because I had, had a seizure.  I didn't remember anything.  This is what made me change.  I decided that I needed to change for the better.  I also went to the doctor and he started me on an anti-depressant.  The anti-depressant has helped prevent any relapses (I used to go through phases of 1 week of great control, then months of horrible control), and I have gone 6 months with great control now.The first thing I can tell you is, talk to your doctor about how you are feeling.  If he/she feels an anti-depressant would be good for you, please try it, they are life-savers.Then, he/she may want to adjust your insulin rates.One way to figure out if your basal rates are right for your lifestyle, is to not eat breakfast, say, then check your bg every 2 hours.  Your bg should remain in the 80-120 range during that time.  Do this with your entire day, either not eating the whole day, if you can do it, or doing it over a week or so.  This can be done on weekends, whenever is best for YOU.Then, as I am sure you do, like many of us, there are probably about 10 different meals that you always eat.  I figured out exactly how much insulin works for those meals (this took a bit more work), not considering how many carbs and such are in it.  This helped me to further expand, and I've become pretty good at guessing insulin:meal ratios now.I don't think that it is imperative that you inform your classmates, instructors or coworkers about your diabetes.  I have gone through elementary, junior high and high school, and am in college right now, with only telling a small handful of people about my diabetes.  Just, please, make sure you have either a MedAlert ID bracelet or an ID card (like the one you probably got with your pump) in your wallet.One last thing, as I noticed you are in school to be an EMT.  I am also a certified EMT (not working as one though), and you do have to pass a medical exam.  I have family members in the EMS services, and they had all told me, that to pass the medical exam with my diabetes, I must have EXCELLENT control.  Just as a little heads up ^^I'm sorry this is so long, but I did want to tell you that you are NEVER alone in this.  You aren't the only one who has had, or has difficultly controlling your diabetes, everyone does, and there is always someone to talk to if you need, especially in this forum.  I hope this helps you!~vprrchk",
            "post_id": "2433974",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "I have been using a Cozmo for just over a year and am delighted with it.  Like all the newer pumps, it has some great features to take some of the \"constant mental math\" out of my head.One of the features I like is the \"insulin on board\" which, based on settings we can make for ourselves, tells how much insulin is still *in our bloodstream* based on boluses we've taken and how long insulin stays effective in our system.That feature alone has helped me \"remember\" a recent bolus that I'd otherwise have forgotten.As you know pumps require a lot of learning and work, but it does seem that they give me better results for the work.  Cozmo has recently introduced a \"CozMonitor\" which is a FreeStyle blood test meter designed to attach to the Cozmo, so it's all one unit.  With that monitor, it's a bit bulkier than other pumps and some folks don't like it.  I like it a lot because the integration saves a few steps (entering bg from another meter).  I also love technology & gadgets ...On the depression issue, it sounds as if you're gonna follow up with your doc.  Sometimes even they need help \"seeing the obvious\" since they don't really know us very well.  I hope you'll get some relief.  The bg swings are miserable ...",
            "post_id": "2433983",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "Surfin'USA,I'm in California, not really sure where you are, so things might be different there.  Also, I think I didn't clarify that I meant you have to pass the medical exam to get your ambulance driver's certificate.  I'm not trying to deter you from being an EMT, because I think it is a wonderful job to have (if only I had kept better control for when I finished the class), and diabetics shouldn't be excluded solely because of their diabetes.A thing about your being 300 in the mornings, but 100 before you go to bed.  I know this is hard to do (I know I avoid this one as much as possible), but do you think you could do a test right in the middle of when you are asleep?  By doing that, you can sort of see when your BG is going up.  Like, say, you go to bed at midnight and wake up at eight, try checking your bg at 3-4 am (even better, try it at 3 am and 6 am).  This can help you see where you need the extra insulin.  Increasing by 3.0 units might be a bit much (as you have already found out).  I usually only increase by 0.1-0.2 u/hour max, which usually gives me less than 1.0 unit total.  However, I'm only going through 40.0 units/ day.  Anyway, make sure that you let your doctor know your mid-sleep numbers, so he/she can adjust your basal insulin accordingly.~vprrchk",
            "post_id": "2433979",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "It takes so much constant vigilance, its like another job! Like I said, its always changing.Sometimes I think its a major victory just to stay alive. Trying to get a new pump (if I can mention brand names on this forum, the Cozmo) which I can then download info + quit with paper logs. I really hate paper logs (and everytime I attempt to do one life gets busy and that doesn't last long).Cozmo has tons of cool features that should really help as well like the .05 bolus/basal adjustments, site reminder + bg reminder buzzers it looks so COOL.Vprrchk, I've never heard you have to take med.exam to work as an EMT, I know over here firefighters might but nothing was said about that.(although,did have to state it (medical concerns) on application) Just as something for them to be aware of,not as deterrant to hiring, none of RS HR people said anything about that.(so they said,application still pending,I'll be most upset if that information makes it past the HR person)Instructer hasn't said anything about that either..My DMV driving record is squeeky clean,here they don't even require you to state it on lisence so its unlikely they'd deny me driving privilidges.Not an EMT yet, I test Dec.16 but as an EMT, I would never put my crew members/patient in danger because I was having problems, on a call I would try to be watchful about those situations.(and discretly take care of them) Because I think, its a privilidge and a responsibility + should be treated as such. When you put on that uniform,first responsibility is to make sure you aren't impared or someone else could get hurt. If that happened, A. I'd feel terrible and B. I'd probably get sued and thats not something I want.That being said, I probably am depressed (which my dr could probably spot just looking at the bg log)+ maybe I should talk to the doc, not doing something is just increasing risk of problems down the road.Thanks guys.",
            "post_id": "2433977",
            "timestamp": "1101621600",
            "votes": 0
        },
        {
            "answer": "Hi Surfin'USA,You have started a wonderful thread for a very important issue. I am the mother of a 28 year old with type 1 and I can tell you that in my 17 years of volunteering with JDRF, you are not alone with your control of diabetes. My son has also been all over the place with taking care of himself. He is now trying to tighten his control, but it has taken many years. You will hear from people that run wonderful A1c's, however, it maybe because those that don't, do not post on these types of forums. I want to thank you for bringing up such an important issue. I have read many studies that up to 75% of people dealing with a chronic illness have had mild to severe depression at one time or another. I am also not a physician, but I can't stress enough the importance of talking to your doctor about your concerns. I know that there is no magic solution. Type 1 is a constant balancing act with diet, insulin and especially stress.We do know that stress defintely plays into blood sugars. It seems that you are overloaded with jobs and school.I am curious about one thing. You are going to school to become an EMT.I would love to know what state you are taking this in. Your job selection tells me that you have a passion to help others. My son is a member of our local ski area as part of a skiing pro-patrol team, search and rescue, and fighting forest fires in the summer along with his regular job. He takes these jobs to help others and has done a fine job. I have always wondered why he wants to help save others, but has a problem taking care of himself. This is in no way a judgement, but a question I have asked myself over and over as a mom.He is also seeing a doctor that specializes in depression and diabetes and it may be worth looking into. It has helped him so much.On a better note, my son is very open with his co-workers and they are very compassionate when they become educated about type 1 diabetes. I understand about being hesitant about discussing this with them, but you may be surprised by their response.My last question is about diet. Do you count carbs? There are many great classes that can help you with your control.I admire your question and hope all goes well. Please let us know how you are doing and I would love to see further questions or comments from you. We need to hear others like yourself. As I said you have opened such a very important discussion and I would like to see it continue.I wish you the best. The comments from others are volunteers that I trust completely. You have recieved very important information and we are all in this together. Don't forget that.Keep in Touch,dm",
            "post_id": "2433984",
            "timestamp": "1101708000",
            "votes": 0
        },
        {
            "answer": "LRS, when I get the Cozmo I may be picking your brain some more! lol (sorry) Pump technology has really taken off running + I think, closed loop will happen someday.(although,I'm not real optamistic about when)DM, I am in Virginia. I think for me, it is like anyone else who has an interest in fire/ems its just a job you know is right for you + I feel better helping someone else when I know that diabetes hasn't prevented me from doing that.I'm not sure why people would rather take care of others,then themselves that might be a question for a shrink. (never took physc.classes myself!)Maybe because diabetes is so void of any positive results sometimes,that one doesn't feel like its worth it but this job,you can see results and feel good about it.I do count carbs,(sometimes) but many times with homemade (grab-and-go) stuff,its like everything else, I have this persistent fear of terrible lows and generally underestimate the carbs so I won't go low. (on purpose)  Probably because one of my jobs is really active, and I'm prone to go low on it. I'm better on stable days with little physical activity (in terms of carb guesstimating/bolusing) But I do things like skip lunch boluses and end up 350 2 hrs later. I asked my dr whether it was better to have a1c's under 7, with little physical exercise or to have a1c's like mine(somewhere around 8) with tons of physical exercise and he didn't have an answer for me, said I was doing great..which really didn't do much for me. I need answers,and I need to get straightened out on some stuff before the diabetes falls into line.",
            "post_id": "2433989",
            "timestamp": "1101708000",
            "votes": 0
        },
        {
            "answer": "Hi Surfin'USA,I've been living with Type 1 for a dozen years now.  I'm veryphysically active.  You want your A1C absolutely under 7, preferably under 5.  If you keep it not more than about 5, yourbody won't wear out.  If you keep it more than that, your body will self-destruct.  The higher your A1C, the faster it will wear out.  You want to control your DM, so your DM doesn't control you.    I've read Walsh's Pumping Insulin.  It is good.  Since I don't have a pump, I recently found an even better book.  It is called \"Diabetes Solution\" by Dr. Richard K. Bernstein, who has had IDDM for 55 years.  Google for it.  I learned a lot of stuff I didn't know from Dr. Bernstein.  I am adopting certain techniques that make my control *** so much *** better.  I highly recommend it.I learned that YOU can control your diabetes, rather than the other way around!I also recommend you carry an unopened 12 fl. oz. bottle of Gatorade on your person at all times.  It should fit in your pocket. If you ever get hypo, you can open it and completely swallow it in 5 to 7 seconds.  It's the fastest stuff.Write back if you have any specific questions.  Hope to hear from you again.",
            "post_id": "2433991",
            "timestamp": "1101794400",
            "votes": 0
        }
    ],
    "post_id": "2429787",
    "question": "I'm 23, have had the big D now for 6 years. Thus one would think I'm ready to walk the straight and narrow, after  teenagerhood. But now I find that it is way worse, I work 2 jobs, do school part-time, am dealing with several other on-going medical issues for which I must take large doses of painkillers and the diabetes is all over the map. Even when I try its all over the map, and most of the time I don't even try. (by try, I mean adjust doses/basal rates I'm on the pump) Blood sugars, I test just to make sure I'm not low. And it appears that other people I know with type 1 D have these wonderful, 80-130 blood sugars most of the time and if they aren't, all they have to do is tweak a few things and boom, right back to their perfect a1c's.What do you guys do when you are going through a rough period with your diabetes? My dr is great, but with everything else I am too tired/stressed out to go through even trying to get the diabetes back on track. I am also struggling with telling anyone (such as coworkers) about diabetes,I'm a private person + don't want it to color their opinions of me. Which is stupid, as I'm an EMT student (a profession one might suppose they'd understand) but they are some of the worst of the bunch + know the dead basics-hypo=sugar,hyper= get to hospital asap.Don't want any of them wondering if I'll keel over any second from a low. How do you guys break the professional barrier with diabetes + work interactions? Thanks.",
    "timestamp": "1101621600",
    "title": "how does one get back any semblence of control.."
}