{
    "answers": [
        {
            "answer": "Your thyroid results indicate that you could be somewhat hypo.  Your lab is using an  outdated reference range (as do most) for TSH, so using the range recommended by AACE nearly 10 yrs ago (0.3-3.0), your level would be quite near the top of the range.Your FT4 is very low and may be an indication that your FT3 will soon follow suit.  The contrast between your FT3 and FT4 is not unusual.Yes, FT4 is converted to FT3, but your thyroid also produces some T3, which could account for your FT3 being as high as it is.  Most doctors will start a thyroid patient on Synthroid or the generic, levothyroxine.  You could ask your doctor for a trial dose, just to see if it helps your symptoms, which all indicate hypo.For the B12, are you taking oral supplements or shots?  What were your actual B12 results?  Some of us don't absorb B12 adequately (pernicious anemia), so oral supplements don't work well.You should also get checked for insulin resistance and PCOS, both of which can make weight loss difficult to impossible.",
            "post_id": "9172493",
            "timestamp": "1370434095",
            "votes": 0
        },
        {
            "answer": "Over conversion pattern comes to mind.  Something to consider anyway.\"Pattern 4: Over ConversionPattern 4 is the opposite of pattern 3. The thyroid and pituitary are again working properly, but this time there is too much T4 converted to T3 (remember roughly 20% of T4 is converted into reverse T3 which is inactive and excreted). High levels of testosterone is the cause which also has the added effect of decreasing the amount of thyroid binding globulin (TBG: the taxi that carries the thyroid hormones).The high levels of T3 in conjunction with low TBG causes cells to become resistant to T3. They close the doors and do not allow anymore T3 into the cells. TSH levels will be normal even though the patient is showing signs of hypothyroidismThis pattern is similar to insulin resistance. In fact, patients with thyroid over conversion often also present with insulin resistance and polycystic ovary syndrome (PCOS) which is also caused by increased testosterone levels. Managing blood sugar is extremely important. Since there is already to much T3, prescription thyroid medication will not help in this pattern.\"- Relief And Wellness Center - 6 Patterns Of Hypothyroidism.",
            "post_id": "9172801",
            "timestamp": "1370441092",
            "votes": 0
        },
        {
            "answer": "Wow, just when you think you have a good idea of what's going on in your body, you find out there's so much more!Thanks for what each of you has shared.  Now I have more to consider and look into!  :)I didn't mention that the gyne found fragments of polyps in my uterus and I also wonder about my blood sugar due to how I feel sometimes.  I don't understand how all this connects - if indeed it does - but I will present these all to my doctor and hopefully he will know what to do...?My B12 was 315 pg/ml (200-1100).  I've been taking sublingual tablets under the tongue since finding out that some people do not absorb it in the stomach.I am going to look into the idea of higher testosterone - this has me curious.  Are you two saying that insulin resistance and PCOS are two different issues but both are caused by high testosterone?So much still to learn!  I'm sorry to reply so late - I didn't realize I had replies because I didn't get an email until now.Thanks again!",
            "post_id": "9193491",
            "timestamp": "1371074605",
            "votes": 0
        },
        {
            "answer": "Hello, I have the same dilemma actually. My free T4 is 0.83 (range 0.58-1.64) whereas my free T3 is 2.93 (2.2-4.0). I have also been diagnosed with hypoglycemia and I have problems with my menstrual cycle,I don't even get menstruation for 2-3 months then take a medicine for it. Doctor said I didn't have PCOS but a small regular cyst that would disappear with time. So, should we take a seperate thyroid medicine to increase Free T4? Would that help? What else can we do to overcome this pattern of over conversion?",
            "post_id": "9193763",
            "timestamp": "1371081065",
            "votes": 0
        },
        {
            "answer": "Insulin resistance and PCOS are 2 different conditions, but I'm not saying they are caused by high testosterone, though that seems to be what Red's article is saying.  I have insulin resistance, but I do not have high testosterone levels, so I'd say that she's suggesting a mere \"possibility\".Thyroid, pancreas (produces insulin), reproductive system (testosterone and other reproductive hormones) are all part of the endocrine system and the hormones all work together (ideally.......).Explaining it in my own words....... Insulin resistance occurs when blood sugar levels are consistently high, which causes the pancreas to produce more insulin.  If you continue to eat foods that are high in sugar, the pancreas continues to pump out more and more insulin and eventually, the body becomes resistant to it.  It becomes a vicious cycle and the more simple carbohydrates you eat, the worse it gets and can/will lead to Type II diabetes.Insulin is often considered the \"fat storage hormone\", because whatever sugar you consume is shuttled, by insulin, into fat cells, if it's not used right away for energy.I'm not real \"up\" on PCOS, but it's caused by cysts on the ovaries.Both insulin and PCOS can cause weight gain and/or make it, seemingly, impossible to lose.  Right now, I'm working on a very low glycemic diet, which is one with few simple carbs, that break down quickly.In my opinion, you don't have an over conversion issue; your thyroid is simply not working properly.  The fact that the thyroid does produce some T3 could very be why your levels are still higher.Of course, it's always best to check out all possibilities.",
            "post_id": "9195018",
            "timestamp": "1371126979",
            "votes": 0
        },
        {
            "answer": "Neither do you have an over conversion issue....... both your FT3 and FT4 are WAY too low in the ranges, indicating that you could be very hypo. Menstrual issues are common with hypothyroidism and typically resolve once levels are restored to a level that's good for you.Typically, when one has hypothyroidism, they are prescribed a replacement hormone, which will increase, both FT3 and FT4, which should help to any symptoms you may have.",
            "post_id": "9195031",
            "timestamp": "1371127380",
            "votes": 0
        },
        {
            "answer": "Both of you need to get tested for thyroid antibodies, to confirm/rule out Hashimoto's Thyroiditis, which is the most common cause of hypothyroidism in the developed world.Hashimoto's is an autoimmune disease, in which the body sees the thyroid as foreign, so produces antibodies to destroy it.  The destruction, typically, takes a long time, and is progressive.  As the disease destroys healthy thyroid tissue, the thyroid is unable to produce adequate hormones, thereby causing one to become hypothyroid.  The treatment for this is replacement hormones.The tests you need to get are Thyroid Peroxidase Antibodies (TPOab) and Thyroglobulin Antibodies (TGab).  You need them both, because some people have one or the other, others have them both.  Not testing them both could result in a misdiagnosis.",
            "post_id": "9195048",
            "timestamp": "1371127815",
            "votes": 0
        },
        {
            "answer": "It was just a suggestion with lower T4 and higher in the range T3.\"Insulin resistance results from inherited and acquired influences. Hereditary causes include mutations of insulin receptor, glucose transporter, and signaling proteins, although the common forms are largely unidentified. Acquired causes include physical inactivity, diet, medications, hyperglycemia (glucose toxicity), increased free fatty acids, and the aging process.[25]\" Medscape - Insulin ResistanceMy insulin resistance worsened after over-medicating on thyroxine! Grrr",
            "post_id": "9195244",
            "timestamp": "1371132803",
            "votes": 0
        },
        {
            "answer": "Hmmmm, I only had the one antibody test.  Wonder why he did one and not both.Guess what I noticed - or I think I have - is I feel worse when my diet is more pastas/breads and sugars and less live foods (fruits/veges/nuts).  My body feels swollen inside, especially feet and hands are tight as though they are swollen and I have that carpal tunnel feel that you have when the go numb a lot - although they aren't numb right now.  I just feel the little tingles and buzzing in there.  My mind is also sluggish - don't want to have to do much.  I slept another ten hour night, etc.  My nails were doing better but now they are cracking/breaking/some peeling suddenly.Is this a sign of insulin resistance?  On one of my labs from 2011, my glucose level says 92 (range 65-99mg/dl).  I wonder what this indicates, if anything.  Are you considered to have glucose toxicity if you are above 99 mg/dl or is that something different?Also, on occasion I find that I'm acidic and I read that pastas and breads strangely make you acidic, too.  Anyway, my lab said my alkaline phosphate was 42 (range 33-115).I don't think I overdo breads and pastas, just like anyone else I suppose.  But if those dominate and then I eat cookies, too, it seems I don't feel right.  I never drink sugary drinks but at my mil's, she serves caffeine free pepsi which did have sugar.  When I'd drink a couple cups with dinner (I learned my lesson and no longer make that mistake) I would feel weird in my head.But idk.... there's just so much that needs looked at since it all works together.  I'm overwhelmed because it seems the doc won't be able to get to the bottom of it because he isn't looking at things like this.  I'm due to follow up but haven't scheduled because I don't want it to be another waste of time and money!I looked into the testosterone and don't see those symptoms really - although I did have a random dark hair growing on my arm.  My daughter who has been diagnosed hypo always has one growing on her face.You two ladies are suggesting I get tested for insulin resistance but will he understand it is connected to thyroid hormones?",
            "post_id": "9195581",
            "timestamp": "1371139149",
            "votes": 0
        },
        {
            "answer": "You stated above: \"Guess what I noticed - or I think I have - is I feel worse when my diet is more pastas/breads and sugars and less live foods (fruits/veges/nuts).  My body feels swollen inside, especially feet and hands are tight as though they are swollen and I have that carpal tunnel feel that you have when the go numb a lot - although they aren't numb right now.  I just feel the little tingles and buzzing in there.  My mind is also sluggish - don't want to have to do much.  I slept another ten hour night, etc.  My nails were doing better but now they are cracking/breaking/some peeling suddenly.  Is this a sign of insulin resistance?\"In my opinion. No.  Those are more consistent with being Hypo.  Also the buzzing could be caused by low B-12 which is common to feel tingling, numbness or buzzing in the extremities with low B-12.  I know your B-12 as within the range. But as you can see the so called \"normal\" range is VERY wide. And many people do not feel well until very high up into the range.Also you mention caffine free pepsi.  I know I used to get dizzy when I drank diet caffiene free coke.  And it turns out that one of the side effects to aspertam is dizziness.  When I stopped drinking the dieat caffine free soda my dizziness went away!You report feeling poorly when you eat startches.  Well that may indicate that you have some sort of gluten intolerance.  This is unrelated to thyroid althogh there are some who believe that goin gluten free can help your thyroid.  But you may want to look into gluten intolerance and maybe try going gluten free.  If it makes you feel better so muchthe better. But don't look to it as some sort of wonder cure for thyroid issues.Menstrural problems are pretty common with low thyoid.  Early spotting and intermittant periods and irregularly timed periods is one of the first signs in my wife that her thyroid levels are dropping.Carple tunnel and planters faciatis and other cramps are also fairly common symptoms with people who are hypo.",
            "post_id": "9195986",
            "timestamp": "1371149104",
            "votes": 0
        },
        {
            "answer": "I've always had a normal fasting or random glucose level and i've had severe insulin resistance for over a decade.  The first test to show up my insulin problems was my recent OGTT (oral glucose tolerance test) showing 10.7 (type 2 diabetes is over 11) which is impaired glucose intolerance aka pre diabetes.  Check online for the hip to waist ratio to measure yours. Mine is 0.96 aka my waist disappeared. *cries*",
            "post_id": "9196058",
            "timestamp": "1371150640",
            "votes": 0
        },
        {
            "answer": "\"Guess what I noticed - or I think I have - is I feel worse when my diet is more pastas/breads and sugars and less live foods (fruits/veges/nuts).  My body feels swollen inside, especially feet and hands are tight as though they are swollen and I have that carpal tunnel feel that you have when the go numb a lot - although they aren't numb right now.  I just feel the little tingles and buzzing in there.  My mind is also sluggish - don't want to have to do much.  I slept another ten hour night, etc.  My nails were doing better but now they are cracking/breaking/some peeling suddenly.Is this a sign of insulin resistance?\"  No, as flyingfool said, those symptoms are consistent with hypothyroidism.Blood glucose of 92 is perfectly normal.  If your blood glucose levels were running 100-125, you'd probably be diagnosed with insulin resistance/pre-diabetes.  Blood glucose level over 125 would be full blown diabetes.  However, you could still be in the beginning stages of insulin resistance, with normal blood glucose levels. It simply may not have built up yet.  Simply stated, glucose toxicity is when the body is exposed to chronically high blood glucose levels.  You don't have that.You could have a gluten intolerance so that whenever you eat breads and pasta it causes inflammation; or your feeling after eating bread/pasta could be an insulin resistance thing.  Anything made with sugar and white flour (most processed foods) and even fruit are considered simple carbs, which are broken down in your body rather quickly, so you  have all this sugar floating around.  When this happens, your pancreas produces more insulin, since insulin is the hormone that \"escorts\" sugar to the cells of your body for energy.  The cells become resistant and won't let the insulin in, which causes blood sugar to be elevated, because it's staying in the blood, not being utilized by the cells. Sugar not used, will eventually be shuttled to the fat cells for storage.  It's a vicious cycle as you continue to eat more simple carbs.You might try switching to whole grain breads and pastas to see if it still  makes you feel poorly.  If it does, I'd suggest eliminating or at least, severely limiting your gluten intake.If you have a weight problem, a low glycemic diet is best, anyway.",
            "post_id": "9196120",
            "timestamp": "1371151920",
            "votes": 0
        },
        {
            "answer": "I just checked my test and my fasting glucose is 5.2 mmol/L (93.6 mg/dl) with pre diabetes and a mere 0.4 mmol/L away from type 2 diabetes. The glucose test is very misleading!",
            "post_id": "9196250",
            "timestamp": "1371154045",
            "votes": 0
        },
        {
            "answer": "Reference ranges vary from lab to lav, country to country........ Red is in the land of Oz, we're in the U.S.  A blood glucose of 92 is a whole 8 mg/dl (?); from pre-diabetes,let alone full fledged type II......You might have an insulin resistance issue, but you need to get tested for it...You need to have both fasting glucose levels, plus insulin levels.......",
            "post_id": "9197072",
            "timestamp": "1371173580",
            "votes": 0
        },
        {
            "answer": "Strangely enough, I am 220 pounds but still have a waist.  I'm thinking this is a gluten intolerance thing.  I read somewhere that if celiac (sp) runs in family - that's connected to gluten somehow.  My brother has celiac disease.So, if I'm understanding you all correctly, my symptoms are hypo with the chance B12 is still low and/or gluten intolerance is adding to the issues.  I haven't heard that there is a test to check for gluten intolerance...?  That you simply have to eliminate it from your diet?I read up on the 5 patterns of conversion for thyroid hormone and it's pretty wild how there's so many variables to consider and how they can make better assessments by looking at things this way.  My doctor is not an endocrinologist but he knew enough to find my friend's hashimoto disease.  Would it be necessary to pursue and endocrinologist?My symptoms definitely point to hypothyroid and both my mother and adult daughter were diagnosed hypo, but mine must be a minor case to have such difficulty getting it diagnosed.  I do know my daughter's symptoms are worse so her labs must be out of range.  She's far more tired and sluggish than me - mine fluctuates a bit more where I'm not a full fledged slug.  It's more like 50% slug, 50% functional now since I've been on iron, B12 and D3.  (Maybe she needs those) But she doesn't have the carpal tunnel tingling and isn't as cold.  Her nails are nice, too.  She is 8 months pregnant, extremely hot, wants the air set to 65 degrees, very tired and spaced out, anxiety attacks/can't breathe, high blood pressure at times, etc.  So, there's a lot of parallels but a lot of differences, of course.Sorry for rambling.  Bottom line is I want to be educated for next doctor's appointment.Oh, my.... I forgot - was also looking into adrenal fatigue because I notice I get fatigued after a stressful situation.  Our dog died last week and there are some other stressful things going on.  I read that all the hormones get messed up.  That's why I'm overwhelmed.  I know I have hormonal imbalance due to the crazy pms, night sweats, crazy menstrual cycles, and all the rest.  And I think I read hormonal balance will eventually cause thyroid levels to be messed up, too.  So where on earth do we begin???",
            "post_id": "9197087",
            "timestamp": "1371173756",
            "votes": 0
        },
        {
            "answer": "Autoimmune disease tends to run in families, but not every member of the family gets the same disease.  For instance, I have Pernicious Anemia and Hashimoto's, my son has Type I Diabetes and my daughter has Lupus - all autoimmune.Additionally, you can't compare how you feel to how your daughter feels, even though you are both hypothyroid.  There are people who become practically bed ridden with TSH, just slightly above normal and low normal hormone levels, whereas I never missed a day's work with TSH of 55+ and below normal hormone levels. That's not to say I didn't feel bad, because I did...... felt like I'd been run over by a couple of mack trucks, then dragged through a keyhole sideways a few times ....... it's just that we're all different, hypo affects us all differently, and we all have different tolerance levels. Particularly, with your daughter being pregnant, she will have a variety of symptoms you won't have.  Just a thought, though -- if she's that tired and sluggish, she really needs to get her levels tested, because it certainly sounds like she may need an adjustment to her med.  Adequate thyroid hormones are critical for the proper growth and development of a fetus.  Levels should be tested monthly during a pregnancy and typically, need to be kept higher than at other times.There are blood tests to diagnose celiac.  \"To diagnose celiac disease, doctors will test blood for high levels of anti-tissue transglutaminase antibodies (tTGA) or anti-endomysium antibodies (EMA). If test results are negative but celiac disease is still suspected, additional blood tests may be needed.\"http://digestive.niddk.nih.gov/ddiseases/pubs/celiac/In many cases, an intestinal biopsy is also needed.Proper medical procedures have to be followed for an \"official\" diagnosis; however, easier and much less expensive is to simply eliminate gluten from the diet and see if that helps. You still won't have a firm diagnosis, but that's probably not so important as feeling well.  Some people don't really have celiac, they are simply intolerant to gluten.  There is a difference.",
            "post_id": "9197970",
            "timestamp": "1371211460",
            "votes": 0
        },
        {
            "answer": "There is no simple test to diagnose insulin resistance syndrome.  The OGTT test is ordered if there is a suspicion of prediabetes or diabetes with normal random or fasting glucose.Fasting glucose test:Pre diabetes: 100 to 125 mg/dL (5.6 to 6.9 mmol/L)Diabetes: 126 mg/dL (7.0 mmol/L) or higherOral glucose tolerance test (OGTT).Pre diabetes: 140 to 199 mg/dL (7.8 to 11.0 mmol/L)Diabetes: 200 mg/dL (11.1 mmol/L) or higherGlycated hemoglobin (A1C) test.Pre diabetes: between 6 and 6.5%Diabetes -  6.5% or higher on two separate tests",
            "post_id": "9198126",
            "timestamp": "1371216599",
            "votes": 0
        },
        {
            "answer": "They did run labs on her thyroid but that must have been a month ago now - she has an appointment Tuesday with the pcp - we'll have her get those labs.  I just hope this one does the FT3 and FT4 - because her other doc didn't.  Then again, she was out of range on TSH alone.Thanks for all your help, guys.BTW, there was a link in the ads on the left of this forum for Dr. Brownstein in Michigan.  Anyone know of any personal experience with his expertise?",
            "post_id": "9198220",
            "timestamp": "1371219478",
            "votes": 0
        },
        {
            "answer": "Most if not all, autoimmune diseases appear associated with the HLA (human leukocyte antigen) region. Hashimoto's thyroiditis is associated with HLA-DR3 and HLA-DR5. Other autoimmune diseases are also seen with or linked to these genes which explains the higher risk of particular autoimmune diseases with Hashimoto's thyroiditis.",
            "post_id": "9198258",
            "timestamp": "1371220404",
            "votes": 0
        },
        {
            "answer": "I've seen Dr Brownstein's books online but never read any of them. His thyroid book is called Overcoming Thyroid Disorders.",
            "post_id": "9198293",
            "timestamp": "1371221117",
            "votes": 0
        }
    ],
    "post_id": "9171136",
    "question": "Hello - new to the forum.  Looking for input.  I've struggled with fatigue most of my life with bouts so severe I was dragging and fighting to function.  This past winter there were several things going on - major stress situation at work and in family, was anemic, and also had low D3 and low B12.  I'm 44 and weigh 220 and have a difficult time losing it.  Additionally, I had three full cycles between Jan 1 and Feb 28 and 5 days to a week of spotting before the real cycle begins.   During this time when my lab results showed the above, I was the most fatigued I ever was.  I was working full time and could barely get there.  Doing anything was such a chore.  I was severely achy and foggy as well.  I literally had to sit at work for moments at a time when my brain just wouldn't work.The doctor took those labs and had me to start on iron supplements and B12.  I saw on the results my D3 was 29 which was under so I started that as well along with lots of Vitamin C since it helps with iron and B12 absorption.  Three months have passed and I'm 60 % better but still more tired than I should be, wanting to sleep ten-twelve hours a night, hair still all over the place - especially bathroom sink and floor.  Nails aren't as brittle and peeling but they still have ridges.  Feet still always cold very easily.  I can't stand it sometimes but not as bad as 3 months ago.  My mind still feels a bit overwhelmed at times but nowhere near as bad.Also, I put myself on natural progesterone cream to hopefully temper the heavy bleeding.  It has helped about 20%.Now for the thyroid.  Back in February the doc said my thyroid was normal but now, with still feeling a bit off, I'm looking at what is said here on hypothyroid and am beginning to wonder.  So, here were my Feb thyroid lab results:T4 FREE CALCULATED -  1.83    (1.43-3.8)TSH -   2.79   (.40-4.50)T4 FREE  -   .9    (.8-1.8)T3 FREE -   3.2    (2.3-4.2 pg/ml)Thyroid Peroxidase AB   14 iu/ml  (<35)If anyone has any thoughts, I would appreciate it.  And if levels are off, would synthroid work or is there something better for my type of results?  I have been looking at other people's labs and see that I have such a contrast between my FT3 and FT4.  I'm a little under the ideal for FT3 while bottomed out for the Ft4.  I haven't found any other results with such a peculiar contrast and wonder how this can possibly be.  I mean, isn't it the T4 that becomes T3?  If yes, where did my T3 come from since my T4 is so low???Thanks,Paula",
    "timestamp": "1370392410",
    "title": "Hypothyroid?"
}