{
    "answers": [
        {
            "answer": "bump",
            "post_id": "4018455",
            "timestamp": "1235331922",
            "votes": 0
        },
        {
            "answer": "I get the cold sweats there awful i get soaked at night and suddenly during the day it will pour off me this is a recent thing about a year now and i am 33 and i dont think mine is menopause.My friend has a condition that means he has to eat often and as when he doesnt he shakes sweats and gets dizzy but as soon as he has eaten then he is fine, they dont glucose test on hi i think i cant remeber though what it is called.hopefully somebody will post too.sam",
            "post_id": "4018729",
            "timestamp": "1235337848",
            "votes": 0
        },
        {
            "answer": "It seems like last time we talked about this I asked about your blood sugars.  Yes, your episodes do sound like hypoglycemia.  Some docs believe that this is a precursor to diabetes and some believe that it is an entity unto itself.If you immediately feel better after eating something, then it is likely that your blood sugar was low.The worst triggers of these episodes are foods that cause a big spike in insulin production.  The reason for this is that some foods, like sugary things, cause rapid rise of the blood sugar.  In the normal person this cause the body to secrete a burst of insulin to bring the blood sugar down by making it available to the cells as fuel.  This is the main role of insulin.  In the person with hypoglycemic tendencies the production of insulin overshoots its goal and brings the sugar down too fast, bringing it too low and for too long.  This causes the shakiness, confusion, sweating, rapid heart beat, headache, weakness, fainting or severe, overpowering sleepiness.It is this process of bringing the sugar down that led to the development of the glycemic scale.  All carbohydrates stimulate the production of insulin.  Sugar does it the most and fastest and fiber does it the least (well, actually not at all).  They have studied standard servings of hundreds of food and seen which cause the sugar to go highest the fastest.  Of course, sugar is at the top of the list.But, there are two surprises.  There are two foods that are right up there with sugar.  The first is breakfast cereal.  The second is baked potatoes.People with hypoglycemic tendencies will often have a \"crash\" about three hours after a carb-high breakfast.  They may also find that something like a milkshake can cause what my household calls \"sugar coma.\" - that deep unavoidable nap wher you sleep like the dead.To diagnose reactive hypoglycemia, the gold stand is the 5-hour Glucose Tolerance Test.  Typically GTTs only go three hours.  But, this will often miss the deep trough of low blood sugar in the hypoglycemic.Rena - the best way to see if this is a problem is to go on a lower glycemic diet.  Avoid sugar and processed grains and have some protein, especially at breakfast.  Avoid all cereals except complete whole grain ones like regular oatmeal.  Do not eat sugar on it.Also it would be great to check your blood sugar early in such an attack.  Later in the attack, the body puts out adrenaline to save itself and this will pump the blood sugar up some.Well, more than you wanted to know, but a pet epic discourse of mine.  :))Quix",
            "post_id": "4018938",
            "timestamp": "1235342867",
            "votes": 0
        },
        {
            "answer": "I DO BELIEVE YOU HAVE HIT THE NAIL ON THE HEAD!!!  All the symptoms that you mention have happened except the confusion...I am naturally confused!  heheSeriously though, it was about 3 hours after having breakfast which was a bowl of Oatmeal Crisp with Apple and Brown Sugar (3 1/2 hours actually) when I began to feel real bad yesterday and after I ate the apple I began to feel better.I am going to see if I can see a gp at my lying gp's office other than her tomorrow or Tuesday and get the blood testing done.I truly appreciate this information Quix and I will let you know what is happening...I sure hope that this isn't a precursor of diabetes but I wouldn't doubt it with all the weight I have put on.  Then my so-called friends brought over a fresh baked home made apple pie!  I think I can do without that for a while!I will let you know the next installment when there is a change ok?Lots of hUgs,Rena",
            "post_id": "4019809",
            "timestamp": "1235363807",
            "votes": 0
        },
        {
            "answer": "QUIX, I want to thank you so much for all the time that you give to others, here at this forum.  You are truly a God'send in so many ways!!   I've just found some more 'gold nuggets' from your previous post.  When I was very young, I was always passing out in the shower.  I'd had \"those spells\" other places too, of course, but the \"hot shower\" seemed to do it everytime!    My mom called our family doctor that first time it happened, and he said to rush me a glass of orange juice...so, she did...everytime!This continued for several years, until finally, my aunt (head nurse at the Baptist Hospital in Knoxville, TN at that time), told my mother that she needed to take me to the doctor and have my sugar and blood tested.  So, she did.  The doctor (was different than my family Dr...not sure what specialty?) told my mother that I was hypoglycemic.  I've had to deal with this my whole life!!  Ask my husband how many times he has had to rush me a glass of orange juice.  I try drink it (or other juice) every morning now, BEFORE I take a warm (NOT HOT) shower.I got brave (or stupid!!) one time and was going to conquer the Atkin's diet, after hearing, & seeing, how it had benefited a colleague of mine. I studied the diet book for hours that night and decided to start it the next day.   Hahh!!  I didn't even make it through the day. As soon as I got off work, I drove (although I'm not sure how, as I was trying to black out) to the KFC across the road from our school and ordered a LARGE Pop (don't remember...not the point)!!  I had to pull over & park, to drink it, as I was still about to pass out.  I don't even remember doing alot of this part, just know that I did it afterwards...as I had that KFC cup in my truck.  LOL!!    Anyways, that really woke me up to watching what & how I eat...especially DIETS!!!   The only diet I'm striving to achieve at this point in life (& until I die), is to get back to the most ALL NATURAL, ORGANIC......CHEMICAL & HORMONE FREE FOOD that I can get!!!   I firmly believe that the rise in diseases, including MS, Fibro, Diabetes, etc...is due to the unphathomable amount of chemicals, hormones, & radiation we're constantly being exposed to.   Just my thoughts!  ;)Normally, I ALWAYS (and have since I was a teenager) carry a mug of some sort of drink throughout the day....for 2 reasons.  1) I have chronic dry mouth/throat/eyes...2) my blood sugar seems to drop fairly quickly.  Whenever I start feeling faint, I drink some of my sweet tea, juice (or other?) to quickly 'pick me back up.'  QUIX I never knew that about the \"food spikes.\"  I remember my doctor talking some about sugars and foods to my mother, but I was only about 10 or 11 yrs old at that time, and don't remember much.  Mom never talked about it to me much when I was growing up...she just knew what I needed, when I needed it.  She died 2 weeks after my 18th birthday, (& I miss my best friend so much  :(  ..), so I can't ask her any of the \"desperate questions\" that I have about my health.  My closest Grandma (mom's mom) has passed, & I've lost contact with my \"biological portaguese father & grandmother.\"  It's too bad too, because I knew that my \"portaguese Grandmother\" was always sick and was in bad health.  I can't remember now, what it was that she said she had...as it could be helpful in my diagnosis, since so many things are hereditary.BTW QUIX, you posted the symptoms of hypoglycemia, PRECISELY!!...& unfortunetly, I know the \"sugar soma\" all too well!!  Also, if I ever allow a spell to linger too long without food/drink, then I'm severely sick & worthless for the rest of the day...constant nausea, distortion, confusion, racing heart, MIGRAINE, EXHAUSTED,...walking around in a daze!...etc...doesn't matter when I FINALLY get to eat...if I've reached that \"point of no return\"...then it's just over for me that day!!!  So, I try to carry around pieces of candy/snacks in my purse/car for emergencies...in addition to my big mug of course!!  ;)RENA, feel free to PM me anytime hon, if you have questions.  Believe me!...I know exactly what you're going through...and it CAN be scary, so don't hesitate to ask. ;)~tj",
            "post_id": "4019943",
            "timestamp": "1235368639",
            "votes": 0
        },
        {
            "answer": "Thanks.I think you are saying that you now know that by carrying around candy and snacks you are perpetuating the episodes of hypogycemia.  For everyone reading, using candy causes the blood sugar to be on a continuous rollercoaster of highs and EXTREME lows.  This is all because of the way they induce the production of insulin.   Tj said it well - food spikes.  Much better to eat 6 or more small meals a day, each to include a little protein and ONLY lower-glycemic carbohydrates.  The protein acts to ease the peaks of the blood sugar highs and lows.  I'm not talking Atkins here (though that is MY preferred diet).  Just check out the glycemic scale and eat the lower carbs plus high grade proteins and healthy fats.  Organic and natural are great, but remember that there are some pretty sugary natural foods.  Treat those as possible enemies until you have \"cleaned up\" and cautiously tried them again.My dad was a severe hypoglycemic for years, lost his job, went on disability and was (mis)diagnosed as schizophrenic.  He couldn't work, couldn't make decisions and was irritable.  An endocrinologist properly diagnosed him, placed him on the above rules and he returned to his prior brilliant self.  His blood glucose was hanging around 40 to 50.You HAVE to stop the sugar!  The withdrawal can be holy h@ll for about three days.  During the time that you are withdrawing from the sugar, eat all you need of proteins and totally whole grains.  Then you can back off once the withdrawal of feeling wretched is over.  The result can be astounding.  This is hard science people - not fad - not supposition.  Initially I would have everyone (hypoglycemics) also be off of white flour, pasta and potatoes, and easy on fruit which also can trigger a too-sensitive pancreas.  Once the blood sugar is stabilized (a week or so) you add in the more high-glycemic  carbs (whole grains are better) and fruit slowly and see how they affect you.Some severe hypoglycemics have to be very careful even with fruit.Great snacks are nuts, cheese, a bit of chicken breast, etc.  Just stay away from the sugar.  I am speaking to those with the reactions to sugar that we are speaking about.  It's a great way to eat anyway, but I am not preaching diet here.  Diet is as dangerous as politics and religion, lol.Tj - Are we on the same page?  Rena?Momma Quix",
            "post_id": "4020069",
            "timestamp": "1235377049",
            "votes": 0
        },
        {
            "answer": "Wow!  I never realized how serious this can be!  Thank you to you both, Quix and fibrotj!  I called the dr. office today and my lying gp is going on vacation for two weeks and I can't get in to see anyone else until March 10th.  Do you think it is safe to leave things for this long?  I am doing ok today so far and hopefully I won't have another attack like the other day any time soon.I am not sure what you mean by lower glycemic carbs either...I realize that stopping sugar is important and I have cut way back on sugar intake by using Splenda instead, that is why I am so confused as to why I am feeling this way all of a sudden.I have never been one to eat breakfast and although I know it was not good for me there have been many days when I don't eat lunch either.  I have in the last two weeks eaten a bowl of cereal for breakfast every morning and now I know that wasn't the way to go.  I have also ensured that I eat lunch every day and a small meal at supper.  This really stinks if I am finally trying to be a good girl and this is what it gets me eh?  heheI have been eating Golden Delicious apples, one every day and if I don't have one I have been eating seedless green grapes or pineapple which is something new in my diet too.  I have never been big on fruit but figured that it was better for me than not eating anything...hmmm...maybe not eh?I don't know where to go from here really...cut out sugar for three days, protein and whole grains...but what foods exactly would you recommend?  I eat whole grain bread but if I am to avoid flour...Protein...you mean meat and peanut butter and eggs???I sure could use some more help...I don't know when I should see the dr. about this or if it is that much of an emergency...can you help me here??  Thanks so much to both of you!Hugs,Rena",
            "post_id": "4022107",
            "timestamp": "1235423308",
            "votes": 0
        },
        {
            "answer": "there's good advice here -www.endocrineweb.com/diabetes/treatment.html or just enter diabetic diet on google and follow any of the non-commercial links.  There is tons of free information to help you get off the sugar and lower your carbs.For me the carbs spike my glucose faster than sugar does. A piece of thick crust pizze is worse than an ice cream sundae.   I've been eating more sugar lately and feel the difference in my energy level and I don't mean in a good way.Unsweetened, please!Laura",
            "post_id": "4022186",
            "timestamp": "1235424423",
            "votes": 0
        },
        {
            "answer": "Thanks for the advice my dear!  I am really lost with all of this...can use any help that is offered!  I am not sure what is \"spiking me\" but I know I don't like it!  I will let you know how I am making out and thanks again for the help!Hugs,Rena",
            "post_id": "4022199",
            "timestamp": "1235424650",
            "votes": 0
        },
        {
            "answer": "Rena, I want you to do a search on The Glycemic Index and give yourself a little education.  The Index lists foods in the order that they cause your blood sugar to go up the fastest.  At the top are sugar and processed flour.  As you go down you get into the more natural, less processed food, vegetables and fiber foods.  For hypoglycemics, you need to understand this concept.What is a carbohydrate?There are three categories of food in the world.  These are carbohydrates, proteins, and fats.A carbohydrate is derived from plants.  They are based on the element carbon (carbo) and water (hydrate= hydrogen and oxygen).  When you look on a package's nutritional information you see how many grams of fats of different kinds, grams of protein and grams of carbohydrate are in that food.  They determine the number of grams of carb in a type of food by burning it and assaying how much carbon is left and how much water is released.The simplest form of carbohydrate is sugar, but processed flour and other grains are close to it.  When you eat the body turns all carbohydrates into blood sugar.  Sugar is the same as glucose in the blood.  Actually glucose in the simplest form of sugar.  Other sugars are a tiny bit more complicated like fructose, lactose, etc.  When you see a chemical with the ending of -ose on it you are dealing with a form of sugar.In the pancreas is an area that monitors the blood glucose level.   When a sugar load is eaten the pancreas releases insulin to deal with it by delivering it to the individual cells of the body to use as fuel.  If there is more glucose hanging around than is needed by the cells the insulin does it's secondary job, helping to transform the sugar into fat for storage in case there is a shortage later.  If you consistently eat more than the body needs at the time you start getting fat.  Thank you, insulin.Not all carbohydrates affect insulin equally.  Sugar and other readily absorbable carbs cause an immediate spike in insulin.  As I said above, in hypoglycemics, the insulin mechanism overreacts and too much is released.  The blood sugar falls too low, too fast and stays there too long.  This causes the hypoglycemic reaction as the body goes into a stressed mode.  Cells of the body need a steady supply of blood glucose, especially the brain.  When it is too low all h*ll breaks loose and you get the symptoms we have been talking about.Most people discover that they can stop a reaction very early by using sugar.  The problem is that this perpetuates the exagerated rise and fall of the blood sugar and keeps the vicious cycle going.Why not use sugar?  Afterall, diabetics are told to eat a pice of candy or drink a glass of orange juice when their sugar gets too low.  There is a BIG difference.  Diabetics don't have a proper insulin mechanism.  Either they don't produce enough insulin (Type I) or their bodies are resistant to the action of the insulin they do mak (Type II).  So what works for a diabetic can a hypoglycemic more sick.The goal, when you have hypoglycemia is to keep the blood sugar stable and avoid the spikes which result in the dangerous and miserable lows.The solution is to eat more frequently and include other foods than sugar and processed grains that do not cause bigtime production of insulin.  This is where the Glycemic Index comes in. (also called the Glycemic Scale or Ladder).  The first thing you do is eject the sugar and other high glycemic foods from your diet.  This is things like white bread, pasta, pizza crust, bakery goods, rolls, ---- and such.  Replace those with lower glycemic carbs, proteins and a little more healthy fats.  These are converted to blood glucose slower and do not affect the insulin production as much.  The carbohydrates you want are those that are more complex.Complex carbohydrates (often called starches) are like those in whole grains - realizing that these are still higher on the scale than others, legumes (beans, lentils, etc), tomatoes, onions, squash, and other vegetables.  Only whole grain rice with bran is lower on the scale.  Porcessed white rice is still a readily absorbed carbohydrate.  Whole brown rice is much lower.  Things with fiber are are often great choices.  Fiber is a carbohydrate that is not absorbed and is passed in the stool retty much unchanged.  Think of it this way.  A pinecone is a plant.  It is also a carbohydrate and pure fiber.  If you eat a pinecone you will poop a pinecone.  :((Fruit - always the perfect food, yes?  Not necessarily.  If you are a hypoglycemic even fruit can do you dirt, especially if you have uncontrolled hypoglycemia.  The fruits that are lowest on the glycemic scale are the berries - blueberries, blackberries, raspberries, and strawberries.  Some fruits are pure sugar and are fruits by definition of the way they grow and not by how healthy they are.  Some fruits are pure sugar and are fruits by definition of the way they grow and not by how healthy they are.  (I repeated that for emphasis, because not all things that are natural are healthy for everyone).After stabilizing their blood sugars for a while, many hypoglycemics will be able to add in most real foods (not sugar or processed grains).  The length of time need to return their insulin production toward normal varies from weeks to months or years.  A severe hypoglycemic may be controllable with diet, but may never be able to enjoy sugars without paying a price.  My dad is one of the severe ones.  If he goes on a toot of eating candy and pastries, he slowly gets foggy and unclear in the head, and starts sleeping every day away.What I have seen is that when a hypoglycemic gets clear of the sugar/poison they feel soooo much better that they aren't as tempted by the processed carbohydrates again.What to do about the inevitable crashes, especially early in the process when your insulin production is still way out of control?  A bite (one) of candy is okay, but also eat something lower on the glycemic scale to give you a longer, more drawn out rise in your blood sugar - like a handful of berries and an ounce of cheese, some nuts, or a piece of meatThe crashes can almost be completely eliminated by eating 6 little meals a day - each containing some protein and a low glycemic carb - whole grains or vegetables.  Don't forget healthy fats.During the first week, but especially the first three days, you may have a horrible craving for sweets.  If the snacks don't take care of it, then choose a fruit that is low on the scale or several whole-grain crackers like Triscuit or SunCrisps, or some apple.Hypoglycemia is dangerous in that you could faint while driving or climbing stairs.  Our brains are diseased enough without depriving them of their needed fuel, even for an hour.  You will feel better.  Rena, you will feel less confused, lol.Go look at some sites dedicated to the glycemic scale and or a low-glycemic diet.  It will all begin to make sense to you.  The ultimate goal is to stop pumping out insulin like you were trying to put out a fire.  A side benefit for many eating this way is losing weight.Whew!Quix",
            "post_id": "4023107",
            "timestamp": "1235441178",
            "votes": 0
        },
        {
            "answer": "WOW...YOU ARE THOROUGH MY DEAR!!  Thanks so much for all this information...it makes it all a lot clearer and I now know not to eat any pinecones!  hehe  I would also like to \"thank\" the insulin as well for turning my sugar into fat...dirty bugger!  I will look into the Glycemic Index and glean some information from that as to what I shouldn't be eating.  Then I will head to the store and get some of the foods that I should be eating versus the ones I shouldn't and I should start to feel better.  I am also very tuned into this because like you said, \"a side benefit to eating this way is losing weight\"!  I have been wanting to start a diet but really didn't know where to begin.Thanks sooo much for all the time you put into this post Quix...I really do appreciate it and at least now I have somewhere to start while I am waiting to get some blood testing done...hey maybe if I behave and follow your instructions I won't have to get a blood test cause I will feel better...sounds a whole lot better than getting stabbed by a phlebotomist doesn't it?Thanks again Quix!Lots of Hugs,Rena",
            "post_id": "4025121",
            "timestamp": "1235496086",
            "votes": 0
        },
        {
            "answer": "Quix, i'm in the middle of a flare, so if this is greek i apolgize becuase my minds likie dry concrete but i was diagnosed with low blood sugar years ago and sent on my merry way... and one of my labs just came back to say that I know have high blood sugar, which has scared me. i've controled my hypogyclemia by eating sugar becuase no one ever told me how to control is any onther way. I have gastroparesis so i can't eat fiber, and i have allergies so other stuff is out like nuts and that diet you mentioned looks so hard becuase the only things that digest for me are potatoes, rice, whit flour stuff and i don't want to have a tube put in my tummy. I'm already thin, i can't loose anymore weight but I go through the day on a vicious cycle of up and down on sugar crashes. i'm used to this but i know it's not good, i eat 5-6 small meals a day and juice, candy, fruit bars and anything inbetween if i start to lose it.example: breakfast was rice chex and two cookies, and lunch was chicken, pasta and peas and sweet tea. I'll have to eat soon again, or drink Ensure..Please, what do I do? I've tried to read everything you wrote here. It makes snse but it all bounced around in my head. If I were to get off of sugar completely how would i control it? i hope this makes any sense.~Sunnytoday~",
            "post_id": "4025824",
            "timestamp": "1235505700",
            "votes": 0
        },
        {
            "answer": "ST, the point Quix is making with the hypoglycemic's  use of sugar is it puts your insulin production on a roller coaster and never gives your body a chance to equalize at a normal spot.  You want to eat the foods that don't cause these glucose levels spike - either high or low.  My mom bounces all over with her glucose - 35 to 140 in a day's time often.  Once you find the diet that your body reacts to you will feel so much healthier.  Some of it is so simple but other parts are complex and you have to make a concerted effort to understand it before you can eat right to solve the problem.you're sweet enough,Lulu",
            "post_id": "4025870",
            "timestamp": "1235506313",
            "votes": 0
        },
        {
            "answer": "yeah,  i know i'm on a rollercoaster and my foods are causing it to go up and down, i just don't know how to get off of it. Perhaps a nutrionist would be the thing to go to try to get a balance between my gastropareis, IBS, allergies, and blood sugar problems. So far my way has been eat sugar to keep around 100 pounds and if i get to feeling like i'm goin to pass out so i drink juice or eat candy. Reading this post helped me understand that i need to even it out if at all possible. Not sure how i'm going to yet though, i'll ask mom to read this and hlep me apply it to me.i'm glad you think i'm sweet enough.",
            "post_id": "4025949",
            "timestamp": "1235507497",
            "votes": 0
        },
        {
            "answer": "Hi there, I have a great cookbook that explains the glycemic index, lists foods and their glycemic index rating; they call it the G-Force.The cookbook is The Healthiest Diet In The World by Nikkin & David Goldbeck.  I found it on clearance, so you may be able to find a copy of it online at a low price.  I've enjoyed a lot of the recipes, and have learned a lot from all the informative pages it contains.One thing that brought it to mind was your mention of artificial sweeteners.  Quix can probably tell us if there is any scientific research to back this up, but let me copy down something that this cookbook says about them:\"Artificial sweeteners, including saccharine, cyclamates, and aspartame, don't turn into glucose and therefore don't raise blood sugar levels.  Because of this many people assume they can only help with weight control.If you look back on our discussion .... you may perceive how these sweeteners could actually stimulate weight gain.  Remember, when the brain anticipates food, and sweet food in particular, it sends out signals that arouse insulan even before glucose gets to the bloodstreamSince the brain can't detect the absence of calories, insulin is released even if there is no work for it to do (i.e., there is no glucose released for it to escort into the cells).  As long as this uncalled-for insulin remains in circulation, the effectos of hyperinsulinemia, including fat storage and retention, are set in motion.Moreover, this unsatisfied expectation of calories may manipulate the brain in a way that stimulates hunger.  This effect has been demonstrated in experiments on animals\".Of course, this book was published in 1998, so I'm sure a lot more research has been done since then.Since I had my tummy troubles, I've found it difficult to eat breakfast and sometimes lunch.  I have found that I feel better if I do eat, even if my tummy bloats a little.My favorite breakfasts are a slice of toast with fresh-ground almond butter (no sugar or weird fats added), or a bowl of Natures Path organic pumpkin flaxseed granola with unsweetened almond milk on it.  Oh, or home-cooked old-fashioned oats with some natural no-sugar added applesauce mixed in.When looking for low glycemic foods, such as whole grain bread, look for whole wheat flour as the first ingredient.  Avoid anything with high fructose corn syrup.  A lot of bread includes sugar of some sort; choose one that lists it way down on the list of ingredients, and is something like honey,.molasses, or plain sugar.  They all do the same dance with the blood sugar, but at least honey and molasses have traces of nutrients and are often less processed than other sweeteners.When I consume things with some sweetener in them, I try to balance it with fiber and protein, to slow the jolt of sugar into my bloodstream.Funny, I don't have hypoglycemia or any sign of diabetes; I just started eating this way to improve my health.When my tummy acted up, I had to eat white bread, rice, bananas, and applesauce, which just about drove me crazy.  What I'm saying is that when you get through changing your eating habits, it feels like the normal and desired way to eat.Not to say I don't want a big cookie now and then; I try to select one with oats and walnuts,  going for the healthiest of the bunch.When you think of whole grains, think of things like barley; it not only has a low glycemic index, it can also increase your feeling of fullness.  I make a really yummy chicken veggie barley soup; let me know if you would like the recipe.I want you feeling well and happy, my friend.  Take good care of you, and accept a hug from someone down here in the balmy 50 degree rain.Many hugs,Kathy",
            "post_id": "4026121",
            "timestamp": "1235510555",
            "votes": 0
        },
        {
            "answer": "I would love to have that recipe Kathy my dear and thanks for all the information!  I will look for that recipe book for sure.I think this is going to be rather difficult for me though because I still have to cook a decent meal for hubby who works 12 hours shifts and needs good meals.  I suppose it wouldn't hurt for him to lose a few pounds too but it will be a bigger adjustment for him.  First of all I need to get my ducks in a row and figure all this out and then I can get started and I still need to have my blood tested by the doctor I guess.As usual the MS Forum and all the wonderful people here have come through for me again and I really do appreciate it.  Kudos to all of you and your thoughfulness and trouble you took to type all this information out for me...I love ya all!Lots of hUgs,Rena",
            "post_id": "4026484",
            "timestamp": "1235516160",
            "votes": 0
        },
        {
            "answer": "We all have different dietary needs, but one of them is NOT sugar - ever!  You may find that you need more starches.  Just eat as low on the glycemic (glyco=sugar, emic=of the blood) scale as possible.Sunny - Sugar load cause the stomach to empty more slowly.  You may be exxacerbating your gastroparesis by eating so much sugar.There is a lot of misinformation out there about artificial sugars.  Most of it is false.  Here is what has been proven:Look to the explanation above about how artificial sweetners fool the body.Aspartame - mimicks sugar not only on the taste buds, but in the body.  Beyond the expectation of sweetness Aspartame does even more.  Though it doesn't cause a rise in blood sugar, the body thinks it does and increases the production of insulin.  In the healthy dieter, this lowers the blood sugar faster and they get hungry sooner.  Even within a few years of aspartame hitting the market in the (?'80's?) diet docs noticed a \"rebound hunger\" after eating things sweetened with aspartame.  So aspartame sabotauges any diet.  This effect was seen only minimally with the other articficial sweetners.  Last time I looked it had not been seen with sucralose.There is a natural plant derived sweetner that has been available for years in health food stores, called Stevia.  It is now on the market in the US as Utrivia or something like that.  I think this does not mimic sugar.High fructose corn syrup has a very special adverse reaction.  It basically blocks the hormone that is sent to the brain to signal we have eaten enough.  People who take in a lot of HFCS stay hungrier and eat more.Quix",
            "post_id": "4026749",
            "timestamp": "1235520761",
            "votes": 0
        },
        {
            "answer": "Quix thanks for all the great info.well. here goes. wish me luck. i'll try to go a week of a lot less sugar. not that i'll completely succeed but i'll at least eat a good breakfast instead of cereal & cookies, a good lunch etc. I'm gonna need all the good luck wishes i can get becuase after about three days i go crazy for sugar, and feel pukey. I'm gonna have to figure out a middle ground within with my crazy diet restrictions that will let me retain my weight.. I can't eat high fat due to gallbladder sugery so if you cut out fat and sugar, you get thin. :).. any suggestions? msg. me!",
            "post_id": "4026810",
            "timestamp": "1235521728",
            "votes": 0
        },
        {
            "answer": "Silly rabbit!  there are LOTS of foods besides sugar and fat.  Lower glycemic carbs like whole grains and veggies, cheeses, nuts, and protein.  I wasn't suggesting high fat, but a teaspoon of olive oil and such are necessary for your health.Yes, after about three days you feel pukey for some more sugar, but a little longer and you will stop the cravings.Have you ever been evaluated by an endocrinologist?Quix",
            "post_id": "4027586",
            "timestamp": "1235536385",
            "votes": 0
        },
        {
            "answer": "I was diagnosed in my mid 20's, yes, a LONG time ago, lol,  with hypoglycemia. Then with my first pregnancy I had gestational diabetes. Then 4 years ago I was diagnosed with Type 2 diabetes.  For lo those 40 years, I never followed the right diet. For the past year I have followed a modified Atkins diet, have lost 40+lbs, and now do not have to take the oral diabetes medication. I'm one of those who can't add much fruit at all, without spiking my blood sugar. Oh well, good thing I love steak, lobster, pork, and nuts and cheese.  Rena and Sunny, after a week or so, you won't feel the desire for sugar any more.  This doesn't mean you can't ever have a piece of german chocolate cake, or Ben and Jerry's Cherry Garcia ever again. It just has to be  very very seldom. I promise after awhile you really won't miss them. I have found it's like any addiction. After the first week or so, it's more mental than physical. This from the woman who still hasn't quit smoking. Good luck, it can be done.",
            "post_id": "4027906",
            "timestamp": "1235549595",
            "votes": 0
        }
    ],
    "post_id": "4016196",
    "question": "I have complained in the past about these cold sweats that I have been having which also included  light headedness and nausea.Well this afternoon I had an \"attack\" of these symptoms and I am wondering if anyone here has ever had to deal with Hypoglycemia.  My symptoms were again the cold sweats, light headedness, high anxiety (breathing pace increased and felt almost out of breath) and nausea.  I checked my heart rate while this was going on (although it wasn't easy) and it was 84bpm which is fairly normal for me.Now when I asked my lying gp about it she automatically knocked it up to the dreaded \"menopause\" but I wasn't flushed or hot during the last attacks and although I explained this to her she said that the holter monitor will tell us what is going on.  HUH...not if it's hypoglycemia you silly doctor!  Today was the worst \"attack\" I have had of this and it is really scary!  I did have a bowl of cereal at about 10:30 after sleeping in until 9:50.  I was going to have lunch just before this happened and when it happened I thought that perhaps eating would make me feel better...this was about 2:00 p.m.  I ate an apple and I amazingly started to feel better but still not right so I had a cookie but they are not sweetened with sugar so I don't know if it had any effect or not.  This is really bothering me as it really knocks me for a loop and I know that my gp isn't going to be much help.  If it keeps up I will go to a medi centre or perhaps see if I can get in with another dr. at the same clinic.  Does anyone out there know anything about this or do the symptoms ring any bells?  Any help would be much appreciated!Lots of hugs,Rena",
    "timestamp": "1235266578",
    "title": "Hypoglycemia??? Off Topic but I do still have MS..."
}