{
    "answers": [
        {
            "answer": "Hello Mom of 4,First of all, I'd like to say you're doing the right thing by being concerned and getting your daughter to the doctor.I'm not a medical professional, just a parent of a child with type 1.  I have to apologize, the archive search isn't working, so I can't look up your post history, but I think I can figure out what it was about.  To make sure I understand, here's what I see from your descriptions as your daughter's symptoms:  she is a pre-diabetic with islet cell antibodies in her system.  She's having abnormal high scores, but nothing too high.  She's having lows, and that's where your concern is based.From that summary, as a non-medical professional, I'd have to say that your daughter is likely to be developing type 1.  Ketones, moderate highs, and severe lows are the symptoms on which I'd base that.  That being said, she may never actually develop diabetes.  She may remain borderline for the rest of her life.  Just because a person has the islet antibodies doesn't mean they will develop type 1.  I can't find any studies which describe that, but that was the information given to me when I participated in the TrialNet study.  Not having a history of type 1 doesn't really mean anything, type 1 is being diagnosed more and more often in children that have no history in their families.  It's unfortunate, but true.My suggestion would be to continue to keep in contact with your endo and family doctor, followups will be necessary to verify glucose scores and the status of the pre-diabetes.  I would also suggest, if you have not already done so, to adopt a carb-healthy diet.  Know the carbs in the servings of food that you are serving, try to keep them consistent (meaning don't have a 20 gram breakfast one day and a 150 gram breakfast the next).  Your endo should have a diabetic educator or dietician available to help you create and maintain that diet.Does that help?",
            "post_id": "2430991",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "Sorry for the bumpy post,I fit all I could into 1600 spaces.Hypo began about 1yr ago,out of the blue.Unexplained,random,aprox 0-2 per month.Borrowed neighbors meter one day during a spell,realized her low and here we are now.Endo has not yet tagged her \"pre-diabetic\" but made specific mention to T1 due to antibody predisposition.Given he wants follow up every 2 mos he seems cautious,leaving me anxious/afraid and full of questions.I found a TrialNet study (Natural History) researching these antibodies in pre T1 onset.Since daughter is antibody +,I tried to volunteer her but with no family history, they turned her down. :-(I wish I knew more about these antibodies and her risk.My desire/need to learn about these antibodies is comparable to that of a scientist I think.I feel afraid which makes me feel hopeless yet obsessed at the same time.I crave the knowledge,the whys,hows,whens,what ifs.Her subtle body hints are there,I see them,have for a long time.As time goes on,things seem more pronounced and at times,worse.Gut tells me something is not right.Endo does not wish to relate her hypo to her antibody presence at this time.Tho in my mind,as her mother/knowing my child,all these things run together and suggest common ground.Normally very bright,happy,girly,sweet etc.She becomes irate at times, angry,combative,whiney,aggressive,downright mean,cant verbalize how she feels etc.Example~She will impulsively kick 2yr old sibling in head as if her brain was nonexistent.Exactly resembles an adult when they accidentally put milk away in towel closet, realize what they have done and feel embarrassed/stupid/ashamed etc.I have 3 other children and have never felt an urgency such as this inside myself.I see correlations between her behavior vs BG's.This AM she had cereal.Started bouncing off walls,I could not settle her.She got irate,mean,combative,demanding to eat!This was 1hr after cereal.I test her, BG was 210.She also had trace/small urine ketones.During lows,she is opposite,as if her batteries died.It seems rare anymore that she is the happy,determined,sweet,outgoing little child I know she is.Why does she need to live like this?I want my child back but without a real diagnosis,how do I help her?If T1 really is in her future and all these issues are somehow related to that,I wish it would stop tormenting her like this and show its ugly face already... so that we can fix my child! :-( I'm Frustrated!I apologize if I come across harsh or angry. I do not mean to,not at all. Its just that I ache for more specific answers... to have some kind of reality as to where my daughter will be in another year or 5, or what this all means,...ANY kind of reality is better then the void I feel right now.",
            "post_id": "2435235",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "I seem to be having a hard time keeping her sugar out of the hypo range today for some reason... :-( She had a few readings today that bother me... any opinions?* 8:30am (fasting) she was 69. No ketones.* 9:00am ate breakfast.* 10:00am (bouncing behaviors) tested 210. Also had + small ketones.* 11:30am (symptomatic before lunch) tested 60.* 11:40am ate lunch.* 12:15pm no ketones.* 12:30pm tested 173.* 2:30pm she came to me saying her tummy hurt and that she has a \"hedick\" (headache) and needed me to test her (she is rarely wrong). I tested her and she was 57. Gave her a small snack and a little OJ.* Its now about 30 mins later and she is testing 154.",
            "post_id": "2435236",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "Do you know how about many grams of carbs she had and when since last night?",
            "post_id": "2435238",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "No problem about the bumpy post, I just wanted to make sure I understood your situation.  I fully understand how you feel.  It's frustrating because there is so much you don't know, it makes you angry that nature is making your child deal with these things, and you're overwhelmed by the situation that you're dealing with.  Very understandable, and I've been right there with you.  But keep up the research, keep asking questions, you're doing the right thing.Calling her \"pre-diabetic\" was probably not the best term on my part.  What I meant to convey was that she has all the symptoms of a person who may develop diabetes, but that development may never occur.  When it comes to your children, being cautious is best, and a parent's gut feelings can identify problems that a doctor doesn't see.  You're right in being concerned, and you are doing the right thing by having her checked out.  The hypoglycemia you see may be a sign of her pancreas starting to stall and having issues, and then when it comes back online so does she.  That's another sign that diabetes is possible, in my opinion.  The problem is that, since your daughter's pancreas still seems to be mostly working, and it may continue to mostly work, it's nearly impossible to predict what will happen in 1 year or 5 years.  But keeping close tabs on her glucose will help you down the right path.My 8 year old diabetic displays some of the same emotions as your daughter.  She is also bright, happy, girly, and sweet, but just this morning she had a high and was very irritable and just smacked her brother in the back of the head.  99.9% of the time when she's agressive, mean, and irritable like that, she'll either be high or low.  Keeping her glucose under control keeps her as the happy child that we want to have.  It's just not fair that a child has to deal with highs and lows, but if we can identify them we can keep their frequency to a minimum.  Keeping her diet regulated should help.  There are certain cereals, for example, that we simply don't buy anymore because their total carb content per serving is just too high.  There's another brand that makes her go low every time she eats it.  Food does funny things sometimes.I did some searching on islet antibodies and found <a href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=pubmed&dopt=Abstract&list_uids=16211374\" target=_blank>this link at the NIH</a>, as well as <a href=\"http://www.childrenwithdiabetes.com/dteam/2003-01/d_0d_a18.htm\" target=_blank>this post</a> at ChildrenWithDiabetes.com.  ChildrenWithDiabetes has a pretty good search tool which can locate a bunch of research on islet cell antibodies.  <a href=\"http://diabetes.about.com/b/a/214352.htm\" target=_blank>Here</a> is another article about research that can predict type 1 with abuot 80% accuracy.  That might be something that you talk to your endo about.",
            "post_id": "2435237",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "I have been reading this conversation with real empathy. I hope to encourage both of you wonderful moms by saying that I have had type 1 diabetes for 36 years and my life is fully normal except that I have to take insulin shots and count my carbs. A good life is fully possible with diabetes, so hang in there.Now, for the hypoglycemia, let me agree with the suggestion to ask to be referred to a dietician. I have people with reactive hypoglycemia in my family and there definitely are dietary changes that can be made to help minimize the hypo spells. Counting the carbs is a great suggestion so that the body has always the same number of carbs being eaten and it gets no shocks with high-carb meals. And adding proteins is often suggested to help with hypoglycemia, for it does ease the stress on the pancreas, which is over-producing insulin when stimulated by straight carbs. Some hypoglycemic people find that lowering the number of carbs that they eat seems to help, for the pancreas then gets a break and starts to ease off on its overproduction of insulin once the person adjusts to the low carb diet. But others find that this just makes them more hypoglycemic. So it will be trial and error until you find what works the best for  your daughter.I have heard some doctors suggest that you drink a half a cup of milk instead of orange juice to raise a low glucose reading, for this does not dump into the system quite as quickly as juice does and is not as likely to cause a high reading later. I personally like to add some Sugar-Free Nestle Quik to a small cup of milk to counter-act a low. It works well and is healthy. In your daughter's case, it might help keep her from spiking high afterwards.Others have told my hypoglycemic sister-in-law to eat nuts and cheese for snacks instead of snacks with carbohydrates. This would help IF your daughter's hypo spells are due to an over-reaction to carbohydrates. If you try this, though, you might want to watch her carefully for a few days to see if the absence of the carbs in snacks makes her hypo spells better or worse. It may not be the solution at all, depending on how her pancreas then reacts.I am a mother, too, and I fully understand and sympathize with the fear you are feeling. It will get better as you learn more about carbohydrates and how they work with your daughter. Even if she develops diabetes, her health will be better because you are being such a responsible mom and getting her tested often so it gets caught early, before damage can be done to her body. You are absolutely correct about moods and glucose levels, so do check her when her mood seems \"off\". We do tend to feel irritable or depressed when glucose levels are high or low. And it appears that your daughter already can recognize when she is \"off\", and this is good. We do wish you the very best.",
            "post_id": "2435242",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "Actually, SSG, I'm a dad, but thanks for the encouragement!;-)",
            "post_id": "2435243",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "Empathy for others going through what my family did when our daughter was diagnosed is exactly what brought me to volunteer for these forums.  Nobody should have to go through these trials alone, the more support people can get the better.  I know exactly what you mean about wanting your child to be normal.  I'd have to hold my daughter while she screamed and cried about being different than all of her friends.  It just plain sucks.  Quite often as a parent of a diabetic child you feel simply helpless.  If your child has a cold or a scrape on the leg, there is something immediate and tangible that you can do to fix the problem and make things better.  Other than watching what she eats and making sure she maintains her treatment, there is nothing I can do.  Don't get frustrated because you're not sure how to treat your daughter.  Families that have been dealing with diabetes for a decade still learn things all the time and still struggle with managing the disease.  I follow this forum as a user as well, because I want to learn from other's experiences.I'd still ask your endo to set up a talk with a dietician.  Every child and every treatment is different, and the way it was set up for us is that our daughter gets a consistent amount of carbs each meal at the same time every day.  For example, she gets 45g for breakfast at 7:30, a 15g snack at 9:15, 75g for lunch at 11:30, and so on.  Knowing what your daughter is eating, and making sure that she doesn't get 20g for lunch one day and 200g the next can really help with understanding how her body is reacting to that infusion of carbs into her system.  I was pretty clueless before our diagnosis about just the number of carbs in some of the foods we were eating, and it's been a huge learning experience in reading labels.  Lowing simple sugar foods is a good start, but keeping them consistent would be a good addition.  Counting carbs isn't as hard as it sounds.  You just read a lot of labels and understand portion size.  As a start, don't change anything about what you make, just keep a journal of what she ate and how much.  Then you can go back through after you're done and look at labels and figure out what carbs she got.  Then you can match that up with her glucose scores and see what foods, meals, and portions are good for glucose scores and what aren't.  My daughter eats most everything that she did before, but we have to adjust portion size or swap out milk for water to drink if we're having one of her more carb-filled foods.  You don't need a menu to work from, just track the carbs you're already serving.  Other kids do fine with the same diet as your daughter's because their pancreas is still working completely normally.We always try to include proteins in her meals as well.  Proteins \"balacing out\" carbs is more an Adkins thing, I think, than a diabetes thing.  Carbs take anywhere from 10 minutes to 2 hours, on average, for the stomach to digest.  Proteins take 4 to 6 hours for the stomach to begin to digest, so it has a lot softer effect on the body than straight carbs do.  <a href=\"http://www.childrenwithdiabetes.com/d_08_000.htm\" target=_blank>Here</a> is a link with a lot of information about nutrition.  <a href=\"http://kids.jdrf.org/index.cfm?fuseaction=home.viewPage&page_id=268DBC44-5004-D739-A5306B265CF37C74\" target=_blank>JDRF</a> also has a section in their Kids Online pages about healthy eating.  Almost all of the foods that you know as \"healthy\" still are.  Lots of veggies and fruits and so on are still good, but you may not be able to serve as much as you used to because the number of carbs would be too high.  You may also want to look at lower carb foods and treats.  Many of the top vendors have lower carb products that are really good.  But be wary of the \"sugar free\" claims, as that's usually purely marketing.  If you look at the label for those, it almost always shows that the total carbs in a serving is higher than the regular, since they added other non-sugar carbs to keep the flavor in their product.A tip about how to deal with a low is to get glucose tablets.  We buy ours from Walgreens, they have 3 different flavors.  They are 4g of fast acting carbs each, they worked out much better for us than giving food to treat a low, because typically a low is discovered at meal times, and she still needs to eat.  The tablets won't fill her up, and they raise blood glucose by about 15 to 20 points for every tablet taken.As for your meal last night, the chicken itself is all protein, but if you put barbeque sauce on, that has carbs.  Potatoes are high in carbs, broccoli isn't too bad for carbs, and cheese is mostly protein.  There are a bunch of web sites available that list carbs in foods.  Track the amount of each type of food she eats and when, it'll give you a great handle on what's going in her system.I'm more than happy to help, nobody should have to deal with this alone.",
            "post_id": "2435240",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "Your response brought me to tears because I have not had the opportunity yet, to experience empathy from someone who knows how my heart feels and knows the zigzag of emotions that I have been experiencing. I felt that empathy in your response and I thank you with every ounce of appreciation inside me. You are right, it *is* very overwhelming. I try so hard on a daily basis not to *over worry* but yet on days like today, how can I not? I wish for nothing more then for her to be \"normal\" again. Some days she seems ok and I gain hope, other days it looks very bleak and I lose hope. I want to do right by her more than anything in this world but the \"bad days\" bring me back to hopelessness because she does not have a real diagnosis yet and I do not feel confident about how to treat her. Sometimes I find myself feeling as though I am walking a tightrope with both ends a flame but its taking eons for the rope to finally burn through. I dont know which emotion is more powerful, thankfulness for the extended burn time or the hope that it will hurry up and finish the job. This makes me feel guilty and very, very sad. One step forward, 3 steps back, 2 more forward, 5 more back... up, down, up down, sideways, backwards, flipped, frontwards and back again. When do we finally find ourselves ahead of the challenge and how do we cope until we reach the end? That is how it seems.Unfortunately, I assume because she does not have an actual diagnosis yet, I was not educated by her endo on ways to feed her. (But he feels fairly certain after her tests, that she does not have a rare metabolic problem such as hyperinsulinism or tumor etc.) All he suggested was to lower simple sugar foods. My children do not get soda or candy or cake etc. on a regular basis. Cakes and the like are occasional treats for us but I do not know every food that might be a \"simple sugar\". I believe I feed my children balanced meals, but I dont know if what I constitute as \"balanced\" would be considered \"balanced\" to someone with diabetes. Its obvious that my other children are doing fine on the same foods my daughter eats, which just confuses me even further. I dont feel confident that I know what foods are best for my daughter because she reacts unlike my other kids. I can treat her lows and I know not to add insult to injury when shes high by handing her orange juice etc, but I dont feel that I know what balances her out.It was suggested to me by a friend with a diabetic family member to make sure I incorporate some extra proteins into my daughters diet to balance any carbs she might have. I dont know if this is accurate information but I do utilize this information. As an example, instead of plain crackers, I will smear peanut butter on them. Instead of a plain banana, I will smear peanut butter on it. When having dinner, I will give her a few extra pieces of meat or some cottage cheese with her veggie and side dish. She is a VERY hearty eater but she is not overweight. Rarely though, will my daughter refuse a single morsel on her plate.As for knowing how many carbs she has had, no. I dont know the way of life for a diabetic which only adds to my apprehension and lack of confidence about what foods will benefit her most. I feel like I am doing my best, but I am flying blind. Because of my lack of knowledge about diabetic foods, I would do best with having a menu to refer to. A meal plan written and planned out ahead of time and a snack list of sorts. The scary thing about all this is that I dont know if the foods I was taught to be \"healthy\" all my life, are what my daughter needs. I am willing to do what it takes to change the household to benefit her, but I dont know what to change!Last night for dinner I made barbeque grilled chicken, garlic mashed potatoes and fresh broccoli with cheese... if that helps?I thank you sooo, soo much for taking the time to help me.",
            "post_id": "2435239",
            "timestamp": "1149829200",
            "votes": 0
        },
        {
            "answer": "RL & SGG ~Thank you both for the detailed diet information! I really need to get educated on how to measure carbs/proteins and make it so the knowledge comes as second nature and habitual, you have both eased my mind regarding my idea of \"major changes\". I thank you for that! I may *think* we eat healthy but I need to be completely sure! I need to research and look deeper so that I can tweak whatever I can to help my daughter where it comes to nutrition. I am not sure what might be happening inside my daughters body right now but I do know that I can not sit back, do nothing and wait for something more to happen to her or for diabetes to set in if thats whats taking place here. :-(  I feel I have to *do* something, prevent it, delay it, change it *somehow*! I know studies say I cant if its destined to be T1, but I have to try! Thats just who I am at heart.My husband and I were talking last night about my daughters difficult day yesterday (after he read our conversation here) and he suggested that maybe we should look into adopting a diabetic meal regimen for all of us. He feels if we do this now, we will all (mainly our daughter) adjust a lot better if and when the time comes where she does develop T1. He has a point because I am sure the transition to insulin (if we reach that point) will be a huuuuge adjustment in and of itself. If we transition our current meal habits and lifestyle any way we can right NOW, maybe our daughter as well as the rest of us, will not feel as overwhelmed later on. In the event she becomes clinically symptomatic, we wont find ourselves drowning in a new life of insulin AND meal habits all at once. I'm not sure if a diabetic meal plan is healthy for ALL of us, but it is worth looking into, getting to know it and maneuvering it to fit all of our needs. I dont think it would hurt us?I stopped by the pharmacy last night to refill my daughters ketostrips and glucometer cartridges... I consulted the pharmacist about my daughters day yesterday and although he isnt educated in the antibody aspect of T1 he was knowledgeable enough with the disease to express his concern over her readings yesterday in regards to \"pre-diabetes\". He suggested we maybe get a second opinion and run a second OGTT on my daughter. I dont know if I would find a better endo then we have now, considering we already see an endo out of the major childrens hospital here... but a second opinion might not be a bad thing, just to find out what another doctor would suggest for our daughter.SGG~ I do feel encouraged to know that you live a wonderful life! Thank you for your optimism because I need some of that for sure!I know my daughter must have it \"easy\" right now compared to someone who has or is walking the diabetic road and I hope my questions and concerns do not make anyone here feel uncomfortable. My heart goes out to each and every one of you who have this disease. I want you all to know that.I do feel fortunate that my daughter has not been diagnosed as of yet but I am twisted and very fearful that she even stands a chance at all. Her symptoms do not give me much assurance that she will avoid this disease and the more I read, the less optimistic it appears. Which is why I have sought you all out. I need to learn for my daughters sake incase my fears become reality but I also need to feel some kind of validation, some kind of familiar kinship with someone... to somehow make us feel like we *fit* somewhere. I feel as though I am standing in the middle of an ocean, I have people all around me but I cant reach any of them! Most of our friends and family do not understand what is happening to Alyse (our daughter) and we find ourselves faced with nodding heads and \"ok's\" when we try to explain... and then there is the simple \"I hope she gets better\" comments after we try to explain. Although I know they mean well, I walk away feeling a deeper void because I know in my heart that they dont understand. They dont know what to suggest or how to react. I also battle with this because I have fears when it comes to anyone babysitting my daughter, I dont feel confident that they would know what to do or see the symptoms.I just need for *someone* to understand what I am saying to them, to help me form ideas, a plan of action, relate with me or just give me some kind of support other then \"I pray she doesnt get it\". Feeling alone and uncertain does not feel very good. :-(We, as her parents, pray she doesnt get \"it\" too but we are in a whole new whirlwind right now. Although we may not be faced with the most difficult challenges that a T1 faces, what was once \"normal\" to us is no longer the case, its all new and very scary. We find ourselves feeling like we must prepare for the worst case scenario. I'm not sure if feeling this way is a healthy thing for most people but I do know that it would be much less difficult (the easy way out, perse) to prepare for the best case scenario. I choose the more difficult road now because I dont want it sneaking up on me later when I least expect it. I feel a resentment toward whats happening to my daughter but I am trying to turn the resentment into positive action for her sake.In the event my daughter indeed avoids this disease altogether down the road,  preparing for the worst now will not make me feel that I have wasted precious time and energy at all. In fact, I am certain that I will have a brand new respect and compassion for the life that diabetics live and the same goes for the road that led them there. I will have become \"aware\".Either way, no matter what happens to my daughter later... My heart will never forget the time and empathy you both have given me. My experiences are important to me and I learn from each of them. Your time and effort will not have been wasted. Huggs!",
            "post_id": "2435244",
            "timestamp": "1149915600",
            "votes": 0
        },
        {
            "answer": "Sorry, RL, for mistaking you for a mom. Good dad, good!  :o)As for getting a second opinion, you may want to do this. I agree that the high levels your daughter is experiencing are definitely diabetic-range highs. HOWEVER, your daughter's pancreas is working when she has these high levels, pushing out insulin enough to cause the lows later. So she is NOT diabetic yet... can't treat the highs because of the lows that happen on their own a few hours later. So I would agree with your doctor that medically there is not much that can be done yet. Altering the diet and trying to even out the number of carbs she eats so as to ease any stress on her pancreas is all that can be done at this point, it would seem.If she does develop diabetes, it actually gets easier at that point. Once the pancreas quits doing its sporatic dumps of insulin, carb-counting and insulin to cover carbs maintains a regulation of glucose levels that she cannot acheive right now. It does sound as if you are doing about all that can be done right now to help her.The diabetic diet is not really different from any other diet except that it is educated and fairly even in calories and carb contents for all meals. It is a lifestyle that maintains good body weight without fluctuation, and is a very healthy well-balanced type of diet. It may help to learn more.",
            "post_id": "2435245",
            "timestamp": "1150002000",
            "votes": 0
        },
        {
            "answer": "Thank you so very much SGG!All I can do is read, learn, ask questions and adjust whats needed to benefit my baby girl. In my heart of hearts, it isnt easy for me to swallow the idea that there isnt much more that I can do to swerve the disease if its meant to be. Its hard to accept the belief that I'm currently doing all things possible to nurse her symptoms in the here and now, rather then feeling certain that our actions will protect her indefinitely. Hope is a powerful emotion though, and I will hang onto it as long as possible. Coming here and having this opportunity to discuss my daughters symptoms with you all (the real life survivors) is a blessing and it has helped me to divert my denial toward a much more optimistic place. You truly are beautiful people! I hope and pray a cure if found as well as a method of prevention so that each and every one of you can be healed while others can avoid ever having to live with diabetes!I'm not sure if anyone here would know this, please forgive me if I am treading on unanswerable technical grounds again... possibly someone out there has knowledge in this area. Although we have no known family history of T1, I wonder if my own diagnosis could have played some sort of genetic part in what potentially might be happening to my daughter? I understand anticardiolipin antibodies are also considered an autoimmune process (related to the lupus family) but because I have only been positive for them intermittently, would this have anything to do with my daughters positive diabetic antibodies? Could I have passed something to her while I carried her those first 9 months?I have had past intermittent positive anticardiolipin antibodies (multiple miscarriages), intermittent low blood protein \"S\" and I was also Rx'ed as having a chromosomal abnormality called METHYLENETETRAHYDROFOLATE REDUCTASE (MTHFR). I am homozygous for the C677T mutation. From what I was told by my hematologist, all these things place me at high risk for cardiovascular problems caused by homocystinemia. I currently take low dose (81mg's) of aspirin and 2 mg's of folic acid daily. During pregnancy, folic acid is increased to 5-7mg's daily (my husband had to inject me daily). I was NOT treated with folic acid during my daughters pregnancy (condition unknown at the time) but did take low dose aspirin. Could something have gone wrong in her fetal development due to me not having been treated with folic acid? Do any of these conditions relate in any way to Type 1 autoimmune diabetes? If no one is able to answer my questions regarding all this, is there some way I can go about discovering the answers? I have mentioned all this to my daughters endo but have not received feedback in either direction.I have 4 children... a 13 year old son (his biological father passed away from Leukemia), a 6 year old son, a 4 year old daughter and a 2 year old son, the latter 3 being my current husbands children. My youngest childs pregnancy was the only one in which I was treated with daily high dose injectable folic acid. I love all of my children with an indescribable fierceness. It took a lot of sacrifice to get these little blessings into our life and I will fight to the death in an effort to ward off potential harm to them! I wont allow these cells to take my one and only baby girl down without a fight!I will come back periodically and update my daughters diagnosis as time goes on if anyone would be interested. Also, if anyone can give me some breakfast suggestions to try on my daughter considering her hypos are mostly noticed during the morning and early afternoon, I would be most grateful.",
            "post_id": "2435253",
            "timestamp": "1150693200",
            "votes": 0
        },
        {
            "answer": "Hi, Mom!  You're right, there isn't anything you can do to prevent the disease from occurring.  If there was something we as parents could do, we would be working to prevent all diabetes from ever attacking our kids.There is no known and predictable way to determine who will get diabetes.  I have history of type 1 in my family, but my daughter is the only diabetic of all 80 or so great-grandchildren on that side of the family, and there were only 2 of my cousins and my brother that are type 1 out of 50 grandkids.  I've been tested for the insulin anti-bodies, and I don't have them, but one of my children does and not the other.  Nobody really knows what causes your white blood cells to start killing your insulin producing cells, although there are plenty of theories and folk tales.  Don't be hard on yourself because your child may develop diabetes.  That was one of the hardest things for my wife to handle, she had a lot of anger about it, and we had a good talk about that not helping our daughter deal with today.  It's all \"water under the bridge\", so to speak.Yes, we'd like it if you'd continue to share your story with us, especially if you continue to have these types of great questions!",
            "post_id": "2435266",
            "timestamp": "1151038800",
            "votes": 0
        },
        {
            "answer": "RL~You have another child who has the antibodies, other then your daughter who is type 1? Just trying to understand accurately. If I understand that correctly, I can completely relate to the emotions your wife went through. I know in time I will come to terms with these emotions as your wife has, as I am resilient... but its a process we work through and it takes time.I think part of why I feel the way I do stems from my own diagnosis... the agonizing thoughts that somehow I am to blame for passing bad genes to my daughter. Who knows if it will ever be proven or not but as her mom and her maker, its a tormenting question in my mind.I have a great desire to speak with a genetic counselor and I will be bringing this up at my daughters next appt., I want to get his opinion about that!",
            "post_id": "2435272",
            "timestamp": "1151211600",
            "votes": 0
        },
        {
            "answer": "I have another child, but he has never been tested for the antibodies.  I was referring to my daughter who has diabetes and my son who doesn't.  Sorry that was confusing.  We do test his blood glucose every few months, just to ease our worry.  I hope you learn what you need from that counselor.",
            "post_id": "2435285",
            "timestamp": "1152075600",
            "votes": 0
        }
    ],
    "post_id": "2430990",
    "question": "Hi,I posted a while back.Please read my archived post for more detail!Forum:The Diabetes Forum~Topic:Hypoglycemia~Subject:Hypoglycemic or diabetic symptoms in my 4 yr old daughter?After several work ups I am back.Spells do seem to be hypo.We now have a glucometer.The lowest so far was 35,the highest being 250 but very random/sporadic at best!Her endo saw a spell 5 mins after lab work was drawn on her.She fell out first time ever.BG *determined by lab results*at the time the blood was drawn was 66.Fell lower causing spell?Move forward~May 4th-8th daughter had 4 night stay at hospital for studies to determine/rule out hypoglycemia.Results follow..5 hr OGTT,had a 35gram load.Her fasting BG was 84,10mins 142,20mins 189,30mins 190,1hr 181,1.5hr 115,2hr 129,3hr 113,4hr 66,5hr 84.(symptoms of hypo/hr 4).Oral protein tolerance test,start BG was 114,10mins 96,20mins 91,40mins 75,1hr 71,1.5hr 95,2hr 85,2.5hr 95,3hr 98.They also ran 36hr fasting study,tried to provoke a hypo spell below 50.She bottomed at 57 but fast had to be stopped at hr 26 due to ketones measuring 3.5.Its been discovered thru further bloodwork,she is positive for \"diabetic antibodies\".She has elevated levels of islet cell antibodies as well as GAD antibodies.Dont know if this includes insulin antibodies.Do not have numeric values yet.No history of type 1,endo wants follow up every 2 months for T1.Can someone explain her risk?I know its high,but how high?Can not find stats on antibody pos people NOT getting T1 at some point!Why the sporadic out of whack BG's?Opinions?I am scared but I need honesty.PLEASE HELP",
    "timestamp": "1149742800",
    "title": "Hypoglycemia and type 1 diabetic antibodies??... 5 yr old daughter... Please!!"
}