{
    "answers": [
        {
            "answer": "Often (but NOT always) psychiatric disorders ar the result of endochrine system disorders. Because they give out psychiatric credential with boxtops these days an endochine screen is not always performed. You need to flush your system of all medications for thirty days and then get a complete endochrine evaluation. Easier said than done, I'm afraid. The endochronology union won't always take patients directly, and your physician may be insulted you are doing your own doctoring. But that is what you need. This referral from medication to medication without rhyme or reason is insanity. Your psychiatric nurse needs a spanking.  During that time expose your skin to sunlight for at least an hour a day. You should be exposed to 45 minutes of sunlight every morning between 6 A.M. and 9 A.M. There are many valid medical reasons for this I don't have the energy to explain. Drink lots of water. You also need an insulin clamp procedure. If this isn't available buy a glucose meter and check your blood sugar. With rebates these meters cost almost nothing. Sugar levels often have tremendous effecfts on the state of mind.  Of course I know your psychiatric nurse, who is very conscienctious, has taken your blood sugar levels regularly. There was a time when I didn't believe in mental illness, but I have become convinced. Sometimes a small dose of valium helps without any other medication, but thanks to xealots at the FDA this fine medication is restricted and doctors are now hesitant to prescribe it. I wish you luck.",
            "post_id": "1967100",
            "timestamp": "1191954579",
            "votes": 0
        },
        {
            "answer": "sleepy, I hope you are not taking seriously caregiver's advice.  Despite all the problems that you have described, things could be much much worse!!!  you seem to have insight into your symptoms (you know when you are hallucinating or hearing voices).  That's great!  I don't know if you have ever been worse than this before, but most people with schizophrenia are very likely to go downhill when their medication is discontinued.  Please do not listen to caregiver222!!!  The most common endocrine side effect of the medication you are taking is higher prolactin level, which would not effect you unless you see symptoms  (i.e. lactating, gynecomastia).  You DO NOT need to go off your medication even if you thought you would benefit from endocrine eval.  Needless to mention that sunlight exposure and sugar variations will not cause hallucinations and hearing voices in your head :)If risperadol works for you, you should continue taking it.  It sounds like your main problem currently is falling asleep and staying asleep, and afterwards waking up on time.  If that's the case you can add something at night for sleeping.  Valium might be a bit too strong, so you might want to try something like ativan (lorazepam) first.  Take it in the evening and see if you can sleep through the night",
            "post_id": "1968348",
            "timestamp": "1191973929",
            "votes": 0
        },
        {
            "answer": "i definitely cannot be off my meds for any length of time.  i'd lose my mind.  i wouldn't be able to rest.  i understand that.  i did see an endocrinologist and it seems that i do suffer from very high levels of prolactin which have caused me to have very low levels of testosterone.  i'm not sure if risperdal works, i am sure its the least harmful of what my psychiatric nurse has been giving to me.  i dont hear voices all too often on it.  its true falling asleep and staying asleep is my biggest problem since i can no longer sleep without the assistance of medication.  i was placed on risperdal and another typical antipsychotic (or maybe atypical not sure which) which has been around for longer amounts of time so i will see how that goes.  i have been much worse btw.  i just hope that something can happen for my sleep.  i would like to sleep a solid 8 hours of good sleep not more not less and with not many negative side effects afterwards.",
            "post_id": "1971616",
            "timestamp": "1192052774",
            "votes": 0
        },
        {
            "answer": "I am not schizophrenic or experienced with any medications that you are on and God bless you for your suffering. But I just wanted to ask/let you know that I take trazodone every night and it knocks me out cold. I've been a raging insomniac for 10 years, but off and on my whole life and its the only thing that works. Do NOT take Ambien or Lunesta. I had to call an ambulance because I had terrifying hallucinations on them. You might not, but if you fight the induction stage, you might. I did, not on purpose, just eternally pissed off about my bad luck/inability to do something as natural as sleep. I feel like all my bodily functions are regulated. Thank GOD I don't have to remember to breathe.",
            "post_id": "2031652",
            "timestamp": "1193458037",
            "votes": 0
        },
        {
            "answer": "i am on \"abilify\" in the morning its very good. its important what time of day you take your meds also.",
            "post_id": "2961236",
            "timestamp": "1211922237",
            "votes": 0
        },
        {
            "answer": "As for what you are experiencing with trouble sleeping it sounds like the motor restlessness due to akathesia which can be helped with a side effect pill rather than straight insomnia. But make sure to be monitored for tardive dyskinesia because although its often said it doesn't happen at night that's how it emerged in my case. I'd suggest that your doctor do a sleep study if needed and see what is going on overnight and if its simple akathesia a side effect pill will do but if on the off chance (which can emerge at any time, the antipsychotics can mask it, diabetes is a risk as well) it is tardive then they would switch you to Clozaril. I agree with the other poster that Abilify is better in regards that its activating rather than sedating so it can be taken in the morning. However, that one kept me up at night but its the best option available now. Of course all this should be done with the follow up of a psychiatrist. And as I put on many of my posts there are new medications in development that are safer and more effective. I'm on glycine in Phase II study, a glutamate antagonist. This class of medications cannot cause extra pyramidal side effects, weight gain, tardive dyskinesia (such as I have in severe form) or diabetes. I am advocating within the psychiatric community for them to be out sooner and everyone who takes antipsychotics will be on a newer, safer, easier to tolerate and more effective medication.",
            "post_id": "3297227",
            "timestamp": "1219121290",
            "votes": 0
        },
        {
            "answer": "Hi thereMy Dad has Schizophrenia 35 years, if you find a good forum please let me know!!  He has been on disability and my mother is his carer.  He has not been doing so well lately. Obviously a person with schizophrenia  cannot come off medication.I wish you well and I hope that you can find a good medication balance that will help you.There is also a section for mental health under the \"ask the expert' forum.Also new medications are coming along all the time.Besttherese",
            "post_id": "3297595",
            "timestamp": "1219137707",
            "votes": 0
        },
        {
            "answer": "Yes thanks for your commentary. Its just most of the medications out in the next few years (including one potential this year) are clinically similar to Abilify so they have the same effects of akathesia and long term effects of tardive dykinesia and diabetes (less of a risk than others but still on the warning label, someone I knew got it). There are several totally new classes of medication but the glutamate antagonists such as glycine which I'm on don't cause any of these effects, work in a completely different manner and the difference is night and day. One of them will hit Phase 3 next year so that's still 5 years off probably but when they come out people will have a far more safe and effective recovery. In the meantime its a matter of coping with the side effects of what is out there but if interested anyone can contact me as regards my advocacy to push to get these medications through study. People will be on them eventually so better sooner than later.",
            "post_id": "3297853",
            "timestamp": "1219146150",
            "votes": 0
        },
        {
            "answer": "Valium is used for anxiety. It does not have an antipsychotic effect. I'm on Klonopin for the spams of tardive dyskinisia but its clinically similar to Valium and there are many medications (benzodizepenes) in that class. They are prescribed as controlled substances because they can be potentially addictive and have a potential for abuse but if used correctly are safe and effective. Anyone taking an antipsychotic should get a yearly blood work up, especially for diabetes and monitor constantly for weight gain.",
            "post_id": "3297869",
            "timestamp": "1219146632",
            "votes": 0
        },
        {
            "answer": "What about caffine?  You didn't mention how much you take in a day.  Caffine works against your medication.  Your problem with sleep could be due to too much caffine too close to when you want to sleep.  It seems to be a common problem for \"normal\" people to feel energized in the morning and then NEED a cup of coffee to start their day.  What about trying something simple that you don't need a medical order for: only drink non-caffinated beverages after one or two PM in the afternoon?  See if that works for you.",
            "post_id": "3363437",
            "timestamp": "1220548942",
            "votes": 0
        },
        {
            "answer": "I have schizoeffective disorder and hear voices etc.I am on Prozac and Lamitctal, and I must say they work BEAUTIFULLY. I couldn't handle Geodon. It gave me terrible headaches and made me feel like a slug. Good luck.",
            "post_id": "3376155",
            "timestamp": "1220832783",
            "votes": 0
        },
        {
            "answer": "That's unusual because neither Prozac or Lamictal have an anti-psychotic properties. Prozac is of course an anti-depressent and Lamictal a mood stabilizer. Well all I can say is everyone needs to stay in treatment but it points out to me the future research needed and advocacy as well to have the new antipsychotics come out. Since I've been on the glycine, in Phase II FDA study, I don't hear voices, that is have auditory hallucinations and have made a full recovery and I don't have any of the severe side effects people are describing but did have them from all the antipsychotics that are currently available. Its important for everyone on an anti-psychotic to work with their psychiatrist to monitor for tardive dyskinesia and diabetes until the newer antipsychotics come out as they are very real risks and keep up to date with new antipsychotics in development. Here's a good link that updates itself:http://www.psychmeds123.info/",
            "post_id": "3490861",
            "timestamp": "1223180009",
            "votes": 0
        },
        {
            "answer": "endocrine problems as cause of mental illness?  Ok thats a good one however I have actually had a complete endocrine evaluation for another illness reason and can tell you that it has nothing what so ever to do with Schizophrenia or any other mental illness - yes there are some causal links between mental illness and endocrine disorders but its very hard to know what comes first in most cases as many of the medications used in treatments can affect the thyroid.Oh and its spelt ENDOCRINE and the branch of medicine is Endocrinology - theres no H in there and sorry but I tend not to take medical advice from people who cannot even spell the word right.Telling a schizophrenic, indeed ANY mentally ill person to go off their meds for 30 days is advice which I would call extermely ill advised in the least and I am not sure what that would prove anyway.  If you can find me ONE actual scientific study carried out in proper scientific protocols which shows a conclusive linke between disorders of the endocrine system and mental illness i would love to see it .Id also love to know why he needs an insulin clamp procedure? Im BP Type 2 and my blood sugar is fine as I do not have diabetes and if does not have diabetes he does not need one either - again you seem to be trying to link Diabetes and mental illness together - or is this another example of an excuse because you didnt believe in mental illness....  I see this in some people, they cant actually have a mental illness it must be some other illness which is causing it.I was part of a medical study group for Diabetic weight control for the past 18 months through the university of queensland in Brisbane -  my wife and I were in the non diabetic control group and I have had both procedures you talk about here along with a large number of others, I have had 4 insulin clamp tests performed during that period and a complete endocrine analysis - I had 2 endocrinologists during this study and I am bipolar type 2 - at no time did they every discuss any causative factors nor did they comment that diabetes was a factor in mental illness.Oh if you are suggesting he needs a test for Diabetes the clamp test is not likely to be the one he will get, its considered invasive and expensive and in most case a GTT test is fine for diagnosis in 99% of cases.Please do not take this advice - the bit about water and sunlight are both good pieces of advices as sunlight does help and fresh air does not hurt anyone and good hydration is key with many drugs used for mental illness treatment - the rest is not based on anything scientific are best and dangerous at worst.A pdoc is the only person who can answer these qustions ultimately and thats who you need. Always beware of people who advise you to go off meds, act as your own doctor (although being informed and understanding your illness is another thing - you need that) As the advice is rarely good.",
            "post_id": "3491030",
            "timestamp": "1223185724",
            "votes": 0
        },
        {
            "answer": "On valium - the reason its not prescribed as often as it used to be has nothing to do with the FDA and everything to do with the fact that diazepam was one of the most over prescribed drugs in history and as a consequence has become a drug of abuse - the same way Oxycodone has become a drug of abuse as has rohypnol and ritalin to name just a few of the many drugs doctors handed out like candy and as a result they are now problems world wide not to mention Valium has a serious though often exaggerated addiction risk profile - there are many anti anxiety drugs which work as well and are not as addictive though valium is safer than most and has less side effects.If you have a legitimate need valium is not hard to get at all though normally you need to be known by the doctor before they will prescribe it.The FDA has nothing to do with valium being less used except for the fact that they dont like seeing prescription drugs misused or being sold on the street which valium is even today.",
            "post_id": "3491054",
            "timestamp": "1223187872",
            "votes": 0
        },
        {
            "answer": "Firstly Monkeyc so do i, im always a little suspitious of the people i work with who cannot even spell psychology lol but this person may be sincere (see what i mean) and cannot spell for other reasons like dyslexia.http://www.medhelp.org/forums/show/295This is the schizophrenia forum i do much reading on it myself. Your right its very hard to find it when you click on the list of medhelp forums its not there. You can always find it at the side when in the bipolar community =)",
            "post_id": "3491207",
            "timestamp": "1223199021",
            "votes": 0
        },
        {
            "answer": "True the spelling thing might have been me having a horrible day, I apologise for that one.  I must admit I formed my opinion on the not believing in mental illness bit which always gets my radar going - Im sort of struggling to comprehend what there is about mental illness that makes it somehow not real - I struggle with it every day of my life as do many people and we do not have to believe in it as its real for us.My major point which may have been lost is that there are some key things that we as people with mental illness need to be aware of when we live in the big wide world.1. If someone promises to cure you they cant - there is no proven cure for most if not all mental illneses - there are treatments.2. I have read just about everything on drug free and natural treatments and most of them are at best unproven and at worst dangerous.3. Anyone whose solution involves you going off your medication is not someone you need to be listening to - Yes the drugs suck, haldol and many other drugs have unpleasant side effects but the doctor put you on them for a reason and while all doctors are not created equal they do have more of an education than random person on the internet.4. Beware the person with theories on what causes your illness - theories are something everyone has but if they are not backed up by literature then is it a real theory or just a guess.5. Always consider who the informant is - this is the internet and no one can be verified - I dont claim to be an expert on BP because Im not, I just happen to be BP and can offer advice based on my experience.In this and all cases my first advice is see your doctors.  They are the first place you go to ask questions, if you are not getting the answer see another doctor and if you need help fast go to hospital.Oh and endocrinology union also isnt something that makes sense - its not something that even appears to exist.  If you need to see and endocrinologist you ask your doc for a referral - they will take patients anytime with that and just about any doctor will give one if you need it - but if you're not diabetic or have a disease that fits they won't refer you as its a waste of time.  There has been some research done in the area of the effect of Schizophrenia on the endocrine system which I have spent my afternoon reading (quite interesting) but nothing to say that there's a causal link.Im sorry if i was a bit insulting but I find that people who do not know about mental illness think they can be well meaning and make suggestions without realising that people looking for help might take it seriously - and its common for patients to change drugs - this patient has taken only 4 drugs as they have tried to find the right one that works for him, we have people on here who have been through 10 .",
            "post_id": "3491261",
            "timestamp": "1223202075",
            "votes": 0
        },
        {
            "answer": "I gotta jump in here. As a thyroidless bipolar I can tell you that the endocrine  afffects everything in your body and head.Especially the thyroid.You can google thyroid and bi polar and see lots of information on how hypothyroid and hyperthyroid will be just like bi polar with manic and depressed episodes.My personal experience wiht hypo is the worst depression I ever been through.  It was very hard to come back from it and it took about 2 months of being back on my throid med to feel good again.Just this last month after my weight loss of 20 pounds my throid med was too much and I was hyper and let me tell you it feels just like a bi polar manic.In my humble opinion the thyroid should should be one of the first things tested before any mental health diagnosis is made. TSH should be in the .3 to 3.4 range. A lot of docs including endocrinologists dont know this new standard. I myself am at .1 for cancer suppresion and it is where I feel my best at. I have to watch it though and keep my med tweaked just right.I have been schizophrenic and paranoid in my worst bi polar episodes.  I do quite well on the zyprexa, celexa and the levothyroixine. I was probaly having thyroid problems for years but it never got checked.Just my 2 centsBlessed BeVenora",
            "post_id": "3491474",
            "timestamp": "1223211176",
            "votes": 0
        },
        {
            "answer": "This is what happens when you post while you are sick.  I did not make clear what I meant - I do not deny that thyroid problems can increase symptoms or make them worse, they can and there is a linkage between thyroid function and some mental illness and yes hyperthyroid has symptoms like BP.Thats not at issue and if you are on the meds listed you should be having your TSH checked, If you are on Lithium this is done as part of your levels.What I had and have a problem with was this - \"Often (but NOT always) psychiatric disorders ar the result of endochrine system disorders. \" - I disagree in every possible way - if you want to say that hyperthyroidism may be mistaken for some mental illnesses then I will agree if you want to say it may make them worse I will also agree but a statement like that is dead wrong IMO and i stand by it, most definetly when coupled with a statement of past non belief in Mental Illness (you do not need to believe in illness - it exists).This person came here for advice on their drug therapy and the first thing they got was some badly informed bad advice, they asked for help and got little from the first poster other than advice which could be dangerous. That is what worried me.",
            "post_id": "3492697",
            "timestamp": "1223238611",
            "votes": 0
        },
        {
            "answer": "Let me clear this up for you. The first thing any psychiatric facility should be doing is screening for endocrine disorders. Once you rule out endocrine disorder, then a psychiatric diagnosis can be made. I have personal experience and research experience to back this up. I spent a full week in the psychiatric ward.  I was diagnosed with schizophrenia. Voices - delusions, panic attacks- the full Monte. Luckily, my parents called in a psychiatrist who was aware I had thyroid disease. It took me a good year before my brain returned to normal (Geodon really wasn't helping).  Long story short, I was not schizophrenic but rather experiencing a 'thyroid storm' (hyperthyroidism). I have been off the Geodon and no further 'episodes' for four years now.To the original poster: I have personally experienced schizophrenia and bipolar symptoms, and  I can't express how terrible it is in words. I wish you the best and will be praying for you.",
            "post_id": "8138579",
            "timestamp": "1342235179",
            "votes": 0
        },
        {
            "answer": "yes we have the same problem in the uk i have tried all sorts of anti D's but the bets option for me is small doses of valium taken as and when i need it on a pro re nata basis",
            "post_id": "9682276",
            "timestamp": "1385069359",
            "votes": 0
        }
    ],
    "post_id": "1964968",
    "question": "i am not bipolar however i could not find another place to post this question so i am posting it here.  i was diagnosed with schizophrenia many years ago due to hearing voices.  i have been on haldol which was crippling, got off it, then onto risperdal, geodon, and seroquel.  the most tolerable is risperdal however i tend to need something to help me get to sleep very badly.  i dont fall asleep easily.  thats when my psychiatric nurse moved me on to geodon then seroquel along with risperal.  both of these i find not very tolerable at all.  with seroquel i will sleep very sound though i might suffer some bad hallucinations getting there.  and i will oversleep with it.  with geodon i will sleep ok, get to sleep easy enough, though when i wake up i dont want to get out of bed.  if i do i simply retreat to my bed and just lay there sort of hoping i could sleep or rest but just lay down for many hours and when i do finally get out of bed when i move around i will put on these horrible faces due to me not being able to tolerate it.  risperdal would be ok if i could sleep.  the voices are pretty much not an issue.  i was hoping if someone could suggest a medicaid medication that might work given what i have said that i can suggest to my psychiatric nurse.i would appreciate it very much since i feel my psychiatric nurse has run out of options.  i dont know what she will put me on next.thank you very much",
    "timestamp": "1191894903",
    "title": "i have schizophrenia.  risperdal, geodon, and seroquel dont work.  have difficulty sleeping.  on medicaid"
}