{
    "answers": [
        {
            "answer": "Dear Medical Student, if I wasn't on the other side of the world I would give you a hug.  It is perfectly normal to be scared and mad -- we all were. My 13 year old son has had Type 1 since he was three and is one of the happiest and healthiest kids I know now.  It is not a death sentence -- trust me.But it does take work to stay healthy and it takes time to figure it all out.  Be sure to check your blood sugar, take your insulin, eat healthy and don't stress out.  Complications are obviously possible but happen more with Type 2 diabetes.  Your life will not be the same but you can still live a happy healthy rewarding full life as long as you do what the doctor tells you.  Since you are a medical student you probably know about all the advances lately -- there are insulin pumps, glucose sensors, great meters, and new insulins.  There is also stem cell and islet cell research being done. Keep thinking that I am going to do my best to stay healthy until there is a cure and not that I am going to be blind some day.  Think positive.  We are in this together.Carol",
            "post_id": "2429314",
            "timestamp": "1079071200",
            "votes": 0
        },
        {
            "answer": "I have been a type 1 diabetic for 34 years, and I was diagnosed long before the newest medicines and even before home glucose monitoring was possible. I have two grown and healthy children (I had the children as a diabetic on insulin), a loving husband, and a wonderful life with NO complications 34 years later. You are not necessarily doomed to the complications that  you read about. As a diabetic, I have to take the shots and monitor my diet, but I frankly find myself healthier in my middle years (46 now) than many of my peers. Please step back, take a breath, and realize that perhaps God has allowed this to enter your life so you can help other diabetics. You truly would never know what it was like to live with the disease if you had not been unfortunate enough to be diagnosed wtih it. In time, you will figure out what the proper dose is for good control and it is very possible with the newest treatments to keep healthy glucose levels without overdosing. You will feel energetic and will be able to better cope with emotional upheaval once you get the glucose levels up to above 70 to stay. Keep watching this web site, for I know that there are many other long-timers who will tell you the same thing: you can live a long and healthy life as a diabetic. Your education will help you do this. Then, use that knowledge to help others.",
            "post_id": "2433308",
            "timestamp": "1079071200",
            "votes": 0
        },
        {
            "answer": "I am sure that all of us who have read your comments, reach out to you right now.  You have put into words, the very gut-wrenching emotions, that all of us have felt upon the diagnosis of type 1 diabetes.  I too, can attest that things will get better.  Your whole outlook will change when you realize that you are in control of your diabetes, and that you won't let diabetes control you.  As a christian, you know that God doesn't give us more than we can handle.  And for the reason as to why he chose you, you may never know.  I'm hoping that because of your medical background, you are just the right person to make a difference for the rest of us out here.  My 16 year old daughter, who was diagnosed at the age of 21 months, is looking forward to a career in the medical field, such as yourself.  She feels that because she has diabetes, she is even more healthy than her friends that don't have diabetes.  When she was first diagnosed, we felt as if our lives would never get back to normal, and it wasn't until we came to the realization that the \"old normal\" wasn't coming back, that we were able to go forward with a \"new normal\" life.  It's all how you look at it and right now, you probably don't want to look at it at all, but that will change as you adjust to your \"new normal\" life.  It can be a healthier life if you choose.  You can do this, and because of your medical background, you can probably do it better than us!Please post again and let us know how you're doing.  I will be praying for you.",
            "post_id": "2433310",
            "timestamp": "1079157600",
            "votes": 0
        },
        {
            "answer": "Thanks for your replies. You are all very nice people who can really comfort each other. It's very difficult to find peer support in Hong Kong as there are so few type 1 patients. I think there won't be more than 1000 type 1 out of the 6 million population.While I'm complaining why I'm so unfortunate, I should think that I'm already better than most of the patients with the same disease as I have a relatively late onset (I'm 22 now) I'm also cared by almost the best endocrinologists in Hong Kong who are working in a teaching hospital. But I would say that being a type 1 patient in the US should be easier as the endocrinologists have more experience.I guess all of you have your medical expenses covered by insurance companies? In Hong Kong people seldom buy medical insurance as most of the services are provided by the public system, but this is going to change and the patients will eventually need to pay for the services themselves. I don't know what will happen to me in the future, as I didn't buy any insurance, but there are too many things to worry anyway.I always think that it's harder for me to accept the diagnosis than lay people as I know too much about the complications. Take retinopathy as an example, a lay person will only get concerned if the vision is affected, but the doctor (or I myself) will get concerned if there're early sings of retinopathy (like background, non-proliferative etc. if it involves the macula it's called maculopathy). And the figures tell me that 100% of type 1 patients will get retinopathy within 20 years after diagnosis of DM (but doesn't count the years before puberty), sometimes retinopathy can be quite independent of glucose control, there are still people who have been controlling well but still have severe retinopathy. Doctors won't tell lay people about these, as this is too discouraging. Being a patient and a patient only has the advantage that you can only hear what you need to hear and what is encouraging, but I'm different, I need to hear facts for the doctors as well (which are not for patients as they are too bad for that)",
            "post_id": "2433313",
            "timestamp": "1079244000",
            "votes": 0
        },
        {
            "answer": "The figures I have read here in the United States are that 80% if diabetics suffer some retinopathy after 15 years, not 100%. I posted an earlier comment, telling you that I have had diabetes for 34 years and have NO retinopathy at all. You are absolutely correct in your observations that some folks take perfect control of the glucose numbers and still have this problem occur, but some of us don't. I would encourage you to use your knowledge, which is far beyond the knoweldge of the average type 1 diabetic, to do whatever you can to protect yourself and keep those glucose numbers even-keeled. I am living proof that the 100% number is incorrect. In my volunteering wtih the Juvenile Diabetes Research Foundation, I do hear from other long-time diabetics like myself who have no damages. Take heart. Your knowledge can be a help to you if you focus your thoughts on how to manage the disease rather than on fears of the unknown future. Just take the one day at a time and make that day a good one, and God will take care of your future.",
            "post_id": "2433315",
            "timestamp": "1079244000",
            "votes": 0
        },
        {
            "answer": "Dear Med Student,Perhaps it's because of the lack of exposure to type 1 diabetic patients, that you haven't seen the odds beaten time and time again.  Yes, we are not medical professionals, but we have heard hundreds of personal stories from people who have lived with diabetes and not experienced the side effects that you are so afraid of.  Yes, it is a very frightening disease to have, but once you get your blood sugars within a normal range, you may see things more clearly and realize that you too can avoid them with good blood glucose control.  If you are running low all the time, you might not be thinking clearly.  Being a medical professional, you know all you need to know about the best way to prevent the side effects of this disease. Take this knowledge and use it to take the very best care of yourself that you can. Don't be frozen in your fear, take your knowledge and do something positive with it, for yourself and others.At first, it's so very difficult to accept diabetes into your life, but in time, you will feel differently.  You need to face the emotional side of diabetes.  It may be more difficult in your culture than in ours to do this, so please, come back to our site to let us know how you are doing and feel free to ask any question or comment you may have.  We are here for you!God Bless You!",
            "post_id": "2433314",
            "timestamp": "1079244000",
            "votes": 0
        },
        {
            "answer": "Diabetes is a horrible life long condition - no doubt about that.  And it complicates life, makes you change your life. Nobody wants this - but 1 in 16 people have it.  Unfortunately - there's not much you can do to reverse it.  You already know all of this.But - you read too much into it as well.  The complications you speak of, normally are associated with people who don't take care of themselves or are too lazy to take care of themselves - pure and simple.  And many of those people are Type 2s.I gave up blaming God a long time ago - if there is one.  Neither God nor Allah have anything to do with this.  And if they are there - it looks like they are not too interested in lending a hand because there are so many of us and our numbers only grow with each passing year.I would highly suggest you get an Insulin Pump as quickly as possible.  There are people who will tell you to wait until your honeymoon period is over - forget them.  At least with a pump, it may be possible to give your Pancreas a break and not burn out the remaining insulin producing cells you still have.  It'll mean lower basal doses of insulin and give you more freedom that you'll never get with just needle injections.However - the pump has its own set of issues the pump makers don't advertise because people wouldn't want to use the pumps then.  But - it does make life easier somewhat.  And injecting an infusion set once every 3 days sure beats having to stick yourself with a needle before every meal or hoping someone doesn't bump your chair while you inject yourself.I wouldn't hold my breath for beta cell transplants or pancreas transplants.  Those are still years away from being any sort of real solution.My health insurance only covers a fraction of my Diabetic pump and testing supplies and only a tiny amount of the total price of the pump.  Heck - they just took LifeScan's blood testing monitors entirely off their preferred list and forced everyone to Accuchek - a cheaper, less quality monitor.  My insurance wanted to get rid of Humalog off their list too and it was only recently they even considered Lantus.I will not beat around the bush - I hate the life Diabetes has forced me to adapt to.  It's painful.  It's taken the fun out of most things - especially eating out.  And it gets in the way of just about everything.  When the end of my life comes, I probably will not fight for that last breath.Not to take any hope away from you - Diabetes doesn't necessarily mean you stop living as soon as you are diagnosed.  It's just another thing you have to deal with in life.  It doesn't go away so you deal with it, do what you have to keep it from ruining anything else, and move on.  You don't have any other choice.  Just accept that it has happened to you, make the changes to your life that you have to, and keep going.  You have a whole life - this is only one small part.",
            "post_id": "2433317",
            "timestamp": "1079330400",
            "votes": 0
        },
        {
            "answer": "For the complication rates, I think it's different in different countries and different time. If you have follow-up in a teaching hospital with an advanced research center, it's definitely different if you have that in a remote hospital. I think the complication rate is lower in the US, as I've said there are more experts. But anyway, I don't think the figures are very important as these are highly unpredictable and it really depends on individual cases. It's probably not correct to say that complications only occur with people with poor control, because duration of diabetes is also a major risk factor, and there's also the genetic susceptibiliy. The only thing you can do is to have good control, you can't do much about other risk factors. I admit that I may be exaggerating about the complications, as I'm in a tertiary referral center and all the cases I've seen are those difficult cases and with lots of complications. galzee is quite correct to point out that I'm not thinking in a very sensible way, scared by the knowledge but not using it properly.for JDRF team SGG, your example is quite encouraging, I do feel better after having your reasurance.There are a few other questions I want to ask:1. TonyAlmeida told me about the insulin pump. Actually I want to know more. Does the pump cause you any local discomfort at the infusion site? I don't really like the idea of having something inserted all the time. I have frequent turning when I sleep, does it going to affect my sleep then?2. Do you have difficulty bringing your insulin pen or lancets when you need to get a plane? Do they stop you from doing so because they think these items are dangerous?3. Do you think having diabetes affect your chance of getting a boyfriend/girlfriend? For females, are you worried about the risk of getting pregnant?",
            "post_id": "2433323",
            "timestamp": "1079503200",
            "votes": 0
        },
        {
            "answer": "Dear Medical Student, I am back to add more thoughts. I am the long-time diabetic who keeps surfacing to try to encourage you. I have had two children, both healthy pregnancies with full-term babies and no damages to me from being pregnant. Now, this was over twenty years ago when medical care was not as good as it is now. If I could do it then, you can do it now with the newer medical knowledge and care available. I actually have asked my husband if the fact that I was diabetic when we met ever scared him. I suppose ignorance was bliss, for he said it never occurred to him that it may cause problems later on. It hasn't, and for that I am glad. I have been a USTA (United States Tennis Association) rated tennis player and spent two years as a white water raft guide starting the year of my 40th birthday. A fully normal life is possible for you. Although genetics do play a role in complications or lack of complications, tight blood sugar control will keep the glucose highs a rarity, and complications are much less likely to happen if sugar levels never stay high for hours on end. A pump may be a good solution, or a combination of Lantus and a quick-acting insulin. I find that this works well for me and keeps my sugars very well-controlled. I do a lot of finger pricks and do what is necessary to lower or raise glucose levels when I need to. As you develop habits, it will become easier. I honestly don't see it as a big deal, for it has become routine. And life is so full of wonderful things that this becomes a minor part of my life, more of a habit than a focus.",
            "post_id": "2433324",
            "timestamp": "1079503200",
            "votes": 0
        },
        {
            "answer": "You had a question about the insulin pump -- my son has worn a pump for almost four years and it has changed our lives for the better.  He has commented that he is a normal boy again.  Check out the websites of the pump companies:  www.minimed.com, www.animascorp.com and www.delteccozmo.com.  I know it takes getting used to because you are connected to something all the time, but weigh that against better control, more freedom, and no shots.",
            "post_id": "2433327",
            "timestamp": "1079676000",
            "votes": 0
        },
        {
            "answer": "It depends were you place the infusion sets and which ones you use.  My experience are with MedTronic QuickSets and I use my stomach since it has the best absorbtion for insulin.  After initially using the infuser needle to poke the cannula through the skin (I won't lie .... sometimes it's a \"sting\", sometimes you feel nothing, all depends how close to a nerve you get) - most of the time you don't notice it unless you pull on the line or lay on it.The infusion sets will leave ***** marks when you pull them out to rotate the sites - sometimes they heal fast, sometimes they take awhile because afterall - you are puncturing your skin.  I have found that the healing time speeds up dramatically when you include 1 multi-purpose vitamin and 1 B-6 50mg vitamin in your breakfast routine.",
            "post_id": "2433343",
            "timestamp": "1080108000",
            "votes": 0
        },
        {
            "answer": "I am 60 years old and newly dianosed with type 1 I am scared and feel I cant live my life due to how scared I am. I am afraid I will go blind, lose a limb etcPlease my family doesnt understand",
            "post_id": "3051807",
            "timestamp": "1213766147",
            "votes": 0
        },
        {
            "answer": "Hi there -When my son was diagnosed 2 years ago at 13 we also thought it was the end of the world. What I realized was that worrying got me nowhere. All through his childhood I worried and kept him safe from all sorts of childhood hazards. And then who would have thought the worst one to get by me would be in his own body? My point is that what I worried about happening didn't, and what I didn't even consider happening did. So we really have no full control over our destiny.Just try to handle your diabetes TODAY because honestly, none of us know if we have a tomorrow. Do what you can do today, do the same tomorrow, and on and on. Persistent worrying won't change anything and truly, I have found that acceptance of the disease has really made a world of difference with my son. It's just part of his ife. Sure it ***** sometimes but it IS his life and he hasn't let diabetes get in the way of living the teenage life.Your best bet is to become knowlegable about the disease, test your sugar #'s regularly and try your best to keep the #'s in a good range. After that, LIVE YOUR LIFE & ENJOY TODAY!!!!",
            "post_id": "3054869",
            "timestamp": "1213826128",
            "votes": 0
        },
        {
            "answer": "Hi There,  I have had DM for 26 years and struggled and have many stories you would just hate to hear!!!  However despite all my moaning and complaining about my diabetes i kept myself healthy and well.This is the story I want to tell you about...A couple of years ago, after being just fed up with being a diabetic, i came across kinesiology.  So I went and saw a kinesiologist and after treatment, once only...  I got over myself and my hang ups about having diabetes.  I was always miserable and thought i had really got the rough end of the stick, and depressed to say the least that I couldn't NOT look after myself, like all my family and friends who ate what they wanted and drank what they wanted!!!Anyway if you have the opportunity to see a kinesiologist, it may also help you.Please let me know if you have any questions, I'm more than happy to help if I can.And like the last LULU383 said live your life and enjoy, don;t let diabetes get in your way, it's a real opportunity to look after yourself, your health and your lifestyle and your mind.",
            "post_id": "3065560",
            "timestamp": "1214041667",
            "votes": 0
        },
        {
            "answer": "I am newly diagnosed with type 1 and I am 60 years old.I am scared to death of this diabetes. I cant seem to get the diet. Is it just eating less or is there special foods I need. I am also a smoker and I do know its very bad for me, However I am having a lot of trouble quitting. I am pretty intelligent so I dont know why I cant stop smoking. Its making me crazy. I do have a lot of stress in my life and I feel the smoking helps take the edge off. When I was admitted to the hospital with numbers of 1050 you would think this was my way out of quitting.I have gone to places to help you quit and also tried the patch and medication.I know I am cutting my life short.Help me please",
            "post_id": "3766921",
            "timestamp": "1229143060",
            "votes": 0
        },
        {
            "answer": "It really depends on what insulin regimen you are on. Having type one in no way means that you have to eat less, or change your diet completely. If you're newly diagnosed, it's good to stick to your regular doses everyday, but eventually as you become really educated and knowledgable about the disease, and are keeping you blood sugar levels pretty decent, you'll be able to fine tune your insulin when you feel like eating a lot more for dinner, or having that extra piece of cake :)I hope your win your battle of being smoke free. I know with this huge life change its overwhelming times a thousand, but keep posting, and start your own threads. It really does help, it helped me so much.",
            "post_id": "3780011",
            "timestamp": "1229504929",
            "votes": 0
        },
        {
            "answer": "I am a type 1 diabetic x40 years ( I am fisty now).  When I became diabetic we did not have disposable syringes or glucometers and prognosis was not good. However, I did have two wonderful children who are not diabetic and have survived longer than was expected.  One of my pregnancies was difficult and not for lack of sugar control. For all of those individuals who have not made it (and I have known some who have not), some of us have proven the statistics wrong.  Granted, it is a small number in comparison. I am not going to minimize what you are feeling or saying since you are, or will be, a doctor.  I began to have complications ten years ago in the form of polyneuropathies and currently, connective tissue disorders. The kidneys are kept in check with a pill. Like you, I agree that controlling sugars is only one reason why you begin to have complications and we are not all built the same.  All you can do is live your life the best way that you can given your circumstances and ability to have the best resources available to you in your country.  Live one day at a time...today is a good day.I don't have the pump and I chose not to because I did not want to be \"hooked\" day an night and, besides, my insurance only partially covers the accesories...it is an expensive undertaking.  But, you may choose to inject several times per day which is not bad either.  In terms of travel, I haven't had a problem with it.  You may want to have a doctor's note with you indicating your need for syringes, medication, etc..In terms of relationships,  I guess it depends on the culture and the individuals.  However, nobody can guarantee you that they will not have health issues during the course of their lives.  You see, it is not that God/Allah/Buddha or the Higher Power gives this to you or that you caused it, but, rather, it is part of life.  You are a scientist, you know this.  From where I sit, you are blessed as you have access to doctors in your country and internationally thanks to technology.  You can make informed choices about your care and, perhaps become an agent of change in regards to these issues.  Don't fret about complications that you may not or do not have yet.  If, eventually, something develops, then deal with it at that time.Hope this helps.Marie",
            "post_id": "3809253",
            "timestamp": "1230360377",
            "votes": 0
        },
        {
            "answer": "do not worry darling ....some people say that diabetes is a healthy disease because we can control it ...you can protect yourself from the complication by good mangement , keep your blood sugar within the normal range , eat healthy food , take your insulin and do sport ...I am third year medical student and I had diabetes since 2000 when I was 12 years oldat that time I was very sad and I did not know much about diabetes ...the doctor said to me diabetes will be your new friend and will stay with you forever , so you should adapt with it ....from that time until now I live like normal person ... and I thank God  because I have diabetes not other dangerous and fetal disease like cancer or malignat tumer ...I know you need time to adapt with this new sitiuation but try your best ...",
            "post_id": "3810937",
            "timestamp": "1230425028",
            "votes": 0
        }
    ],
    "post_id": "2429313",
    "question": "I'm a 4th year medical student in Hong Kong. I experienced ther classical symptoms of diabetes 6 months ago and raised the suspicion of DM, then it was confirmed. I have been so upset with the diagnosis, crying all day long for the first few days. I still can't help crying for long when I'm alone at this moment. My life has been so smooth, I had good academic result, got a boyfriend who is working as a doctor, it has been perfect...but suddenly it seems that my dreams are destroye with the sudden diagnosis. I know too much about diabetes and its complications, that made things even worse. I just searched and searched the journals about type 1 diabetes and got scared by the poor prognosis. I'm a christian and I just can't understand why god gave me such a disease, I blamed god for that. Type 1 DM is very rare in Chinese, the incidence is around 0.14/100000 per year. Why am I so unfortunate? As i'm too worried about the complications, I just keep injecting too much insulin, often had blood glucose level at around 32 mmol/l. My endocrinologist keeps reminding me that I'm going to die from this if I go on like this. But I just can't imagine the days with blindness, with amputation, with stroke resulting in hemiplegia, with end-stage renal failure requiring dialysis. I'm seeing this kind of pateints (usually with type 2 in Hong Kong) with all sorts of complications everyday, whenever I study everything is related to diabetes... I always think that I'd rather die from hypoglycaemia than leading a life like this......",
    "timestamp": "1079071200",
    "title": "I have newly diagnosed type 1 DM and I'm depressed"
}