{
    "answers": [
        {
            "answer": "Dear, mr_pat3,I'm am so sorry you are having such a difficult time with your diabetes.  Please know that there are many people in the same situation and don't be at all embarrassed to discuss this.  I truly admire your courage to reach out. That's what we are here for.As a mother of a 27 year old son, who was diagnosed at 8, he has had the exact same control issues that you are going through. Your statement \"I am going to change today\" is a very sincere hope on your part I'm sure.From your comments you seem very much aware what good control means to your body and have probably been told from your physician what you need to do.  Just because people have the information, it dosn't always translate into taking care of yourself. My son is is doing more to help himself but it has taken awhile and he's still not completely there.I wish I had a definitive answer. We all know how critical blood testing is to good control. A regular schedule is also important, eating right, etc.  Enough of the lectures.From your topic sign in as a teen, I would love to know your age. I'm not a doctor and can only give you a Mom's experience.  What we did with our son was to get him to a councelor who specialized in diabetes and depression.  This helped him very much. While I have no idea (and you gave me no reason to believe this is the case)if this is an issue for you, you might want to consider, this could be an option.Support from others going through any issues with type 1 diabetes is very important.  I would suggest checking the home page at JDRF to post and receive more information. The link I would recommend, depending how old your are is www.jdrf.org/kids. I know there are many teens involved.Now to the pump issue, I don't have personal experience with this, however, I've asked other volunteers who do to post a comment.  Please check back in for more information.I can't tell you enough how proud I am for you to reach out.  Thank you so much. Anytime you have a question, please feel free to ask.Best of luck,Debbie",
            "post_id": "2429176",
            "timestamp": "1070344800",
            "votes": 0
        },
        {
            "answer": "Mr pat3-My daughter has diabetes and is on the pump so I can tell you what I have found out that works.  I am glad that you wrote to the forum, I do not mean to sound like a mom and preaching, but \" START CHECKING YOUR BLOOD AND BOLUSING!\"  The only person that you are hurting by not taking care of your diabetes is yourself.  I would hate to see you have complications down the road because you did not take care of your self now.  It is never too late to start taking better care. Start with one thing first set a goal for your self and every few days add to it.  Like making sure you test before meals - then making sure you bolus etc. etc.  I have seen first hand what laziness and diabetes together can do.  I have seen a foot sore take 2 years to heal (with the talk of amputation) because the person did not take her insulin properly.  I realize it is hard I am constantly after my daughter to check her blood and reminding her to bolus.  Do you have some one that you can talk to that can help you understand why you don't check more often and bolus after meals?  Maybe if you partner with a friend or a relative it would help.  I have heard of kids naming their pumps so that when they are reminded to bolus they are told to feed so and so. (Example they name the pump Joe. Instead of being reminded to bolus some one can remind you to feed Joe). This has worked well for several teens, as it is not drawing attention to your pump.The other thing that worries me is that you do not change your site for up to six days.   You are playing a very serious game with your life.  If your site gets infected it can and will get in your blood stream very quickly and you can get very sick.  You should talk to your doctor, we were told to never let the site change go for more than 3 days, because after that the risk of infection gets higher.   I do not want to scare you, but you are young and I know you are scared but you need to have a talk with your doctor or diabetes educator,  to find out better ways to get under control.You might want to check the web site  - childrenwithdiabetes.com they have a chat for teens and for pumpers.I hope you try some of these suggestions.  Please post again and let us know how you are doing.",
            "post_id": "2433059",
            "timestamp": "1070344800",
            "votes": 0
        },
        {
            "answer": "I am happy  that you had a good day today I knew you could do it!!.  You and your folks should have a 504 in place so that those",
            "post_id": "2433069",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "I do remember when I was 15. That was when I rebelled against everything that had to do with diabetes and started to give up. I don't really know exactly what it was that made me change but I do know that I just sort of woke up one day and said I can beat this. I can live with diabetes. One thing to remember is that you control your diabetes not the other way around!!!! I always think of that when I start to get unmotivated and it helps me to remember that I am in control.",
            "post_id": "2433067",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "Well, mr_pat3,You have recieved a couple of responses from various volunteers. I would take the answer's in the good faith which we all try to give. Please keep in touch. It's obvious tonight many out there care.Hope to hear from you soon,DebbieP.S. I would suggest taking advantage of any support groups that were suggested. You aren't alone, rembember that.  We want a cure sooner than later. Keep the faith.",
            "post_id": "2433062",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "You've gotten some great advice already, and as a pumper and long-term DMer (diagnosed as a teen, now I'm 48) I thought I'd chime in here, too.First, I must say I don't \"buy\" the label \"lazy\" for most DMers ... and I'd encourage you to probe your feelings a bit deeper.  DM is demanding, relentlessly demanding and, quite frankly, part of being a healthy teenager is the process of testing limits.  It is not surprising that a teen with DM would test the limits of everything related to DM.  After all, we did not CHOOSE this disease ... it somehow found us!Living well with a chronic disease like DM requires an extraordinary set of coping skills, personal insight, courage, humility, parental or other adult support, medical care, and yes, motivation to live well!  It's a huge deal and teen years are stressful enough even without this added burden.The truth for me is that how we label ourselves drives how we behave ... and not the other way around.  Would you be willing to try an experiment?  Would you -- for three hours on one day -- be gentle & kind to yourself ... and ensure that you use only positive, encouraging, striving self-labels AND at teh same time, for those 3 hours ... do the right DM things.  If the experiment is reasonable, extend it consciously, but aim for reinforcing your \"can do\" skills.Yes, it is important to test, to bolus correctly, to eat reasonably, and to care for your pump & pump sites if you are going to pump.  Some folks (teens and adults) find that they do exceptionally well with pumps and they enjoy the freedom & control the pump brings.  For others, it's much more trouble than benefit ... and for those folks until & unless their views change, pumping is not a good choice.In the end, my encouragement to you is to be gentle to yourself, and continue your progress to be honest about what's going on for you -- talk with your docs, your nutritionist or whoever it is on your DM team that you trust & feel safe with.  It is soooo important for teens to have a trusted adult (or 2 or 3) they can rely upon \"in person.\"  You can FEEL better ... and then you will DO better, I'm certain.Please consider all the perspectives that folks here offer, check out those teen-oriented cyber-support groups, & then find the mix of ideas that'll bring you success.",
            "post_id": "2433060",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "I'm a newbie .... only a few months into a life that now includes Diabetes.  I'm not lazy and you probably aren't either - but I already know what you're feeling.  The \"fatigue\" of it all - the same routine that must be done every single day.  I'm still struggling myself to cope with the realization \"this will be with me forever and will not go away\" .... the constant finger sticking and carb counting and infusion site changes do wear down on you.But, I also remember when I first got diagnosed as having been struck with Diabetes .... how my vision was blurred for a long time and I could read anything or watch anything, the splitting mind-numbing headaches, constant nausiated feelings, terrible mood swings .... I never want to live through that again.  So even though every day I wake up and want to scream \"the heck with all this\" .... I don't.  I monitor my blood, I change my sites, and even with a pump I eat calculated meals and don't abuse the pump by eating junk.  Sometimes I have to force myself.  Diabetes already took a big chunk of my life away and made it more complicated and less care free .... I'm not giving it any more.You only hurt yourself when you don't keep on top of your condition.  Diabetes doesn't care, you can't hurt it.",
            "post_id": "2433064",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "Well, to answer a few questions...I am 15 years old. I only did not change my site for about 6 days once, and that is already getting better. I would never do that again.I really think that I will be getting better soon. I bolused for everything I ate today. It makes me feel good knowing I am getting better. It's kind of like getting a 100 on a test. Speaking of tests, I have another problem...My lunch readings...Well, sometimes I just do not do them. This is because a few classes I am in are strict, no talking classes. If I take my meter out, all attention would be drawn on me, which I don't want. I hate it. I think I may have figured out a solution though. I can just ask to go the bathroom a few minutes before lunch. (Hmm, that will work. :))But overall, after one day, I already feel better about myself. I don't think I've taken this far of a step, so that helps me. I know that I am now getting back on track, and ready to take control of my diabetes once and for all. :)Thank you everyone.",
            "post_id": "2433065",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "I, too, am a type 1 diabetic who has lived with it without damage for 34 years. I think every single diabetic knows exactly how you feel. We ALL can slide into laziness or denial or whatever we want to call at times. For me, personally, it helps to have someone (my doctor works for me, but for you, perhaps another diabetic teen partner) to have to account to. If I have to tell someone how I am doing, I have more incentive to actually stay on top of things than if there is no accountabiity. I strongly encourage you to seek a support group and match up with someone to be accountable to. It sounds as if you have a good grip on what to do, but need to keep motivated. Don't we all! Just take it day to day, and meal to meal, and don't beat yourself up when you slip up. Just take a deep breath and get that sugar down before the next meal if you goof up. I can remember how it was, being a teen diabetic. The absolute LAST thing I would ever want to do was to call attention to it. I understand your need for privacy when doing blood tests. I hope you can work out a routine that keeps you discreet and happy. I can offer that it does get better as you grow up, for other folks start having health problems in adulthood, and you are not so all alone. If anything, the healthy habits you will create will keep you healthy and fit probably longer than your peers, who may struggle with weight gain because of our society's super-sized meals. It does get better, so hang in there.",
            "post_id": "2433066",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "I accidently hit the button too soon. oppsAnyway I am in control and you can too. I have gone through the lazziness as you put it and thought about how all the other kids could just eat and not have to worry how much sugar was in what they were eating or drinking and they could just go about life and I had to stop and test and bolus or give a shot.  Since you have a pump if you realize that you are half way through your meal and you havn't bolused...bolus. its ok to be a little late. Well that is what my doctor has said. But I am only 18 so it hasn't been that long since I was 15. So I know exactly how you feel freshman year was the hardest for me and then I realized that there are lots of people who are doing this every day just like me. you are not alone and it will get easier with time. i know how you feel and just day to your self that tomorrow will be better.i hope this helps and post a question anytime.Pumpgirl03Diabetes Advocate",
            "post_id": "2433068",
            "timestamp": "1070431200",
            "votes": 0
        },
        {
            "answer": "So I had another unbelievable day today. :) I took all my reading, bolused for everything, and took my reading at lunch. :) My reading ranged from 80 to 143 today, and although it may not seem like a big deal for all of you guys here, it is a giant leap on my part. I feel so great now. Im just hoping that I can keep this going for the rest of my life now. ;)Thank you everyone for all of your support, :)Patrick",
            "post_id": "2433076",
            "timestamp": "1070517600",
            "votes": 0
        },
        {
            "answer": "Patrick,I am so very proud of you.  Keep up the good work; remember to take it one day at a time.  If you have a bad day one day remember what is the past is done and just move forward.  Do see about getting a 504 in place.  This will also be helpful when you take your SAT test and other required assessment tests. The 504 will allow you to take extra time to test and to check your blood sugar and have snacks without a hassle.Please keep us posted. You have shown maturity in wanting to get control, we are here to help you and remember you are not alone in the fight against diabetes.Wendy",
            "post_id": "2433077",
            "timestamp": "1070517600",
            "votes": 0
        },
        {
            "answer": "Thank you very much, WAK. I appreciate it alot, really. :)And...Sorry if I sound dumb, but what is a 504?",
            "post_id": "2433078",
            "timestamp": "1070517600",
            "votes": 0
        },
        {
            "answer": "OOPS!Sorry, I skipped the part that described the 504 up top. Anyway, I don't think I'll need that. All of my teachers know that I have diabetes and will make accomodations for me. :)",
            "post_id": "2433079",
            "timestamp": "1070517600",
            "votes": 0
        },
        {
            "answer": "Hey!! What a great \"gift\" you gave us today with your posting!!  Such a wonderful problem-solving story :-)  I'm impressed & I'm rootin' for your continuing success.Y'know your idea about asking the teacher ifyou can jsut go to the bathroom (or the nurse or the guidance counselor) will likely work really well.  You might consider talking to him/her just before class starts and tell the teacher that it's important for you to do a blood test before lunch every day and that his/her accommodating your finding a few minutes to get that done in privacy would really help you maintain good health, avoid complicatins, etc. etc.It's important that some of the folks at your school know that you have diabetes -- just in case (blah blah blah), and perhaps that tough-as-nails teacher is one of those who can be trusted & depended upon.(I'm a college professor, so I know a bit about how \"human\" teachers really are ;-)  )It's soooo cool that you've taken this step.  Your progress is undoubtedly inspiring some other teens (lots more people READ these bulletin boards than post to them).",
            "post_id": "2433073",
            "timestamp": "1070517600",
            "votes": 0
        },
        {
            "answer": "Hi Patrick!  I wanted to pass this information on to you regarding the 504 Plan that others have mentioned.  It really is important that you have one in place at your school.  It protects you against the unlikely event that you have a situation in school that descriminates against you and could potentially harm you physically.  Somewhere recently, I read that the best time to have a 504 Plan is when you don't need one.  I agree totally with that statement.  My daughter is a Junior and we felt as you do, that everyone has been super understanding all through her school years and didn't feel the need to look into what a 504 Plan was or have one put in place for her.  While registering for her PSAT exam, I found out that she would not be allowed into the exam with anything other than a no. 2 pencil!  No snacks, juice, blood glucose monitor or her pump!  All of these items need to be pre-approved by the College Board (they are the ones that administer the exam). This is a three hour exam and there was no way I could allow her to go in without any of these items. After going through all of that hassle, and getting her approved, I thought it would be a good time to get the 504 Plan started.  We met with the school administrative people that this would concern (school nurse, councelors, administrators) and explained the needs that my daughter has during the day (access to nurse at any time, access to food/drink, her blood glucose monitor & pump, extra time (if needed) on exams & SAT's, etc.)  Now, if any situation happens that she is denied access to whatever is outlined in the 504 Plan, we have recourse with the school.  Through the years, there have been several times that the 504 Plan would have been a good tool to have on our side, so I just wanted to let you know how important this is to do.  Talk to your parents about it.  I also wanted you to know that I think you are a very courageous young man in reaching out to the great & helpful people on this forum.  It shows that you truly want to care for yourself!  You have a lot of people who care about you...don't forget that!  Have another good day!",
            "post_id": "2433084",
            "timestamp": "1070690400",
            "votes": 0
        },
        {
            "answer": "Alright... Im new here but not new to Diabetes after having it for over 2 years. I'm 16 and I just find diabetes an easy thing to deal with. I'm really active (basketball, snowboarding, skateboarding, BMX) so I suppose that helps. Certainly not a pumper as I like the freedom of not having ports inside me all the time. Its a personal choice but it works for me. I also figure with all the sports it would get ripped out or hurt a hell of a lot if I fell on it which seems overly likely.You can't be lazy with Diabetes. It just makes you feel sick and you end up missing out on the good stuff in life. How hard is it to take 30 seconds from your day to test your blood? I mean.. 30 seconds? You've got 86400 seconds and you can't be bothered to spend 120 of them testing you're own blood four times? Come on get it together.As for in school and stuff in classrooms with teachers... I think of it as an educational opportunity for people. In my Freshmen year I was really secretive about my diabetes and they wanted me to go to staff room in the office to test my blood. I thought I was being hidden away in some little broom closet. It was rediculous. I did it for the entire year though. The following year I moved to the UK where I am now and I had a meeting setup with the nurses at the school and they said I could test wherever I pleased to in the school as long as I didn't leave sharps lying all over the place. I felt to normal afterwards. I quickly got all my new friends adjusted to how easy diabetes was to deal with. I made each of them test their blood sugar aswell. They were all scared to use a lancet but I walked them through it and they all said \"DAMN I THOUGHT THAT WOULD HURT MORE\" or something to that effect. All of them know how to Glucagon me aswell incase there is ever an emergency which I'm happy to say I've never had. If I ever feel low I can just pull out a meter and test in the middle of class with no questions. If I am low... I can just say to my teacher \"I'm going to the nurses office\" and I am free to walk out of class, even during the middle of a test.Another thing you should know... as a Diabetic you have rights. If a stadium or even has a \"No-Bag Policy\" you are exempt. You simply need to find the head of security and explain to him that he could be hauling your dead corpse from the stadium and face a multi-million dollar lawsuit or he can let you through with a bag that you will let him search. When he seems needles or a test kit... he will know you're being straight up and will let you right on through.Any more questions... feel free to ask.Mike",
            "post_id": "2433090",
            "timestamp": "1070863200",
            "votes": 0
        },
        {
            "answer": "mr_pat3,I,m very proud of your progress.  It can be difficult to deal with diabetes, but the fact you reached out shows me you want to.  Keep up the good work. As far as the activity levels of someone with diabetes, my 27 year old son has had type 1 for 18 years. He fought forest fires in Idaho and Montana all last summer. He also works as a pro patrol for the local ski slope during the winter. As long as he takes care of his glucose monitoring and diet, he has no problem. mikejl29, thank you for your comment.  I'm glad you can give encouragement to others. In my opinion this thread has been very important.  Thank you all and best of luck.",
            "post_id": "2433093",
            "timestamp": "1070863200",
            "votes": 0
        }
    ],
    "post_id": "2429175",
    "question": "Hello.I have had diabetes for three years now, and I can't seem to get a handle on it. I get very lazy, missing several times when I am supposed to test my blood sugar. It really scares me knowing what I am doing to my body.I am on the insulin pump, which presents another problem: site changes. This is probably the worst. I leave my sites in for several days at a time. I just fill the resovoir when it gets low. On one occasion, I believe I left a site in for six days.Many times I just don't take my blood sugar, and I'm not really sure why. I'm just lazy. On the weekends, I sleep until 10:00-10:30. I go to mass on Sundays at 11:00, usually without eating anything before, mainly because I just \"don't feel low\". I am very embarrassed telling you all this.I eat pretty much whatever I want, and sometimes I don't give myself a bolus. Laziness. I hate it. It makes me sick thinking about all of this.I really need help. I always say \"I am going to change today!\", but I am always back to the way I used to be a few days later. It does make me feel glad that I am finally posting on a forum, with people that understand. I appreciate your reading, thank you.I need some advice. Diabetes just gets so tough. :(",
    "timestamp": "1070344800",
    "title": "I need help with my diabetes."
}