{
    "answers": [
        {
            "answer": "Thanks for that it is worth reading..I know some people on the alberferon trial, they are on injections every two weeks, and doing okGreat article about does HCV cause diabetes...again things that need discussing and the relevant tests carried out..PX",
            "post_id": "4371967",
            "timestamp": "1240172427",
            "votes": 0
        },
        {
            "answer": "Thanks for sharing! Especially the article \"Sexual Transmission of HCV: An Emerging New Consensus?\" very good. There is too little awareness out there among HIV poz men, and there is a surge going on of people getting infected with HCV among them. Most have no clue how devastating HCV is, in particular in combination with HIV. It's about time the word gets out.http://www.hcvadvocate.org/news/newsLetter/2009/advocate0409.html#6",
            "post_id": "4372138",
            "timestamp": "1240175672",
            "votes": 0
        },
        {
            "answer": "\"the incidence of diabetes was found to be 3.6% at 5 years, 8.0% at 10 years and 17.0% at 15 years.\"So the longer you have HCV, the higher your risk of diabetes.  It's too bad they don't mention how many had a family history of diabetes.  That could have skewed the numbers.Co",
            "post_id": "4372477",
            "timestamp": "1240183444",
            "votes": 0
        },
        {
            "answer": "Success rate with Albuferon is no better than with Peg....and the Tx discontinuation rate is higher with Albuferon.  And since Albuferon stays in the system longer, if somebody was to develop serious side effects, it would take longer for them to resolve (if not permanent) with Albuferon than Peg.So the only advantage I can see from using Albuferon is getting injections every two weeks instead of weekly.Co",
            "post_id": "4372501",
            "timestamp": "1240183896",
            "votes": 0
        },
        {
            "answer": "it's a cool newsletter isn't it?glad you posted it...that site does a ton of good work!I wonder how many proofs it will take before docs get on board with the HCV/endocrine connection. It effects thyroid pituitary pancreas and more....how many glands does it have to shut down before HCV is declared a major contributor to endocrine dysfunction?There are literally dozens already....and yet still some act as if no study broke any valid ground. Weird huh?I think Albuferon will get the nod especially for the third world. Impoverished nations lack facilitities for refrigeration etc....or their patients lack their own refrigeration...so coming to clinic 2x a month for a shot would make sense in extremely impoverished areas. And the clinic could keep more on hand with half the storage space needed.Some of these countries have rates of HCV or 75% of the populace, so it's going to take a real push to treat all with drugs they can deliver on time to get these populations free of this disease. For that reason Albuferon makes good sense even if there is a 3% drop in SVR...if it makes it possible to treat millions more people...then it makes the most sense.I was sad to lose my genentech stock to Roche last month but long term these mergers may make sense...although Gen is much more innovative...but it was a forced sale really..I guess combining research efforts makes sense in some ways, chiefly less overlap and lower expenses....yet I wonder how long term this will effect the new drug pipeline since some, like Roche, are known for such stiff collar research....and I think sometimes it's the little guys who have made the lions share of all the progresses....only to be swallowed up by the lazier bigger lions in the end. Sometimes the top heavy companies spend half as much on R&D as the tinier co's do....but I'm just rumminatin\".mb",
            "post_id": "4373154",
            "timestamp": "1240196601",
            "votes": 0
        },
        {
            "answer": "--\"the incidence of diabetes was found to be 3.6% at 5 years, 8.0% at  0 years and 17.0% at 15 years.\"--So the longer you have HCV, the higher your risk of diabetesnot quite..in Arase'09http://www.ncbi.nlm.nih.gov/pubmed/19127513data is follow-up from 2842 patients who completed tx. So those 3.6 to 17.0 cumulative T2DM incidence percentages include both SVRs and non-SVRs, ie the longer since you  finished tx the higher your risk of diabetes (of course, each extra day you manage to stay alive the higher your cumulative risk of T2DM...)The interesting point of the study was that the risk is much higher if you don't SVR:  143 of the 2842 developed T2DM during follow -up, of those only 26 were SVRs and 117 were non-SVRs.The significant uptick in risk is particularly marked if you : (a) have pre-diabetic levels (b) are cirrhotic (c) are over 50;Agreed that it would be easier to interpret the results if they had analyzed the cohort for background risk factors associated with HCV - eg BMI could have accounted for both failure to SVR and T2DM onset even without any direct HCV-T2DM causality. Even better would be a longitudinal comparison of HCV/non-HCV patients matched for risk factors (they point out 8-10% of population in Japan has T2DM).However, this does argue against overdoing  the watchful-waiting dance..",
            "post_id": "4375275",
            "timestamp": "1240251998",
            "votes": 0
        },
        {
            "answer": "I have a great IR study to show you.   According to this study, not only does hyperinsulinemia (caused by IR) make interferon ineffective..... it also increases HCV replication.Hyperinsulinemia Blocks The Inhibition Of Hepatitis C Virus (Hcv) Replication By Interferon. A Potential Mechanism For Failure Of Interferon Therapy In Subjects With Hcv And Nonalcoholic Fatty Liver Disease.Arun J Sanyal, Nisha Chand, Kevin Comar, Faridodin Mirshahi,Virginia Commonwealth University, Richmond, VABackground:Hepatic steatosis and obesity are risk factors for failure of interferon (IFN) therapy in subjects with HCV. Both obesity and fatty liver are associated with the metabolic syndrome which is characterized by insulin resistance and hyperinsulinemia. The effects of hyperinsulinemia on IFN-mediated inhibition of HCV replication were unknown.Hypothesis:Hyperinsulinemia blocks the inhibition of HCV replication by IFN.Specific Aims:To examine the effects of insulin on IFN-mediated inhibition of HCV RNA.Methods:A commercially available HCV replicon system (Apath, Clone B(S1179I) comprised of a Huh-7 hepatoma cell line stably transfected with full length HCV RNA was used. The effects of varying concentrations of insulin (0-128 uU/ml) on the anti-viral activity of alpha-IFN (50 LUlml) were studied. The endpoints measured included: (1) HCV replication: quantitative real-time PCR of HCV RNA, and (2) IFN-induced anti-viral proteins: protein kinase R (PKR) and interferon regulatory factor-1 (IRF-1) (Western blot). The pathways by which insulin produced these effects were evaluated by specific blockade of the phosphatidyl inositol-3 kinase (PI3K) with LY 294002, and blockade of mitogen activated protein kinase (MAPK) pathway with PD098059.Results:Following exposure to IFN for 30 minutes to 12 hours, there was a highly significant (p< 0.001) decrease (mean + I - S.D.: -90 +I- 5%) in HCV replication. Insulin alone had no substantial effects on HCV replication at physiolgic concentrations (< 64 uUlml). However, at high insulin concentrations (128 uUlml), there was a significant increase (31 +I- 8%, p< 0.05) in HCV replication. While physiologic concentrations of insulin had no effects on IFN-induced decrease in HCV RNA levels, there was a marked blockade of IFN effects on HCV RNA (-92 +/- 8% with IFN alone vs -33 + I - 10% IFN + insulin compared to serum free media, P< 0.001) at [insulin]= 128 uU/ml. As expected, IFN produced a mean 3.5 fold increase in both PKR and IRF-1 expression.Insulin alone had no effects on the expression of either protein. However, insulin blocked the IFN-mediated increase in PKR and IRF-1. The effects of insulin on HCV RNA were almost completely blocked by LY 294002while PD 098059 did not produce a significant effect.Conclusions:Insulin, at concentrations seen in the insulin-resistant state, increases HCV replication. Insulin also significantly blocks the suppressive effects of interferon on HCV RNA. Thiseffect is mediated by the PI3K signal transduction pathway. Insulin also blocks the induction of two major anti-viral proteins PKR and IRF by IFN which may contribute to the effects of insulin on interferon-mediated suppression of HCV.----------------Guess how old the study is.....AASLD 2004Co",
            "post_id": "4377786",
            "timestamp": "1240307004",
            "votes": 0
        },
        {
            "answer": "CS found the abstracts from the conference you were looking for.  And this one proves us right.....RVR's are not IR......INSULIN LEVELS AND INSULIN RESISTANCE (IR) DEFINED BY THE HOMA-IR INDEX HAVE A DIRECT EFFECT ON EARLY KINETICS DURING PEGYLATED-INTERFERON THERAPY FOR CHRONIC HEPATITIS C.G. Bortoletto, S. Realdon, F. Dal Pero, M. Gerotto, L. Franceschini, L. Scribano, D. Martines, A. Alberti.  Venetian Institute Of Molecular Medicine, Padova, Italy;   Department Of Surgical And Gastroenterol Sciences, Univesity Of Padova, Padova, ItalyBackground and Aim:Insulin resistance (IR), a central feature of the metabolic syndrome, has emerged as a key factor reducing the response to pegylated interferon-alpha (PEG-IFN) based therapy in chronic hepatitis C. The pathogenic mechanisms underlying this association are still unclear. Aim of this study was to examine the relationship of baseline serum insulin and of homeostasis model of assessment insulin resistance (HOMA-IR) index with the early virological response to PEG-IFN, taken as a measurement of the intracellular response to interferon (IFN) signaling.Methods:In 47 patients treated with weight-based doses of PEG-IFN plus Ribavirin, baseline serum, insulin and HOMA-IR were measured the same day of the first IFN injection. HCV-RNA levels were measured by RealTime PCR (Abbott m2000, LoD 12 IU/mL) in all patients at baseline, as well as 24 hours and at weeks 1, 2, 4, 12 after treatment initiation to define the individual kinetics of response.Results:Mean baseline insulin level was 12.47±8.9 mIU/L (range: 1.5-49.4) while, mean baseline HOMA-IR was 2.9±2.22 (range: 0.36-11.4). A significant inverse correlation was observed between baseline insulin levels and HCV-RNA decay already 24 hours after the first injection of PEG-IFN (p=0.006). A statistically significant association was found also between baseline insulin levels and viral decay after 2 weeks (p=0.004) and after 4 weeks (p= 0.025) of treatment.Moreover, patients with high insulin resistance index (HOMA-IR ³ 3) showed a significant reduction in virus decay at 24 hours compared to cases with HOMA-IR < 3 (0.8 vs 1.6, p=0.006). This association was observed also considering viral decay after 2 and after 4 weeks of treatment (p=0.05 and p=0.025). Patients with HOMA-IR ³ 3 had 8.3% rate of HCV-RNA negativity during the first 12 weeks of treatment while, the percentage of HCV-RNA negative cases among those with HOMA-IR < 3 was 30.4%.Conclusions:We have demonstrated a direct effect of basal insulin levels and HOMA-IR on the early response during PEG-IFN based therapy for chronic hepatitis C suggesting that insulin signaling is a key factor in reducing the cellular response to IFN in hepatitis C infected patients.----------------------------INSULIN INDUCES IMPAIRMENT OF THE INTERFERON-ALPHA SIGNALLING IN HUMAN HEPATOMA CELL LINES: EVIDENCE FOR POSSIBLE INVOLVEMENT OF HYPERINSULINEMIA IN HCV INTERFERON RESISTANCE.L. Franceschini, S. Realdon, F. Dal Pero, S. Mirandola, M. Marcolongo, G. Bortoletto, A. Alberti, M. Gerotto.  Venetian Institute Of Molecular Medicine, Padova, Italy;Department Of Clin. Exp. Med., University Of Padova, Padova, ItalyBACKGROUND and AIMS:Insulin resistance (IR) has been associated with reduced rate of virological response to peg-interferon (Peg-IFN) plus ribavirin in patients treated for chronic hepatitis C.IR is often associated with hyperinsulinemia.We have demonstrated that baseline insulin serum levels are associated with significant impairment of virological response during Peg-IFN therapy of hepatitis C. Our aim was to develop an in vitro model to assess whether insulin has a direct effect on the IFN-alpha induced antiviral response.METHODS:Initially we established the duration/concentration of stimuli in order to evaluate changes in the expression of IFN-related genes. Next, Huh7 cells were pre-treated or not with 100nM of insulin (INS) for one hour and then different concentrations of IFN-alpha (10-100-1000 UI/ml) were added to the same cells for further 4 hours.The expression of IFN-related genes (PKR, MxA, 2’-5’OAS and SOC3) was measured by RealTime-PCR. GAPDH was used as internal control. For each gene, values were normalized as compared to expression value in untreated cells. Total PKR protein expression (normalised to b-actin) was evaluated in the same setting by Western-blot and densitometric analyses.RESULTS:The quantitative analysis confirmed a dose-dependent activation of the IFN-alpha pathway as indicated by increasing mRNA measurement of all the target genes (PKR, MxA, 2’-5’OAS and SOC3). INS treatment alone, for up to 5 hours, didn't affect expression of IFN-related genes. However, in cells pre-treated with INS alone for one hour and then treated with INS plus IFN-alpha we observed constant reduction in expression of IFN-related genes.In particular, when cells were treated with 100 UI/ml of IFN the mean reduction in mRNA levels was: 60,3% for PKR, 26,0% for SOCS3, 42,0% for 2’5’-OAS and 48,3% for MxA.The results of PKR protein expression were in line with the gene expression data.CONCLUSIONS:These preliminary results suggest that insulin itself may affect the IFN-alpha intracellular signalling. These results, related with HCV infection, open the question whether IR itself or the hyperinsulinemic status, that is often associated with IR, might be the major determinant of reduced response to IFN signalling in patients treated for hepatitis C.---------------------So if the PI3K is the problem, then inhibiting it might get around IR=IR.  (SOCS is probably only an issue if you are over weight).Besides quercentin, what else inhibits P13K?Co",
            "post_id": "4377814",
            "timestamp": "1240308292",
            "votes": 0
        },
        {
            "answer": "It takes a village",
            "post_id": "4377930",
            "timestamp": "1240313034",
            "votes": 0
        },
        {
            "answer": "And this one proves us right.....RVR's are not IR......-------------------What I got from the study was that RVRs are less associated with IR,  not the absolute statement you make above. Didn't we have at least one RVR who stated they were IR in one of the previous threads, hopefully not deleted? Maybe the person will come forth again.",
            "post_id": "4378471",
            "timestamp": "1240323466",
            "votes": 0
        },
        {
            "answer": "Didn't we have at least one RVR who stated they were IR in one of the previous threads, hopefully not deleted? Maybe the person will come forth again.______________wasn't that Bill ?",
            "post_id": "4378632",
            "timestamp": "1240325965",
            "votes": 0
        },
        {
            "answer": "\"Didn't we have at least one RVR who stated they were IR in one of the previous threads, hopefully not deleted? \"---------------I would need to see the lab results that showed IR....a high HOMA and RVR would convince me : )\"hopefully not deleted\"Seems to me some people enjoy starting arguments to get threads deleted.  They need to find another hobby.Co",
            "post_id": "4379930",
            "timestamp": "1240343893",
            "votes": 0
        },
        {
            "answer": "CS and I are going to look for non-responder studies that did insulin tests. We'll let you know what we find out.Co",
            "post_id": "4379982",
            "timestamp": "1240344493",
            "votes": 0
        },
        {
            "answer": "Im flattered :) but never have disputed an association between HOMA scores and RVR as per the study posted. I just wanted to point out that my read of the study was that there was an *association* between these factors and not an absolute cause-and-effect as you implied. As you know, other associations with RVR and/or SVR are genotype, race, BMI, cholesterol levels, non-stage 4, etc.",
            "post_id": "4380067",
            "timestamp": "1240345853",
            "votes": 0
        },
        {
            "answer": "..RVR's are not IR......---------------------------To clarify, I am using \"absolute cause-and-effect\" in the sense that I didn't see anything in the study that concluded that all RVRs are not IR, as you stated above.",
            "post_id": "4380096",
            "timestamp": "1240346260",
            "votes": 0
        },
        {
            "answer": "Look deeper.  The study demonstrated a direct effect of insulin levels on early response (first 4 weeks of Tx).In other words, having high insulin levels had a negative effect on early response.And what causes high insulin levels?  IR.Co",
            "post_id": "4380458",
            "timestamp": "1240351590",
            "votes": 0
        },
        {
            "answer": "you have no idea how much it bothers me to keep agreeing with Jim,  but I think his points are valid:1)  it's obviously nonsense to claim that any of the effects in question are 'absolute'. Per the above study, \"Patients with HOMA-IR gt 3 had 8.3% rate of HCV-RNA negativity during the first 12 weeks of treatment \".  They started with only 47 and don't give detailed numbers so we can't tell the count corresponding to the 8.3% that  RVRrd among the high-HOMA group (BTW since anything worth reading  is indexed by pubmed giving the PMID or abstract number is usually as, if not more, helpful than the text)2) re \"this one proves us right\"  perhaps you could explain exactly what has been proven and/or what was disputed as  I can't understand what part of this topic is a controversial subject. The evidence for a strong correlation between  IR and poor SVR outcome/fibrosis progression is quite  strong and I've never seen any posts refuting it. Also, as Jim points out, there is strong evidence for a score of other factors (to his list I'd add age,  steatosis, baseline VL,  and both viral and host genetic signatures).  Several of these factors are likely not independent  (eg steatosis and IR) but as the 2nd abstract above makes clear, even for IR the pathways are still far from clear : is the effect due to insulin or glucose levels?So what's the patient impact of all this partial knowledge? I thought the study initially posted carried a  warning about delaying tx if one was starting down the road of pre-diabetes.  Also, patients have been advised for years to lower bmi and increase exercise to improve SVR odds and the IR data gives yet more support for that advice. The question of whether it's worth taking insulin-sensitizing drugs prior/during tx seems still open ( at least to my mind). Trying to influence the pathways involved by supplements before the mechanisms are even understood seems, at best, a \"personal choice\".Is there anything else?",
            "post_id": "4381328",
            "timestamp": "1240367172",
            "votes": 0
        },
        {
            "answer": "Willing: you have no idea how much it bothers me to keep agreeing with Jim,  but I think his points are valid:-----------------Willing, this is very disturbing. Maybe a thread on viral load testing frequency/sensitivity is in order :)",
            "post_id": "4381420",
            "timestamp": "1240369218",
            "votes": 0
        },
        {
            "answer": "http://www.eurekalert.org/pub_releases/2009-04/eaft-doa042209.php",
            "post_id": "4384589",
            "timestamp": "1240442554",
            "votes": 0
        }
    ],
    "post_id": "4371905",
    "question": "http://www.hcvadvocate.org/news/NewsUpdates_pdf/Advocate%202009/advocate0409.pdfWORTH THE READ",
    "timestamp": "1240171136",
    "title": "interesting reading from the HCV ADVOCATE"
}