{
    "answers": [
        {
            "answer": "I am not a physician, but a volunteer and a mom of a type 1 diabetic and the daughter of a type 2.  I feel the same way you do, but my husband and I tell our daughter that she can be anything she wants to be.  Who knows they might change the rules or better yet FIND A CURE!!You have to realize that if a person has a severe low in the military, as a pilot or in a big rig, it is not just there life at stake; they are risking the life of others.  I do know that in the state I live before a diabetic teenager gets there drivers permit and license the doctor has to sign a statement that the person has been in good control for at least 6 months.  I know several teens that have not been able to get there permits yet.I have also read about and, met diabetics that have had such severe lows that the local EMTs know her by her first name. Her Lows were so bad that she had an islet transplant.I realize that these rules are not fair to the people that are in good control, but there needs to be guide lines for everyone",
            "post_id": "2430043",
            "timestamp": "1115096400",
            "votes": 0
        },
        {
            "answer": "While it is true that there are several jobs a diabetic will be blocked from pursuing, there are thousands of exciting, interesting and productive jobs that we can pursue.Since diabetes is a life-long disease, I find it helpful to focus on the things I can do -- and build my confidence, competence and joy -- rather than to dwell on the things that could've been had I not had this disease.  I would encourage you to help your son shift his energy toward accepting the jobs he can't pursue and finding careers where he can fluorish.Here are some additional perspectives that I hope are helpful.  If he's interested in the military, there are good civilian military roles where diabetes is not an issue.  Active duty military can get separated from their supplies and their backpacks aren't coolers.  Without refrigeration, a supply of insulin could easily become useless in the desert.  In case of attack, insulin & testing supplies could become unavailable altogether.  A diabetic separated from our life lines is a dead diabetic.  In the military setting, such a devastating personal outcome can easily jeopardize the well-being of fellow troops.  A diabetic who is low and cannot get glucose, or is high in can also jeopardize fellow troops by clouded thinking and weakened physical abilities.  Taken in this context, the ruling seems correct to me.Non-diabetics whose eyesight is not good without correction cannot be pilots.  Sure they can wear glasses or contacts, but for the greater good, that safety precaution is in place, too.  Again, it seems reasonable to me and every time I'm in a plane that's flying thru turbulence and we're all getting jostled around, I'm glad the pilot has good eyesight.Encourage your son to focus on careers and opportunities that he can pursue and help him build healthy emotional acceptance of his disease.",
            "post_id": "2434303",
            "timestamp": "1115096400",
            "votes": 0
        },
        {
            "answer": "Are you serious? a diabetic can't join the army! wow, that is great, that means that i can't get drafted!I personaly would not fly on a plane if i knew the pilot was a type one diabetic, nor if he had any other history of diseases.And this is although i myself am a type 1.Nobody is discriminating against you, the job requires a certain standard and you don't meet that criteria.If the NBA or the NFL would not take someone because he/she is not in shape and cannot play basketball or hockey, are they discriminating against him/her? No. The job simply requires people that meet certain standards.The same applies if a software company won't hire someone because they don't know how to use a computer.I personaly consider it a privilege not to be able to go to the military,and although it is a very good thing to fight for your country and show support, at the end of the day nobody want's to be fighting. (I.e, if the whole world was at peace, and nobody ever knew of war, nobody would join the military.)Make no mistake, it is a very good thing that you want to fight for your country and protect our nation and we all respect that, but if you can't join, there are many other things that you can do to help others.Remember, there are millions of other diabetics (such as me) who have the same sitch as you. There are billions of other people with diseases that do not allow them to do these things as well, but we all get over it.Positive thinking!Best regards.",
            "post_id": "2434304",
            "timestamp": "1115182800",
            "votes": 0
        },
        {
            "answer": "I was reading the postings that have been submitted, and just as an FYI   I recently found out that diabetics can go scuba diving.  There are several programs that send diabetic campers during the summer scuba diving.  If you look around there are still plenty of great adventurous things diabetics can do.",
            "post_id": "2434309",
            "timestamp": "1115355600",
            "votes": 0
        },
        {
            "answer": "Your concern strikes close to my heart. My father was a pilot, and my dream was to fly as well. I started learning with him at 5. At 13, that dream shattered by diabetes, and I found that anything else I wanted to do that required any kind of medical certification was also barred (scuba diving, skydiving, etc.). The military was also out, so I wan not drafted to go to Vietnam. I felt less of a person than my peers, and the psychological impact lasted well into adulthood. Fortunately, things are a little better now, and even diabetics can get a limited license to fly gliders and small planes (as can persons with heart disease). This does not permit the option of a career in many fields, however, and it is devastating to a diabetic who may have such dreams. I have gone 43 years without a hypoglycemic crisis that would have resulted in a dangerous situation. You are correct that there is discrimination against diabetics based on generalizations and ignorance. Fortunately my state dropped any restriction on driving based on diabetes, and I hope others will follow suit. I am sorry your son must live within these constraints. A fight for diabetic rights is due, but the desires of the type 1 population are different than the older type 2s, and we do not seem to have much of a voice compared to them. Help your son understand that the problem is in society, and not with hm. He will be capable of virtually anything he wishes to do, regardless of whether society allows it. A small comfort, but psychologically important.Larry",
            "post_id": "2434307",
            "timestamp": "1115355600",
            "votes": 0
        },
        {
            "answer": "I am not saying that these jobs are all that a diabetic can do. And I totally understand their reasonings for saying YOU CAN NOT DO THIS..But, who has the right to say an insulin dependent diabetic can not do this. Who says they will have poor control? A type 2 Diabetic can't understand this totally because they were able to join the military or anything their heart desired when they were old enough. But an insulin dependent diagnosed at as a child, will never be able to join the military or various other jobs that SOMEONE decided for them, they CAN NOT DO. Granted, my son is very young, but this is a fight I will never give up on. I will be standing by his side all the way, fighting for him on whatever it is he chooses to do in life. Thank you for all of your comments!",
            "post_id": "2434311",
            "timestamp": "1115701200",
            "votes": 0
        },
        {
            "answer": "As long as your diabetes type I is under good control, there is no reason why you cannot get a pilot's license (with physician sign-off), a scuba diving permit, or become a police officer. There have actually been a few recent lawsuits over type I diabetics who were disqualified from becoming a police officer due to their illness. The candidates sued, and the US Supreme Court stated that the departments had to review the candidates medical history and prove that they were not under good control before they could legally disqualify them. As far as I know, the only jobs off limits are the military and commercial aviation.",
            "post_id": "2434361",
            "timestamp": "1118638800",
            "votes": 0
        },
        {
            "answer": "If you can prove your control (good records, good A1c's, and no hospitalization due to hypoglycemic events - you should be able to find a medical flight examiner that will sign off on a medical flight certificate waiver.  I don't know if the airlines will hire your son, but he will be able to fly.  He can also obtain a scuba license, become a police officer, a firefighter, etc.  Will he be able to join the military?  Read the ADA website about the soldier that just returned from Iraq with T1 diabetes.",
            "post_id": "3202340",
            "timestamp": "1217038686",
            "votes": 0
        },
        {
            "answer": "These are the restrictions I heard when I was a child. But things are changing. It's all on a case by case basis.Also with the technology available now, such as highly sophisticated insulin pumps and 24hr blood sugar monitors type 1 diabetics can have better control then ever before!If you really want to do something, you find a way.",
            "post_id": "3232770",
            "timestamp": "1217726597",
            "votes": 0
        },
        {
            "answer": "uhh I dont know who told you your son cant be a police officer....but they are DEAD wrong.My cousin john has been a police officer for 7 years and he has been type 1 diabetic for 9 years.....you most certainly can. not just a police officer either he is a swat officer, one of the the most demanding positions...please stop going around spreading your false information, a kid could read your information and come to the conclusion that he cant be a police officer...unbenounced to him the person supplying the information is not in the position to do so....you may dash someones hopes and dreams....DO NOT POST DUMB THINGS LIKE THIS PLEASE!this is worse than the person who said type 1 diabetics cant work the night shift....complete bull, where these people get these wild rumors from I will never know...",
            "post_id": "3245840",
            "timestamp": "1218006815",
            "votes": 0
        },
        {
            "answer": "any information on if a diabetic can be a firefighter?  was in the army once upon a time, but am now Type 1 diabetic and can't do that dream anymore.  just curious about firefigher",
            "post_id": "4143005",
            "timestamp": "1238294672",
            "votes": 0
        },
        {
            "answer": "The saddest part too, is that I have a diabetic type 1 diagnosed at age 4, who is now 19, and can't seem to find his way in life...thinks he's the only one with it, (tried educating him, counseling, everything..., still trying) but we applied for disability at age 5 and was denied because they said, \"not a disease, it can be controlled with medication.\"  Very frustrating!  yet, he can't join military, and every job he wants to pursue gets shot down.  He feels he'll be stuck at Walmart forever.  And his walmart manager told him recently that it is not her concern if he misses work because of his diabetes.  Same rules apply to him as everyone else!",
            "post_id": "4230521",
            "timestamp": "1238569810",
            "votes": 0
        },
        {
            "answer": "I was reading all of the postings i have an appreciation for them all however i am a 26 year old male in good physical conditon, but in a varied mental state. This is in the most part due to the fact that i have been a diabetic since the age of seventeen. I had done everything geared for the militay past my ASVAB fot accepted to the naval academy and in my senior year of high school i was diagnosed. Crushing to this day i still some times stare at the local military personel and their transportaion i.e. ships planes etc. which is espically hard for me because i live in virginia were the military is super mobile. Hurt, unsure, always aware that there is someone out there looking to shut down the dreams i have had for myself. I do understand that there are certain requirements that must be met for certain jobs but ow does any one know that i can't meet them. Before i am given a chance to get the job i am shut out Most likely i am more capable then most more heart and desire than those who are given the positions i may seek, but in the end that all dosen't matter. Where is our shot our moment to do what we feel is for us. I was just telling my wife today that she is gearing up for the military or some other high paying job as a government contractor. I am happy for her and the whole while she is telling me to cheer up, but why. Most of the comments here are from people who either don't have diabetes, or the desire to serve in something that is truly greater than themselves as one person stated he is happy he is a diabetic because he cant go to war. What about not being able to afford health care no one will take you. It is like being punished for something that is in my control because the government says it is a controllable disease, but out of my control because the government does not allow me to seek the paths that i truly disire. It is not a situation of dont worry be happy it is how do i truly find liveable happiness when what i desire to do, truely desire to do is always held from me, I dont want to work behind a desk. Some people are cool with the everyday rat race, some want to be that hunter moving beyond the mediocre. I still sit sometimes and cry to be honest because I CAN\"T DO WHAT I WANT TO DO, I AM ALWAYS FORCED TO DO WHAT I HAVE TO DO. where is the happiness in that. That is the difference between living and existing",
            "post_id": "4325185",
            "timestamp": "1239041552",
            "votes": 0
        },
        {
            "answer": "Wished that I knew about being a police officer or fire fighter years ago being diabetic.  At onetime it wasn't accepted but now it is.  Depends on your area, country, state etc.I found it rather interesting back when  I was in highschool years ago and a recruiter called me up trying to get me interested in joining the military.  I basically said to him that you all won't take me because I'm diabetic.  He came back and said to me, \"...well son when you get that fixed, call us back....\"More or less this is where I believe that there's an education problem going on in society with our situations.  Its not the 1920's or even the 1950-1980 time periods anymore.  People have abilities to keep themselves healthier than back then.  I keep thinking that in some ways if a study was done between people with and or without this situation, there could be advantages to people who have this situation because personally when your diabetic, your not always as hungry, which could help out during long times without abilities to deal with food.  When you have a pump or even on injections, you can take in smaller amounts of food and or insulin to deal with situations a lot easier than someone who doesn't and in a lot of ways, have easier times dealing with those situations.  Its a lot easier to loose weight because of this also I feel.  I think the issue would be having the science to back up the issues.  Until that's done, there's always the false preconceptions in someone's mind from the issues of some older relative and the way they treated these issues with this situation.",
            "post_id": "5060124",
            "timestamp": "1257757220",
            "votes": 0
        },
        {
            "answer": "I myself was in the army when i was diagnosed with diabeties. How ever, you can be in the forces and a diabetic. The only stipulation is that it is controlled thru diet and exercise. This is only as far as basic training, because it is against regulation to have sharps of any kind at basic. after that im told the regulation lighten up a bit. It is the same catch with children. you can not have more than,,,2,,,or 3 children and join. However after basic training is over i know persons including generals and majors with 6 children. Personally i think there pay ***** and they dont want someone in the army collecting food stamps,,,lol. bad image.",
            "post_id": "5259145",
            "timestamp": "1263285742",
            "votes": 0
        },
        {
            "answer": "http://www.youtube.com/watch?v=bzdhBo4pbgEcheck this out",
            "post_id": "5323218",
            "timestamp": "1264818338",
            "votes": 0
        },
        {
            "answer": "hi im 16 and now know what a load of **** all theese rules actually are. diabetics can do anything that a no dibetic could. personaly the **** that said he wouldent get on a plane if he new the pilot was diabetic is actually talking rubbish. its like saying that u wouldnt fly if the person dint come speak english or if it was a woman. i could easly pas any physical test given to me that a normal person could pass.whats worse an i cant also give blood/organs. tbh i would rather be diabetic than diei also can go ski diving",
            "post_id": "5482942",
            "timestamp": "1268947546",
            "votes": 0
        },
        {
            "answer": "I'm 27 and have had type 1 for 26 years. When I was a kid, it was my dream to be a Naval Aviatior. Too bad I can't join the military or fly commercially. I did what I thought was the next best thing. I became an Aircraft Maintenance Technician. (By the way, you CAN fly a plane as a diabetic, as a sport aviator) Quit looking at all the negatives and the \"woe is me, i have diabetes, they wont let me\". If you keep thinking like that, you or your kids and your loved ones that are affected with diabetes are skrewed. life will knock your **** in the dirt, with that attitude. Instead of crying about what you cant do, find out what you or your child excell at, and be great at that. Believe it or not, Diabetics are PERFECTLY DESIGNED TO BE ATHLETES! I personally excell at being a physical trainer, martial arts, powerlifting, olympic lifting, running, parkour, and any other physical activity you throw at me.As a commercial pilot, you sit in a chair all day. In most aircraft, the pilots job is LIMITED at best, and the pilot is nearly unnecessary.As a truck driver, you sit in a chair all day.In the military, you get killed.Quit crying about what you CANT do, and figure out what youre great at, and excell at that.",
            "post_id": "5499686",
            "timestamp": "1269396864",
            "votes": 0
        },
        {
            "answer": "can  people with diabeties be a police officer because that is what i am hoping to be",
            "post_id": "5522909",
            "timestamp": "1270004693",
            "votes": 0
        },
        {
            "answer": "Im 23. Diabetic for 8 yrs no major problems with hypos. I recently got accepted to be a aviation fire fighter passed my medicals and was cleared to take part in recruit course. Half way through the course i was removed because of my diabetes.. I had passed all physical tests and my instructors said as long as i continue with my performance i will not have a problem passing the course. There were people on the course that had not passed all physical tests and they were allowed to continue. I am currently awaiting a decision to be made if i can continue on the next recruit course. In which i would have to start all over again. I do understand the requirements you must meet in order to get some of these jobs as being a diabetic puts you at risk. But i feel that its not that much different if a non diabetic wasnt looking after themselves not eating wouldnt that put them at risk as well.I honestly dont feel that there is anything out there that i wouldnt be able to do as good as a non diabetic. With the exception of perhaps front line in the army.",
            "post_id": "5944626",
            "timestamp": "1279857949",
            "votes": 0
        }
    ],
    "post_id": "2430042",
    "question": "My question is, who has the right to say an insulin dependent diabetic will have poor control of their diabetes? Question is because I have recently found out my Type 1 diabetic son will not be able to join the military, become an astronaut, drive a tractor trailer, fly an airplane or become a police officer. My son may have 60 plus years of great control. He may have 60 years of poor control. But no one will know this until it happens. In every single job I listed above, you have drug addicts working in them positions. But they are disciplined when they have a positive drug test. So why can't the same be done with an insulin dependent diabetic. Who is to say they may have a low while on duty or while driving or flying? How can that be an assumption? Do these people truly believe every single insulin diabetic will have one or many lows in their diabetic lifetime while working? I can totally understand their reasoning, but who is to say they will have a low while on duty?",
    "timestamp": "1115010000",
    "title": "Jobs Diabetics Can Not Have"
}