{
    "answers": [
        {
            "answer": "Most statistics at this point predict that type 1 diabetes shortens the lifespan by about 15 years. Of course, this is stated from data averaging the lifespans of type 1 diabetics up to this point. I, like you, am a long-time type 1 diabetic (37 years), and, in my affiliation wth the Juvenile Diabetes Research Foundation, I am in contact wtih many other type 1 diabetics and parents of type 1 diabetics across the country. I have noticed a growing number of type 1 diabetics opting for very tight control of their glucsoe levels (many patients are now using either the combination of Lantus and a quick-acting insulin such as Humalog or Novalog OR pumps, both of which seem to be helpful in acheiving very normal hemoglobin a1c numbers. I frequently hear now of type 1 diabetic patiens wtih a1c numbers in the mid- to upper-5's and low 6's, something unheard of even 10 years ago with treatments that were available then.Furthermore, many endocrinologists have lowered what they consider to be \"normal\" glucose ranges and are encouraging patients to attempt to keep pre-meal glucose levels under 100, which was again not really possible a few years ago.So my prediction is that this statistic will cease to be accurate in coming years, for the cause of complications is higher-than-normal glucose levels. If new treatments are able to keep patients' glucose levels within normal levels without risk of severe hypoglycemia, I believe we will see diabetics living longer lives. Unfortunately, it takes a generation to prove this, so stay tuned.Alas, I have  no percentages for you, for in order to have percentages of type 1 diabetics using certain treatments or living 40 years or longer, there would have to exist some central database of type 1 diabetics. No such tracking exists now. The best answer I can offer is the lifespan 15 years shorter than normal vaue that current records show. This statistic is of course taken of folks who have already lived their lifespans (folks like you and I cannot be tabulated yet since no one knows how long we will live), and does NOT reflect at all people whose lifespans have included treatments with pumps and newer insulins made available in recent years. Those records will show up a generation from now.We do hear from many long-timers such as you and I... there are many of us out there, but again I cannot offer percentages without having all endocrinologists logging their patients into one central database.As for the most common treatment, diabetics contact the Juvenile Diabetes Research Foundation's Online Diabetes Support Team daily, and we see many using Lantus and many using pumps these days. However, we also hear from folks still content wtih NPH or Regular or other insulins that were the standard  a few years ago, for each person's schedule and needs are different. Most doctors nowadays attempt to find the best match of insulin regimen for each individual's life and habits. Variation is good, for we can find the system of care which works the best for each of us wtihout attempting to fit all people into one or two molds.",
            "post_id": "2429722",
            "timestamp": "1097038800",
            "votes": 0
        },
        {
            "answer": "Hey SGG - I have a quick question for you. Since we will probably find a cure in about 10-15 years, will a teenager such as myself, being 16, have long term effects of diabetes down the road still? For example will my period of twenty years of diabetes carry long term effects, even though I'm cured?'One more thing...I've read about some diabetics being impotent. If I am cured before encountering that dilemma, will I be okay with that issue? Or is there still a risk of me becoming impotent still? I keep fairly good control of my diabetes.",
            "post_id": "2433820",
            "timestamp": "1097125200",
            "votes": 0
        },
        {
            "answer": "Pat, these are good questions. The answer is that your condition after a cure is going to depend on your condition BEFORE the cure. If you can keep tight control over the glucose numbers now, you minimize the chances of damages (studies have proven this over and over again). This does not take a scientist's knowledge to understand, for ALL of the complications are rooted in the same thing: high levels of glucose damage tiny blood vessels carrying blood to nerves and organs, and therefore these nerves or organs themselves can be damaged for lack of proper nourishment. This is the  Diabetes 101 explanation, for of course there are more complex medical things that happen that can cause damages, but the fact remains that none of the damages will happen if glucose levels are normal. So we protect ourselves by working to keep the glucose levels from rising above the normal levels after meals as much as possible. And when they DO rise because we goofed on a carb count or activity level, we try to lower them as soon as possible before they damage us.If a person has suffered severe complications and then is cured of diabetes, those complications do not magically go away, for the damage is already done to the organs or nerves. It IS true, however, that people who suffer complications do seem to improve some by tightening up glucose control, so the body is able to repair itself somewhat if damage is stopped early. Each case is unique, of course.Now, not all diabetics suffer complications. I, for example, have been on insulin for 37 years and have no damages, even though I was diagnosed long before good control was even possible, for in my early years of diabetes, we did not even have glucometers! Some people seem to genetically be blessed with some sort of resistance to damages, while others seem to be more prone to the damages. We cannot control our genes, but we CAN control the numbers we live with daily and we CAN test often enough to know when gluocse levels are rising and take insulin to lower them back to the normal ranges. I frankly beleive that frequent testing is the real root of good control.So as far as impotence is concerned, this is caused by nerve damage, and keeping good glucose control will protect you from this complication.A case in point here... a year or so ago, I unfortunately caught the flu, having not been able to get a flu shot until I actually caught the flu. I was ill for about a month, and glucose levels were elevated above my usual very tight control. A month or so later, I had my semi-annual eye dilation and exam. The eye doctor saw a couple of tiny specks of blood in the back of the eye, the first signs of possible hemorrages. Of course, I wondered if my lifelong wonderful health was about to end. At this point, my flu was gone and I was back to my usual excellent control. My eye doctor re-scheduled a visit for three months later to see what would happen. Would the hemorrages be bigger or would they go away? Well, three months later, they were completely gone, absorbed by my body the way a bruise is absorbed as the blood is carried away from the damaged area. The point of the story is that tight control HELPS your body heal itself, and even though my control was not awful while sick, just that slight elevation of glucose levels was enough to cause blood vessel damage during the time I was ill.The hard work does pay off, and I am living proof of this fact. 37 years after the original diagnosis, my health is as good or better than any other woman my age. Diabetes in and of itself does not cause damage -- high glucose levels are the cause of the damage, and this we can prevent by testing often and taking appropriate insulin. Diabetes does not automatically doom you to have higher-than-normal glucose numbers if you test often and respond to the numbers you see on the meter.",
            "post_id": "2433822",
            "timestamp": "1097125200",
            "votes": 0
        },
        {
            "answer": "Wow, that was very nice of you to respond with that length. That was wonderful reading. I appreciate it. I wish you the best of luck with your control in the future.Pat",
            "post_id": "2433823",
            "timestamp": "1097125200",
            "votes": 0
        },
        {
            "answer": "Dear ursamere and Pat,Thank you so much for contacting the Juvenile Diabetes Research Foundation.We are all volunteers here and are not physicians, but we can give our life experiences dealing with type 1 diabetes.I completely agree with SSG's information. There is not much that I can add, but to try to encourage everyone to maintain as tight control of your blood sugars as possible. JDRF's main focus is to fund research for a cure and to help with the complications that can happen.ursamere and Pat, my aunt developed type 1 at a very young age around 1935. It is amazing with the lack of knowledge and treatment back then that she lived this long, but she lived to be 100 years old. I know that this is not the norm, but we do not fully understand how gentetics can play into complications and longevity. I agree with SGG that as tighter control is maintained by those with type 1, the lifespan will expand. There is no hard evidence of this yet, but the research seems to confirm this.As far as a complication with impotence, this is a very viable question. It is a possibility, but there are medications that can help if it occurs. Pat, I am not talking down to you in any way. You are asking intelligent questions and commenting with very responsible answers. Not to mention, very brave in asking a question that is not normally discussed and should be. I am hoping this is a general question in anticipation of your future life. If it is not, I would highly recommend that you speak to your doctor or if you can, a parent. I would like to see you continue with comments here.Please continue to respond and let us know how you are both doing.dm",
            "post_id": "2433828",
            "timestamp": "1097211600",
            "votes": 0
        },
        {
            "answer": "I wonder if anyone has any advice about neuropathy and how to deal with it?  My partner has suffered from various complications during his 42 years with Type 1.  He is 46.  The latest problems relate to peripheral neuropathy in his hands (and, less so, his feet).  They are either burning very painfully or numb and he gets very upset about this, not to mention the fact that it reduces his everyday quality of life.We live in the UK and he has been given tablets which are supposed to take the pain away.  The doctors simply offer the advice that he should take as many as he needs to relieve the pain (they're receptor inhibitors I think) but he's reaching the point where no matter how many he takes his hands still hurt really badly.Does anyone know of any other effective method of helping with this problem (other than surgery)?  We would be most grateful.",
            "post_id": "2433965",
            "timestamp": "1101362400",
            "votes": 0
        },
        {
            "answer": "STOP EATING CARBS....EAT STEAK, FISH, BERRIES, NUTS,not cereals like Ian Botham says eat!!! what a wally!!!Love you all guys...",
            "post_id": "4484409",
            "timestamp": "1242870444",
            "votes": 0
        },
        {
            "answer": "hiI am 16 and have just been diagnosed with type 1its been about 3 weeks and my blood glucos levels are already quiote in control, when i was admitted to A and E it was 30 and now it is normally between 5 and 6 before meals and about 7 before bed time.The only problem is that i often have hypos shortly after my meals if i dont eat enough. They are really easy to treat though and i have never had one below 3. I wanted to know if these hypos have an effect on my long term health just as the high blood sugars do or if they only put me in the immediate danger of hypoglacemia, of which i am managing to avoid quite quickly. At the moment i am happy with my blood sugars and don't really mind hypos because i can easily spot the sign and always carry something with me to treat it but if it is doing me long term damage i will have to think more about adjusting my insulin.",
            "post_id": "4693209",
            "timestamp": "1248456380",
            "votes": 0
        },
        {
            "answer": "About the lifespan, nobody really knows. I was diagnosed in 1964 (17 months old)when doctors knew very little about juvenile diabetes. My mom had to squeezed diapers to be able to test my urine and results were not that accurate. They told her that they couldn't guaranteed that I would make it to 5yrs old but if I did the average was 20 yrs old. Growing up my sugar was almost always high but I was healthy and rarely got sick. Something that really puzzled my doctor. 45 yrs later I'm here, alive and with very little complications. Why??????????? I don't know, I guess God has a plan for me and I'm very thankful. I've known other diabetics that have had a lot of problems in a very short time. Could it be the genes???? Now, I have to tell you that I have been taking natural products like nutrients and probiotics for the past 10 yrs. A lot of doctors don't want to believe in these products but I do. They help me and make me feel much better. I hope this help everybody.",
            "post_id": "4889022",
            "timestamp": "1253417904",
            "votes": 0
        },
        {
            "answer": "My father, who was raised on a farm and was wasting away with an unknown illness, was finally taken to a doctor and diagnosed with juvenile diabetes in 1940.  They caught it just in time.  It was assumed that he would not live too long.  However, he takes care of himself and next year, after he turns 80, he will have lived with Type 1 diabetes for 70 years.  And he will live a lot longer than that, I am sure.Given that he was diagnosed late and that he started treatment in the early 1900's and has an already respectable lifespan, imagine what teens and young adults can look forward to with the newer knowledge and treatments.",
            "post_id": "4937923",
            "timestamp": "1254596602",
            "votes": 0
        },
        {
            "answer": "I would like to hear from other people  about what life event may have occured in their lives prior to being diognosed with type 1 diabetes. I want to know what triggered this. Maybe it will give me insight.",
            "post_id": "5213996",
            "timestamp": "1262100478",
            "votes": 0
        },
        {
            "answer": "Hello,My husband was diagnosed with Type 1 at age 29. Thanks to Lantus, Metformin and a very smart diet he has his numbers under control & very rarely has issues. We had our son just months before he was diagnosed and had always planned to have a second child. Now we have reservations about growing our family.What is the lieklihood that our children will inherit the disease?Would it be irresponsible to try for another child?How do other couples make this decision?Thanks,Confused Mom",
            "post_id": "6198521",
            "timestamp": "1285861083",
            "votes": 0
        },
        {
            "answer": "Im 16 and I have type one diabetes as well, I was diagnosed about a year ago and my numbers are, its safe to say, always in the correct range if not they're never over 140 I sometimes feel my doctors made the wrong diagnosis but I assume I'm one of the lucky ones that still in the honey moon phase.My only problem is the whole drinking alcohol situation, my boyfriend and I used to enjoy going out and drinking with our friends but we did so responsibly. I hear all this about drinking making your blood sugars extremly low but the first time I drank with diabetes they were high all night, and I was actually dosing to keep them in target which was strange because I was only drinking beer.I wondering what the damages could be and why my blood sugar doesnt fall extremly low?does anyone know the actual risk drinking with type 1 diabetes poses?",
            "post_id": "6528908",
            "timestamp": "1294611226",
            "votes": 0
        },
        {
            "answer": "Hi, good question. Have been type 1 for 30 hrs which doesn't actually feel that long until you tell people and they look at you like you should be either dead or crippled with complications. Surely now aged 42 is still a young age diabetic or not. I had spent early 80 s with high sugars and only lately had Good control due largely to the dexcom continuous monitoring which has been life changing. Still on shots as think pump restricts freedom. No complications to date. Ps kellymeisters post about his dad reaching 70 yrs with type 1 is a great uplifting post to put on here. Thankyou and look forward to posting again 2050",
            "post_id": "6555966",
            "timestamp": "1295312226",
            "votes": 0
        },
        {
            "answer": "This all makes interesting reading. I first diagnosed with diabetes when I was 4yrs. The doctor told my parents I wouldn't live past 12 years, then later on it was 20 years, now I am 65 old. Had type 1 diabetes for 61 years,It was sheer hell from the start, as insulin was only something you read about, so it was all trial and see how you go. The insulin was called Zinc Suspension and if it got cold it would Crystallize in the bottle and block the needle which was a bast--d. What made it worse I had only one needle which I had to sharpen myself on a oil stone. The needle were not like todays one (lovely and fine), you had to stick a wire through it to keep it clean.Testing was done over a myths burner using urine, and did it stink. Blue meant  you going to have a hypo and orange was you had to much sugar so there wasn't dinner for me that night.That was controlled by cutting back on your food intake, later by insulin.I have had a active life, done just about everything,to many to mention. At present do Blokart sailing and some Segway riding, plus 4 wheel driving.Married with 3 children, know diabetes amongst them as of yet, youngest is 32 years old.I have all functions but there is the old sign that will be need to look at.",
            "post_id": "6759645",
            "timestamp": "1300867712",
            "votes": 0
        },
        {
            "answer": "I am 71 years old, and have been a diabetic since age 12.  I am still in good health.  I test often and if my blood sugar is high...I take insulin to cover it.   I eat about the same thing everyday.  I always test before eating.I don't know if I am lucky...or because I do take care of myself have managed to put off complications.",
            "post_id": "9723662",
            "timestamp": "1386191087",
            "votes": 0
        },
        {
            "answer": "I have had T1D for 63 years & have had a couple of micro spots in my eyes & in the past have cleared up. My A1C runs an average of 6.5 plus/minus. Getting sick for a period of time does carry stress with controlling your diabetes but the best thing to do is keep as tight a control as you canMac MacKenzie",
            "post_id": "11967262",
            "timestamp": "1423440644",
            "votes": 0
        },
        {
            "answer": "I have had T1D for 63 years & have had a couple of micro spots in my eyes & in the past have cleared up. My A1C runs an average of 6.5 plus/minus. Getting sick for a period of time does carry stress with controlling your diabetes but the best thing to do is keep as tight a control as you canMac MacKenzie",
            "post_id": "11967273",
            "timestamp": "1423440800",
            "votes": 0
        },
        {
            "answer": "Congratulations on doing so well.I think having tight control is really the key.Thank you for sharing.",
            "post_id": "11968525",
            "timestamp": "1423453014",
            "votes": 0
        },
        {
            "answer": "I avoided a pump for years but they have perfected them & in my opinion gives you a huge amount of freedom than taking injections. You do have it attached to you but listing below some of advantages for me. I am very active & have been T1D since 1951.1. Being very active you can adjust your Basel to match your activity &not  have to eat constantly. .2. I replace my infusion set every 3 days, it is like one injection instead of12, I used to take at least 4 a day.3. If you are sick you don't have a lot of insulin in you from the morning shot& take Bolus as req. of stop insulin completely if you have a stomachvirus.4. On trips it is a godsend for controlling sugars.5. You do need to test & up to you how much but it is so simple to makeadjustments.6 I just carry mine in my pocket & is not in the way at all.7 My wife & do a lot of big game fishing in The Gulf of Mexico & backcountry pond fishing in the Adirondacks in NY.If any questions please contact me.Mac MacKenzieFt. Myers, FL",
            "post_id": "12000838",
            "timestamp": "1423862710",
            "votes": 0
        }
    ],
    "post_id": "2429721",
    "question": "I have had Type I diabetes for 40 years.  What is now the average life span for Type I diabetics?  What percentage of diabetics live for 40 years (or longer)?What percentage of Type I diabetes now use the Lantus/Novolog combination for control?  What is the most common treatment?",
    "timestamp": "1097038800",
    "title": "Life Span"
}