{
    "answers": [
        {
            "answer": "Hello wolfenastar,I am SO VERY SORRY for the loss of your daughter.  My heart goes out to you.  I am a mother of a diabetic child and cannot imagine what you are going through.Starsnrose knows what she is talking about since she has been there.  I hope the two of you can connect and be support for each other.Also, you might want to try this link:http://www.jdrf.org/index.cfm?page_id=103451Again, my heart goes out to you and I am truly sorry...SS",
            "post_id": "2430328",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "I am so terriby sorry for your loss.  I know this is an especially difficult time for you and your family.  I remember how I felt when I searched for an organization or group that I could communicate with after the loss of my son two years ago to type 1 diabetes.  He too was very young when diagnoised, one year old, and we fought the battle for years to overcome the effects of diabetes.  Two years ago I too came to JDRF and there were people who responded to my need to talk about my son and how I felt about the sense of loss in my life.  I hope you will allow JDRF to reach out to you as they have for me.  Right now, there isn't a forum setup just for bereaved parents who have lost their children (no matter their age), but I want to 'talk' to you.  I would love for you to tell me about your child.  What was her favorite thing to do?  How old was she when you lost her this week?  What was your favorite memory of her?  I have found that I just wanted to make sure my son wasn't forgotten.  I wanted others to know about him and I found that sharing the least piece of information about his life was very important to me.  I hope you will write me back and share with me how you are doing today.  I know you hurt.  I still hurt too, but I would like to be there for you.",
            "post_id": "2434559",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "firstly, thanks for responding.My daughter was/is 13 yrs old. She was type 1 diabetic since she was 5 yrs old. She loved to do so many things, a typical teen. She had moved in with her dad late last year, so it has been difficult to keep up with her. She loved to go swimming, read and write peotry, draw, spend time with her friends and her kittens, she loved to shop, talk on the phone, use her computer. She was about to enter 8th grade, which she loved school and did very well.I think my biggest memory with her was when i would pick her up for the weekend on sat. we would go out and run errands and she would just go on and on, talking about all sorts of things. I would tease her that she didn't know how to not talk, but it never bothered her she would just go right back to running that mouth. When i had enough i would reach over a tickle her to destract her. But we also had some serious conversations in the car as well. We spoke about her diabetes, boys, and other important things. I truly miss her.Her funeral was friday, and i couldn't believe how many kids were there. They put lots of flowers and little stuffed animals with her. She was/is loved by many.Thanks for an ear, it does help. How old was your son? The hurt never really goes away does it? I keep pushing myself to do normal everyday things, i do it for her. But i've done that her whole life, everything i've done i've done for her. But that's just being a mom.Well thanks for being here.",
            "post_id": "2434560",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "Hello again,I am going to find out if we can put you and Starsnrose in touch with each other in a way where neither of you have to post your email address here.I will find out and get back to you.SS",
            "post_id": "2434561",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "That is a beautiful poem.I am sorry for the loss of your son.",
            "post_id": "2434563",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "Ah, she sounds lovely and so like the typical teen.  I know you miss not being able to talk to her.  I still miss talking to my mom in that same way.  I lost her to cancer almost five years ago.Going on is tough, but we all have to make decisions about how we will do that, don't we?  Give yourself lots of time.  Everyone handles grief in different ways.  It is a real energy zapper, but that part is normal too so don't expect too much of yourself for awhile.  I have my daughter, son-in-law, and two grandsons to focus on and I feel so blessed to have them. My son was 33 years old when we lost him.  Unfortunately, over the years he chose paths that were not healthy for him and that led to diabetic complications to manifest much quicker.  He died of end stage heart and kidney failure and was completely blind in one eye and nearly so in the other eye.  I loved my son very much and wish I could hug him right now.  He was a very gifted person who loved music, art, and people and loved to laugh.  We used to love to go to movies together and he was thrilled with technology and how to combine it with his love of art and music.You are right about the pain never going away.  It does lessen however.  It is one of those things that people do not fully understand unless they experience the pain themselves.  Of course, I would never wish this on any parent and I suspect you would say the same.  I have a poem I carry with me in my paper organizer that addresses this very thing.  I don't know who wrote it, but it goes:My Mom is a SurvivorMy mom is a survivor, or so I've heard it said.But I hear her crying at night when all others are in bed.I watch her lay awake at night and go to hold her hand.She doesn't know I'm with her to help her understand.But like the sands on the beach that never wash away..I watch over my surviving mom, who thinks of me each day.She wears a smile for others...a smile of disguise.But through Heaven's door I see tears flowing from her eyes.My mom tries to cope with death to keep my memory alive,But anyone who knows her knows it is her way to survive.As I watch over my surviving mom...through Heaven's open door,I try to tell her that angels protect me forever more.But I know that doesn't help her or ease the burden she bears.So if you get a chance, go visit her... And show her that you care, for no matter what she says...no matter what she feels,my surviving mom has a broken heart that time won't ever heal.I know your heart is hurting and mine hurts for you.",
            "post_id": "2434562",
            "timestamp": "1126069200",
            "votes": 0
        },
        {
            "answer": "Wolfenastar and Starsnrose:  As the mother of an eight-year-old Type 1 diabetic, I wept when I read your stories and admire your bravery in the wake of such heart-breaking losses. You both sound like such wonderful mothers, and I can't even begin to imagine how wrenching this must be for you.  Wolfenastar -- had your daughter been suffering a lot of complications?  It's such a scary disease...",
            "post_id": "2434564",
            "timestamp": "1126155600",
            "votes": 0
        },
        {
            "answer": "The poem is very touching and hits at the core. Thank you.My fiance has a duaghter who will be 4 yrs old, they help to keep me going. My duaghter was an only child, she always wanted a sister.Your son sounds like he was a good person, probably got that from his mom. So sorry he's gone.Annalise...She really hadn't had many complications. She had problems getting her sugar levels steady. She was always running 200 or above. She had a condition when her sugar dropped to low, i forget what the doctor called it, but when it dropped really low she had these symptoms much like a stroke. She would totally lose the function of her entire right sight side, throw up and sleep, then when her sugar came up she had massive migrains. But when her sugar went to high she would often start throwing up and sleeping until her sugar came down. She once had a kidney infection and was on a thyroid pill for a while. But that's the only complications she really had. Just high sugar levels.I had to go to my doctor today and he explained to me that what probably happened was that she entered ketoacidiosis from her high sugars which lead to her brain shutting down. But i take comfort in the fact that she passed in her sleep.",
            "post_id": "2434565",
            "timestamp": "1126155600",
            "votes": 0
        },
        {
            "answer": "Dearest wolfenastar,As a mother who is going through my own fear of losing my son from type 1 due to complications, my heart is breaking for you. I can't imagine your pain, but I am so proud that you have the courage to reach out for help. I can't possibly understand what you are going through and have been happy with the special responses that you have recieved. Starnrose is a wonderful mother and does understand what you are dealing with.I haven't lost a child, but I have reached out to family and dear friends for support during dark times and can honestly say I wouldn't have made it through it without them. Don't be afraid to cry and have someone hold you or just talk.This is the time that you need to let others take care of you.I would strongly recommend that you contact our sister outreach program at www.jdrf.org and click onto the left side called Online Diabetes Support Team (ODST). This is a confidential one on one online communication. You would be matched with a volunteer who is going through similar circumstances. You may also want to contact www.childrenwithdiabetes.com. This is also a wonderful site that has chat rooms and great support.I wish you the very best through this terrible journey and hope that you stay strong and recieve the help and support you so desperately need. You are in all of our thoughts.Please keep in touch,dm",
            "post_id": "2434567",
            "timestamp": "1126155600",
            "votes": 0
        },
        {
            "answer": "Thank you all for your kind words.  It does help to correspond with other parents who do understand.  I know it is difficult for parents of diabetics when they are confronted with their worse nightmare.  I try very hard to be mindful of that fact when I correspond with other parents.  Fear can be powerful and I had to choose long ago to make an effort to overcome my own fears for Kyle.  This, of course, was not a one time effort.  As you well know, it is daily and sometimes hourly.  Fear can rob again and again.  Loss causes us to realize more clearly what is most important.  Hug your babies right now, keep on doing what you know is right, and please don't sweat the small stuff.  It is, after all, called \"small\" for a reason.",
            "post_id": "2434568",
            "timestamp": "1126242000",
            "votes": 0
        },
        {
            "answer": "Dear dear wolfenastar,I too wept when I read the recent loss of your precious daughter. I think this impacts us all, and especially as you are having to live through your worst nightmare and ours. I am so, so very sorry and can only pray for you and your family. I think we all wish we could re-run that and bring your daughter back.I think that a number of us fear for our diabetic children (with good cause), and your tradgedy will have sharpened our focus, on what is important.When my older kids read your post, they started to affirm their appreciation of and to their siblings. I so wish you were not going through this, but I do thank you for sharing.God bless you, and may your precious daughter rest in peace.Nicole",
            "post_id": "2434571",
            "timestamp": "1126501200",
            "votes": 0
        },
        {
            "answer": "I have a son 12 (type 1 dxd 10) . I read the poem and it brought back so much for me . My daughter was killed in 1991 in a fire. She was almost 3 at the time . Needless to say it is still devastating for me .When my son was diagnased 3 years ago I thought how can one family be given so much to deal with . the words she wrote were so beautiful and true. When you lose a child you lose a part of your future , you go on because that is the choice you have. When poeple tell me \" you are much stronger person then me\" I tell them I do the best I can with what I have been given.What else is there?Any time you want to talk let me know I have been on this road for a while( 13 years and counting ).take care,Christine",
            "post_id": "2434581",
            "timestamp": "1127192400",
            "votes": 0
        },
        {
            "answer": "Christine,Thanks for allowing yourself to be so transparent.  When we do that, we allow ourselves to be used to help those around us.  I am so sorry about the loss of your little daughter.  I know your pain must have been so great!  Loss is loss, whether it is sudden (as in your case) or it takes years (as in my case).  You are so very right about doing the best you can with the knowledge you have in the moment.  It truly is what you do with it that counts.",
            "post_id": "2434589",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "My prayers and thoughts are with you!!  I did an internet search this morning and came across this site.  I have a 14 year old daughter diagnosed with Type 1 two years ago.  In the beginning and until recently she was very good with her diabetes.  Watched everything that she ate, kept accurate records of her bg recordings (she would check up to10 times a day) and just overall monitored her health to try and prevent the complications associated with diabetes.However, this year she started high school.  She is a big boned beautiful gir.  About 5'7 and weighs approx. 140 lbs.  Most of her friends and the petite little girls and I think she feels big next to them.  I have pretty much left her to maintain her numbers and her corrections because she has always been so good with everything.  Last week I had to get on her to get her numbers together so I could fax them to the doctor.  She has been talking about how she is losing weight and is enjoying it and I told her to not try and achieve it by letting her bg get out of control.  She assured me she was not.  I noticed last night that she only had a small portion of food on her plate and I sent her into the kitchen for more since it was barely enough for a baby. Normally I fix her and her two brothers plates every night.  Well this morning I decided to check her meter machine because she has been so quick with testing and  giving her insulin at each meal.  I found that she is only checking like twice a day.  She did not check this morning yet she ate breakfast, gave her 24 hour insulin and went to school.  I am totally freaked.  After everything she knows about diabetes and the complications it just stuns me that she would take such chances.  She has only went to the hospital on one occassion since being diagnosed and that was for high bg and high levels of ketones.  After fluids they sent her home that afternoon.Any suggestions?  People have told me that the \"good girl\" syndrome would wear off and she would rebel.  I have had her read the book called \"Needles\" which clearly shows how not caring for yourself can let your diabetes get our of control.  I am just speachless.  I know dealing with this disease is terrible for all involved but I need her to realize that we could loose her to this if she does not get a grip!!",
            "post_id": "2434676",
            "timestamp": "1129611600",
            "votes": 0
        },
        {
            "answer": "Dear Crazed Mom,I truly understand how you feel!  I have been where you are and have a few words of wisdom gained in the worse possible way from my experience.1)  Take a moment to think about how you will react to your daughter's new behaviors.  I understand the feeling of panic you are experiencing right now.  If she senses that panic you may well fuel her need to act out her normal, teenage rebellion.2)  Talk to her endocrinologist.  He/she should be aware of this situation and should offer you assistance in the form of counseling and/or special programs for teenage diabetics.3)  Find someone your daughter can relate to who will be a good mentor for her.  A relative, someone at church/synogogue, someone your daughter admires....  THey don't have to be diabetic.4)  Contact the Juvenile Diabetes Research Foundation online support team.  They will put you in touch with someone in your same situation who will help support you during this challenging time.5)  Hang in there.  Do the best you can and never give up!",
            "post_id": "2434681",
            "timestamp": "1129698000",
            "votes": 0
        },
        {
            "answer": "Dear starsnrose,Thank you for the advice.  My daughter and I had a talk and she admitted that she had backed off from the frequent bg checks but did show me her other meter that she was keeping in a new place with more readings.  This did help to ease my mind.  I explained to her how much I love her and want her to be around for a long time.  She said that with high school starting and everything that she feels she does not have the time she use to have.  She and I agreed to get a grip on everything and do the best that we can.I am very glad that I found this site.  This helps to see that others have the same questions as I do.I truly thank you,",
            "post_id": "2434682",
            "timestamp": "1129784400",
            "votes": 0
        },
        {
            "answer": "I am so glad you had that talk!!!  I was worrying for you all.  Please don't hesitate to ask your questions on this forum.  We have all either been there or are there now and need to help each other as much as possible.",
            "post_id": "2434683",
            "timestamp": "1129784400",
            "votes": 0
        },
        {
            "answer": "I was having a bad night so I did an internet search and found the posts. I am 35 years old and have been a type 1 diabetic for 27 years. I am pretty healthy besides the fact that my blood sugars are pretty high. I found your posts because I lost my 12 year old nephew 5 years ago. It has changed my life and has changed the way I take care of myself due to the guilt. My nephew, John, became a diabetic when he was 4. We were the diabetic club. I have a son that was born 2 months after John and I have two younger sons, John was one of my boys. I took care of him and we understood each other like no one else could. Being a diabetic is not easy and living with it is even harder. John was healthy and had no complications what happened to him happened quick. We both had/have the insulin pump. I miss my nephew and I feel so much guilt for not being able to save him. I am so sorry for your loss, I am here if you need to talk or would like to be in touch with my sister.  5 years... it has not gotten easier it has become different (I do not know how to explain that) I spend everyday thinking of him and doing thing in his memory, the holidays are very difficult and his 18th birthday just passed. Again I am so sorry for your loss.",
            "post_id": "2434750",
            "timestamp": "1132466400",
            "votes": 0
        }
    ],
    "post_id": "2430327",
    "question": "Does anyone know where there might be a forum or chatroom for parents who have lost thier child to diabetes. My daughterdies last monday, she'd had biabetes since she was 5. I'm just looking for others like me. Any help would be appreciated.thanks.",
    "timestamp": "1125982800",
    "title": "looking 4 where parents get together to talk after they lost child 2 diabetes"
}