{
    "answers": [
        {
            "answer": "Dear Sleeping Beauty,i understand very well how you feel. i'm a type 1 diabetic for 31 years now and i still go through similar things that you mentioned. i'll go through periods where my blood sugars are near perfect and then out of whack.i'm also a special case in that i don't always feel lows and was in a car accident a few years back and now don't drive being afraid that that may happen again behind the wheel.All i can say is keep on trying and look at it that a diabetic diet is really just a healthy diet and will help you stay in good health.i know it is hard but when your family and friends eat things you shouldn't try to stay on course and think how much better you are living over them.god bless, bret",
            "post_id": "2430486",
            "timestamp": "1132293600",
            "votes": 0
        },
        {
            "answer": "Thanks Bret, 31 years is amazing...I am diabetic 4 years now and it feels like forever. A couple days ago I decided to change my outlook towards it...and try my best.When I got my driver's licence in the summer the first thing I thought about was road accidents...and the possiblilty of them. But I guess you can't worry about the future..only take care to prevent accidents. When Im on the road I try not to think of it.This week Im going to have my HbA1c checked, and hopefully have other tests done too.What is it like having Type 1 ? Were you ever a Type 2?My Doctor used to tell me that sooner or later I would become a Type 1..later in life. I understand when I come pregnant I will have to use insulin.Well hope to hear from you:)Thanks for replying.Take care.",
            "post_id": "2434748",
            "timestamp": "1132466400",
            "votes": 0
        },
        {
            "answer": "I think one of the tricks to living with a \"Diabetic Diet\" is drop the \"diabetic\" part, and don't think of the way that you eat as being on a \"diet\".  I've had Type I for 41 years, and I eat a healthy. I don't eat much Fast Food, and I keep sweet to an occasional treat - just the way anyone that wants to be healthy and happy should eat. :-)  You might want to check out the \"Diabetes Food Pyramid\". It's in the American Diabetes Association web site, and it's an excellent example of how to start personalizing a good, healthy diet that will work for you.http://www.diabetes.org/nutrition-and recipes/nutrition/foodpyramid.jspAs far as Type I and Type II diabetes is concerned.  They're really two different problems that seem to fall under the same heading.  Type I is an autoimmune disease where the body sees healthy tissue as a threat and goes about damaging/destroying it.  In this case, the pancreas is the target and eventually Type I's are no longer able to produce insulin.  Type II is usually a metabolic disease.  The body continues to produce some insulin, but the body seems to forget how to use it properly. All Type I's end up taking insulin to replace what their body can no longer manufacture.  Type II's can be controlled by diet and/or exercise, oral medications, insulin - in any and all kinds of combinations. Your doctor might be able to help you understand what he means by Type II becoming Type I.  He may mean that like some Type II diabetics you may eventually need to take insulin to help your body control your blood sugars.Hang in there!  If I can be happy and reasonably healthy after 41 years, you're going to do just fine as well. :-)  Since we're all quite human, just remember - there is no such thing as 'Perfect'in anything, and that includes living with diabetes - all anyone can do is the best they can.Bonnie",
            "post_id": "2434762",
            "timestamp": "1133157600",
            "votes": 0
        },
        {
            "answer": "Couldn't be put better....Thank you :)",
            "post_id": "2434769",
            "timestamp": "1133503200",
            "votes": 0
        },
        {
            "answer": "I am so thankful that I can hear these things...especially as you experienced what I am now going through....the challenges Ive to face at this age.Weekends for me are my only relaxation period...during the week I have endless law reports to do for uni..and it becomes stressful, and so I always look forward to my smoke. My running really helps with my outlook on diabetes.Recently, in the past 2weeks, I made a strong decision to ignore the temptation to eat after I smoke..(munchies), and thus far....I've realised it is truly mind-over-matter. It IS possible to ignore it !Being around people our age...friends and cousins..at parties, I think I have to learn to say NO to things that they eat. I'm very thankful that I dont like beer or any other alcohol except Merlot, (red wine)...and when I feel the pressure of school life...I like to indulge in a glass or two. I've tested myself many times after drinking red wine, and my BS was always lower than expected.Thank you for telling me about your ex gf. Believe me, I've done hefty research on marijuana use...its medical and physiological properties....and it all comes down to the person who uses it. For me, I hold firm to the belief that with herb, there is no such thing as Addiction....there is ABUSE. Too many young people Abuse this wonderful herb.....then they move to the angel dust..the crack cocaine. It won't happen to me. If I want to stop weed, I can stop tomrorow...sure I will miss it, but I wont CRAVE it like how people crave other drugs.Everyday I think I learn something new about diabetes...in terms of how I handle it with myself. There are days when I have it under such control....and other days when I'm in 200zone. I actually want to see a dietician and let him give me a strict diet to comform to. I want discipline..I want to handle it now, as I am young.Anyway, I want to thank you again for your words to me.I wish I had a diabetic friend, honestly, I always say it. Because whenever I facing my difficult moments...I can't relate to anyone here at my home...my family members only give pity...and pity is the last thing I ever appreciate.Take care boyGod Bless.",
            "post_id": "2434773",
            "timestamp": "1133589600",
            "votes": 0
        },
        {
            "answer": "Hey beauty. I'm in my late 20's, was diagnosed when I was a year old. No complications to speak of, thankfully, and I spent several years during childhood with AIC's that were well into the 8's, even a few 9's. My AIC are in  the upper 5's/lower 6's currently after I started pump therapy a few years back, but the most important thing I can tell you is exactly what the others have told you-keep your mind off of it and just eat right and exercise, and you'll be just fine.You're at a tough age, unfortunately. The weekends back in college were always difficult (Had to hold off on the beer at parties~). But I got through it just fine, beauty, and I'm sure you will, too.I would, however, probably think twice about the marijuana use, beauty. The addictive mechanism that goes hand in hand with this disease has always amazed me.Back when I was in college, I had the biggest crush in the world on Gwen Stefani of No Doubt~. They were knew back than. Than one night I literally found her twin and we started to date. A couple of months into the relationship, I told her that I was a diabetic. I believe she responded by saying, \"Cool, I am too.\" It turns out that she was a type 1, also.Within a couple of weeks after that, however, I had to end the relationship. One day when I was in class my roomate called up and said something to the affect like, \"Ah Kev, Liz stopped by and she's back in your bedroom, and I'm not certain about this, but I think that she might have been doing cocaine.\" I grew up in a smaller community, pretty innocent upbringing, if you know what I mean, and he did, too, so that was clearly a big no no. By the time I got back, sure enough, that's what she had been doing, and so things had to end at that point, unfortunately.A year later, I got teamed up with a great guy in an Econ class for a project. Again, after time it came out that he was a type 1. Eventually we went out one night, and that was the first time in my life that I ever witnessed an individual literally consume a 24 pack of beer over the course of a few hours and behave like he hadn't had a single drink all along.My brother's friend is also a Type 1-he's a full fledged alcoholic, and we believe he could be a marijuana user, too.At a personal level, I've only been drunk a few times in my life, and that was back in college. Personally, however, I am certain that there's an addictive mechanism involved w/ diabetes. Whether or not it's the insulin level's effect on Serotonin (Insulin is thought to increase Serotonin), I just don't what it is, but I can admit that even after those few times I was drinking, I felt WAY TOO GOOD during that time, if you know what I mean. So I put an end to it right away, and I just don't drink at all now. As for the pot and those types of things, I've never tried any of that, but I would imagine that the same phenomenon would probably be at work in that type of scenario. I think the issue with most addictions is not the substance itself, but rather the personality. The \"Free spirit\" mode, etc. And that's why I stay away from all of that stuff, at a personal level. Deep down, I probably know that there's an addictive mechanism lying behind some areas of my personality.So while it may be true that a joint or two isn't going to hurt you in the way other illegal drugs may, I would probably try to to do everything that I could to stay away from that stuff, kiddo. If you do what you need to here on out, you're going to live a very long, normal life. And it sounds like you're doing everything you need to in most areas. As for the pot, though, I may only have a few years on ya, but I'm older now, you know, so I'm entitled to discipline ya here, right~?Bottomline for everyone living with this disease is that it could be a lot worse when you look around at the world, and 99% of the time our fate is in our own hands. Given the lifestyle choices of today's society, too, we might just come out ahead on a lot of this when all is said and done. I've watched many of those old college friends get lost into a world of addiction and/or poor health that's already starting for them in their late 20's/early 30's. So if we do things right, and just focus on what we have to do, rather than worry about this or that complication, etc, the odds are probably pretty good that we won't have to worry about those complications in the first place.",
            "post_id": "2434771",
            "timestamp": "1133589600",
            "votes": 0
        },
        {
            "answer": "No problem at all, ma'am. Keep us up to date on your progress, how everything is going for you from time to time. The people that run this board are excellent. I think one of the ladies on here has a daughter that's about your age, if I remember correctly, so don't be a stranger. They're here to help ya, and they're very, very good at what they do.Again, I'm a huge believer that the last thing any diabetic should do is to dwell on their condition. The attempt to monitor the blood sugar level throughout the day can really be a big stress source for many.There was a time a couple of years back that I spent a lot of my spare time researching this condition, and I learned a great deal along the way, no question about it. But the thing is that I'm a Biz Major, not a doctor, and so there came a point that I had to ask myself what type of good I was really doing. Coincidentally, it was during that timeframe that I had an AIC go up above 7%.A few months later, after I had some time to think back over things, I realized what type of role stress can have in this disease, and many others, for that matter. The society in general seems to be on the verge of its breaking point in today's world, and so it should really come as no coincidence that we're becomming unhealthier as time goes on.As for the \"Stringent control\" lectures that we've all had with this disease, it is not my place to speak over the head of any medical doctor, most certainly not.However, I do have to question at what point does some sanity enter the picture, too, you know. Clearly, anyone diagnosed with Type 1 or 2 Diabetes understands that they're facing a pretty substantial duty/choir in life. The greater society knows enough about this disease at this point to understand what needs to be done. We all know what we have to do, and what we can't do, etc. Taking it beyond that point, however, I think that sometimes the general philosophy of approachment may become a bit obsessive.A few years back, for instance, I had the first black out of my life. I've had my ups and downs with the sugar levels, but I've never, ever had anything like that happen in my life, let alone while driving. You're always very cautious when you're behind the wheel, as I'm sure everyone is aware of here. We still never fully determined what happened, but the suspicions centered around the 2nd pump that I had just started using that was later recalled.Anyway, this happened right in the middle of rush hour one morning, of all things. I figure I made it through about seven to eight miles of traffic, that's what I've managed to determine. And has been the case since day one with this, the Big Guy was with me that morning, w/o any doubt. I didn't hit any car, pedestrian, building~. The unbelievable part about it all is that I still can't remember a single second of what took place over that hour+.I finally came out of it, and soon realized I was sitting handcuffed in the back of a police car~. Eventually, they determined that I was a diabetic, most likely because of my insulin pump, I'm assuming, and so they called an ambulance down. My blood sugar reading was either 17 or 19, I think. They gave me a glucagon shot and everything was fine. Got the license back in the mail a week later after my Endo said everything was ok.After that event took place, right away I started thinking back to some of the lectures I had been given during my teen years that had associated the risks of low blood sugar levels and brain damage. After expressing these concerns to my doc, he was kind enough to ok an MRA and EEG, which came back perfect. Same goes for a neurological eval that he also referred for me to ease my mind about all of it. He's been the best Endo I could've asked for, so it's pretty important to get yourself established with an exceptional doctor. They're hard to find these days, but thankfully I'm really convinced that I've found the best one there is, you know.Last month I had my first EKG/Stress Test, and that was normal. All of the blood chemistry tests have always been normal, other than the AIC, of course. My TSH score is off from time to time, but that's moreless caffeine related, for my AB's and T subsets have always been normal. My eyes are perfect, no retinopathy to speak of. Kidneys/albumin/creatine, all normal.My point being, Beauty, is that for all of the dozens upon dozens of \"Lecture hours\" that I've gone through in life, none of it has ever proven true, and I'm convinced that a great deal of that simply has to due with the outlook that my parents helped me with through the years, you know?Of course, the day can always come when something shows up with the eyes, or neuropathy sets in, etc. I understand that, and if that happens it happens, and than you just deal with it at that point, you know. But even if that day were to come, we live in the best day and age there has ever been for helping out in some of those areas.For instance, if you have a yearly/18 month eye exam, Opthamalogists can prevent all cases of blindness now. They're about to approve open heart surgery as an out patient procedure, etc. The ACE inhibitors help to protect the kidneys, and they have about a half dozen other options in that area if the albumin or creatine level was to ever sneak out of place. With the stroke risk, diabetics tend to be more prone to ITT's than any other type of stroke, so even if something like that were to ever happen at least it's the \"Best one\" a person could have of them all, you know~.On top of that, alternative medicine is slowly creeping up to mainstream medicine in several different areas. A simple multi vitamin can do wonders. The sad thing about America is our lack of knowledge when it comes to the basics of nutrition. How many old grandmas do you know of that are unable to drive at night because they \"Can't see,\" for example.The truth of the matter is that poor night vision is the main symptom of a Vitamin A deficiency, and medicine knows that. What mainstream medicine doesn't understand, unfortunately, is that proper A metabolism depends on their being adequate stores of Vitamin E, and Vitamin E stores are dependant on there being enough Riboflavin in the system.Unfortunately, medical docs aren't taught about these aspects of nutrition. They believe, essentially, that if the B12 level is where it needs to be, all of the other vitamins are just fine. And they're right about that, partially, at least, because all of the B co factors do in fact rely on B12 one way or the other.But in cases like the one that I mentioned up above here, the lack of appreciation for the entire portrait at hand leads to mistakes. I'm quite sure, afterall, that 50 years, back when medicine first traced a Vitamin A deficiency with poor night vision, several studies were started involving supplementation of individual A or B. Carotene vitamins to patients with such problems, and none of them worked, so they gave up on the theory, moreless. When in reality, had they rather given grandma X some Riboflavin for a few weeks, than added on some E for a couple of weeks, and than finally given her the A vitamin, it probably would've worked. Sidney Baker, MD, professor from Yale says that it works, and he's about the best in the business.Unfortunately, the realities of the busy lives that our docs lead don't always allow them to be up to date on these types of issues, and that's where the computer can be pretty useful for some of us that take the time to look into some of these areas.Perhaps the biggest study in all of medicine took place a couple of years ago in New Zealand, of all places, one that involves your very condition. In that study, researchers decided to chelate copper (Gave Type 2's drugs to suck excess copper out of the system) for the purposes of cardio care/damage protection, and the results of the study were extremely successful. However, if one was to read between the lines far enough, you would notice writing that moreless confirms that a handful of these subjects were actually cured of their disease by such therapy.Traditional diabetes education has long praised the use of copper among diabetics in general, however, both type 1 and 2, so this study came as quite a shock to many. Furthermore (Unfortunately), I would bet you that only about 50 docs in our entire country are even aware of the study, even though it's available right online for all to see.It's a very exciting time right now in medicine, regardless of what type of disease a person may have. And unlike 15 years ago, mainstream medicine has a very big competitor chasing its tail, that being the alternative medicine field. And for some of those that may be skeptical about the \"Good intentions\" of today's doctors, don't be. As a matter of fact, a very prominent physician recently endorsed the use of beta glucan supplemenation in matters of those with higher cholosterol levels, publically saying that he believed beta glucans and/or red yeast rice was equally as effective for those with elevated lipids as the statin classes of drugs. Our medical docs are trained to be extremely cautious in terms of what avenues they go forth with in terms of any given treatment, and so they merely just need some time to sort through everything until they can get it all figured out for us.As for the neuro related complications that tend to go hand in hand with diabetes, researchers are now beginning to appreciate the role of individual B vitamins in such cases, and they continue to aggressively study the potential causes of such neuro related damage that may go outside the walls of actual glucose metabolism. I know for a fact, just based on my own research, that they continue to aggressively look into the roles of actual infections in such cases, those such as the Clostridium bacterias, Herpes Simplex, Asperigillosis, Lyme, as well as several others.In the meantime, you just have to enjoy life and appreciate every day that God's given to all of us. There's not a doubt in my mind that you'll pull through everything. You have the right attitude, and that, by far, is the biggest part involved in all of this. Good luck, keep us in touch with how you're doing.PS-Remember, beauty, I'm not a doc whatsoever, so it isn't my place to be giving medical opinions here~. But in the case of the Metformin, that's an excellent drug for Type 2's. However, if the day ever comes that you experience some legitimite GI related complications/distress, just ask your doc to keep an eye on the LDH #. He'll know what that means. If he ever expects that a little build up of lactic acid might ever be a problem, he may switch you to the newer Amayrl drug. That's not medical advise or a suggestion now in any way, shape, or form, kiddo. Just remember something along these lines if you ever get a sick stomach or anything like that, deal?Good luck, God Bless.",
            "post_id": "2434780",
            "timestamp": "1133848800",
            "votes": 0
        },
        {
            "answer": "Hey Bud..Just thought I'd let you know how things are.BS Control in the past couple days has been terrible...cause, whenever I smoke in the night...I eat a ton of food after, then fall asleep. This is probably the worse thing a diabetic can do...have extremely high BS while sleeping.My new year resolution will be to either completely stop binging on food after I smoke...or STOP smoking altogether.Its a learning experience..this stage of my life, I realise.I know I'm harming my body by doing this. But I want to overcome it, and be victorious. I dont like being defeated.Hope to hear from u.God Bless.",
            "post_id": "2434797",
            "timestamp": "1134626400",
            "votes": 0
        },
        {
            "answer": "Why smoke pot at all.  If you use it to wind down casue you are so stressed i see that as a problem.  My ex BF smoked pot from when he was 13 to 45 still I guess, he was always tired and never had much energy other than wish he had more of had money (self contractor only worked when he needed the money).he was also a type 1 like me.  His BS went all over theplace and his drinking on top of that made it even worse.He always said that smoking was no big deal he never bought it his freinds gave it to him.  my reply was 'if you have to have a joint to watch tv there is something wrong' and by that all he would do is sleep thought the program anyway.I don't get the feeling of smoking or the reason why drugs are so great.  Why do you have to escape your life in that manner?  why not just jumpoutta a plane or do something extreme in exercise the high is better.  At least you will be alive longer.",
            "post_id": "2434836",
            "timestamp": "1136354400",
            "votes": 0
        }
    ],
    "post_id": "2430485",
    "question": "Hello everyone...I'm new here. I like to read this forum, its very inspiring to know there are others, my age..who face smiliar issues with diabetes as I do.Every year..I've realised I go through a depressed/angry period with myself..because sometimes its very hard to control my blood sugar. I am a type 2, been diagnosed at 16, and I just turned 20.My family members cannot understand me...I dont expect them to. Sometimes I just eat like a normal person..I take tablets..Starlix and metformin. Usually I can control the bs for some days...then a few days later...Im in the 200 zone.How can I really become a serious diabetic?I smoke marijuana, because for me, it combines with my meditation and yoga..on a very spiritual level. I do not abuse it. Right now, I'm trying to avoid the urge of eating a lot after I take my smoke. I dont smoke cigarettes, and my alcohol intake is only Merlot(red wine).I am a runner 4 times for the week..and Im at my ideal body weight....130lbs for 173cm tall. My problem is control of the blood sugar, in an environment that is not very condusive for a diabetic. (having 5 other family members who eat everything).I would like to know...if there is a way to control urges. With yoga I've learnt clarity...but I cant seem to achieve control of urges. I can't EVER resist chocolates...ever.It scares me to know that in a few years...I will want children, and I know FULLY well if I dont maintain control continuously now...I will pay for it.So...I'm ready to heed to whatever advice I can be offered.Thanking you all in advance !",
    "timestamp": "1132293600",
    "title": "Maintaining Continuous BS Control...is it an elusive goal ?"
}