{
    "answers": [
        {
            "answer": "gmoney~whew!  such difficult issues here!  I don't want to sound like I'm preaching to you, but I'm a mom and have a 17 year old who has diabetes, and our family has had many discussions on the subject of partying!Let me first say that I don't have statistics handy to specifically answer your question about if pot effects diabetics differently than non-diabetics, but I will research that and get back to you.I can tell you that smoking marijuana effects your judgement and will impair your ability to make good decisions; doing so really puts you in a position to damage your health.  If you forget or choose not (because you're having too much fun partying or unable to make that decision) to take insulin to offset any food you eat you will elevate you blood sugars dramatically ~ that will damage your kidneys, heart and your nerve endings ~ not good things to happen for a diabetic.Being that you are so newly diagnosed, you should be strictly following your doctor's orders and learning how to live a healthy lifestyle ~ which doesn't include drugs and alcohol.  I know you're probably trying to ingnore the fact that you have diabetes, that's pretty normal, especially for a teenager who doesn't want to be different!  But the fact is, you DO have diabetes and if you don't take care of yourself starting NOW you will most likely have serious complications later.  I don't know whether or not your parents are aware of your drug use, but you might choose to talk with your endocrinologist (privately, if your parents aren't aware) to see if he has any information on marijuana's impact on the diabetic body.  Being as open and honest with your doctor is very important in order for them to be able to treat you properly.I didn't even address the issue of your age regarding drinking alcohol and the fact that smoking pot is illegal at any age . . . I know you know that, but I hope, given the fact that you have now been diagnosed with a chronic illness, you will take a look at how you're treating your body and change your habits.  Your parent's don't want to see you suffer from complications ~ they want a long and productive life for you, I'm sure!I will post again after doing some research for you . . . please let us know how you're doing ~ maybe we'll get some teens who will post comments about how they've handled these types of situations.  I wish you all the best!",
            "post_id": "2429141",
            "timestamp": "1068962400",
            "votes": 0
        },
        {
            "answer": "THanks very much for yuor responses, i read them and they made me think. WHen i brought up this topic, i dont mean that i smoke all the time, or that i do it consinstently. I held off the peer pressure for 15 long years, and its only after i was diagnosed, and when i go to a party i relaized i couldnt drink, that i tried marijuana.I was diagnoses in Late June, right when school ended, and when the partys started:(, Knowing very well i couldnt drink(yes i know its illeagle), i tried pot. I am very careful, none the less. I make sure i eat a full meal, and if i smoke, its after dinner, after all my inslin has been takin, and inbetween snacks. When im high, i dont get the \"munchies\" so i guess thats a bonus. But im usually carefull. Ive only done it about 4-5 times since then, and when someone offers me ahit, i almsot always reject it, unless i have it planned out.I am under very good control, i dont think i have had a high, or a low, in 3 months, and i am always quite careful about what i eat. My friends all know i have diabeties, and most of them are aware of what to do in a Low situation.But anyway, thanks alot, and any other comments or replys will be very mcuh appriciated, and i plan on using this site more often for qusetions and concerns.",
            "post_id": "2433006",
            "timestamp": "1068962400",
            "votes": 0
        },
        {
            "answer": "So happy to get a bit more info on your situation.  It sounds like you're doing a great job to be responsible caring for yourself and your diabetes.  It's good that, at most, pot is an occasional thing for you -- that also suggests that you might have other interests and hobbies ... and that's cool for several reasons :-)There are few situations more devastating than being at the wrong place/party at the wrong time when angry parents or neighbors or cops show up.  At that point, there's no amount of pleading that can protect you from those consequences.Sooo, at age 15ish now -- you're probably a sophomore?  Hope you're beginning to think about college -- at least a little bit.  Sure it's a coupla years off, but doing good stuff like sports or drama or clubs or volunteer work (which is very very cool for young people) in school can help add some pizzazz in addition to doing your very best in your school subjects.  I'm a college professor now.  :-)I'm also so glad you're interested to read stuff here.  Y'know, feel free to post comments when you have an opinion about other folks' comments or questions.  That's what we're all encouraged to do here -- so we can learn from one another.  Newbies (like you -- a new diabetic) and oldies (like me ~35 years!), teens & adults.  I think that PumpGirl who writes here is a teen, too.The www.jdrf.org site has PILES of info, too -- including some special links for teens.  Keep taking good care of you -- and great to find & keep close to trusted adults.  They'll help you navigate the rocky waters of growing into a strong young adult.  (While we adults on this site are a good source of info, in general, when I advise young people to find trusted adults I suggest they look in their school, church, neighborhood, family, etc ... real people who cannot trick teens or hide behind \"cyber-personalities.\")All the best, GMoney:-)",
            "post_id": "2433007",
            "timestamp": "1068962400",
            "votes": 0
        },
        {
            "answer": "Dear gmoney,My son was diagnosed at eight and had alot of issues with friends dealing with his diabetes.  When he was your age, he also tried pot once and awhile and found he couldn't tell when he was getting low.  Thank goodness he never had an episode that required medical intervention.  I just spoke with him about your question and dealing with friends.  He was lucky that he had a few very close people that really cared about him.  I'm sure you do too. On the positive side, my son gave me a different perspective on true friendship.  When he turned 21 he became the designated driver when everyone went to clubs to dance. He is very proud of this and his friends are greatful.  g, he also told me to tell you that while he is a little older than you now, don't let so called \"friends\" influence your behavior.  Your diabetes and health should be your number one concern. True friends will stick with you. As a Mom, if you find your having problems with drugs or alcohol, please tell someone your concerns. If you don't feel free to talk to your parents ( I hope you can), then maybe a councelor at school, your doctor or a helpline. Let us know how your doing and if we can help in anyway, we will.dm",
            "post_id": "2433008",
            "timestamp": "1068962400",
            "votes": 0
        },
        {
            "answer": "Hello GMoney,While I'm much older than you now, I can *really* relate to your question ... and your evolving maturity to even ASK the question.In general, this boils down to \"how can I have fun with my pals while managing this chronic, potentially debilitating (if I don't take care of me) disease?\"  I was diagnosed at about your age and I know it can feel lonely that you now have this extra burden that your pals don't (seem to) have.  Teens want to fit in with one another, and sometimes other teens don't yet have the compassion to be true friends.  You might already have had the experience of a \"friend\" dumping you for some frivolous reason, even before diabetes; often it's a \"cooler\" friend comes along, a rumor, or or or.When I was just a few years older than you and already in college, I used pot fairly often for \"fun\" times.  While the drug itself didn't seem to affect my blood sugar, it pretty well destroyed my judgment and willpower to say no to snacks.  Thus, it became harder for me to \"have fun\" cuz someplace in the back of my mind, I was so very scared.  Since I was older and my friends were, too, I was able to talk about my issues and I was SHOCKED to find out that anohter girl was dealing with a serious health issue, too and that on the whole they were very interested, compassionate and protective of me.  Of course, the hard-core partiers were threatened a bit my not wanted to continue on that path -- and gradually I realized that, despite my desire that they like me ... they didn't.How odd it seems (as a grownup now) that their so-called friendship was apparently only based on my wilingness to break the law with them, and to risk ending up in the ER \"for them.\"  I'm certain that THOSE folks would have been completely useless if I'd slipped into a coma from being either too high or low.I know from my own teen that \"warnings\" about what might happen in the future seem unrelated to what she & her pals think about.  She lost one friend to a DWI crash this year; another is forever mentally incapacitated due to a drug-related accident that didn't kill him but caused severe, permanent brain damage.  My teen has permanent facial scar and hip pain from a drug-related auto crash, where she was thrown from a car.The point seems to be that eventually, in our ways (thru tragic personal experience or thru the ability to learn from others' tragic personal experiences), we realize that lifestyles based on self-medication for pain, stress, and yearning-to-fit in ... they can never bring us happiness and success.Such happiness and feelings of success require us to deal a bit with our demons (teens have lots of them: divorces, step-families, fears in schools, wondering about the future, money, security) and diabetic teens face even more (will I die from this?  [not when we take care of ourselves :-)  ], will I feel better? what will my pals think? who ARE my real pals?  who'll help me when I need help?  who can I talk to about all this? ...I encourage you to find a trusted grownup in your life and gradually contront & work thru the things that're stressing you.  You can create a wonderful, rich, healthy life surrounded by PILES OF FRIENDS who care about you as much as you care about them and will BE THERE to encourage you thru the hard times and help you celebrate your successes -- wihtout risking danger.I hope you choose to take some of this to heart -- it comes from mine...",
            "post_id": "2433004",
            "timestamp": "1068962400",
            "votes": 0
        },
        {
            "answer": "Thanks for the postive comments. As for what i plan on doing in the future, i plan on going to film school. Me and my buddy's joke about how im alaways gonna be the desgnated driver, and thats fine with me, i would rater get home safe, then crash while drunk anyway. I know that in the future, i am able to have 2-3 beers while chillin with some buddy's, but i cant get drunk, which is fine with me, as i talked to a few of my clsoe friends today, who told me im not missing out on much. Most of my friends support me. Ive decided that if i go to a party with a few ppl, ill have my own kinda fun, ill sip on a beer, 1-2, ntohign to affect me in anyway, and just laugh at the drunks walking by, lol.I also thought id bring something up. I have a buddy of mine, who ive known for a few years, who is also a diabetic. I look at him as what NOT too do. He Drinks, Does Mush, Smokes Weed, Smokes Cig's, Dosnt care what he eat's, etc. I can see that guy going blind when he's 20. He crashed at my house one night, and his sugar before he went to bed was 17(i know u americans use it in higher ratings) While mine was 5. I just look at him, see what he does, and try to do the opiosit",
            "post_id": "2433009",
            "timestamp": "1069048800",
            "votes": 0
        },
        {
            "answer": "I smoke basically all the time (even in school) and i have type 1 diabetes. It's affected my motivation for school and my grades have fallen slightly but all in all its not changed my life. Ive been diabetic for 13 years (since i was 3) and i still went out and got absolutely steaming.For a while i was the one who was always sick, always a state and it was great. It didnt affect my diabetes. So then i discovered weed which i liked better, could control easier and had more fun with.I went to a party and got into trouble with police so my parents refused to buy me booze anymore. Weed waas easier to get hold off so i started blazing rapidly rather than drinking.Then i started drinking again and just this weekend drank so much that i went into a coma and DKA (diabetic ketos acidosis (or something)) so now my parents wont let me go out or drink at all.It's made me very depressed, ruined my christmas + new year + social life, means i cant get stoned anymore coz she'll think ive been drinking.The moral of the story is drink and weed is fine for diabetics as long as you're not irresponsible like i was coz it bites you in the ***.",
            "post_id": "3798532",
            "timestamp": "1229979183",
            "votes": 0
        },
        {
            "answer": "I can relate to you - but it's defintely good you're getting the word out and trying to find out what the right thing to do is. I've had diabetes for a relatively short time as well, but once everything re-stabilized, alcohol / weed now barely affects me (BGL are very stable) When I do get the munchies stoned or drunk, I just go for the healthy option with the least carbs. In short, just like everything else in life - use it in moderation and don't drink wine or dark ales...stick to the low-carb beers. And keep up the stable blood sugars bro!",
            "post_id": "3845187",
            "timestamp": "1231301069",
            "votes": 0
        },
        {
            "answer": "my name is slik,u might hear about me in     cordele georgia, ive been a diabetic for 5 years. i have been smokin weed for 4 years, and i want to know is can u die from smokin pot? but i feel fine wen i smoke pot, i feel great, but wen i go to sleep i move around and talk and walkin around and then wen i wake up i dont remember the next day, i sleep walk and talk wen im stoned going to sleep. but anyway, i know i need to start doin better cuz wen i get the munchies i eat so much stuff thats filled with sugar but i cant help it, and im gone to start smokin after meals and start taking cover shots every time i eat a snack, but please give some more advise. comment me back cuzz i really want to know everything that is about dibetics and pot.",
            "post_id": "4023408",
            "timestamp": "1235447668",
            "votes": 0
        },
        {
            "answer": "my name is slik,u might hear about me in     cordele georgia, ive been a diabetic for 5 years. i have been smokin weed for 4 years, and i want to know is can u die from smokin pot? but i feel fine wen i smoke pot, i feel great, but wen i go to sleep i move around and talk and walkin around and then wen i wake up i dont remember the next day, i sleep walk and talk wen im stoned going to sleep. but anyway, i know i need to start doin better cuz wen i get the munchies i eat so much stuff thats filled with sugar but i cant help it, and im gone to start smokin after meals and start taking cover shots every time i eat a snack, but please give some more advise. comment me back cuzz i really want to know everything that is about dibetics and pot.",
            "post_id": "4023410",
            "timestamp": "1235447702",
            "votes": 0
        },
        {
            "answer": "hi, my name is Declan im now 31 have had type 1 diabetes for 16 years an I smoke weed (marijuana) every day.  I would love to tell you there is no problem with getting high but in all honesty I can not.  Im not gonna say the usual things about smoking weed this is purely my opinion and im no doctor.  When your stoned everything will seem better but it rarely is weed will make you lazy in all aspects of your life including your diabetes care.  But it depends on your reason for smoking weed, if your looking to fit in with mates or have a non alcoholic means of having a laugh then you will enjoy it like anyone else would but those munchies will litrally mess you up not now but when your my age. I wont go into everything but like most things there are positives and negatives. weed masks the way you really feel it helps you not care and unfortunetly not caring for yourself in diabetic terms is not good.  short term you let your sugars run a little high you may think no biggy achy legs no energy and peeing alot its the long term that will get you.  Anything which will make you not care of the effects of high sugars is not gonna do you any good.  Im not gonna say dont smoke weed as I love it for me its a god send but for all the wrong reasons.  The weed didnt make me not test my sugars or eat chocolate or have two spoons of sugar in my tea , i did that but the weed did stop me from caring about the effects of my sugars being high most of the time. I now smoke weed not to get high as ive smoked for that long I dont giggle or feel giddy it takes away the pain.  I have had no feeling in my feet for years which isnt bad you may think but you may change your mind when you hear this.  Numb feet yes no pain NO.  I continously have most of the day a sharp stab like pain in my toes that you will want to rub but when you do it does nothing and when i dont have the pain they itch which when you scratch does nothing as you cant feel your toes as there numb.  numb feet doesnt mean no pain cus your nerve endings still feel the pain even tho you cant feel your toes.  This is the tip of a massive list of problems which i wont go into now. My advise isnt about weather to smoke or not its just a request from someone older and now a little wiser take care of your sugars now before they take care of you. I dont want to scare you and im sorry if i do  but for the sake of having a laugh dont smoke weed invest your time in enjoying yourself another way and please keep your sugars down. dont tell yourself that slightly high sugars doesnt matter it does.  I know smoke weed to help take away the pain of severe stomach ache and what i can only describe as sun burnt skin feeling all over my stomach and chest. it also helps take away the pain in my throat from being sick 5 to 10 times a day ( good day 30 plus bad day).  this is all caused by damage to the small nerves and blood vessles in my body from  slighly high sugars. i have many more problems which i wont go into but believe the doctors when they say you will have problems when your older.  i wish i had met someone like me when i was younger and could have changed my out look. probably breaking the rules here but if i could help just one diabetic not have the problems that i have it would mean maybe i havent wasted my life if you or anyone has anything you wanna ask about drugs and diabetes il tell you the truth not just the negatives but both sides the high and the low please email me at ***@****.  drugs didnt do this to me i did and the weed just helped me not care at the time",
            "post_id": "5426781",
            "timestamp": "1267490420",
            "votes": 0
        },
        {
            "answer": "Yes you \"can' help it (the munchies thing) or at least condition yourself (and make some changes in your habits).First off, you need to be PREPARED for the reality of your situation. Never ever pretend that you are a \"non diabetic\" person. Do not expect your life to be the same. It won't be and trying to live that way can easily get you some very serious diabetes complications (including being dead).So you have to make adjustments to your life. You can still have fun. You can even get high if you want, but you have to be responsible about it (everyone ought to be responsible in their use).I had very serious reactive hypoglycemia for years (now under control). My typical 8 hour long test (starting with fasting) started at 64, at the 15 minute mark I was up to 135 and by 45 minutes I was down at 45 (my skin was red, I could not think, I had trouble reading or talking).By now you ought to know what those sorts of blood sugar numbers mean.So I stopped eating all refined sugars & all simple (or highly refined) carbs. No more easy food. I also went off of caffeine completely (damn) because caffeine makes your body release stored sugars fast. That means it is the same to your body as eating a candy bar (see also - do not do). And no more alcohol of course.I went to eating every few hours, and always had protein. Everywhere I went back then, I had apples and nuts with me to keep my blood sugar from crashing under 60. I discovered a few fast food chains that had items I could eat when desperate (tasted nasty but fixed my blood sugar).In your case (a different blood sugar issue) you ALSO need to be realistic about your life.BE PREPAREDFor starters, when going to a party bring your own food with you. Frankly you ALWAYS should have \"the right foods\" with you so that you can adjust your sugar levels easily. So just have the right snacks with you. You need protein and complicated carbs with you - and JUST for you. You also need to increase your muscle mass (lift weights every other day) as this will help all your hormone levels stay more sane, including insulin.I know that \"having self control\" while high (with the munchies too) in a \"party atmosphere\" might seem like a hard thing to ask, but it is either that or given time you will  get ulcers (maybe lose a limb or two), lose your sight, and all that other bad crap.So which is more important?You can start by toking a bit less (and toke using your watch/phone alarm so you KNOW how high you are and will be).  This way your munchies will not get out of hand as easily.You can also train yourself not to binge eat while high, if you work on it.If you can, see if you get less munchies from an indica dominant strain (or cross). Sativa dominance tends to be common for \"social weed\" as it makes you HIGH and social not STONED.Another trick in \"food to have for yourself\" is to use foods that are VERY flavourful, come in small bites (and take time to chew if possible) and mix protein with carbs (old fashioned nuts with some raisins).At work I became big fan of \"100% all natural fruit yogurt\", apples, nuts, etc.  And as I said..I ALWAYS had snacks in my pockets. ALWAYS.Now I am not you. I do know that if this was ME I would start with \"more caution in your toking quantities\". This can give you more self control. You need to get used to exercising self control while high, and choosing how high you are going to get.You also need to learn more about how much weed gets you \"how high\" by watching your own consumption. Learn how you react.Why would you want to do that? Well for starters once you are \"in the zone\"... once you have left your \"moderate buzz\" and have not acquired a \"couch lock\" - the munchies CAN be an issue and you CAN easily have problems acting responsibly... so toke less and with more caution.You can also work on increasing your \"self control when high\" just like developing a muscle in the gym. Sit there while high, wanting food, next to food, and do not eat it for XXX minutes. Set a phone alarm (just like for your insulin) but maybe use the tune for \"I got high\" or \"smoke 2 joints\" for your \"I can toke again\" alarm.Having some other hobby that grabs your attention, which you do when high, can also help. An instrument on your lap can also help you stay way from the food.Honestly, learning how to play guitar will not only keep your hands busy (and out of the snacks) and distract you from the idea (high = \"short attention span\") this will all make it JUST a bit harder to get up and grab food that is NOT already near you.Also IF you practice .. that guitar has the nice side effect of making you MORE APPEALING. At parties you find yourself as \"that person with the guitar\" who is surrounded by good looking individuals who find them \"interesting\".This reminds me. A part of \"responsible living\" with or without weed is the use of condoms, and lets face facts  ... weed can increase horny-ness and result in sex (including with those you do not know well) - so *always* take condoms with you to places you expect to get high (just in case). You do not need a disease, or an unexpected child.If \"self control\" did not work for me in a crowd/party place...with the added pressure of wanting to fit in with the party ... then I would just stop going to those parties - so as not to be dead. Being dead, losing a leg, being blind, having heart damage, getting neuropathy... those are \"forever\". Take it from a person who has it - neuropathy ***** dead donkey dk. It ***** MASSIVE ddd.* AND WITH THAT IN MIND *Cannabis actually TREATS diabetes!It keeps sugar levels more stable, help people NOT get obese, and is a good preventative (and treatment) for many of the common bad complications of diabetes - but it *will* work better as edibles (ingested whole plant concentrates) than by smoking up.Since cannabis treats diabetes, and you are stuck with diabetes for the long haul - - depending on the laws in your state and your age ... you might be eligible to go ON cannabis as a medicinal user to help control your sugar levels and to prevent the long term complications associated with diabetes.http://www.truthonpot.com/2013/06/12/medical-marijuana-and-diabetes/http://norml.org/library/item/diabetes-mellitushttp://www.letfreedomgrow.com/cmu/diabetes_5.htm",
            "post_id": "13424573",
            "timestamp": "1446434548",
            "votes": 0
        }
    ],
    "post_id": "2429140",
    "question": "Ok well, i just got diabeties not to long ago(3 months) and im 15. I cant drink with my buddies anymore, cause of this reason, so its kinda hard for me to have a good time at a party when everyone else is boozin. I smoke the occasional Joint. I looked it up, and there isint any differnt effects of marijuana with ppl with diabeties(i think)is this fact correct? Or what can it affect a diabetic person differntly then a non diabetic person?Thanks",
    "timestamp": "1068962400",
    "title": "Marijuana And Type 1 Diabeties"
}