{
    "answers": [
        {
            "answer": "Dear TShelton,My son also wanted to join the military.  He was diagnosed at 8 years and is now 27. As a mother and volunteer of JDRF, I cannot give you legal advice as part of our organization.From our own experience, we talked to many organizations regarding this matter. Unfortunately, back in 1992 at least, the military won't budge in this matter.  Even thogh we know of all of the forward technology that is available for people with diabetes, it seems to me the military is a bit behind the times.  While I agree in someways with active combat, I never felt one should be disallowed with serving in a non-combat position.I hate to be negative on this very important question but the only solution you might have is to retain councel, but in our case, my son didn't get far.If he couldn't go into the military, he wanted to join the police force or become a firefighter.  Again he was turned down for the same reasons. Times are changing so please don't give up.  Jesse fought forestfires in Montana and Idaho this past summer which can consist of 18 hour days and is skiing on a local pass for propatrol during the winter. He will also be attending college to further medical training to help in hospital trauma.I guess my point is there are many ways to serve your country.  It sounds like your passion is with the military, but please, if the military cannot be realized, look at other options.  My son did and realized as long as he was protecting homes from fire or helping the injured on ski slopes, he was helping others.I know this is not what you wanted to hear, but my hope is that things will change.  Look for other comments that maybe posted with different answer's.Best of Luck,dm",
            "post_id": "2429205",
            "timestamp": "1072245600",
            "votes": 0
        },
        {
            "answer": "Dear TShelton,I don't know if this helps, but I was looking into this issue a little more.  I was told to have you look at the website, www.firstgov.gov. I haven't checked it out but it can't hurt.  Please stay in touch, I would personally love to hear how you are doing.Best Wish's,dm",
            "post_id": "2433113",
            "timestamp": "1072245600",
            "votes": 0
        },
        {
            "answer": "Thank you very much for your advice and support.  I am trying to get in touch with people I think can help me, and who have the connections needed.  Hopefully I will be successful in my venture.  I am very glad to hear that your son found something that he has a passion for doing.  I will keep you informed of the information I obtain.  Thanks again",
            "post_id": "2433115",
            "timestamp": "1072245600",
            "votes": 0
        },
        {
            "answer": "I am a type 1 diabetic who is married to a military colonel. The problem is that the military cannot accept a diabetic and then give him or her \"preference\" by not sending that diabetic person into an area that does not have medical care. It would be terribly unfair to the other military people to \"prefer\" the diabetic by not sending him or her into a position that might threaten his or her life. When it comes to life or death matters, all absolutely MUST be able to carry the same load, and must be able to survive if supplies are not able to be delivered. If a person cannot survive under those conditions, they cannot be accepted into military service. It is only fair to the other military people to only accept those that can fully serve without any preference. Like you, I am fully healthy. But you must be realistic and accept the fact that we absolutely must have that insulin. There is no way the military will ever be able to bend those rules. One alternative would be to take a civil service job on a military base, for frankly, there are many civilian positions open now that used to be filled by active duty military as the military downsized budgets have forced many jobs to become civilian now. I have worked as a civilian doing pilot training courseware, and there is no discrimination at all as far as the diabetes is concerned in civilian jobs. There are civilian jobs in almost every area of military life now. I would check these out carefully upon graduation from college. Pay and benefits are good and you are a full part of the military mission as a civilian.",
            "post_id": "2433116",
            "timestamp": "1072245600",
            "votes": 0
        },
        {
            "answer": "Thank you for the advice.  Could you inform me on some of those civilian jobs and how I might obtain some information on them?  Thanks again?",
            "post_id": "2433117",
            "timestamp": "1072332000",
            "votes": 0
        },
        {
            "answer": "Of course I care deeply about folks who wish to join our military \"family\" and I respect your for that desire. If you were put into a war zone, anything can happen (just read the news about troops being ambushed daily). Now we both know that not all folks end up in war zones, and if so, maybe not often. But from what my spouse tells me about policies (he is a personnel officer), the problem is the one time it can happen. The military cannot be responsible for protecting that one vial of insulin. If you are separated from it in a war zone, you would be at risk. And of course your compatriots would want to help you, so their lives may be at risk because of that effort to try to help. Now, this happens all the time in military situations -- some folks will get shot down in a helicopter like the one that was shot down while on their way to R&R, and the others all stopped to try to help. But the difference is that there is no previous possible danger or weakness to those troops which would perhaps make them less able to survive if they did get captured or their immediate supplies were blown up. I understand that one vial of insulin lasts a good month, and most of us keep a spare handy just in case one breaks. But in a situation where a convoy was stopped and you were perhaps taken prisoner, your life would be in peril. This is perhaps a long shot, but it is possible. And a commander in charge, knowing that this may be a danger, may be hesitant to put you at risk and this could end up favoring you over some other guy. Even a hypoglycemic episode due to stress could put your buddies at risk if you were unable to function at top ability.I am merely a spouse, and I know that the recruiters are simply going to list what the rules are and turn you away. I suspect that if you tried to contact the Personnel Center (in the Air Force, this would be the Mission Support Squadron), you will be given the same info. But feel free to try, for they may explain their policies better than I can as an observer and outsider. Or maybe they will simply send you the form letter saying that they cannot accept you. No telling. But it doesn't hurt to ask the questions. Just don't count on changing any policies. All the policy-making is done at much higher levels than the nearest base.As for civilian jobs, try checking out the nearest military base's web site. I know that they usually are found at www.basenamehere.branchofservicehere.mil (i.e., www.randolph.af.mil for Randolph Air Force Base in Texas). Once you are in, there is usually an employment link. Each base handles its own web site, so you may have to go browsing to find the employment link. There really are tons of civilian jobs out there in almost all fields. if they require special security clearance, many of them will see that their candidate gets the necessary clearance after hiring. There perhaps is no real glory in being the civilian partner to the active duty person, but the jobs are there and need quality people who understand military concerns. I encourage you to check them out. I have been proud of the times I have done civilian jobs for the military while married to my active duty spouse.",
            "post_id": "2433123",
            "timestamp": "1072418400",
            "votes": 0
        },
        {
            "answer": "And I want to ask you honestly, not being sarcastic in the least.  Do you think that I would be cutt off for a long enough period of time without supplies where I could not bring that much insulin with me?  One bottle of Humalog lasts me over a month.  If I had more than one and syringes I really believe I could survive for quite a while.  Thanks for any input.",
            "post_id": "2433121",
            "timestamp": "1072418400",
            "votes": 0
        },
        {
            "answer": "Dear TShelton,SGG is being modest. You had talked about non-combat roles in the military and when I spoke to a few military people, they also agreed that at anytime, you could find yourself without supplies. Civilian postions are very necessary with the military and you just might find your niche.  SGG, has from experience, very valuable experience and good advice in my opinion.  I know how much this means to you, please let us know what you decide. Keep your chin up.Best wishes'dm",
            "post_id": "2433130",
            "timestamp": "1072504800",
            "votes": 0
        },
        {
            "answer": "Diabetes is a condition that the military does not want to deal with.I am in the Military (Type II Diabetic) and they can't get me out fast enough!  They're trying every thing they can to justify Booting me out.  My impeccable job performance is not included in my evaluation.  the only thing they are concerned with is all the \"What ifs\".  If you are not in perfect health you have to have a means to prove you can optain perfect health in sort order.  DIABETES is not one of those things that you can provide that type of concrete evidence.BEST THING TO DO IS NOT TELL THEM YOU ARE A DIABETIC!",
            "post_id": "2433245",
            "timestamp": "1076997600",
            "votes": 0
        },
        {
            "answer": "the military is 100% right on not letting diabetics into the military. What were to happen if u were stranded, captured, or had to go days without food, like many people in the military have to endure. If your a diabetic, you would put your life at risk, as well as your whole squad",
            "post_id": "2433309",
            "timestamp": "1079157600",
            "votes": 0
        },
        {
            "answer": "I am also a Type 1 diabetic and i am 19 years old. My dream as a kid was allways to be in sometime of military service. With my disease the U.S. for some reason does not give a damn about my service. Now from reading what the other guy has said about the military and diabetics I see were he is going with it. But what if they could set up a Unit or Division that was strictly for diabetics. I am hell in civil war all the way to WW2 they split the races up like spanish and black units. Why cant they split up and make a type 1 diabetic unit!!!",
            "post_id": "2433619",
            "timestamp": "1092200400",
            "votes": 0
        },
        {
            "answer": "First of all, don't knock a diabetic for wanting to serve their country just like every other patriotic person. My goal was to go into the Airforce after highschool. My testing was near perfect (want to still call me a retard). Before I graduated I was diagnosed with Type 1 diabetes and there went my chances for serving my country.It is to people like you that sterotype people like us and call us stupid or retarded because of you own faults. I'm 6' 210 pounds and 12% body fat. Want to still call me a retard? I would love to serve my country if I were allowed, but I'm not. I can't drive a truck, I can't be a cop, I can't be in the FBI or CIA. My only options are desk jobs. People like you who don't understand what diabetes is and what a diabetic has to do to live are the \"RETARDED\" ones.I have a friend of mine that is in the military and he has tried to get me to go in time and time again, but due to my diabetes I can't. He does not know I have it. That is how good I am. I keep up with him and he is way up there in the military. I have a four year degree and could come in as an officer if given the op (Still want to say I'm retarded).GET A LIFE MAN. SERVE YOUR COUNTRY PROUDLY AND IF A DIABETIC IS STANDING NEXT TO YOU, PRAY THEY WILL SAVE YOU IF YOU GET SHOT.Later,",
            "post_id": "3126665",
            "timestamp": "1215446858",
            "votes": 0
        },
        {
            "answer": "Everyone that is arguing that diabetics \"require\" food or medicine doesn't understand the disease or ones ability to control it.  Don't fuel the argument with your ignorance.  I am a type I insulin dependent diabetic.  I am also a marathon runner, firefighter, and prior serving navy helicopter rescue swimmer; an elite military job.  On some days, I take little insulin and on many I don't take any at all.  I control my diabetes by limiting the carbohydrates I consume and/or by exercising.  My A1c hasn't exceeded 6.0 which is probably better than most \"non diabetics.\"  Diabetics don't \"need to eat\" unless they experience a low blood sugar caused by too much insulin on board.  Diabetics \"don't need insulin\" unless they ingest too many carbohydrates or aren't exercising enough.  I wear a glucose monitoring system that measures my blood sugars all day long notifying me of dangerous blood sugar levels.  I also wear an insulin pump that adminsters insulin when I need it and eliminates the need for syringes.  Please read the ADA website about the soldier that has just returned while successfully serving in Iraq WITH type I diabetes.TShelton - Go for it.  Just be prepared to prove yourself and put up a strong fight.  It'll be good training for when you finally make it to your unit.Fellow Type I, Current Firefighter and Marathoner, Prior Rescue Swimmer",
            "post_id": "3131758",
            "timestamp": "1215546762",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with type 1 diabetes in october, 2006. I was half way through my pilot training. All I've ever wanted to do is serve as a pilot in the military. I've been told that simply because of my under-control, non-limiting diabetes i cannot even serve as a civilian pilot. I'm 18 now. I'm attending a college i dont want to. I'm taking classes i dont care for. I'm living a life leading seemingly nowhere. If anybody please has any possible ideas of what i could do...I just cant take office jobs. I prefer something exciting and working out on the field. Please e-mail with any ideas if you can. I would greatly appreciate any input. thanks.e-mail: ***@****For all of you who are diabetics wanting to be in the military: I guarantee that you can do a better job than any other non-diabetic out there. The military has lost a great asset. It's their loss, not ours.",
            "post_id": "3202006",
            "timestamp": "1217032273",
            "votes": 0
        },
        {
            "answer": "I believe that they should giv diabetics a chance test there fitness levels and there liability to diabetic incedents in some kind of pre baisic training potential military personel and if they pass that let them try and pass baisic training with the rest of them if they fail because they are not in decent control thats ther problem but the ones who can keep up and fight with the rest let thm join the army ,marines and all tht",
            "post_id": "3307461",
            "timestamp": "1219325301",
            "votes": 0
        },
        {
            "answer": "Hey,I too am a diabetic and have grown up around the military my whole life.  Finally when the chance comes to put on a uniform and do what I have been trained to do my whole life the government says NO, but not only no but also that I am no good, not good enough.  I am here for you as I have been waging this battle for the past 7 years.  I say all of us unite and make a stand against this.  There is power in numbers and if we get enough people together we will make our point made and our voices will be heard.I say all people of this great nation should have the chance to join and serve in the military.  I too want in soooo bad that I can taste it.  The government should not be able to choose who can or who can not serve to protect this country.  Especially with the way things are now, you would think that the government would want us to join because there are well over 75,000 people that are just like us that too want to join.",
            "post_id": "3526041",
            "timestamp": "1223933103",
            "votes": 0
        },
        {
            "answer": "I know I am a little late weighing in on this topic, but better late than never. I have a lot of personal experience dealing with some of the issues that have been discussed in previous posts.I joined the Army National Guard in January of 1998. I chose to lead a civilian life, but also had a passion for serving my country. I have been on several deployments, both stateside and overseas, including 18 months spent in various parts of Iraq in 2002 and 2003. It wasnt until 1/05 that I ended up in the hospital for 7 days due to diabetes. I was shocked when the doctors told me that I was diabetic. I played soccer, football, wrestled, and stayed active for the military my entire life, and had essentially controlled or atleast kept myself out of the hospital through diet and excersice without even knowing it. I know have a much better control of my diabetes with the assistance of very small amounts of insulin 4 times a day, coupled with a strict diet and excersise.The point of this isnt really to tell my life story, but to tell you how it has effected my career in the military. I have 2 friends that have been in my unit over the years that were diagnosed with diabetes well after enlistment, cases very similar to mine. One of them was medically discharged without much fight and the other put up a fight but eventually lost. He is now a police officer in TX. My leadership did thier best to keep my condition somewhat under wraps, due to my insistance and ability to continually prove my worth and right to serve. Eventually it caught up to me as the unit had to undergo a medical screening in preparation for another deployment to Iraq. I was then assigned to a medical review board and summoned to appear last March. Going into the MMRB I was fearful as to what would happen as I was told by everyone that I had talked to that I didnt stand a chance to be recommended to retain. Regardless, I decided to atleast put up a fight and hopefully make some head way for those that followed me. I talked to my endocronologist and submitted myself to a clinical trial involving inhaled insulin, did a lot of research, and found as many talking points as I could to make a point.The time came and I showed up at my MMRB without representation, which surprised them as most people trying to stay in have a first sergeant or commander along side. Mine however were serving in Iraq at this time, but I did have a former commander offer to come in and say a few words to vouch for my commitment to the Army, and ability to perform in and out of combat. I opted to go alone though, not wanting him to see me in a moment of weakness as I assumed I would be referred for seperation. Ater I had been givin all the opportunity to present myself, and had fielded many questions from the panel I was sent to wait for what seemed to be hours, but I am sure was much less, while the board deliberated. I was called back into the room and told that they had made a decision that had not been an easy one and had not been unanimous. As I prepared for the worst they continued to expail there decision and informed me that they had decided to refer me for full retention. This was a decision that had to be sent up and signed off on by the adjutant general and has taken until 11/08 to be finalized. The board did not place any restriction on my profile but informed me that if my unit was to be deployed in the future, I would noy be allowed to go and again be sent for evaluation by another MMRB, that may not be as favorable to me. As we speak I am still a active member of what I condider to be one of the finest national guard units in the country, but looking for another unit that is less deployable long term.Although I cannot help in joining the armed forces as a prediagnosed diabetic, I can tell you that there is hope for those in the future. Only 5 years ago that same MMRB would not have even thought about referring me for retention. I wish you the best of luck.",
            "post_id": "3762134",
            "timestamp": "1229033377",
            "votes": 0
        },
        {
            "answer": "I am also a Type 1 diabetic, and have always wanted to serve my country.  I come from a line of Air Force and Army Air Core serviceman, and it's hard not being able to fulfill this dream.  I believe, however, that our military's decision in not allowing diabetics to serve is justified.  Combat and crisis should always be able to be broken down along the chain of command as simply as possible.  Theoretically, EVERY serviceman must be able to pick up a rifle and stand his ground.  Even the private in the middle of Kansas, who spends his days in the galley, preparing meals, must be counted on to defend this soil to the death.  While the possibility that the line cooks in Kansas and the 40-something year old, overweight paper pushers would ever have to dig in and defend themselves are slim-to-none, it's still, fundamentally, the reason our military exists-- to defend to the last man. All complications should be avoided, and thus, why the military at this time barres enlistment.The outlook for the future is bright, however.  I believe with current medical advancements, that a diabetic will soon be able to pick up a rifle and do his duty.",
            "post_id": "3854398",
            "timestamp": "1231500686",
            "votes": 0
        },
        {
            "answer": "I am a life-long insulin dependent diabetic.  For a while I have had the sole desire of serving my country in the military.  I have been encouraged by some of the stories posted here, and I am fully commited to the many medical advances which may help us all fulfill our dreams.In addition, I believe that diabetics should equally have the right to give their lives for their country.  While there is a greater risk with insulin dependent diabetics, it is no greater a risk than being sent overseas to fight a war.  If I were to die because of a low in combat or for some other reason related to diabetes, I would be satisfied that I at least served my country and tried to do my duty.  But I will say that I could never bear it if someone in my unit lost their life to save me because I had a low.Because of this, I think that our best chances are to fight for a cure, and fight for better ways to control our diabetes.  I sincerely believe we are not far away from being able to join the military in active combat duty.  Technology and medicine is advancing and I will personally submit myself to help find advances and maybe even a cure in the hope that I can enlist before I turn 29",
            "post_id": "3857168",
            "timestamp": "1231551665",
            "votes": 0
        },
        {
            "answer": "Fair?? How can you say it isn't fair to the rest of the soldiers that a type 1 diabetic gets preferential treatment because the don't have to be put in a combat situation.What's fair about being forced to deal, through no fault of your own, with a disease that forces someone to lose their right to serve... in whatever capacity.If a private company decides not to hire a type 1 diabetic they are in violation of American Disability Act, BUT or government can violate this because they would  have to place these soldiers outside of combat zones.I think there are some dangerous places that are still considered \"outside\" the combat zone. Lets face it not one person in the World Trade Center on 9-11 thought they were in a combat zone but by 9-12-01 that's exactly what NYC looked like.Lets call a spade a spade, the government is worried about the health care costs of diabetics in the military, watch how quick they start taking type one diabetics in non-combat AND combat positions once universal healthcare passes the house.FamilyNP2009",
            "post_id": "3928273",
            "timestamp": "1233181127",
            "votes": 0
        }
    ],
    "post_id": "2429204",
    "question": "I am 22 years old and currently attending the University ofGeorgia.  My entire life I have wanted to serve in themilitary and protect my country.  Unfortunately, I am aninsulin dependent diabetic.  I am in perfect health andphysically fit.  I have no complications after having thisdisease for over 17 years.  No branch of the military willallow me to enlist due to the fact that I am a diabetic.Considering I am perfectly able to do anything that themilitary requires, I think this is extremely unfair andunjust.  I certainly understand why they would not want adiabetic to fill a combat position, but there are numerousnon-combat positions that a diabetic could fill.  I feel thatthis is a very blatent example of discrimination.  I wouldvery much appreciate anyone who could give me some advice onsome options I might have to fight this.  I could certainlyuse a helping hand in this situation.",
    "timestamp": "1072159200",
    "title": "Military Discrimination"
}