{
    "answers": [
        {
            "answer": "Hello and sorry you have developed eczema. I don't think the eczema or the other problems you mentioned have anything to do with the urinating a lot. The urinating a lot could be due to the Arinac medicine since it makes people nervous, and excitable.  Maybe the steroid cased it too if it went away. But I doubt it if it was just a topical. But other than that it could be due to diabetes, a urinary tract infection, overactive bladder or prostate enlargement.  Have you had burning while urinating or any discomfort? Do you have diabetes? You may want to get  a urine culture done and check for diabetes. Are you thirsty all the time? Crave sweets? Feel light headed or dizzy? Also, you may be allergic to the antibiotic if you got a rash after using it. Anyway, these may be things to think about.  I have eczema too. It can be caused by an allergy to various things or it can be caused by too much water on the skin and/or the skin getting dried out. My dermatologist has recommended not taking hot instead warm showers and washing your hands in warm not hot water. He also recommened keeping moisturized and using Eucerin  Intensive Repair Extra Enriched hand cream for the hands only and Cetaphil Restoraderm Skin Retoring moisturizer for he rest of your body. I even use it on my face too. I do use  low grade steroid on my hand only a tiny bit once in a while when it gets really bad. You don't want to use much steroid ointment because it can shut down your adrenal glands (if you put it all over your body). You body also gets used to it. So try not to use it and try to find ways of using moisturizers instead. You can get these on line. Give them a try. I would get fragrance free detergents for your clothes and figure out all the things in the house that might aggravate it.  It can take a while I finally only break out on my hands. I used to also break out on my legs too. Whatever you do don't scratch. You can get an infection. Also it makes it worse. Put something over it or Vaseline anything to sooth it rather than scratch. Hope this helps.",
            "post_id": "10110802",
            "timestamp": "1395256698",
            "votes": 0
        },
        {
            "answer": "Anytime we take an antibiotic we need to take acidolphilus or other probiotics to replace the good bacteria that has been killed off by the antibiotics.    The antibiotics could have irritated the bladder as well which also needs the good bacteria.Speaking of... I need to go take some acidophilus right now.ttyl",
            "post_id": "10111680",
            "timestamp": "1395269379",
            "votes": 0
        },
        {
            "answer": "Thanks so much for your thoughts. Most helpful. The thing is after contracting CMV about 6 years ago my health went down the tubes. The urination, muscle weakness, constipation etc...... and lost about 40 pounds which I am unable to put back on. I checked for all infectious diseases including HIV but came negative on all except CMV. I have heard all of the it is in my mind etc that 1 in 5 of us have CMV etc etc etc ...but ever since i had a risky incident my first ever in my 34 years of life I never felt the same again.Coming back to my current problem the hives and eczema began on first my arms then various parts of my body after I began Arinac and Azomax anti biotic. I have seen a skin specialist who prescribed all what you have mentioned above and the cream clobevate calms the areas down and then they dont itch and she has prescribed me some healing cream called benzomen or something like that. I am supposed to put that on as well.Its just that everyday some new area on my body erupts which is really disturbing And I am loathe to put so much steriod cream on my body . I just wish I could find the root cause of all of it. I do not have diabetes currently but am on the higher side my sugar but still below type 1 diabetes. Does that mean it is because of diabetes? I do not have burning whilst urinating and my prostrate blood test was seemingly okay about  2 years ago. My LFT and heptatitus blood reports are okay except bilirubin on the higher margin just within normal range and my kidney creatinine tests okay.Which leads me to wonder what is causing all this? Recently however,for the last 3 months have gone through alot of emotional  and mental stress with parents divorcing, dragging me into court cases, alternatively conversing and not with me, sister being admitted to hospital for a cyst .....etc.....Just want to find the root cause of this and what to do?Have begun Augmentin 1 gram antibiotic recently to try to stop the urination and kill off any infection within me .",
            "post_id": "10120811",
            "timestamp": "1395428097",
            "votes": 0
        },
        {
            "answer": "thanks and i will buy some immediately .......I have had it in the past...but had azomax for the first time....p.s. the arinac and the azomax I had roughly 3 weeks ago so do not know why my body is reacting still in this way....",
            "post_id": "10120814",
            "timestamp": "1395428160",
            "votes": 0
        },
        {
            "answer": "It may be that you are allergic to something. Make a list of any new products you have tried. New detergents especially, new soaps in the shower. Switch to all fragrance free, paraben free and I can't use the ingredient in antipersperants (it is the same in all of them) as it gives me a rash, and you might want to see an allergist. Do you have dyshydrohic eczema where there are little blisters or the red rash type? I had both. the dyshydrotic one on my hands and the rash type on my legs. Try not to use the clobetasol too much I became allergic to it after several years of  use and my legs blew up like elephant legs. Horrible. I now use a lower grade one called Triamcinolone 0.1% ointment. It doesn't work as fast but it works and it isn't as high a grade a steroid so it is actually better to use. With the diabetes no it doesn't cause eczema. But obviously you have to quit sweets and eat more veggies and whole grains (no white rice, or white sugar, white pasta) substitute whole grain rice and whole grain pasta etc, instead of high fat foods. High triglycerides can cause your liver to make diabetes worse too. I don't know if you had your cholesterol and a lipid panel done on you yet? I don't know if you are into changing your diet but if you are I can makes some suggestions towards the diabetes problem. Yes probiotics are necessary especially now that you are on another antibiotic. I wasn't as concerned since you just had one but two makes you more susceptible in getting bowel problems caused by a bacteria called Clostridium difficile. This bacteria takes over when the normal bowel flora is disrupted by antibiotics. You want a probiotic that can have several types of \"good\" bacteria like lactobacillus sp. bifidiobacteria etc. and a high number like 10 billion copies. Many stores have these. So, back to eczema, you have to be patient and make a exclusion list of things you are allergic to or that make it worse and  get rid of those things. I do think weather especially dry conditions can bring it on. Also stress may bring it on all though there is no proof, I find mine seems to get worse.  The biggest thing is keeping out of hot water and taking cool or warm showers not hot and use gloves when you can to avoid washing your hands too much. Definitely hives is an allergy. So seeing an allergist is important in getting this under control. Maybe taking Claritin at night if you can tolerate it might help lower this down. You may want to get patch tested and bring in the products you use. Not all dermatologists do this. There may be one in your area that might do it. The CMV issue is another matter. I wonder if you have had a complete blood count and CD4/CD8 test and maybe immunoglobulin test to check if you immune system is ok since CMV is causing so much trouble for you? I'm sure they must have checked into all that. I don't think the allergies have anything to do with that though. I am allergic to many things and try to avoid them. The doctors get irritated with me. I need to get patch tested as well. I am just trying to think of all the things that can get you back into stasis. The main issue right now is finding out what you are allergic to and avoiding it.you will get there,mkh9",
            "post_id": "10121318",
            "timestamp": "1395435810",
            "votes": 0
        },
        {
            "answer": "HelloThanks again for your detailed comment. I have made a list of the products I am using. I realized that I am not using anything different than before. It is the same.The only thing different since i am an athlete and a tennis player I have recently for the last 6 months been getting massages at my local club. Twice a week. My masseuse a month ago left the job and a new guy came in who works part time at a hospital . I am thinking maybe some germs he picked up on his hands at the hospital came to me . But then i wonder why everyone he massages do not have the same reactions. Then again different people react differently. However, I do insist that they wash their hands with soap before they massage me . I get massaged with olive oil.On my arms at the beginning when all this took place I had the small blisters on my arms but with clobevate they went away. Now though I get red itchy rashes all over my body off an on. SOmetimes in the leg , sometimes in the arms. I apply clobevate and within 2 days it subsides. Now, however I have little small blisters near my left eye on which I am hesitant to use clobevate as it is on my face. IS it safe to use on my face? I do not want to make a habit of clobevate though.Using clobevate leaves with me with more dry skin and like little burst skin around the infected area but at least it is not itching.The skin doctor prescribed me a healing cream to use after clobevate alleviates the issue called BEPANTHEN. I do not know if you have used it but I am sure you have. I will look into buying the less potent steriod cream that you have mentioned.it is extremely dry in the area I am living in as well as I have been highly stressed for 3 months. But I still do not feel that is the cause entirely. The Arinac I used 1 month ago seems to have triggered the allergy and then everything else just made it worse. I just wish it stopped now.I will look into patch testing as well. Seems quite a process.ANd into buying the probiotics as well. The skin doctor prescribed me Softin anti allergy as well which I am supposed to have for like 10 days. But I just hate having them as anti allergies make me tired.I do not know why the doctors have not prescribed me testing the blood tests that you have prescribed above. What will the results show me? how much CMV has ravaged my body or the current state of my health?I have taken a urine detail test today and will get the result tomorrow. The doctor said that if there is an issue in that then i can have a urine culture test.",
            "post_id": "10129243",
            "timestamp": "1395599312",
            "votes": 0
        },
        {
            "answer": "It sounds a lot like you are allergic to something the massage therapist is using despite what he says he is using. Maybe there are some \"natural herbs\" he uses with the olive oil? I am allergic to their herbs. It could be some cream he uses for himself on his hands or something they clean the massage beds with. I mean it has to be something there if it started with that or something you do differently since you went there. You have to track it down. Yes patch testing is a big process. That is partly why I haven't stated mine even though I know I need it. As for the lab tests I mentioned well usually CMV doesn't cause a problem unless your immune system is low. So I wondered if you could see if you do have a low immune system since it is unusual to ill from CMV. Also, don't put steroid on your face! Your facial cells are different from that of your other cells and it absorbs much more readily. I would only do this once and under the guideance of your doctor because then you will have to taper off. They will say you can but it will thin your skin out quite a bit over time. My friend and I both did this. She did it for a long time because she has lupus. She finally quit using it but now her skin is paper thin. I only did it once because I was allergic to Metrogel topical and had to use it to get the swelling down. I had to taper off of the steroid because every time I tried to go off of it I would break out. It took me months to get off of it. Fair warning!  You are not supposed to get steroid cream or ointment in your eye you could ruin your eyes. So I wouldn't out it near the eyes at all and wash your hands after using it. I hope I answered all your questions.mkh9",
            "post_id": "10129820",
            "timestamp": "1395609332",
            "votes": 0
        },
        {
            "answer": "I am very sure this has to do with the massage rooms table and maybe the person who was massaging me since he works in an hospital. So I assume there are many germs over there.My face is swelling up around my eyes and cheeks. Little blisters forming and some swelling on my cheek area. It is deeply troubling. Hence, I am going to begin my anti allergy Softin tablet today for 5 days( as it is supposed to be an anti drowsy one even though most of them make me feel sleepy). i just hope it works.Especially after reading your post there is no way I would want to try the steriod cream on my face. I am trying to avoid it for as long as possible. i am going to try Garnier cream for acne today in the hope that it may calm my face down.I will look into the cd4.cd8 tests later after i get my allergies calmed down hopefully. I just hope i do not have to be hospitalized for this. Even in a hospital i wonder what they could inject me with to solve this as I am allergic to some steriods.I got my urine detail test back today and in that everything was clear thankfully, it just shows that I am dehydrated which is strange as I drink like 5o glasses of water a day but then again I urinate alot so a tough one to figure.",
            "post_id": "10134242",
            "timestamp": "1395686110",
            "votes": 0
        },
        {
            "answer": "It sounds like whatever you put on your face you are allergic to. My upper perioral area swelled and peeled when I got an allergy to Metrogel and my friend's whole face blew up when she but Metrogel on too. We both had to use steroid on our face to get the swelling down. But this was under a dermatologist close watch. Her face got burned, mine did not. But I can't use that stuff. I don't know if I am allergic to the metronidazole in the Metrogel or the carrier. We both had to taper off the steroid and it took a long time. If your face if very swollen you may have to see a dermatologist too. If it isn't that bad then see if what your going to use will work. I can't sue two steroids either. It may be the carrier the steroids are in or that particular class of steroids since there are both in the same class. Your blistering may be allergy and not eczema in this case. I agree I wouldn't do any tests for your immune system if it is going bananas over an allergy. It may throw the results off.  I hope the anti-allergy Softin helps. I haven't heard of it. Glad your urinalysis was normal. Did you say 5 glasses of water? plus what ever other fluids you drink right?  Let me know how it goes.mkh9",
            "post_id": "10134766",
            "timestamp": "1395693242",
            "votes": 0
        },
        {
            "answer": "Get your liver enzymes checked.!  If urinating that much very well could be diabetic & dehydrated.  Do not put multiply ointments on.  Get some dial antibacterial soap cleans areas a few times a day.  Drink a lot of green tea with molasses, cayenne pepper & lemon.  (ALOT)",
            "post_id": "10135120",
            "timestamp": "1395698090",
            "votes": 0
        },
        {
            "answer": "Get your liver enzymes checked.!  If urinating that much very well could be diabetic & dehydrated.  Do not put multiply ointments on.  Get some dial antibacterial soap cleans areas a few times a day.  Drink a lot of green tea with molasses, cayenne pepper & lemon.  (ALOT)",
            "post_id": "10135122",
            "timestamp": "1395698139",
            "votes": 0
        },
        {
            "answer": "I have about 15 times in the last 4 years....it shows my ALT and Liver Function Test normal but shows total bilirubin moderately highwhich is why it is confusing",
            "post_id": "10139400",
            "timestamp": "1395772519",
            "votes": 0
        },
        {
            "answer": "Hello ....thanks for your post....I still have not put any steriod creams on my face so far....because I am quite averse to it as the repercussions are quite horrendous......as  you have said as well.....Do you know of any other creams that are non steriod based and can be applied on my face to calm it down?.......I had Softin yesterday and then put some Garnier correction pen liquid on the affected areas of my face and totally it has only come down 10%......A friend told me I could be allergic to steriods s a doctor previously mentioned and that is why my face is exhibiting signs of it due to a reaction of using Clobevate steriod cream....I dink like 50 glasses of water as well as a cup of green tea and some milk.....and as of yet have not put any creams on my face except the nivea for dry skin that I have been using for the last 5 years .....plus the blisters not rash but blisters have re appeared on my left elbow yesterday(which is where it all began around 3 weeks ago) with clobevate had disappeared but has come back now",
            "post_id": "10139424",
            "timestamp": "1395772857",
            "votes": 0
        },
        {
            "answer": "Ok, first of all that is why I asked about the water consumption. 50 not 5 glasses of water is going to is causing water intoxication. This is NOT, good and not healthy.  You need to stop drinking that much water. You can actually kill yourself doing that. Your not urinating that much because your kidneys can't keep up with that much water excretion.  You need to go by how thirsty you are. If you are thirsty 8 glasses of water (8 ounces each a day is plenty). If you have a cup of tea then 7 glasses.  So total fluid intake is 64 ounces a day. Unless you are running a marathon or are playing a tennis match for 3 hours then you get thirsty you can have two more. Your electrolytes will get way off. You should get your sodium and potassium checked. Too much water will make the cells swell. Signs of water intoxication are headache, fatigue, vomiting, frequent urination and mental disorientation. So watch out for these symptoms. You may need to be put on diuretics to get balanced back to normal if your electrolytes are off.  I don't know if any of this is causing the swelling on your face. But, you need to reverse course here. Also, if you are thirsty all the time your blood sugar may be off and you might be diabetic. Don't know about that  Otherswise, there is benedryl cream. Also, if your face itches badly you could put calamine on it. It won't get the swelling down but will stop itching. Clobetasol (which is another name for Clobevate) is what I became allergic to as well and then also alcometasone. So it is possible. Maybe try to get the other steroid I mentioned. I am worried about your water intake. Please see a doctor for this and get your electrolytes and blood sugar taken.mkh9",
            "post_id": "10140366",
            "timestamp": "1395784652",
            "votes": 0
        },
        {
            "answer": "I had to write again. I'm really really worried about your water intake. The swelling on your face and blisters may even be due to this. You have got to see a doctor right away and stop drinking that much water. I would in today or tomorrow. Seriously. Let me know what they do.mkh9",
            "post_id": "10141441",
            "timestamp": "1395796815",
            "votes": 0
        },
        {
            "answer": "Hi!!Thanks so much for your response.I spoke to the doctor today. She said that I can put a cream on my face called Advantin which is again a steriod based cream. I do not want to so I wont. The cream you have mentioned Benedryl -  is that non-steriod based cream?The doctor said that Softin was a mild anti allergy and that I should move back to Zyrtec for the allergies on my face. I am so hesitant as it makes me a zombie the next day but I believe I have no choice now but to use it.She then goes onto say that if the allergy comes around my lips(right now it is around my left eye and cheek and to a lesser extent around my right eye) but if it comes around my lips then i have to go to hospital and get a steriod shot of something called Avalon .I then repeated to her that 5 years ago I almost died as my body broke out in rash and pimples all over after I drank some carbonated grape juice and i was admitted in hospital in Emergency for three hours where they injected me with a steriod injection. However, I broke out with swelling underneat both eyes which to a smaller extent is still there. The doc said i was allergic to it.Now my question being i wonder if push came to shove and I had to go to a hospital to get it would they have a blood test or some way to find out if I am allergic to any particular steriod before they inject me.The Softin anti allergy is Loratadine 10mg since you mentioned you had never heard of it.My excess urination has been an ongoing issue ever since I had been diagnosed with CMV . It is on and off all the time. My LIVER FUNCTION test and glucose were normal but on the higher side......glucose test whereas the liver function test had elevated bilirubin values which have not changed except minutely over 5 years.Even i suspect diabetes as it runs in my family and i will get more blood tests eventually but just have to recover as at the moment I am under severe stress both at home and with my health so i need to recover and heal. I just wish mentally I could  relax as the closest to me i.e. family has been enemy number 1 recently......and as you know having an uncomfortable atmosphere at home is a killer as you expect peace where you sleep....",
            "post_id": "10144957",
            "timestamp": "1395859687",
            "votes": 0
        },
        {
            "answer": "Ok Yes I have heard of loratidine ( I didn't realize it was the same as Claritin). I take that too. Did you talk to the doctor about the huge water in take you have been drinking? I think that is more important than anything. I hope you go immediately back down to 8 glasses. I am still worried that you haven't mentioned that. The steroid allergy would have to be a patch test. You can't tell from a blood test. Since you have been allergic to steroids in the past I think it would be good to find out which one is the problem. Maybe under the circumstances you should get that done. But, I suggest you take care of the water issue as #1 priority. I am serious. All I can do it tell you it will eventually kill you if you drink 50 glasses a day. It is causing the excess urination and can cause too little urination as well. Softin (Claritin) is not that strong of a ant-allergy med. You may be better off seeing a dermatologist to get the skin problem in order. But don't get a PA. I had one and he was not good. They aren't skilled enough for this kind of thing. Yes you will have to get a glucose tolerance test or a insulin resistance test or a fasting glucose plus then you eat and wait two hours and then get another glucose test. Whichever they are all about the same. I'm sorry about your stressful situation. It sounds bad. Can you leave? Is there a safe place you can go and stay?mkh9",
            "post_id": "10145137",
            "timestamp": "1395862088",
            "votes": 0
        },
        {
            "answer": "Hey!!!Thanks for your reply.....ASAP I will talk to the doctor about my water intake.The thing is though that I feel thirsty quite often which is why I drink so much water. As I feel it can help me with IBS (which I have as well) . I know feeling thirsty is a sign of diabetes but so far I have tested negative for it as previously mentioned.You did not mention but Benedryl skin cream is that non-steriod based? And have you heard of Advanin which is steriod based which I am loathe to use?I am seeing the skin specialist but she is leaving this week for roughly a week and a half which is why she told me if the allergy comes to my lips I need to go to the hospital.In addition, have you heard of Zyrtec? It is quite a strong anti allergy and she has prescribed me that for 5 days. I do not know if she remembers that roughly 3 weeks ago I did have Zyrtec for around 4 days off and on over the span of a week but it did not help me. If I have this I hope it helps me with the swelling around my face. Which is really troubling.I am working on being able to get out of this stressful operation but it will take a long time . SO for now I am stuck here .",
            "post_id": "10150006",
            "timestamp": "1395941677",
            "votes": 0
        },
        {
            "answer": "It doesn't matter in this case if you feel thirsty you can't drink 50 glasses of water. You will kill yourself. No kidding. Read about it. So, stop now. Then, when you see your doctor tell them that you have been drinking that much water but that you just quit a week ago or however long it has been but that you are thirsty all the time and you have a family history of diabetes. And, that you would like to get tested for that and make sure you don't have water intoxication. Mention that your face has been starting to swell and the blisters but that you have eczema and don't think it is related. But that you have some allergies and thought it was that. But that someone on Medhelp or a friend advised you to get checked.The benedryl cream doesn't have steroid. And, you can get non drowsy Zyrtec.  I have taken it and it isn't too bad. Glad you are working to free yourself of the situation your in.mkh9",
            "post_id": "10150138",
            "timestamp": "1395943653",
            "votes": 0
        },
        {
            "answer": "so an update......the doctor is not going to be back for a while unfortunately....I had zyrtec for the first time (after my earlier 5 day escapade)...well the face swelling has gone down minutely maybe 10% but a;ways flares up when I sweat whilst playing tennis or when I am feeling hot.........I will still continue with this for another 2 days and will see how it goes....broke out with another 2 rashes of small but non itchy blisters on my shoulder.....but will still continue with zyrtec....Could not find benedryl here...unfortunately.....any other non steriod cream you can recommend",
            "post_id": "10155896",
            "timestamp": "1396034590",
            "votes": 0
        }
    ],
    "post_id": "10110456",
    "question": "Hello,Lately I have developed eczema. I saw a skin specialist and she diagnosed it.The initial places on my leg have been healed. But lately i Am breaking out everywhere else. On my back arms .A little background. I developed the flu earlier and the doctor prescribed me Azomax antibiotic and Arinac medicine.After this I developed an allergy on my arm. And excess urination. After an application for 5 days of a steroid cream on my arm the allergic reaction went away. But I then develope excess urination which I am still going through. i urinate alot like 20 times a day.So now I am wondering has the excess urination led me to develop eczema which was in turn caused by an allergic reaction to Arinac medicine?Please someone help.",
    "timestamp": "1395251416",
    "title": "Mystery"
}