{
    "answers": [
        {
            "answer": "I read the study .. for sure post Tx Sx is an area that has not well researched.. it's true also that Inf can cause auto immune disease that we already harbor but not activated .. activated by the Ifn ....This study is very small and sorry to say, Not Important, imo, .. The folks who were recruited responded to ads .. it say's 3000 people in Aust. Tx per year .. 27 responded ...This data is not controlled .... If Every Tx patient recorded their feelings after every Tx and those effects were recorded .. that would be a much different story .. this is not the case here ....Anyone considering these or any other serious treatments should accept responsibility for their decision. As responsible patients we need to make the risk assessment after weighing all the factors .. imo ... this means do not rely on just your doctor to disclose the risks ..\"Participants were recruited in New SouthWales and Victoria via advertisementsplaced in The Hep C Review andGood Liver\"\"Often people who have had more extremeexperiences self-select to be part ofqualitative research\" ...I think the above says it all .. folks who had more after Tx issues are the large % of folks who joined these studies ..As time moves on, and fortunately R&D is moving at a much more accelerated speed than a few years ago .. Future Tx regimes will hopefully help to reduce the of Risk of Tx .. until that time happens ..I'm happy we have a chance at beating this dragon with the tools available .... many thousands have .....",
            "post_id": "7468047",
            "timestamp": "1322982901",
            "votes": 0
        },
        {
            "answer": "27 anecdotal stories from self-selecting patients is not a scientific medical \"study\" by any means. This paper is written by a social psychologist, interested in peoples physiological experiences with hep C and its treatment, not a medical study of hepatitis C, its treatment or its complications/symptoms. It is no surprise then there is no actual medical data in this paper besides genotype and most SVR statuses.\"For those that scoff at the idea of therapy after effects, or think its only a small, insignificant group.\"Nobody has ever said that there are not some people who have health issues after treatment with interferon. But to exaggerate its prevalence in my opinion is to raise unfounded fears about the true risk vs. benefit of treatment in people who are chronically infected with hepatitis C....READ THIS STUDY. \"I did. As \"Recovery from hepatitis C treatments\" states...\"Key recommendations...Further recommendations... People considering or commencing treatment need to be alerted to the possibility of ongoing treatment-related impacts for lengthy periods after treatment finishes, EVEN IF THIS SURVEY FINDINGS INDICATE THAT THE RISK IS SMALL.\"It appears that Mr. Hopwood never read the beginning of the label on peg-interferon, but then again why would he, he is a social psychologist, not an MD.-------------------------------------------------------------------------------------------PEGASYS(peginterferon alfa-2a)Alpha interferons, including PEGASYS, may cause or aggravate fatal orlife-threatening neuropsychiatric, autoimmune, ischemic, and infectiousdisorders. Patients should be monitored closely with periodic clinical andlaboratory evaluations. Patients with persistently severe or worseningsigns or symptoms of these conditions should be withdrawn from therapy.In many, but not all cases, these disorders resolve after stoppingPEGASYS therapy (see WARNINGS and ADVERSE REACTIONS).If this warning doesn't attract attention then maybe we need a skull and crossbones too?Hector",
            "post_id": "7468757",
            "timestamp": "1323018075",
            "votes": 0
        },
        {
            "answer": "Thanks for your help in showing how scientific data is obtained.  We all know there are risks to treatment.  Those of us who undergo it also know the risks of untreated Hep C and we make a decision on which risk is the greatest to our health.",
            "post_id": "7468791",
            "timestamp": "1323019232",
            "votes": 0
        },
        {
            "answer": "Honestly, I thought it was a well known fact that there is the potential for dangerous side effects and possible long lasting side effects.I didn't think any of this was news.Have you read the insert that comes with interferon?Oops, I just saw, Hector posted the scary stuff.Yes, it is a poison. I hate it and can't wait to get off of it but, as of now, its the only thing that will get rid of this virus.",
            "post_id": "7468812",
            "timestamp": "1323020065",
            "votes": 0
        },
        {
            "answer": "I know, I was freaked at taking the drugs and specially with new drugs and old drugs combined I don't know,,,,, there are definitely risks...But I took em, the whole dang thing is a risk,",
            "post_id": "7468839",
            "timestamp": "1323020988",
            "votes": 0
        },
        {
            "answer": "At my EOT meeting all I was given were lab req`s for wk4,12,24 postPCRs . I asked the PA what about CBCs, CMPs , TSH ect..  and she replied that was not nessecary anymore !! .... lolWhen tx is finished you get dropped like a hot potato and I recommendto find a good GP before you even start tx so you have someonewho followed your tx and will support your recovery afterwards.b",
            "post_id": "7468861",
            "timestamp": "1323021594",
            "votes": 0
        },
        {
            "answer": "I agree completely!  They do drop you like a hot potato and usually dismiss any conversation about ongoing side effects....which we all know by now are very possible...and can be permanent.  Very little is ever even mentioned about the potential for long term problems when going into and through tx.  I do, by the way, have a great GP, who is also very aware of Interferon related issues, and treats a group of people who have long term side effects.  We have not yet found any real answers yet, though.  Its unfortunate, but I think in the case of permanent side effects, or prolonged side effects, there seems to be no ideas around what might help reduce or mitigate them.  It was noted that only a few people in the study DID NOT have side effects after stopping tx...and six had long term, and ongoing side effects...all similar in pattern.  (close to a quarter of the group!!)Now, people may protest about the small group, and how can it be valid, and on and on, always trying to delegitimize any and all claims that this is a frequent occurrence. Well I would just like to see one study presented that presents a DIFFERENT picture.  Its always 'the group is too small', or its not selected properly, or they were people with problems looking for an outlet, etc.  The only thing they do not do is show us an empirical study showing that it is indeed only a miniscule percentage who have these long term problems.  I am sorry, I have not been able to find ANY of these studies.  Of course, the nay-sayers always ASSUME that the vast majority of treaters make out very well after tx, using their own very subjective and opinionated approach to make their point.  I see no evidence or scientific support for any of THEIR claims, nor do I see those thousands of people posting on forums of how fantastic they feel now, after finishing therapy.  Oh, I know the answer already.....they have ALL run away, so happy with life they never go on a forum again....just too perked up and energized to pay any attention to any of that old HCV and treatment related stuff!!!  Right?  The scientific approach to the question once again. All assumptions...on their part.  Really.The point I make, is that multiple studies NEED to be done on a very large scale, and  looked at closely by the medical and pharmaceutical community.  We need answers, not glib replies, and dismissive attitudes.  This issue was discussed several times in the linked article.  People all over the world apparently are having similar reactions to what they were 'told' going into tx.  I don't think its just a bunch of us on this particular forum.  The lack of medical oversight and responsibility relating to this issue is truly appalling!DoubleDose",
            "post_id": "7468928",
            "timestamp": "1323023769",
            "votes": 0
        },
        {
            "answer": "I would consider the neurologist who is treating my peripheral neuropathy to be extremely competent. When he learned I had been on IFN tx, the first thing he asked was when the neuropathy manifested after my tx. Based on that, he feels the neuropathy was a result of my diabetes rather than IFN. I have another appt. in a couple months - I'll try to remember to ask him what expeience he has with this issue and/or what he based his opinion on. Apparently there are specialists who are dealing with these issues or there is some type of info out there on which he based his opinion.",
            "post_id": "7469026",
            "timestamp": "1323026381",
            "votes": 0
        },
        {
            "answer": "I don't believe one can prove a negative.  It's up to the positive to be proven.  :)",
            "post_id": "7469069",
            "timestamp": "1323027887",
            "votes": 0
        },
        {
            "answer": "You may also have read that diabetes can be exacerbated by the tx, along with many cases of peripheral neuropathy that have developed after ending tx, with or without diabetes as a causitive or complicating factor.I think there have been quite a few posters on the forum who have complained of developing PN after doing tx.  I would explore this potential issue as thoroughly as possible to determine how many cases are being reported as a result of Interferon treatment.  I am not confident that a neurologist would have that information at hand unless they also treat a good sized cross section of people having been on Interferon in the past.  I am also pretty sure they have very little clue as to what is going on with Interferon post-tx problems, since there has been little publicity on this subject in the medical journals...as we are all painfully aware...   Good luck.DoubleDose",
            "post_id": "7469105",
            "timestamp": "1323028773",
            "votes": 0
        },
        {
            "answer": "I guess you are going believe whatever you want to believe, which is fine. But presenting your conjecture as fact with no basis is not productive.GPs have no extensive knowledge about hepatitis C, liver disease or drugs. So while they may be likeable people doesn't make then an expert by any stretch of the imagination. Because some people are not warned of the possible complications of interferon can't be generalized to every doctor. For example I was specifically warned that treatment could cause my liver to fail. In order to prepare for such a situation a was first put on a transplant list in case the small case of liver failure happened. One on the first things the old-timers on this forum recommend to anyone is to find a knowledgeable and experienced specialist.\"They do drop you like a hot potato and usually dismiss any conversation about ongoing side effects...\" Sorry, but you have had bad doctors.\"only a few people in the study DID NOT have side effects after stopping tx...\"Total nonsense.\"Well I would just like to see one study presented that presents a DIFFERENT picture.\"\"I have not been able to find ANY of these studies.\"All studies regarding the treatment of HCV do. That you won't or can't read them doesn't change the facts.\"The point I make, is that multiple studies NEED to be done on a very large scale, and  looked at closely by the medical and pharmaceutical community. \"Studies to prove or disprove what?\" I am also pretty sure they have very little clue as to what is going on with Interferon post-tx problems, since there has been little publicity on this subject in the medical journals...as we are all painfully aware... \"What medical journals do you read? Medical journals have no studies or articles regarding side effects of peg-interferon? Surely you are joking?I will post some of the non-warnings of peg-interferon that you say is so unknown to the medical community and patients. It is part of the \"top secret\" Pegasys label.Hector",
            "post_id": "7469548",
            "timestamp": "1323040817",
            "votes": 0
        },
        {
            "answer": "Here are some of the warnings that you say doesn't exist and it not acknowledged regarding peg-interferon. I can't even fit all the warning text into a post. Just because you are not aware of the warnings that come with the drug doesn't mean everyone is an unaware as yourself.I don't know how clearer the warnings can be.------------------------------------------------------------------------------------------PEGASYS(peginterferon alfa-2a)....WARNINGS128 General129 Patients should be monitored for the following serious conditions, some of130 which may become life threatening. Patients with persistently severe or131 worsening signs or symptoms should have their therapy withdrawn (see132 BOXED WARNING).133 Neuropsychiatric134 Life-threatening neuropsychiatric reactions may manifest in patients receiving135 therapy with PEGASYS. Depression, suicidal ideation, and suicidal attempt136 may occur in patients with and without previous psychiatric illness.137 PEGASYS should be used with extreme caution in patients who report a138 history of depression. Neuropsychiatric adverse events observed with alpha139 interferon treatment include relapse of drug addiction, drug overdose,140 aggressive behavior, psychoses, hallucinations, bipolar disorders and mania.5141 Physicians should monitor all patients for evidence of depression and other142 psychiatric symptoms. Patients should be advised to report any sign or143 symptom of depression or suicidal ideation to their prescribing physicians. In144 severe cases, therapy should be stopped immediately and psychiatric145 intervention instituted (see ADVERSE REACTIONS and DOSAGE AND146 ADMINISTRATION).147 Bone Marrow Toxicity148 PEGASYS suppresses bone marrow function and may result in severe149 cytopenias. Very rarely alpha interferons may be associated with aplastic150 anemia. It is advised that complete blood counts (CBC) be obtained pre151treatment and monitored routinely during therapy (see PRECAUTIONS:152 Laboratory Tests).153 PEGASYS should be used with caution in patients with baseline neutrophil154 counts <1500 cells/mm3, with baseline platelet counts <90,000 cells/mm3 or155 baseline hemoglobin <10 g/dL. PEGASYS therapy should be discontinued, at156 least temporarily, in patients who develop severe decreases in neutrophil157 and/or platelet counts (see DOSAGE AND ADMINISTRATION: Dose158 Modifications ).159 Cardiovascular Disorders160 Hypertension, supraventricular arrhythmias, chest pain, and myocardial161 infarction have been observed in patients treated with PEGASYS.162 PEGASYS should be administered with caution to patients with preexisting163 cardiac disease.164 Hypersensitivity165 Severe acute hypersensitivity reactions (eg, urticaria, angioedema,166 bronchoconstriction, anaphylaxis) have been rarely observed during alpha167 interferon therapy. If such reaction occurs, therapy with PEGASYS should be168 discontinued and appropriate medical therapy immediately instituted.169 Endocrine Disorders170 PEGASYS causes or aggravates hypothyroidism and hyperthyroidism.171 Hyperglycemia, hypoglycemia, and diabetes mellitus have been observed to172 develop in patients treated with PEGASYS. Patients with these conditions at173 baseline who cannot be effectively treated by medication should not begin174 PEGASYS therapy. Patients who develop these conditions during treatment175 and cannot be controlled with medication may require discontinuation of176 PEGASYS therapy.177 Autoimmune Disorders178 Development or exacerbation of autoimmune disorders including myositis,179 hepatitis ITP, psoriasis, rheumatoid arthritis, interstitial nephritis, thyroiditis,6180 and systemic lupus erythematosus have been reported in patients receiving181 alpha interferon. PEGASYS should be used with caution in patients with182 autoimmune disorders.183 Pulmonary Disorders184 Dyspnea, pulmonary infiltrates, pneumonia, bronchiolitis obliterans,185 interstitial pneumonitis and sarcoidosis, some resulting in respiratory failure186 and/or patient deaths, may be induced or aggravated by PEGASYS or alpha187 interferon therapy. Patients who develop persistent or unexplained pulmonary188 infiltrates or pulmonary function impairment should discontinue treatment189 with PEGASYS.190 Colitis191 Hemorrhagic/ischemic colitis, sometimes fatal, has been observed within 12192 weeks of starting alpha interferon treatment. Abdominal pain, bloody diarrhea,193 and fever are the typical manifestations of colitis. PEGASYS should be194 discontinued immediately if these symptoms develop. The colitis usually195 resolves within 1 to 3 weeks of discontinuation of alpha interferon.Ulcerative196 colitis has also been observed in patients treated with alpha interferon.197 Pancreatitis198 Pancreatitis, sometimes fatal, has occurred during alpha interferon treatment.199 PEGASYS should be suspended if symptoms or signs suggestive of200 pancreatitis are observed. PEGASYS should be discontinued in patients201 diagnosed with pancreatitis.202 Ophthalmologic Disorders203 Decrease or loss of vision, retinopathy including macular edema, retinal artery204 or vein thrombosis, retinal hemorrhages and cotton wool spots, optic neuritis,205 and papilledema are induced or aggravated by treatment with PEGASYS or206 other alpha interferons. All patients should receive an eye examination at207 baseline. Patients with preexisting ophthalmologic disorders (eg, diabetic or208 hypertensive retinopathy) should receive periodic ophthalmologic exams209 during interferon alpha treatment. Any patient who develops ocular symptoms210 should receive a prompt and complete eye examination. PEGASYS treatment211 should be discontinued in patients who develop new or worsening212 ophthalmologic disorders.213 PRECAUTIONS214 General215 ·  The safety and efficacy of PEGASYS have not been established in216 patients who have failed other alpha interferon treatments.217 ·  The safety and efficacy of PEGASYS for the treatment of hepatitis C in218 liver or other organ transplant recipients have not been established.7219 ·  The safety and efficacy of PEGASYS for the treatment of patients with220 HCV co- infected with human immunodeficiency virus (HIV) or hepatitis221 B virus (HBV) have not been established.222 Renal Impairment223 A 25% to 45% higher exposure to PEGASYS is seen in subjects undergoing224 hemodialysis. In patients with impaired renal function, signs and symptoms of225 interferon toxicity should be closely monitored. Doses of PEGASYS should226 be adjusted accordingly. PEGASYS should be used with caution in patients227 with creatinine clearance <50 mL/min (see DOSAGE AND228 ADMINISTRATION: Dose Modifications ).229 Information for Patients230 Patients receiving PEGASYS should be directed in its appropriate use,231 informed of the benefits and risks associated with treatment, and referred to232 the PEGASYS Medication Guide...............................................................................................................................................................................................Hector",
            "post_id": "7469577",
            "timestamp": "1323041549",
            "votes": 0
        },
        {
            "answer": "So I guesswhat you are saying is that yes, there are hundreds of possible long term side effects possible from interferon use, and yuo have provided a laundry list of what might happen.  Now we just need to have some broad follow up studies to see how many and what percentage have ended up with some or many of the long list of possible sx that you listed.  Thanks you for the list.  I had thought you did not believe in long term interferon sx!  Silly me.DoubleDose",
            "post_id": "7469693",
            "timestamp": "1323043871",
            "votes": 0
        },
        {
            "answer": "And also please read my comments again, because you answer questions I did not speak to.  I was discussing LONG TERM sx follow up studies, not treatment sx.  The linked study also, DID most definitely say that only TWO people in the group did not have negative or adverse effects after ending tx.  Did you actually READ the linked study?   I am not saying these things, the people running the study and the participants are saying what I noted above.Please, also SEND us a link to ANY study that addresses LONG TERM AFTER EFFECTS of Interferon, that I supposedly have not even read, and I will thank you for enlightening me.  WHICH studies are you actually referring to?  I only know of studies looking at sx experienced DURING tx.  We are speaking about AFTER EFFECTS.If you think all the doctors and drug companies are warning patients about the liklihood of LONG TERM or PERMANENT after effects, why then is nobody on the forum, nor in the linked study hearing any of these warnings????  Maybe you had the only up to date, fully informed doctor out there!  You were fortunate in that case.DoubleDose",
            "post_id": "7469715",
            "timestamp": "1323044352",
            "votes": 0
        },
        {
            "answer": "Thank you.I don't know if causation of my diabetes and PN will ever be untangled since:HCV also carries a threefold increase in risk of developing DM.I always had what my GP called \"boderline or pre-diabetes\" based on my fasting glucose - which my neuro doesn't believe in. He says you're either insulin resistant or you aren't.Geno 3 left me with NAFLD which hasn't resolved post-tx.I also had low B12 post-tx. I take CerefolinNAC offlabel for my PN and B!2. (Both my GP and neuro' swear it's not for my dementia :-).My weight was 220-225 pre-tx with post-tx rebound to 230+. Dropped to 195 once I started Metformin and has held steady there for years.And that's without even getting into my cholesterol, blood pressure, insomnia, etc. etc.And that's just one patient's post-tx symptoms. Can you imagine trying to catalog and analyze the problems of a representative sample of post-tx patients? I've sorta given up hope on studies and just accept what it is is what it is. I'm just glad that a bunch of pills help me live a normal, active life and hang out here to see what other people have found that might help.Take care.",
            "post_id": "7469806",
            "timestamp": "1323046897",
            "votes": 0
        },
        {
            "answer": "GPs also have limited knowledge of diabetes.  So I wouldn't rely on anything a GP said about diabetes.If I want information about diabetes (I have type 1, autoimmune diabetes), I ask my ENDOCRINOLOGIST.  Not a GP.Questions I might ask my GP include:  a) Hey, does this look infected? or b) Can I have a referral?Uh, yeah, that's about it.",
            "post_id": "7469825",
            "timestamp": "1323047358",
            "votes": 0
        },
        {
            "answer": "Oh yeah, and my GP is apparently in denial about his own DM. He wanders around the office with his nurses yelling, \"Next time all I'm going to do is call the ambulance for you!\"Please don't tell me to get a different doctor. Where I live it's a 2 hour drive to the nearest GP and 5 hours to the nearest specialist - and I'm short on gas $. If anyone is entitled to self-diagnosis over the internet, it's me.",
            "post_id": "7469844",
            "timestamp": "1323047959",
            "votes": 0
        },
        {
            "answer": "That should have read \"... wanders around the office eating a candy bar...\"",
            "post_id": "7469846",
            "timestamp": "1323048036",
            "votes": 0
        },
        {
            "answer": "Look, I think there's a lot of things in life that suk, but there isn't much we can do about it.There's the pharmaceutical companies whose concerns are more about profit then care.They aren't going to pay for studies which don't have the end result of making them money.There's the US military which won't admit to the numbers of people with hepC from air-jet vaccinations during boot camp.I saw a show on TV insinuating all those Vietnam vets got hep C in Vietnam. Not true.There isn't going to be research to implicate interferon in long term side effects which would hold them culpable. It just isn't going to happen.They'll say all the potentials are in that long list Hector provided and the law says that's all they have to do.If I'd been told to check my liver  when I first showed this big red spot on my chest to a dermatologist, who said, \"sun damage,' maybe I would have been diagnosed before I had decompensated cirrhosis, and needed a transplant.Sh!t happens. Sometimes, we just have to accept it and move on.You can fight it, but I think all you will do is end up feeling worse.OH",
            "post_id": "7469901",
            "timestamp": "1323049101",
            "votes": 0
        },
        {
            "answer": "just WHAT are the post tx. probs? I have been very upside down since my last round, but chalking it up to lots of death in my fam and trying to catch up with my life & $$ afterwards! i am still not cleared as i relapsed twice, so i am not sure why i feel like a sub human most of the time. i do have lots of energy to begin with and that is what is keeping me going. i really hope i can find the right tx for me and kill this thing.i am tired all the time, but not sleeping very well....",
            "post_id": "7470441",
            "timestamp": "1323066958",
            "votes": 0
        }
    ],
    "post_id": "7467946",
    "question": "Sandalwood posted this study in the thread below on long term side effects after tx.  I found this to be a real eye opener, in that it really validates the randon percentages of treaters that are reporting the exact same problems we have been discussing here on the forum.  Thanks for posting this study, because it is very personal, comprehensive, and jarring!  Look at the percentages of the 27 test subjects who report all sorts of issues.  Consider how this random group could be extrapolated out into the entire treating community.  I find the comments and conclusions in this piece to be the FIRST and ONLY that have honestly and thoroughly looked at this issue.  The actual experiences of people after finishing therapy.  For those that scoff at the idea of therapy after effects, or think its only a small, insignificant group....READ THIS STUDY.Thanks for finding this study Sandalwood.!!!  Its unique.  Here is the link.  Note especially pages 16-20...and conclusions...http://www.sprc.unsw.edu.au/media/File/Recovery_from_hepatitis_C_treatments.pdfI think we have only scratched the surface of the iceberg here on the forum.  Who knows what the real long term issues might really involve, and how many are really affected.  Like people say in the study...Where ARE the studies?  Who did warn any of us of these long term problems?  What are the doctors and drug companies doing to find out what is really the status?   Read and enjoy....or cry...whatever the case.DoubleDose",
    "timestamp": "1322977774",
    "title": "Please read this important study on post-tx experiences***"
}