{
    "answers": [
        {
            "answer": "Are you counting those that aren't at risk as well so you can determine a percentage? From your list I would say I am not. The only item that is a slight risk for me is the hypertension, maybe. I'm fine at home but jump up to the 140's at the doctor. But now I'm on Diltiazem for chest pains and arrhythmias. That helps with the BP too.I don't see age factored in there, say menopausal women. Is estrogen not that important to heart disease?",
            "post_id": "2824491",
            "timestamp": "1209081255",
            "votes": 0
        },
        {
            "answer": "I guess I would be that factor. Iam 37 years oldI am obese and my lifestyle mainly, even though I have 4 boys, is non movement. (I have tumors in throughout leg and makes it difficult to get around)If you are talking about family history also for diabetes, my dad has it got it younger them my grammy.blood pressure is very good 85/54, non smokernot sure about cholesterolMichelle",
            "post_id": "2824604",
            "timestamp": "1209082837",
            "votes": 0
        },
        {
            "answer": "Hi Dr. Kirksey!Thanks for the information and for polling our members....I believe my current risk of heart disease is low and I'm hoping to keep it that way.  I do have a family history (Dad had CABGx4, Type II diabetic, PAD, ICD...Fortunately, his medications seem to be keeping things in check).I take Lisinopril for optimal BP control (History of PVC-induced cardiomyopathy and moderate MR).Good cholesterolNo diabetesNon smokerWalk at least 5 days/week  - I should work on this and add more exerciseNormal weightNo claudication in legsThanks again!Connie",
            "post_id": "2824778",
            "timestamp": "1209085019",
            "votes": 0
        },
        {
            "answer": "We are all vulnerable. 50% of us will die from it and 80% have it when they die. The technology is coming along very slowly. I have family history and have gone through the old hit and miss tests. EKG and Echo ,stress test then nuclear stress test then invasive angiogram. Even though the angiogram showed no narrowing, it doesn't show how bad my arteries are diseased, if at all .You can pass an angiogram with flying colors and still have bad plaque that has not caused stenosis. The Intra vascular ultrasound apparently shows soft plaque but is not readily available. Its no wonder so many people have the disease and don't know it ! Medicine is very reactive, not proactive. I fear cardiologists are financially hooked on angioplasty and bypass sugery and may be a little concerned their livelyhood will suffer if they actually prevent CAD in society. I hope I'm wrong.",
            "post_id": "2825047",
            "timestamp": "1209089283",
            "votes": 0
        },
        {
            "answer": "Wow, e.r. boy you sure don't sound too hopeful for the future, I hope you feel better than you sound.I was told I am low risk, my only real risk factor is that I'm still about 50 pounds overweight. That first 60 came off fast but this last 50 is a bear. I have low and controlled cholesterol levels (TC 151), controlled blood pressure (105/70), no family history of early onset heart disease or stroke, no smoking ever, no diabetes and walk 3 miles every day in 45 mins on a treadmill with no leg pain or symptoms at all. I try to burn 3,000 cals per week. I have had 3 nuclear stress tests and echos over the last three years, all normal and normal blood work as well.So far so good for a 50 year old man I guess. Someone knock on wood for me!Jon",
            "post_id": "2825394",
            "timestamp": "1209094752",
            "votes": 0
        },
        {
            "answer": "Yes, I am better than I sound and that's because I've taken my health into my own hands.  Do you realise that the number of people who die of heart disease is the equivalent of something like 40 jumbo jets crashing to earth every day ? Do you think they would fix the problem if that many jets crashed every day ? When I sat waiting for my angiogram I talked to many people who were on their second bypass, 4th stent, etc and were ill again. With the medication we have available that is unacceptable. All we ask is to have 80 years of good health without suffering from heart attacks and strokes which lower our quality of life considerably. I'm happy to hear your numbers are good!",
            "post_id": "2826316",
            "timestamp": "1209124687",
            "votes": 0
        },
        {
            "answer": "As I posted in the other thread, my risk should be very, very low.family history good (both lived into their 90's, no early MI)no strokebp good (should be better though, trying to find a doctor who will rx for it)lifelong low cholesterolno diabetesnon smokerlots of exercise (3x/week, cyclist in summer, walk in winter)normal weightno claudicationbut I'm here, and even my doctor thinks my chest pains \"could be\" angina (vasospastic). He won't order further tests because of my \"low cardiac risk\"!! Even after an equivocal nuclear stress scan!",
            "post_id": "2826778",
            "timestamp": "1209132299",
            "votes": 0
        },
        {
            "answer": "3 of 4 grandparents died of heart disease.No strokes.I have battled high blood pressure for years.Ditto, Cholesterol.I am diabetic, but it's controlled with an A1C of 5.9.I smoked when younger.Was 20% or more overweight 1/2 of my life (I'm 66 years old).Had claudication in my right calf but regular exercise caused it to end.I've had three small MI's, and have eight stents.",
            "post_id": "2828376",
            "timestamp": "1209155265",
            "votes": 0
        },
        {
            "answer": "Great thread!  I had mitral-valve-repair surgery, but otherwise am in excellent health.  My mother, however, died of congestive heart disease at 56, and two grandparents on her side died of it too, although they were in their 70s.  My question for you, or others, is: if your Cholesterol and high blood pressured are being controlled, but once were high, do they still count as risk factors?  If so, then I'm at risk.  If not, then, despite my surgery, I'm not at risk.Take care!",
            "post_id": "2828905",
            "timestamp": "1209162932",
            "votes": 0
        },
        {
            "answer": "Now you're talking!  I tend to sgree that finances are a good part of the slow (if any) progress being made in preventing heart disease.  Sort of like killing the goose that lays the golden eggs.All the docs can come up with is \"risk factors\".  Nothing meaningful as far as what really causes heart disease.  About all these risk factors do is lay the blame on the patient for being sick.Fight the good fight !",
            "post_id": "2829979",
            "timestamp": "1209180263",
            "votes": 0
        },
        {
            "answer": "Good question. Well controlled medical conditions still constitute a risk factor. I described very general risk factors which did not include biochemical metrics like c reactice protein, hgb a1c, fasting lipid profile and a host of other less commonly discussed, non insurance reimbursed, but exceptionally predictive biochemical measurements. I think that these well known metrics present a measurement that most people understand.",
            "post_id": "2831500",
            "timestamp": "1209227825",
            "votes": 0
        },
        {
            "answer": "I agree with you to a point.  I agree that traditional medicine is focused on high cost diagnostic methods and procedural treatments. In this regard, medicine behaves as a market economy should in that it adjusts to provide for advances in products and services where the major focus is located. I think the problem is that reimbursement, which at the end of the day is a major driver of where product and services are developed in any industry, is absent for preventative measures within the third party of government supported healthcare.Until your primary care doctor is compensated based on his ability to keep you healthy, risk free and off medication by an educational multidisciplinary process that includes dieticians, exercise counselors, genetic counselors for those with familial disorder and stress management counselors because we know that this contributes to disease. Until someone pays a pcp to do this complex process more than they pay him for being a distributor of high cost pharmaceutical drugs, there will be minimal change in practice patterns.Additionally, on the patient side, until there is some punishment for people who use an excessively high amount of health care resources because of life style behaviors which lead them to illness like smoking, sedentary, elevated BMI. Until there is that responsibility on the patient side with some financial impact, then any system is up against insurmountable challenges",
            "post_id": "2831528",
            "timestamp": "1209228557",
            "votes": 0
        },
        {
            "answer": "Hmmmmmmm.  I remember when doctors became doctors with the #1 goal of helping their fellow man, and being of service to their communities.  This idea, of course, is long gone now.  If a doctor is interested ONLY in money, maybe he should consider car sales or selling time-shares instead of doctoring.  As far as I can tell, PCPs are pretty much a crapshoot.  You call to make an appointment and get a recording, in the middle of the business day, explaining what their business hours are and advising you to call 911 or go to the ER.  Or they can call you back if you REALLY think you need to see the doctor.  And they sometimes actually do call back, maybe same day or maybe a week later.  This kind of an operating system is fine for a guy who is selling used auto parts, but does not really lend itself to a medical office.  The point is that we are dealing with an industry that benefits from us (we the sheeple) NOT being healthy.You seem to have tendencies toward government administered health care.  What a wonderful idea!  Just look at what a success medicare and the VA system are.  That's sure something to look forward to.We complain about our ERs being clogged with folks that use them for everyday health care  With the newly discovered independence of the medical community, there is little if any choice.  Hell, the doctors themselves tell you to go there.  I really do feel bad about taking up the medical professional's time with my paltry ailments.Oh, I meant to reply to your reply...............what I'm trying to say is LOL, how sad.  I really do feel sorry for you poor, poor doctors.",
            "post_id": "2834147",
            "timestamp": "1209300326",
            "votes": 0
        },
        {
            "answer": "Hi.  Well I think I must be high risk:Risk factors include:Family history MI     ( mother, father, and grandparents on both sides)Stroke                    (in question)   Just a couple little TIA'sHypertension          (was 165/101 before meds, now ~120/78  but flys easy.High Cholesterol    (was 236 total ldl153/hdl 69 with meds now 203 total &127/56 )Diabetes               (father, unkle) mines good at 101Smoking               (yes COPD- but, trying to quit now)Sedentary lifestyle   ( 3 mo. out of each year-Yes, but now starting to exercise.)Obesity - greater than 20% of ideal weight      (? 5.5 and 165 pounds Fem.)claudication-calf or thigh pain with walking exertion   (yes.  After 15 minuts of sitting or laying/stiff)How may members are high risk ie 2 or more risk factors??     (~5)As mentioned earlier, hs CRP is always up anywhere between 6-20 on a 1-3 scale.  And EKG are always off.  Example of last one done in January:EKG  2008A:  Female 5.5   40 yrs old    157 LBS.Sinus arrhythmia, probable normal variant, ST-T changes in inferior leads, borderline abnormal for age and sex, interpret together with clinical data.  Summery: abnormal  *unconfirmed analysisEKG  2008B:Ectopic atrial rhythm, sino-atrial 2nd degree mobitz ll block, possible old anterior infarction, ST-T changes in inferior leads, changes are abnormal for age and sex, interpret together with clinical data.  Summery: abnormal  *unconfirmed analysisA lot of things circled on the ecg.  Would not have even known about this if I didn't have a friend talk me into it (on here) being all right to request my medical  records.  Is or could this be normal?Was told not to worry about it since the  2006 stress and echo's were fine, I only had a Interatrial septal aneurysm which was nothing to worry about because the two sides were not conflicting with each other, nothing else to do, so I just had to bloom???  (I guess change my lifestyle)  Is this anything or just me.  I have started to put all my test in my journal to post to a Dr. after I'm done.Bottom line from what I understand is that: the way we live our lives, we pretty much make our own risk factors.  The ones listed are good guidelines to start with.  Then again,  I'm not educated in the field; but, you have to start somewhere.  For me I think it's just a good hard kick to get me exercising again.  ha ha.Sorry if it's too much information.Amy",
            "post_id": "2834488",
            "timestamp": "1209308698",
            "votes": 0
        },
        {
            "answer": "With all due respect. In most areas of the nation, the day and age of the \"private practice physican is over\". My primary care colleagues who still maintain private practice structures occasionally go without paychecks to meet their payroll obligations and they do this because they want to continue to practice good medicine and provide a service to the community. Most PCP's are now employees of larger organizations like kaiser permanante or a univerisity. So, its a bit inaccurate to blame your doctor when no one answers a phone or you have an 8-5 mentality within the \"new\" era of medicine.If you interpreted my post to suggest that nationalized medicine is the answer, I did a poor job of communicating. Since the inception of medicare, we have had nationalized insurance outside of the VA. Medicare is government healthcare system, its just been privately administered. Your comment that physicians are to be held to a high standard is accurate. I was trained that a professional is a highly trained and specialized providor of a service who is compensated for providing that service. When the professional is not available, the professional makes arrangements for their service to continue uninterrupted. By relegating a new generation of physicians to an employee mentality, society has unfortunately undermined the very professionalism that they have come to expect. Bottom line, if society want and expects highly trained and highly accountable professionals, society must be willing to treat them with a degree of respect due to professionals. And part of the \"perceived\" aspect of respect is compensation. Perhaps US Senators, professional athletes and Corporate CEO's should decrease their compensation by 10% per year to demonstrate how benevolent they are for their field of passion. We all should aspire to practice our occupation with passion and hopefully we would do it even if we were working for free. Perhaps we could all benefit from recognizing that this is a complex problem with many features of the system broken. I would be interested in hearing about your solution aside from \"shooting the doctors\"",
            "post_id": "2834900",
            "timestamp": "1209317493",
            "votes": 0
        },
        {
            "answer": "Please let's keep the post on topic. Dr. Kirksey is one of the volunteer Doctors for MedHelp that answers several free questions every day and also does a terrific job in providing content and getting involved with the community side of MedHelp.Let's not turn this into a debate about the healthcare system. There are many members that appreciate the doctor's time, so let's not ruin it for them by hijacking the thread.MedHelp",
            "post_id": "2835562",
            "timestamp": "1209330687",
            "votes": 0
        },
        {
            "answer": "Hi.  I guess by the 10 factors above I'm a vulnerable and ignorant patient too.  I just meant that I think on top of those 10 factors, we also play a big difference in the lifestyles we lead.I put the rest down for some hope on getting help for my own understanding from the Dr.  I Am Sorry if I was included in the MH post or put down anything to offend anyone. Even though I really like my Dr. she did not let me know about this and I was just curious if there's anything to an ecg.  Sorry again,I got off the subject.   It was by far not my intention.  God Bless you for just being there for all of us.Amy",
            "post_id": "2835674",
            "timestamp": "1209332690",
            "votes": 0
        },
        {
            "answer": "Dr. KirksyI admit to at least 2 of the above: (1) obesity (currently 6' 4\" and 265 lbs but workout regularly at gym and slowly losing weight--my height hides the weight well and most people seem surprised by my \"obesity\" label) and (2) hypertension (but BP now well controlled at ca. 105/70 with med combo of cardizem, altace & HCTZ).A further risk factor is a high calcium score. I recently had a 64 slice CTA and although I no blockages of 30% or more were found, it was determined that I had a CAC score of 740 (placing me in the 90th percentile for my age -- age 65). I was prescribed vytorin as a consequence which reduces my total cholesterol from ca. 200 down to 104. BTW I also have an enlarged LA (5.5 cm) and am in persistent afib (well rate controlled with a resting HR of about 65 average and am asymptomatic).Would you say that because of the obesity, history of hypertension, high calcium (CAC) score and enlarged LA that I am at serious risk?Tony",
            "post_id": "2837234",
            "timestamp": "1209371056",
            "votes": 0
        },
        {
            "answer": "I know I am at high risk for heart disease as I already have it.  I've had several heart attacks, MVP, Aneurysms, an ICD implanted, take $700.00 of meds every month, have extensive atherosclerosis as determined by CT scans and an EF of 25% and had CABGx5.Unfortunately, like the majority of people, I didn't know or care about the risk factors until it was too late.I do have to say the doctors, nurses and hospitals I have been in have been wonderfully caring and helpful in keeping me alive.",
            "post_id": "2837412",
            "timestamp": "1209379775",
            "votes": 0
        },
        {
            "answer": "Tony,I've always wondered if a risk factor is controlled (ie: hypertension), is it still a risk factor?  I'll be interested to read Dr. Kirksey's response.pusher,Your situation sounds similar to my Dad's.  He also takes quite an array of medications, but is greatful to his doctors and medical team for keeping him well and with a good quality of life.  My Dad has a Bi-V pacemaker/ICD and so far, indications are good that it has helped to improve his EF from 24% to low 40's.  How long ago was your ICD implanted, and does it have a dual pacemaker?  Here's to a long and full life!!!  Be well!connie",
            "post_id": "2837552",
            "timestamp": "1209383746",
            "votes": 0
        }
    ],
    "post_id": "2824466",
    "question": "Who is a Vulnerable Patient?Each year close to 1.4 million people in the United States experience a heart attack and in excess of 500,000 die from it. Amazingly, 50 to 70 percent of those individuals who died from a heart attack were not aware of their risk. Worldwide, over 19 million people die from a heart attack each year.Definition of a vulnerable patient:Individuals who are at risk of a near future heart attack are called vulnerable patient. One way of characterizing this population is to define those with 5% or more risk of heart attack in one year. In other words, in 10 years one out of two vulnerable patients will definitely experience a heart attack.Risk factors include:Family history MI (sister, brother, mother, father)StrokeHypertensionHigh CholesterolDiabetesSmokingSedentary lifestyleObesity - greater than 20% of ideal weightclaudication-calf or thigh pain with walking exertionHow may members are high risk ie 2 or more risk factors??",
    "timestamp": "1209080845",
    "title": "Poll-How many members are Heart Disease Vulnerable"
}