{
    "answers": [
        {
            "answer": "I forgot to mention...my son is also a pumper.  He is 10-1/2 and has had diabetes for 7-1/2 yrs.This year, although he has supplies in the health office and in the classroom, he is doing most of his testing in the classroom.  He keeps his glucometer in his desk and I brough in a plastic container with a lid that has juice boxes, some peanutbutter crackers, sm. gel frostings, batterise for the pump, alcohol swabs, etc.  In the nurse's office he has all of the above plus more lancets and a glucagon kit.  There is not a \"NURSE\" onsite.  There is a District Nurse who floats around to different schools.  At school there is a Health Tech.  The Health Tech once told me \"I still say the Lows are better than the Highs\"  She is very educated, huh?  The District Nurse says she trained her.Ea. year I meet with my son's new teacher prior to the first day of school.  I am not looking forward to middle school wherre he will have more teachers...ughh!My son has a cell phone in his backpack that is turned off during the day, but if he had to he could call me. I have always told the school that if he ever says to call his mom, they need to do so.  My son also carries a small tube of gel frosting in his pants / shorts pocket, so he has a sugar source with him at all times.  He is still in elementary school so the backpacks stay right out in front of his class and the only other teacher he has is P.E.",
            "post_id": "2434586",
            "timestamp": "1127192400",
            "votes": 0
        },
        {
            "answer": "Immediately go to the principal.  If no help there, go to the superintendent of the district.  If no help there, go to the school board.  You should not tolerate that type of treatment for your child.  You and your child have rights and the school nurse obviously isn't properly trained.",
            "post_id": "2434582",
            "timestamp": "1127192400",
            "votes": 0
        },
        {
            "answer": "Hello,I suggest that you follow foxylady's advice.  The school is beahving and handling this completely wrong.If you would like to talk to communicate via email with a volunteer like myself, please copy and paste the below link into your browser.This is completely unacceptable.http://www.jdrf.org/index.cfm?page_id=103451SS",
            "post_id": "2434583",
            "timestamp": "1127192400",
            "votes": 0
        },
        {
            "answer": "Hello again,I had to post again to give you some more specific information.  These school issues really get me going because I have come across some ignorant people as well when it comes to my son and his care at school.  If taking the steps that foxylady gave you does not get the proper care for your son, do the following:1. Call the school's district office and find out who the 504 Plan Coordinator is.2. Type a letter requesting a 504 plan meeting.  Make sure you say that you include something along these lines somewhere in your letter.......I understand we need to go through the eligibility process; however, I would like to also write the 504 plan at this meeting which will include a comprehensive health care plan, therefore the appropriate personnel needs to be in attendance.3. Make sure you CC the following:US Dept of EducationOffice of Civil RightsYour state's Dept. of Education(Mail this letter to the depts. above, as well as your school's disctrict office to the attention of the 504 Plan Coordinator - his or her name)(Before mailing these, get a letter from your son's endocrinologist stating what your son needs while at school or type it yourself and request the doc's signature - he or she can revise it where needed)At your 504 Plan Meeting bring with you the signed letter from your son's endocrinologist.I understand that your son is in middle school whereas mine is in 5th grade, but I have made a One Page Instruction Sheet that gives basics on what to do based on Blood Sugar readingsUnder 80 do thisBetween 80 & such and such do thisOver 250 do thisIn addition, I have made a one page sheet that tells some symptoms my son might experience when low and high and explains the immediate need for something with sugar in it when he is low and that low blood sugar left untreated can cause convulsions, loss of consciousness and death.  This sheet also has a photo of my son on it.  I have made sure this is given to anyone employed by the school or volunteers who might come in comtact with my son.  Lunch staff, yard duties, etc.Promise to stay in school?  As if he asked for this disease and wants to get out of school.  They do not know how high / low blood sugar makes your son feel.  My sis also has type 1, so last yr. when I had a meeting with the nurse & principal because of a problem, I brought my sis with me, so they could hear an adult's perspective because sometimes people discredit (is that a word?) children /teens.You can submit a form reiterating the info. about the school by going to that page - the link I gave in my earlier post and possibly we can get hooked up one on one because I volunteer there, as well.They let him wander around?  They obviously do not understand the severity of low blood sugar.  You need a 504 Plan.",
            "post_id": "2434585",
            "timestamp": "1127192400",
            "votes": 0
        },
        {
            "answer": "So sorry to be late with a reply, but I'm grateful to see the terrific suggestion you received from SS.  If your son is in public school, they have a legal obligation to be far more responsible and to provide an aide if needed.I know a woman who fought successfully to be involved in the hiring decision for the aide who helps her daughter (who is also developmentally delayed) **and** this woman provide works with a pump trainer to do the training.  Close coordination is needed.Don't stop 'til you get results.  You may need to bring strong pressure on the administrators, sicne they seem to be violating the law and are clearly jeopardizing the well-being of your child.  That nurse seems very unprofessional.Good luck with this.  You simply must prevail.",
            "post_id": "2430344",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "Where do I start.We do have a 504 plan( it worked beautifully in elementary school) that states they are not to let him go anywhere by himeself when he is low. They told me last year it is not possible for them to know where every student is at any given moment? SCARY! I did go to the principal then the superintent of our district and you know what he said to me.. You'll have to excuse me I don't know much about this diabetes stuff . He had plenty of time to prepare for our meeting. I have meet with the 504 coordinator as well, he was at all those meetings( NO HELP). He is securely in the pocket of the district . As for the nurse she is only there one day a week and I told the VP I would rather she had no contact with my son. They didn't even think what she said was neccesarily a bad thing ugh! He has 6 teachers this year and one said to me the other day that he will be over this party soon and that will be good,when he is regular? what the $%#@& does that mean? Educated ,I think not! They treat me like I don't know what the heck I am doing , \" all the other diabetic we have had in the school don't seem to have all these highs/lows. I swear some of his flucuation is because he knows No one there has a clue and if there is a big problem he's #%&$#$@( up a creek with no paddle). He carries a cell phone,gluometer,carbs. I feel like I am always fighting up hill with this district. Who can I get to come to my next 504 so I can rely to them the importance of his 504 and this disease. I just sent his teachers and VP this.I got this from JDRF I beleive. I just want them to take this  serious.ABOUT DIABETESforTeachers and School PersonnelofDante Rucker2005/2006Dante Rucker is different than other diabetics you may know. He ison a regimen of Intensive Insulin Therapy and uses Insulin Pump.Please take the time to read this information. Therapeutic strategiesfor diabetes are changing rapidly and it is important that individualssupervising young people afflicted with diabetes be aware of thenature of the disease, the treatment as well as the problems that canoccur on a daily basis. Some of the material covered is technical;however, I have tried to present it in a non-technical fashion. Muchof the information presented is applicable to other children (andadults) with diabetes.What is an Insulin Pump?An Insulin Pump is a miniaturized version of thedevice you see in hospital movies attached to a pole those meters bagsof \"liquid stuff\" into the patient's I.V. An Insulin Pump contains alarge syringe filled with insulin, a computer that allows the user totime and adjust the administration of insulin to their bodies, and asmall motor to drive the syringe. Attached to the end of the syringeis a sterile tube (infusion line) fitted with a needle which isinserted into the soft tissue of the lower abdomen. The entire fluidsystem (needle, infusion line, and syringe) must be changed every fewdays to maintain a sterile environment and avoid infection at theinfusion site on the abdomen.Diabetes Explained: Dante suffers from Insulin DependentDiabetes Mellitus (IDDM) also known as Type 1 Diabetes or JuvenileDiabetes. IDDM is an AUTOIMMUNE disease that destroys the cells inthe pancreas that produce the hormone insulin which is required tometabolize glucose (blood sugar) and provide energy for cells in thebody. People afflicted with IDDM produce no insulin whatsoever.Approximately one million people in the United States suffer fromIDDM. Dante will be afflictedwith this disease until there is a cure. Another 10 to 12 million peoplesuffer from Type 2 (adultonset) diabetes where the pancreas fails to produce enough insulin.Type 2 diabetes is a 'different' disease with symptoms andcomplications that are similar to Type 1 diabetes. Type 2 diabeticscan sometimes control their disease with diet alone or with the helpof oral medications.Short TermProblems Associated with DiabetesHIGH BLOOD SUGAR Without insulin the body cannot use glucose andshifts from metabolizing carbohydrate (glucose) to metabolizing fatfor energy. This shift is accompanied by elevated blood sugar levels(hyperglycemia) and normal, acidic by-products of fat metabolismknown as ketones. When fat isthe main energy source, ketonesaccumulate and move the body's electrolyte balance into the acidicrange, causing excessive urination and dehydration as the body triesto reestablish its acid balance by excreting the ketones. This lifethreatening condition is known as diabetic ketoacidosis (DKA). Totalinterruption of insulin to a person with IDDM can result in DKA within4 to 8 hours.Regular blood sugar testing can detect elevated bloodsugar levels and the onset of DKA and timely action can be taken toprevent problems from occurring.LOW BLOOD SUGAR Without an adequate supply of carbohydrate tosupport immediate metabolic requirements, a diabetic may experiencelow blood sugar (hypoglycemia). The symptoms of mild low blood sugarmay include among other things; tremors, tingling, palpitations,sweating, anxiety, shivering, dizziness, confusion headache, speechimpairment, drowsiness, weakness, hunger, and blurred vision. Severelow blood sugar is associated with impaired cognitive function thatresults directly from brain glucose deprivation and may lead tounresponsiveness, coma, or seizure. The changes mentioned above maygo unnoticed by a casual observer,however, the person experiencinglow blood sugar can usually recognize and treat the symptoms withoutoutside help. Because symptoms of low blood sugar can rapidlyprogress from moderate to severe if untreated, a person experiencingthese symptoms should not be left alone until action is taken and hisblood sugar levels are raised.Known Long Term Problems Associated with Diabetesand Long Term Elevated Blood Sugar LevelsDiabetic Retinopathy the deterioration anddestruction of small bloodvessels in the retina leadingto loss of vision. Theleading cause of blindness inthe United StatesProteinuria and elevated levels of proteinNephropathy in the bloodstreamdamaging the kidneys andother organs. The leadingcause of kidney failure inthe United States.Neuropathy damage to the nervous systemresulting in the loss ofsensation in the skin andextremities. Combined withthe effects ofperipheralvascular complications, theleading cause of amputationsin the UnitedStates.Cardiovascular and damage to capillaries,Peripheral Vascular increased risk of stroke,Complications ischemic heart death, andother microvascularcomplications.Any or all of these complications may appear in as little as fiveyears if blood sugar levels are not maintained at near normal levels.Example: a 20 year old Diabetic has just undergoneeye surgery to forestall damage to her retinas (both of them)caused by Diabetic Retinopathy.Treatment of IDDMFor years, most diabetics have taken two and sometimesthree injections a day of insulin to control their bloodsugar levelsand manage their diabetes. With this level of control it is almostimpossible to maintain near normal blood sugar levels and the onset oflong term complications is inevitable. Since 1923 it has beenRecommended by endocronologists that blood sugar levels be maintained asclose to normal as possible. It was not until 1993, however, that it wasunequivocally demonstrated by the conclusion of the 10-yearDiabetes Control and Complications Trial (DCCT) thatintensive bloodsugar management can dramatically reduce the risks and complicationsof diabetes. The trial consisted of 9000 patient years of observationof one group of patients on intensive insulin therapy and anothergroup using the conventional 2 to 3 shots a day. The results of thetrial demonstrated for the intensive therapy group a 76 percentreduction in the risk of development of retinopathy, a 54%reductionin incidence of nephropathy (kidney disease), a 60% reduction inIncidence of neuropathy, a 34% reduction in the development of highcholesterol, and a 41% reduction in the risk for heart attack andstroke.The intensive therapy group used two methods to control their bloodsugar levels:1) Multiple Daily Injections (MDI) consisting of threeor more injections of insulin combined with regulartesting of their blood glucose levels;2) and Continuous Subcutaneous Insulin Infusion (CSII ormore simply - new technology in the form of an InsulinPump) combined with regular blood glucose testing.\"Intensive Therapy\" is just now emerging onto the clinical scene withthe publishing in 1994 of the results from the DCCT.Example: When a friend went to diabetes camp in 1994 there were300 kids and 30 to 40 counselors. Only one counselor had anInsulinPump. The summer of 1995 the camp participants counted 3 pumpers (onecounselor, the friend and one other kid).Conventional insulin therapy practiced by most diabetics requirestesting blood sugar 5 or 6 times a day and the periodic injectionof a long and a short acting insulin. Meals and exercise must becarefully controlled and timed tomatch their body's insulin uptakeand energy needs. The most noticeable element of this type ofmanagement is the periodic snacks required to maintain adequate bloodsugar levels.Insulin Pump users test their blood sugar 4 to 8 times a day andprogram their Insulin Pump to provide a continuous small drip ofinsulin that matches their body's background (fasting)insulinrequirements (this is called the \"Basal Rate\"). In addition, pumpersprogram their pumps as needed to provide the exact amount of insulinto match the food they eat at the time that it is consumed (this iscalled a \"Bolus\"). The management effect of an Insulin Pump can beapproximated by using MDI (multiple daily injections) and frequentblood sugar testing, however, MDI to achieve intensive therapy ismuchmore rigorous and difficult to maintain (especially for a kid).What's Normal Blood sugar levels for a non-diabetic fall in the 80 to120 range. Glycosylated hemoglobin levels ( a measure of average bloodsugar levels over a three month period) for a non-diabetic averagearound 5%. For a diabetic, consistently maintaining near normal bloodsugarlevels of 170 or below on a day-in day-out basis will produce aGlycosylated hemoglobin level of around 7% and a reduced incidence ofcomplications as demonstrated by the DCCT. At Dante's last check up hishba1c was 7.1 (very good). In the course of a day, a Diabetic in \"goodcontrol\" may have blood sugar levels that swing from 50 to almost 200 withthe teenage years this is almost impossible. The body's blood sugarservomechanism does not work and is replaced by machines; i.e., aGlucometer, Insulin Pump, and the brain of the patient to close the servoloop in real time. Blood sugar control for a diabetic is analogous tosteering a car on a Winding road from the back seat with two long rubberbands attached to the steering wheel whilewatching the road through the wrong end of a telescope.What does this mean for you as a teacher or office staff??? Now thatyou've read all about what can go wrong, what happens on a day to daybasis? Usually everything works OK and Dante takes care ofproblems that develop. Diabetics need the people around them tosimply beaware that they may suffer from low blood sugar and needassistance to correct a SEVERE low blood sugar or simply your patienceand indulgence until they can correct a MILD low blood sugar. On theaverage, diabetics suffer a reaction which requires the assistance ofothers a couple of times a year or less. However, not to getcomplacent, moderate low blood sugars can and often do occur on adaily basis. Diabetics on intensive therapyon the average suffer 50%more low blood sugar reactions. Dante suffers 2 to 5 mildreactions a week which he has always caught and corrected himself.Someday this will not be the case and that is why the people aroundhim must constantly be vigilant in the event that he needs yourassistance.ABOUT your childname Dante RuckerDOB: 3/18/1993Address 432 Briggs ctPARENTS: Desmond & ChristineHOME PHONE791-5901WORK PHONE 622-3700/521-3601DOCTORS Dr. Maney 783-7109HOSPITAL UC Davisafter hoursIf Dante is in need of medical treatment it is IMPORTANT thatthe medical team be aware that she is an \"Insulin Dependent Diabetic\".It is common practice for emergency rooms to give patients fluids andglucose which is not necessarily a good idea for diabetics.YOU Dante can usually tell when he/she is LOW and willNEED test and correct blood sugar levels as neededTO however, if he appears shaky or upset when thereKNOW is no apparent good reason ASK IF HE/SHE IS LOWTHIS AND ENCOURAGE HIM/HER TO TEST BLOOD SUGAR LEVELS. IF YOUSUSPECT LOW BLOOD SUGAR, DO NOT LEAVE HIM/HER BY ALONE ORALLOW HIM/HER TO GO OFF ALONE WITHOUTACCOMPANIMENT.Physical exercise is not appropriate when Dante's blood sugarlevels are below 80 or above 150. He can correct a low blood sugarin 10 to 20 minutes using fast acting carbs but should have foodcontaining carbohydrate for long term correction. High blood sugarscan be aggravated by exercise and may take several hours afteraninsulin infusion to return to acceptable levels.Dante can usually correct high blood sugar levels inanticipation of a meal within an hour using an accelerated bolus.However, if he/she uses an accelerated bolus to lower blood sugar levelsthere is an increased risk for low blood sugar, he MUST eat withinthe appropriate time frame to avoid a subsequent severe low bloodsugar level and insulinreaction.EMERGENCY TREATMENTIn the event Dante experiences a severe insulin reaction (lowblood sugar), he carries in his pack the following items.1) 20 grams of carbohydrates take 20 grams of fast actingcarbohydrates( fruit snack, juice- heneeds sugar) Have him call home after hehas walked to office with a buddy. Hecan eat two or three snacks if he islow . Makesure his tester comes to theoffice with him. Make sure the officeknows he is low and waiting for me. Heshould never walk alone when low.3) Cell Phone Call 911 Call 911 and notify responding team thathe is a diabetic on a pump then callparents.Sports and ExercisePhysical activity increases the body's need forglucose and lowers blood glucose levels (as long as there is adequateinsulin). Most ordinary exercise that is not strenuous or prolongeddoes not require any particular action on the part of the diabeticperson. Prolonged physical activity such as marathon runs, or otheractivities that extend more than an hour, AND PARTICULARLY Running,require the intake of additional energy (glucose). Danteburns an extra 10 grams of carbohydrate an hour while swimming. Youmay see Dante munching on a cracker or other snack before orduring exercise. This is normal.Thank you for taking the time to read this and help Dante. Please feel freeto contact me if you have any questions.Sincerely,Desmond and Christine Rucker",
            "post_id": "2434587",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "Hello pursepartychic,I CANNOT STRESS ENOUGH that a 504 plan is important for your son.  You have every right to bring an advocate with you to the meeting.We have had a 504 plan written up since my son was in kindergarten and he is now in 5th grade.  They are effective for one year and specify what your child needs.If my son's school was letting my son wander around with a 50 blood sugar and had previously told him that he could ONLY call me with a 374 bs if he PROMISED to not go home, I would probably feel the urge to not send him until a meeting.  I know that is not realistic...it is just a feeling.My son's school has 3 people trained on what to do for lows/ highs, as well as how to give glucagon and I have still had little problems here and there.  I am sure we all do, but if they let him wander around the school with a low blood sugar instead of keeping him in the health office or classroom - somewhere with supervision, I would be irate.  Now that my son is testing in the class (I am trying to prepare him for middle school because he will have more teachers), if he has a bs over 250, he goes to the office and tests for ketones and they call me to let me know what is going on.  If he had high blood sugar and modeate or more ketones, I would pick him up from school.  If he feels terrible, how is he going to absorb much that day.Your son's school CANNOT get away with this type of treatment, but, on the other hand, if there is nothing documented on paper about how he is to be cared for, it would seem as though you do not have much to go on.  But, then again, most schools (even if you do not have a 504 plan) send you home with a diabetic packet right before school starts or at the very beginning of the year - like 4-5 pages long or so and you fill in the treatment for hypoglycemia and hyperglycemia.They need to be educated.I URGE you to go to the below page and fill out the form.Yo will be connected with a volunteer to communicate via email one on one (hopefully me).  I would love to help:)  I would most likely be the one put in touch with you because our son's are close in age, are both on pumps and it is a school issue.  I am very passionate about THESE issues.http://www.jdrf.org/index.cfm?page_id=1Click on Online Diabetes Support Team on the left hand side of the page and fill out the brief form.",
            "post_id": "2434591",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "Probably you need to go to your next visit armed with 2 additional things(1) the laws pertaining to ensuring each child's safety at school with the relevant points they are violating highlighted so they (principal?) can't \"not know\" what they aren't doing right, and(2) a good lawyerTogether you'll put your cause on their radar screen.  This is a big issue and your sweet child is just one of many munchkins who probably are at risk while at that school.State laws vary, I understand, so a lawyer can help you sort out what's what...You have good reason to feel good about your son's a1c.  Give him lots of hugs & attaboys & encouragement -- he needs that, too.",
            "post_id": "2434590",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "I just wanted to say his last HBa1c was 7.1 .I think he and I are doing a darn good job with this horrible thing.Christine",
            "post_id": "2434588",
            "timestamp": "1127278800",
            "votes": 0
        },
        {
            "answer": "I'm so sorry you have to deal with such complete ignorance.  I too dealt with this when my daughter was diagnosed at age 7.  At the time she was only in first grade and was in a private Catholic school.  They had NO school nurse or aide of any type and were completely ignorant to the disease.  They would not allow her to check her sugar or administer insulin, with an insulin pen if needed.  They wanted absolutely nothing to do with it.  In fact when she needed to check her sugar, she had to go to the office and my older daughter, who was in 5th grade at the time, had to also leave class and go to the office and monitor her checking.  If she needed insulin, my 5th grader had to dose it and administer it!  What a joke!  Eventually they didn't even want her to do that as it made them uncomfortable.  I fought with the principal, the priest all the way up to the diocese to no avail. They suggested I hire a private nurse to come to the school and take care of her.  Emma was perfectly capable of monitoring her insulin and injecting with a pen if needed.  Diabetes is in our family and she was very knowledgeable about it even at age 7.  I finally had to get a lawyer  which I found through the ADA and he was able to at least get them to allow her to perform her basic maintenance, but they made me sign a waiver stating they were not responsible for her if anything happened while she was at school.  The school and teachers finally drove us out of the school by making Emma feel so different, uncomfortable and alienating her.  We moved away from this town and Emma is now in a public school where thankfully there is a wonderful nursing team that understands diabetes with a very understanding principal and staff.  They strive to help her manage her disease while she's in school and they work to educate the other kids in the school about it.  What a difference!I agree with what everyone else has suggested, you must fight for your son's rights!  Unfortunately the private school's can side step a lot of the written laws pertaining to schools.  If your son is in public school, your paying the taxes for him to be there and he has rights! As soon as we got a lawyer involved it seemed like they started taking us more seriously.  Don't give up!",
            "post_id": "2434606",
            "timestamp": "1127710800",
            "votes": 0
        },
        {
            "answer": "Sorry ,I have not replied I have been ill. I have a meeting with the school this week to talk about his 504 that is in place from last year. (that they don't really adhere to) I hope to at least get  across to his teachers how important it is for them to be there for him . I really think the school has gone this long with ignorance because1. No one challenged them .2.Nothing terrible has happened.I hope to get someone from the ADA to go with me( my hsuband has to work) because it is always me againstthe teachers-who just don't know muchthe nurse-who thinks she knows something but obviously missed that assignment in schoolthe VP who I think is just dingy.I will let you know how it goes.thanks for all your great words of incouragment and advise!Christine",
            "post_id": "2434608",
            "timestamp": "1127710800",
            "votes": 0
        },
        {
            "answer": "Hello, I am 17, and have had diabetes for almost 8 years. I have experienced this a few times with different schools and teachers. Although I have never attended a school with a school nurse, so I'm not sure what that would be like, I can completely understand where you are coming from and I wish you the very best of luck with you and your son. If you ever need help or advice of someone who went through the same thing (not as a parent, but a diabetic) I am always here!Sincerely,hjade",
            "post_id": "2434610",
            "timestamp": "1127797200",
            "votes": 0
        },
        {
            "answer": "When my daughter was in the 2nd grade, the school board, in their infinite wisdom, was ready to pass a policy stating that no child could test or take injections or otherwise medicate on the school grounds.  This included asthmatic patients with inhalers.I went to the school board meeting with fire in my heart.  I was terrified after hearing the 6th grade teachers talk about dragging one of the diabetic students to the office and forcing her to drink a glass of orange juice without testing her first.  The girl had been crying all the way to the office that she did not need orange juice.  How traumatic!  And how potentially life threatening!Our school board chairman was an attorney.  I was very pointed that if they ever drug my daughter to the office and forced OJ down her when she did not need it, and threw her into a coma, I would own their school district.Their next suggestion was that before any child could medicate, their pediatrician had to be called each time.  My daughter's pede had 35 diabetics in his practice.  It was not feasible to call the doctor every day something came up.I had no problem with a plan and encouraged them to set one up for all kids needing medications.  Denying medications to the child was frightening as well as exposed the school district to as much legal liability as giving the meds would do.We kept a diabetic kit in the school office.  We had no school nurse, but the secretary would supervise my daughter's testing when needed and would follow the instructions I had made up for them each year.Schools CAN do things differently.  Sometimes they just need to hear from a determined parent to see the light.",
            "post_id": "2434686",
            "timestamp": "1130043600",
            "votes": 0
        }
    ],
    "post_id": "2430343",
    "question": "I have a 12 year old son ( dxd 10 ,pumping ) in Middle school . The nurse there is a real jerk. Last year she threatened my son telling him she would only let him call me if he promised to stay at school (bs 374) at the time .Anyway this year last week they let him wonder around after he called me (bs50) I told him to stay put I was on my way . I got there and it was luch time 600+ students it took 15 minutes to find him ( over the loud speaker)  My problem is no one is trained , the nurse does not take it seriously so no one else does either. Who can I get to come train the teachers and office properlyChristine",
    "timestamp": "1127106000",
    "title": "School help"
}