{
    "answers": [
        {
            "answer": "Yes, I have heard about that study as it applied to a group of pregnant thyroid patients.Dr. Lupo has mentioned selenium as well.Selenium had been proposed as something to help prevent type 2 diabetes too, but just this last month a large study found it doesn't help and it may actually increase the risk of getting diabetes.My daily multi vitamin contains some selenium and certain foods contain a lot too.It's interesting, but I'll hover around the RDA amount for now, until I see more evidence.Funnily enough, one sign of an overdose of selenium is hair loss.",
            "post_id": "1639210",
            "timestamp": "1186011455",
            "votes": 0
        },
        {
            "answer": "I am hyper/Graves'/hypo and I take selenium with all the rest of vitamins and minerals.However there is a lot more (vitamins/minerals) to good thyroid health then just selenium.  Hyper and hypos require different doesages.Selenium has effects are on the T-3 (T-3 and T-4 conversion) and Selenium is also essential for healthy immune functioning.  In a placebo-controlled study, supplementation every day with   selenium for three months reduced anti-thyroid antibody levels (indicating a reduction in disease activity) in people with autoimmune thyroiditis (inflammation of the thyroid gland).However, I believe that I read that there is on scientific or not enough data to support this theory.Deficiency of selenium will cause \"low T3 Syndrome\" where T4 levels are normal but T3 is low. Selenium and/or iodine deficiencies cause goiter. Selenium is the most important mineral to counter the toxic effects of heavy metals. Selenium is essential for production of glutathione peroxidase which is one of the three most important antioxidant defenses of the body. Can be toxic at levels of over 1000 mcg per day. Goiter will result from a selenium deficiency (or iodine deficiency), and many hypers and hypos have goiter.Mercury in silver amalgam fillings uses up selenium for detoxification. High amounts of amalgam fillings may require more selenium. Don't take over 600 mcg. per day unless you have an unusually large amount of amalgam fillings (more than 8).CHROMIUM Involved in glucose metabolism and insulin production and works hand in hand with selenium. The conversion of T4 to T3 is influenced by insulin, which is probably the reason why diabetics have low thyroid function.",
            "post_id": "1640711",
            "timestamp": "1186069217",
            "votes": 0
        },
        {
            "answer": "My hair is sarting to become grey.I have seborrheic dermatitis and Iam used to use selsun blue shampoo (that contains selenium) but today I read that it increases the graying of hair when used as shampoo,but may improve the graying if used orally as antioxidant.but i wonder that\"Funnily enough, one sign of an overdose of seleniumSelenium - an antioxidant is hair loss.\"I wish that more studies to be done concerning it.I read that it has an antioxidant activity 50 times as vit.E.",
            "post_id": "2957430",
            "timestamp": "1211845139",
            "votes": 0
        },
        {
            "answer": "Read this on a support site hope it helps...Quote...Selenium is crucial in both the production of T4 thyroid hormone(thyroxine) in the thyroid gland, was well as in the conversion of T4 to T3 thyroid hormone, the active form (thyronine) Zinc is needed both before and after these production and conversion processes. Zinc is necessary for the TRH hupothalamus hormone to stimulate the pituitary gland, which signals the thyroid gland to produce thyrroid hormone. unquote",
            "post_id": "2963517",
            "timestamp": "1211964979",
            "votes": 0
        },
        {
            "answer": "I had a TSH of 7.69 and thyroid antibodies of 602.7 when I was tested in September of 2007. I started taking 200mcg of selenium with 400IU of Vitamin E together every morning, as Vit E maximizes the absorbtion of Selenium. I was tested again 3 weeks later and my THS went down to 5.4 then again three weeks after that and my THS was at a 4.3 by Christmas that year I had dropped back into a Normal range of TSH 2.1..my antibodies are still high at a 201.3 bit they've dropped ALOT! I'm now getting my silver fillings removed, because I can pin point when my Hashimoto's started when I got my first five fillings summer of 2006! I'm hoping this will lower the rest of the antibodies. Selenium has been a real miracle for me as I'm only 25 and was so sick with Hasimotos Hypothyroid that I was having severe panic attacks and could not leave my house for 8 months!! My doctor has now told many of her patients about Selenium after seeing my results, she was never thought there was a \"natural cure\" for Hashimoto's, but I'm LIVING PROOF! It has also helped many of her other patients.",
            "post_id": "4041266",
            "timestamp": "1235862728",
            "votes": 0
        },
        {
            "answer": "I am glad you feel well - but Selenium is not a cure for Hashimoto - That is autoimmune and \"cure \" should be stated as remission. Selenium can contribute to helping hormone conversion and also calming the attacks of antibodies with Hashimoto -This may be why you saw a decline in your TSH - not  sure though.I also take selenium and find it helpful - I am also on thyroid medication - with no thyroid.",
            "post_id": "4042506",
            "timestamp": "1235904698",
            "votes": 0
        },
        {
            "answer": "All of my kids have \"Hashimotos\" looking thyroid glands and are slightly hypo. They have been on a little Armour and 200 selenium for over 2 years and have never shown positive for the antibodies for thyroiditis. I think this is being prevented by the selenium, and so does my doctor. We also started on a mineral protocol about 6 months ago - Dr. Paul Eck research about  mineral pattern balancing- which includes about 50 mg of zinc and other minerals, and both of my teenagers TSH took a nosedive, so that they are no longer having to take the Armour. (Zinc increases thyroid activity) This was great.We have also been gluten free for a year. Gluten does contribute to thyroiditis and is implicated in many autoimmune diseases. It's not Celiac disease I am talking about here- most people are slightly intolerant to gluten especially as we age. We all tested negative to Celiac, but were positive on a gluten intolerance test, which is different than food allergy test. Gluten is a thick gummy substance that is incredibly hard to digest and the wheat products today are much different than the wheat products of decades ago. My father had terrible RA, and went gluten free and within 2 weeks was off all meds and was basically pain free. Alopathic medicine is clueless about any of this, unfortunately. Much of all degenerative diseases are caused by the foods we eat ( mainly gluten and dairy which are the hardest to digest) which slowly destroys the small intestines, which compromises our immune system- then we contract chronic infections and parasites which must be treated. (Check out Dr. Daniel Kalish's website- he is a genious and has a great article about gluten intolerance and chronic/autoimmune disease.) We were all tested by Metametrix labs by DNA stool analysis, and had various specific parasites and candida. (Yuk!) It is a vicious cycle that needs to be broken!",
            "post_id": "4672889",
            "timestamp": "1247951005",
            "votes": 0
        },
        {
            "answer": "I take selenium every day and although my antibodies have not gone any higher since starting it, they haven't decreased any either.  I think the main thing it does for me is to keep the antibodies from \"raging\" so badly; helps keep the \"choking\" feeling away.I ALWAYS keep in mind that my Hashimoto's will NEVER be cured - but it can be calmed.........",
            "post_id": "4673352",
            "timestamp": "1247965536",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with hypo and Hashi's last year, my mother has Lupus, and one of my children has Type 1 diabetes.  Should I be having my other children tested for antibodies and started on some type of proactive treatment?  Can the primary care physician check for gluten intolerance?",
            "post_id": "4675546",
            "timestamp": "1248037481",
            "votes": 0
        },
        {
            "answer": "You mentioned that your fillings seemed to trigger the start of your Hashis.  I have been trying to go over in my mind and undo anything I started or changed (meds, habits, etc) around the time when my symptoms started.  I severely broke my ankle in Jan 07 and had to have metal plates, screws and pins placed in my ankle to stablize it.  The surgeon said she had to leave all this hardware in place because my ankle was too badly damaged to remove it.  My symptoms started in May 2007.  I have been wondering lately if having these foreign objects in my ankle has been triggering these antibodies that are attacking my thyroid?  Has anyone else had this problem?  If so, any idea for fixes?",
            "post_id": "4675556",
            "timestamp": "1248037871",
            "votes": 0
        },
        {
            "answer": "First things first - I don't know that there IS a \"pro-active\" treatment.  Autoimmune diseases are not preventable to my knowledge.I have had silver amalgam fillings since I was a teenager and only was dx'd with hypo/Hashi's in June of 2008 (check my profile - I recently turned 60), so I'm not convinced that would have anything to do with it.   I think if you are prone to autoimmune diseases you are going to get them -period.I, personally, have hypo/Hashi's and pernicious anemia (both autoimmune).  My son was dx'd with Juvenile Diabetes (type I) @ age 10 (he's now 37).  My daughter (age 34) was dx'd last year with lupus.  I have a nephew with type I diabetes, dx'd when he was in his 30's and my oldest sister, who's in her 70's also has type I diabetes-dx'd only a few years ago.  Along with that, there are several in my family who have type II diabetes.  I have one sister who also has hypo/Hashi.  I'll even add the heart problems here..yeh, we have them too, even though they aren't autoimmune.There's my family history in a nut shell - oh yes, I encourage my kids to have THEIR kids tested at the first sign of ANY symptom of ANY of these diseases.  I don't advocate taking up residence in the doctor's office, but when you have these things in your family, you need to be aware of, and pay close attention to, symptoms of the rest of the family.Being aware of the symptoms of these autoimmune diseases is crucial.  Prior to my son being dx'd with type I diabetes, I had NO experience with the disease and NO inkling of the symptoms, etc because we had no family history of diabetes.  At that time no one on either mine or my husband's side of the family had ever had it.My son began exhibiting behaviors that were \"out of character\" - basically, irrational - like one day it was snowing lightly (we lived in Iowa at the time & snow was NOT uncommon) and I had the kids ready to head down the driveway to the bus, when my son saw that it was snowing VERY lightly; he stopped in his tracks and INSISTED that *I* call the school and tell them that they had to call off school for the entire day because it was snowing and HE wasn't going to go.  I put it down to him being 10 yrs old, having a few problems in school and not wanting to go.These behaviors kept up until one day his teacher called me and said she thought he needed to go to the doctor and when I asked why, she explained that he was thirsty all the time, had to go to the bathroom all the time, etc and it was disrupting the class.  Now me, being totally clueless, figured he had maybe a bladder infection, etc.  HOW WRONG COULD I HAVE BEEN??  I made a doctor appt and as luck would have it, his pediatrician was diabetic.  How lucky for us because by then this poor child that *I* had thought was being \"difficult\" was almost in a coma and was admitted immediately to the hospital - a few hours longer and we might have lost him.I only went into this much detail because it's so important for us to know and watch the symptoms of these horrible diseases.  *I* wasn't a bad mother - I just didn't know the symptoms and what the disease was all about.  Do I regret my ignorance? You bet.These things take us on such roller coaster rides, it's absolutely incredibly horrible.  The sad thing is - when my thyroid \"wigged\" out, *I* exhibited some of the same behaviors that my son did and *I* didn't see it coming for myself any more than I did for him, because I didn't know the symptoms of hypo/Hashi.Yep, be aware and have your other children checked at the first sign of ANY of these diseases.  *I* learned the hard way not to take this lightly....... As we know, they can turn life into a nightmare and need to be dx'd as soon as possible.",
            "post_id": "4675781",
            "timestamp": "1248044536",
            "votes": 0
        },
        {
            "answer": "Wow--I'm glad to know I'm not alone with all these autoimmune disorders popping up in my family.  My son's diabetes went longer than it should have also because no one in my family had been diagnosed with it and we weren't familiar with the symptoms either.  I suspected he was getting anorexic because he was suddenly losing so much weight (he has always been a little stocky) and had no appetite, or depressed because he was in junior high and didn't really like it.  Fortunately all ended well, but proper diagnosis and treatment were essential and I wish I would have considered diabetes as a possible cause earlier!  My family is still pretty young--it sounds like I really need to be on the watch for symptoms in other family members as we enter middle age.  I did read about a study that was testing a proactive treatment for Type 1 Diabetes by giving patients oral insulin if they tested positive for some antibodies that have been shown to lead to Type 1 diabetes in the future.  I was wondering if my Hashimoto's antibodies would be falsely identified as the Type 1 diabetes antibodies?  Have you ever participated in any of these studies?  Do you know if people can have both diabetes and Hashimoto's?",
            "post_id": "4687733",
            "timestamp": "1248320528",
            "votes": 0
        },
        {
            "answer": "I take Selenium too and i believe it has some benefits.... many of you know this but some may not so here it is:BE CAREFUL WITH HOW MUCH SELENIUM YOU TAKE:It is TOXIC in high amounts and too much can ironically cause symptoms that are similar to being hypo: fatigue, hair loss, irritability etc.I used to get my daily amount by eating Brazil Nuts which are very high in selenium. I found that to be an effective way; one less pill to swallow and just a few nuts had enough in it to cover me.Now I just take a  200 mcg pill.  As long as you are not exceeding that level it should be fine! Remember there are foods that contain Selenium as well such as canned tuna, fish, eggs, seafood, wheat bread, rice, turkey, pork, beef, nuts and more. if you eat healthfully you probably get sufficient amounts of it anyhow.",
            "post_id": "4687983",
            "timestamp": "1248329000",
            "votes": 0
        },
        {
            "answer": "I've been reading, it's important to be taking iodine too, and that they work in conjunction well with one another. Iodine deficiency is possibly tied to adrenaline fatigue(auto-immune problems) and is a big deal with hypothyroidism in many cases!",
            "post_id": "5776653",
            "timestamp": "1276153579",
            "votes": 0
        },
        {
            "answer": "Hi! im really interested on ur story, since im also 25 and want to fix my thyroid problem as well... what brand of selenium did u take? do u still take it? thank you!",
            "post_id": "8188548",
            "timestamp": "1343615914",
            "votes": 0
        },
        {
            "answer": "This is a very old thread and CJM25 had not participated in the forum since, so it's unlikely you will get a response.\"Fixing\" a thyroid problem is really not possible; all you can do is treat it.  Are you on a thyroid replacement medication?  If so, which one and what dosage?Do you know if you have Hashimoto's?",
            "post_id": "8189322",
            "timestamp": "1343648296",
            "votes": 0
        },
        {
            "answer": "A quote that may shed some light\" Iodine is regulated in many ways in the thyroid.  However, the most important pathway is the conversion of iodide into iodine through an oxidation reaction.This requires an enzyme called TPO or thyroperoxidase.  It also requires hydrogen peroxide.  If too much hydrogen peroxide is left in the thyroid, however, it leads to Hashimoto’s disease, a common thyroid problem.The mineral that helps control hydrogen peroxide is selenium.  It is needed to make glutathione peroxidase, whose function, among many others, is to detoxify hydrogen peroxide after it has done its job in the thyroid gland.Selenium is also required later in the metabolism of the thyroid hormone in the conversion of of the relatively inactive T4 to the active thyroid hormone T3.  The enzyme primarily responsible for this conversion is iodothyronine  deiodinase.  This enzyme also requires selenium to function properly.Any deficiency of selenium in the body will impair T3 production and thus cause hypothyroidism symptoms, even if the body is producing plenty of T4.  This is sometimes called a conversion problem, as opposed to an iodine deficiency problem.Thus selenium is critical for two phases of thyroid hormone production.  It is thus considered a close relative to iodine in the correction of thyroid difficulties.  For more information about selenium, see the article on this website entitled Selenium, A New Mineral For Health and Healing. \"The main reason I pointed this out is that there IS a known way to get Hashi's from lack of Selenium in ones body or an excess of hydrogen peroxide left from the conversion / oxidation process of Iodide to Iodine..Hope this info helpsInfo / quote taken from \" http://drlwilson.com/Articles/IODINE.htm \"",
            "post_id": "9326352",
            "timestamp": "1374767397",
            "votes": 0
        },
        {
            "answer": "I am 25 and was recently diagnosed with Hashimoto's disease. My antibodies were at 353 and the doctor put me on 25mcg of Synthroid to start out. People have been telling me there is now way to get out of taking meds for the rest of my life, there's no cure, there's nothing I can do about it and my thyroid is just going to die. Well, I refuse to believe that and have been researching on what vitamins and supplements I can take to put my Hashimoto's in remission. I am bound and determined to find an alternative, so thank you to everyone who has posted about their regimens and results, I greatly appreciate it. I am going to start taking selenium and vitamin E to start to see how that affects it. I have also read taking Zinc and Copper can help, ratio of 1mg of copper to 15mg of zinc, but I need to continue that research. I also have read numerous studies of food allergies being linked to Hashi's, especially gluten and diary. I have cut all gluten out of my diet, but I am going to get a food allergy blood panel done next week to see what I am allergic to.",
            "post_id": "9326387",
            "timestamp": "1374768000",
            "votes": 0
        },
        {
            "answer": "This is a very old thread and most of the previous posters are no longer active on the forum.Unfortunately, Hashimoto's is an autoimmune disease and once you have it, you will always have it.  It only goes into remission when there is no  more healthy thyroid tissue to destroy.There is no proven scientific evidence to show that gluten and/or dairy are linked to Hashimoto's.  Most of us with Hashi's have not changed our diet in any way.Best of luck to you.",
            "post_id": "9329761",
            "timestamp": "1374855815",
            "votes": 0
        },
        {
            "answer": "I also have plates and pins in my ankle and started with hives a year later. I have Hoshimotos",
            "post_id": "9902106",
            "timestamp": "1391241812",
            "votes": 0
        }
    ],
    "post_id": "1638967",
    "question": "I just came across info this afternoon about the effects of Selenium on autoimmune thyroid disease.  i'm amazed i hadn't read this info before now, but i'm very curious to see whether anyone else on here with Hashimoto's Thyroiditis has heard this info and/or is taking Selenium to combat the rising antibodies.  the article mentioned the study used 200mcg doses in trials and there was a measurable decrease in antibodies with the Selenium group.  thanks!!",
    "timestamp": "1186006366",
    "title": "Selenium and Hashimoto's - anyone taking it?"
}