{
    "answers": [
        {
            "answer": "Hi there,Well welcome GE!  My you do have a lot going on, and this dx must of been a blow to you.  I have a few questions.  Did you start the Rebif? If so, when did you start?  I'm asking this because I'd like to get a feel for where you are at w/the meds, how long it's been, etc.Sounds like you were dx'd quickly.  What did the reports say in reference to demyelinating lesions? ARe they in your brain and your spine? If you are able, please describe your pain.  The narcotics will not work for CNS related pain from what I've learned here.  We have an excellent write up by a pain doc in our health pages - please read this, and let us know what type of pain you have going on.I was dx'd quickly.  What I found difficult to distinguish between was MS symptoms and the side affects from Rebif.  I'm not sure if this is what you have going on, but maybe once you fill in the holes a bit for me and the others we can provide more advice.You have given us a lot, but we just need a little more. You say that your back hurts, what did the MRIs say reference your spine? Maybe you have more than MS at work here.You were more than likely dx'd with RRMS.  If I were you I'd line up a few simple questions for this appt. along with a list of symptoms.  Since you have been told you don't have diabetes, you now are doubting the MS dx too right? Well, I do understand this sort of though. It's such a very difficult disease to wrap your head around, and there is not 1 single test for it so your feelings are quite understandable.  Please let your Dr reassure you.  Ask him or her straight up \"what tests determined my dx.\"  Tell your Dr. how you are feeling, but gather your thoughts 1st so you he clearly understands where you are coming from.Now for the diabetes.  Does an MD follow this? You should be getting checked regularly.I'm sorry you are in the middle of what seems to be a flare, or just lingering MS symptoms, I'm sorry the ER did not take good care of you.  I would have thought they would have started you on steroids.  You will learn so much here and additionally gain so many friendships. Try to remain as calm as you can through the stuttering, it's horrible I know.  I didn't have that, but had slurring, and I understand. It does work you up.  Stay as \"under stimulated\" as you can.  Don't go around anyone or any place that could possible excite you - that is my suggestion. It won't make it go away, but may help you get through it better.Welcome aboard! Hope to see you around,-Shellp.s. Our health pages are located toward the right corner of the forum - check them out!",
            "post_id": "3710620",
            "timestamp": "1227877361",
            "votes": 0
        },
        {
            "answer": "I'm very sorry to read about your pain and the poor treatment you have received from the health community. No wonder you feel lost and angry.But I do have some comments and questions that may be of interest.--- First, who in the heck diagnosed you with MS? You may well have it, probably do, but I didn't read in your posts anything about the mimics of MS being ruled out. I also didn't see reference to a radiology report on your MRIs, or whether they were done using the MS protocol. Maybe I'm missing something (that sure happens), but I don't see that you've been given a full workup for anything. Have you even had a comprehensive physical exam that tests for neurological deficits?MS is a complicated disease, and it often takes a long time to zero in on. Do you have copies of reports on all your tests? It would be helpful for us to know what you've been tested for and what the results have been. It's most unusual for an MS patient to have pain everywhere at once. I'm also concerned that you've now been told you don't have diabetes. If your blood sugar was at one time over 500, let alone over 900, that's extremely serious, to say the least. Diabetes doesn't just go away. Are you still on insulin? MS and diabetes cannot be confused with one another. The only symptoms they might have in common are neuropathic pain, usually in the legs and feet, and vision issues. If blood sugar is controlled the vision problems usually improve a lot, but not overnight.In any case, it should be easy for you to find out if you are really diabetic. Your primary doctor can settle this once and for all, so I advise you to lose no time with this. It's extremely important to your health.As to MS, I haven't heard of someone hospitalized who still hasn't been seen by a neurologist, but nevertheless is given an MS diagnosis. I also have never heard of Rebif being prescribed without a neurologist's recommendations.Would you tell us what 5 medications you were recently given? I'm wondering if any of them are actually used for MS.Hang in there, you're among friends here. We'll try to give you some good advice as you wait for your next appointment. And Shelly's recommendation that you read our Health Pages is a good one. There's lots of good information that can help you sort out your symptoms and let you know more about MS.ess",
            "post_id": "3710685",
            "timestamp": "1227880811",
            "votes": 0
        },
        {
            "answer": "Well GE, I can't really add anymore to Shelly & ess, they've given you great answers and lots to think about.I'm just glad that you found us and hope we can continue to help you deal with all you are going through right now.  Always feel free to ask us anything, we will do our best to find the answers.Take care,doni",
            "post_id": "3711249",
            "timestamp": "1227894354",
            "votes": 0
        },
        {
            "answer": "So let me see if I can answer your questions.  Hopefully I won't miss anything.These are all the medications I'm on:1. Rebif 44mcg - I inject myself 3 times a week. This was prescribed by a neurologist while I was in the hospital at the end of September.2. Gabapentin 300 mg - I take 2700 mg daily.  This medication was prescribed a week after I was diagnosed with MS.  It was prescribed by my primary doctor.3. Tramadol 50 mg - I take 200 mg daily. This medication was prescribed a week after I was diagnosed with MS.  It was prescribed by my primary doctor.4. Naproxen 500 mg - I take 1000 mg daily.  This medication was prescribed a week after I was diagnosed with MS.  It was prescribed by my primary doctor.5. Benazepril 5 mg -  I take 5 mg.  I was prescribed this back in April.  It protects my kidneys and it keeps my blood pressure in check.  I've never had high blood pressure so it's mostly to protect my kidneys.6. Glimepiride 2 mg - I take 4 mg sometimes.  I was prescribed this back in April for the diabetes.  I check my glucose daily and when I see it's high I take it but if it's okay I don't.  I'm supposed to be taking 2 other diabetes medication but I don't. When I take all of them then I become hypoglicemic (?).  Basically my glucose level becomes too low.7. B-12 1000 mcg - I take 1000mcg daily.  I was prescribe this back in late September when I was first diagnosed with MS.  They said my B-12 was too low.8.  Mirtazapine 15 mg - On this one I got it from a psychiatrist.  I am only supposed to take 15 mg but I take 30 mg at bedtime.  The 15 mg just doesn't work.  When I was in the hospital this last time (I just got out yesterday) I asked for a better sleeping pill but they didn't give me anything.  I'm going to try again with my primary.9. Omeprazole 20 mg – I take 20 mg daily.  My primary prescribed this when I had really bad heart burn.10.  Amitriptyline 25 mg – I take 25 mg at bedtime. This is a brand new medication.  It was prescribed to me while I was in the hospital this last week.  They gave it to me for depression. The funny this is that I asked for a sleeping pill and I ended up with this.  I guess they thought I was depressed and didn’t tell me.11.  Oxybutynin 5 mg – I take 10 mg.   This is a brand new medication.  It was prescribed to me while I was in the hospital this last week.  It’s for my MS.  When I was discharged the nurse said it was for pain.12.  Vitamin D-2 drops – I take 20 drops a day.  This is a brand new medication.  It was prescribed to me while I was in the hospital this last week.  They said my vitamin D was too low.13. Baclofen 10 mg – I take 10 mg daily.  This is a brand new medication.  It was prescribed to me while I was in the hospital this last week.   This is the drug that is supposed to help me with my back and leg pain.  I read up on it and it take about a month or two to get the full effect.  So till it kicks in I’m screwed I guess because the doctors won’t give me anything for pain to tide me over till it kicks in.So that’s all my medicine.  Not counting the stuff I am supposed to take on a daily basis.When I went into the hospital at end of September I was complaining of numbness in my limbs and head.  They initially did a CT in the ER.  The neurologist came down and told me that my brain seemed small for my age.  She said it looked atrophied (sp).  She even asked me if I was in special ed while I was growing up and if I was able to graduate high school.  So I told her that no I wasn’t in special ed and yes I graduated high school and I even did a couple years of college.  She then said it was probably a congenial defect.At that time she did a complete Neuro exam and then decided to admit me.  They did an MRI, a spinal tap and a ton of lab work.  The MRI showed lesions and the spinal tap came back positive.  That’s how they came to the conclusion that I had MS.  When I was discharged I was prescribed the Rebif and they promised to send me an appointment for their neurology clinic and said it would be soon.  Well that didn’t happen I had to go to clinic 4 times and I was finally given an appointment for December 12, 2008.  I was discharged on October 3, 2008.So since I haven’t been able to get into neurology I’ve been going to my primary for my MS and she’s been doing what she can.  I’m just grateful she’s trying because when I was discharged they didn’t give me anything to treat the symptoms.This weeks hospitalization basically went the same way as the first.  With the difference that they said that they didn’t think I was diabetic.  I’m planning to talk to my primary doctor to make sure I really don’t.  The last thing I need is to fall into a diabetic coma.  I had more MRI’s done and the doctor said that the lesions didn’t look like they had spread down my spine and they said I had urinary infection.  That was a surprise because I didn’t have any symptoms.  They treated it while I was in the hospital.That’s it.  I hope this answers your questions.  Thank you for trying to help.",
            "post_id": "3712883",
            "timestamp": "1227934491",
            "votes": 0
        },
        {
            "answer": "Oh and yes I've been given IV steroids.  Not sure which one.  It was given to me the first time I went into the hospital.  It helped with my numbness while I was there but I went home I began to feel worse.  The overall pain began and the stuttering.  The only way I've been able to see a Neurologist is if I'm admitted to the hospital.",
            "post_id": "3712887",
            "timestamp": "1227934665",
            "votes": 0
        },
        {
            "answer": "Greetings and welcome to the forum.  I see Shell and Doni have been in touch with you as well.  I would strongly encourage you to read the health page on pain medicines.  Like you I am pretty new to this and just assumed that popping a pilll would make everything feel better but it doesn't work that way with these drugs.If you need to go to the ER to see the neurologist, then go.  Fortunately December is now almost here and your clinic appointment will give you the chance to ask lots of questions.In the meantime, stay in touch, ok?Lulu",
            "post_id": "3713453",
            "timestamp": "1227967626",
            "votes": 0
        },
        {
            "answer": "Hi again, ge. I have lots of further comments, so please bear with me. First though, I want to emphasize that I'm not a doctor or even close, and have no medical expertise whatever. I do try to be an informed consumer, specifically about MS, and have learned a lot along the way, and especially from this forum. Our Health Pages have a wealth of information (including a listing of commonly prescribed MS meds).From reading your posts, I believe that your very first priority should be diabetes. This absolutely cannot wait. Your MS will not worsen significantly in the next few weeks, but diabetes could, if not treated appropriately. Please see your PCP and confer with her at length on this. You have had way too many doctors in the mix recently, but your PCP has been the only consistent one. You need to know for sure about your diabetes and how it should be treated.Next, I still believe you should get copies of test reports and office notes for every hospitalization or office visit, all doctors, since April. Not easy, but very important. You have to be the ultimate manager of your own health care, and may well need to take records from one outpatient doctor to others. If you need help getting the places to cooperate, post about it. We have discussions and good suggestions about this, including one member who is certified in medical records management. You should be persistent in getting reports of tests done to rule out MS mimics. It's not really possible to rule MS IN, except by a process of elimination.I am appalled that some hospital doctor strongly suggested you are mentally deficient because of brain atrophy. She knows nothing and probably couldn't find her way out of a paper bag. You clearly are very intelligent and capable, not someone who should have needed special ed. Brain atrophy is another subject involving MS, and there have been many posts here about it. If you use the 'Search this community' box you can bring up a lot of threads about this.Now for some comments about your meds. Holy mackerel. Even people 101 years old don't take this much. I'm concerned that since many doctors were involved, way too much is going on medication-wise. Some of your meds may be contraindicated by others. If I were you I'd review this situation very carefully. I would never take most of these unless I were sure I needed them. Having said that, I'll also say that I sure wouldn't go off them cold turkey either. Very dangerous. Please discuss this in detail with your PCP.I'm at least reasonably familiar with the MS meds you have, although bear in mind that other meds are often prescribed 'off label,' meaning not given for its primary purpose, but found to be helpful for other issues. Gabapentin (neurontin) is for neuropathic pain. Tramadol is an opioid, not something to mess with unless really needed. It's for regular pain, as is Naproxen, an NSAID. All of these can be harmful and need to be monitored and supervised. This is even more true of IV steroids. No one should be just sent off to do steroids, as we well know on the forum. Especially at the end of the infusions, follow-up and possibly a taper is needed.Most of your other meds I looked up very briefly. I don't see why you should be taking a BP med if you don't have hypertension. To protect your kidneys from what, specifically? Your diabetes situation I've already commented on. Mirtazepine is an anti-depressant, commonly called Remeron. From personal experience and consultation with my doctor, I know that small doses of this often help with insomnia, and paradoxically, larger doses don't. If you suffer from neither insomnia nor depression, why take it? Since you do mention sleeplessness, you need a further consultation on this. You also mention amitriptyline, a tri-cyclic antidepressant. It's too bad they didn't explain to you that in small doses (25 mg is very small; that's what I take), it's used for sleep, and also pain relief. I don't remember at the moment whether you have GERD or some other acid problem, but if it's not bad, why take omeprazole (Prilosec)?If you're having MS spasticity, baclofen makes a lot of sense. If you have MS bladder problems, oxybutynin might help, but I wouldn't take that unless I'd been worked up by a uro-gynecologist.I think I've covered everything but vitamin deficiency meds. One of our members, Elaine (Monotreme), is a nurse who knows a great deal on this subject, and maybe she'll chime in here. So I'll just make these general comments: B12 deficiency can be a close mimic of MS, with similar symptoms. Most over-the-counter tablets for this are pretty much useless, although the sublingual kind are better. Serious B12 deficiency requires injections. Vitamin D deficiency is frequently found in MS patients. I've never heard of D2 drops. Many here take quite a lot of D3 in tablet form. I'd check into this if I were you.If all of the ordeal you describe, and all of your meds are new since April, something is radically wrong--especially continuity of medical care. This is certainly not your fault. You're doing your best. I hope you have a family member or close friend to help you through this, and I hope you'll follow through with my suggestions. Meanwhile the forum is here to help you.ess",
            "post_id": "3713484",
            "timestamp": "1227968611",
            "votes": 0
        },
        {
            "answer": "Ess has done a wonderful job with her response and I agree wholeheartedly with everything she wrote.  The only thing I don't see mentioned is the idea to bring someone with you for your doctor visits.  Sometimes (well mainly all the time) we are so overwhelmed sitting with the specialists that we don't ask everything we should and don't remember everything that is said.  Taking someone along is very helpful.   - Lulu",
            "post_id": "3713529",
            "timestamp": "1227969738",
            "votes": 0
        },
        {
            "answer": "Wow, ess!!  That was such a great info filled post, you're the best!!!",
            "post_id": "3713617",
            "timestamp": "1227971643",
            "votes": 0
        },
        {
            "answer": "Thank you for the great responses.  You don't know how much this is helping.I know that I'm taking a ton of medication but I honestly don't know what to do.  Whenever I'm given a new prescription I always ask if I should discontinue any other medication and so far they've always told me not to.  That's why I'm on so many and honestly don't know what works and what doesn't.One day last week I was entirely fed up with doctors and all the medication I stopped taking them for a day because I felt that they weren't working because I was still in pain.  Well that definitely wasn't a good idea.  That day I was in so much pain that I couldn't even get up from bed.  So I went back to them.  I had no choice.  Now I'm apprehensive to stop any medication because I don't know which one to stop.When I go into see my PCP on monday I will show her the new medication and see what she says.  I will also tell her about me not being diabetic.  I'm still checking my sugars and they've been high in the morning.  So I still take one diabetes pill.  I'm really keeping an eye on that because I don't want it to get bad like I was in April.I have an appointment in the neurology on 12/12.  I'm hoping that the neurologist will be able to evaluate me and reduce my meds and give me better stuff.  It's just a hope you know.  My brother is going to go with me.  So that should help my nerves you know.As far as getting my medical records I can get them from my PCP.  My PCP is affiliated with all the hospitals I've been to.  So she always prints out this huge report with my meds, lab tests.  I'll read it over and see what it says.  Can anyone out there tell me why patients aren't allowed to read their own chart in the hospital?  I've tried a couple and the nurses always say I'm not allowed.  It just doesn't make sense to me.Anyways I hope this has answered your questions.  I appreciate you guys reading this.  Especially ess.  You've been amazing.",
            "post_id": "3715383",
            "timestamp": "1228011287",
            "votes": 0
        },
        {
            "answer": "Ge,As far as  reading the charts in the hospital, that throws back to the old days when we weren't allowed to see our own records - period.  But now you can get all those records - just contact the hospital after you are released and have them sent.  They don't want you reading them in the hospital partly because of the anxiety that those notes could cause to you - sometimes there are so many unknowns while you are in there waiting for treatment  But definitely get them after you are released.I also monitor my sugar - does your doctor regularly do an A1C to get your three month average?  I would ask about that one.your list of medicine is so extensive I think I would go for the visual impact of taking all of the pill bottles with you to your appointment so your PCP can see how many there really are.  There's nothing lilke show 'n tell to get the point home.I can tell you won't do it again, but please don't ever stop your meds cold turkey without consultation with your doctor - who knows what kind of reaction you can trigger if that happens.Try to have a good day and find something relaxing to do to take your mind off of this for a brief while ....My best, Lulu",
            "post_id": "3715536",
            "timestamp": "1228014703",
            "votes": 0
        },
        {
            "answer": "Well, now that you feel a bit more organized, I hope your anxiety over this is diminishing. It sounds as if your PCP is a good one. I agree with Lulu--put all your meds in a bag and take them on Monday. Go over each one with the doctor, and find out whether you really need them (this could take some experimentation), and how to get off the others.You have less than 2 weeks till your neuro appt. That's really not too bad. Most of us have waited months, sometimes 6 or more, to get in. Very annoying, and I guess the topic for another discussion.When you do go to him or her, take your medical records to be copied, don't just leave them there. In particular, if you can get actual MRI films or CDs, this will save loads of time and trouble. Let's just hope the neuro takes the time and makes the effort to actually look at them. Some don't (another discussion topic). Also take the radiology reports from the MRIs, and everything else you've assembled. I'm glad your PCP will help with this. You have a good ally there.The biggest reason for all this preparation is that you don't want the neuro saying \"Hmmm, I'll need more MRIs or some other tests first.\" He may do blood work, not a big deal, but otherwise all this will set you back before you're finally being treated comprehensively by a specialist. You don't want more months to go by until you go for another appointment.One note of caution---Especially when dealing with the neuro, don't mention the Internet or this forum. That probably wouldn't be a big issue, since you're presumably already diagnosed, but in general, the likelihood of getting blown off is big if the Web is brought up. If a doctor asks you how you knew to do this or that, you can always say you have some friends with MS who made some suggestions. And you do! We're here for you.Please keep in touch and let us know how things are going. We'll look forward to hearing from you.ess",
            "post_id": "3716533",
            "timestamp": "1228056023",
            "votes": 0
        },
        {
            "answer": "Thanks for the great advice guys.  I'm definitely going to take all my meds to my PCP and see what she says.  I think she'll be apprehensive about taking me on any of my MS drugs because she's not a specialist on the disease but maybe she'll surprise me.They have run the A1C test on me.  My PCP has run it frequently and every time I'm admitted into the hospital I know that they run it because they always mention it to me.In fact I think that's the test that made my most recent doctors(the ones that treated me in my most recent hospital stay) say that I wasn't diabetic.  But I think they are wrong.  This weekend I started eating normaly you know.  Not really watching what I ate and surprise, surprise my sugar skyrocketed to 253.  I haven't had it that high in many, many months.  So in my opinion I am diabetic but I'll get a second opinion from my PCP.  LOL.I have another question.  Have any of you guys had difficulty swallowing?  This is a brand new symptom for me.  Just started this weekend.  I've always been able to take my many many pills and swallow them down.  But now they feel stuck in my throat no matter how much water I drink to get them down.  In fact the go back up in to my mouth and that's just nasty.  So I dunno why that's happening now.Thanks again for all your help.  I really appreciated I will definitely let you know how my doctors appointment tomorrow goes.ge",
            "post_id": "3718111",
            "timestamp": "1228087277",
            "votes": 0
        },
        {
            "answer": "Ge,just logged back in and found your note - I'll be wanting to know what your PCP says when she see all those pill bottles - it is excessive and something really has to go from the pharmacy collection! :-)Your A1C should be below 6 if you are diabetic and watching your intake.  In fact everyone's should be below that number .... mine was 6.3 which flagged the doctors that perhaps I had problems.  I'm due for another one soon and we'll see if I have done better.  Its just like trying to get my cholesterol down and keep it there.... steady as it goes, you know?Swallowing can definitely be a problem with MS and i'm working through thaat one too - check out asphagia.  That's the technical name for it.  Be sure you mention it to your doctor.I'm glad you've come back and stayed in touch.  Good luck tomorrow getting all the info tht you are seeking,Lulu",
            "post_id": "3718154",
            "timestamp": "1228088070",
            "votes": 0
        },
        {
            "answer": "Okay so I went to the doctor yesterday.  It was my PCP.  She decided to take me off three of my meds and replace them with three new ones. Well two new one because I have been on the third without much sucess.She discontinued these three:1. Amitriptyline 25 mg2. Mirtazapine 15 mg3. Tramadol 50 mgReplaced them with:1. Ibuprofen 600 mg2. Vicodin 500 mg3. Trazadone 150 mgToday was the first day I woke up when I asked myself why did I even open my eyes.  I've never been in so much pain.  I couldn't even get up.  So the day started off like that it's pretty much been going like that.  I don't know if maybe I'm just having withdrawal symptoms from being taken off the Tramadol and Mirtazapine cold turkey.  I've been on the both for a couple of months.  I just don't know.In addition to back and legs my head has started to act up and for whatever weird reason I'm starting to have trouble urinating.  So I just don't know.My PCP wants to see me this thrusday.  So we'll see if she changes my meds again.Thanks for reading and for any comments or advice.",
            "post_id": "3728132",
            "timestamp": "1228282092",
            "votes": 0
        },
        {
            "answer": "Oh and she said she can't say wether I'm diabetic or not just yet.  She said that she would keep an eye on me and see what happens.  I still think I am.  I woke up this morning and my glucose was at 153 with my stomach empty.  So I think I'll keep thinking I'm diabetic till the doctors make up their minds.",
            "post_id": "3728141",
            "timestamp": "1228282207",
            "votes": 0
        }
    ],
    "post_id": "3710084",
    "question": "I just got back from a 3.5 day hospital stay and I’m still the same as I went in.  I originally went into the emergency room on Monday because I couldn’t take my back pain and needed better sleeping pills.  Well, they admitted me and ended up transferring to one of their other hospital promising me better care.  What a crock!!!Not only did they send almost 30 miles from home but I didn’t get the best of care.  I kept telling them my back and right leg hurt and they basically would only give me Tylenol or Advil which just pissed me off.  I refused it.  I mean I already know that it doesn’t work so why keep overworking my liver for nothing.  Basically treated me like a drug addict.  So frustrating.  They ran tests and a ton of MRI’s and they said the MS hadn’t spread so I guess that good.  But I’m still stuttering and my back and legs are still hurting.  They sent me home with 5 new meds and I really don’t have any faith in them because I was taking them while I was there and felt nothing.  They also still haven’t told me what type of MS I have.The only good thing or weird thing that happened while I was there was that they said that they didn’t think I was diabetic.  That’s right they said not diabetic.  So I’m sitting there trying to grasp that concept and beginning to wonder if maybe I don’t have MS.  I don’t know anymore.  You have faith in doctors and then stuff like this happens makes you question everything.",
    "timestamp": "1227844984",
    "title": "So lost and confused Part 2"
}