{
    "answers": [
        {
            "answer": "\"For six years, I believed there was a single-source connection between interferon resistance and interferon (sic) resistance.\"------------------------------------------------------------I'm guessing you meant:  For six years, I believed there was a single-source connection between interferon resistance and INSULIN  resistance.Are you saying that there is only ONE connection between the two, and that it's this gene? Could it be that simple? Who published it?Thank you.(Co-writer, please come in!!!)",
            "post_id": "3621023",
            "timestamp": "1225925613",
            "votes": 0
        },
        {
            "answer": "Sorry, I did mean insulin resistance.  I always get confused.  Both of them are abbreviated IR so that means there is a connection between IR and IR.",
            "post_id": "3621373",
            "timestamp": "1225931493",
            "votes": 0
        },
        {
            "answer": "SOCS-3 is elevated by HCV's core protein and other mediators of insulin resistance such as tumor necrosis factor- (TNF-), interleukin-6, and growth hormone.SOCS-3 elevation causes insulin resistance in the liver.  And insulin resistance causes hyperinsulinemia....and high levels of insulin make interferon ineffectiveLack of SOCS3 in the liver promotes systemic insulin resistance by mimicking chronic inflammation.We knew all that.  I believe there are actually 3 genes connected to SOCS3 and one of them is found more on non-respondersCoThe suppressor of cytokine signaling (SOCS) 1 and SOCS3 but not SOCS2 proteins inhibit interferon-mediated antiviral and antiproliferative activities.Song MM, Shuai K.Department of Medicine, Molecular Biology Institute, University of California, Los Angeles, California 90095, USA.The suppressor of cytokine signaling (SOCS) proteins are a family of cytokine-inducible negative regulators of cytokine signaling. Interferon (IFN)-gamma treatment induces the expression of SOCS1, SOCS2, and SOCS3 mRNAs. To examine the effect of SOCS proteins on IFN-mediated Janus-activated kinase/signal transducers and activators of transcription (STAT) signaling, HeLa- and MCF-7-derived stable cell lines expressing SOCS1, SOCS2, and SOCS3 proteins were established. SOCS1 and SOCS3 but not SOCS2 inhibited the tyrosine phosphorylation and nuclear translocation of STAT1 in response to IFN stimulation. The IFN-mediated antiviral and antiproliferative activities were consistently blocked by the constitutive expression of SOCS1 and SOCS3 but not SOCS2 proteins. The maximum inhibitory activities of SOCS1 and SOCS3 proteins toward the activation of STAT1 were observed at very low levels of SOCS protein expression. In addition, SOCS1 exhibited a much stronger inhibitory activity toward the activation of STAT1 than did SOCS3. These results suggest that SOCS1 and SOCS3 but not SOCS2 are inhibitors of IFN-mediated Janus-activated kinase/STAT signaling pathways.http://www.ncbi.nlm.nih.gov/pubmed/9857039?dopt=Abstract",
            "post_id": "3622229",
            "timestamp": "1225945797",
            "votes": 0
        },
        {
            "answer": "Actually, the article you reference states, \"The IFN-mediated antiviral and antiproliferative activities were consistently blocked by the constitutive expression of SOCS1 and SOCS3,\" which indicates that the overexpression of these genes directly block the cytokine, IFN-alpha.  As you suggested, hyperinsulemia occurs further down the chain: increased hepatic glucose output--->impaired glucose tolerance--->insulin resistance--->hyperinsulinemia.A recent study of pioglitizone + SOC demonstrated that managing insulin resistance via upregulation of PPARy does not increase the efficacy of SOC therapy.  A study with metformin + SOC seemed to indicate a small RVR outcome, but the study was very small and inconclusive.  Because of these results, I tend to view insulin resistance as a symptom of something further upstream, that may need to be addressed upstream, the overexpression of SOCS3.  TNF-alpha plays a vital role in mediating inflammation, but current TNF-alpha inhibitors come with a risk of infection, and possible carcinogenesis.  I am suggesting SOCS genes as a target for therapy.  The hepatitis C virus is well entrenched with a combination of viral and host factors.  I hope medical science should do what it can, not only to address the virus itself, but also manage host factors that mediate viral resistance, as they are identified.Miles",
            "post_id": "3622437",
            "timestamp": "1225951707",
            "votes": 0
        },
        {
            "answer": "I also believe that pre-treatment inhibition of CYP450 isoforms 2E1, 3A4, and 1A1 should be investigated.",
            "post_id": "3622498",
            "timestamp": "1225953180",
            "votes": 0
        },
        {
            "answer": "The Actos study used only 5 patients, all non-responders, genotype 1. At 12 weeks, two patients got a >2 log drop in viral load, one patient got < 1 log drop and the other two patients had poor response and their insulin resistance increased.The two patients who had the poor response and their insulin resistance increased were both on psych meds that can cause high blood sugar. One was on Olanzapine ...which is famous for causing high blood sugar and the other one was on Zopiclone. And to top it off, when taken together, Actos causes the levels of Zopiclone to go up.They used non-responders who were probably interferon resistant, they didn't use the best insulin sensitizer and they allowed patients to take meds that could increase their blood sugar (therefore increasing the insulin resistance).   Call me crazy but the only thing that study proved is that it was poorly planned.The Metformin study showed an RVR 4x higher on the Metformin group and SVR results were not available yet.  But there are a couple of interesting studies using Rosiglitazone and another using Metformin, Rosi or both (the arm using both lowered HOMA more).Bottom line...we know genetics are a factor ...but we don't have time to wait for something that will fix it (SOCS-3 is implicated in the etiology of diabetis too...so maybe we can borrow some of their studies...LOL). We need to work with what we have/know to increase SVR now.Co",
            "post_id": "3622544",
            "timestamp": "1225954961",
            "votes": 0
        },
        {
            "answer": "\"I also believe that pre-treatment inhibition of CYP450 isoforms 2E1, 3A4, and 1A1 should be investigated.\"Now you're speaking my language.  I totally agree.Co",
            "post_id": "3622554",
            "timestamp": "1225955166",
            "votes": 0
        },
        {
            "answer": "Hi MilesYou sure you are not looking too low down Miles. To me it seems that its HCV core that’s leads to IR. Also as you would already know HCV core activates CYP2E1 which is involved in the liver glucose cycle.HCV Core increases IRS-1 which leads to Insulin Resistance. HCV also activates CYP2E1 which releases glucose, which leads to IR. We then help it out by drinking Alcohol, by putting on weight and eating a high carb diet. Gets a bit circular all this ay.J Virol. 2007 Dec 26; : 18160431 (P,S,G,E,B)HEPATITIS C VIRUS CORE PROTEIN UPREGULATES SERINE PHOSPHORYLATION OF IRS-1 AND IMPAIRS DOWNSTREAM AKT/PKB SIGNALING PATHWAY FOR INSULIN RESISTANCE.Sutapa Banerjee, Kousuke Saito, Malika Ait-Goughoulte, Keith Meyer, Ratna B Ray, Ranjit RayChronic hepatitis C virus (HCV) infection has a significantly increased prevalence of type 2 diabetes mellitus (T2DM). Insulin resistance is a critical component of T2DM pathogenesis. Several mechanisms are likely to be involved in the pathogenesis of HCV related insulin resistance. Since we and others have previously observed that HCV core protein activates c-Jun N-terminal kinase (JNK) and mitogen-activated protein kinase (MAPK), we examined the contribution of these pathways to insulin resistance in hepatocytes.Our experimental findings suggest that HCV core protein alone or in the presence of other viral proteins increases Ser(312) phosphorylation of the insulin receptor substrate-1 (IRS-1). Hepatocytes infected with cell culture grown HCV genotype 1a or 2a displayed a significant increase in the Ser(473) phosphorylation status of the Ser/Thr kinase protein kinase B (Akt/PKB), while Thr(308) phosphorylation was not significantly altered.HCV core protein mediated Ser(312) phosphorylation of IRS-1 was inhibited by JNK (SP600125) and phosphatidylinositol-3 kinase (PI-3K) (LY294002) inhibitors. A functional assay also suggested that hepatocytes expressing HCV core protein alone or infected with cell culture grown HCV exhibited a suppression of 2-deoxy-D-[(3)H] glucose uptake.Inhibition of the JNK signaling pathway significantly restored glucose uptake despite HCV core expression in hepatocytes. Taken together, our results demonstrated that HCV core protein increases IRS-1 phosphorylation at Ser(312) which may contribute in part to the mechanism of insulin resistance.And this one show the same thing with G1b and G3aHepatitis C Virus Core Protein affects Insulin Signalling in a genotype-specific MannerMW DouglasThe aim of this project is to study the effects of HCV core protein from different virus genotypes on Insulin Signalling.Increased phosphorylation of Insulin Receptor Substrate (IRS)-1 at inhibitory serines312 and 639 was observed, more with Genotype 1b than with 3a core also preferentially increased phosphorylation of Gab1 and PTEN which inhibit IRS-1 signallingWe conclude that novel genotype-specific differences in Insulin Signalling in response to transfection with HCV core Protein are present in Hepatocyte-derived cell lines.These differences may account for the genotype-specific influences of CHC on Insulin Signalling.Hows things with you anywayCS",
            "post_id": "3622812",
            "timestamp": "1225970535",
            "votes": 0
        },
        {
            "answer": "Hey CS - all is well here.  Good to see you.2E1 is a big problem, especially for HCV patients with diabetes, which upregulates 2E1 expression even more.  Unfortunately, most 2E1 inhibitors cause problems with platelet agglutination, with the notable exception of nicotine, which actually promotes agglutination.  I tried garlic oil, which I don't recommend.  Although it cut my need for insulin by 1/3, I noticed bleeding problems after fingerpricks for glucose testing (as in being able to get blood out of the same fingerprick for the entire day).  I haven't tried nicotine gum yet, but I'm considering it.  I also stopped all 3A4 medications, and although I can't correlate it scientifically, my viral load has dropped from a whopping 32 million to 784,000.  I haven't taken anything known to inhibit this isoform.  I just stopped taking inducers/substrates.Co - There is a lot being done with antisense oligonucleotide therapy in oncology and other medicines.  This kind of therapy may be highly effective in downregulating SOCS3.  It is currently used in lab experiments to block SOCS3.",
            "post_id": "3625441",
            "timestamp": "1226012628",
            "votes": 0
        },
        {
            "answer": "I agree with you.  I believe the insulin-sensitizer studies so far have been flawed by sample size, patient criteria, etc.  I must say, I got my best tx response ever when my doctor put me on Avandamet at week 16.  By week 18 I experienced a sudden 1.5 log drop in viral load.  The correlation between IR and IR were unknown at the time.  I stopped taking the drug because of GI side effects and my viral load began to climb again.",
            "post_id": "3625488",
            "timestamp": "1226013302",
            "votes": 0
        },
        {
            "answer": "When I tried high-dosing IFN, it made my glucose problems worse.",
            "post_id": "3625494",
            "timestamp": "1226013391",
            "votes": 0
        },
        {
            "answer": "A randomized trial of 24- vs. 48-week courses of PEG interferon a-2b plus ribavirin for genotype-1b-infected chronic hepatitis C patients: a pilot study in TaiwanMutations of interferon sensitivity determining region (ISDR) in the HCV-1b NS5A region correlate with SVR to IFN-based antiviral therapy in Japan and Taiwan, but not in Europe.Geographic differences between mutant-type ISDR strains in HCV-1b may lead to variations in response of HCV-1 to IFN in Western and Eastern countries.Or it could be different levesl of Insulin Resistance, which is higher in Western countries than in Eastern countries.Now if IR is such a good predictor of svr, crosses genotypes and is associate with every negative predict although only losely with HVL, wouldn't that be a better place to research than 1b amino acid mutations.There are a few abstarcts from Japan presented if you still want to go down that path.I know i was IR. So are you.Here is an Abtract from AASLD.Insulin-Resistance in Chronic Hepatitis C patients: New Predictor of Sustained Virological Response Independent of HCV Genotype and Liver Fibrosis StageCategory: \tQ07. HCV: TreatmentSession: \tHCV: TherapyAuthor(s): \tR. Moucari, M. Ripault, M. Martinot-Peignoux, A. Cardoso, T. Asselah, N. Boyer, D. Valla, P. Marcellin, Service d'Hépatologie and INSERM U773, Hôpital Beaujon, Clichy, FRANCE; H. Voitot, M. Vidaud, Service de Biochimie, Hôpital Beaujon, Clichy, FRANCE; S. Maylin, Service de Microbiologie, Hôpital Beaujon, Clichy, FRANCE; P. Bedossa, Service d'Anatomie Pathologique, Hôpital Beaujon, Clichy, FRANCE;Date: \tMonday, November 03, 2008Full Text:Abstract:Background & Aim: Insulin-Resistance (IR) has been previously shown to impair sustained virological response (SVR) rate in chronic hepatitis (CHC) patients infected with genotype 1 when treated with pegylated interferon and ribavirin. The aim of this study was to assess the independent impact of IR after adjustment to major predictors of SVR, particularly HCV genotype and liver fibrosis stage. Patients andMethods:167 consecutive non-diabetic treatment-naïve CHC patients, treated in our centre with pegylated interferon plus ribavirin, were prospectively assessed. Insulin resistance was assessed using the Homeostasis Model (HOMA-IR). HCV genotype was determined by sequencing. Serum HCV RNA was quantified using bDNA (Bayer Versant HCV RNA 3.0 Assay). Liver histology was assessed using the METAVIR score. SVR was defined as undetectable serum HCV RNA 24 months after treatment stopping.Results:Baseline characteristics were: male gender (66%), mean age (46±9 years), mean BMI (24±4 kg/m2), excessive alcohol consumption (9%). Blood transfusion and intravenous drug injection were the principal source of transmission (52%). HCV genotype distribution was: 1 (47%), 2 (7%), 3 (24%), and 4 (22%). Mean serum HCV RNA level was 5.5±0.7 log10 IU/mL, and 42% of patients had high serum HCV RNA level (>600 000 IU/mL). Median value of HOMA-IR was 2.1 (IQL range 1.1-4.6). Liver histology showed moderate-severe necroinflammation (METAVIR score A2-A3) in 46%, severe fibrosis (METAVIR score F3-F4) in 32%, and severe steatosis (>30%) in 29% of patients. By univariate analysis, SVR was associated with HOMA-IR, HCV genotype, serum HCV RNA level, liver fibrosis stage and steatosis. Patients with HOMA-IR 2 (72% vs. 44% respectively, p<0.01). Patients infected with genotypes 2 and 3 achieved higher SVR rates than those infected with genotypes 1 and 4 (79% vs. 46% respectively, p<0.001). Patients with low viral load achieved higher SVR rate than those with high viral load (67% vs. 44% respectively, p<0.01). Patients with mild-moderate fibrosis achieved higher SVR rate than those with severe fibrosis (62% vs. 44% respectively, p<0.05). Patients with mild-moderate steatosis achieved higher SVR rate than those with severe steatosis (62% vs. 42% respectively, p<0.05). By logistic regression, SVR was associated only with HCV genotype 2 and 3 (p<0.001, OR=4.5, CI=2.0-9.8) and with HOMA-IR <2 (p<0.01, OR=2.8, CI=1.4-5.5)Conclusion:Insulin-Resistance is a major negative predictor of SVR in CHC patients treated with pegylated interferon plus ribavirin. Impact of IR is independent of HCV genotype and liver fibrosis stage.",
            "post_id": "3627031",
            "timestamp": "1226042424",
            "votes": 0
        },
        {
            "answer": "Well yes, that's the thing.  Host factors are a huge variant with tx.  I believe more should be done pre-treatment to manage host factors that are predictive of response.  My first hepatologist believed the 1a patients in Europe carried a different 1a strain, but a some of what I read these days suggests that racial host factors may be involved.",
            "post_id": "3629076",
            "timestamp": "1226085619",
            "votes": 0
        },
        {
            "answer": "\" I haven't tried nicotine gum yet, but I'm considering it.\"The med insert says nicotine gum is a weak 2E1 inhibitor....and it's not recommended for those with hypertension or insulin dependent diabetes.Plus, you would need to maintain high levels, because at low doses, nicotine increases 2E1.....\"Our findings indicate that nicotine increases CYP2E1 at very low doses and may enhance CYP2E1-related toxicity in people treated with nicotine.\"http://jpet.aspetjournals.org/cgi/content/full/306/3/941If you like spicy food you could try using dihydrocapsaicin (found in red peppers)....it's a good 2E1 inhibitor.Co",
            "post_id": "3635691",
            "timestamp": "1226247245",
            "votes": 0
        },
        {
            "answer": "These are the final reasults of the Metformin+SOC study....(genotype 1, they all had a HOMA greater than 2 and the study used Metformin 425mg tid for 4 weeks, then increased it to 850mg tid).\"Adding Metformin to Standard Peginterferon alfa-2a/Ribavirin Regimen Improves Insulin Sensitivity in Patients With HCV InfectionSOC+Metformin vs SOC+placeboSVR  52.5%  vs  42.2%HOMA-IR less than 2 at Week 24  55% vs 13.6%SVR for Females 57.7% vs 28.6%Summary of Key Conclusions:Metformin added to peginterferon alfa-2a/ribavirin regimen in genotype 1 HCV-infected patients with insulin resistance....* Significantly improves insulin sensitivity.* Shows trend toward improved sustained virologic response (SVR) rates.*  Ad hoc analysis found significant improvement in SVR rates for female patients only.Treating insulin resistance potential new goal for HCV therapy.\"Now they need to stop messing around and quit using suboptimal doses ...and start the Metformin earlier.Co",
            "post_id": "3636071",
            "timestamp": "1226254577",
            "votes": 0
        },
        {
            "answer": "Co: \"SOC+Metformin vs SOC+placeboSVR  52.5%  vs  42.2%HOMA-IR less than 2 at Week 24  55% vs 13.6%SVR for Females 57.7% vs 28.6%\"----------------------------------------------------------------------------------Did I understand correctly that \"SVR for Females 57.7% vs 28.6% \" was achieved in SOC and Metaformin compared to those females with SOC and placebo?I haven't been following the forum much but presumably this relates to females who are insulin-resistant before treatment? This is really astonishing stuff and you'd think it would make giant waves. If I were a female with insulin-resistance, I'd pay close, close attention.",
            "post_id": "3636462",
            "timestamp": "1226262421",
            "votes": 0
        },
        {
            "answer": "\"Did I understand correctly that \"SVR for Females 57.7% vs 28.6% \" was achieved in SOC and Metaformin compared to those females with SOC and placebo?\"That's right.  The women did much better than the men.And the SVR  of 52.5%  vs  42.2%  is for ITT.They started with 123 patients and 22 of them discontinued because of non-compliance, they chose to stop before week 24, lost to follow-up, etc.Of the 101 that finished the study, SVR was 67.4% vs 49.1%(and people may do better if the Metformin is started before tx)\"This is really astonishing stuff and you'd think it would make giant waves. If I were a female with insulin-resistance, I'd pay close, close attention. \"The bad thing is that most doctors don't test patients for insulin resistance.The info on insulin resistance has been out there for years and docs have done nothing about it.  They kept saying that there was data that proved that insulin resistance lowered SVR but there was no data that proved that improving insulin resistance would increase SVR....Which drove me absolutely crazy!Well....there's data now.  Let's see what they'll do with it.Co",
            "post_id": "3636622",
            "timestamp": "1226266481",
            "votes": 0
        },
        {
            "answer": "Interesting 1st post.If by dont push it you mean dont push the Insulin Resistance thingThen If Co dont push It I will.Whats your game.CS",
            "post_id": "3642746",
            "timestamp": "1226397353",
            "votes": 0
        },
        {
            "answer": "Think I might have mentioned it this Spring, but my doc made a comment of his involvement with an upcoming Hep C/insulin resistance trial..Might be old news to you, but stumbled on a tiny bit of info, seems it started this Summer..http://www.dhmc.org/webpage.cfm?site_id=2&org_id=102&morg_id=0&sec_id=0&gsec_id=46442&item_id=46494",
            "post_id": "3667511",
            "timestamp": "1226926130",
            "votes": 0
        },
        {
            "answer": "Thanks.I hope they do a better job than this study did. Talk about mess it up.Pioglitazone (Actos) in chronic hepatitis C not responding to pegylated interferon-a and ribavirin Journal of Hepatology 49 (2008) 295–298Background/Aims:Insulin resistance reduces the response to interferon alfa-based therapy of chronic hepatitis C patients. It has been speculated that improvement of insulin sensitivity might increase the chances of responding to treatment of such individuals.Methods:We started a multicenter clinical trial of retreatment of chronic hepatitis C patients, who had failed to respond to the pegylated interferon alfa/ribavirin combination, with a triple therapy consisting in these same antivirals plus an insulin-sensitizer (pioglitazone) (The INSPIRED-HCV study).Results:None of the first five patients fulfilling the inclusion criteria and included in the trial had a satisfactory virological response after 12 weeks of retreatment, despite the fact that in at least three of them the insulin resistance score improved. As a result, the study was terminated.Conclusions:Different schedules are warranted to improve insulin sensitivity prior to attempting retreatment of chronic hepatitis C patients with insulin resistance.CS",
            "post_id": "3668970",
            "timestamp": "1226947735",
            "votes": 0
        }
    ],
    "post_id": "3620801",
    "question": "For six years, I believed there was a single-source connection between interferon resistance and interferon resistance.  It is, as I suspected, a gene.  The gene is SOCS3 - Suppressor Of Cytokine Signaling-3.  The discovery of this gene also sheds some light on why prior nonresponders have more trouble acheiving SVR.1. SOCS-3 is elevated by HCV's core protein.2. SOCS-3 elevation causes interferon resistance.3. SOCS-3 elevation causes insulin resistance in the liver.4. SOCS-3 depletion reduces liver insulin resistance, but causes systemic insulin resistance.5. SOCS-3 is further elevated in people who have treated unsuccessfully.These findings suggest a new and viable target for therapy.",
    "timestamp": "1225922779",
    "title": "SOCS3 Gene: Insulin Resistance, IFN resistance"
}