{
    "answers": [
        {
            "answer": "Hello  handsome...thank you for writing.First, I need to tell you that I am not a medical professional, so my advice is not in place of professional, medical advice.  I am simply giving you input based on my personal experience and knowledge.My 9-1/2 yr. old son was diagnosed with Type I at the age of 3 and my sister was diagnosed eight yrs. ago at the age of 24.Honestly, I do not know that there is a way to TOTALLY prevent these horrible complications, however, taking care of your diabetes by testing your blood sugar at least 4x a day and taking your insulin, as well as taking note of high blood sugars several days in a row or at certain times of the day is important so you may call this to your Endocrinologist's attention so he/she can change your dose, thus hopefully helping blood sugars to be in better control.  (My son's Endocrinologist once daid that trying to control diabetes is like trying to control a natural disaster), so do not beat yourself up when you are high, just think about maybe whether you had too many carbs or maybe your dose needs to be adjusted- per docs instructions.Taking care of yourself by taking your insulin and exercising is NOT worthless...please do not ever think that!  If we have Type I diabetes or have a loved one who is a diabetic, reading the complications can scare us to death, but we cannot give up.....there is a very good chance that there will be a CURE in our lifetime, so keep taking care of yourself.I believe that the people who ignore the fact that they are a diabetic and do not take care of themselves are at higher risk.Although I am not a diabetic, my little boy is, so I can understand that at times, you would feel hopeless, but just take care of yourself and listen to your Endo.  (unless you are ucomfortable with your Endo...then find a new Endo:)I am taking part in the Walk to Cure Diabetes in my city and take part every year and together we wil help to find a cure.  Keep the faith.As far as your eyesite question, I do not have an answer.  I do know as you probably already know that when your blood sugar is HIGH, you can experience blurred vision AND when your blood sugar is LOW you can have impaired vision.Let me add another 2cents....wear a necklace or a bracelet stating Diabetic....it could save your life!Please write for support whenever you need it.If you are newly diagnosed it is a hard thing to digest and the information can be overwhelming.  Find a support group in your area and know that we are here for you.Keep us informed:)",
            "post_id": "2429604",
            "timestamp": "1093323600",
            "votes": 0
        },
        {
            "answer": "I cannot understand why somebody who has diabetes is called a \"diabetic\"! if i have diabetes, i am me and i have along with me diabetes, i don't become diabetes!If someone has cancer (heaven forbid) do you call him a cancer?It makes me feel very uncomfortable.",
            "post_id": "2433646",
            "timestamp": "1093323600",
            "votes": 0
        },
        {
            "answer": "Technically, Handsome is absollutely correct that we are diabetic PEOPLE, and that the word \"diabetic\" is merely an adjective that describes the noun \"people\".  We have diabetic condions, in the same fashion as a person with a tumor has a cancerous condition. However, for some reason, we who mangle formal English so readily do tend to lazily drop the noun and call the person with a diabetic condition a diabetic, while we would never call the person with the cancerous condition a \"cancerous\" or, worse still, a \"cancer\". The suggestion that we simply reduce people to their diseases brings up some kind of funny possibilities, though, and I am chuckling at the thoughts of people being referrred to as anemics or bacterials or even obesitics, if you use the words diabetes and diabetic as models and apply the use of the adjective as a noun to describe the person who has the condition to other health issues.That being said, let me assure you that I am a long-time diabetic person who does NOT have any complications after 35 years on insulin. I know of others who have been taking insulin for longer than I have who also are spared the complications. So it is NOT hopeless. While there do seem to be some genetic reasons why some folks seem to suffer complications and others do not, many studies have proven that tight glucose control DOES dramatically reduce the risk of complications. I was diagnosed at age 12 and am now a ridiculously healthy grandma and I hope you will take heart to realize that there are many of us long-timers out here suffering no damages from this disease probably largely because of good control.",
            "post_id": "2433647",
            "timestamp": "1093323600",
            "votes": 0
        },
        {
            "answer": "HandsomeLike you, I prefer to think of myself as a person with diabetes.  I have participated in other discussion boards where the topic for many many days was what we call ourselves, what others call us, and the feelings that're triggered by those names.  These discussions are a potent reminder that diabetes has an impact on us not jsut physically, but also emotionally and psychologically.For me, even after 35+ years, my loved ones can (and do!) inadvertantly press a \"hot button\" and I can feel myself react inside with a tightness, sometimes anger.  I'm aware of it adn that's at least a step toward accepting their limitations in understanding just how I want to be treated (I must admit, however, that how I want to be treated varies!!).  My sense from your msg is that you've begun to deal with this issue, too and I hope you are comforted by knowing SS' intentions are good.I'd also like to comment on your question that I'll paraphrase as \"why bother if the outcome can be so dismal?\".  There are millions of us diabetics (oops, I did it, too -- folks with diabetes) who cannot or will not learn about and actively manage their insulin and lifestyles to care well for themselves.  I firmly believe that those folks are contributing in a statistically signficant way to the dismal outcomes we read about.  It *is* true that if we do not care for ourselves, we almost certainly face a steady onslaught of nasty, painful, debilitating, and depressing complications.  HOWEVER ... those of us who work at it, discover our patterns, adopt a marathoners attitude to succeeding, embarce a lifelong learning approach to our disease AND have reasonably lucky genetics -- we can EXPECT to live long, healthy, active lives.One thing seems so clear to me now -- after 35+ years with diabetes and approaching age 50.  My non-diabetic pals are gradually adopting what I must call a lifetyle perfect for managing diabetes!  They're watching their refined carbos, they're eating more fruits 'n' veges, they're avoiding saturated fats, they're committing to exercise ... it's everything we've been encourged to do from day 1!  We're ahead of the game if we've succeeded before middle age ;-)So, Handsome (what a great name you chose, BTW), please go forward with the assurance that every good nurture-thyself decision you make day after day DOES make a huge difference both in how feel that day and how well you'll feel in the future.  While I think of myself as a long-timer, my sister has had diabetes for 45+ years, and I have cyber-pals who've had it more than 60 years.  We're aging but not much differently from non-diabetics.Since I'm a glass half-full type of person, I also have an easy time lookin' at the issues that many non-diabetic folks have to deal with and y'know what?  I'm actually grateful that this is the burden I get to carry.  It's a disease that SHOULD be cured, but it's not an early-death sentence.",
            "post_id": "2433652",
            "timestamp": "1093323600",
            "votes": 0
        },
        {
            "answer": "In reply to your post below:____________________________________________________\" cannot understand why somebody who has diabetes is called a \"diabetic\"! if i have diabetes, i am me and i have along with me diabetes, i don't become diabetes!If someone has cancer (heaven forbid) do you call him a cancer?It makes me feel very uncomfortable.\"______________________________________________________I apologize if I offended you by posting a message in response to your posting and using the term diabetic.  My son is my son and happens to have diabetes.Please do not take this the wrong way and I am not meaning to sound sarcastic or rude, but, you are recently diagnosed, as you mentioned.  I have to let you know from my experience with my son having type I diabetes and my sister having type I diabetes, you will come across many people in your life that will say things that upset you because they do not understand or they do not know what diabetes is, however, what I have learned (and it has taken me several yrs. to learn this) is sometimes we have to let it go in one ear and out the other.I have had people think my son was sick or unhealthy because he is a kid who has diabetes and sometimes it is not worth your breath to educate people and go through a lengthy explanation.Also, if you read several threads on this forum, you will notice there are many people who say \"I am a type I diabetic\" or \"my daughter is a diabetic.\"I am sorry if that makes you uncomfortable and I do not mean that in a sarcastic way.  I was uncomfortable having to chase my son around the house when he was 3 yrs. old and give him a shot and have him say, \"I hate you Mommy,\" but I dealt with it.Also, some people who have asthma say I am an asthmatic. (sp?)In my last post I was really trying to be positive and tell you there is definitely a hope for a Cure in our lifetime and tell you that your efforts are not worthless.",
            "post_id": "2433650",
            "timestamp": "1093323600",
            "votes": 0
        },
        {
            "answer": "Hello again, Handsome.I can understand what you are saying about not wanting to be badgered y friends trying to tell you what to do, eat, etc. and they may not even fully understand it.But...one thing you ned to keep in mind is if your friends know you are a person who has type I diabetes and they know some keypoints:- You count carbohydrates (I have always told people that my son can eat just about everything I can, but only certain amounts and at certain times) If your friends start annoying you by saying \"are you sure you should eat that?\" etc...then you need to say, I am seeing an Endocrinologist, I know what meal plan to follow and I would appreciate it if you let me decide what I am able to eat.- Low Blood Sugar and some symptoms you might have (Please keep in mind, Handsome, if you are out with friends and become low, wouldn't you want them to know what to do?  Your friend could posibly save your life if you were disoriented and needed sugar immediately.)- High Blood Sugar (Just let them know a little about what symptoms you might have)If you were recently diagnosed this must be a VERY difficult time for you.  I am sorry.  As I mentioned, my boy was 3 when he was diagnosed.  As far as not liking being called a \"diabetic\" I honestly never thought of that and I am guessing (please people do not jump on me for this) that some people with diabetes are bothered by this and others are not.  Maybe sometimes it is based on at what age you were diagnosed.  My son was 3 and is now 9-1/2 and when I told the school I wanted to make sure any adult (teacher, lunch monitor,etc.) that he might be in contact with knew so if he was low and needed help they would know what to do, he did mention that he would handout a letter I had written w/my son's picture on it at the next meeting (this was last yr.).  He said sometimes parents want it to be kept confidential.  My son heard this and said, that's stupid Mom, just like wearing my necklace, it could one day save my life.  But, as I mentioned he was 3 when diagnosed, so he actually tells people himself and has since he was 3.Now, my sis who is now 32 (diagnosed at 24) didn't wear a necklace or bracelet for a long time and had been apprehensive in the past about employers (because of discrimination, etc.).  Well, she does not mind saying she is a \"diabetic\" and she finally found thes cool italian charms and created her own bracelet and it has a few medic alert symbols and a few little charms that say diabetic, but the bracelet looks cute, so she now wears it.  With her last job, she wasn't going to saying anything, but then one day she was with a supervisor who was along with her on her route (cosmetic/skincare sales route type job) and her supervisor went hours without eating and kept going and going and finally my sis said, I have to stop and eat because I have diabetes.Anyway, I am long-winded, I know.....but as I mentioned, maybe depending at what age someone was diagnosed they may feel differently about who knows.(At the age of 3, Charlie would be in the grocery story wth me an say, I am a diabetic and sometimes now at 9 he will show someone his necklace and now his insulin pump because he just started on it this past Friday!)Another 2 cents here...maybe you can find a support group in yur area with people in your age group????  Just a thought.Remember, I do not know how it feels to have diabetes, I just know how I feel being the Mom of a child living with it and I love my sweet little boy to death and at times I cry because I want a CURE NOW!!!!  At 4:30 am this morning when I tested him (we are testing him during the night now since he just started on the pump) he was in the 300's and I was laying in bed crying setting my alarm for 1 hr later so I could re-check to make sure the bolu I just gave him worked, then I got out of bed and decided to re-write my page on JDRF that pertains to the Walk to Cure Diabetes that will be going on in my city in October.(Oh, his bg finally went down)Handsome you need support and please know that you are not alone and post whenever you'd like.Please think about what I said about the telling your friends issue.(Oh, if I have any typos, sorry, I can spell, but cannot always type and my post is too long for me to proofread right now as I have to get myself moving to get last minute stuff for school:)",
            "post_id": "2433654",
            "timestamp": "1093410000",
            "votes": 0
        },
        {
            "answer": "I'm sorry, i didn't realize that i got a response to my comment so i posted a seperate question, please disregard it.I am very impressed by the quick and courtious responses received here!I just think i would like to add my own 2 cents. I've spent a lot of time looking at forums on the internet on diabetes, and one common depression-related complaint was that every time they go out with friends, their friends are all over them telling them what to eat and what not.I think that someone who has diabetes should not tell ANYONE exept IMMEDIATE family (i.e. Father, mother, sister and brother) and their principle or boss (and obviously, their doctors: Eye, dentist, podiatrist, physician) But nobody else.If you intend to marry somebody, you can tell them obviously.The more people you tell, the more people will bug you and remind you.Thank you",
            "post_id": "2433653",
            "timestamp": "1093410000",
            "votes": 0
        },
        {
            "answer": "Hi Handsome!  My 16 year old daughter was diagnosed at the age of 21 months and the emotions that went along with her diagnosis are still fresh after 15 years.  I am a sensitive person and a bit over-protective when it comes to my kids, so I too, took offense to my daughter being referred to as a diabetic.  I felt that it was very important when my daughter was young to not be labeled.  None of us like to be labeled.  I made a special effort to NOT refer to her as a diabetic, but someone who has diabetes.  I wanted her to think of herself as \"Hannah\" who had diabetes, not a diabetic named \"Hannah\".  Do not let others let you think any differently.  I have come to the realization that people do not mean anything negative by their reference (it did take quite a few years to come to that and I'd like to spare you from dwelling on it that long!).  She has never felt that diabetes has made her any less healthy than anyone else and as a matter of fact, she often tells me how she is more healthy than many of the kids her age because she is aware of what she eats and is physically active.  These are the really important things to remember as you begin your life with diabetes.  It takes time to accept these major lifestyle changes, so give it to yourself and use this time to educate yourself on what you can do to keep yourself in the best shape possible and also consider looking into joining JDRF and using your energy toward finding a cure for this disease.  There are many possible cures being worked on everyday that will be making a difference in all of our lives in the near future.  You sound like someone who has alot of energy that could be used in a positive way to making a difference.  Good luck to you and let us know how you are doing.",
            "post_id": "2433718",
            "timestamp": "1093669200",
            "votes": 0
        },
        {
            "answer": "Nice to hear from you, handsome!Yes, handsome, you're right that having normal blood glucose levels is the primary step.  Regular aerobic exercise and whole foods are the way to achieve normoglycemia.  I have been running three or more hours a week since 1977.  I have been living with type 1 diabetes for the last dozen years.  No complications before I die--that's my goal, and so far, I've achieved it.The other ways to avoid complications are secondary but also important.  First, drink plenty of distilled water everyday.  Second, protect with eyes with sunglasses when you're outdoors.  Get lenses that completely block UVA and UVB frequencies of ultraviolet light.   Third, have your retinas inspected by an ophthamologist once a year.   Fourth, avoid drinking alcohol until your blood glucose level is normal (80-120 mg/dl).Naturally, as you already know by now, avoid sugary foods.  Avoidfoods that have been adulterated with the most common food adulterants:   sugar, salt, and hydrogenated fats.  Read labels on prepared foods.   Remember the list of ingredients is in descending order of concentration.   So if one of the first three ingredients is sugar or molasses or high-fructose corn syrup or anything like that, you'd be best to avoid it unless your goal is to increase your blood glucose level.  Even then, you must learn moderation.Unadulterated foods are best.  Whole foods for whole people.Nick",
            "post_id": "2433757",
            "timestamp": "1095310800",
            "votes": 0
        },
        {
            "answer": "handsome,I am a volunteer and would like to comment on your most recent posting (This is an important notice:) however, I am unable to do so through the page I login at, but it will let me comment to this older posting.  (unsure why - but I hope you get notified that I have commented)First, I have to tell you I am not a medical professional, so my input is soley based on personal experience and knowledge.My son was diagnosed at the age of 3.  He is now 9-1/2.  My sis was diagnosed at the age of 24.  She is now 32.Anyway,I need to tell you how pleased I am that you are doing better.  I am so glad that you have found a friend who is also living with Type 1 diabetes whom you can share your experiences and feelings with.  This is great and much needed!!I am friends with a Mom who has a daughter who is living with diabetes.  Her daughter was diagnosed at the age of 15 months!  She understands me and her support at times is how I get through difficult times...like at the beginning of a school year!  Also, My son goes to a day camp every summer that is for children ages 5 - 12 who are living with diabetes and he loves going there and looks forward to it each year when summer rolls around.  He is friends with the daughter of the lady I spoke of.  He says she is his girlfriend:)I agree about the \"Clean Hands\" comment.  When my son was newly diagnosed, we tested him one time and he was outrageously high!  Well, we took a look at his hands that appeared a blue or green color.  (can't remember)  Then I thought, oh, yah, he just ate and Otter Pop and some got on his hands leaving them with sugar on them.  Now, I always make sure to remind him to wash his hands.  We carry alcohol swabs in the little pouch in his glucometer case for times when we are driving or when getting to a sink as an inconvenience or impossible!As far as the fast glucometer, I completely agree with you!we have one that takes only 5 seconds and we like it a lot better than the older one we had when he was first diagnosed.I have heard that the pens are way more convenient as you mentioned.  Now my boy is on the pump, so this is our new method of insulin delivery.Handsome, once agan  I need to mention how pleased I was when I read your most recent posting!  I am happy that you have a friend who can relate to you.It must have been extremely hard at first.  I cannot say I understand because it is my son (and sister) who are living with diabetes...I just know the feelings from a Mom's perspective. I know that when my boy ws diagnosed at age 3, we stayed at the hospital for 3 days with him and my husband was very angry...\"why our boy?\" he would say.  One thing I said to my husband (and this is not meant in any way to minimize the effects or daily living with diabetes) is that somewhere in this hospital there are parents who have just learned that their child has a terminal illness and they would trade with us in a heartbeat.  That was the only way I could look at it and not be angry.  Yes, I was completely overwhelmed with a ton of info. being crammed into my brain in a 3 day period and with the thought of having to give my little boy shots.Sorry to get off track..I am a bit of a blabber mouth!It sounds like you have done a complete turnaround and I am very happy for you. Keep up your positive outlook and if there is a day when you are feeling down, you now have a friend who understands, (the one you mentioned) so do not isolate or hold it in.  Talk to your friend.Take care and keep us posted!!!",
            "post_id": "2433796",
            "timestamp": "1096347600",
            "votes": 0
        }
    ],
    "post_id": "2429603",
    "question": "Hi,I have been diagnosed with type 1 diabetes recently, i am pretty much physically in shape.My question is, all the websites about diabetes write that it causes blindness and heart attack and stroke, making me feel hopeless, as if all the exercise and training i do is worthless because it won't help anyway, is there a way to TOTALLY prevent these problems? (besides keeping blood sugar normal)Also, ever since i have been diagnosed, although my eyesite became much better, it still isn't what it was before, can you offer an expaination?Thank you.",
    "timestamp": "1093323600",
    "title": "the outcome"
}