{
    "answers": [
        {
            "answer": "It most likely means that you have an autoimmune disorder called Hashimoto's Thyroiditis.  With Hashi's the immune system erroneously determines that the thyroid gland is \"foreign\" to the body and produces antibodies to attack and eventually destroy the gland.  Along the way, your TSH level will continue to rise trying to stimulate the gland to produce thyroid hormone.  The gland's output of hormone is gradually diminished, requiring increasing dosage of thyroid meds to offset the loss of natural thyroid hormone.When you go for additional tests be sure to insist on Free T3 and Free T4, the biologically active thyroid hormones (not the same as Total T3 and Total T4).   As Free T3 and Free T4 levels drop toward the lower part of their ranges, hypo symptoms begin to become noticeable.  Are you having any hypo symptoms yet?One thing further, is that hypo patients are frequently too low in the ranges for Vitamin D, B12 and ferritin.  So it would be a good idea to test those as well.When you have more test results, if you want, please post those, along with ranges shown on the lab report, and members will be glad to help interpret and advise further.",
            "post_id": "11251616",
            "timestamp": "1412132647",
            "votes": 0
        },
        {
            "answer": "Thank you so much for your comment.  I really appreciate it !My older sister and my mom have  Hashimoto Thyroiditis and my  identical twin sister is not Hashimoto , but she was hyperthyroidism for a while.So,  On  October 3, 2014.... I went for additional tests and here are the results from the laboratoryCODE TEST                    REFERENCE RANGE               OUTSIDE NORMALALT              53                           <36      U/L                                 53TSH          2.15                 0.35  -  5.00   mIU/LT4 Free        16                   12  -  22       pmol/LFree T3       4.4                   2.6 - 5.7       pmol/LFSH               6I am waiting to see my Family doctor and also got the Lab test results sent to my naturopath......I was just wondering why everything else seems normal and is this the beginning of Hashimotos ???  because my symptoms are mild...like fatigue, hair loss and I have recently gained 10 pounds.   I was also wondering why my Alt levels are higher.....maybee a fatty liver that I have recently got.  Any thoughts ?I noticed my ALT levels were outside the normal limits.....this could be the fatty liver I have developed after the 10 pound weight gain.",
            "post_id": "11313226",
            "timestamp": "1412896127",
            "votes": 0
        },
        {
            "answer": "I don't have much knowledge about the ALT test.  I did some quick looking and found this.\"Mild elevations are generally considered to be 2-3 times higher than the normal range. In some conditions, these enzymes can be severely elevated, in the 1000s range.\"So. based on that alone, I don't know if there is a real concern there or not.  Then there is info on possible causes for elevated ALT results.Cirrhosis (scarring of the liver)Death of liver tissue (liver necrosis)HepatitisHemochromatosisLack of blood flow to the liver (liver ischemia)Liver tumor or cancerMedications that are toxic to the liverMononucleosis (\"mono\")Pancreatitis (swollen and inflamed pancreas)So, you'll need to discuss that with your doctor.Regarding your thyroid  status, yes it is likely that you are in early stages of Hashimoto's Thyroiditis.  Your free T3 and Free T4 look okay so far, but of course that will change with time as the Hashi's antibodies attack your thyroid gland.  As I mentioned it is important to also test for Vitamin D, B12 and ferritin.  Each is important since deficiencies can cause symptoms that mimic hypothyroidism .  Also, adequate levels are necessary to metabolize thyroid hormone adequately.  Were you able to get those tested?",
            "post_id": "11313323",
            "timestamp": "1412897242",
            "votes": 0
        },
        {
            "answer": "I just noticed that you started another thread on this same info and questions.  We need to consolidate the two into one and avoid the usual problems from multiple threads from same member.",
            "post_id": "11313340",
            "timestamp": "1412897347",
            "votes": 0
        },
        {
            "answer": "Yes... I am new and didn't realize I started a bran new thread...oooooops.Thank you again for your response.  I appreciate it !I did have my Ferrtin checked and it was 37....and I am now taking Iron Sap capsules.   I have not yet checked my vitamin D.Although in the past my iron was only 12.  That was before my operation.Just wanted to mention that I had a myomectomy to remove fibroids January 31, 2014.I will be sure not to post the same post twice next time.......and thank you ! :)",
            "post_id": "11313407",
            "timestamp": "1412898105",
            "votes": 0
        },
        {
            "answer": "I'm going to copy/paste the comments from your other thread - nothing a whole lot different from what gimel has already said - so everything is in this thread, then I'll report that one as a duplicate.  Don't worry about double posting... happens all the time.Here are responses from the other thread:Barb135     1 hourTo: invu4uraQt2meYour TgAb and TPOab indicate that you have Hashimoto's Thyroiditis.Are you on thyroid medication?  If so, which one, what dosage and for how long have you been on it?Your other thyroid tests don't look bad at all and I'm sure you will have a hard time finding a doctor who will treat them, if you aren't already being treated.Do you have symptoms of either hyper or hypothyroidism?Were other tests ordered with the ALT or was that the only one out of range?  High ALT can be caused by several factors, including obesity, diabetes, liver disease, etc.  It's typically ordered with AST, which may or may not be out of range.  It has to be factored in with other tests performed.invu4uraQt2me      1 hourTo: Barb135Thank you for your reply........I am getting both hypo and hyper symptoms.....My older sister was diagnosed with Hahsimoto and my mom is Hypo and my identical twin was Hyper.....and on meds but not no more.I am not on medication and my doctor said she could either make me a specialist appointment or not ?   I am not sure ?   I will ask her for that specialist appointment in the middle of October when I see her.I think we checked my Alt levels again because they were really high last time....although they did go lower......I think the weight gain has caused this elevation.  I gained 10 pounds.  I also had a myometomy on January 31, 2014 to remove fibroids.   I am now 155 pounds and 5 foot 4inches tall.Barb135      22 minutesTo: invu4uraQt2meSome symptoms can apply to either/both hyper and hypo; can you please be specific as to which symptoms you have, so we can sort them out and determine where you actually stand.  I see that one of them would have been weight gain (the 10 pounds - which would be a hypo symptom).I did notice that you have another thread going, so I'll have to go read that, as well and try to get all your information and the comments into one, so everything is together.",
            "post_id": "11314052",
            "timestamp": "1412904935",
            "votes": 0
        },
        {
            "answer": "Okay, all of that done, I have to wonder why FSH was done, but not LH, Prolactin or any of the other reproductive hormones or were they and you didn't post them because they might not have been out of range?  Also, there should be a phase of the menstrual cycle during which the blood was drawn.  We'd  have to know what that was and have a range in order for that to have a meaning.  The myomectomy could have bearing on all of this, as well.You said you had ferritin tested and it was 37 - that's too low; it should be in the 50-70 range.  You had an iron level of 12? Typical range is 60-70 mcg/dL, however, ranges and units vary lab to lab, so that information must come from your own lab report.So, if you can be specific about your symptoms and some of the other points that both gimel and I have brought up, that would help us piece thnigs together.",
            "post_id": "11314282",
            "timestamp": "1412907341",
            "votes": 0
        },
        {
            "answer": "oh...okTEST DESCRIPTION            REFERENCE RANGEProlactin       7                               < 24 ug /LCG               1                                   IU / Lnot sure about the LH ?   I will try to find out.......I am always hungry and putting on weight.  i also notice that when I wake up in the morning I am so hungry in the morning ?   This is really weird to wake up feeling like your starving...???My Naturopath did the thyroglobulin and Peroxide test cause my family doctor said I didn't need to.Then after I insisted........my Family doctor finally did my T4 free and my free T3.My family doctor has not set up a specialist appointment.   Should I see one ?Sometimes I don't feel that my doctor tells me important information and facts about my health...and how to improve my symptoms.   She didn't seem to tell me my iron was low.  My naturopath actually told me.   I feel the Naturopath tells me more and cares more too",
            "post_id": "11314742",
            "timestamp": "1412912711",
            "votes": 0
        },
        {
            "answer": "I had elevated ALT and AST (both liver enzymes) for years due to untreated Hashimoto's thyroiditis. It seems the liver is very sensitive to the mildest changes in thyroid hormone levels.Thyroid hormones regulate dopamine synthesis by controlling the concentration of its precursor DOPA so hypothyroidism results in low dopamine.  I always assumed hypothyroidism increased prolactin due to low dopamine levels alone (prolactin is normally suppressed by dopamine) but found this info as well...\"Patients with hypothyroidism may present with galactorrhea due to the increased secretion of thyrotropin releasing hormone which stimulates the lactotroph to secrete prolactin. Hypothyroidism may also decrease the renal clearance of prolactin, resulting in hyperprolactinemia.\" - Galactorrhea: Assessment and Treatment Options - US Pharamacist",
            "post_id": "11315771",
            "timestamp": "1412934016",
            "votes": 0
        },
        {
            "answer": "Sometimes doctors have a tendency to be vague.I'm not sure what CG stands for; could you please clarify that?I'm not sure your iron really IS low... Your iron was 12 before your operation?  Would that be the myomectomy in January?  Did you have it tested again after that?  If so, had it come up any?  When did you have the ferritin tested?  Did you have a complete iron panel prior to starting the iron supplement?Right now, you don't necessarily need to see a specialist, because your thyroid levels aren't bad, but you can if you prefer. Since you have the antibodies that would be the basis for a diagnosis of Hashimoto's, so we know that eventually, as gimel pointed out, your thyroid production will begin declining.  At this point, it may be difficult to find a specialist willing to start you on replacement hormones. Your naturopath might be the best bet to get you on a trial dose to see if it helps.Is hunger and the weight issue the only symptom you're having? Other symptoms of hypothyroidism include fatigue, cold intolerance, constipation, slowed heart rate, hair loss, acid reflux (GERD), puffiness around the eyes, joint/muscle aches/pains, anxiety, heart palps.Common symptoms of being hyper include weight loss, diarrhea, hand tremor, rapid heart rate, heart palps, mood swings, irritability, anxiety, bulging eyes.  This is not a complete list of symptoms for either hypo or hyper and as you can see, there are some symptoms that apply to both.Have you been tested for diabetes?  Waking hunger is sometimes a symptom of fasting glucose impairment. General hunger could be due to not eating enough protein, since protein, typically, fills you up and keeps you feeling fuller, longer.  I find that taking an HCl with pepsin capsule with meals helps absorb protein better and I don't get so hungry; check with your doctor.",
            "post_id": "11315819",
            "timestamp": "1412935952",
            "votes": 0
        },
        {
            "answer": "Hi.I am not sure what CG stands for either.....but I think she wanted to check if I was pregnant because my periods are irregular and I missed a month.  And underneath the test it indicates non-pregnant  pre-menopausal: <5.It may stand for chorionic gonadotropin.   I am not pregnant.I keep all lab tests for the last three years or so for physicals and noticed Ferritin was 12 on March 2013.   My Naturopath asked me to ask my Doctor why she hasn't mentioned it to me.I did No panel prior to starting my iron supplement called Iron SAP iron Glycinate capsules,  I bought form my Naturopath because she recommended them.My myomectomy to remove a 10cm Fibroid was in January 2014.My iron is now 37. from lab of September 24, 2014.Is Ferratin the same thing as iron ?   I am confused again ?Also my Glucose-fasting test was done June 10, 2014 and was 5.6.Ranges says it should be      3.5 - 6.0I have had all symptoms of Hypo and Hyper, including some depression.One more thing about the ALT.  it was 63 for my June 2014  and Oct 2014, it was 53.Thanks again for the replies.........",
            "post_id": "11331783",
            "timestamp": "1413176324",
            "votes": 0
        },
        {
            "answer": "Yes, you're probably right about the CG - probably supposed to be hCG, which is present in the placenta when one is pregnant.Good that you keep your labs for 3 yrs, but you should actually keep them longer than that - I have all of mine going back to about 2000 and I can see it's it's back, at least, that far and I know further yet, but previous doctors didn't give me the labs, that doctors started messing up on my treatmentsIf you didn't have an iron panel prior to starting the iron supplements, on basis did your naturopath recommend them?Even at 37, your ferritin level is too low.  It needs to be up in the 50-60 range.  Ferritin is an iron storage hormone, not the same thing as iron.  When ferritin is low, it's an indicator that iron is low.  When ferritin levels are low, an iron panel, which includes iron, Total Iron Binding Capacity (TIBC) and transferrin should be done.  Some iron panels will include unsaturated iron binding capacity (UIBC) or transferrin saturation, if other conditions are suspected.The fasting glucose test appears to be an hB A1c test, which measures blood glucose over a period of about 3 months... your level is non-diabetic, but most labs consider 5.6-5.7 to be borderline for type II diabetes.As I noted, many symptoms can apply to both hyper and hypo, it's not enough to say you've had symptoms of hyper and hypo.  Depression is one of those can apply to either.  As has been noted, your current thyroid levels don't look bad at all, but you could be seeing some of the beginning effects of Hashimoto's destruction of your thyroid.  Its' not unusual for symptoms to be present for some time before labs (FT3, FT4 and TSH) actually indicate an issue.  Talk to your doctor or naturopath and see if either would be willing to start you on a trial dose of thyroid replacement hormones to see if that will alleviate any of your symptoms. I'd guess your naturopath might be more most likely to be willing to do this.As gimel noted in his first post, your ALT is slightly elevated and is probably nothing to worry about.  Mild elevation is considered to be 2-3 times the normal level (yours is < twice the normal level) and can be caused by a number of things, including fatty liver caused by obesity, diabetes (if you're borderline that could be a factor), heavy alcohol use, some medications, etc.  In severe liver conditions ALT is elevated into the 1000's... Of course, because yours is elevated, you'll want to keep an eye on it make sure it doesn't continue to rise, though yours has actually decreased.  ALT is usually ordered with AST to determine liver function. Be sure to discuss all of this with your doctor.",
            "post_id": "11332708",
            "timestamp": "1413198762",
            "votes": 0
        },
        {
            "answer": "Thanks for your reply",
            "post_id": "11339624",
            "timestamp": "1413295603",
            "votes": 0
        },
        {
            "answer": "Hi.Thank you for all your help.   : )What specific questions should I ask my doctor regarding my Hashimoto ?Should I ask to see an ENDO and start medication ?I will have to start eating better and do more exercise.!!I know my dad is diabetic and really need to cut back on my sweet tooth.Can diabetes be reversed if one were to lose weight,  exercise and watch what they eat ?What do you recommend to eat ?Thanks ! xoxo",
            "post_id": "11340499",
            "timestamp": "1413304362",
            "votes": 0
        },
        {
            "answer": "No problem. :) My liver enzymes went back to normal starting thyroxine. You are in the early stages so I wouldn't of expected prolactin to be elevated with such mild changes.  It sounds like you are having bouts of hashitoxicosis (leakage of thyroid hormone causing hyperthyroid symptoms) as well which is more common in the early stages of Hashimoto's thyroiditis.Dr Mark Hyman has an article: New Research Finds Diabetes Can Be Reversed. Here is an except...\"Reversing Diabetes: Can it Be Done in a Week?The study, entitled Reversal of type 2 diabetes: normalization of beta cell function in association with decrease pancreas and liver triglycerides, was exquisitely done. The bottom line: A dramatic diet change (protein shake, low glycemic load, plant-based low-calorie diet but no exercise) in diabetics reversed most features of diabetes within one week and all features by eight weeks. That’s right, diabetes was reversed in one week. That’s more powerful than any drug known to modern science.We know from gastric bypass patients that with rapid changes in diet right after surgery, within just a few days, without significant weight loss, diabetes goes away—fatty livers heal, cholesterol levels plummet. Some theorized it was because of changes in the stomach hormones related to the gastric surgery. Others, including the researchers of this new study surmised that maybe it was just the drastic change in diet. So they went about studying just the diet change without surgery.They studied 11 people with diabetes and compared them to a control group. Through very sophisticated techniques including MRI imaging, they measured their blood sugar and insulin responses, cholesterol levels and fat in the pancreas and liver (some of the hallmarks of diabetes) before and after diet changes at 1, 4 and 8 weeks.What they found was revolutionary. The beta cells—the pancreas’ insulin producing cells—woke up, and the fat deposits in the pancreas and liver went away. Blood sugars normalized in just one week, triglycerides dropped in half in one week and reduced 10-fold in eight weeks. The body’s cells became more insulin sensitive and essentially, in just 8 weeks, all evidence of diabetes was gone and the diabetic patients looked just like the normal controls on all the testing.\"",
            "post_id": "11340586",
            "timestamp": "1413305059",
            "votes": 0
        },
        {
            "answer": "What specific questions should I ask my doctor regarding my Hashimoto ?Actually......most have been answered.......because of this great web site....so sorry about that question.....you don't need to answer that one.Thanks !  xoxo",
            "post_id": "11340746",
            "timestamp": "1413306463",
            "votes": 0
        },
        {
            "answer": "There isn't a lot to ask about Hashimoto's... they aren't going to do anything to treat that - they treat the resulting hypothyroidism with thyroid replacement hormones.Type I diabetes is an autoimmune disease and is not reversible.  Type II diabetes can be reversed if one watches what they eat, exercise and lose weight.   While it's very possible to change your diet radically and go on a crash diet that might reverse diabetes in a week, it's highly unlikely that most people would stick with it long term.  For most of us, diabetes would be back again in a couple months... trust me - my doctor had me on protein shakes, etc and it lasted about 3 weeks and I was done with it).You're much better off making changes that you can live with from now on, so once you lose the weight and reverse the diabetes, you can maintain it.  Basically, a healthy diet that centers around low glycemic foods will help with weight loss and it will help keep blood sugar levels from spiking, which will keep insulin levels from spiking, as well.  Low glycemic foods include most non starchy vegetables, whole grains, meat, dairy, etc.  Limit fruit to one serving per day, because of the sugar content; avoid fruit juices, since they are pretty much empty calories. Opt for whole fruit so you get the fiber that will help slow down the absorption of the sugar in the fruit.  Pair fruit with a protein, such as peanut butter or a whole grain, such as whole grain cracker to slow absorption.Exercise is not only good for helping to lose weight; it will also help get and keep blood pressure in control",
            "post_id": "11340749",
            "timestamp": "1413306480",
            "votes": 0
        },
        {
            "answer": "interesting...thanks for all the info and help.",
            "post_id": "11342424",
            "timestamp": "1413323126",
            "votes": 0
        },
        {
            "answer": "Thank you ......you have been very helpful with your responses.Happy to have been able to get these informative posts.xoxo",
            "post_id": "11342451",
            "timestamp": "1413323392",
            "votes": 0
        }
    ],
    "post_id": "11251416",
    "question": "Thyroglobulin AB is 634 and thyroid peroxidase AB is 406.  Can someone please help ?  I don't know what to think and I am so confused.  I haven't checked my T3 or T4 yet.  What could this mean ?",
    "timestamp": "1412131185",
    "title": "Thyroglobulin and thyroid Peroxidase"
}