{
    "answers": [
        {
            "answer": "My viral load is 2.4 million... Iam on the research clinical trial after my biospy.. I just found out about 2 mths ago.. They told me today my is due to my body isnt producing insulin, are pancreas produces natural insulin or makes it, got confused,, but they think i got hepatitis C from being diabetic 2 and not knowing for many years..something todo with it didnt release it for my body... Come to find out my Uncle had this for many many years and he is doing great and lives well... Iam definately gonna treat..no doubt about me.. Also I trust in GOD!! He is the best physician of any man kind... Iam 41 i know ur feeling... Iam very scared but Iam feeling better everyday.. Sorry but iam not but so much help Iam new here also...",
            "post_id": "1642382",
            "timestamp": "1186111016",
            "votes": 0
        },
        {
            "answer": "If I haven't heard this a million times, no, fatigue isn't caused by the hepatitis C! all these hepatitis C patients keep on complaining about fatigue cause we all get together and have formed a conspiracy amongst ourselves to report fatigue to our doctors...sheeesh!I think some of this is because there are a lot of people with hep c who don't have any  symptoms, and some docs are just small minded enough to think, well, if there are patients saying they don't have fatigue, then maybe the rest of them are complaining of idiopathic fatigue, whatever...some type of extrapolation.....or, they can't do much about fatigue and fatigue is such a general complaint (I think it's the most frequent complaint from patients in general), that they'd rather address something that they can make a concrete analysis of, etc etc...There aren't that many barometers of fatigue, in terms of tests they can do, so they have to take *your* word for it....and what do patients know? lol....But the thing is, fatigue with hepatitis makes perfect sense, it's an underlying, ongoing infection, an infection that the immune system is trying to fight off, hence the fatigue...anybody who has ever experienced a kick-a$$ flu has experienced horrible fatigue, because of the same reason, immune system trying to take care of an infection....Luckily, I have a doc who validates this, but there are many docs that don't...and sorry, but I think this is so passive-aggressive, to be invalidated like that, and have someone make you question yourself and why you're feeling so lousy....sorry for the rant, but I've just seen this so many times from hep c patients, and many wonder and think it might be all these other things (and, of course, perhaps in some patients it is related to some other etiology).I  just think that if a doctor does his/her homework, and sees this a vast amount of patients with hep c are complaining of this....some patients being completely incapacitated by fatigue, well, duuuuuh, maybe there is something to it? Anyway, I just addressed the fatigue issue anyway, lol...hopefully others will come by to give you their take, best of luck with this...",
            "post_id": "1642443",
            "timestamp": "1186112610",
            "votes": 0
        },
        {
            "answer": "Hi- I'm not an expert but I am a fellow Hepper who's read a lot on this board.The most common scale of liver damage that I know of is Stage 1-4, Grade 1-4. Grade 0, Stage 0 being the least damage, Stage 4 being the most. Grade is the amount of inflammation and also 0- mildest and 4- worst. My understanding is that people with damage of Stage 2 or less are usually considered good candidates for the \"watch and wait\" aproach. Those with Stage 3 and beyond, though, are usually encouraged to treat unless they have an issue that makes treating dangerous (severe depression or auto-immune hepatitis for example). I have heard of people at Stage 0 treating because they simply don't want to live with the Hep C virus lurking in their body. It's a personal decision as well as a medical one.Hep C is usually fairly slowmoving, but it can accelerate like you said- that's more common after age 50 I thought- I could be wrong. It's not always predictable. I'm 38, about your age I think, and I've decideded that if I'm beyond mid Stage 2 I'm gonna treat. I feel I have too many years ahead of me that I'll be needing my liver to let it progress any more. I've treated once 12 years ago and didn't clear.One reason not to jump into treatment (tx), besides the promising new drugs on the horizon, is that tx is really hard on your body and mind. One big consideration is if you can emotionally/financially/physically handle tx right now. Obviously if liver damage is severe there's not much choice- but if it's mild or moderate, there's more to think about in terms of waiting a year or so. Some people have lasting side effects from tx- only 40% of genotype 1's clear. On the other hand, I'd play MegaBucks with those odds- lol- and also tx can reverse some of the damage to the liver even if it doesn't kill the Hep C completely.Well, that's pretty much all I've got to contribute that might help. I wish you the best of luck with whatever you decide to do.-Dee",
            "post_id": "1642454",
            "timestamp": "1186112862",
            "votes": 0
        },
        {
            "answer": "Oh ya- I have chronic fatigue too! Really bad much of the time. I'm sure it's all in my head and not at all related to Hep C though- LOL. Some docs just won't admit what they're not sure of.",
            "post_id": "1642463",
            "timestamp": "1186113074",
            "votes": 0
        },
        {
            "answer": "LOL..we have to have some great humor..",
            "post_id": "1642467",
            "timestamp": "1186113177",
            "votes": 0
        },
        {
            "answer": "hey i agree with alot of that... Have u ever heard of the diabetic thing with hepC where body didnt produce insulin.. Iam happy to see they found out why iam being damaged... Helpme with words of wisdom..",
            "post_id": "1642457",
            "timestamp": "1186113545",
            "votes": 0
        },
        {
            "answer": "I think you already know more than your doctor does.  You deserve to be treated by someone who is up-to-date and knows what they're doing.",
            "post_id": "1642758",
            "timestamp": "1186119648",
            "votes": 0
        },
        {
            "answer": "hi, not that familiar with those issues, actually, not to nail her, but Pigeonca is pretty knowledgeable re diabetes, I'm not though, sorry...sounds like something you should really be talking about with a good hepatologist and endocrinologist though...",
            "post_id": "1642781",
            "timestamp": "1186121192",
            "votes": 0
        },
        {
            "answer": "I'm a little confused.  There are a number of us who have type 2 diabetes along with hcv, and the two may be related. But type 2 is not normally caused by an inability to produce insulin, but rather an inability to respond to the insulin that we still make.  Later, as diabetes progresses, which it will if do if untreated, the beta cells of the pancreas, which make the insulin, do start to burn out and insulin production is reduced.  In type 1 diabetes, OTOH, the cells die within a year or two of onset of the disease.  Those folks require insulin injections, as do type 2 diabetics who've had it for a long time (and this isn't true for all type 2's - some never need to give themselves shots).Which type of diabetes do you have?  If, as is most likely, you have type 2, there is most definitely a connection between it and hcv.  This may be caused by an autoimmune reaction, heredity, lifestyle, or all of the above.  Metabolic syndrome is involved here as well.  If you're overweight, you need to diet and exercise.  If you're of normal weight or below, you may also need medications.  Most type 2 diabetics start with metformin, which is an excellent drug. Some use insulin to prevent progression of your disease.   Check out the diabetes forum here at medhelp, and also alt.support.diabetes is a google group that offers support and advice.  And, as Forseegood has already stated, a good endocrinologist should be on your team as well.  BYW, the fatigue from hcv may also be coming from your diabetes - a double whammy in effect.",
            "post_id": "1642868",
            "timestamp": "1186123572",
            "votes": 0
        },
        {
            "answer": "They said type 2, something about not responding to insulin my body makes.. I was so confused and so much overwhelmed with everything they told me.. and burning out my insulin.. Iam so sorry this was so overwhelmed.... They said that was some of my cause to hep C.. I see these DR's u mention...Iamso glad u cleared this up for me.. Its very overwhelming like I said...Iam not fatigued at all.. very engergetic to be honest but iam overweight.. Pray that it all comes out.. They said something about treating Diabetes first.. Are u diabetes 2? Just pray for me ..",
            "post_id": "1675183",
            "timestamp": "1186139649",
            "votes": 0
        },
        {
            "answer": "Diabetes does not cause hcv.  Blood sugar abnormalities can be associated with hcv. The doc may have a good point in dealing with your blood sugar (diabetes) and weight issues before you start treatment.What are the 'stage and grade' results of your biopsy?.   It's not clear if you had a biopsy yet.  Are you making sure to get copies of every lab report before you leave the doctor's office?  That's very important.What 'research clinical trial' are you on?",
            "post_id": "1675352",
            "timestamp": "1186147854",
            "votes": 0
        },
        {
            "answer": "I'm about your age and I got HCV the same way back in '83. Long story short, here's a quick primer:1. Get a liver biopsy and find out how much damage you have. The amount of damage will dictate the urgency to treat. Most people have relatively minimal liver damage with a \"mere\" 20 years of exposure (there are exceptions though, especially in regards to alcoholics).2. The fatigue is probably being caused by HCV. I lived with it for almost 24 years, and have just completed my treatment a few months ago. I don't know if I'm cured yet, but I feel as if I'm waking up from a cold I've had for a 1/4 of a century. The fatigue is not in your mind, don't let some bonehead doc tell you otherwise. (headache is harder to pin on HCV)3. Even if you have significant fibrosis, don't just jump right into Interferon and ribavirin treatment. Educate yourself on \"custom tailored\" treatment strategies that you can use which will enhance your chances of success. Also look into the newer drugs coming out (called protease/polymerase inhibitors) which really boost the effectiveness of the existing drugs. I just completed a drug trial for Telaprevir/VX950 that may very well have cured me. Unfortunately it adds to the side effect profile, but usually it's worth the added risk. These drugs should start to become commercially available within a few years, or you can access them via a late phase trial.Concentrate on those basics for now and when you know your biopsy results then you'll have something to work with. Best of luck, believe it or not you've come into the HCV patient world at a pretty good time, all things considered.",
            "post_id": "1675514",
            "timestamp": "1186151823",
            "votes": 0
        },
        {
            "answer": "",
            "post_id": "1675693",
            "timestamp": "1186155191",
            "votes": 0
        },
        {
            "answer": "Bi:   I asked her about my fatigue (which I have had for years and attribute to my busy life)-----------------------Just to give more perspective.Like many here, I also had fatigue prior to treating for HCV. I am now SVR (cured) anbd one year post treatment. My fatigue level is identical to what it was before I treated. While a number of folks here have reported more energy after treating, the majority have not and I'll be glad to supply links to those threads if anyone is interested.My point is not to discourage from treatment, or to diminish anyone's anecdotal accounts of 'more energy' -- not is it to say that the fatigue wasn't/isn't Hepatitis C related. In fact, my current fatigue may still be HCV related even though I am SVR, but the point is that treatment didn't cure it. On the other hand, it's also quite possible that my fatigue -- like many others -- isn't related to HCV at all, since fatigue is a very common complaint among the general population. So my point is this -- there are many good reasons to treat hepatitis C -- and not everyone has the same reasons -- BUT if the primary reason you plan on treating is to reduce fatigue, you may be setting yourself up for a big disappointment, and again, I can show you anecdotally at least from many posters here.Mre, I am very happy your fatigue has lifted \"like waking up from a cold\" and hope it continues like that in the future. I'm sure it has with many, I just don't think a majority. Not at all to rain on your parade, but I should mention that many -- including myself -- had a burst of energy (lasting months) after stopping the treatment drugs. The acid test is will this energy last six months after stopping the treatment drugs or will one revert back to pre-treatment baseline by that point. I, like what I believe to be the majority, reverted back to pre-treatment baseline. Many others have actually reported more fatigue and other symptons after treating.Treat to stop (or even regress) the progression of Fibrosis, but don't expect any miracles beyond that, not that any more are necessary.-- Jim",
            "post_id": "1675716",
            "timestamp": "1186156394",
            "votes": 0
        },
        {
            "answer": "I agree with most of what you've said in regards to the fatigue, and I know your position on post tx fatigue returning to baseline levels even in the event of scoring an SVR. I also know it's quite common for people to initially feel tremendous for months after completing treatment, even for those who go on to relapse. But with all of that said, I'm not so sure the anecdotal \"majority\" you have observed online are reflective of the experience of the true majority (which includes a MUCH larger number of people offline). I discussed this very issue with one of my doctors a few years back and he assured me that many if not most of his successfully treated patients felt better long after completing treatment. He said it was very common for fatigue to permanently resolve along with many other tangential byproducts of a longstanding viral infection. He said the reason you won't see (or hear from) many of these people online is because they just got better and moved on with their lives. They have no qualms or pangs or problems - they're better, they're well. So since they're better and well, they have no reason to come online seeking help (the squeaky wheel gets the grease and all that). And since that's true (which I believe it is), if you're having problems with your hepC and go online, you're much more likely to come into contact with people just like yourself (i.e. folks who are not better and not well). It just wouldn't make sense that there would be support forums filled with people who have successfully treated HCV and felt much better. Why would anyone want to hang out in a place like this if they were well and out and about living their lives? Obviously most well/cured people move on. And anecdotally over the years I've seen this too. A person discovers they have HCV, they come online scared and looking for guidance, they treat, they SVR, they hang out online for awhile during the recovery phase, and then...poof, they basically disappear (with perhaps once in a blue moon re-visitations dropping brief \"there is hope, hang in there-ish\" messages). I'd even venture a guess you'll be \"poofing\" yourself, probably sooner rather than later.Secondly, when you say fatigue returns to baseline levels for many (even if SVR-ed) - I'm sure that really is true with some. I went to university with this guy years ago, and I spoke with him recently for the first time in years. By a twist of fate it turns out he has HCV too, and he had it even when we were in school (as I did as well). I used to have to ration my energy in those days very carefully by taking naps midday and carefully controlling my activity schedule so I'd have enough energy to pull \"all nighters\" etc prior to big exams etc. Me and him worked side by side during much of this, both of us unaware of our HCV+ status at the time. And yet he had no chronic fatigue problems like I did. In fact the guy was a psychotic bundle of energy, I never knew anyone with as much spring in his step as this guy had. He could go like a dynamo from sunrise to sunset every day, all day. He used to get irritated with me because I was frequently bowing out of extracurricular activities because I was just so pooped half the time (even in my 20's). I've come to understand that HCV most certainly does not cause chronic fatigue in everyone. Its effects vary from person to person (as I'm sure you know). But the reason I mention my friend, is because what if he treated successfully and returned to his same level of \"fatigue\" after stopping tx? My point being of course, is that he didn't experience any significant fatigue as a consequence of having HCV. So the fact that he returned to baseline values after successful treatment would not mean that someone who was strongly symptomatic (fatigue-wise) prior to treatment would necessarily experience the same. Furthermore, many people experience fatigue as a consequence of crappy health habits (especially Americans), which include: poor diet, obesity, smoking, drinking, drugs, lack of exercise and/or the normal effects of advancing age. These people's fatigue may very well not have been largely caused by HCV in the first place. So it wouldn't be surprising to find out that after successfully treating, they return to a baseline level of fatigue simply because they continued on with their same old bad health habits and/or because they continued to grow into old(er) age.In the final analysis, I've been trying to hold myself back from declaring how good I've been feeling lately because I know it may just be the post tx euphoria I've read about so many times. Plus for all I know I've already relapsed, I've only got a 6 week post tx UND under my belt so far. So I know I can't know what the future holds for me fatiguewise. I certainly hope the lead collar I've been wearing since 1983 is off for good, but all I can do is wait and see. One thing's for sure, if in the event I do truly feel better and my symptoms have been permanently resolved a year or more from now, I most certainly will come back to this forum (and others) to tell of the light at the other end of the tunnel. Also, in regards to yourself, you're only a year out. Considering your extended course of treatment, your increased dosage regimen (and the awful effects it had on you) and you being slightly on the mature side, it may be that the final chapter hasn't been written yet in regards to your fatigue (did you experience chronic fatigue prior to treatment, incidentally?). Considering how health conscious you are and your willingness to exercise, I wouldn't be surprised if you do start feeling distinctly better (within the limits associated with whatever age group you may be in at that time).",
            "post_id": "1675894",
            "timestamp": "1186160018",
            "votes": 0
        },
        {
            "answer": "Mre: (did you experience chronic fatigue prior to treatment, incidentally?---------------------------Perhaps I wasn't clear enough in my first post. Don't know if I'd categorize it clinically as  \"chronic fatigue\" but yes, I did have more fatigue prior to treatment than what I would have liked and what I would have thought normal. Exercise, good eating, etc, helped but not to the extent I would have wanted. And yes, while I didn't treat because of that (I treated because I was told I was near stage 4) , I had hoped that one of the perks of tx would be the disappearance of that fatigue. However, as stated, it hasn't so far. Pretty much identical to how it was before treatment. No better, no worse, in my case -- which puts me somewhere between those who say they feel better after treatment and those who say they feel worse.-- Jim",
            "post_id": "1675946",
            "timestamp": "1186161033",
            "votes": 0
        },
        {
            "answer": "Mre: (My doctor) said the reason you won't see (or hear from) many of these people online is because they just got better and moved on with their lives.-----------------------------This has been discussed before, and there is really no way to verify if: (a) the above is true; (b) if this group is representative of those post tx; (c) if there's even more of a post tx problem than this group presents. Fact is no data has been collected, no real studies done, so all we can do is speculate.I might also add that my hunch is that most tx doctors really don't know as much as they think they do about what their patients experience both during and after tx. Mine didn't and I admit to being part of the problem not wanting to complain too much -- either because I didn't want my meds reduced, or because I felt it wouldn't do any good anyway. And post treatment, many docs simply wish you a good life and therefore don't know what is happening anyway.Anyway, as long as the discussion is launched, here's the list of threads I've accumulated on sfx both during and post tx, It's not a complete list by any means. As to how representative it is -- just wish more research had been done, but once a drug gets FDA approval -- and zillions of dollars are being made -- not a lot of motivation for the drug companies to keep studying how the drugs affect us long term.Again, hope your new wave of energy increases, but in any event, you are SVR, and that in and of itself is a worthy goal of tx for many of us.All the best,-- JimParital List of Threads on Side Effects of Treatment -- During and Post.YMMVhttp://www.medhelp.org/forums/Hepatitis-Community/messages/965.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41434.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41439.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41446.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41492.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41498.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41506.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41513.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/41515.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/45385.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/45437.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/45337.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/46376.htmlhttp://www.medhelp.org/forums/Hepatitis/messages/46380.html###",
            "post_id": "1675926",
            "timestamp": "1186161332",
            "votes": 0
        },
        {
            "answer": "One has to wonder if the some of the fatigue (which I also had prior to treatment) might no be depression related..I saw I just got a clinical care options email mentioning depression and hvchttp://lists.clinicaloptions.com/t/5410/88916/1603/0/",
            "post_id": "1676169",
            "timestamp": "1186165749",
            "votes": 0
        },
        {
            "answer": "Yes, I have type 2 diabetes.  It started with prediabetes 3 or 4 years ago, before my hcv diagnosis.  Because diabetes can be just as destructive to your body as hep c, and because it's easier to deal with, I agree with your doctor that you ought to take it in hand first, unless your biopsy indicates a need to treat the hcv at once.  Because you are overweight, there is a strong chance that the diabetes might clear up on its own once you get down to normal weight.  In fact, I've read that a loss of as little as 5 to 10 percent of your present weight might do the trick.You don't necessarily need to be a Skinny Minnie to get results.  On the other hand, if you treat the hep c first, the meds might cause weight loss too - not the best way to get thin, but it does do that.  I lost 14 lbs on treatment, gained back 7 and have stabilized at this new weight, which was basically a 5% loss.  And I've noticed that I need less insulin than before, so that's good.  Incidentally, I'm using insulin despite having \"mild\" diabetes.  It's a cutting edge way of treating the disease, and it can help avoid progressive loss of the beta cells.  Kind of controversial, but it seems to be working, since my diabetes is not getting any worse.",
            "post_id": "1676276",
            "timestamp": "1186168392",
            "votes": 0
        }
    ],
    "post_id": "1642350",
    "question": "Saw hepatologist finally.  Labs good, physical exam good.  Geno 1a VL 2.5 iu/ml.  Contracted 1988 from a blood transfusion. Dr requested more labs (pt/ptt/hiv/hbv/hav...) to make sure I am ok to schedule for my first biopsy (YUCK).  I asked her about my fatigue (which I have had for years and attribute to my busy life) and I asked her about my headaches (which I have had for about a year now and have tried many drugs with no luck).  She said probably not HCV related? This is contrary to what I have read?  She also explained to me that treatment will be based on the damage already done.  Meaning if on a scale of 1-10 in 20 years I have only advanced to a 3 in damage she would recommend not treating because new drugs should be out within the next 10 years.  My question is what if my body decides to accelerate damage now since I am almost 40yo.  My thought is I should still treat to reduce the VL or I could participate in a clinical trail?  Advice from the experienced Heppers please to help me understand why I should decide not to treat.   THANX",
    "timestamp": "1186110770",
    "title": "To TREAT or not to TREAT"
}