{
    "answers": [
        {
            "answer": "Thanks for posting!Your boyfriend is luckier than he can ever imagine having a great person like you to care for him in his time of need... I know exactly what he's going through, as I am a recovering alcoholic W/ diabetes. I wish I had someone like you when I was going through my darkest hours. Luckily my parents came over one evening and I happened to be in a diabetic shock. Anyway I didn't die, and I found help at a great inpatient treatment center. It's called Valley Hope, and it's in O'neil, Nebraska. Check it out at www.valleyhope.com. That place saved my life, and helped restore my sanity. I wish you the best of luck, and if it's meant to be, it will all turn out in the end.Godspeed,Jess",
            "post_id": "259160",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "You probably don't want to hear this, but your boyfriend has to want to get help before he can truly deal with his addiction. You can do the research, get the phone numbers, recommend inpatient and outpatient rehabs, refer him to addiction specialists and endocrinologists--but the bottom line is that nothing will change unless he wants to recover.Keeping that in mind, you could probably open the phone book and look in the yellow pages. You'll probably find several outpatient rehabs or addiction recovery centers. If you call a few, you can also get a schedule of meetings for Alcoholics Anonymous. Also ask about seeing a medical doctor in rehab, because your boyfriend will definitely need an endocrinologist to get back on track with his insulin--not to mention, his condition will have an effect on the anti-depressants or anti-anxiety meds that are normally presecribed.Another option--have you tried mentioning his binges and chronic drinking to the ER doctors or paramedics? This might make your boyfriend mad, but perhaps hearing a doctor reprimand him and remind him of his fragile condition would help snap him out of it. Again, it probably wouldn't be the magical solution. But it might help in the long run--ie, to bombard him with resources and information.And the, unfortunately, you will have to let go and allow him to choose his fate. This will be the most difficult part. Fortunately, you don't have to do this alone. I would highly recommend that you seek out an Al-Anon meeting. These meetings can be really helpful. Al-Anon is all about the people who are effected by alcoholics--husbands, wives, kids, roommates, best friends, cousins, etc. And it's all about learning to let go--knowing when to help someone, and knowing when you have no control and have to let go.Good luck. My heart really goes out to you. I had a boyfriend who is an insulin-dependent diabetic--Type I, diagnosed at age 12. And he was an alcoholic. Still is, I think. I used to have to call the paramedics at 6am, when he was waking up from a hangover and having an insulin reaction. I would feed him grape jelly with my fingers--stuff it down his throat, while waiting for the paramedics. I tried to convince him to stop drinking. His answer was to drink stuff that had 'less sugar'--like beer, and then eat tons of carbs before passing out. Ha. Anyway, after five years we broke up. Not because of the drinking--however, it was a big part of my decision to leave him. He just didn't want to face the music, and I didn't want to watch him die. I had to take care of myself--it felt selfish at the time, but truthfully, I had no control over him and his decisions. So I can feel your pain and I truly hope he listens to you and decides to get help for himself.Love, Leigh",
            "post_id": "259163",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "hi, my name is michael and my father is a sober member of AAand has diabetes, one of the things the people in AA do when ever they trying to help some one like your boyfreind , is they go in pairs , if you called your local AA in your area- its in the phone book.  AA would send out 2 members to talk with himabout his options , like a detox or short term rehab, or mosy lilly they would ask him if he wouldlike to atend the local AA meeting in your area., they have them every day at noon, and every night at 8pm. they last for an hour and a half.my father got sober in this type of situation 36 years ago.you might even know some one in AA who could help.good luck, and keep at him.Also for yourself  there is alanon meetins for famly members, and freinds of alcohics. these meetins are very helpfull , whengoing through these tough times. also very informitive.keep posting and let me know how you make out.peace and my prayers are with you.-----michael",
            "post_id": "259166",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "Hi,I'd like to give you one other suggestion to compliment the others you've already been given. If you feel that he is medically unable to detox at home,you can do what iss called an intervention. This is when you get everyone he cares about,his family,friends, and sometimes even a boss,to confront him about his drinking. It is run by an experienced addiction professional who knows exactly the right things to say. You call any rehab center and ask. Or as Hippy suggested have an AA member do it, if they are willing to. The idea is to get him to agree to rehab by a show of force. I agree that an alchoholic has to want to quit drinking the thing is, sometimes we don't know that we want to. Alot of people have been forced into rehab and discovered while in there how truly messed up their lives have become. Sometimes it works and unfortunately sometimes it doesn't. This obviously isn't something that you can take lightly but if he is truly as bad as you think he is, I think an intervention is needed. His life may depend on it.",
            "post_id": "259168",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "Please respond on this, as much as I hate to break these \"threads\", I am new and need some help.  I onced had a Seizure from cold turkey stop on 4 mg of Xanax a day.  Do to recent stress at work I find my self running short again and will be short up to 2 1/2 weeks.  I have been doing a quote un quote tappering to try to avoid any serious side effects, however I only have 5 = .50 mg to last me until then.  Is there something similar that I can take that won't send me into a seizure, I can't bear to have my wife see me drop to the floor again in a Grand Mal seizure, I can't remember anything from that night, however I was lucky, I was already in the emergency room due to high temperature (angel on my shoulder.)  My next issue, I am randomly drug tested at work, so this is something I have to keep in mind for any other med's.I appreciate your help - 1st timer.",
            "post_id": "259170",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "welcome to the forum.  anyone who has a drug problem, chronic pain issues, and family/friends of someone with a drug or alcohol problem are welcome here.  how long have you consistently taken 4mg of xanax a day.  if you are taking more than what the doctor prescribes, you have a problem.  there arelonger acting benzo's that control anxiety with less of a tendancy for abuse.  if you have to take 1/2 mg a day for 2 weeks, you may or may not have a seizure.  if you do, end up at the er, you might want to check the hospital for chemical dependency.  most company UDS check for amphetamines, benzo's, opiates, propoxyphene, cocaine - and i think that is all.  some are more intensive, if you are using drugs illicitly without aprescription, you have a drug problem.  what are going to do?you can detox off these drugs with your doctor's help or a doctor who specializes in addiction.  you have to want to helpyourself.  i hope writing to the forum was a way of asking for help.  i am a dilaudid junky, and i am on methadone maintenance for the time being.  this is my 2nd time on methadone, so i know how hard the w/d is.  Good luck and Blessings,  Ava",
            "post_id": "259171",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "It would be easy to say that the both of you need some comprensive treatment as soon as possible. As you've said, the whole thing is a complicated(mess?)state of affairs. Love is a \"many splendered thing\", isn't it?  You are the enabler and he is your chosen victim.  Both of you enjoy this situation maybe 90% of the time...correct?Incidentally, I'm an alcoholic and opiate abuser that has diabetes and several other health problems. No doctor's warnings or even the thought of certain death ever deterred me from indulging this insanity.  Whoa!, some will make it and some won't and I firmly believe that we, the addicts, have to come to grips with our chosen way of life!  You can try ever so hard but you cannot convince your friend to change anything.  The point is that \"you\" must take care of yourself and let \"him\" do the same.Surely, you must already know that most hospitals offer treatment for what your friend suffers from?  Hopefully, he is intelligent enough to \"want it\".As for me...I've been gone a long time from this forum due to some unfortunate things I've done. I humbly submit that I've had a relapse but am now back on course again. The word \"sojourner\" is for some reason bouncing around inside my head!J.B.",
            "post_id": "259173",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "Listen, I had  tried to taper off xanax quite a few times, I didn't have a seizure everytime, but I had 3 that I'm aware of. One even occured,when I was off xanax for 24hrs, after tapering down to 1/2 of .25  for a few days.I already had a seizure while asleep. Woke up with a sore tongue from biting, and black&blue shins, from the kickingPeople can die of aspirating during a seizure. Don't do it. Call your doc, explain it to him,if he won't help(and I think he will no one wants a pt. to risk a seizure) go to the E.R. for now. Then find a doc you can trust, This is your life,don't risk it.",
            "post_id": "259191",
            "timestamp": "1023166800",
            "votes": 0
        },
        {
            "answer": "I have only taken Zanax occasionaly --was toldby my doctor they are very addictive, I would try to taper off, then every other nite, every 3rd etc....IF you have ANY problem call a Dr. or go to the ER. It would be a good idea to call a doctor Now-- and have him help you thru this. Many of them can be very understanding.Good luck, and congratulations!!",
            "post_id": "259199",
            "timestamp": "1023253200",
            "votes": 0
        },
        {
            "answer": "Hello, everyone!Well, actually this is more to you, Skip....I have to say that I am feeling better than I have at least in the last ten years now being off all forms of drugs (excluding aspirin now)...  This is the weirdest feeling I have ever experienced in my life.  I just celebrated seven months of sobriety from alcohol today!  The last time I had any Ultram in my system was over two weeks ago.  So I think I'm well on my way to a good recovery.  I am mainly an Alcoholics Anonymous type of guy, so those are the meetings I prefer, however, I do hit some of the NA meetings from time to time.  I have to say that complete sobriety takes a bit of getting used to, but-damn it, it sure beats the hell out of looking for pills or a bottle to help you get through the day.  Well, enough of the drug and alcohol **** for now.  It makes me feel a bit guilty talking about how well I'm doing, so I'll stop for now.Skip, about your father's condition and your family's \"dysfunctionality\"--- man, I know exactly what you're going through and it is hell to say the least.  My grandmother recently passed away, and my dad and his sisters had to go through the assets, and dividing the estate was one crazy endeavor.  As my morphine addicted Aunt is the executor of the will and estate, I'm sure you can see what the picture is in that situation.  Hundreds of thousands of dollars are involved, and in a dysfunctional setting, monetary issues tend to make everyone ten times crazier.  So that is what I'm seeing these days!Sorry I haven't been in touch lately, but I see you have been quite busy as well....  Anyway, there's a good chance they'll be able to get away for an hour and a half lunch or something today, so if I can, maybe we can hit somwhere good to eat....  If you have time, call me at work  593-2357.And to all of you out there in the forum: life does get better, boy, I can attest to that.... A year ago right now, I would've been hitting the streets with a .350 blood alcohol content getting into my sports car hoping that I wouldn't run any of you over as I drove around at speeds frequently exceeding 120 mph, and not caring if I lived or died.  (By the way, if you wondered why I'm talking about driving with such a high blood alcohol content, it is simply because my tolerance was so damned high that I actively participated in one of those police sponsored nights of drinking and driving events where you would consume one drink per seven to ten minutes, go out and drive around the parking lot taking the police's sponsored test, drink again, take the test again, etc. etc. etc.  To make a long story short, after three hours of drinking and driving my test scores changed so little that two of the cops asked if I was an alcoholic...  Ha ha ha ha, I told them \"yes\", and \"thank you for the free drinks, that's what I came!\"Please kids, if you're reading this I'm not trying to be funny about drinking and driving...  It's only by the grace of God that I didn't kill someone or myself because of my stupidity.My point is, life is so much more worth living now, that I do say thank you to God every day, and pray for all of you who are trying to make it to the side of sobriety.  I'm new here, but I like it.I love you all!P.S. Angst/Ava, I think someone else said it already, but I think that you might be that Angel that Skip always talks about.  You do such a great job welcoming all of the newcomers to this forum.  Nobody ever has to wait more than 8 to hours from posting anything without getting a response from you!  I wish you the best in your recovery, and don't worry, I know your methadone maintenance will be hard as hell to taper off of, but with your strength, and all love that we have for you, you will be successful whenever you choose to detox.",
            "post_id": "259193",
            "timestamp": "1023253200",
            "votes": 0
        },
        {
            "answer": "Hello everyone, (sorry to break into tread) I've been reading this forum for prolly 3-4 months. My favorite thing to do was to take a bunch of lortabs and read this forum sounds crazy. Been on the tabs for 2 years and sick of them controlling me. I am on the reciepe and have been clean for lets see 80 hours almost 4 days its been hell.. I took one pill 80 hours ago and before that I went 36 hours. Depression has been good (thanx to the receipe). But I feel like Elvis and cant stop shaking my legs feet toes GRR ! Can someone tell me when this will stop?Also I am worried about the xanax I've been taking to help calm down enough to sleep I have done about 40 - .25mg with in the past month is this going to create another problem for me I have 5 left.For everyone on this site thanx so much for your stories it has been an education for me and continues to be. I have never wrote anything on here before but felt so good about my 80 hours. Now I print out these threads and read them when I feel I need reminded of how addiction sux. Just some names that I have to say thanx to angst, hippy, witchywoman, tex3, lifeisbetter, gwh cant think of any other names.EVERYONE STAY STRONG my email is ***@****-=phear=-Addiction",
            "post_id": "259194",
            "timestamp": "1023253200",
            "votes": 0
        },
        {
            "answer": "I'm sorry to say this, but time will take care of this problem if your boyfriend remains intractable about getting some help. And not much time at that. I had a friend who was exactly as you describe, and in time he died. Sad but true.Francois",
            "post_id": "259269",
            "timestamp": "1023339600",
            "votes": 0
        },
        {
            "answer": "i've been on diazapines for 22 years of my 36 year-old-life.  thedoctors put me on them when i was 14 for insominia and generalized anxiety.  i have been on all of them except valium, which in rehab, i was given.  within 2 days, i was ready to jump off the roof of the building or hang myself.  i had plans to do it.  they called my ex to come get me.  the nursing board insisted i go to another rehab.  this one was not like the first which was club med in mississippi.  during my 2nd rehab, they tried to get me off the xanax by a slow phenobard detox.  they kept the seizures at bay, but i had an anterior infarct {heart attack}.  i may be on them for ever.  i do not abuse them.  i work, yes i finally got a job. i am able to function.  the worst thing about getting off the xanax is i would be homebound.  i would try any other benzo except valium.  with my asthma, ptsd, borderline d/o, and generalized anxiety due to the ptsd, i could not live without something.  they had me on 5 drugs to replace the xanax.  i could not afford them.  i went back to my internist who put me back on my meds and i surrendered my license to practice nursing.i do not have the answers.  just be careful. i would not wish this on anyone.   Good luck and Blessings, Ava",
            "post_id": "259331",
            "timestamp": "1023512400",
            "votes": 0
        },
        {
            "answer": "Please help me understand the situation.  My daughter recently reconciled with her husband.  He is a fine young man whom I have always been extremely fond of, but I learned today while they were separated he became addicted to dilaudid: \"hooked up\" by someone on his job. She is a healthcare professional, has seen him thru his first attempt for detox(his idea), and now he will not follow up with OP care b/c of money issues. I am so worried about her. He has chosen his own path, and she has made it clear if he does not stay sober, she will not live in this. I am worried about her health and safety. Can anyone tell me how to deal with this?  I am trying very hard not to be judgemental...I understand, intellectually, the nature of the illness.  How can I support her without trying to influence her decisions?",
            "post_id": "261613",
            "timestamp": "1029214800",
            "votes": 0
        },
        {
            "answer": "You are not alone, JB, in your journey, others are always willing to help you.",
            "post_id": "7569108",
            "timestamp": "1326063929",
            "votes": 0
        }
    ],
    "post_id": "225007",
    "question": "I have been dealing with my boyfriend who is an insulin dependentdiabetic, and alcoholic, and is very depressed about life in general.  I have tried to get him to go to a rehab for treatmentand he says he will go but never makes an appointment.  I have tried to get him to get help to control his diabetes but he never follows through with it...usually I end up saving his life when he has severe low blood sugar.  He will end up in the ER and stay for a few hours or days.  He comes home with intentions of getting on trac, but that only lasts for a few days and he is back going out with his friends (who are alcoholics from work) and will come home stumbling drunk or I will have to pick him upearly in the morning.  You may wonder why I put up with this, I don't have a simple answer.  It's just a very complicated emotional mess.  I am so stressed out from trying to make this change and he tells me he wants to change.  I think he needs drastic action taken.  I feel he would benefit from inpatient care for his multiple problems, i.e. Diabetes, alcoholism, and depression.  Please let me know if there is a comprehensive treatment facility for him...I just don't know where to turn forall of these problems.",
    "timestamp": "1023080400",
    "title": "Where do I find help for someone with type 1 Diabetes, and Alcoholism!!!"
}