{
    "answers": [
        {
            "answer": "JJs mom,It's so frightening when youngsters are hypo since they really can't yet feel it coming on and verbalize their needs.  I'm not a physician and am relieved that you've got calls in to your team.As a long-time diabetic, I'm thinking about this along the lines of what I would do if *I* were experiencing the types of hypos your little is.  I would certainly do as you have done -- cut out or provide minimal insulin.  The short term effects of potentially running high seem easier to handle than the lows.I'm sure that it takes our bodies several days or longer to recover from severe lows.  Our liver needs to rebuild its store of glycogen in order to help deal with a future low -- and that rebuilding takes a while.  For that reason, we often experience \"clusters\" of hypos because our built-in defenses against bottoming-out have been sapped by the previous hypo.  I hope I've explained it well enuf to be understood.I also want to tell you that hiccups are expected even tho' we may go weeks or months without anything serious happening.  It's one of the tough issues with DM -- things do happen.I'd liek to recommend taht you study up on hypos and one of the best resources I've found is the JDRF website (www.jdrf.org).  On the top left of the screen, select RESEARCH and then type hypoglycemia in the search box.  There were over 100 articles that discussion prevention techniques and research aimed at understanding them better, too.Will you check in again and let us know how things go?  I'm sure you'll get more responses, too.",
            "post_id": "2433752",
            "timestamp": "1095138000",
            "votes": 0
        },
        {
            "answer": "Hi JJ's Mom,I too am a mother of a child living with diabetes.  My son was diagnosed at the age of 3.  He is now 9-1/2 years old.before I give my input, I need to clarify that i am not a medical professional, so this is NOT inplace of medical advice.  I am giving my input based on my knowledge and personal experience.Also, I apologize for the delay in my response to your post.I am sorry that you are having a difficult time right now.  Being a mother of a child who has diabetes can be scary and cause anxiety..I know.  At times, I sleep with my son because I worry he will go low during the night.You may have already heard of the Honeymoon Period, but I thought I would add this.  This could possibly be what your son is going through / experiencing.Honeymoon PeriodThe period of time shortly after the diagnosis of Type 1 diabetes during which there is some restoration of insulin production and the blood sugar levels improve to normal, or near-normal, levels. Unfortunately, like other honeymoons, this diabetes honeymoon doesn't last forever; it may last for weeks, months, or occasionally, years.You may have already done these things, but I am trying to put myself in your shoes and tell you what I would do since we both have son's who have diabetes.If I was going through this with my son, I would:a) Make an appointment with his Endocrinologist (I would bring a copy of my son's insulin schedule with me just to have it handy)b)bring his logbook so his doc can see certain times of the day / night that he has lows, so he can see if there is a certain pattern and then make adjustments to the insulin accordingly.You have probably done these things already.  If you schedule another appointment, possibly request the person on the diabetes team whom you are most comfortable with.Low blood sugars are scary.  I would say that since your son has had so many episodes including one where he lost consciousness, the dose is to high for him right now, but, that is for you to discuss with his Endocrinologist.Remember, you are his Mother and you need to go with your gut feeling.I keep a couple of those little gel frosting tubes on my son's night table.  If I ever test him while he is asleep and is low, I can squirt some frosting into the side of his mouth and grab a small juice box (the 15 gram one:) and gently wake him and although he is half asleep, as long as I put the straw up to his mouth and say, honey, you are low, drink a little, he will.  The gel frostings come in handy!Although it has been 18 months since JJ was diagnosed, I have a sneaking suspiscion that he might be experiencing the honeymoom phase.Sorry that I cannot provide answers to all of your questions.This link (below) might be helpful:http://www.peacehealth.org/kbase/topic/major/uq2734/course.htmMy heart goes out to you.  Please talk to your son's endo about possibly lowering J's does a little more if he continues to have these terrible lows.Keep us informed and check back as others will post comments for you.",
            "post_id": "2429684",
            "timestamp": "1095224400",
            "votes": 0
        },
        {
            "answer": "From J J's mom.Hi,Thankyou so much for the comments from the team. I am really touched by the thought you have given to my question, and the heart behind your comments. Thankyou!JJ's Endocronologist was in touch a few hours ago, and was ready to admit him to hosp. for observation, but I thought he was \"turning the corner\" so to speak, although I'm not so sure about that now. He is on a new sliding scale of insulin, and is only needing about a fifth or less today of his usual dosage, and has had only one hypo today(20 mins after his Endo rang!).I have been keeping a detailed log. Because I am a solo parent with five children,I am trying to avoid hospital admission unless it is really vital.Re: Honeymoon period; I thought that normally occurred almost immediatly after diagnosis, and JJ has been diagnosed for 18 months now. Could this still be it though?Thanks for the comments regarding post hypo clustering, and the body's need to rebuild resources. This makes sense. It was his most severe hypo yet, so I guess it has knocked him a bit.One suggestion by a member of the local Diabetic team was that he may be suffering from an accumulative effect of too much long-acting insulin.Anyone else experienced this?I do have my son sleep next to me so that I can be aware of his condition at any time, and I, too, find that he sips and sucks quite readily,the sweet drinks or glucose when he needs it during the night.I can so relate to that whispering in the ear to tell him that he is low, and watching him respond in his sleep.Diabetes might be a \"game\" we didn't want to play, but it sure draws us close to these precious little children.Many thanks for your feedback. I appreciate it all.J J's mom",
            "post_id": "2433754",
            "timestamp": "1095224400",
            "votes": 0
        },
        {
            "answer": "Hello again, JJ's Mom,I am the mom who has a 9-1/2 year old who was diagnosed at the age of 3.I used to fill a little spill proof cup with gatorade and put it in the bed with him.  He had one of those car beds and there was a little space between the mattress and the plastic car frame and I would kind of wedge it in there and he knew it was there for him if he felt low during the night.  Of course I checked on him every time I woke up during the night.Well, one night I peeked in on him and you know how little kids hug a stuffed animal in their sleep?  My son has holding his cup.  I almost cried.  That was his security blanket...his cup.As far as the Honeymoon Period, what I posted before. (below) is some of the info. I found while searching.  You might hear different things as far as how long it could last depending on where you look or who you talk to.  It has been 6 1/2 years since my boy was diagnosed, but it feels like he has always been living with diabetes.(Posted in my previous post)Found While Searching:Honeymoon PeriodThe period of time shortly after the diagnosis of Type 1 diabetes during which there is some restoration of insulin production and the blood sugar levels improve to normal, or near-normal, levels. Unfortunately, like other honeymoons, this diabetes honeymoon doesn't last forever; it may last for weeks, months, or occasionally, years_______________________________________________________Wow!  Five kids and a single parent.  Pat yourself on the back.I have a little tip that I have given to other moms who have children who were recently diagnosed.  (I know for JJ it has been 18 months)  If your son has problems recognizing when he is low... (I am not referring to when asleep at night, because I have tested my son in his sleep and he has been low and it did not awake him, I did) here is a suggestion:  When he is low during the day when you test, but he was unaware, say, honey, you are low right now, so whatever you are feeling that is low blood sugar and do this everytime.  (of course while you are giving him a juicebox, etc.:)  I did this with my son at the age of 3 figuring it was new to him and he might not recognize a low.Please keep in touch.  Ihave tips for when he starts kindergarten.  (not that you even want to think about that now!)My son had 2 lows today at school and the Health Aide (there is not a Nurse at school - only a district Nurse who pops by from time to time) is good about treating the low and then calling me.  Last year, we had times that she did not call me, so I had a long talk with the District Nurse and things have shaped up this year!!!My son's Endo once said that \"trying to control diabetes is like trying to control a natural disaster!\"Please keep us informed about JJ.  We are all here for you.  Believe me, there are times that I still cry and it has been 6-1/2 years.Hugs to you and your children.I can tell you that I believe our children living with diabetes are very special.  My son is extremely compassionate and concerned about others.  Imagine a fourth grader coming up to his sister who is a kindergartener and giving her a hug and a kiss on the cheek and saying have a nice rest of the day....that's my boy!",
            "post_id": "2433755",
            "timestamp": "1095224400",
            "votes": 0
        },
        {
            "answer": "Hello again,Thankyou for you helpful comments and hints. It seems as if this is the \"honeymoon\" period. I though that would be a good thing, but the increased sensitivity to insulin and change in requirements has made life even more of a challenge. It is like having a newly diagnosed diabetic child all over again, and having to relearn what his needs are. I wonder if this honeymoon period is happening now(after 18 months) because it is only very recently that we have gained significant control, and so it is only recently that his pancreas might have had a chance to recover a little. I actually find it a little frustrating. We were just making such good progress, and it's like having to start over.We are adjusting though, and I know we'll get the hang of things again.I could relate to the comment likening Diabetes control to controlling a natural disaster!! I'm not so worried now while JJ is young, but I'm already praying for a \"super wife\" for him when he is older!I think, ideally, people with Diabetes should always have a knowing/caring buddy around them at all times.I think the advice you gave re: helping children to be \"hypo aware\" is excellent and important.I have tried to do likewise, and again we were getting good at it, but he seems to have lost that \"awareness\" again.You sound like you have lovely kids, and their developing compassion is a great characteristic to have.Thanks again for your replies.J J's mom",
            "post_id": "2433756",
            "timestamp": "1095310800",
            "votes": 0
        },
        {
            "answer": "Dear JJ's mom,I am so sorry that you and your son are going through such a difficult period. This disease can be so confusing with the balancing act that we need to go through. My son was diagnosed with type 1 at 8 and is now 27. You have recieved great advice from SS and LRS, but I wanted to address your fear for his future.I have also had the same concerns, but would like to reassure you that in the 15 years as a volunteer with the Juvenile Diabetes Research Foundation, I have met many \"super girlfriends and wives\" and \"super boyfriends and husbands\" along with great friends that call me if they have not heard from him. They have my phone numbers and I have theirs. Many, many people with diabetes find their significant others and have long and successful marriages. While my son is not married yet, he has had terrific girlfriends that understood his diabetes and realized that this is a part of his life. I will never forget a question that was asked in this forum by the fiance of a young man with diabetes. She was a bit afraid, but after reading many comments and learning more about type 1, she came back and commented that while she has always embraced him, she has also learned to embrace his diabetes. This simple statement will stay with me forever.I would also like you to understand that research is moving at a fast pace. I never give a timeline, but I am very hopeful that we are closer than ever with the breakthroughs that I have seen. This is only my personal opinion and I am not a physician or researcher, but I never give up hope that a cure is sooner than later.JJ's mom, please let us know how you are doing. There is also additional help through the jdrf website that SS suggested for research (www.jdrf.org). You can also click on the Online Diabetes Support Team located on the left side to recieve one on one support from a member of our JDRF team. I look forward to hearing from you again and hope all goes well with your dear son.dm",
            "post_id": "2433760",
            "timestamp": "1095310800",
            "votes": 0
        },
        {
            "answer": "Hello again,I am going to write a brief posting here (I have to test myson before I go to bed to make sure everything is a-okay:)in response to your comment: \"people with Diabetes should always have a knowing/caring buddy around them at all times.\"What you wrote (above) is very true and important in my opinion.  At school he has a buddy system.  A buddy walks with him to the restroom, as well as to the Health office to be tested.  Each year I have given a little talk and story to his classmates so they know they cannot catch diabetes and also understand why my son needs a buddy with him.I relate to you mentioning that it feels like he has been diagnosed all over again.  My son just started on the insulin pump almost a month ago and at first I felt like that.  All of the emotions from when he was diagnosed came up.  I thought why are we doing this?  But now the pump has turned out to be something that works very well for my boy.I can also relate to \"hypoglycemia unawareness.\"  My son, for a long time, has said I feel low and was low,...now sometimes he knows and other times, he says I feel weird, but he is unsure if he is low and then he tests and he is, so now I know the \"I feel weird thing\" is most likely a low:)Well, to end my posting, I want you to know that in my city the JDRF \"Walk to Cure Diabetes\" is in October and I am going all out!  I have already created graphics for our team t-shirts.  This is the first year we will be having team t-shirts and I have family members and friends collecting donations.  Just keep thinking that there WILL be a CURE in our sons' lifetime!Well, I better go test my little sleeping boy:)(Another helpful site: www.childrenwithdiabetes.com)PS- my son already picked out a wife....LOLhe met her 4 yrs. ago at his camp for children with diabetes that he goes to every July.  They both hit it off and still are inseparable every year at camp! You never know.  At least she would understand!",
            "post_id": "2433764",
            "timestamp": "1095397200",
            "votes": 0
        },
        {
            "answer": "Thanks again to all you wonderful people who are being such a great support! It's like having someone right there with you who has been there and understands.The fact that we are on near opposite sides of the globe doesn't seem to matter.Thanks too for the helpful links.JJ's insulin requirements seem to be very gradually creeping up again, so we are going cautiously and keeping him a little on the high side until he is more settled.(Endo's suggestion)He is now having occasional higher readings again, but is still prone to hypos without being aware.He is looking a little skinnier than usual, but definately better in himself.I was wondering, regarding the pump (SS's son) how much better the control is now,and whether hypos are an increased concern?? I have heard such good things about them, but they are still not widely available in most parts of New Zealand unless one has heaps of dollars! If it is going to minimise future complications then it has to be worth any sacrifice to use this kind of therapy, I guess.Congratulations on your efforts for Diabetes \"Walk to cure Diabetes\", and thankyou so much for your efforts. I was interested to know what sort of cure there might be available apart from an artificial pancreas type device, since the islet cells have been destroyed or damaged with type 1 Diabetes?It made me smile to see your son(SS)has picked himself a good wife already! Good on him! These medical camps can be great, but I've often wondered if it could sort of backfire longterm, in that people with similar genes for a condition are likely to team up and produce offspring with even greater susceptibility to the disease in question.Perhaps we should mix up several compatible conditions within the same camp?? :)(Intended as a light hearted comment, but it makes you think :) ).Thanks again dm, SS, and LRS for your helpful feedback and support.J J's mom",
            "post_id": "2433765",
            "timestamp": "1095397200",
            "votes": 0
        },
        {
            "answer": "CORRECTION TO COMMENT # C9 ABOVE - paragraph #15:READS:It has been just about 6-1/2 yrs. since my son was diagnosed. He was diagnosed on April 13, 1998 one day after Easter that year. The car for my boy has become second nature.CORRECTION:The last sentence should read:The CARE for my boy has become second nature.Med Help International",
            "post_id": "2433769",
            "timestamp": "1095483600",
            "votes": 0
        },
        {
            "answer": "Dear JJ's mom,SS has given you wonderful information and if you would like to talk to her on a one on one basis she would like to do so. Obviously, we want you to keep responding in this forum, but if it is helpful to speak with SS personally, please type in www.jdrf.org and click on Life with Diabetes and then the Online Diabetes Support Team. Mention dm in your request and I will  try to arrange an exchange.I wish you the best.dm",
            "post_id": "2433770",
            "timestamp": "1095483600",
            "votes": 0
        },
        {
            "answer": "Thanks dm,I'm reading you. Will do as you suggest.J J's mom",
            "post_id": "2433773",
            "timestamp": "1095483600",
            "votes": 0
        },
        {
            "answer": "Hello again,I am going to post about your camp comment first beause it made me think and it made me smile:The camp my son goes to is held every July (the last week of July for four days).  It is a day camp and the ages are 5-12, so my boy went when he was 5 and has gone for 5 years now!They divide the age groups up into units and every unit has volunteers/camp counselors (some are teenagers who used to go to the camp) and there are nurses, as well.  My son looks forward to this every summer.  He would cry if he missed it, so I will never let that happen!  The funny thing is, is that this little girl he met the first year he went...well, it was her first time there, too.  Well, they hit it off right away and I kept thinking that maybe one year one would not like the other, but so far, every year they buddy up:)  They see each other on birthdays, too and they really do not live that far from us. (when they were 5, they said they were getting married when they were twelve!!!)  Yeah right! Who knows what the future will hold.  They are only 9-1/2 now!  You know what I believe?  I believe that there WILL be a CURE by the time they are grown up.Okay, now the pump.  Well, my son has only been on it 4 weeks.  We were lucky that the insurance covered it 100%.  When the representative from the pump manufacturer called me on my cell to tell me that the pump was approved, I was in McDonald's with the kids and I practically screamed and jumped up and down! I yelled out to my son, What color do you want? LOLYou are going to get a lot of feedback from others who are on the pump or who have loved ones on the pump...keep in mind that for us it has only been 4 weeks, so I am a novice, but we have caught on very quick and it has been eaiser to learn than what I anticipated.The pros:- more flexibility as far as meal times...if he doesn't want a snack, he doesn't have to have one (unless he is low)- he can eat more carbs at one time than he used to be able to (I still would not give him regular soda unless he was low)- he is more self sufficient (the only time I do anything in regards to the pump is if he was high during the night and I had to give him a correction bolus AND when I change the infusion set)- he used to get 3+ shots a day and now it is like getting one shot every 3 daysNow, I would not say his blood sugars are always great....and when I think of a good blood sugar, I am thinking 180 and below...however, he has not had any episodes where he has had keytones thus far.  We are still \"feeling the whole thing out.\"The first week was not fun...I slept w/him every night and set my alarm for every 2 two hours to test him to help determine if the basil rate was okay.  (Dad slept!) I felt like he was diagnosed all over again.  I wondered, why are we doing this?  I cried a lot.  Well, a representative for the pump we have said to me, \"Give him a month and then ask him if he wants to go back to shots.\"  Well, last night I asked,\" Do you want to do shots instead?\"  He said, \"No, Mom, what are you crazy?\"When we started talking about the pump, our doc gave us a video to watch so my son and I watched it.  (dad was busy at work..typical:)  Well, after watching the video, we were all \"pumped up\" about it!  LOL  I had several talks with my son.  I told him this is your body and the pump is your decision.  IF you want us to try to get the ins. to approve it, you have to feel ready to learn how to use it (use the buttons).  I said that he and I would learn it together. I said I am not going to learn it myself and teach it to you 2 yrs. from now.  He said, let's go for it!I did know someone whose son was on the pump at an early age because he would not let her give him shots.When my son was diagnosed, he would run from me and I had to chase him and hold his thigh in between my legs and give him a shot and he would say, I hate you mommy and I would say, if I don't give you your medicine, you will get very sick.  This is all I could tell my 3 year old.  Then his doc told us about a device called an Inject-Ease.  You put the syringe in it and use it to give a shot...this way he doesn't see the needle which is what I felt caused  most of the fear at that age.  Well, he used that Inject-ease up until recently when we got his pump!It has been just about 6-1/2 yrs. since my son was diagnosed.  He was diagnosed on April 13, 1998 one day after Easter that year.  The car for my boy has become second nature.  I have a certain way of doing things and I am very protective.  When my husband and son leave the house to go somewhere, I yell out, do you have your red bag.  The red bag is an insulated bag and I have my son pack it...a few juiceboxes, a snack, his glucometer and insulin just incase there was a prob with the pump.  The only place my son has stayed overnight at is my Mom and Dad's.  If he is invited to a birthday party, at this age, I am going.I am going to do the best I can to take care of my son and when there is a Cure, we will all sleep a little better and breathe a little easier.  I know you can relate.....I haven't slept the same since he was diagnosed.Okay, I am sorry I am SOOOO long-winded!  At least you don't have to hear me talk on the phone!  LOLI am happy to hear you are keeping JJ a little on the high side because hearing about JJ's sever lows and losing consciousness was scary to me.....I cannot imagine how you felt with him losing consciousness.  Luckily, we have never had to use glucagon. knock on wood.Bye for now...I look forward to hearing that JJ continues to have not so may lows.",
            "post_id": "2433766",
            "timestamp": "1095483600",
            "votes": 0
        },
        {
            "answer": "Thanks SS for your lengthy comment. I really appreciate the detail you included;it gives a better picture of your experience and the human touch; so please, no need to apologise.Re: Insulin pump, does the infusion cannula cause pain when it is inserted, and is it fairly easy to do? Has your son experienced any problems with redness/soreness at the cannula site, and does one use fast acting insulin only with the pump?We have an inject-ease too for JJ. He was not at all keen on shots at first, although he didn't mind the finger pricks.Since we have used the inject-ease we have had no problems with giving shots, and at times he has had as many as seven in a day. He normally has around 4, with a possible extra at night if he is high. It was only when we stepped up the frequency of shots that we gained some degree of control, and it makes me wonder how much more control(and hopefully avoidance of complications) we can achieve with a pump. We had significant hyperglycaemia for almost 14 months before I \"woke up\" as a result of a locum GP alerting me to the fact that all was not well. I had sort of got used to this being JJ's trend, and as he was diagnosed only 2 weeks after my husband left us, I was in a daze, and just not ready to join the Diabetes \"club\" at all.I don't think I took much in at first, although I understood the seriousness of it.As for sleep? Like you, I don't know what a night's sleep is. JJ never slept through the night, even before diagnosis, and now I wake several times a night to check on my son.Incidentally, I thought I would introduce the \"password\" idea posted on this site recently.I haven't heard of this idea before, and thought we would give it a go. What do you think? It would be an interesting experiment,but I wouldn't rely on it at this stage, for sure.Well, thanks again for sharing your experiences. I so hope the pump continues to give you and your son freedom and better health, and here's hoping for a cure before he gets married :) I would be interested to hear of your progress.Bye for now,J J's mom.",
            "post_id": "2433767",
            "timestamp": "1095483600",
            "votes": 0
        },
        {
            "answer": "Hi J J's mom,How is JJ doing?  I just wanted to check in with you to see how you are and how your son's blood sugars have been lately.I hope he is doing better.Keep in touch!",
            "post_id": "2433904",
            "timestamp": "1099980000",
            "votes": 0
        }
    ],
    "post_id": "2429683",
    "question": "My 4 year old son was diagnosed with type 1 Diabetes 18 months ago, and we have very gradually gained better control over that period of time. 5 days ago he woke up with a reading of 3mmol/l (54mg/dl). I reduced his insulin slightly. He ate breakfast normally, and then went into a severe hypo 2 hours later, losing consciousness. His hypos have persisted for a few days now, and his daily insulin intake since then has ranged from nil to about one sixth of his usual requirements, and he is still experiencing frequent hypoglycaemia. He did vomit approx 12 hours after the first severe hypo, and had loose stools for a couple of days. I have been in touch with the Diabetes team, and we are monitoring him closely.I was wondering what the reason for this sudden hypo state is, and when he is likely to kick back in and require his usual insulin? Will he grow properly during this time, and will the hypos be harming his brain or other organs? This is the first hiccup we have had since diagnosis. Any comments would be most welcome. Thankyou. J J's mom",
    "timestamp": "1095138000",
    "title": "Why the sudden onset hypoglycaemic trend in a 4 yr old type 1?"
}