{
    "answers": [
        {
            "answer": "I've used milk thistle, and Sho-Saiko-To, a Japanese hep c treatment...The milk thistle helps the liver to detoxify and slow damage, the SST actually knocks the hep c down and repairs the liver, but neither one get rid of it...Hep C damages more than your liver -it can attack and effect just about all your body systems...it weakens your immune system, causes memory loss, arthritis, nerve pain and some autoimmune problems...It can cause bile duct, diabetic/ pancreatic issues, and GI disturbances...So, if you need to buy time, SST or milk thistle may be a good choice...Or if you are unable to do the conventional treatment...After using Naturopathic treatment for several months, I determined I was as healthy as I was going to get, and I went for the conventional treatment...And I have no detectable hep c virus in my system at this time. I hope this info helps...",
            "post_id": "2958098",
            "timestamp": "1211856728",
            "votes": 0
        },
        {
            "answer": "Glad to hear it worked for you.  Please share, how did it work for you? You certainly don't believe you are HepC free b/c you used Milk Thistle?  If it made you feel better and that's all you wanted then you accomplished what you wanted to, and good for you.  It has been know to lower VL, but it does nothing as far as eliminating the virus from your system.  I would like to get rid of my HepC and MT isn't gonna accomplishment that for me.  Good luck with your herbal experience.  Oh I placed a warning I found on another site, so if anyone is considering messing around with MT read all you can about it first.  laterA warning about milk thistle and drug interactionsThe seeds of the milk thistle plant are commonly used to protect the liver from damage caused by hepatitis viruses as well as alcohol andother substances. Compounds found in milk thistle \u0097 sylibin, sylimarin \u0097 act as antioxidants and also stimulate the repair of the liver.But now it appears that these and possibly other compounds in milk thistle can have other effects.Researchers at the University of Pittsburgh have suspected that milk thistle can slow down or reduce the activity of enzymes in the liver.Enzymes in the liver break down many of the substances that we eat and drink, including medications. If the activity of these enzymesare reduced, then drugs remain in the blood longer than they otherwise might. This could lead to having higher-than-expected levels ofdrugs in the body, causing side effects or intensifying already-existing side effects. Indeed, in recent experiments using milk thistle andhuman liver cells, the researchers found that relatively small concentrations of milk thistle did significantly slow down the activity of theliver enzyme CYP3A4 by 50% to 100%.Many medications taken by people with HIV/AIDS (PHAs) \u0097 such as protease inhibitors and non-nukes \u0097 are processed by this liverenzyme. If milk thistle is taken by someone using protease inhibitors or non-nukes, it has the potential to raise levels of these drugs,causing unpleasant or even dangerous side effects. Below is a short list of some other medications that are processed through theCYP3A4 enzyme. Levels of these medications may increase if taken by people who are also using milk thistle. This list is not exhaustive:• methadone• heart drugs \u0096 Tambocor (flecainide), Rythmol (propafenone)• antibiotics \u0096 erythromycin, rifampin• anti-seizure drugs \u0096 carbamazepine (Tegretol)• antidepressants \u0096 St. John’s wort, Zyban/Wellbutrin (bupropion), Paxil (paroxetine), Prozac (fluoxetine), Luvox (fluvoxetine)Serzone (nefazodone), Zoloft (sertraline), Effexor (venlafaxine)• antihistamines \u0096 Hismanal (astemizole), Seldane (terfenadine)• antifungals \u0096 itraconazole (Sporanox), Ketoconazole (Nizoral)• gastrointestinal motility agents \u0096 Prepulsid (Cisapride)• ergot drugs \u0096 Ergonovine, Ergomar (ergotamine)• anti-psychotics \u0096 Clozaril (clozapine), Orap (pimozide)• sedatives/sleeping pills \u0096 Ambien (zolpidem), Halcion (triazolam), Versed (midazolam)• lipid-lowering drugs (statins) \u0096 Lescol (fluvastatin), Mevacor (lovastatin), Pravachol (pravastatin) and Zocor (simvastatin),Baycol (cerivastatin)• transplant drugs \u0096 cyclosporine (Neoral, Sandimmune), ProGraf (tacrolimus)Milk thistle also has the potential to lower levels of the following drugs:• anti-parasite drugs \u0096 Mepron (atovaquone)• sedatives/sleeping pills \u0096 Ativan (lorazepam)• hormones \u0096 estrogenThe research by the scientists in Pittsburgh should emphasize to readers that simply because a product is \"natural\" it does not mean it issafe when taken with other substances. This research also shows the need to conduct further research on herb-drug interactions on livercells as well as in people. Such studies may find combinations of herbs and drugs that can be safely used together. The Pittsburghresearchers noted that \"patients and health care professionals must be encouraged to discuss the use of herbs and be educated about thepotential interactions between herbs and drugs.\" This cannot be stressed enough.REFERENCEVenkataramanan R, Ramachandran V, Komoroski **, et al. Milk thistle, a herbal supplement, decreases the activity of CYP3A4 anduridine diphosphoglucuronosyl transferase in human hepatocyte cultures. Drug Metabolism and Disposition 2000; 28(11):1270-1273.This information was provided by the Community AIDS Treatment Information Exchange (CATIE). For more information, contactCATIE at .http://www.hepccalifornia.org/abouthepatitisc-alternativeandcomplementarymedicine.html",
            "post_id": "2958337",
            "timestamp": "1211861878",
            "votes": 0
        },
        {
            "answer": "Thanks, I think we are all starting to get tired of the 'milk thistle thing'.virgocharm:The plain truth is it that Milk Thistle does NOT cure hepatitis c! It is good for the liver, but NOT when you are on treatment, as it interacts with medications. To add to this, the SAME with grapefruit!Good luck, Marcia",
            "post_id": "2958855",
            "timestamp": "1211887123",
            "votes": 0
        },
        {
            "answer": "Thanks so much for posting that.  I sure hope some of the many people on our boards read it and take a mental note of this....Susan",
            "post_id": "2958856",
            "timestamp": "1211887193",
            "votes": 0
        },
        {
            "answer": "Thanks for the info about the SST. Personally, I do not want to do any herbal approach now before treatment. But I definitely want to get into it after treatment. My diet has been almost vegan, whole food, health food etc for many years and since I found out I had hep c I went 100% organic, including everything I put on my body(creams, soap, shampoo, etc)I do have a grapefruit every morning, krill oil and chlorella supplements. These I have been taking for a long time. I was thingking of stopping them before treatment.Marcia",
            "post_id": "2958891",
            "timestamp": "1211888596",
            "votes": 0
        },
        {
            "answer": "Ty for posting I see you are doing your homework well and you haven´t even started tx yet,same with marcia, that looks good for the future.I´m on my second tx geno 3 and everything was looking perfect due to labresult first tx but I relapsed, think tx is very much of a gamble.Lots of old hepers can confirme that.You can´t take anything for granted , beeing a gamling man i know it takes three things to win thats luck, money and knowledge if you have more of one you need less of the others, but best is to have lot of all three.God bless you always!ps Prepared is a keyword, fret, marcia you seems to already have understand that,good luck with your coming up treatments.",
            "post_id": "2958914",
            "timestamp": "1211889346",
            "votes": 0
        },
        {
            "answer": "Wow! Good MT info! I had known a good part of that, but not the interactions..Excellent info! Aren't these forums great for these tidbits of info?!?            ~Melinda",
            "post_id": "2959784",
            "timestamp": "1211904821",
            "votes": 0
        },
        {
            "answer": "Everyone always have to remember:  unless something has been PROVEN not to cause any reactions to the interferon/riba it's better NOT TO TAKE IT.  NOTHING is worth that chance.And milk thistle might be helpful to you but it won't cure jack, only dual combo will do that presently.",
            "post_id": "2959886",
            "timestamp": "1211906250",
            "votes": 0
        },
        {
            "answer": "Tak så mycke, min ven! I am also geno 3. It will be interesting how they are going to handle my geno! Finally got my appointment at the Rigshospitalet here in Köpenhamn on June 13th. They will be keeping me there the whole day to take all kind of tests and to talk to the hepatologist. I will definitely be asking him/her how they are going to treat in regard to geno 3.I really wish you all the best with tx.God bless,Marcia",
            "post_id": "2959900",
            "timestamp": "1211906354",
            "votes": 0
        },
        {
            "answer": "Well, can you tell us how it worked for you?  I'm very curious.  thank you",
            "post_id": "2964263",
            "timestamp": "1211983792",
            "votes": 0
        },
        {
            "answer": "Me too, I would really like to know how it has worked for you.Marcia",
            "post_id": "2964933",
            "timestamp": "1211992843",
            "votes": 0
        },
        {
            "answer": "A Mug of Hot Cocoa Can Improve Artery Health in Patients With Type 2 DiabetesMichael O'RiordanMay 27, 2008 — The benefits of cocoa, known recently for its ability to reduce blood pressure and improve endothelial function, also extends to diabetic patients, a new study has shown [1]. In a small, randomized study, investigators showed that the consumption of a big mug of hot cocoa can reverse vascular dysfunction in patients with diabetes, suggesting a therapeutic potential of cocoa in this patient population.\"Our study clearly established improvements of endothelial function after regular consumption of flavanol-containing cocoa in patients with type 2 diabetes, highlighting the potential of flavanol-containing diets and underscoring the potential health benefit for reducing the risk of cardiovascular events in diabetic patients,\" write lead investigator Dr Jan Balzer (University Hospital RWTH, Aachen, Germany) and colleagues in the June 3, 2008 issue of the Journal of the American College of Cardiology.The findings are just the latest in a string of studies showing the cardiovascular promise of foods like cocoa that contain flavanols. Flavanols are a subgroup of plant-derived phytochemicals known as flavonoids, and several studies have shown that flavanol-containing foods, including cocoa, certain fruits and vegetables, tea, and red wine, have beneficial effects on LDL oxidation, platelet aggregation, insulin sensitivity, endothelial function, and blood pressure.Effect of Flavanols in Diabetics UnknownDespite the existing data, however, studies on the effects of flavanols on the vasculature in diabetic patients were missing. Patients with type 2 diabetes, writes Balzer and colleagues, might receive particular benefit from flavanol-containing cocoa, because various observational studies have shown that lifestyle modifications are particularly important in the prevention of diabetes and its complications.The investigators performed two studies: a 10-patient feasibility study to determine the appropriate dosing, to assess safety and tolerability, and to measure the effect size of the intervention to calculate sample size of the efficacy study. In total, 44 patients with treated type 2 diabetes were enrolled in the randomized, double-blind, parallel-group efficacy study, with half allocated to the treatment arm of 321 mg of flavanols per dose three times daily. The control patients also received some flavanols, albeit a much smaller amount, about 25 mg per dose three times daily.Baseline flow-mediated dilation (FMD) values were 3.3% in both the treatment and control arms at the start of the intervention. The daily consumption of flavanol-containing cocoa by patients in the treatment arm resulted in continual increases in FMD, increasing from 3.3% at baseline to 4.1% on day 8 and to 4.3% by study completion on day 30. The investigators note that the acute effects of drinking cocoa in the treatment arm, those recorded two hours after ingestion, were of a similar effect size at study entry, day 8, and day 30, suggesting that patients did not become desensitized or immune to the effects of drinking cocoa.On day 30, the investigators report that the composite maximum increase in FMD--a combination of the chronic and acute effects of cocoa ingestion--was 5.8%, suggesting \"a reversal of endothelial dysfunction.\" This reversal in endothelial dysfunction with cocoa is comparable to intermediate- and long-term interventions using exercise and various medications, including insulin, pioglitazone, ACE inhibitors, and statins, write Balzer and colleagues.The high-flavanol cocoa used in this study--which provides much more flavanol than the typical US dietary intake of 20 to 100 mg daily--is not sold in the supermarket.The present study was not designed to determine the precise molecular mechanism by which flavanols improve endothelial function. However, the investigators point out that FMD of the brachial artery is almost entirely dependent on nitric oxide (NO) and that endothelial function measured by FMD is commonly used as a marker of endothelial NO synthesis.This proposed mechanism, they note, would make sense considering that recurrent and prolonged hyperglycemia in diabetic patients reduces NO bioavailability, which leads to endothelial dysfunction. In support of this hypothesis, Balzer and colleagues report no improvement in endothelium-independent vasodilation after the administration of nitroglycerin, which suggests that improvements in vascular function are secondary to the effects of treatment on endothelial function and NO bioavailability.A Promising New Dietary Intervention for Type 2 DiabetesIn an editorial accompanying the study, Drs Umberto Campia and Julio A Panza (Washington Hospital Center, Washington, DC) note that interest in the cardiovascular benefits of cocoa started with observations of the Kuna Indians [2]. This indigenous population in Panama consumes a large amount of cocoa rich in flavanols and, despite a diet that also has a large amount of salt, they have a very low prevalence of heart disease, stroke, diabetes, and cancer compared with Kuna Indians living in Panama City.Campia and Panza write that because the endothelium plays a significant role in hypertension and atherosclerosis, research efforts have focused on the acute and chronic effects of cocoa, as well as other drinks and food, in the hope that their consumption could improve vascular function.One important question, the editorialists note, that this study answers pertains to previous concerns that nutrients in the diet of diabetic patients might not reach needed physiological levels due to secondary impairments in gastrointestinal function. That absorption concern is apparently unwarranted, as these data suggest flavanol intake in diabetics results in plasma levels consistent with those observed in nondiabetic patients. Second, this study also shows that FMD increased steadily and was maintained over time, \"suggesting a lack of significant desensitization or tolerance.\"The study, according to Campia and Pana, extends the understanding of the vascular effects of flavanols to diabetic patients, but more work is still needed. \"Although endothelial function has been shown to predict future cardiovascular events, randomized, large-scale clinical trials assessing relevant clinical outcomes are necessary before any recommendations are made regarding dietary supplementation with flavanol-rich cocoa,\" they write.Mars Inc provided the instant cocoa powder used in the preparation of cocoa drinks in the study. Dr Hagen Schroeter, one of the paper's authors, is employed by Mars Inc.1. Balzer J, Rassaf T, Heiss C, et al. Sustained benefits in vascular function through flavanol-containing cocoa in medicated diabetic patients. J Am Coll Cardiol 2008; 51:2141-2149.2. Campia U and Panza JA. Flavanol-rich cocoa: A promising new dietary intervention to reduce cardiovascular risk in type 2 diabetes? J Am Coll Cardiol 2008; 51:2150-2152.The complete contents of Heartwire, a professional news service of WebMD, can be found at www.theheart.org, a Web site for cardiovascular healthcare professionals.",
            "post_id": "2965520",
            "timestamp": "1211999574",
            "votes": 0
        },
        {
            "answer": "Interesting and great to get the discussion away from MT. :-)As they say that one cannot buy the cocoa they used in the supermarkets, I am assuming that they are using raw cocoa, as roasting the cocoa beans destroys the antioxidants and probably also the flavanol, and renders it to be more like coffee.Raw cocoa, is considered a super food. It is supposed to have the highest antioxidant value of all the natural foods.I usually make raw chocolate from all raw ingredients and stir it 'warm', not heated.. Raw cocoa butter, cocoa powder, agave syrup, goji berries, carob powder and other stuff... and find that it gives me a total kick, when I eat it. It gives amazingly much energy.  (am not eating any, since dx, as I'm staying away from the fat)Anyway, back to the subject... I don't understand why the study says, it lowers blood pressure.My usual blood pressure is 100/65, so I assume that if the cocoa gives me a kick, it theoretically must heighten my blood pressure??? Maybe I'm wrong. Maybe it energizes in another way. But if it would lower blood pressure, wouldn't it make me feel tired?But i did not understand how it will be of use to Hep C. Well the antioxidants are definitely great. It mentions platelet aggregation, how does that translate?Marcia",
            "post_id": "2965756",
            "timestamp": "1212002339",
            "votes": 0
        },
        {
            "answer": "I just found the article interesting and since milk thistle is such an over worked subject  I just stuck this cocoa thing in here. I was going to post regarding Milk of Magnesia but this seemed a better choice.Relevance? Well, since diabetes is associated with HCV maybe that's a plausible  connection..... albeit a trifle tenuous.Mike",
            "post_id": "2965874",
            "timestamp": "1212003989",
            "votes": 0
        },
        {
            "answer": "You sure had me laughing, when I first saw the post. What a good distraction. Cocoa, chocolate!  I actually think that the first post is another imposter... I mean milk thistle ... again? And I don't think the person is coming back for any answers. Just my opinion, was actually suspecting it from the beginning.But what about the platelet aggregation??? What does that mean? Maybe we're on to something new!Marcia",
            "post_id": "2966024",
            "timestamp": "1212006285",
            "votes": 0
        },
        {
            "answer": "I would think M of M could be a REGULAR subject here.  (yuk, groan) :)Brent",
            "post_id": "2967695",
            "timestamp": "1212028055",
            "votes": 0
        },
        {
            "answer": "Cocoa flavanols and platelet and leukocyte function: recent in vitro and ex vivo studies in healthy adults.Heptinstall S, May J, Fox S, Kwik-Uribe C, Zhao L.Cardiovascular Medicine, University of Nottingham, UK. s.***@****There is growing interest in possible beneficial effects of specific dietary components on cardiovascular health. Platelets and leukocytes contribute to arterial thrombosis and to inflammatory processes. Previous studies performed in vitro have demonstrated inhibition of platelet function by (-)-epicatechin and (+)-catechin, flavan-3-ols (flavanols) that are present in several foods including some cocoas. Also, some modest inhibition of platelet function has been observed ex vivo after the consumption of flavanol-containing cocoa products by healthy adults. So far there are no reports of effects of cocoa flavanols on leukocytes. This paper summarizes 2 recent investigations. The first was a study of the effects of cocoa flavanols on platelet and leukocyte function in vitro. The second was a study of the effects of consumption of a flavanol-rich cocoa beverage by healthy adults on platelet and leukocyte function ex vivo. Measurements were made of platelet aggregation, platelet-monocyte conjugate formation (P/M), platelet-neutrophil conjugate formation (P/N), platelet activation (CD62P on monocytes and neutrophils), and leukocyte activation (CD11b on monocytes and neutrophils) in response to collagen and/or arachidonic acid. In the in vitro study several cocoa flavanols and their metabolites were shown to inhibit platelet aggregation, P/M, P/N, and platelet activation. Their effects were similar to those of aspirin and the effects of a cocoa flavanol and aspirin did not seem to be additive. There was also inhibition of monocyte and neutrophil activation by flavanols, but this was not replicated by aspirin. 4'-O-methyl-epicatechin, 1 of the known metabolites of the cocoa flavanol (-)-epicatechin, was consistently effective as an inhibitor of platelet and leukocyte activation. The consumption of a flavanol-rich cocoa beverage also resulted in significant inhibition of platelet aggregation, P/M and P/N, and platelet activation induced by collagen. The inhibitory effects were related to their flavanol content. There was also inhibition of monocyte and neutrophil activation, but here it was concluded that cocoa constituents other than flavanols may contribute to the inhibition that was observed. It can be concluded that cocoa flavanols, their metabolites and possibly other cocoa constituents can modulate the activity of platelets and leukocytes in vitro and ex vivo. The research suggests that the consumption of certain cocoa products may provide a dietary approach to maintaining or improving cardiovascular health.http://www.ncbi.nlm.nih.gov/pubmed/16794458",
            "post_id": "2969157",
            "timestamp": "1212068714",
            "votes": 0
        },
        {
            "answer": "Yay, you found it! I still don't know what aggregation means. I must admit that I don't understand most of what they are saying. But it seems to be having a positive effect, if I understand correctly. I can see that I have a lot of holes in my English vocabulary. It would be really nice, if you could help me out.Thanks, Marcia",
            "post_id": "2969811",
            "timestamp": "1212076702",
            "votes": 0
        },
        {
            "answer": "BTW, milk thistle virgocharm is for real. I got a pm, ending with the words: marcia educate your mind. dig and dig and dig.In a way the pm was quite naively explaining how good he/she feels from all the natural things, with no data showing improvement results or biopsies to account for the great progress since dxed 7 months ago. The pm was quite unpleasant , verging on rude and I actually feel like posting it, but don't know if it is ethical to do it. I am not used to people speaking to me in that tone and the ignorance really pi$$ed me off.Marcia",
            "post_id": "2969896",
            "timestamp": "1212077515",
            "votes": 0
        },
        {
            "answer": "Now we now the poster is must likely a troll, but i dont care this thread has given me alot of positivism anyway.And if you shall post the pm i don´t know, think the best is to ignore them but on the other hand I`ve heard that if you expose trolls for the light they will crack in thousands of peaces.ca",
            "post_id": "2970032",
            "timestamp": "1212079104",
            "votes": 0
        }
    ],
    "post_id": "2957755",
    "question": "y not milk thistle",
    "timestamp": "1211850458",
    "title": "y has no one used milk thistle it worked for me"
}