{
    "chebyshev": [
        {
            "answer": "It definitely sounds like you were right on top of things when it came to noting the changes in you kitty.  It is not uncommon to see pets resistant to changes in their food.  I usually will recommend a gradual transition over about a months period of time.  I will instruct clients to feed 3/4 of their regular food with 1/4 of the new for about a week or so, then 1/2 and 1/2 for a week, then 1/4 regular food to 3/4 new food for a week then all new.  This way,in the early transition, your kitty will primarily be receiving their regular diet so you can administer the insulin that is needed.There are other dietary options to consider in the diabetic feline patient.  Purina, Hill's and Royal Canin make a food that can be used in diabetes.  It may be a function of trying another brand.Your veterinarian may have an additive, i.e. Rebound, that you may be able to mix into the food in the early phases.  Unfortunately, there are times when our patients will not transition to a new food no matter what techniques we try.  In those cases, we still manage them with insulin and their regular diet.  These felines can require higher insulin doses and be harder to manage.It is important that you keep a good line of communication open with your veterinarian.  Discuss your concerns and the problems you are having.  They will best be able to help you through the early implementation of treating your diabetic kitty.  Good luck.",
            "id": "5242575",
            "rank": 3
        },
        {
            "answer": "Dear Dr. Hurley,,Thank you so much.  Yes, she showed no symptoms of lethargy, weight loss, etc., so I think I caught it early.  These pets are so good at hiding symptoms unless it's something obvious like the excessive water.I was mixing 3/4 new DM food and just a little of her old food.  No wonder she gave me those sad eyes.  I had planned on calling the Vet when they open to see about another brand, but now I will give this food another day or so.  I know I can get her to eat if I add 3/4 old and 1/4 new.  She just saw me moving her pet carrier to other room, so now she's afraid I'm up to something and is hiding under the bed.  I placed some of her old food in a bow under the bed just to get some food in her so that I can give her the shot.  Now the trick will be to see when she comes out from under the bed.  She's in the middle where I can't reach her.  It's so hard when they don't understand we are trying to help them.Yes, definitely I will stay in close touch with my Vet and my concerns.  Thanks again for such a quick response,  I will keep you posted on how we do.",
            "id": "5242813",
            "rank": 14
        },
        {
            "answer": "Hi Dr. Hurley,Just to update you, My kitty went for the 3/4 old food and 1/4 new food and ate most of it, so I was able to give her 2 units insulin around 5 pm.  I'm watching her to make sure she's okay, and I've been in touch with her Vet.  Thank you again.",
            "id": "5245368",
            "rank": 3
        },
        {
            "answer": "Good Evening,That is excellent news!!  Take the transition slow and hopefully you will have success. Keep up the great job!",
            "id": "5245575",
            "rank": 3
        },
        {
            "answer": "I had a friend with me this first time, and she held my kitty so that I could get the hang of doing the first shot, which greatly helped.  I observed Maggie throughout the evening and night, and she seems just great.  Thanks so much for all your support..",
            "id": "5246303",
            "rank": 3
        },
        {
            "answer": "I have a new question regarding my cat's diabetes.  Today will be the third day for me giving my cat insulin shots twice a day.  My Vet went out of town for 10 days, so when I have a question, I've been asking the Vet Techs for help.  A friend called me yesterday and was asking why I am not monitoring my cat with a glucose monitor to see her sugar count as to whether it may be high or low.  The only prescription given to me was for the insulin shots and syringes.  I did have a quick lesson on how to inject her.  As a new diebetic kitty, should I be checking her blood every day?  I sure will be calling my Vet's office with this question, too.  I do have an appointment to take her in for a blood check the end of this coming week!  I really want to be diligent with this  disease and do all I can to get her on track.  She's not showing any hypoglycemic symptoms, so that is good news.  I'm making sure she has food in her stomach before injecting.",
            "id": "5249792",
            "rank": 3
        },
        {
            "answer": "In my experience, there is diversity in how veterinarians manage their diabetic pets.  If you research diabetes managing in veterinarian medicine, you will find veterinarians that follow one of the following:1.  Hospitalize and manage in hospital until regulated2.  At home glucose monitoring3.  Periodic blood glucose checks in hospital4.  Periodic blood glucose checks in hospital with fructosamine blood test5.  Urine glucose monitoring at homeIn my humble opinion, as long as the veterinarian is managing the diabetic pet in a manner that is comfortable to them and the owner is comfortable, there is no right or wrong way.In our hospital, I manage my diabetic patients by having the owner monitor the urine glucose at home, stay in email contact in the regulating phase, a schedule of blood glucose and fructosamine tests, and monitoring clinical signs (water intake and urinating frequency).The other two doctors in our practice each do it differently from me and from each other.  One of our doctors lives by the at home monitoring.  I am not a big fan of at home glucose monitoring because I personally think it can be difficult and uncomfortable for owners based on my discussion with owners that have been taught to do blood glucose monitoring.  I have also had owners that love it, it is not the way I choose to do monitoring.  The other doctor does more monitoring of the pet with a predetermined schedule of blood tests in our hospital.Sorry to be so lengthy, however, it is my way of showing you there is diversity in how veterinarians manage diabetes.  As long as you are comfortable with the progress your kitty is making, you understand the regulating process your veterinarian has proposed and you are monitoring for positive changes and negative changes in your kitty to share with your veterinarian and their staff, you and your kitty are on the right track.Diabetes is one of management and communication.  I am glad to see you have a lot of questions and are staying in touch with your veterinarian.  It is perfectly normal and it does get easier.  For future reference, what type of insulin are you using??  Good luck and I hope this helps.",
            "id": "5249984",
            "rank": 3
        },
        {
            "answer": "Thank you so much Dr. Hurley.  Your detailed response helps me greatly understand the different methods.  So far Maggie seems like she is doing well.  Thanks you also for explaining that Vets do it differently from one another, and there is no right or wrong way.  To tell you the truth, I'm not sure I'd be comfortable with the glucose monitoring and doing the ***** to get a blood sample.  My kitty hides in a corner right after I give her the insulin shot, so the glucose monitor pinch may send her over the edge, unless the pet glucose monitor is friendly.  I would be more comfortable with the urine monitoring.  It may be I will learn more about the monitoring from my Vet when I take kitty in for a blood check this Thursday.  My Vet has prescribed the Lantus U-100 Insulin 10ML for Maggie.  She is on two units every 12 hours.Thank you again for your time and for helping me understand.",
            "id": "5250186",
            "rank": 3
        },
        {
            "answer": "Hi,Just a post note.  I don't know why my Windows Vista printed the four stars up above wnen I was talking about getting a blood sample.  The word I used was another synonym for needle stick, so I guess Windows Vista didn't recognize the word.  This happens in my E-mails, too, except it prints nil for the original word I used!",
            "id": "5250428",
            "rank": 3
        },
        {
            "answer": "Hi again,Just an update and some good news.  I had my kitty in to see the Vet yesterday for a glucose/blood test after being on one week of 2 units insulin to see her progress.  Her glucose was 126 ,which is good as her initial glucose was 421.  Unfortunately, I did not get to see my Vet, as he was tied up in surgery, so the only contact I had was with a different Vet Tech asking a couple questions about the time of her last meal and last shot; she was then taken into another room while I waited outside.  Then after the glucose test, the Vet Tech brought kitty to me with the glucose reading and stated the Vet wants me to continue on the 2 units every 12 hours and bring her back in a week for another glucose test.  I passed a message onto the Receptionist to ask the Vet if the weekly visits will be the protocol for my kitty's diabetes.  I did not get a call back yesterday.  It was extremely busy yesterday.   I was disappointed that I did not even get to speak with another Vet in the Clinic, since my Vet was tied up.  I kind of feel like I am left with questions and no communication, so I will place a call today.  I'm happy with the 126 glucose reading, but I am wondering if I continue with the 2 units every 12 hours, won't she become hypoglycemic?  It has only been a week, so I am trying to be patient.  If I find there is little communication with the Vet, I will search for another one.    I am mainly concerned with the 126 glucose reading and continuing on the 2 units every 12 hours and worrying about her becoming hypoglycemic.  I feel I should buy a glucose monitor just so I will know her reading.  Any feedback?  I know I am being a worry wort with good reason!",
            "id": "5270402",
            "rank": 3
        },
        {
            "answer": "I agree trying to talk directly to your veterinarian is of paramount importance to understand the choices they are making for your kitty.  I am not too surprise to hear about the 126 blood glucose or continuing at your current dosing.  I assume your veterinarian has assessed your clinical history, the clinical symptoms and the timing of the blood draw to recommend you continue as started.Please make sure you talk with them.  Thank you for the update.",
            "id": "5271098",
            "rank": 3
        },
        {
            "answer": "Thanks for your feedback.  The instructions were for me to bring her in mid day from the time of her first dose of insulin.  The Vet, thru his Vet Tech, did not take any further info from me when I took her in other than time of last insulin shot and when was her last meal.  I mentioned to the Vet Tech that she would not eat the DM food, so I was mixing in with her Fancy Feast wet food just to get food in her so I could give the shot.  The instructions back to me from the Vet Tech were to enforce more DM food and less Fancy Feast and to bring her back in a week.",
            "id": "5273772",
            "rank": 2
        },
        {
            "answer": "Good morning,The timing of the test is good for evaluating the effect of the insulin.  I certainly hope you are able to speak with the veterinarian to  discuss how things are going, the difficulty you are having with the food transition and any other concerns or questions you may have.",
            "id": "5273925",
            "rank": 1
        },
        {
            "answer": "Thank you again.  I take Maggie in this Thursday and will ask to speak with the Vet.  The food is a problem with her.  I just tried Nine Lives Tuna Select, suggested by someone else with a diabetic cat when her cat also would not eat the DM Purina.  My kitty liked the Nine Lives when it was fresh and opened but once refrigerated, not so much,  She sure likes the Fancy Feast, but I am trying to cut back slowly.  She is off the dry food.",
            "id": "5275767",
            "rank": 15
        },
        {
            "answer": "Just an update.  I had a consultation with another Vet on food nutrition and which canned foods to feed my cat.  It was agreed that some at home monitoring would be good for kitty, so I've learned how to get a blood sample and get her glucose.  I have the pet monitor specifically for cats and dogs. I just did a curve, and her glucose is on the low side, from 73 in the morning and then peaking to 140 and down to 93 later in the day.  It almost seems like she should be hypoglycemic from these scores, but she's the opposite, feeling great and playful.  Maybe the meter is off. I've watched her all night to make sure she's okay.   I will be calling the Vet hospital as soon as it opens.",
            "id": "5320546",
            "rank": 3
        }
    ],
    "votes": [
        {
            "answer": "It definitely sounds like you were right on top of things when it came to noting the changes in you kitty.  It is not uncommon to see pets resistant to changes in their food.  I usually will recommend a gradual transition over about a months period of time.  I will instruct clients to feed 3/4 of their regular food with 1/4 of the new for about a week or so, then 1/2 and 1/2 for a week, then 1/4 regular food to 3/4 new food for a week then all new.  This way,in the early transition, your kitty will primarily be receiving their regular diet so you can administer the insulin that is needed.There are other dietary options to consider in the diabetic feline patient.  Purina, Hill's and Royal Canin make a food that can be used in diabetes.  It may be a function of trying another brand.Your veterinarian may have an additive, i.e. Rebound, that you may be able to mix into the food in the early phases.  Unfortunately, there are times when our patients will not transition to a new food no matter what techniques we try.  In those cases, we still manage them with insulin and their regular diet.  These felines can require higher insulin doses and be harder to manage.It is important that you keep a good line of communication open with your veterinarian.  Discuss your concerns and the problems you are having.  They will best be able to help you through the early implementation of treating your diabetic kitty.  Good luck.",
            "id": "5242575",
            "rank": 11
        },
        {
            "answer": "Dear Dr. Hurley,,Thank you so much.  Yes, she showed no symptoms of lethargy, weight loss, etc., so I think I caught it early.  These pets are so good at hiding symptoms unless it's something obvious like the excessive water.I was mixing 3/4 new DM food and just a little of her old food.  No wonder she gave me those sad eyes.  I had planned on calling the Vet when they open to see about another brand, but now I will give this food another day or so.  I know I can get her to eat if I add 3/4 old and 1/4 new.  She just saw me moving her pet carrier to other room, so now she's afraid I'm up to something and is hiding under the bed.  I placed some of her old food in a bow under the bed just to get some food in her so that I can give her the shot.  Now the trick will be to see when she comes out from under the bed.  She's in the middle where I can't reach her.  It's so hard when they don't understand we are trying to help them.Yes, definitely I will stay in close touch with my Vet and my concerns.  Thanks again for such a quick response,  I will keep you posted on how we do.",
            "id": "5242813",
            "rank": 1
        },
        {
            "answer": "Hi Dr. Hurley,Just to update you, My kitty went for the 3/4 old food and 1/4 new food and ate most of it, so I was able to give her 2 units insulin around 5 pm.  I'm watching her to make sure she's okay, and I've been in touch with her Vet.  Thank you again.",
            "id": "5245368",
            "rank": 1
        },
        {
            "answer": "Good Evening,That is excellent news!!  Take the transition slow and hopefully you will have success. Keep up the great job!",
            "id": "5245575",
            "rank": 11
        },
        {
            "answer": "I had a friend with me this first time, and she held my kitty so that I could get the hang of doing the first shot, which greatly helped.  I observed Maggie throughout the evening and night, and she seems just great.  Thanks so much for all your support..",
            "id": "5246303",
            "rank": 1
        },
        {
            "answer": "I have a new question regarding my cat's diabetes.  Today will be the third day for me giving my cat insulin shots twice a day.  My Vet went out of town for 10 days, so when I have a question, I've been asking the Vet Techs for help.  A friend called me yesterday and was asking why I am not monitoring my cat with a glucose monitor to see her sugar count as to whether it may be high or low.  The only prescription given to me was for the insulin shots and syringes.  I did have a quick lesson on how to inject her.  As a new diebetic kitty, should I be checking her blood every day?  I sure will be calling my Vet's office with this question, too.  I do have an appointment to take her in for a blood check the end of this coming week!  I really want to be diligent with this  disease and do all I can to get her on track.  She's not showing any hypoglycemic symptoms, so that is good news.  I'm making sure she has food in her stomach before injecting.",
            "id": "5249792",
            "rank": 1
        },
        {
            "answer": "In my experience, there is diversity in how veterinarians manage their diabetic pets.  If you research diabetes managing in veterinarian medicine, you will find veterinarians that follow one of the following:1.  Hospitalize and manage in hospital until regulated2.  At home glucose monitoring3.  Periodic blood glucose checks in hospital4.  Periodic blood glucose checks in hospital with fructosamine blood test5.  Urine glucose monitoring at homeIn my humble opinion, as long as the veterinarian is managing the diabetic pet in a manner that is comfortable to them and the owner is comfortable, there is no right or wrong way.In our hospital, I manage my diabetic patients by having the owner monitor the urine glucose at home, stay in email contact in the regulating phase, a schedule of blood glucose and fructosamine tests, and monitoring clinical signs (water intake and urinating frequency).The other two doctors in our practice each do it differently from me and from each other.  One of our doctors lives by the at home monitoring.  I am not a big fan of at home glucose monitoring because I personally think it can be difficult and uncomfortable for owners based on my discussion with owners that have been taught to do blood glucose monitoring.  I have also had owners that love it, it is not the way I choose to do monitoring.  The other doctor does more monitoring of the pet with a predetermined schedule of blood tests in our hospital.Sorry to be so lengthy, however, it is my way of showing you there is diversity in how veterinarians manage diabetes.  As long as you are comfortable with the progress your kitty is making, you understand the regulating process your veterinarian has proposed and you are monitoring for positive changes and negative changes in your kitty to share with your veterinarian and their staff, you and your kitty are on the right track.Diabetes is one of management and communication.  I am glad to see you have a lot of questions and are staying in touch with your veterinarian.  It is perfectly normal and it does get easier.  For future reference, what type of insulin are you using??  Good luck and I hope this helps.",
            "id": "5249984",
            "rank": 11
        },
        {
            "answer": "Thank you so much Dr. Hurley.  Your detailed response helps me greatly understand the different methods.  So far Maggie seems like she is doing well.  Thanks you also for explaining that Vets do it differently from one another, and there is no right or wrong way.  To tell you the truth, I'm not sure I'd be comfortable with the glucose monitoring and doing the ***** to get a blood sample.  My kitty hides in a corner right after I give her the insulin shot, so the glucose monitor pinch may send her over the edge, unless the pet glucose monitor is friendly.  I would be more comfortable with the urine monitoring.  It may be I will learn more about the monitoring from my Vet when I take kitty in for a blood check this Thursday.  My Vet has prescribed the Lantus U-100 Insulin 10ML for Maggie.  She is on two units every 12 hours.Thank you again for your time and for helping me understand.",
            "id": "5250186",
            "rank": 1
        },
        {
            "answer": "Hi,Just a post note.  I don't know why my Windows Vista printed the four stars up above wnen I was talking about getting a blood sample.  The word I used was another synonym for needle stick, so I guess Windows Vista didn't recognize the word.  This happens in my E-mails, too, except it prints nil for the original word I used!",
            "id": "5250428",
            "rank": 1
        },
        {
            "answer": "Hi again,Just an update and some good news.  I had my kitty in to see the Vet yesterday for a glucose/blood test after being on one week of 2 units insulin to see her progress.  Her glucose was 126 ,which is good as her initial glucose was 421.  Unfortunately, I did not get to see my Vet, as he was tied up in surgery, so the only contact I had was with a different Vet Tech asking a couple questions about the time of her last meal and last shot; she was then taken into another room while I waited outside.  Then after the glucose test, the Vet Tech brought kitty to me with the glucose reading and stated the Vet wants me to continue on the 2 units every 12 hours and bring her back in a week for another glucose test.  I passed a message onto the Receptionist to ask the Vet if the weekly visits will be the protocol for my kitty's diabetes.  I did not get a call back yesterday.  It was extremely busy yesterday.   I was disappointed that I did not even get to speak with another Vet in the Clinic, since my Vet was tied up.  I kind of feel like I am left with questions and no communication, so I will place a call today.  I'm happy with the 126 glucose reading, but I am wondering if I continue with the 2 units every 12 hours, won't she become hypoglycemic?  It has only been a week, so I am trying to be patient.  If I find there is little communication with the Vet, I will search for another one.    I am mainly concerned with the 126 glucose reading and continuing on the 2 units every 12 hours and worrying about her becoming hypoglycemic.  I feel I should buy a glucose monitor just so I will know her reading.  Any feedback?  I know I am being a worry wort with good reason!",
            "id": "5270402",
            "rank": 1
        },
        {
            "answer": "I agree trying to talk directly to your veterinarian is of paramount importance to understand the choices they are making for your kitty.  I am not too surprise to hear about the 126 blood glucose or continuing at your current dosing.  I assume your veterinarian has assessed your clinical history, the clinical symptoms and the timing of the blood draw to recommend you continue as started.Please make sure you talk with them.  Thank you for the update.",
            "id": "5271098",
            "rank": 11
        },
        {
            "answer": "Thanks for your feedback.  The instructions were for me to bring her in mid day from the time of her first dose of insulin.  The Vet, thru his Vet Tech, did not take any further info from me when I took her in other than time of last insulin shot and when was her last meal.  I mentioned to the Vet Tech that she would not eat the DM food, so I was mixing in with her Fancy Feast wet food just to get food in her so I could give the shot.  The instructions back to me from the Vet Tech were to enforce more DM food and less Fancy Feast and to bring her back in a week.",
            "id": "5273772",
            "rank": 1
        },
        {
            "answer": "Good morning,The timing of the test is good for evaluating the effect of the insulin.  I certainly hope you are able to speak with the veterinarian to  discuss how things are going, the difficulty you are having with the food transition and any other concerns or questions you may have.",
            "id": "5273925",
            "rank": 11
        },
        {
            "answer": "Thank you again.  I take Maggie in this Thursday and will ask to speak with the Vet.  The food is a problem with her.  I just tried Nine Lives Tuna Select, suggested by someone else with a diabetic cat when her cat also would not eat the DM Purina.  My kitty liked the Nine Lives when it was fresh and opened but once refrigerated, not so much,  She sure likes the Fancy Feast, but I am trying to cut back slowly.  She is off the dry food.",
            "id": "5275767",
            "rank": 1
        },
        {
            "answer": "Just an update.  I had a consultation with another Vet on food nutrition and which canned foods to feed my cat.  It was agreed that some at home monitoring would be good for kitty, so I've learned how to get a blood sample and get her glucose.  I have the pet monitor specifically for cats and dogs. I just did a curve, and her glucose is on the low side, from 73 in the morning and then peaking to 140 and down to 93 later in the day.  It almost seems like she should be hypoglycemic from these scores, but she's the opposite, feeling great and playful.  Maybe the meter is off. I've watched her all night to make sure she's okay.   I will be calling the Vet hospital as soon as it opens.",
            "id": "5320546",
            "rank": 1
        }
    ]
}