{
    "dice": [
        {
            "answer": "Wow, you folks who have responded sure know how to lay on the sarcasm! I hope that the sarcasm is an attempt to lighten up TacoLoverMatthew's grim attitude and is not done in meanness. I must say that I totally sympathize -- It IS hard to find out that diabetes may keep us from achieving a dream. Most of us never have to deal with diabetes making any of our dreams impossible. I have certainly been able to achieve my career goals and diabetes has not been a factor, for my dream was to be a graphic artist, and I am not hindered by diabetes in this quest. But in the case of armed services, police, and firefighters, I believe that TacoLoverMatthew is correct and that they will not hire a type 1 diabetic person. I happen to be married to a career Air Force officer, and I have known one or two people who developed type 1 diabetes and who were allowed to stay in the military, but both had non-combat jobs such as doctor. I do not know of any military people who were already diagnosed as type 1 diabetics before they joined.I think that before you get depressed, you should make some phone calls. Call your local military recruiter  and ASK; and also call your local police HR person and ask if there is any way that a type 1 diabetic person could be hired. I suspect that the answer will be \"no\", but a phone call is the only way to find out for sure. Part of what you are dealing with is the uncertainty of not knowing for sure.If the answer is indeed \"no\" as we think it will be, then grieve over it for a while. That's OK -- you have lost a dream. But the beauty of human nature is that we are able to adjust to ANYTHING. Let yourself be sad about it for a while, and then put your energy into researching other possibilities. This sounds trite, but it is not meant to be. A healthy emotional response to disappointment is to allow it to sadden us for a period of time, and then we rally and find other goals to reach for. Humans are amazingly good at adapting, and those of us who have type 1 diabetes, and have had it since childhood already know a lot about adapting emotionally.I would suggest that you spend some time talking with your high school guidance counselor NOW. Don't wait until you are  a senior and are about to graduate. High school guidance counselors usually are very well trained at helping people to identify career interests -- there are tests that you can take that show where your strengths and weaknesses are and how they fit into various career paths. Many jobs do not have any kind of physical limitations. And most jobs that offer health insurance offer it without any problems for type 1 diabetic people. There may be some other type of security job that you can pursue as a type 1 diabetic, and your energy needs to move towards researching other jobs that deal with security, since this seems to be the basic thing you are interested in. Check out FBI or CIA",
            "id": "2436148",
            "rank": 13
        },
        {
            "answer": "I hate my life.",
            "id": "2436147",
            "rank": 1
        },
        {
            "answer": "I am not a physician, but the mom of a type one diabetic.  I can tell you that for most of the jobs that you have named you are right.   Diabetes will disqualify you.  I have researched this before  for others and it is true that the  military , , police and fire fighters are not allowed to have diabetes, because if you have a low you are not only  putting your self in danger but  others as well.I would suggest that you discuss with your school guidance counselor some other options that might be available to you that would be as important as these jobs. Like EMT, nurse doctor.I hope this helps.",
            "id": "2431957",
            "rank": 1
        },
        {
            "answer": "It's ok, these guys are all burn victims in real life, after attempted suicide.  So they're a bit jealous. :PBut other than that, thank you for responding (was just messing about the whole \"I hate my life\" thing :D.Actually, secret service or FBI does sound very interesting to me, problem is, is that I can't consult my high school counselor for a bit, but oh well.But in all seriousness, thank you, I really appreciate this information.",
            "id": "2436150",
            "rank": 1
        },
        {
            "answer": "To the person who doesnt think that he cant do anything because he has diabetes, thats wrong dont ever settle for anything less for your self, go do anything you want to do! im a firefighter and i have type 1 diabetes, so no one can tell you that you cant do something because you have diabetes!!",
            "id": "2436181",
            "rank": 15
        },
        {
            "answer": "This is to the 15-yr. old guy that wants to be a police officer..... what state are you in?  I'm 34 and developed type I when I was 14 from a flu virus. I'm in great shape and monitor my blood sugar regularly. I attended the police academy for 10 wks. and now I'm a full-time police officer currently, and attending SWAT training next month. And yes they knew in the academy I was diabetic, and at the police dept. also.l also scuba dive and have advanced certifications in this sport. I kayak, mtn. bike, workout, run 2-3 miles a day, and dare someone to tell me I can't function my job duties without a hitch.......I just have to work harder at my control, but it keeps my mind focused 100% of the time. Who whoever tells ( or tries to discriminate against you ) tell them to take a hike. You can do anything you well please provided you take excellent care of yourself.....that is the key.",
            "id": "2436194",
            "rank": 1
        },
        {
            "answer": "people who are saying diabetics are cripples and kill your self if you are a diabetic , let me just say that those people are FAGGOTS. I am a diabetic and have been since i was 4 years old and now i am 15. And i am hardly a cripple, i go to the gym everyday and play basketball just like everyBODY ELSE. I know that there are many diabetes will disqualify you for a few jobs such as a police officer, pilot etc. But dont let that discourage you, there is going to be a cure soon and you will be able to carry on with your dream job. They just dont let diabetics get accepted into jobs that require strenuous activity because a diabetic may have a low blood sugar and not be able to concentrate and continue in a very delicate position.Peace,Amo2007",
            "id": "2436238",
            "rank": 1
        },
        {
            "answer": "hi, im 15 too, and i have type 1 diabetics. Personally, I dont want to be in the Army, Police force etc. but i think its really unfair to discriminate against those whose dream it is to have these jobs. I see why they're concerned, but what the hell, if we have a hypo, we're gonna know and we're obviously not going to crash the plane, its called a co-pilot for gods sake. Ive had diabetes for 6 years and ive never had more than a mild hypo, and i bet lots of other people have had it for longer and also havent had one. Im very pleased to hear that some of these people have been able to be police officers and pilots, so go for it :)x",
            "id": "4481171",
            "rank": 12
        },
        {
            "answer": "Hey, I'm 16 years old and just found out two months ago that I'm diabetic. and Yes, That Is true. As a diabetic you cannot be in any branch of the army, a pilot, or police officer. I'm truly sorry that this happened to you. This disease really *****, I cried when I found out. :( but I just wanted to reply and let you know, you can talk to me sometime if you want!:)",
            "id": "5043315",
            "rank": 1
        },
        {
            "answer": "TacoLoverMatthew,I'm 27 and have had Type 1 for 26 years. I know how ya feel man. My dreams of being a Naval Aviator were crushed before they were even a dream. I can tell you from experience, it's not worth dwelling on for too long. And in most states and counties, you can be a police officer with diabetes. You can also be an EMT or a Fire Fighter as well. It took me a long time to figure out that just because the government wont allow me to do CERTAIN jobs, doesn't mean I can't do others. I wanted to be a Fighter pilot as a kid. I couldnt. So for ten years, I was a commercial aircraft mechanic. I come from a long family line of Navy officers. I felt like a dissappointment to my family because I couldn't join. My grandfather is a retired Navy Admiral. I wanted to be just like him. I was ashamed of what I was for a LONG time. Don't let diabetes stand in your way of greatness. Today, I'm a physical trainer, and I specialize in training people afflicted with Diabetes. We've come a long way since I was a kid. I used to get picked on, beat up, and bullied because of my disease. I didn't let people that were afraid of something they didn't understand, stand in my way. Rise above. If you can't join the military or be a pilot or a cop, maybe you should be the guy that fights for our right to do those things.",
            "id": "5502161",
            "rank": 1
        },
        {
            "answer": "I am 28 yrs old and was diagnosed with type 1 only a year ago. I was in flight school when I got the news and I had to give up that career choice because with type 1, I cannot hold anything greater than a 3rd class aviation medical which only allows me limited use with my pilot license. I moved to southern california recently to attend an air traffic controller program and after speaking with a doctor out of oklahoma city(the base for the FAA and all things aviation) i was discouraged from continuing in that field as well, but only because the FAA air traffic control facilities require their diabetic employees to maintain no less than 100 glucose at all times, check their sugar every 1-2 hours and record it in a log and the management is always trying to find ways of getting rid of those diabetics because they feel they are a danger to everyone in the sky. I also had my commercial drivers license taken away here in california when they found out i have diabetes. i also just recently tried becoming a donor for bone marrow, but was rejected because of the dependence on insulin.",
            "id": "5505759",
            "rank": 1
        },
        {
            "answer": "i am a diabetic myself and i wanted to become a secret service agent.Is it possible for me to do so?",
            "id": "6116483",
            "rank": 1
        },
        {
            "answer": "Unfortunately these disqualifications are true. I am a 18 year old type 1 diabetic and I had wanted to maybe be a pilot when I was your age, after finding out I couldnt pursue this dream I just started thinking about what I could do and now I'm majoring in Aerospace Engineering so I'll be designing planes rather than flying them.You can find a job similar to all of what you listed so keep for head up man",
            "id": "7109091",
            "rank": 14
        },
        {
            "answer": "I have helped dozens of people get jobs as police officers, firefighters, underwater welders, commercial drivers, private armed security forces, FBI, and a slew of other dangerous and difficult jobs. Call 1-800-DIABETES if you want information about what jobs you can do. I am glad to help.",
            "id": "12191742",
            "rank": 1
        },
        {
            "answer": "Hey TacoLoverMatthew, you can still be a police officer. I am a type one diabetic and was diagnosed 5 years ago. I am 14 though. Don&#39;t let this disease hold you back. You have to fight for what you want.",
            "id": "14220585",
            "rank": 1
        }
    ],
    "votes": [
        {
            "answer": "Wow, you folks who have responded sure know how to lay on the sarcasm! I hope that the sarcasm is an attempt to lighten up TacoLoverMatthew's grim attitude and is not done in meanness. I must say that I totally sympathize -- It IS hard to find out that diabetes may keep us from achieving a dream. Most of us never have to deal with diabetes making any of our dreams impossible. I have certainly been able to achieve my career goals and diabetes has not been a factor, for my dream was to be a graphic artist, and I am not hindered by diabetes in this quest. But in the case of armed services, police, and firefighters, I believe that TacoLoverMatthew is correct and that they will not hire a type 1 diabetic person. I happen to be married to a career Air Force officer, and I have known one or two people who developed type 1 diabetes and who were allowed to stay in the military, but both had non-combat jobs such as doctor. I do not know of any military people who were already diagnosed as type 1 diabetics before they joined.I think that before you get depressed, you should make some phone calls. Call your local military recruiter  and ASK; and also call your local police HR person and ask if there is any way that a type 1 diabetic person could be hired. I suspect that the answer will be \"no\", but a phone call is the only way to find out for sure. Part of what you are dealing with is the uncertainty of not knowing for sure.If the answer is indeed \"no\" as we think it will be, then grieve over it for a while. That's OK -- you have lost a dream. But the beauty of human nature is that we are able to adjust to ANYTHING. Let yourself be sad about it for a while, and then put your energy into researching other possibilities. This sounds trite, but it is not meant to be. A healthy emotional response to disappointment is to allow it to sadden us for a period of time, and then we rally and find other goals to reach for. Humans are amazingly good at adapting, and those of us who have type 1 diabetes, and have had it since childhood already know a lot about adapting emotionally.I would suggest that you spend some time talking with your high school guidance counselor NOW. Don't wait until you are  a senior and are about to graduate. High school guidance counselors usually are very well trained at helping people to identify career interests -- there are tests that you can take that show where your strengths and weaknesses are and how they fit into various career paths. Many jobs do not have any kind of physical limitations. And most jobs that offer health insurance offer it without any problems for type 1 diabetic people. There may be some other type of security job that you can pursue as a type 1 diabetic, and your energy needs to move towards researching other jobs that deal with security, since this seems to be the basic thing you are interested in. Check out FBI or CIA",
            "id": "2436148",
            "rank": 10
        },
        {
            "answer": "I hate my life.",
            "id": "2436147",
            "rank": 1
        },
        {
            "answer": "I am not a physician, but the mom of a type one diabetic.  I can tell you that for most of the jobs that you have named you are right.   Diabetes will disqualify you.  I have researched this before  for others and it is true that the  military , , police and fire fighters are not allowed to have diabetes, because if you have a low you are not only  putting your self in danger but  others as well.I would suggest that you discuss with your school guidance counselor some other options that might be available to you that would be as important as these jobs. Like EMT, nurse doctor.I hope this helps.",
            "id": "2431957",
            "rank": 10
        },
        {
            "answer": "It's ok, these guys are all burn victims in real life, after attempted suicide.  So they're a bit jealous. :PBut other than that, thank you for responding (was just messing about the whole \"I hate my life\" thing :D.Actually, secret service or FBI does sound very interesting to me, problem is, is that I can't consult my high school counselor for a bit, but oh well.But in all seriousness, thank you, I really appreciate this information.",
            "id": "2436150",
            "rank": 10
        },
        {
            "answer": "To the person who doesnt think that he cant do anything because he has diabetes, thats wrong dont ever settle for anything less for your self, go do anything you want to do! im a firefighter and i have type 1 diabetes, so no one can tell you that you cant do something because you have diabetes!!",
            "id": "2436181",
            "rank": 1
        },
        {
            "answer": "This is to the 15-yr. old guy that wants to be a police officer..... what state are you in?  I'm 34 and developed type I when I was 14 from a flu virus. I'm in great shape and monitor my blood sugar regularly. I attended the police academy for 10 wks. and now I'm a full-time police officer currently, and attending SWAT training next month. And yes they knew in the academy I was diabetic, and at the police dept. also.l also scuba dive and have advanced certifications in this sport. I kayak, mtn. bike, workout, run 2-3 miles a day, and dare someone to tell me I can't function my job duties without a hitch.......I just have to work harder at my control, but it keeps my mind focused 100% of the time. Who whoever tells ( or tries to discriminate against you ) tell them to take a hike. You can do anything you well please provided you take excellent care of yourself.....that is the key.",
            "id": "2436194",
            "rank": 10
        },
        {
            "answer": "people who are saying diabetics are cripples and kill your self if you are a diabetic , let me just say that those people are FAGGOTS. I am a diabetic and have been since i was 4 years old and now i am 15. And i am hardly a cripple, i go to the gym everyday and play basketball just like everyBODY ELSE. I know that there are many diabetes will disqualify you for a few jobs such as a police officer, pilot etc. But dont let that discourage you, there is going to be a cure soon and you will be able to carry on with your dream job. They just dont let diabetics get accepted into jobs that require strenuous activity because a diabetic may have a low blood sugar and not be able to concentrate and continue in a very delicate position.Peace,Amo2007",
            "id": "2436238",
            "rank": 1
        },
        {
            "answer": "hi, im 15 too, and i have type 1 diabetics. Personally, I dont want to be in the Army, Police force etc. but i think its really unfair to discriminate against those whose dream it is to have these jobs. I see why they're concerned, but what the hell, if we have a hypo, we're gonna know and we're obviously not going to crash the plane, its called a co-pilot for gods sake. Ive had diabetes for 6 years and ive never had more than a mild hypo, and i bet lots of other people have had it for longer and also havent had one. Im very pleased to hear that some of these people have been able to be police officers and pilots, so go for it :)x",
            "id": "4481171",
            "rank": 10
        },
        {
            "answer": "Hey, I'm 16 years old and just found out two months ago that I'm diabetic. and Yes, That Is true. As a diabetic you cannot be in any branch of the army, a pilot, or police officer. I'm truly sorry that this happened to you. This disease really *****, I cried when I found out. :( but I just wanted to reply and let you know, you can talk to me sometime if you want!:)",
            "id": "5043315",
            "rank": 1
        },
        {
            "answer": "TacoLoverMatthew,I'm 27 and have had Type 1 for 26 years. I know how ya feel man. My dreams of being a Naval Aviator were crushed before they were even a dream. I can tell you from experience, it's not worth dwelling on for too long. And in most states and counties, you can be a police officer with diabetes. You can also be an EMT or a Fire Fighter as well. It took me a long time to figure out that just because the government wont allow me to do CERTAIN jobs, doesn't mean I can't do others. I wanted to be a Fighter pilot as a kid. I couldnt. So for ten years, I was a commercial aircraft mechanic. I come from a long family line of Navy officers. I felt like a dissappointment to my family because I couldn't join. My grandfather is a retired Navy Admiral. I wanted to be just like him. I was ashamed of what I was for a LONG time. Don't let diabetes stand in your way of greatness. Today, I'm a physical trainer, and I specialize in training people afflicted with Diabetes. We've come a long way since I was a kid. I used to get picked on, beat up, and bullied because of my disease. I didn't let people that were afraid of something they didn't understand, stand in my way. Rise above. If you can't join the military or be a pilot or a cop, maybe you should be the guy that fights for our right to do those things.",
            "id": "5502161",
            "rank": 1
        },
        {
            "answer": "I am 28 yrs old and was diagnosed with type 1 only a year ago. I was in flight school when I got the news and I had to give up that career choice because with type 1, I cannot hold anything greater than a 3rd class aviation medical which only allows me limited use with my pilot license. I moved to southern california recently to attend an air traffic controller program and after speaking with a doctor out of oklahoma city(the base for the FAA and all things aviation) i was discouraged from continuing in that field as well, but only because the FAA air traffic control facilities require their diabetic employees to maintain no less than 100 glucose at all times, check their sugar every 1-2 hours and record it in a log and the management is always trying to find ways of getting rid of those diabetics because they feel they are a danger to everyone in the sky. I also had my commercial drivers license taken away here in california when they found out i have diabetes. i also just recently tried becoming a donor for bone marrow, but was rejected because of the dependence on insulin.",
            "id": "5505759",
            "rank": 1
        },
        {
            "answer": "i am a diabetic myself and i wanted to become a secret service agent.Is it possible for me to do so?",
            "id": "6116483",
            "rank": 1
        },
        {
            "answer": "Unfortunately these disqualifications are true. I am a 18 year old type 1 diabetic and I had wanted to maybe be a pilot when I was your age, after finding out I couldnt pursue this dream I just started thinking about what I could do and now I'm majoring in Aerospace Engineering so I'll be designing planes rather than flying them.You can find a job similar to all of what you listed so keep for head up man",
            "id": "7109091",
            "rank": 1
        },
        {
            "answer": "I have helped dozens of people get jobs as police officers, firefighters, underwater welders, commercial drivers, private armed security forces, FBI, and a slew of other dangerous and difficult jobs. Call 1-800-DIABETES if you want information about what jobs you can do. I am glad to help.",
            "id": "12191742",
            "rank": 1
        },
        {
            "answer": "Hey TacoLoverMatthew, you can still be a police officer. I am a type one diabetic and was diagnosed 5 years ago. I am 14 though. Don&#39;t let this disease hold you back. You have to fight for what you want.",
            "id": "14220585",
            "rank": 10
        }
    ]
}