{
    "chebyshev": [
        {
            "answer": "I am a volunteer and the mom of a type one diabetic.  I know how you feel. We were in the same boat 7 years ago.  When our daughter was diagnosed, I thank god that we have caring people around that helped us with the expense as it was very expensive. There are a few things you can do.1. Contact you local department of social services.  Some states have programs that a help pay for your Childs needs.   We have a program in NY which helps pay co pays which goes according you income and insurance plan.2. They might also be able to tell you if your son will qualify for Medicaid as he has a disability and now falls under the American with disablities act.  When I had really bad coverage thru my job I was told that I could drop my daughter from my policy and she could go on Medicaid.3. Contact the pharmaceutical company that you are using and your doctor",
            "id": "2432786",
            "rank": 4
        },
        {
            "answer": "I have had diabetes ever since I was 9 and I had to recently file for bankruptcy because I owed $200,000 in medical bills. Health is just so expendsive.  I have health insurance now but it costs alot of money plus my medication costs me $500 a month. Wow right. I have to pay 50% co-pay.  This country needs to do something about the high price of health care.",
            "id": "2436865",
            "rank": 4
        },
        {
            "answer": "JDRF website has many details to help as does the ADA website.  Also, I would check with local governmental health agencies they might help.  Most hospitals will offer some type of payment plan as well.  Also try the PPA.  This is promoted by Montel Williams on TV and is a Precription Assistance Program.  I was in the ICU for 14 days and my bill was over $100K.  Thankfully I had really good insurance at work that covered most of it or I would have been in the same situation.One thing that might help a little bit is to get a prescription for some of the things that he does not NEED it for like a meter, test strips, lancets etc.  Even though these things do not HAVE to have a prescription if you can get one from your Dr. then they will be billed at the reduced insurance rate.  Also, many insurance companies and meter companies have programs that give away meters.  This is so that you will buy the supplies for it but hey a free meter is a free meter and you have to buy the supplies anyway right.Cut offs for income depend on the state and locality you are in I think.  Also remeber that medical expenses can be written off on your taxes so that might save you some too.Right now you feel overwhelmed but there is  an end in sight.  The worst is overwith and your son is alive :)",
            "id": "2436863",
            "rank": 4
        },
        {
            "answer": "I am concerned about the same.  My son is coming up on his one year anniversary.  He had just turned five when he was diagnosed.  We didn't worry about the bills the first few months.  We were just trying to adjust to our new lifestyle changes.  As would any of you, we will do what it takes to keep him healthy.  Our insurance will only cover a certain amount of test strips.  Even though our endocrinoligist has written a prescription for unlimited amounts, they refuse to pay for only a certain amount.  I do not understand how they can deny this very vital part of his care.  What do they think we are going to do with the strips.  He is young and extremely active.  We test him often, more than just at mealtime.  We are now trying mail order but the bills continue to be around $300 per order.  Is there any way to get past this hurdle with our insurance company?",
            "id": "2436868",
            "rank": 3
        },
        {
            "answer": "Part of the problem may be that the Dr. has written a prescription for unlimited test strips etc.  He/She needs to write one for a specific amount.  If your son tests 5-6 times a day he should write a prescription for say 200 strips a month and 200 lancets etc...  This would allow extra testing as necessary without running out.",
            "id": "2436869",
            "rank": 1
        },
        {
            "answer": "We have tried different amounts.  The nurse at the doctors office has contacted my insurance company personally and they are not willing to change their limit.  The insurance company has a limit on what they are willing to pay for.  This past summer, I made calls, my pharmacist did, and so did the endo. nurse.  I guess I need to try again.  It would sure help if we could just pay the copay for the strips.",
            "id": "2436873",
            "rank": 4
        },
        {
            "answer": "Wouldn't you think? That if Getting T1 is a Chronic disease and  it Is considered as a Disability, it would Automatically be covered under MEDICARE?IF not SSD? In wich in 2 yrs you would be covered Under Medicare..All we can do is? Keep Lobbying our Representatives and JDRF & ADA to add T1 to the list of Diseases to qualify to get Medicare..regardless of age..And FYI? To fully treat a T1? It cost Over $10,000/yr  without having any Complications..let alone any Hospital /ER visits..along the way..And a T1 needs to get a Job that will have Group Health and although The Law says you can't dscriminate, In the Real world, they are....And with People who smoke to being Obese being Fired, it's just around the corner T1' s and others with chornic diseases will be added..A National Health Plan is just a Diversion...We already have one, it's called Medicare and just has to be expanded. The PBS show , Think Tank discussed this and all it takes? Is just another 1.5% Medicare tax on payroll  to pay for it..ring that up to our Politians whilethey are in your state , running for Office and see what their response is...In meantime? Email, Fax and Write letters to your Reps..every Month!And those of you who DO have Health Insurance? You can loose it over nite and best have at least 1 yrs Cash savings on hand to pay your bills ...I've even know families moving to Canada... with having T1 or A child with T1..B",
            "id": "2436874",
            "rank": 2
        },
        {
            "answer": "My child 12yrs old Type 1  1- 1/2 yrs  has also had the \"insurance issues\". we had good insurance when he was first diagnoised and never had any problems. Went every month and picked up inslulin (Novalog and Lantus), strips (whatever doc. wrote which was 300 strips a month), needles, insulin pens, pen needles, etc.. Never any problem. My husband lost his job and now we did not have insurance. We qualified for Medicaid then. I do thank goodness that we did have something until my insurance kicked in at my job but that Medicaid was a headache. It did not pay for hardly anything, we had problems getting  every prescription filled each month. They  would not cover the Ultra One touch strips, they had an issue with the amount of strips, the amount of needles  etc..etc.. etc..  My son's school likes the insulin pen and getting the pen and the vial of Novalog was a test each time.They would only cover strips for the meter they would pay for (which was about the size of a large pocket calulator..huge). We had to have strips for us (us at home: and we test him alot), strips for the school and strips for the after school caregiver along with insulin  needles and this was an act of congress to get from Medicaid. I never had a problem with this with my husbands insurance. Oh and also glucogon kits along with meters for all too.  My son has skin  problems with his diabetes and we had problems getting the skin medication from Medicaid. Yes, Medicaid is a  good program but will wear you out getting the meds you need from them each time..  I watch CVS and Walgreens alot and they run sales and rebates on their diabetic meters. i have to have so many (4) that I have to do this to afford them. I just got 4 Contour meters for $9.99 each at CVS with the cash rewards rebate. Using mail order for the strips, needles, lancets is great. With my insurance I can get 3 months supply and only have to pay for 2 months. They deliver to your door, no standing in line at a pharmacy.",
            "id": "2436877",
            "rank": 4
        },
        {
            "answer": "on 2/21/08 i broke my leg so bad i can not put any wieght on it for 90 days after surger was on 3/4/08 i have no ins at all been unempoled for 4mo an wen i broke my leg my unempoledment stop what can i do about baying  for this i will be of work for 8 mo too 1yr. you can e-mail me at ***@****",
            "id": "2634817",
            "rank": 4
        },
        {
            "answer": "This is a super big problem!!!!!!! My son has had type 1 for 12 years, never had an admittance to a hospital since his diagnosis, but his medical bills are $2000 per month with supplies, pump, high blood pressure meds, cholesterol meds, etc.  We have been lucky with insurance so far picking up most of that, BUT he will not be able to be covered after he is 25.  This is a crisis.  I am going to study the above comments to look for answers.  Those of you who have newly diagnosed little ones, start saving and hold on to your hats.  We have felt very unprepared by our diabetes \"teams\" for the realities of the costs and the toll of the disease on the body even in well-controlled diabetes.  I guess we were naive and foolish enough to just hope for the best.",
            "id": "2638458",
            "rank": 4
        },
        {
            "answer": "I am a type 1 diabetic and have been for 18 years, I was diagnosed when I was 9 years old. Growing up I never have had the problems that I currently face with trying to get medicine month to month. This last June my 3 year old daughter was also diagnosed with type 1 diabetes (which was my worst nightmare for my kids to get it) and she has adapted very well to the change because she has to do the same thing that daddy has always done. When she was diagnosed we did not have insurance or anything of that matter, we were waiting untill open enrollment at work to apply. Now we have approximently $53,000 in medical bills that we cannot pay for. We have applied for MediCal and have been denied because we have too much property value (one vehicle worth $4,000) which puts us way over the limit to get coverage. Not only that when my wife spoke to the social worker and said how are we supposed to pay this her reply was \"Well, thats not my problem.\" What kind of state agencies are these? They are supposed to be helping people in need and they deny all of the hard working middle class people that pays all of the taxes, yet gives it to everyone that lies, cheats and steals! Does anyone know of any other agencies or programs that my be able to help other than social services? Currently we have been denied everything by the state. Is there not another helping hand?",
            "id": "3257827",
            "rank": 13
        },
        {
            "answer": "I am in a similar situation. I need Rottor Cuff surgery(I have 3 tears and one is really bad) I have no insurance, can't work, won't be able to work for 4-6 mos after the surgery.I was just denied any kind of assistance, even a bridge card, as I have a small IRA so I have too many assests. I still need to live. What's wrong with this country. If you find any organization that will help you PLEASE let me know. Good Luck with your search.",
            "id": "7873619",
            "rank": 4
        },
        {
            "answer": "I am a 61 year old lady, who for the most part has been healthy! My husband is 10 years younger has a real bad heart and diebties. Has had open heart surgery 2x, has 13 stents, and has has surgery to remove his toes and so on. He also has short term memoray lost. I take care of him in many ways. I no longer work in the work as of 2 years now. However  I have asthma and Copd and No I have not smoked for 45 years. But i just was in the ER for something wrong with my heart and double Phmona. I spent a week in hospital. My bill is 24,000.00 dollars not counting doctors and test and such. I am paying high deductible foe my husband co-pays and his medicine is so expensive, we have reach our limits for his Humman Medicare and we can not afford his diebetic meds such as Lantis, Levimer, Novalong just one is 500.00 dollars, I now have to be on heart medicaine to control the beats and angina. I can not pay for his meds and mine one of mine is 114.00, 200.00 . We have tryed to get help for just his deibetic meds which he can not be with out. Why is it work work hard all of our life and now at the end of our lives we can not even get help after we have paid in all these years. Every one that does not belong here gets every thing for help and the people Who worked hard so they could live a comfortable in their senoir years can not get help, My husband is disabled we live off his disablity.Which he pad for the insurance when he worked all those years. I need help for my self and to get his meds. I have work since I was 10 years old, some times 2 jobs as well as my husband! So tell me why no one wants to help us. Like Medicaid or other orginzation? We live in a Rv and have since my husband got sit and  we losted every thing we had. I work my butt off but could not pay all that was owed. If any one can direct me to a website or some one to help. Please reply to this, Thank you so much for any help you have. Pepper77",
            "id": "8934036",
            "rank": 4
        }
    ],
    "votes": [
        {
            "answer": "I am a volunteer and the mom of a type one diabetic.  I know how you feel. We were in the same boat 7 years ago.  When our daughter was diagnosed, I thank god that we have caring people around that helped us with the expense as it was very expensive. There are a few things you can do.1. Contact you local department of social services.  Some states have programs that a help pay for your Childs needs.   We have a program in NY which helps pay co pays which goes according you income and insurance plan.2. They might also be able to tell you if your son will qualify for Medicaid as he has a disability and now falls under the American with disablities act.  When I had really bad coverage thru my job I was told that I could drop my daughter from my policy and she could go on Medicaid.3. Contact the pharmaceutical company that you are using and your doctor",
            "id": "2432786",
            "rank": 11
        },
        {
            "answer": "I have had diabetes ever since I was 9 and I had to recently file for bankruptcy because I owed $200,000 in medical bills. Health is just so expendsive.  I have health insurance now but it costs alot of money plus my medication costs me $500 a month. Wow right. I have to pay 50% co-pay.  This country needs to do something about the high price of health care.",
            "id": "2436865",
            "rank": 11
        },
        {
            "answer": "JDRF website has many details to help as does the ADA website.  Also, I would check with local governmental health agencies they might help.  Most hospitals will offer some type of payment plan as well.  Also try the PPA.  This is promoted by Montel Williams on TV and is a Precription Assistance Program.  I was in the ICU for 14 days and my bill was over $100K.  Thankfully I had really good insurance at work that covered most of it or I would have been in the same situation.One thing that might help a little bit is to get a prescription for some of the things that he does not NEED it for like a meter, test strips, lancets etc.  Even though these things do not HAVE to have a prescription if you can get one from your Dr. then they will be billed at the reduced insurance rate.  Also, many insurance companies and meter companies have programs that give away meters.  This is so that you will buy the supplies for it but hey a free meter is a free meter and you have to buy the supplies anyway right.Cut offs for income depend on the state and locality you are in I think.  Also remeber that medical expenses can be written off on your taxes so that might save you some too.Right now you feel overwhelmed but there is  an end in sight.  The worst is overwith and your son is alive :)",
            "id": "2436863",
            "rank": 1
        },
        {
            "answer": "I am concerned about the same.  My son is coming up on his one year anniversary.  He had just turned five when he was diagnosed.  We didn't worry about the bills the first few months.  We were just trying to adjust to our new lifestyle changes.  As would any of you, we will do what it takes to keep him healthy.  Our insurance will only cover a certain amount of test strips.  Even though our endocrinoligist has written a prescription for unlimited amounts, they refuse to pay for only a certain amount.  I do not understand how they can deny this very vital part of his care.  What do they think we are going to do with the strips.  He is young and extremely active.  We test him often, more than just at mealtime.  We are now trying mail order but the bills continue to be around $300 per order.  Is there any way to get past this hurdle with our insurance company?",
            "id": "2436868",
            "rank": 1
        },
        {
            "answer": "Part of the problem may be that the Dr. has written a prescription for unlimited test strips etc.  He/She needs to write one for a specific amount.  If your son tests 5-6 times a day he should write a prescription for say 200 strips a month and 200 lancets etc...  This would allow extra testing as necessary without running out.",
            "id": "2436869",
            "rank": 1
        },
        {
            "answer": "We have tried different amounts.  The nurse at the doctors office has contacted my insurance company personally and they are not willing to change their limit.  The insurance company has a limit on what they are willing to pay for.  This past summer, I made calls, my pharmacist did, and so did the endo. nurse.  I guess I need to try again.  It would sure help if we could just pay the copay for the strips.",
            "id": "2436873",
            "rank": 1
        },
        {
            "answer": "Wouldn't you think? That if Getting T1 is a Chronic disease and  it Is considered as a Disability, it would Automatically be covered under MEDICARE?IF not SSD? In wich in 2 yrs you would be covered Under Medicare..All we can do is? Keep Lobbying our Representatives and JDRF & ADA to add T1 to the list of Diseases to qualify to get Medicare..regardless of age..And FYI? To fully treat a T1? It cost Over $10,000/yr  without having any Complications..let alone any Hospital /ER visits..along the way..And a T1 needs to get a Job that will have Group Health and although The Law says you can't dscriminate, In the Real world, they are....And with People who smoke to being Obese being Fired, it's just around the corner T1' s and others with chornic diseases will be added..A National Health Plan is just a Diversion...We already have one, it's called Medicare and just has to be expanded. The PBS show , Think Tank discussed this and all it takes? Is just another 1.5% Medicare tax on payroll  to pay for it..ring that up to our Politians whilethey are in your state , running for Office and see what their response is...In meantime? Email, Fax and Write letters to your Reps..every Month!And those of you who DO have Health Insurance? You can loose it over nite and best have at least 1 yrs Cash savings on hand to pay your bills ...I've even know families moving to Canada... with having T1 or A child with T1..B",
            "id": "2436874",
            "rank": 11
        },
        {
            "answer": "My child 12yrs old Type 1  1- 1/2 yrs  has also had the \"insurance issues\". we had good insurance when he was first diagnoised and never had any problems. Went every month and picked up inslulin (Novalog and Lantus), strips (whatever doc. wrote which was 300 strips a month), needles, insulin pens, pen needles, etc.. Never any problem. My husband lost his job and now we did not have insurance. We qualified for Medicaid then. I do thank goodness that we did have something until my insurance kicked in at my job but that Medicaid was a headache. It did not pay for hardly anything, we had problems getting  every prescription filled each month. They  would not cover the Ultra One touch strips, they had an issue with the amount of strips, the amount of needles  etc..etc.. etc..  My son's school likes the insulin pen and getting the pen and the vial of Novalog was a test each time.They would only cover strips for the meter they would pay for (which was about the size of a large pocket calulator..huge). We had to have strips for us (us at home: and we test him alot), strips for the school and strips for the after school caregiver along with insulin  needles and this was an act of congress to get from Medicaid. I never had a problem with this with my husbands insurance. Oh and also glucogon kits along with meters for all too.  My son has skin  problems with his diabetes and we had problems getting the skin medication from Medicaid. Yes, Medicaid is a  good program but will wear you out getting the meds you need from them each time..  I watch CVS and Walgreens alot and they run sales and rebates on their diabetic meters. i have to have so many (4) that I have to do this to afford them. I just got 4 Contour meters for $9.99 each at CVS with the cash rewards rebate. Using mail order for the strips, needles, lancets is great. With my insurance I can get 3 months supply and only have to pay for 2 months. They deliver to your door, no standing in line at a pharmacy.",
            "id": "2436877",
            "rank": 1
        },
        {
            "answer": "on 2/21/08 i broke my leg so bad i can not put any wieght on it for 90 days after surger was on 3/4/08 i have no ins at all been unempoled for 4mo an wen i broke my leg my unempoledment stop what can i do about baying  for this i will be of work for 8 mo too 1yr. you can e-mail me at ***@****",
            "id": "2634817",
            "rank": 1
        },
        {
            "answer": "This is a super big problem!!!!!!! My son has had type 1 for 12 years, never had an admittance to a hospital since his diagnosis, but his medical bills are $2000 per month with supplies, pump, high blood pressure meds, cholesterol meds, etc.  We have been lucky with insurance so far picking up most of that, BUT he will not be able to be covered after he is 25.  This is a crisis.  I am going to study the above comments to look for answers.  Those of you who have newly diagnosed little ones, start saving and hold on to your hats.  We have felt very unprepared by our diabetes \"teams\" for the realities of the costs and the toll of the disease on the body even in well-controlled diabetes.  I guess we were naive and foolish enough to just hope for the best.",
            "id": "2638458",
            "rank": 1
        },
        {
            "answer": "I am a type 1 diabetic and have been for 18 years, I was diagnosed when I was 9 years old. Growing up I never have had the problems that I currently face with trying to get medicine month to month. This last June my 3 year old daughter was also diagnosed with type 1 diabetes (which was my worst nightmare for my kids to get it) and she has adapted very well to the change because she has to do the same thing that daddy has always done. When she was diagnosed we did not have insurance or anything of that matter, we were waiting untill open enrollment at work to apply. Now we have approximently $53,000 in medical bills that we cannot pay for. We have applied for MediCal and have been denied because we have too much property value (one vehicle worth $4,000) which puts us way over the limit to get coverage. Not only that when my wife spoke to the social worker and said how are we supposed to pay this her reply was \"Well, thats not my problem.\" What kind of state agencies are these? They are supposed to be helping people in need and they deny all of the hard working middle class people that pays all of the taxes, yet gives it to everyone that lies, cheats and steals! Does anyone know of any other agencies or programs that my be able to help other than social services? Currently we have been denied everything by the state. Is there not another helping hand?",
            "id": "3257827",
            "rank": 1
        },
        {
            "answer": "I am in a similar situation. I need Rottor Cuff surgery(I have 3 tears and one is really bad) I have no insurance, can't work, won't be able to work for 4-6 mos after the surgery.I was just denied any kind of assistance, even a bridge card, as I have a small IRA so I have too many assests. I still need to live. What's wrong with this country. If you find any organization that will help you PLEASE let me know. Good Luck with your search.",
            "id": "7873619",
            "rank": 1
        },
        {
            "answer": "I am a 61 year old lady, who for the most part has been healthy! My husband is 10 years younger has a real bad heart and diebties. Has had open heart surgery 2x, has 13 stents, and has has surgery to remove his toes and so on. He also has short term memoray lost. I take care of him in many ways. I no longer work in the work as of 2 years now. However  I have asthma and Copd and No I have not smoked for 45 years. But i just was in the ER for something wrong with my heart and double Phmona. I spent a week in hospital. My bill is 24,000.00 dollars not counting doctors and test and such. I am paying high deductible foe my husband co-pays and his medicine is so expensive, we have reach our limits for his Humman Medicare and we can not afford his diebetic meds such as Lantis, Levimer, Novalong just one is 500.00 dollars, I now have to be on heart medicaine to control the beats and angina. I can not pay for his meds and mine one of mine is 114.00, 200.00 . We have tryed to get help for just his deibetic meds which he can not be with out. Why is it work work hard all of our life and now at the end of our lives we can not even get help after we have paid in all these years. Every one that does not belong here gets every thing for help and the people Who worked hard so they could live a comfortable in their senoir years can not get help, My husband is disabled we live off his disablity.Which he pad for the insurance when he worked all those years. I need help for my self and to get his meds. I have work since I was 10 years old, some times 2 jobs as well as my husband! So tell me why no one wants to help us. Like Medicaid or other orginzation? We live in a Rv and have since my husband got sit and  we losted every thing we had. I work my butt off but could not pay all that was owed. If any one can direct me to a website or some one to help. Please reply to this, Thank you so much for any help you have. Pepper77",
            "id": "8934036",
            "rank": 1
        }
    ]
}