{
    "answers": [
        {
            "answer": "see<A HREF=\"http://www.medhelp.org/perl6/gastro/archive/4601.html/\">GIForum</A>",
            "post_id": "677790",
            "timestamp": "1141365600",
            "user_id": "user_4336",
            "user_link": "/personal_pages/user/4336",
            "votes": "0"
        },
        {
            "answer": "I don't know too much but I know my mother tested very high in the Alkaline Phosphatase numbers as well.  I googled it and found out that it CAN mean that there are serious problems with your liver.The alk phos is a liver enzyme that is monitored for us with HepC but I don't really know why.Read the link above and try googling high alkaline phosphatase (however you spell it).  My mom REFUSES to do anything about it saying \"I'm 65 I'll die soon enough anyway what I don't know won't hurt me\". I am NOT of that club and think all problems should be looked into.But that's just me.Best of luck",
            "post_id": "677804",
            "timestamp": "1141365600",
            "user_id": "user_101369",
            "user_link": "/personal_pages/user/101369",
            "votes": "0"
        },
        {
            "answer": "The link won't work so here it is:http://www.medhelp.org/perl6/gastro/archive/4601.htmlMike",
            "post_id": "677808",
            "timestamp": "1141365600",
            "user_id": "user_4336",
            "user_link": "/personal_pages/user/4336",
            "votes": "0"
        },
        {
            "answer": "I apologize in advance for breaking in on this thread & I am hoping that Jim will catch this.Jim-this is a quick synopsis of my treatment, discussed on Wed.F,1B with possible viremia,lobular inflammation-2, portal inflammation-3, fibrosis-4. (Starting weight 225.)This is ok since I am 7ft. tall!!!!Unfortunately when I was diagnosed In Jan. 02, I panicked & my only thoughts were to get rid of this disease asap. I was advised to see a top Gastro in Orl., without doing any research on the disease or Doctor. This was my first big mistake.I was placed on a wait-list for Peg-Intron/Riba & started therapy in 9/02, .5 peg,1200 Riba. The meds were reduced one mth. later to 2.5 Peg, 800 Riba, for 7 weeks, due to sides.They were then increased to .5 peg, 800 Riba. Sides were horrendous, resulting in 2 ER visits (dehydration& ears), & 2 units of blood in 7/03. This Gastro offered no help and his standard answer was \"I havae never heard of this happening.\" I finished this therapy on 8/03.(48 wks.) I showed undetectable in 12/02 & throughout the remaining mths. my VL & enzymes fluctuated terribly.I was considered a non-responder & then a relapser.By 10/03, the Hep C was back at 5,280,000. I took a break, and researched, found a Hep C Specialist,won an insurance appeal and I was ready to go again. This time much more informed.I started Infergen .5 daily and 1200 Riba. At 12 weeks my VL was 360, and then I showed 6 consecutive non-deductibles.Sides were just as bad, resulting in 8 falls. (luckily, I had enough cushioning, that I didn't break every bone in my body) My Hep C Specialist gave me everything in the world to help me get through this, as well as his strong support. Thinking I was clear, my family whisked me away to N.C. for some R&R.I felt good for 3 wks. & then my body told me something was wrong. On 8/5, my VL was 12,300,000 & enzymes rising. Back Again.I was put on Pegasys Maintainence at this point for 6 wks, .4 per wk. Again here came the sides. Back to the Doctor and my VL was 30,200,000 and you guessed it back on maintainence, where I am today.I have no stamina, fatigued all the time, sore mouth, etc. My main concern at this point is that my feet & legs go numb, without any warning.I have been to a Neurologist, carpal tunnel-can you believe? I saw an Orthopedic Surgeon on 2/03/06, who diagnosed it as a back problem. MRI's done. On 2/28/06, I received a cortisone injection in my left knee-did nothing. I was then referred to see a Neuorosurgeon, which I will see on 3/8/06. It appears that from X-Rays, I have degenerative canal stenosis, which means that I have narrowing of the lumbar spinal column, that produces pressure on the nerve roots resulting in sciata & inadequate blood supply to the muscles.HaveI had this all along or is this the effects of theinterferon? Who knows?My Hep C Doctor is speaking with Dr. Schiff at U.of FL., & has forwarded all info there including biopsy slides for him to evaluate and see if I am a candidate for the 2nd. round of VX-950.Can my body tolerate this-I am not sure, but willing to try.I hope I have covered everything, if not, let me know. Hang in there. Sandy",
            "post_id": "677819",
            "timestamp": "1141365600",
            "user_id": "user_89190",
            "user_link": "/personal_pages/user/89190",
            "votes": "0"
        },
        {
            "answer": "Thanks for the treatment synopsis. I'm sorry you're having to go through all this, but it's obvious you're a real fighter, and in the end, that's what will get you through all this. Dr. Schiff has an excellent reputation and sounds like consulting with him is right next step. Please let us know what he says. Fortunately, there's a lot of new stuff on the horizon so if one thing doesn't work, hopefully there soon will be others. Your treatment journey and eventual SVR will be in my prayers.-- Jim",
            "post_id": "677823",
            "timestamp": "1141365600",
            "user_id": "user_90290",
            "user_link": "/personal_pages/user/90290",
            "votes": "0"
        },
        {
            "answer": "Hi! my alkaline phosphatase was the only enzyme that used to be slightly elevated.  The way it was explained to me: this enzyme indicated duct blockage- or is more associated with transport through, than cell damage within, tissues....... Like I said, my was always just a little high, two biopsies, no damage, chronic inflammation consistent with hep C: mild triaditis.  Hope that at least lessens the anxiety until you can do the catch up reading!!",
            "post_id": "677830",
            "timestamp": "1141365600",
            "user_id": "user_101931",
            "user_link": "/personal_pages/user/101931",
            "votes": "0"
        },
        {
            "answer": "I read a post below that you mentioned we were not supposed to take antacids? I have taken them on tx and did not know this. Could you explain why?Thanks",
            "post_id": "677870",
            "timestamp": "1141365600",
            "user_id": "user_86295",
            "user_link": "/personal_pages/user/86295",
            "votes": "0"
        },
        {
            "answer": "I was just tested for hemachromatosis with the rest of the bloodwork, because its genetic and may brother has it.  Call it iron overload disease, they do not properly store and metabolise iron, so they sequester it in the internal organs.  Good news is all you have to do is bleed a pint or so every so often... good old fashioned bloodletting.  Evidently its controled by two separate genes, and of those I only had one bad out of four alleles (variations of the same gene), so I am ok, but both my boys need to be tested.  Literature with the test said it was the most common  genetic disorder- 1 out of 10 are carriers..........so many ways for our bodies to get screwed up, so little time...",
            "post_id": "677871",
            "timestamp": "1141365600",
            "user_id": "user_101931",
            "user_link": "/personal_pages/user/101931",
            "votes": "0"
        },
        {
            "answer": "Really sorry your having such a tough time. I had brought hemachromotosis up with my doc (and here)a while back because the uncle that I work with has it. He goes for a phlebotomy? once a month, pretty routine he says, no big deal. My doc tested me, said I was okay(we can have the gene but not necesarrily have a problem). When I did some googles on it and tx there seemed to be the usual randomness, (just going from memory)some said tx could be more difficult, others said with proper care and monitoring tx could go fine. Best thoughts to you, let us know how it goes,Don",
            "post_id": "677876",
            "timestamp": "1141365600",
            "user_id": "user_102297",
            "user_link": "/personal_pages/user/102297",
            "votes": "0"
        },
        {
            "answer": "Interferon has a way of making little things, that were very minor before tx, become very intense and painful problems, after tx.  It also seems to create some new problems from scratch, on its own, in many of us.  The neurological problems you are experiencing sound like what some post-tx'ers on the forum have described, with the numbness and lack of feeling.The back and spine related issues seem to have either been greatly exacerbated by tx in your case, or possibly directly caused by tx.  If it was not a noticable problem before tx, then I think you can be assured it did not just coincidentally begin after tx for no reason.  Some would tell you that it is aging, but the odd thing seems to be that all of these nasty symptoms of aging all seem to come right after completing tx with interferon.  There are plenty of documented cases of issues like yours coming after tx, and even the warnings on the interferon packages point to the possibility of these kinds of problems.Hopefully, with time, and possible some sort of adjunct treatment, your symptoms will fade away, or at least become more tolerable.  I wrestle with many of the same symptoms, post-tx, and I am SVR!.Best wishes to you.DoubleDose",
            "post_id": "677832",
            "timestamp": "1141365600",
            "user_id": "user_50772",
            "user_link": "/personal_pages/user/50772",
            "votes": "0"
        },
        {
            "answer": "pulled off meds again!! am off the peg, riba,procrit, neup until Dr consults with hematologist. have 9 wks to go out of 24, third time i've been pulled off in 9 months. wbc 1.8, hgb 9.1, hct 27, neut 714. NP keeps talking about procrit antibodies....and iron levels are through the roof. there was some discussion a few months back about hemachromotosis. i don't remember how that affectd treatment, does anyone remember who was dealing with it? have not been diaganosed with that yet, but lab values seem to fit. will see what next week bringsNY...you're right, the two of us together would equal one. to be honest i didn't mind losing a few lbs, is always nice to weigh the same at 50 as one did in high school, lol. altho, with new eating habits, after treatment is completed, we will weigh far more than we bargained for in no time.warmest wishes to alllorrie",
            "post_id": "677861",
            "timestamp": "1141365600",
            "user_id": "user_88812",
            "user_link": "/personal_pages/user/88812",
            "votes": "0"
        },
        {
            "answer": "Jim-I will fight and I will win, as long as the good Lord is willing. I have been off work for over a year & I want and need to return. Thankfully, I work for Orlando Regional Healthcare Systems / M. D.Anderson Cancer Treatment Center.In April we are opening the Winnie Palmer Hospital for Babies and Mothers & that is where my focus is presently. I am a Donor Development Officer (fancy name for a fund-raiser). My job is so rewarding-their is not a day that goes by that I know that I did something good for someone in need. That's what life is all about.Where are you at in therapy? I thought I had read somewhere that you were close to being finished? Also, that you are from Indiana? Thanks for the prayers Jim, I am a firm believer that alot of prayers are answered. You will be included in mine.Doubledose-I agree with you & it is so very frustrating. My family wants me to quit on the interferons, as like everyone else, it has played havoc with my life. In all probability the falls which I incurred are probably the lumbar issues. Does the name \"Doubledose\", mean that you have gone through  therapy twice -or did you take a mega-size dose? How long have you been off meds? Congratulations on your achievement! I feel like we should get some kind of reward like we did in grade school-on a much bigger scale!The bikes are rolling here at the beach. It is the first day of Biketoberfest. Good for them, If I reach svr, I might join them. Thanks for listening and the comments, and I hope to hear from you & Jim again.",
            "post_id": "677885",
            "timestamp": "1141365600",
            "user_id": "user_89190",
            "user_link": "/personal_pages/user/89190",
            "votes": "0"
        },
        {
            "answer": "My iron and feritin are very high - as a result of tx. My docs aren't worried at all - say we'll look again in a few months, after tx. I'm on 60,000 procrit weekly. Your situation may be quite different, but thought this might give perspetive.",
            "post_id": "677891",
            "timestamp": "1141365600",
            "user_id": "user_92903",
            "user_link": "/personal_pages/user/92903",
            "votes": "0"
        },
        {
            "answer": "I live near Orlando and went through 2 Drs. here before getting on a plane and going to NY for treatment.  The Dr. in NY has been my families GI specialist for years and I also knew he was one of the best Hep Drs. in the country.  I'm really glad I made that choice, if I didn't the Drs. down here would have pulled me off the meds by now.  As it stands now after tomorrow I'll have 14 shots to go.I hope every thing works out for you, and you'll be able to return to work soon.Bob",
            "post_id": "677924",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "Good morning,I read the same thing in the paper work that comes with the meds. My doc said I can have maalox,the brain fog sets in and now I can't remember why we can't  have the other antacids.  Guess another riba day is here.Beagle",
            "post_id": "677916",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "My HGB is at 8.7 and holding.  Tues. I'll find out if it went up any and if they need to increase the procrit again, I hope they don't need to yet as I'm leaving NY where I'm treating to go home to Fl. for 6 days.  Tomorrow is # 10 for me with 14 to go.  How much procrit were you on?  Just wondering why they pulled you off, all they had to do was take a pint of blood from you to prevent iron over load.I have Thalassemia anemia, it runs in families.  The norm for my HGB is around 11.0 but I can't take iron because it will turn to iron over load yet the procrit is fine to have.What will the Dr. do now?Beagle",
            "post_id": "677917",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "I'm approaching week 54 of treatment and plan to stop relatively soon. In fact, if my psoriasis and upper respiratory symptons start acting up much more, this could be my last week -- I'm sort of playing it by ear.I hope things work out for you and that you'll soon be able to retutn to your job. It must be wonderful to have a profession where you are able to impact people's lives on a daily basis.The only time I've \"lived\" in Indiana was for 12-hour period in the back seat of a car during the Indy 500 Race when I was a teenager :)All the best,-- Jim",
            "post_id": "677918",
            "timestamp": "1141452000",
            "user_id": "user_90290",
            "user_link": "/personal_pages/user/90290",
            "votes": "0"
        },
        {
            "answer": "Last sentence in first paragraph more accurately should have read: \"I'm sort of playing it by ear, nose and throat.\" :)",
            "post_id": "677923",
            "timestamp": "1141452000",
            "user_id": "user_90290",
            "user_link": "/personal_pages/user/90290",
            "votes": "0"
        },
        {
            "answer": "thanks for your comments...i don't seem to be stressed about this (unusual for me)...it's just 1 more cog in the wheel. hope they don't start talking phelebotmies just yet...with my H_H so low, will have no blood left!!!!!hope everyone has a good weekendlorrie",
            "post_id": "677907",
            "timestamp": "1141452000",
            "user_id": "user_88812",
            "user_link": "/personal_pages/user/88812",
            "votes": "0"
        },
        {
            "answer": "One more comment, if you're interested. My blookwork looks about like yours, and this is my best month in a while. I continue on full dose tx - actually I did drop one riba pill last week, to 1,000 for 163 lbs. My iron is abot twice normal range and my feritin is so high I don't want to bother looking it up. Based on my experience, I don't see why you can't finish up your 24 weeks if you feel up to it. I'm on wk 24/26 and taking Neupogen and Procrit. Maybe you can push for a consult ASAP so you don't miss many doses.",
            "post_id": "677926",
            "timestamp": "1141452000",
            "user_id": "user_92903",
            "user_link": "/personal_pages/user/92903",
            "votes": "0"
        },
        {
            "answer": "snook--- Congratulations! on getting the position you wanted. You must feel great and free now that this is behind you and you didn't have to lie. This is a lesson for all of us here on how to apply for a job and how to answer the question if you ever had Hep C.Great news,Bob",
            "post_id": "677928",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "This brain fog is getting bad.  You said 24/26 weeks:Are you treating for 26 weeks because your a 2? And you said you were on both procrit and neupogen, Why both and how did it help you?Bob",
            "post_id": "677929",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "In answer to Bailey's questions:I'm a 3a, stage 4. I initially planned to go 48, but when I cleared at week 4 and the shorter tx data was coming out, we revisited that call. We decided that as long as tx wasn't being too hard on me, I should go 6 months. When that time came close, we decided to call 6 mos 26 weeks, rather than 24 for a little more cush.I'm on procrit for anemia and Neupogen for low ANC. Those drugs allowed my to stay at full dose, where I wouldn't have otherwise.",
            "post_id": "677932",
            "timestamp": "1141452000",
            "user_id": "user_92903",
            "user_link": "/personal_pages/user/92903",
            "votes": "0"
        },
        {
            "answer": "You said you take neupogen for low ANC:  I can't find it on my blood test, What is it and what's considered low?Thanks,Bob",
            "post_id": "677938",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "In simple terms, ANC is another measurement of White Blood Cells, or WBC. Generally, I think WBC above 1.5 or so is in the comfort zone.",
            "post_id": "677945",
            "timestamp": "1141452000",
            "user_id": "user_92903",
            "user_link": "/personal_pages/user/92903",
            "votes": "0"
        },
        {
            "answer": "thanks, I will read the paper work and see if I can find it. I see the Dr. next week and will ask. Like I said I have been using it, hope it hasn't contributed to the sides.",
            "post_id": "677946",
            "timestamp": "1141452000",
            "user_id": "user_86295",
            "user_link": "/personal_pages/user/86295",
            "votes": "0"
        },
        {
            "answer": "Goof--- Thanks, that's what I thought but wasn't sure.  I see mine are within range.Wondering---I don't think it would contribute to your sx's. But I think it can interfere with how the riba works.  But check the paper work and I'm sure someone will come on who has the asnwer.  Let me know if you find out.Bob",
            "post_id": "677949",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "I don't know about your iron levels, but the rest of those numbers look OK.If it were me, I'd start calling around Monday for an emergency appointment with another hepatologist at one of the larger teaching hospitals in your area.Meanwhile, why don't you email your numbers, including your Iron and Ferritin levels , over to Dr. Dieterich athttp://www.thebody.com/Forums/AIDS/Hepatitis/Bottom line, the longer you stay off the treatment drugs, the less chance you have at eventual success.-- Jim",
            "post_id": "677961",
            "timestamp": "1141452000",
            "user_id": "user_90290",
            "user_link": "/personal_pages/user/90290",
            "votes": "0"
        },
        {
            "answer": "Sorry I didn't get back to you I hadn't been back on line yet.I don't know exactly WHY we aren't supposed to take the antacids but I know we are not. That is why I became and ice cream addict - it helped since I couldn't take the Tums anymore and I find during treatment my stomach is always feeling real ageda (don't know how to spell that exactly LOL).I probably should try and look it up and find out but I guess whatever is in them might counteract something in our meds. I never asked the doctor why I just wrote it down on my pads of notes when I started.I hope you are feeling better. Remember ice cream...in all it's billions of flavors and colors - is a very fun way to replace the antacids hee hee.  Plus...if you are like some of us who have lost too much weight - it helps with that (that's my good excuse)Of course Rocker doesn't like using so many dairy products and has advised me to use low fat and yogurt...they help too.",
            "post_id": "677975",
            "timestamp": "1141452000",
            "user_id": "user_101369",
            "user_link": "/personal_pages/user/101369",
            "votes": "0"
        },
        {
            "answer": "Thanks for the explanation, now I know! I like you love ice cream it has always been part of my daily ritual. I guess I will just have to start eating more. Just started week 25 last night and I fortunately have not lost any weight. Appetite has been good. Again thanks to you and all who make this forum great. I learn so much here.",
            "post_id": "677985",
            "timestamp": "1141452000",
            "user_id": "user_86295",
            "user_link": "/personal_pages/user/86295",
            "votes": "0"
        },
        {
            "answer": "lorrie - not again.  I just don't see that your bloodwork is all that bad.  My WBC stays about 1.5, my ANC about .6. Now my hgb is higher - about 11.5 and so is the hct -- but still, it does seem that you should push to complete the 9 more weeks.  Perhaps the high iron levels are the cause of the stop and I don't know much about hemocromatosis except that it is a iron buildup.  I agree with Goof and Jim to try to get a consult with other doctors as soon as you can.   Good luck   (you had a PCR in December didn't you - what is the vl)    kathybob -- on you CBC look for \"NE#\" - this how absolute neutrophils are stated on my CBC.  \"NE%\" is the percent that the neutrophils are of the total white blood cells.",
            "post_id": "677996",
            "timestamp": "1141452000",
            "user_id": "user_91430",
            "user_link": "/personal_pages/user/91430",
            "votes": "0"
        },
        {
            "answer": "The dr. told me to take maalox but not till 2 hours before or 2 hours after riba, he said that's safe.  I should have posted that, but forgot to.BB",
            "post_id": "678004",
            "timestamp": "1141452000",
            "user_id": "user_111966",
            "user_link": "/personal_pages/user/111966",
            "votes": "0"
        },
        {
            "answer": "I googled it and it makes sense it DOES affect the ability of the Ribavirin to be absorbed and work apparently. Mr. BBB I think this would also mean Maalox as well - check with the doctor.Some precipitant drugs bind with object drugs in the stomach or the intestine and inhibit their ability to be absorbed into your bloodstream. For example, if you take the antibiotic ciprofloxacin with most antacids, the combination will dramatically reduce the amount of antibiotic getting into your bloodstream.If you are taking ribavirin capsules, tell your doctor if you are taking antacids. Your doctor may need to change the doses of your medications or monitor you carefully for side effects.This includes antacids containing aluminum or magnesium or products that contain simethicone. Patients with hiv infection taking stavudine or zidovudine should talk with their doctor or pharmacist before using ribavirin. The effectiveness of these medicines against hiv may be reduced when given with ribavirin.Ribavirin + Antacids. The UK makers of ribavirin note that there was a minor 14% decrease in the AUC of ribavirin when it was given with an antacid ...Antacid. The bioavailability of ribavirin 600 mg was decreased by co-administration with an antacid containing magnesium, aluminium and methicone; ...That all came from a bunch of different sources and I could probably print up another 100 of them but it's enough to show why we CANT take them.",
            "post_id": "677998",
            "timestamp": "1141452000",
            "user_id": "user_101369",
            "user_link": "/personal_pages/user/101369",
            "votes": "0"
        },
        {
            "answer": "thanks for all your comments. word is i will get a call on monday and find out what's happening.  i did try to make my point  but she was very firm..i think because the 40000 procrit never worked and the iron was so high. but maybe....she did mention the wbc's.  the neup lasts me 3 days only, was taking it twice a week and was sure to get labs on 6th day. last week, lab was on 7th day.  as a matter of fact, when i switched to this doc, we discussed just that. i agree with you all, my numbers are better than some.  had a pcr in feb..undetectable.will give them til lunchtime monday, then will start bugging them.of course the thought is always there to just continue onward, but that's probably not a good idea, lol.  could have PCP intervene, he knows me better. for pete's sake, i've been working!!! how bad can it be?",
            "post_id": "678002",
            "timestamp": "1141452000",
            "user_id": "user_88812",
            "user_link": "/personal_pages/user/88812",
            "votes": "0"
        },
        {
            "answer": "You can take antacids on treatment, but if you don't want to compromise ribavirin absorption, you have to allow a window (2-3 hours?) between the riba and the antacids -- probably err on adding time if they contain aluminum or magnesium which I believe drugs like Gaviscon might. Similar precautions should also be taken with flax (and possibly similar products like Metamuscil) as they also can interfere with drug absorption.Depending on your symptons, a better choice than antacids might be prescption PPI's such as Nexium, Priolosec, etc, or a class of drugs called histamine receptor antagonists such as Zantac which can now be found OTC. Both these drug classes can be taken with riba with no problems as they operate on a different principle than antacids.  They are also generally considered more effective for serious reflux or GERD.-- Jim",
            "post_id": "678003",
            "timestamp": "1141452000",
            "user_id": "user_90290",
            "user_link": "/personal_pages/user/90290",
            "votes": "0"
        },
        {
            "answer": "you did not metion what your drs did to help with the weakness, Did they give you Procrit? those falls could have been caused by the dizziness anemia can bring, and they might have contributed to your back problems. Falls, time, and normal changes in our bodies, coupled with the effects of the medications can all be contributors to spinal degenerative changes.\"Low back pain resulting from degenerative disease of the lumbosacral spine is a major cause of morbidity, disability and lost productivity. Up to 90 percent of the U.S. population may have significant low back pain at some point.1 In 1984, it was estimated that over 5 million persons were incapacitated as a result of lower back pain.\"The blessed back pain has become part of our lives.our immune reaction to hcv,  causes inflammation in the liver and other parts of our bodies, it seems. Plus the inflammatory property of external interferon in some folks, might be too much and it irritates existing conditions and accelerate others. We all are speculating and guessing, as no one really knows what is at work.I have a friend who developed Carpal syndrome that went away after tx, I had it before, during and after tx, as well as the herniated discs. At least my bone density test was good. I hope you find the proper mix of medications and interventions to alleviate your most troubling symptoms.",
            "post_id": "678009",
            "timestamp": "1141452000",
            "user_id": "user_29231",
            "user_link": "/personal_pages/user/29231",
            "votes": "0"
        }
    ],
    "post_id": "579495",
    "question": "Hello.  I'm 16 weeks postpartum from a pregnancy with mild preeclampsia.  At 2 weeks postpartum all liver and kidney function tests were normal, my alkaline phosphotase was 130 (150 being the cutoff for normal)  In Dec. after a repeat test my Alk. Phos. was up to 161 - doctor wants to repeat the test in 4 weeks.  The test in December was not fasting, but my GP says that's fine.  What could this test indicate?  I have no specific symptoms (some minor dry skin, itching, mild bowel changes since c-section surgery) and all other tests including a cardiac echo were normal. Please let me know what this could be.",
    "timestamp": "1141365600",
    "title": "Alkaline Phosphotase",
    "user_id": "user_22582",
    "user_link": "/personal_pages/user/22582"
}