{
    "answers": [
        {
            "answer": "Lance:  I would be so frustrated if induction was on the table and then suddenly off!My EDD is this Saturday!!!  On Monday, I was 2cm dilated and 80% effaced.  I lost my mucus plug two weeks ago to the date. FYI: I joined this forum in addition to Jan09 since Im pretty sure everyone on the Jan09 forum had their babies!The tech today said the u/s showed Sophia measuring as she should be for 39.4 weeks and she looks good!  The OB thought she might be around 9lbs or so and wanted to have her weight checked.  I should hopefully get the ordering OB's impression by the end of this week. My next office visit is on Monday.  Im keeping my fingers and toes crossed that induction gets put on the table before I reach 42 weeks!!!!As far as I am feeling these days..just feel so heavy and at times, lots of pressure in my pelvis and this baby really pushes on my bladder at times which is very painful.  Sleeping well...what's that??!?!?!? HA!",
            "post_id": "3926582",
            "timestamp": "1233155371",
            "user_id": "user_489000",
            "user_link": "/personal_pages/user/489000",
            "votes": "0"
        },
        {
            "answer": "I understand how you are feeling! This daughter of mine, Sarah, is putting a lot of pressure on my cervix and bladder..and it quite uncomfortable. ....I asked my office how far they will let someone go it they go overdue and she told me 41 weeks....So i hope they dont let you reach 42 weeks! You poor thing. I just dont want to give birth to a HUGE baby..that is my fear. I want to be able to have natural birth...no c section..but what happens..happens i guess.I am def hoping to hear that they decide to induce...so I am anxiously awaiting even fridays appt..... I dont think I have lost my mucus plug yet..I have definetely had more discharge..but no plug yet...atleast I havent seen it!Stephanie",
            "post_id": "3926615",
            "timestamp": "1233155867",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "im being induced on sunday so my baby will be hear next week, i cant wate, i feel good just realy tired because i got to pee every 5 mins so i keep getting woken up also im uncomfy now but hey only 4 days :)",
            "post_id": "3926679",
            "timestamp": "1233156940",
            "user_id": "user_518733",
            "user_link": "/personal_pages/user/518733",
            "votes": "0"
        },
        {
            "answer": "You are so lucky! Please be sure to update us and let us know how everything goes! I am so jealous!",
            "post_id": "3926709",
            "timestamp": "1233157421",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Oh man.  Lance, I hope your little one decides today is the day :)As for everyone else, inductions!!!!  Oh my goodness.  How do you feel about having them done?I am doing ok.  Still getting over a bad cold/virus...so when I cough, the right side of my ribcage hurts so bad.  I don't think this baby has dropped yet, and that is all I want... Nothing more at this point, just for baby to drop really low.  I don't care if that hurts, b/c not being able to cough w/o pain in the ribs and feeling like they are getting strained is so awful feeling.  The only thing that seems to help  is hubby pushing on my ribs when I cough, but I can't take him to work with me. I really feel like I'm complaining a lot.  :(  But I actually love being pregnant!  Just not having to cough and be sick while pregnant.  :P",
            "post_id": "3926737",
            "timestamp": "1233158020",
            "user_id": "user_368690",
            "user_link": "/personal_pages/user/368690",
            "votes": "0"
        },
        {
            "answer": "Hi there!Yea, actually....Im hoping today isnt the day for me...only because my husband is on Route for his fathers work and of course....left his cell phone home..so i have NO way to get ahold of him....I dont think this baby is going to come anytime soon on its own....and with all the problems I have had....induction is probably going to be the only way to get this little girl out anytime soon....having both of us be healthy!!At this point..induction is what I want. I have been out of work since DEcember 30th...I originally wanted to spend 12 weeks at home with her..but I have already been out since the 30th, so that is when my 12 weeks starts...it really *****!Hang in there!",
            "post_id": "3926749",
            "timestamp": "1233158243",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "At this point, I'm ok with being induced.  Next week, Ill be over 40 weeks, so I'm at the point of \"get this show on the road!\"I hope you feel better Katebud, sooner rather than later!",
            "post_id": "3926769",
            "timestamp": "1233158534",
            "user_id": "user_489000",
            "user_link": "/personal_pages/user/489000",
            "votes": "0"
        },
        {
            "answer": "Hey ladies!Feeling great this week....having sex and eating tons of pineapples here. And maybe it's working cuz at my doctor's appointment Monday they told me I am 2 cm. dilated and 80% effaced. That was exciting, because I haven't felt like anything has been happening!I think I lost my mucous plug yesterday, and I have been feeling crampy since Monday, but I know all of that doesn't mean a lot, I could probably still go another week or two from what I have read. Sunday is my due date, and I'd rather go 42 weeks before being induced, as long as we're healthy, so we'll see what happens. I heard from a couple of friends about a famous restaurant near here, Scalinis; they have a recipe, eggplant parmesan, that has supposedly put over 300 women into labor. Here's an article about it, with the recipe, which I am planning to make this weekend:http://www.wchstv.com/gmarecipes/eggplantparmigian.shtmlOh, one thing at my appointment did have me a little worried....the midwife detected a faint murmur when she listened to the heartbeat this time. She said it is fairly common, and most of the time it goes away after delivery, and that if there were a serious heart defect, they probably would have detected it on the 20 week ultrasound, which was clean. Has anyone else experienced this?I'm trying to make myself savor the last few weeks here...I wonder, will there be a part of me that misses feeling baby's movements after she arrives? I am really looking forward to having my body to myself again, but it seems like I will feel sort of empty inside too...",
            "post_id": "3926792",
            "timestamp": "1233159073",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Well as I posted yesterday I went from being dilated at 4cm per doctor to being dilated at 1cm per labor and delivery.  I have been having period like cramps and somewhat painful braxton hicks contractions.  My doctor will induce at 39 weeks if I chose because I only had a total labor of 1.5 hours with my son.  I am 37.5 weeks now.  I go to the doctor in about an hour so we will she what she has to say about mis dilating me.Good luck to everyone.",
            "post_id": "3926848",
            "timestamp": "1233159970",
            "user_id": "user_538174",
            "user_link": "/personal_pages/user/538174",
            "votes": "0"
        },
        {
            "answer": "SolusChristus & Babyadam!Good to hear from you ladies...Sounds like we are all getting to the end....The trials and tribulations of being pregnancy......being at one point.....and then moving to another....like being 4cm and then back down to 1...that would bug me!! I have had that with the effacement, saying I was 80 and then 60..its quite frustrating to think you are closer and then go back!!Well, hang in there girls!!",
            "post_id": "3926887",
            "timestamp": "1233160558",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Thanks for making this post Lance! I was totally going to do it yesterday and I got caught up with a few other things. Well I'm still HERE and still Pregnant!I constantly have to remind myself that my original due date was February 5th...so I guess I still have another week before I can really complain...but I just thought I would have had him by now!No major changes...still getting that Crampy feeling everyday and BH Contractions. Last night I was getting them more often. They didn't seem to be getting stronger just more frequent. And the past couple days I have been getting a horrible headache which hasn't happened my entire pregnancy...so it makes me think my time is near! Caiden has been so active too, he doesn't seem to stop moving! I am constantly feeling his head twist and turn in my pelvis and he moves his but, arms and legs around constantly. I can feel everything! He is so low, all the pressure on my pelvis makes my belly feel so heavy. It's getting more painful to turn over at night and get up and down off the couch or bed.I had thought I lost some of my mucous plug a couple weeks ago but I think it was just from my internal that day because I haven't seen anything since. I've been having SO MUCH discharge though...its really nasty. I also thought my water broke last night...when I was peeing, all of a sudden it started coming out stronger and faster. But than I felt nothing, no contractions, nada. So I just figured I had to pee real bad! And speaking of, I am with you ladies...he is sitting or pushing on my bladder all the time! I think I peed 4 times in one hour yesterday! It kills, on top of all the other pressure I'm feeling. So I'm still sleeping great, but I get up like 5 times to pee cuz its so uncomfortable if I try and hold it in.So we just wait! My next appointment is Friday, so hopefully they'll tell me something. I've been 1+cm dilated for over 2 weeks now so I dunno. They said they will induce me on the 12th if I don't have him by then. Thats a week over my original due date. Like Lance I want to go natural here so I am also afraid if he bakes in there too long he's going to be too big for me to deliver. So I'm hoping he comes very soon! Were supposed to get a bad snow storm today, so watch today will be the day! ha ha.Yea sex isn't happening! We've been trying and its just so uncomfortable! My stomach always balls up and gets so tight that it hurts and I can't enjoy any of it. My poor hubby!Well sounds like we are all in similar boats here! Wanting our babies to be born soon and healthy! I think I will miss being pregnant and feeling him kick and move around inside me...but I know this isnt my last pregnancy and not only can I not wait to hold my son but I cant wait to get my body back!! Hang in there girls, one of us is next! It's so exciting that little by little were all starting to have our babies!! :)",
            "post_id": "3926991",
            "timestamp": "1233162182",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "The whole trying to have sex thing is more frustrating than anything..however, they say when you orgasm there is a hormone that is given off that helps labor...and also apparently there is something in sperm that helps progression...but its almost not worth it..its too much work..too uncomfortable....and just...yea....doesnt really work..lolMy next appt is also friday..and I have been stuck at 1+ cm for about the last 4 weeks..so hopefully I have progressed atleast something!!!Lets hope we both go soon so we can do this the way we want it to happen!",
            "post_id": "3927021",
            "timestamp": "1233162692",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "AMEN to that!! I hope we all get to experience the kind of labor we want!Ug, I am so freakin bored. I am house trapped...I can't go far, especially today during our Winter Snow Storm...and I am just puttsing around. I clean and clean and than my husband gets upset when he gets home because he doesn't want me doing anything strenuous but I tell him I get so freakin bored! I seriously wake up everyday, eat and just wait for something to happen! LOL.I kinda wish I was still working but since we moved when I was 6 months Pregnant, by the time we got settled I was 7 months and of course no one is going to hire a 7 month preggo. So I feel like I've been out of work so long and now that were settled in our new home I am bored outta my mind! I know as soon as the baby comes, I will be wishing for those boring days to come back but for now its driving me crazy!What do you ladies do all day??",
            "post_id": "3927071",
            "timestamp": "1233163611",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "We are in the same boat....I literally...DO NOTHING all day long! It really kinda *****.I am also stuck inside because of the Winter Snow Storm....we have a snow advisory here....I could go out...but my jeep is in the garage and I havent made it outside to do anything yet. Hubby is working today....so I eventually am going to go out and snowblow the driveway..maybe that will help progress things..doing some actual work! Gotta love this NY weather..its quite lovely...jk...Everyday..I literally get up...let the dogs out...and watch tv....maybe do a load of laundry or the dishes...but mainly am around watching tv....Her room is ready...so its not like I can do that....I did her last load of last minute laundry items we received yesterday....so really, what can I do besides like vacuum the living room everyday. The dogs just lay around...being lazy with me...so its really boring. Thats why I just want her to come already...so I can spend some time with her before I have to go back to work...stay warm in this nasty cold snowy weather..its supposed to turn into sleet later on!",
            "post_id": "3927097",
            "timestamp": "1233163967",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Yeah here in CT, we haven't gotten much snow yet. An inch or two...but now its raining calling for black ice and possibly more snow later on! My husband nor my parents will let me go out. My Mom calls me like every hour making sure I'm home. So I'm stuck! If I even dared to shovel our driveway I would get reemed out! But I do try and keep busy around the house hoping it will send me into labor! Ha Ha.Same as you...I putts around and do the dishes, vacuum, wash the floors, bake, do laundry, clean up and play with our cats. But they are super lazy too and just sleep all day! We are caught up on laundry and we wash everything of Caidens as soon as we get it and his room has been done for a while so there's nothing left there to do! So like you, I basically shlep around on the computer and watch TV. Which I can't stand! I was never a TV person...I hate commercials and I feel like the same old **** is on all the time...I was always the gal who was outside or running errands, anything but staying inside and watching TV..now thats all I do and I get so bored!",
            "post_id": "3927195",
            "timestamp": "1233165601",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "Another dr. appt today. So today i found out i am another centimeter dialted putting me at 3cm. I am so ready for him to come. The cramping is getting worse and now spotting from todays exam. i am hoping any day now he will be ready to make his entrance.the DH and i are not gonna BD to help get him out i am in so much pain down there that the idea of adding more pain makes me cringe.Logans room is ready. Hospital bag packed. Just waiting for labor to begin.Today did not go to work with all the snow in MA plus its getting harder and harder to move luckily my last day is this friday........",
            "post_id": "3927324",
            "timestamp": "1233167603",
            "user_id": "user_354219",
            "user_link": "/personal_pages/user/354219",
            "votes": "0"
        },
        {
            "answer": "We have a TON of snow...like a TON and its supposed to go all night. I just got in from snowblowing.....and literally as soon as I finished and put the snowblower in the garage...the darn plow came back around and buried the end of the driveway! I was so mad...like, great timing.....so I took it back out and did the end again. I will admit that while I was out there I did get a little crampy from snowblowing......which I thought was good....was hoping that maybe my water would break..but of course..things like that dont happen so easy for me.Was a little nervous though bc hubby was working and forget his cell at home..but literally...as soon as I got back inside and sat down..he pulled in the driveway...so hes here...thats good....2 more days til fridays appt......hoping to know more! I am such an impatient person..I just want to know if I am having this baby next week!",
            "post_id": "3927507",
            "timestamp": "1233170293",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Had my 37 weeks appt today and according to my Doctor I am dialted at 3-4cm.  So i dont know who to believe the nurses in Labor and Deliver or Doctor.  My next appt is Tuesday and she is going to induce me next Thursday or Friday if I have not went into labor on my own.  So at the most I only have 9-10 more days.",
            "post_id": "3927722",
            "timestamp": "1233173384",
            "user_id": "user_538174",
            "user_link": "/personal_pages/user/538174",
            "votes": "0"
        },
        {
            "answer": "I had an appointment today, but I don't get internal exams. Last one I had, I was just starting to dialate. I lost my mucous plug 3 weeks ago (or at least most of it). I apparently still have a lot of mucous working it's way out. I have BH all the time, which is getting so annoying. Last Saturday, I'd have them every 3-4 minutes by the end of the day, but no progression down there.",
            "post_id": "3927898",
            "timestamp": "1233175772",
            "user_id": "user_583277",
            "user_link": "/personal_pages/user/583277",
            "votes": "0"
        },
        {
            "answer": "Wow, 3-4 cm dilated is fantastic!! When you think about it, thats practically halfway there! Any day now ladies, how exciting!I spot after every internal too...the first time it happened I thought I lost my plug! But than it kept happening and I was like dangit!The snow here wasn't bad at all...they talked about it like we were getting over a foot and in total only got 2 inches of snow and rain. So it wasnt bad.I really don't want to be induced but I am getting so impatient! Anxious for Fridays appointment too! Just sitting here watching TV and EATING. Thats all I do lately!",
            "post_id": "3928038",
            "timestamp": "1233177618",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "I had my 36 week appt today. Ive put 3 more pounds! ERRR i thought it was supposed to stop by now! LOL! Im dilated to 2 and only 50% effaced. My midwife said that id i have alot of sex then he will be here in the next two weeks! Yeee for that!",
            "post_id": "3928367",
            "timestamp": "1233182734",
            "user_id": "user_413098",
            "user_link": "/personal_pages/user/413098",
            "votes": "0"
        },
        {
            "answer": "as far as Jaedyn coming, well he is not even close.  as of yesterday i was not dialated at all and he is still up very high.  i am 36 weeks adn 2 days and i swear he is staying in til past his due date.  i still have not had one contraction either.i did have to see my doctors office for an emergency visit yesterday because i have been throwing up consistently for over a week and yesterday it was bad, i actually threw up a lot of blood so they wanted to see me.  low and behold i just aggravated vessels in my throat that bled and now i have to take zantac 2 times a day to stop all the acidity and hopefully decrease the vomitting.but other than that, things are not progressing at all.",
            "post_id": "3928481",
            "timestamp": "1233184561",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "Oh Leighanne, you poor thing! I hope you start feeling better, it will be over soon!Try and remember that you can progress at any time! So as much as he is high now and your not dilated, that could change over night, in an hour, whenever! So hang in there!Waiting-I hear ya! I've been putting on half a pound to 1 pound every appointment (which has been every week) and I thought at this point the weight gain was supposed to slow down! But I am eating non stop, so I'm sure thats why. I just can't get full...I think Caidens going to be bigger than the doctor thinks! I am so ready to have him!",
            "post_id": "3928690",
            "timestamp": "1233187538",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "gina- thank you.  i needed that reassurance.  i am so bummed out that everyone else is progressing but i feel stuck.  and to be throwing up all over again like at the beginning, is no fun at all.we should try to re-track our orginal due date list and update it with who is born and when.  it would be fun to see how many of us have had the babies and how close or not close it was to the original due date.",
            "post_id": "3928904",
            "timestamp": "1233190532",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "Hi there ladies...Same boat here...my boss told me the other day not to worry about coming to work, to take care of myself and baby!!  i feel guilty and honestly bored myself....I was all ready to go in about 30 mins ago, just to check e-mail and such....but got those painful cramps we have all been talking about...you know where it feeld like a knife is poking through your cervix.....My MIL is in, she has been for about a week now, for the most part we get along....Everyday she asks me though, \" Nothing yet??\"  or the other day I went to the doctor and I was one centermeter dialated...she says \"Only one centimeter\"...like it is all my fault!!  Maybe I am just assuming that is what she is thinking!!I feel bad because of course my husband has to keep going into work with his Mom here and all...He will get 10 days off, and taking another 14 once he finally decides to make an appearance!!So, just waiting around with the rest of you!!  It seems like each day drags on....I have til tomorrow and I reach my due date....well, one of the later ones they gave us!!  I am with Gina..I was given the 4th of Feb, originally then it changed to 30 Jan!!  We all know satistically they are not born on thier due dates.  So today is the last day for him to come early....I feel like he willl never be here...I have most of the same symptoms as I have had for the last week!!  Cramping, pressure, pain in cervix, back pain, hips hurt when trying to sleep, peeing every 10 mins, buldge in my vagina when I pee, feel like I have to poop, but cannot, and I have quite an appetite myself these days, but feel a tinge nausous sometimes!!  Really do not want to do this for another week!!Talk to you ladies soon, and hang in there...It is nice to hear other people in the same boat as I am......",
            "post_id": "3930516",
            "timestamp": "1233234378",
            "user_id": "user_643558",
            "user_link": "/personal_pages/user/643558",
            "votes": "0"
        },
        {
            "answer": "Everything seems to be running smoothly with me.  Had my doctor's appointment on Tuesday and was negative for GBS so that just totally made my day!  The baby dropped big time so hopefully will be anytime now.  My doctor won't check to see if I'm dilated or anything until my due date or after.  Kinda ***** not knowing where you are but I guess that's the way they do it here.  My doctor seems to think she's going to be about 7 pounds 4 oz when she's born.  We'll just have to see about that.Been having really weird dreams the last few nights, never had them like this before. Up almost every couple hours.  Been feeling really crampy also.  Last night was the first night I actually felt nauseous and I am never nauseous!!!!  Very hard to walk too, wish my water would just break already!  My appetite has been weird too, at least I'm not the only one!As of the 27th of Jan I am officially on Mat leave!   Woohoo a whole YEAR off!  I've been off work though since the end of October but though short-term disability.Just think Feb is almost here and we're all going to be posting about our new arrivals.. YAY!  Take care everyone!!",
            "post_id": "3931017",
            "timestamp": "1233244060",
            "user_id": "user_316024",
            "user_link": "/personal_pages/user/316024",
            "votes": "0"
        },
        {
            "answer": "Do you live in Canada??? I wish I did so that I could get that lengthy maternity leave!  Or to even have short term disability to be able to take my full 12 weeks off and not use vacation or sick time.  Oh well, I actually am blessed to be able to take the time off and get paid my vacation plus when that runs out my work will pay a few weeks at full time pay.I have about 19 days left but I go back today to the doc and we will probably be discussing possible inducement.  They had thought I might have preeclampsia from my BP rising, swelling and 6lbs weight gain in one week.  But my protein (in urine) was 220 and if it was over 300 then they would have induced me this week.  The swelling is still bad and I don't know about the BP or weight gain yet, but if they are both rising like they shouldn't then I'm sure he is going to suggest inducing me - which at this point I won't argue.  I feel like I should let her come when she's ready, but last week I was not dialated and she hadn't dropped, nor do I feel she has dropped at this point either.  I am in pain in my downstairs area - both front and back sides - making it hard for me to do anything, though I am still working.  Well we'll see this afternoon how things are or aren't progressing!",
            "post_id": "3931070",
            "timestamp": "1233245020",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "Ladies your all so lucky your toward the end. I am 36wks and 2days. My C-section is on Feb 23rd. I had an Appt. Monday and as usuall she shrugged off all my concerns, the pressure the constant BH, She did not check me. She said since i deliver via c-section she will see me every 2wks and not every week. Very frustrated i even told her i want an amnio at 38weeks to c if the baby is ready instead of waiting until 3days befor my Due date. She did nto even answer me! I am very tired, cannot waite until this pregnancy is over.",
            "post_id": "3931115",
            "timestamp": "1233245477",
            "user_id": "user_573426",
            "user_link": "/personal_pages/user/573426",
            "votes": "0"
        },
        {
            "answer": "I just got back from my doctor's appointment...I knew I wasn't going to get an internal since my doctor is out of town for 10 days.  But I got him to give me a guess of the baby's weight...8 pounds 10 ounces right now!!I'm so freaking nervous that he's letting me go all the way and not inducing me.  I brought up my birth of my son and told him he was only 8lbs6ozs and hoping I don't need to go through that again.  He told me he can't predict anything until the time comes, but I'm leaning toward a freaking c-section from the way he's talking...He told me that he thinks I'll go this week, but to try to hold on until he gets back from vacation...OMG so I'm nervous if I do go these last couple weeks.  Hopefully it's actually smaller then he's thinking, but I know it's a big baby....Lastnight and all today I've been having this horrible cramping and painful feeling in my left hip.  I'm not sure if it's from coughing and blowing my nose, but it's horrible.  I'm having a hard time breathing and gasping for air because of the phlem.  Not fun!!  I just want this cold gone before I deliver....I can't wait to meet my baby and to see what I'm actually having.  Then I can go out and do some shopping and get the nursey going :)Only a few days/weeks for us girls and hoping we're all doing well....Good luck to you all and hoping I go SOON!!  DARN!! :)-Brandi",
            "post_id": "3931311",
            "timestamp": "1233247990",
            "user_id": "user_514428",
            "user_link": "/personal_pages/user/514428",
            "votes": "0"
        },
        {
            "answer": "Brandi! You poor poor thing! almost 9 pounds already. God bless ya! hopefully that baby of yours comes sooner than later for your sake! Keep us updated.I am hoping to know more tomorrow when I go to the docs!! Hoping for some good news!",
            "post_id": "3931810",
            "timestamp": "1233255857",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "ouch  BRandi  i know how u feel  iam  almost in the same  boat with my little one now  they are guessing her wieght at about 8 pounds now  and i have another four weeks. My  son was  9lb 6 oz so  i know how that  feels . They told me  that i had one big one i can have another one  i  told my doc to  stick it !! lol  but in  all  seriousness have though of inducing u do to the  size of the  baby  that is what they are  going to  do in my case  but  i run a bleeding  risk cause i bleed really  heavily  right after my son was  born  almost tot he point of  transfusion.  I have anoither appoinment tomorrow in the morning  so they are going to to  more measuring then i have a follow up  u's next tuesday  so  i will know something  next weeki  also am  feeling the the  cold thing i have bad one now to not helping have to cough all the time with the hip and lower belly pain    well good luck to all u  ladies and it is  not much longer  for the rest of us",
            "post_id": "3932239",
            "timestamp": "1233263285",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "im having the worst pains ever i cant even sleep my stomach is a hard ball and it feels like its so high in my ribs i cant breathe my back is in pain all the time i cant wait until i have this baby girl already",
            "post_id": "3932399",
            "timestamp": "1233265788",
            "user_id": "user_171259",
            "user_link": "/personal_pages/user/171259",
            "votes": "0"
        },
        {
            "answer": "Hang in there little mothers.  The last month is always the hardest.  It seems like God gets mothers ready for no sleep, in the last month....getting us ready for staying up all night with the baby.  Nursing or bottle feeding every few hours and changing diapers.  That's what I told my husband in the last month of both of my pregnancy's.  I felt like a beached whale.  I couldn't lay down and be comfortable.  I had heartburn from you know where, I peed constantly, I was constipated and I threw up the whole last month.I know for sure that men could never carry a baby.....Hang in there ladies.  You all know it's worth it in the end.  God bless all of you and your precious little ones.Mommie Hugs,Heather - MS Forum",
            "post_id": "3932464",
            "timestamp": "1233266670",
            "user_id": "user_195469",
            "user_link": "/personal_pages/user/195469",
            "votes": "0"
        },
        {
            "answer": "Thanks Heather! Your so sweet, encouraging us all and reminding us were doing this all for our babies and its completely worth every symptom!As of right now...the past few nights I've been having trouble breathing again. I thought that was over once he dropped but I think now he is taking up my entire stomach and completely stretching out so not only has he dropped low but his lower body is still high making it difficult for me to breath or catch my breath. It's frustrating. I've also gotten indigestion back...still crampy and boy oh boy does my back KILL! For the most part its felt great my entire pregnancy, now all of a sudden it hurts really bad..so achy and sore. Surprisingly I'm still sleeping good, but getting up every hour to pee...luckily I fall back asleep quick.I really feel like he's coming...with all this period like cramping and even ovulation like cramping along with my back pain...I think he is almost here! Hopefully I'll have more of an update tomorrow after my appointment!",
            "post_id": "3933619",
            "timestamp": "1233286836",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "Let us know how your appointment goes! I am SO envious of your cramping, ha! I had it for a day or two after my last exam, but now nothing is happening, and it feels like I will be pregnant forever. I welcome the pain, if it means progress! I've been having trouble breathing, too, it's really frustrating.I'm excited for you, it sounds like you'll be going soon!",
            "post_id": "3934326",
            "timestamp": "1233315802",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Well ladies...no induction for me. My blood pressure was better.....I had everything checked today. Gained another 6 pounds this past week (the weke before that was also 6 pounds), 1-2 cm still..no progress there. Amniotic fluid level check was at 8.6 which is lower..but still okay....no talk of induction unless the 24 urine test that i started today comes back with a higher number than before (which was 309) so we will see!Just waiting now.....feels like forever away!",
            "post_id": "3935524",
            "timestamp": "1233337795",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Thanks girls~I knew from the begining I was going to have a big baby, I'm just hoping I don't go over 40 weeks~that's still 2 1/2 weeks away!!!  Hoping my doctor is right and he says I'll go about next Thursday. ..probably due to the next doctor checking me and I might be things going, who knows....I'm just stoked to have this baby coming out and enjoy walking again :)",
            "post_id": "3935957",
            "timestamp": "1233344371",
            "user_id": "user_514428",
            "user_link": "/personal_pages/user/514428",
            "votes": "0"
        },
        {
            "answer": "Ok, since the baby showed to be weighing in at 10lbs, maybe more, the OB scheduled me for a c-section on Monday, which happens to be my birthday! What a great present it will be to hold my dd for the first time!Good luck to all!",
            "post_id": "3936177",
            "timestamp": "1233347501",
            "user_id": "user_489000",
            "user_link": "/personal_pages/user/489000",
            "votes": "0"
        },
        {
            "answer": "OH Tarobinc, what an awesome gift!!!!!!   I think that is so incredibly neat and sweet!!!  :)Brandi, I have a very bad cold too!  :P  I feel ya so much on this one.  My dr won't do size estimates at all, so I have no idea how big/little this boy is going to be.  I think I'm ok with that though.  I just hope he's between 8-9 lbs (I've heard big babies are easier to care for).Today I went to L&D.  I woke up this morning coughing pretty hard.  While I was coughing, a bunch of fluid came out of me.  So I naturally got up and went to the bathroom to check it out.  It didn't seem like pee.  :P  tmi, I know.  but I was consistently wet all morning and in between coughing fits even.  So I got a shower about 12:30pm, called my OB and they sent me to L&D to make sure that it wasn't my waters breaking.  I got to the hospital, they hooked my belly up to the monitor and checked out my cervix with the litmus paper (swab) test.  That unlubricated speculum hurts sooooo bad!!!  ew.   But they said it was normal, no amniotic fluid, so that is good.  I'm 36 weeks today, so I don't really want to meet baby Daniel until at the very least next weekend.  ;)  They said it was probably thin discharge, and since I'm near the end and coughing, the over production of the CM and the pressure from coughing can make it push out and feel wetter than normal.  They checked my urine also, and I have a UTI!!!  Oh a joyful UTI.  :P  so that is what is making me cramp and feel very bad, beyond having this cold.  They prescribed me some antibiotics, which I am grateful for.  I just want to feel semi-normal by the time its ready to push my baby out.  I want to feel strong and not weak from still being sick.Oh, that was kind of a long one.I hope you other ladies are continuing to do well today and have great weekends.  :)",
            "post_id": "3937474",
            "timestamp": "1233374652",
            "user_id": "user_368690",
            "user_link": "/personal_pages/user/368690",
            "votes": "0"
        }
    ],
    "post_id": "3926535",
    "question": "I know Gina normally posts this, but it looks like our last weekly check in was over a week ago, so I figured I would post just incase little Caiden decided to join the world and she wont be on! That would be pretty cool?!!So, how is everyone feeling? At this point, some of us already have our little one's in our arms...and many of us are very anxiously awaiting to see when ours will come!! Update everyone ladies...and let us know how you are doing!!!For me....I am sick of the tests...sick of the NST tests 2-3 times a week...sick of the bloodwork every week...and all of the damn appts, 2x a week, sometimes more. Im really mad that they mentioned induction to me for next week..and then having another one of the doctors say no....I was diagnosed with minor preeclampsia.....and thats why they were going to induce...so the midwife that told me we should induce is going to talk to the office to see if we can still induce next week like she thinks we should. I have a doctors appointment on Friday and I am hoping to have more information on whether it will happen or not!! I just want to know already. Besides that, DH and I are actively trying to get this baby out ourselves...having sex and such..even though its so uncomfortable....this may be a little TMI but the worst is when I get a BH contraction and my stomach balls all up.....in the middle of it..makes it quite uncomfortable because its like he cant even put any pressure on me....and all he says is...maybe we shouldnt be doing this. I assure him that its okay and its not going to hurt anything.They did an internal at the hospital yesterday and no change. She says I am still the same, about 1+ and 80% so nothing is happening. SHe also says that when touched the baby's head moves...so does that mean she can actually feel the babys head??? Weird.Anyways, how is everyone else doing???",
    "timestamp": "1233154573",
    "title": "Another Week! January 28th-Weekly Check-In",
    "user_id": "user_525485",
    "user_link": "/personal_pages/user/525485"
}