{
    "answers": [
        {
            "answer": "I had a gynecologist argue with me once.  I said I was diagnosed hypo and he said you mean hyper  No, Hypo....I never gained much weight.  Before my daughter I was around 115 pounds and I was 28 years old.  After my daughter I was 125 pounds and it slowly crept up to 135 pounds.  But nothing substantial - kind of liking having a butt now :)I know weight isn't always an issue with us.  I think we all have really different symptoms of hypothyroidism.  Mine was exhaustion, migraines, throbbing headaches daily, and severe muscle pain.  My sisters symptom is weight gain - and she has nodules on her thyroid - she doesn't have the exhaustion.I am sorry your doctor didn't explain hypothyroidism to you.  I am assuming you have already read everything you could about the location and function of the thyroid gland.Do find a doctor that will test your Free T's and base your dosage off that and symptoms.  My first doctor followed TSH only and prescribed the synthetic hormone - levothyroxine.  I did terrible on it and as soon as my TSH dropped, within the first six weeks- she said everything should be fine.  It was an extremely long time until I found my internal doctor that ran Free t's and found them at the low end of the lab ranges.  We worked to get them up and she let me up the dose on my own.  But not quickly!  I started at 30 mg Armour -an NDT-and upped it every two weeks until I got up to 120 mg and found I couldn't handle it there.  I am at 90 mg now and blood tests so far look good.  I have one tomorrow so we will see again...LOLI also split the dosage up to twice a day so I can feel the full benefits of the readily available T3 that it has. I can thank my doctor enough for letting me have Armour - I pull through the crashes so much faster!Don't take your pill with other vitamins. Take other vitamins at least 4 hours from your hormone.  Always take your thyroid hormone on an empty stomach.Get ready for a long road ahead to recovery. Good days and bad days.  Don't let the doctor keep you on to low of a dose, especially if they are only doing TSH testing.  That is not even a thyroid hormone. Don't be afraid to try different thyroid medications.  Some people don't react well to synthetics as some don't do well on natural hormones.Other vitamins and minerals drop low in hypothyroid people -so at some point you need to get your iron, B12, magnesium tested.  You might get to the right hormone for your body but won't know it because of other vitamin deficiencies.  Low iron, B12 etc...will also make you feel terrible.  Even if your doctor says something is within normal ranges, research it and get your levels to where they should be.  For example and B12 blood test in the 300's are called normal - but a neurologist wants it around 800.  A family doctor won't pick up on that.  At least mine didn't.BTW - Your not lazy - your body just has nothing to give!Right now I am getting tested every 3 months.",
            "post_id": "9271275",
            "timestamp": "1373314761",
            "user_id": "user_5525017",
            "user_link": "/personal_pages/user/5525017",
            "votes": "0"
        },
        {
            "answer": "As noted, not everyone with hypothyroidism gains weight and those of us who do, gain it at different rates.While TSH of 13.39 is definitely higher than normal, and warrants treatment, it's not extremely high and doesn't indicate how long you might have been hypo. For instance, when I was diagnosed, my TSH was 55+ and my levels had been \"normal\", less than a year earlier.When you see your doctor, you should ask for antibody tests to determine whether or not you have Hashimoto's Thyroiditis.  That's an autoimmune disease in which the body produces antibodies to attack and destroy the thyroid.  Hashimoto's is \"progressive\", in that as the antibodies attack and destroy healthy thyroid tissue, the thyroid produces less and less hormones, until eventually, it produces none and you will be completely dependent on your replacement hormones.With Hashimoto's, it's not unusual for symptoms to be present long before labs (TSH, FT3/FT4) indicate an issue.  Also, while Hashimoto's is primarily associated with hypothyroidism, early stages can be characterized by periods of hyper and some symptoms, such as fatigue applies to both hypo and hyper.  I, as well as many on the forum have Hashimoto's and now that I know what I know, I believe that I swung back and forth for a good share of my adult life, but no one ever tested thyroid hormones, until I was 58 yrs old.  During some that time, when you were maintaining weight so well, you might actually have been in hyper phases of Hashi's.The antibody tests you need to ask for are Thyroid Peroxidase Antibodies (TPOab) and Thyroglobulin Antibodies (TGab).  You need them both to get a definitive diagnosis, since some people have one or the other, while others have both.  Many doctors only test TPOab, and miss the diagnosis. Also, be aware that TPOab can be present in smaller amounts in other autoimmunes, including Pernicious Anemia, RA, Lupus, etc.You should definitely get a vitamin B-12 test; deficiency in B12 can cause the  most horrible fatigue/exhaustion you could ever imagine. It can also cause brain fog and other issues.As noted above, do make sure that your doctor does the FT3 and FT4 tests every time s/he orders thyroid blood work, since those are the actual thyroid hormones and only they and your symptoms can indicate your status.",
            "post_id": "9271421",
            "timestamp": "1373317341",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "Thanks everyone. Yes, I plan on asking about FT4 and FT3 as well as both antibodies when I go in for a retest. Not sure what was tested in the thyroid panel, but if they weren't tested then, I'll definitely ask for them to be tested now. I can't imagine the doctor refusing since I actually have a high TSH level. I know that from what Ive read, that if its normal, some doctors will refuse, assuming you're fine.When my brain fog came on, I started taking B12 and B6 supplements. The fog never went away, but it did get better slightly. Over time it would get worse, and I would take more to compensate. Eventually I just got so sick of it. It wasnt going away. Clearly there's some other issue. There was no risk of taking too much B12 because you'd just pee it out. But excessive B6 can have negative effects from long term use. So after the maximum safe limit was reached I quit taking the supplements all together in hopes that I could get more accurate supplementation advice from an actual medical professional.After a month and a half I felt terrible! I had no idea how sick I was. I was either in bed, lying on the couch, or face flat on the floor while my 9 month old screamed at me. I had previously forced myself to walk around the block for my own benefit, but could no longer bring myself to do it. I couldn't even read the guide on the TV. I couldn't figure out if it was because I couldn't even focus for just a few seconds, I truly didnt care, or was actually now illiterate, as I couldn't recognize any words, or even bring myself to sound them out. All I knew was that I just didnt care and decided since Im not really going to pay attention anyway, I just left it playing a horrible movie that had already lowered my IQ the first time I saw it.The day before my Drs appointment, a friend of my husband came over. He asked me if I had gotten any sleep, as I looked exhausted. I had slept 11 hours that day. He, my husband, and my husbands dad just sat around the table with me and talked. I was a complete zombie. The only thought in my head was that I had no thoughts in my head.During this time I also got extremely dizzy, light headed, and at some rare times, I could feel the room rotate clockwise. Made walking rather fun. Sometimes when I laid down it even felt like I was lying on a water bed. I knew something was clearly wrong, but sure it was vitamin related, as I had never felt that bad with the supplements. After the blood test, I went straight home and took them. It took a while, but I felt so much better. I was shocked to hear that it was a thyroid problem. The nurse said that my b12 levels were high (since that was my concern when I came in) but I was surprised by this since supplementation had proven so successful. I did however find an article somewhere that said that people with hypothyroidism do see some relief with B12 even if they aren't deficient.Anyway, so I take my 25mcg in the morning with a glass of water an hour before eating. I take B6 and B12, as well as a daily multivitamin at night to avoid any issue with the hormone pill. I do however also take birth control, and have been on it since 2002. I will ask if I should stop taking it because of the estrogen. The one year I stopped (when I was trying to get pregnant) my periods weren't regular, they were pretty random, every 5 weeks, every 6, at one point I didnt have one for several months, though I wasn't pregnant. My OBGYN gave me some pills which started me back up again. But when asked what would cause me to stop, she claimed stress. But I live a pretty stress free life, especially when it happened, so I was very confused by this comment. I guess it was biological stress, not environmental.I do have a history of iron deficiency but after temporary supplementation, I would be fine. Also, during my 2009 blood test, the only thing they found wrong was that I was deficient in vitamin D. This was a shocker because even though I stay indoors mostly, I have a convertible, and even had the top down on my car the day I was tested (despite it being Dec 23)I've always been paranoid about everything. I actually went to the doctor without anyone knowing. I took my medication without anyone knowing. After about 8 days I felt awesome! The brain fog was still there, but barely. I couldn't believe it. That week I woke up when my daughter did. I actually would stay with her in the morning rather than hide in bed until my husband would scream at me telling me to be a mother. I would eat breakfast, something I really didnt do since early high school. Those extra minutes of sleep were more important to me. I did so many chores, not even thinking about it. I did morning walks, even though previously I had told my husband I was done for the summer since it was not safe to expose my infant daughter to triple digit Texas heat. He had suggested morning walks as a possibility, but I told him there was no way in hell that I was going to do it. ...but I did. I remember walking with her and feeling so happy. I remember asking myself why. I couldn't think of any reason. I had never felt that way before. I guess all this time I was suffering depression, I just had nothing to compare it to.Then I started menstruating. That happy energized feeling quickly went away. Its been two weeks since then, and Im back to feeling the way I did before the levothyroxine but with the supplementation. I understand that it's gonna take a long while before my levels will be fine and can heal, but I think that was just a sick cruel joke. Showing me what normal was supposed to feel like, only to take it away.When I started to notice my energized state reducing, I finally built up the courage (I know, sounds odd) to tell my husband about my discovery. He was actually happy to find out, because now I could be fixed. ...somewhat. He mentioned noticing a HUGE change in my personality. I must've been pretty bad, because like I said earlier, I did this all in secret. He had no idea I was being medicated, therefore there wasnt purposely looking for anything.Explaining my brain fog was difficult since I basically kept that a secret for a decade. Especially since any issue with mental health has a big stigma around it. Now all my attention/focus/working memory problems made sense to him. I didnt know it was all related. I just had this fuzzy feeling in my forehead.Anyway, so now my mom and husband can't make fun of me for being crazy for wearing a jacket and being under a blanket when it's 110 outside. (Because we all know that somehow effects the AC).",
            "post_id": "9271763",
            "timestamp": "1373324596",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        },
        {
            "answer": "To supplement the good info already give to you, I just wanted to mention that hypo patients often find that they are too low in the ranges for Vitamin D, B12 and ferritin.   So be sure to get those tested and addressed, if need be.Even more important, you need to make sure you have a good thyroid doctor.  By that I mean one that will treat clinically, by testing and adjusting Free T3 and Free T4 as necessary to relieve symptoms, without being constrained by resultant TSH levels.  Symptom relief should be all important, not just test results, and especially not TSH.In prep for you next doctor appointment, I think you can get some good insight from this link, written by a good thyroid doctor.http://hormonerestoration.com/Thyroid.html",
            "post_id": "9271818",
            "timestamp": "1373325666",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "I just wanted to add besides having a lot of the symptoms you had/have that Vitamin D deficiency can cause you to become very exhausted. I take 2000mg/day to stay normal and my husband takes 4000/day. It depends on the person. My sister in law was so low she was exhausted. her vitamin D was only 5. She had to take something like 25,000 once a week until she got it up to normal somewhere around 30-60. So, the vitamin D can add to your problem and so you have to keep taking it and checking it. I also was/am iron deficient. I was in stage II anemia and I would work but go home and lay on the couch then sleep all night. I found out sort of by accident that I was iron deficient. It takes months to get back to normal or longer and you have to stay on it to keep it up. I went off the iron because the doctor said your iron is normal now so you don't need it anymore. So about 6 months later I was back to being anemic again. So, I went to another doctor and he just tests me once or twice a year. I have gone down on it over the years but still take some. Just thought I would tell you that it may not be just the hypothyroid. BTW I also had the dizziness and vertigo (room spinning) from the thyroid and I fell a couple of times. So, the thyroid is important to get right. I'm still at 4.9 and our lab range is around.3-3.8. I am at 25mg of synthroid and may go up to 50mg to get it in range. I'm still tired and not able to lose weight and my fingernails are peeling. I don't have Hasimotos at least I don't think so.They only tested the HPOab. My doctor won't test the T3 and T4 . He thinks that it shows up in the TSH or something like that. I don't know why he doesn't test for the other Hasimotos antibody. I may get a second opinion. I wish you luck. Let me know how you do.mkh9",
            "post_id": "9271935",
            "timestamp": "1373327720",
            "user_id": "user_1415174",
            "user_link": "/personal_pages/user/1415174",
            "votes": "0"
        },
        {
            "answer": "oops, I mean TPOab.mkh9",
            "post_id": "9271946",
            "timestamp": "1373327947",
            "user_id": "user_1415174",
            "user_link": "/personal_pages/user/1415174",
            "votes": "0"
        },
        {
            "answer": "The light headed symptom I remember very well!  When I finally found my good doctor she was going over stuff from another doctor and specifically asked if I got lightheaded since my heart rate in office was 50 bpm.If you read through any of the prescription full prescribing information being on birth control will warrant an increase in medication.  Estrogen binds T4.  I found that out the hard way.  My menstrual cycle has never been regular.  I have no idea when it will show up and it has been that way my entire life. In my search in finding out what was wrong my doctor suggested possible endometriosis sitting on my bundle of nerves.  (Now I know the severe muscle pain was caused by hypothyroidism and low oxygen) I went in for laparoscopy surgery and they found a tiny amount of endometriosis, diagnosed adenomyosis and fallopian tube congestions.  My uterus is the size of a grapefruit and the color of a fireman's hat!  So all was not lost with a bad thyroid doctor I guess.  Because I did find out why I was never able to carry after my first child.",
            "post_id": "9271998",
            "timestamp": "1373328895",
            "user_id": "user_5525017",
            "user_link": "/personal_pages/user/5525017",
            "votes": "0"
        },
        {
            "answer": "You should also get tested for diabetes.  A lot of your symptoms match it. Ask for an A1c test and possibly a glucose tolerance test.",
            "post_id": "9272055",
            "timestamp": "1373329870",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "I mentioned that in 2009 I went to the doctor because my husband thought I might be diabetic, but there was no issue there.In 2012 I was tested for gestational diabetes, which in addition to bloodwork, required fasting and drinking a horribly syrupy beverage.I don't think I have diabetes. At least not currently. I also have no family history, but like with hypothyroidism, that doesn't mean I can't still get it.",
            "post_id": "9272405",
            "timestamp": "1373336641",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        },
        {
            "answer": "I've had just about every hypo symptom except weight gain. It's just in my genes; it's quite difficult for me to gain weight, no matter my diet or degree of hypothyroidism. So being thin does not mean you are not hypothyroid, just as it does not mean you are hyperthyroid. Some of us are just thin. Anyways, I did not find relief from being cold all the time (and several other symptoms like hair loss, heavy periods) until I switched from levothyroxine (T4-only med) to a T3/T4 combo med-- Naturethroid, in my case. You might want to keep that in mind if the levothyroxine does not bring relief. I wish I could say I am completely cured of brain fog and fatigue, but that is a work in progress as I continue dosing up the Naturethroid and taking iron to raise ferritin. Anyways, hope you start feeling better soon.",
            "post_id": "9272668",
            "timestamp": "1373341346",
            "user_id": "user_5733490",
            "user_link": "/personal_pages/user/5733490",
            "votes": "0"
        },
        {
            "answer": "Note that, the concentration of  naturethyroid or Armourthyroid, is not consistent from batch to batch. So, that is why they switched it. But also why you may be feeling off sometimes. I guess we are stuck with what we have.mkh9",
            "post_id": "9333331",
            "timestamp": "1374960829",
            "user_id": "user_1415174",
            "user_link": "/personal_pages/user/1415174",
            "votes": "0"
        },
        {
            "answer": "It's not true that batches of Armour and/or Naturethroid are inconsistent. They are just as consistent as any other thyroid medication and dessicated hormones have actually had less recalls than Synthroid.  Many people do much better on desiccated hormones.I'm guessing that ahmee still has symptoms, is because her levels aren't high enough to alleviate them.UmmYeahOk....... were you able to get the lab reports from your doctors to see what all has been tested and what the results were?",
            "post_id": "9335580",
            "timestamp": "1375032397",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "I got test results from 2011-2012 (1994 was the last time I had blood taken) Of all the blood taken during this century, TSH was only tested twice, and by itself. 2.53 in 1/2011 and 2.08 in 12/2011. They were tested because I complained of being fatigue. I was a week pregnant during the last test and did not know it yet. I would've thought that during my pregnancy they would continue to monitor TSH, but they didn't. My guess is that I was hypO, but my TSH remained in range. I got preeclampsia because I was hypO, and my pregnancy might've be what finally caused my TSH to elevate.I had more blood drawn Friday and I should get the results back today if not tomorrow. I had them add Free T4 and Free T3 as well as the two antibody tests. The thyroid panel they use did not include anything useful.",
            "post_id": "9338041",
            "timestamp": "1375113098",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        },
        {
            "answer": "I also developed preeclampsia with my child, I had to have him induced early than expected.At around the 6 months I started getting symptoms, but my doctor at the time just told me it was due to being a \"new mommy\", so I was treated for depression.Long story short, had thyroid storms, RAI, TT, now on medication and so far (knock on wood) doing well.I heard somewhere that sometimes after giving birth that graves disease is trigged.",
            "post_id": "9338153",
            "timestamp": "1375115586",
            "user_id": "user_438526",
            "user_link": "/personal_pages/user/438526",
            "votes": "0"
        },
        {
            "answer": "Postpartum thyroiditis. Supposedly the first phase is hyper and either returns to normal or becomes hypo. Sometimes even that is temporary, but occasionally lifelong hypothyroidism can occur. But I'm sure you've already read up on all that already.I think the connection between preeclampsia and thyroid disease is fairly new. Most of my research seems to have been published in 2012, and that ties preeclampsia to hypothyroidism, not hypothyroidism to preeclampsia. The belief is that now, if you've experienced this, it may be an early predictor of thyroid issues in the future. ...long future, like when women become senior citizens. I did however discover a few online publishings a that did in fact conclude that thyroid problems DURING pregnancy can lead to preeclampsia, but they were published AFTER my daughter was born. It will be a year in August.When I came in for a Pap smear, I asked about hormonal testing. I was thinking I had an imbalance of something else, and wondered if they could test it there, or if I needed to see someone else. The doctor wanted to know why I thought this, so when I explained my reasons, she referred me to mental health services that would do a free evaluation. I did eventually go, and from the answers I gave, they wanted me to do a 6 week, partial in-patient visit, where I would have to come in every weekday from 9am to 2pm. That's crazy! Since I came voluntarily, I was allowed to decline services. Now that I know that I truly was hormonally unbalanced, and know just what the thyroid can do to a persons mental function, I am so thankful I didn't go that route like so many other thyroid patients.",
            "post_id": "9338532",
            "timestamp": "1375123812",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        },
        {
            "answer": "Got my results todayTSH 6.310 .45-4.5 HIGHT4 11.1 4.5-12T3 uptake 26 24-39Free Thyroxine Index 2.9 1.2-4.9Free T4 1.26 .82-1.77Free T3 3.6 2.0-4.4TPOab 475 0-34 HIGHTGab 22 0-40 but there's a note that says on Aug 19 2013 the range will change to .0-.9So thanks to the added tests, the doctor was able to determine hashimotos, and is going to increase my meds. He is also going to refer me to an endo. He feels comfortable treating me, but said that it was my call. I decided to go with an endo anyway, considering that none of the other tests were added until I asked for them. I would have just been treated for TSH until results show normal.It's also my birthday today. \"Happy Birthday! You got Hashimotos!\" =)",
            "post_id": "9342342",
            "timestamp": "1375220690",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        },
        {
            "answer": "I  am so happy you have an answer!  :) But I am sorry it is autoimmune.  I have no experience with that.It is so sad how bad other people can make us feel when we don't know what is wrong.  It's like all of a sudden we decide not to be the person we were for decades! We are either crazy, lazy, or a hypochondriac.  When, in the end, our body was screaming for help.We constantly drug our tired bottoms to the doctor and computer searching for relief-all alone.  If I watched a sibling, partner, or friend go through what we have....I would scour the internet for answers and give my undying support.  Even before my hypothyroidism....",
            "post_id": "9344580",
            "timestamp": "1375284041",
            "user_id": "user_5525017",
            "user_link": "/personal_pages/user/5525017",
            "votes": "0"
        },
        {
            "answer": "So the endo woke me up this morning telling me they had an opening today for a consultation appointment. I went and based on symptoms alone is increasing my meds from 50mcg to 75mcg, and switching from generic to the real one. I told him that I was concerned about this, as my other doctor just recently increased it to 50, and had only been on it for 5 days (including today). I told him that I was worried that such an increase would make me hyper. He assured me that it was fine, and suggested that I alternate back and forth between the 75 and 50 for about a week so that my body could get used to it.The autofill was pretty quick, and I got a text from my pharmacy that it was ready before I even drove by. Im not gonna pick it up though until Wednesday evening. That's when we usually go to the store. That way I'll be on the 50 for at least a week.I told him that my main symptoms I've had for 10-15 years, but he thinks it all started from having a kid. My TSH was normal before pregnancy, but was never tested during for some reason.In 6 weeks he's going to test for TSH, free T4 (but NOT the Free T3), b12 (which was high before), ferritin, and vitamin D.Does any of this seem odd to any of you?",
            "post_id": "9360101",
            "timestamp": "1375736705",
            "user_id": "user_5693931",
            "user_link": "/personal_pages/user/5693931",
            "votes": "0"
        }
    ],
    "post_id": "9271165",
    "question": "Hello everyone. I've been a lurker for weeks now, but this is my first post. Over 3 weeks ago I found out that I had a TSH of 13.34. Now I don't know anything about T4, T3, or antibody numbers, so don't bother asking. All I know is what the nurse on the phone told me. \"The TSH was elevated.\" \"It was 13.34.\" \"The range is .45-4.5\" They prescribed me levothyroxine, and told me to call them after 4 weeks to schedule a retest in 6. They didnt say anything at all about having hypothyroidism. I had to find that out all on my own. I'm assuming they'll say more when I do go back. I'm just happy that I finally have an answer, especially since I went in thinking I had a vitamin deficiency, and they saw that I had a 9 month old baby with me. Apparently new moms are supposed to feel like crap.Anyway, Im mostly posting because despite recently having a child, and experiencing preeclampsia, I believe that I may have been hypO for a long long time, but am not real sure due to my history.Major symptoms:Brain fog started in 2003Cold feeling started in 1998I've experienced several other symptoms too, these just seem to be more obvious, and constant. It's always taken me 2 or so hours to fall asleep, even with a routine, so I thought nothing of it. Just something Ive experienced since childhood. I could say that 1998 might've been the start of being more tired. I slept for 16 hours once in 1999. Didnt think anything of it as I just assumed teenagers slept a lot, and I had over exerted myself. As I got older I just assumed some people required 8 hours of sleep, others 10, but then 10 just still didnt feel good enough. This year is the first year I finally took care of my sleeping, by this I mean taking Benadryl. I was finally able to sleep within 30 minutes of trying. But by gaining these additional hours, it still wasnt enough.Anyway, so the thing is, I could say it all started in 1998 with the coldness, but in 1998 I was underweight (100 lbs). I remained 100 lbs up till 2007. I then started gaining 5 pounds a month, but stabilized at 115 because I switched from drinking nothing but cokes to water at work, and diet drinks at home. Just this one little change seemed to prevent any more weight gain. So I had assumed the weight gain came from going from a job where I was constantly on my feet to one where I sat on my butt all day. Also, by then I was 25, and just assumed my metabolism also may have slowed due to aging, as I also started to get grey hairs. I ended up gaining 10 more with the pregnancy last year, but at 125, I am extremely thankful, especially now that I know how much harder it is to lose, and how easy it is to gain while hypO.I just don't understand it though. If your metabolism is much much slower when hypO, how come from 1998-2007, during which I was cold and had brain fog, I was underweight and could eat or drink anything without any worry? I would question being hypER, but reading the symptoms, I don't appear to have ever had any. I mean, there was an incident in 2001, where I was so anxious and nervous I was nauseous for two weeks, but that's it. Only threw up once during that whole ordeal. Everything else seems to point at hypO.Anyway, next week I plan to see if I can get copies of any and all blood work that my OBGYN did last year, as well as when I visited a different doctor in 2009, because my husband thought my laziness and desire for sleep was diabetes. Id assume at some point my TSH level would've been looked yet. Yes, I know that TSH alone doesn't tell the whole story. I'm just curious though what the number(s) was/were, since the symptoms existed then.",
    "timestamp": "1373312523",
    "title": "How long might've I been hypO? Can you be 10 pounds UNDERweight and hypO?",
    "user_id": "user_5693931",
    "user_link": "/personal_pages/user/5693931"
}