{
    "answers": [
        {
            "answer": "Cranberries help with uti's by creating a \"slimy\" surface so the bacteria slips away BUT not for those of us who make calcium oxalate stones!So while many take it for prevention at can cause us stones!  My Urologist was the one who preferred low dose antibiotic therapy vs. cranberry capsules for prevention!Chocolate, coffee, less red meat .. all helpfulI have fruit juice issues!WELCOME .. I'm sure others will jump in to help I'm sure!Make sure you keep your appts esp with the BP issues and check out our BP tracker!Let me know if you need help finding it!C~",
            "post_id": "3687927",
            "timestamp": "1227307613",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "A good alternative to using cranberry is something called D-Mannose.  This is the sugars in the cranberry that prevent the infections from attaching without the acids which are an issue to me and the oxaltes too!  I use the crystals and have found the one from NOw through vitapal as the most reasonable.In truth diet can help but with MSK stones are formed more because the defect in our collecting system does not allow the urine to drain properly.  Keeping your kidneys flushed out is the most important thing we can do!  Distilled water is best since it does not contain the lime or minerals other waters contain that can increase our problems.(We have a softener and reverse osmosis.)MSK being connected with pre-eclapmsia?  Does not make much sense.  Pre-eclampsia is cause by the position that the placenta attaches.  This usually means that it attaches too close to the cervix so when you start dialating the placenta comes first.  This would be found on an ultrasound early on and a c-section would most likely be the scheduled mode of birth.It could possibly be connected with an increase in toxemia, since that is the increase in proteins in your urine etc. and causes toxins to build up in your body.  I have had 5 natural births without issues, MSK is something your born with and I have stones in all my pregnancies.  There are ways to prevent toxemia, drinking plenty of water!!!  Also eating complete proteins.  What that means is not relying on too much meat for your proteins but including brown rice and beans etc in your diet to balance the protein levels in your body so more are absorbed.The biggest problem I had in all my pregnancies was infections.  In my first pregnancies it was bad enough that they put me on a low dose antibiotic throughout the pregnancy.  In the last tow we avoided infection mainly by drinking lots and lots of water or caffeine free healthy herbal teas.  The D-Mannose is also a natural way to prevent pregnancies.It is very important though that you are under a doctor's care during your pregnancy to prevent problems, and always discuss with them anything you take including naturals!I hope this gives you some assurance and direction.  Good luck with your pregnancy and keep us posted on how you are doing!Shelly",
            "post_id": "3689475",
            "timestamp": "1227353013",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        },
        {
            "answer": "Oh Shelly, you've reminded me and want to share with the community .. Urinary Tract Infection .. me, too .. a major when I was pregnant and tested negative for 3mos .. had preterm labor and was told I was too nervous and not drinking enough -- yeah, right!  Finally it cultured postive and it was  STAPH infection going willd!!!!!!  Within 36hrs of the right antibiotic I was fine and held onto my baby AND never got dehydrated again ..Nerves, I don't think so .......UTI's tend to flare and I had gallstone issues, too with my pregnancies.C~",
            "post_id": "3689544",
            "timestamp": "1227357282",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "yes, my 1st episode of kidney stones occured when my daughter was about 6 wks old.  She was born by c-section due to unrelated issues.  I also had an urinary tract infection at the same time.  This time I had the stones 1st, but they did not find a UTI.  however, the OBGYN mentioned that I have group b strep in my urine a few weeks ago......  This pregnancy is much more complicated than the 1st.I am trying to drink more water, and it makes me pee like crazy!  unfortunately I never really liked water, and I know I still don't drink enough of it.  I only like it ice cold, and I have to force it in.  I noticed it sometimes makes me nautious, and this occurs weather pregnant or not......  I noticed I can trick myself into drinking more water by sipping the flavored waters all day.thank you so much for responding to me.  I feel a little down after finding out I have this problem, as it is yet another issue to add to my long list of medical problems...  Wondering how one person can have so many different problems.  Does anyone else have a big list?  I am wondering if there is a connection for some of these problems.",
            "post_id": "3690710",
            "timestamp": "1227382203",
            "user_id": "user_690241",
            "user_link": "/personal_pages/user/690241",
            "votes": "0"
        },
        {
            "answer": "Yes, I have a long list ..........I have to run offline, but for starters I have gallstones, thyroid, and skin cancer issues, recurring UTI's and kidney stones ..........along with this MSK. but all well maintained and 100% healthy!I had micro blood and atypical cells in my urine but thankfully no cancer .. the cells were inflammatory from all the movement inside the medullary of the kidney changing their structure.Key to MSK is finding a good doc and shopping around ..............I went thru 2 to find the one I like a lot!",
            "post_id": "3690858",
            "timestamp": "1227384984",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "Unfortunately, we find that most MSKer's that have complications have MSK andFibromyalgia,or RA orThyroid orRTAor in my case I have MSK, with a chronic infection, Interstitial Cysitis, PFD, Pelvic Congestions Syndrome, Allergies , I think those are all the big ones.  My URO and I personally have a theory that for thos with a chronic pain, a biofilm infection actually sets up with the many calcifications we have.  This is not a have hearted thoery and I can back with a book of research etc.  The interesting things about this is the James Bryers, did a research article on medical biofilms and found that the reaction of the host is to have increase histime and mast cells.  Both of these have been linked to a number of chronic illinesses and auroimmune diseases.  Is there a connect... i think so but that has yet to be proven by somemore more knowlegeable then I.I would really encourage you to watch your urine using the dipsticks ar home.There are also many natural ways to treat or prevent infections, garlic is one but not in high doses when your pregnant.I also take a natural product called Silverbiotics from Amercian BIotech Labs.  The best retail price on it has beent through Vita-Pal.  This has knocked my infection out along with my orals since have surgery to remove all the stones.Of course you need to check it out and ask your doctor before taking anything esp. pregnant but esp. having strep in your urine that showed.  The tough thing about us is that the bactreria are usually within the stones soo, do not slough off in enough numbers to be found on typical urine tests or cultures,  In pregnancy this could be a concern so I would highly encourage you to discuss it with your doctor.  I have some articles I can send you privately, since I have the pdf, for you to take to your doctor,  The big problems is most doctors are not familiar with biofilm infections since, the research has only recently begun to catch up with the problems associated with it.  The biggest thing is prevention and if you know you feel like you have an infecton finding a doctor that will treat it, even if your urine appears to be normal.  I hope this makes sense.  Again I have had 5 normal deliveries etc., nfection can increase the problems in pregnancy, so prevention is important!Shelly",
            "post_id": "3692807",
            "timestamp": "1227443433",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        },
        {
            "answer": "Thanks Chitchat and Shelly, I also have allergies, both food and non food, and a thyroid disorder as well as asthma......  I think it is interesting how these things can be connected.  I am glad I am not the only one who thinks this is possible.this is my 3rd pregnanccy.  My 1st I had a beautiful little girl by c-section.  The second unfortunately was ectopic.  As soon as I found out I was pregnant again I went to my doc to confirm pregnancy is where it belongs.  Thank God it is.",
            "post_id": "3693668",
            "timestamp": "1227462573",
            "user_id": "user_690241",
            "user_link": "/personal_pages/user/690241",
            "votes": "0"
        },
        {
            "answer": "I've been on the thyroid community for over 2yrs .. definitely stop by ... I am one of the leaders over there and we'd love to have you stop by and say hello there, too!http://www.medhelp.org/forums/show/73C~Partial thyroidectomy 1/07",
            "post_id": "3694630",
            "timestamp": "1227480081",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear about your loss..., I iwll keep you in prayer though this pregnancy..,I know waht a relief it must have been the day you saw your little one safetly in th womb.You are definately not alone ..., and I am glad you found the board.Do keep us posted on your pregnancy!  I believe that eveything should go well.  Prevention is the most important thing and by coming and asking it is obvious you are going to do all you can to keep this baby healthy!  There are also several boards, as Cheryl mentioned there are several other boards too, that also might be able to help you with some of the other issues you live with, around this pregnancy!again your in my thoughts and prayers!Keep us posted!Shelly",
            "post_id": "3696024",
            "timestamp": "1227523653",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        },
        {
            "answer": "I'm raising my hand now as I can relate to pregnancy and multiple health disorders. I was thinking I should write a book.. My doctor was more scared than I was going into pregnancy with Hailie my daughter who is now 6! healthy as a horse and no complications throughout my pregnancy even though I battle with Rheumatoid Arhritis, Firbro, and MSK, during my pregnancy I passed stones. I had to get off all my meds except prednisone. I did have re curent UTI infections. I HAD NO ADVISE, NO PAIN MEDICATION GIVEN AND WOULDNT HAVE TAKEN IT HAD IT BEEN PRESCRIBED,...BUT I REALLY REALLY WANT TO RESPOND TO mornings1st light about the water issue. HATE IT RIGHT! YOUR NOT ALONE ...I KNOW what your thinking...WATER IS AWFUL NASTY ...... (OFF TOPIC) FOR THOSE OF YOU WHO HAVEN'T SEEN BABY MAMA, THE BLONDE WHO SPEWS OUT THE DRINK SHE'S BEEN GIVEN....... ( THAT'S ME) TINA FEY HANDS HER A CUP OF WATER TO TAKE HER PRENATAL VITAMINAS AND SHE SPEWS IT AND SAYS WHAT IS THIS!!!!!!!! AND TINA REPLIES IT'S WATER!, I WAS LIKE OH MAN THAT'S ME! I HATE WATER, AND I REALIZE THAT IS ALOT OF MY ISSUES........ BUT YOU ASKED WHAT IS THE BEST SOLUTION FOR THIS AND IVE BEEN MEANING TO POST THIS. OK. PLEASE KEEP IN MIND IM NOT A DOCTOR BUT THIS IS WHAT I HAD TO DO DURING PREGNANCY AND STILL TO THIS DAY . OK. 1. I AM OFFICIALLY A DR PEPPER JUNKIE, DONT DRINK COFFE, BUT  I CANNOT LIVE WITHOUT CAFFEINE UNFOURTUNATLY DURING PREGNANCY I DID AND EVERYONE AROUND ME PAID FOR IT. :) BUT I DRINK PROPEL LIKE IT IS GOING OUT OF STYLE. I BUY THE PROPEL SHAKERS. AND PUT IT IN MY WATER BOTTLES AND DRINK AT LEAST FOUR BOTTLES OF THIS A DAY . I LIKE GRAPE PROPEL. THAT'S JUST MY PREFERENCE, THEY HAVE LEMON AND BERRY I JUST LIKE GRAPE DONT KNOW WHY AND GET THIS THE MAIN INGREDIENT. IS CITRIC ACID, SODIUM CITRATE,AND POTASSIUM CITRATE! THAT'S ALL WHAT WE ARE PRESCRIBED TO LIMIT OUR STONES, BUT NOT ALL CAN TAKE THIS IN HIGH DOSES..... BUT I THINK THE MAIN FOCUS IS HYDRATION, IT CANT HURT ONLY HELP THE KIDNEYS AND THE PREGNANCY.I CANNOT TAKE THE HIGH DOSES OF THE UROCIT K ANY LONGER BECAUSE I HAVE FOUND THAT IT INCREASES MY INFECTION ISSUES.BUT HOPE THE PROPEL MAY HELP AID IN YOUR WATER DRINKING IM THE SAME WAY IT HAS TO BE FREEZING COLD THE ONLY WAY I CAN TOLERATE IT IS WITH THE PROPEL I CAN DRINK IT HOT LIKE THAT AND REALLY ENJOY IT THAT'S JUST ME. I LIKE CRYSTAL LIGHT STRAWBERRY ALSO BUT THAT CONTAINS A VERY VERY VERY HIGH DOSE OF CAFFEINE AND WOULDNT RECOMMEND THAT FOR PREGNANCY MSK PERIOD. I ONLY DRINK THAT WHEN I REALLY NEED AN ENERGY BOOST AND AND TRYING TO COUNT CALORIES. I ALSO LOVE ICED TEA, THAT'S ANOTHER FLAW... IM TRYING TO LIMIT, IVE LIMITED MY CAFFEINE TO 1. D.P. IN THE MORNING, OR I REFUSE TO GET OUT OF BED, AND ONE GLASS OF ICED TEA FOR A TREAT FOR BEING GOOD ONCE IVE DRANK AT LEAST THREE BOTTLES OF WATER THAT DAY. MY PROPEL I CONSIDER WATER.. :)  THAT'S JUST ME AND LIKE I SAID IM NO DOC. I JUST WANT TO HELP IN ANY WAY TO RE INFORCE THE WATERAND ASSURE YOU YOUR PREGNANCY WILL BE A SUCCESS... NO STRESS! MY SON AND DAUGHTER ARE THE ONLY TWO GREAT HEALTHY  THINGS MY BODY EVER PRODUCED, I HAD TWO NINE POUND HEALTHY BABIES, AND THEY ARE NOW VERY INTELLIGENT CHILDREN DESPITE ALL THE INFECTIONS AND DIFFICULTIES MY BODY WENT THROUGH EVERY DAY I CARRIED THEM. I HAD MY SCARES, BUT I HAD MY PRAYERS AS WELL AND I AM FOURTUANATE THAT I WAS BLESSED TO BE ABLE TO CONCEIVE!WOW I'VE HAD A BAD DAY AND I JUST MADE MYSELF FEEL BETTER, THINGS COULD BE SO MUCH WORSE.I'M SO GRATEFUL FOR MY BABIES.TAKE CAREAMIE",
            "post_id": "3700201",
            "timestamp": "1227593285",
            "user_id": "user_686246",
            "user_link": "/personal_pages/user/686246",
            "votes": "0"
        },
        {
            "answer": "Amie's Suggestion is a good one. (Thank you for taking time to respond!)However,  I can not have any citric acid because of my IC.  When I am really nauseaous and I can't stomach the water I drink grape juice cut with water 1 part grape juice to 2 parts water, but that is because i am not supposed to drink grape juice either however, but you can!I know Propel is much healthier than most things,so may be the perfect solution but it is i important to watch the sodium intact.  I was surprised, I watched a slide presentation done by a Urologist in Canada, he said they thought just increasing you fluids would solve the stone issues. However when they did a research study, they actually found that if people just increase their fluids, they usually go for drinks high in sodium.  This would include gatorade. soda etc.  What they learned is a high sodium intake actually increases stones!  Soda also should not be limited in pregnancy but it should not be over done either.  Over doing the sodium can also increase risk for toxemia etc.Just something to think about when we increase our fluids to make sure we are doing it with things that help nor hurt stone formation etc.Shelly",
            "post_id": "3700537",
            "timestamp": "1227612109",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        },
        {
            "answer": "I've heard on the grape propel good results by many people.  I belong to a 6week weight loss challenge over on Weight Loss & Dieting and I HATE TO DRINK WATER and there is an awesome link over there on alternatives.  I'm going to post the link in the next post if I can find it for you.Also, the water consumption tracker on my profile (a mini version of it) is a way to help motivate yourself AND show your doc's your progress!!!I had 4 babies and never knew I had MSK or stones.  I had only the one issue due to a staph infection that I think happened cause of multiple internal ultrasounds or it helped stir the kettle.  All 4 children are healthy and today are 10, 11, 15 & 17 and all are ok in the MSK dept to date but my oldest had her gallbladder removed in January due to hereditary dysfunction like mine most likely is and not from MSK.So glad you were able to give so much insight and help us with this great question:)C~What about beer?  Not that one would drink when pregnant but overall?  Is that good for kidneys or bad .. not sure if it's a myth or not.",
            "post_id": "3700572",
            "timestamp": "1227613778",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "Ideas for drinking liquids other than water .. keeping in mind it's from the Wt Loss Community and all ideas are general water replacement questions in general and not necessarily good for us MSKer's.  We can look thru the list and make a new one and take off any no no's on the list if we want and I can post in the health pages .Water Alternatives:http://www.medhelp.org/posts/show/633499C~",
            "post_id": "3700575",
            "timestamp": "1227614009",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "Some links to \"sister\" communities to keep handy that may be helpful.  If you stop by any of these communities, let me know and I'll let the Community Leaders know we referred you over there and they'll be happy to answer any questions ..Fibro/CFS - Dr. Garth Nicolson was a guest in early October and there is a wealth of info to be found on this community!http://www.medhelp.org/forums/show/44Arthritis -http://www.medhelp.org/forums/show/163C~",
            "post_id": "3700580",
            "timestamp": "1227614342",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "thank you all soooo much...  The flavored waters I was referring to were in fact the propel.  I have loved it ever since I first tried it.  My favorite is the lemon.  I also really like the peach flavored one.  I know they have a lot of vitamins in them though, and thought I should ask my doc if it would be too much when added with my prenatal vitamins....  i have my next appointment on Dec. 5th.",
            "post_id": "3701558",
            "timestamp": "1227633436",
            "user_id": "user_690241",
            "user_link": "/personal_pages/user/690241",
            "votes": "0"
        },
        {
            "answer": "LEMONS!!!!That reminds me .. with calcium oxalate stones, my Uro told me I can drink as much lemon as I want all day long.  Fresh lemon squeezed into water .. whatever way I want it, will be helpful.  Kind of like the citrate I guess in the Urocit-K.  But guess what, I get little sores on my tongue from the acid .. so within limits works best for me.Let us know what your Dr says about the extra vitamins in the water + the prenatal'sMy dr. suggested I take magnesium, too and B6 I believe it is ... those help inhibit stone growth, too.Cheryl",
            "post_id": "3701642",
            "timestamp": "1227634602",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "Magnesium helps your body to better absorb the calcium instead of putting it in your urine.  B-6 competes with calcium for the oxlate crystals so that they attach and pass out in the urine instead of making stones!Lemons are very good to help prevent stones... so was OJ by the way,however both are BIG FLARE triggers for ICer's.  The acidity gives you sores in your mouth it will give me sores in my bladder:)!That is why it is important for each of us to seek and find things that work for us, but work with your doctor to do so as much a you are able!!Shelly",
            "post_id": "3704015",
            "timestamp": "1227675466",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        },
        {
            "answer": "Hi, I want to encourage you about this pregnancy! MSK does not mean you will have problems with the pregnancy. I never got pre-eclampsia from MSK and I am LOADED with stones. the only complications I had were Uti's with all 3, Gall stones with #2 and Gestational Diabetes with #3. They are all healthy. I ended up getting IV pain meds every few days for the last two months of #2 due to gall stone attacks. I was diagnosed with MSK when she was 6 weeks old, although I passed my first stone when #1 was a few weeks old, and was hospitalized and told I was full of stones to the point of them looking like bone on X-ray. No-one mentioned MSK until after my second baby.I am so sorry about your loss and glad this baby has implanted in the perfect place!Nancy",
            "post_id": "3704140",
            "timestamp": "1227677906",
            "user_id": "user_592774",
            "user_link": "/personal_pages/user/592774",
            "votes": "0"
        },
        {
            "answer": "Hi thereI have MSK in my right kidney and I am 34 weeks pregnant with my second child.  I have had a urine infection now for about 4 weeks and have completed 3 courses of antibiotics, but at the end of each course the infection will flare up again. I was supposed to start a low dose antibiotic to take for the rest of my pregnancy, but I cant get rid of this initial infection in order to start this treatment. I was wondering if you would have any advice for me as I am starting to get quite anxious.  Also, I am under midwifery lead care this pregnancy, meaning fewer hospital appointments. Do you feel I should be monitored more closely than this?Many ThanksCara",
            "post_id": "7844906",
            "timestamp": "1333992900",
            "user_id": "user_2107427",
            "user_link": "/personal_pages/user/2107427",
            "votes": "0"
        },
        {
            "answer": "Writing you again lol :) I read her comment and saw what you posted and yes, I believe that is true about diet not being able to prevent stones; it can in the case of kidney stones but not when you have MSK I believe, as you said. My urologist initially told me to collect my stones to see what foods I could stop eating to prevent them, but then told me it was pointless because I had MSK and they will come back no matter what I stop eating, and that (as you also said) the thing everyone keeps telling me, which is to drink lots of water through the day.Not to sound completely stupid, but is distilled water pretty much any water you buy in bottles? I shouldn't be drinking tap water anyway I'm sure just for health in general, but really hate dealing with these stones and issues and will do ANYTHING to try and prevent it...You are obviously very knowledgeable on this topic and honestly I have seen more care and consideration from you to others on here than I have got from my own doctors lol. My urologist saved my life when I first discovered I had stones because I was so infected I was septic, rushed into hospital at 8am with fever and pain and had to be operated on immediately, stent and whole deal, and I wouldn't get better and they didn't know why.. they discovered after that I had stones and had an infection that got so bad my body couldn't even fight it off (I was only about 21 then)... pretty scary stuff.. then to find out it's something you can never get rid of like regular stones for most people, but I am trying my best to cope! It's been lithotripsy at least once a year which I hate doing but the doctors there are fantastic.... but yea after babbling here my big question this time was --- should I still get my stones tested to determine what kind they are? I believe he told me he thought that I produced two different types of stones (there are three altogether of possible types of stones I believe)... but he never ended up actually testing them... he just didn't test them because he said you can't stop MSK stones with diet changes... but should I still determine to see what type (s) my stones are (bc of comments I see on the forum regarding diet.. I'm a bit confused about that does it really matter what you eat depending on the type of stones you have even if you have MSK and they will basically come back no matter what?? (I've asked my doctors this many times but it doesn't seem anyone cares to offer a straight answer or even an answer at all)... and also if I should get them tested, I suppose you can only collect stones right after lithotripsy right? Thanks so much in advance it feels very good knowing I will at least get some sort of a response from someone who understands!!!",
            "post_id": "7943639",
            "timestamp": "1336743332",
            "user_id": "user_2157773",
            "user_link": "/personal_pages/user/2157773",
            "votes": "0"
        },
        {
            "answer": "1. No stilled water or purified water is different from Spring water in that the minerals are removed.  For us Tap water depending on where can be very high in calcium or LIME, this can increase our stones and be an issue. You can have your water test, used a reverse osmosis water softener etc. or buy purified or distilled water.As far as stones, having them tested isn't a bad idea... knowing the type can help some and even more importantly if you can get them cultured. Knowing the types of bacteria in your stones as well as the makeup will not prevent all stones but can keep them from quickly and limit new ones. MY stones have not increase in years because of this. I do not really watch my diet so much but for me do limit calcium and do not take supplements. Knowing the type of bacteria that are within your stones can help you to keep them at least calm. So basically all things help a little but are not the cure for us that they are for other stone formers.Hope that helps some.",
            "post_id": "7948572",
            "timestamp": "1336917920",
            "user_id": "user_489228",
            "user_link": "/personal_pages/user/489228",
            "votes": "0"
        }
    ],
    "post_id": "3687697",
    "question": "I just found out that I have MSK because I had my second episode of kidney stones a few days ago.  The doctors discovered it about 4 and 1/2 years ago when I had my 1st episode and failed to mention it back then.  The problem is that I am 10 wks pregnant, and have done some research, and found it may increase chances for me to develop preeclampsia in pregnancy.  I was shocked to find that this second attack could have been prevented by a change in diet, and shocked that I was not told of my condition before. I am going to see a specialist in the near future about this, just waiting for my referral.  I discovered in my research that cranberry juice is bad for those of us with this disorder, and wouldn't you know it, prior to both incidents I was drinking it like crazy!  While I wait for my appointment, does anyone know anything more about what else is bad or good for us? thank you",
    "timestamp": "1227303969",
    "title": "just found out I have MSK at 10 wks pregnant",
    "user_id": "user_690241",
    "user_link": "/personal_pages/user/690241"
}