{
    "answers": [
        {
            "answer": "The \"hot\" sensation and burning sensation are very common with Mag sulfate administration.  Cardiac arrythmias are uncommon but certainly can occur.Why do you ask?",
            "post_id": "2768225",
            "timestamp": "1207941127",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "I ask this because the NHS Trust and other bodies that I had the misfortune to meet with said that this side effect is not listed, only  warmth or flushing sensation.The staff did not even tell me about any possible side effects before administering this drug to me and then the registrar told the midwife to commence the drug again after I had experienced cardiac arrythmias and the all over body burning.They didn't check my reflexes or anything and I told them to stop this drug and insisted that they did not give me the rest of the loading dose.Within three minutes of start to finish is when I felt all this.",
            "post_id": "2768329",
            "timestamp": "1207942571",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "The worst of the warm and sometimes burning sensation occurs during the loading dose (given over 20-30 min).  After that, the rate is decreased and the hot feeling goes away a good bit.I don't usually see a cardiac arrrythmias, but I do know they can occur rarely.Here's an article, but don't let it scare you.  Mag sulfate is VERY commonly used, and is a safe drug when used as indicated.",
            "post_id": "2768367",
            "timestamp": "1207943203",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "http://www.twinslist.org/magsulfate.html",
            "post_id": "2768371",
            "timestamp": "1207943223",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "I have already seen this site amongst hundreds of others that I have been using for research over the last three years.It is nigh on impossible to find one that specifies hot or burning sensations.Usually just flushing and warmth is all that is mentioned.Do you know of any sites that specify these words.",
            "post_id": "2768540",
            "timestamp": "1207945632",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "I'm confused.  Flushing, warmth, heat sensation...they are all just different words to say the same thing.Where are you going with all this?  Spending 3 years researching this for what reason?  Its a minor, temporary effect that is most pronounced during the loading dose.  We don't check reflexes until the person has been on it for at least an hour, so I'm not sure why you are really upset about that either..  If you didn't even complete the loading dose, then you were only on it very briefly.   There can be no permanent effects from such a very brief time on the drug, which by the way,Magnesium sulfate, more commonly known as epsom salt, is a naturally occuring mineral that is present in many foods, and is a component of many medications.  It can be taken orally for a laxative effect, but I'm sure you know all this if you have devoted 3 years of your life to researching it.Magnesium sulfate has been given to pregnant women for about 60 years, and is one of the safest drugs that can be given to stop labor, and prevent seizures that may occur when a woman has pre-eclampsia.",
            "post_id": "2768636",
            "timestamp": "1207947364",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "The maternity unit where I had my son do not agree with me and certainly would not agree with you about burning, heat, flushing, warmth being the same description for what is felt with this drug.It is because of there inadequate answers and denial about this drug and side effects that makes me continue to find information on internet. They state that burning is not on their list of side effects, so I must have had an adverse effect to the drug.I have read lots of differing views on this drug, a very mixed bag of good bad and indifferent.There have been many cases of side effects causing death, and putting women in a vegetative state, because the midwife has not administered it correctly to the patient, and by people misreading what another midwife has written, when they change shifts for instance.I am trying to find out if what I felt was because this drug was not administered correctly, which I am pursuing with the NHS Tust at present.Also my veins at the site of the injection raised up when they gave me this drug, as my partner witnessed.I just need to know why they did not check anything at all, given that they did not check my reflexes etc after these reactions, especially if as they say, I should not have had these reactions per their list.The only lasting effects from this drug is how it has affected me mentally.I still can feel the burning sensation all over my body and the way that my heart was racing and I thought that I was about to have a heart attack.  This will stay in my brain for ever.",
            "post_id": "2770441",
            "timestamp": "1207986125",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "sounds like you're looking for a lawsuiti received the drug. i felt itchiness, burning, etc... honestly, any miniscule risk associated with it was worth the benefits of lowering my blood pressure.if you received the drug, you were not well. i had preeclampsia. it made me feel awful. ever consider that the feeling you were going to have a heart attack could have been due to the anxieties associated with your condition?",
            "post_id": "2770773",
            "timestamp": "1208004881",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": 0
        },
        {
            "answer": "I too had severe pre-eclampsia, but the side effects of this drug made me feel so much worse than the pre-eclampsia did. I did not even feel unwell that much because of the short bout of flashing different colours in front of my eyes, shortly after being given a pessary to induce my labour, and my three plus proteinuria and my blood pressure.I feel that had the medical staff forewarned me of any possible side effects of this drug, then I would have known what to expect.  The fact that they did not made these reactions a whole lot worse.It was definetely the administration of this drug that gave me the cardiac arryhthmias. And yes, I would like to sue this hospital trust if I could discover how they administered it to me etc.For the prolonged physocological damage that they have caused is unforgiveable at a time when this should have been a happy even, handled correctly!!I also had the veins at the injection site raise up significantly.I continued to give birth to my son without any more problems or any drugs whatever.",
            "post_id": "2770929",
            "timestamp": "1208009453",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "By the way, were you given any warning of side effects by the staff that dealt with you?",
            "post_id": "2770945",
            "timestamp": "1208009983",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "I'll try one more time.It is unfortunate that the staff did not tell you in advance that you may feel a sensation of heat during administration.  Even when administered properly, its my experience that the vast majority of women experience this.  Some feel it much, much worse than others.  We continue administering it anyway, although sometimes it is slowed down to try to minimize the effect a little.  Often, slowing down the loading dose doesn't help, though.No reflexes need to be checked (although checking reflexes IS part of assessing a patient with pre-eclampsia as a baseline).  The reason that reflexes are checked as a part of Mag sulfate administration, is that decreased reflexes are a sign of a build up of Mg to toxic levels in the bloodstream.  However, it takes quite a long time to get to this point--hours, at least of continuous administration.  Usually, Mg levels are drawn every 6 to 8 hours during administration.Mg sulfate can be QUITE irritating to the vein.  Often, we put cold cloths over the vein site to minimize the pain during the loading dose and shortly thereafter.It should be quite easy to ask for a copy of your medical records and see what dose you were given.  Usually, the load is 4 to 6 grams given over 20-30 minutes, followed by 2 grams an hour, to a max of 4 grams an hour.   This is the standard, usual dose given to everyone.I do not routinely warn any patient of possible cardiac effects.  Generally, I have not often seen a patient complain of such effects, unless they become panicky about the burning (heat, flushing) sensation.  If a patient has been on Mag sulfate for quite a while, they can complain of chest pressure and discomfort, in which case an EKG is done to be sure they are not suffering from myocardial ischemia.  But this almost never happens unless the pt. has been on Mag for many, many, many hours and has an abnormally high Mag level.You are very lucky that you did not progress to develop eclampsia (the onset of seizures) after you did not receive an adequate administration of Magnesium.  I have seen a few women seize with eclampsia, and in some cases their babies have died in utereo during the seizures.  Most of the time, even untreated, pre-eclampsia will not progress to eclampsia.  But unfortunately, we cannot predict who will or will not progress to this dreaded outcome.You were very fortunate.  You are obsessing about something that is far in the past now.  You have a healthy child.  My advice is to stop obsessing about this and look towards a bright and happy future with your child.  I doubt you will be successful in suing the NHS unless you can prove grave damages, and that you were given an improper dose of Magnesium.I wish you the best, and will have no furthur response for you.  I've given it all I can, as an experienced labor nurse of 30 years who has administered this drug, and others, for many, many years to very high risk patients.Best of luck to you and your familiy.",
            "post_id": "2771000",
            "timestamp": "1208011023",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "It does not state on my medical records what the dose was.  I have a copy of all my notes and my sons notes and it only states per protocol.with no figures mentioned, but I have on the advice of an organisation asked for that protocol, trouble is there is nothing to compare with as it does not mention anything on my notes.This was not the only issue with this Trust, If it were that easy to put this traumatic event to the past I would not be looking still for answers on this subject,or pursuing a case against a certain midwife with a midwifery council, on the issue of my son getting progressively ill throughout the day on the post-natal ward  and ending up as an emergency in special care with hypoglycaemi by evening.This is why I came on forums like these to meet other women who have suffered like this..",
            "post_id": "2771165",
            "timestamp": "1208014098",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "Let it go.... Be grateful for your health and the health of your little boy!",
            "post_id": "2771613",
            "timestamp": "1208024315",
            "user_id": "user_191371",
            "user_link": "/personal_pages/user/191371",
            "votes": 0
        },
        {
            "answer": "Have you ever experienced any side effects like these?Unless you have you would not know what I have been through.Only reply if you have please as I need to link up with women that have gone through the same or similar to me.",
            "post_id": "2771694",
            "timestamp": "1208026105",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "I was given mag sufate when I was in preterm labor ay 29 weeks....they told me I would feel like my blood was boiling and that is exactly what it felt like....I was so hot I thought I was going to die, and YES I felt fine when I got to the hospital, and YES the mag sulfate made me feel HORRIBLE....but that was not a reaosn to waste 3 years worrying over it. I was happy that the stuff stopped my labor, but its not like I am signing up to have it done again lol....but basically, you experienced exactly what they say you will...end of story. No lawsuit there!",
            "post_id": "2771751",
            "timestamp": "1208027285",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": 0
        },
        {
            "answer": "I was at term when I was given this drug, so I did not need it to stop me from going into premature labour, but to stop the likelihood of any eclamptic fits.The reason I have been looking for over three years for answers is because, unlike you I was not told any thing about this drug or any possible side effects from it, before, during or after this drug was administered.There in lies the problem!And then the registrar told the midwife to re-commence this drug without consulting me yet again. I refused because of the dreadful effects I had felt.This was not the only bad experience that I suffered at this maternity unit at that time.Not interested in lawsuits.  Just need honest answers and information during this time, and after.I only want responses from people who know what it is like to be given this drug, without any information prior to being given it, and who have had the same adverse reactions to it as I had, that is: BURNING FROM HEAD TO FOOT, VEINS STICKING UP AT THE INJECTION SITE AND CARDIAC ARRYTHMIAS!!",
            "post_id": "2771793",
            "timestamp": "1208028329",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "to tell you honestly, i don't remember if the hospital told me or not. i doubt my husband would either. there is so much stress and anxiety associated with that day it's a blur. i saw my ob the morning i was sent to the hospital. he did mention they would give it to me and that i'd feel burning and itchiness.my protein in urine levels were +4 (if i understand correcty, that is the highest). my bp was very high, but not terrible. i hated the side effects but it was necessary. in fact i hated the entire experience. but i have an amazing little girl who has erased all this from my mind.",
            "post_id": "2771905",
            "timestamp": "1208031283",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": 0
        },
        {
            "answer": "I would not be so unhappy if anyone would have told me, but the fact is that they didn't.  Unfortunately, I remember everything from that evening.  I cannot forget all that went on.After going for a routine antenatal appointment at my gp surgery, to then being admitted to the Maternity Unit, it was just a series of awful events.My blood pressure was reasonably high before I was admitted, but shot up rapidly once in there.  They gave me labatelol at one point in the day because my blood pressure was extremely high.  I had three plus proteinuria which was tested for 24 hours.I also had colourful visual disturbances like I have never had in my life before, shortly after having been given a prostin pessary.Tried to report it but the buzzer did not work on the ward.Then several other things went on that were anywhere from mildly annoying to pure bad care.Then taken to the HDU unit (high dependency unit) with a bed for emergencies,not suitable for a women in labour.Left on my own three quarters of. the time, even though I was told that my condition was worsening, treated like a piece of meat being told what to do by the staff.Door left open to all and sundry.Full lights put on by the registrar who was rude and arrogant and did not explain the possible side effects of this drug to me, and then after I had the initial loading dose start, experienced various side effects.He then told the midwife to re start the drug, without saying anything to me, except that I should have felt a warm feeling only.This burning sensation and itching is not recognised by this maternity unit.It is not on their list of side effects.  They just said in the notes that I had experienced adverse side effects.So I am pleased for you if you consider that this drug was worth the side effects, but I honestly did not know what was going on and felt like I was going to die anyway with my heart rhythm all over the place and the burning.I am glad that you have recovered from your ordeal but I have not had any honest answers from the trust.They have not even written the notes up properly to say what dose they gave me.And to top it all, my baby became ill because a midwife ignored my cncerns all day and my son was admitted in the special care unit with a glucose level of just 1.1 mmols.  Minimum should be 2.5mmols.  I only found this out by research after.So despite having a beautiful three year old, I cannot erase the sadness and anger that I have inside me because of the mistreatment I suffered at the hands of the so called caring profession!!My son, unfortunately, is a constant reminder of all that happened.",
            "post_id": "2771999",
            "timestamp": "1208033350",
            "user_id": "user_477634",
            "user_link": "/personal_pages/user/477634",
            "votes": 0
        },
        {
            "answer": "\"Magnesium Sulfate per protocol\" is a proper order, if the hospital has a written procedure/protocol to administer it that way.  Our hospital orders are given in the same way.As I said many times, what one woman experiences as minor, a woman being given the exact same dose of the drug may perceive as horrifying.  You were in the latter category.  Of course they should have warned you of the possible sensation of warmth/burning, pain at the injection vein, and the nausea that often accompanies Magnesium administration.  Its unfortunate that they didn't, but you then made the decision not to proceed with it any longer.  That is your right.  So all in all, you had the drug for only a very little time (minutes), and to all of us, devoting this much time and energy into researching and obsessing seems bizarre.It sounds like you need to write up every single one of your multiple other complaints and send it to the director of the hospital and the maternity unit, if you have not done so.  The director of the hospital can then address the issue with the staff involved.  This happens frequently at every hospital.  If they chose not to follow up or take corrective actions, then you do not go to that hospital again.If your son suffered brain damage from the hypoglycemia, you may have an actionable case against the midwife.  Otherwise (and from reading your other post it seems you have done so) you can file a complaint against the licensing agency who governs the midwives.  They will handle it from there.And from then on, after doing those 2 things, your job is to continue being an excellent wife and mother to your son, who you unfortunately see as a cruel reminder of the miracle of life, instead of a strong survivor who you protected sucessfully, and who you love more than life itself.  A child is the evidence of love between his/her parents, not a cruelty.  YOU are imposing the cruelty in your relationships with him by your inability to let this distant incident rest.I know you do not see it this way, but your fixation over this temporary effect is not normal--not even close to normal.  Therapy may help you express your anger, disappointment, and vent your frustrations with a professional who can guide you into a healthy outlook.  I suggest this out of compassion, not criticism.",
            "post_id": "2772071",
            "timestamp": "1208034650",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": 0
        },
        {
            "answer": "So, if you are not looking for a lawsuit, what are you so worried about? It happened, its over, and done with.....move on! If you are not looking to sue them, then stop worrying about it. 3 years is a LONG time to wait to file suit over something like this anyway, so I guess my advice to you would be to consult a lawyer about all your concersn about your care and see if they believe you are wasting time or have a case. Either way, its over and done with now, and you survived so that is all that should matter. I was not told that it could cause my body to start shaking uncontrollably and I also was not told I would have that shakes when I was given tributaline (spelling) but I am not searching ever site in the world looking for whether or not someone should have told me about that side effect.....it was given to you so you did not have a stroke or seizures from your blood pressure, so be glad you are alive and had to suffer a little discomfort....no one said anything related to child birth was easy!!!!",
            "post_id": "2772075",
            "timestamp": "1208034707",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": 0
        }
    ],
    "post_id": "2768205",
    "question": "Hi, is there anyone else who has suffered all over burning sensation and cardiac arrythmias from being given Intravenous magnesium sulphate in a High Dependency Unit while suffering with pre-eclampsia.Please reply as soon as possible as I have been searching answers on the internet for over three years now.",
    "timestamp": "1207940939",
    "title": "pre-eclampsia",
    "user_id": "user_477634",
    "user_link": "/personal_pages/user/477634"
}