{
    "answers": [
        {
            "answer": "There are different types of nerve fibers that deal with pain and sensation to the limbs.  To simplify it, think of it as large and small fibers.  EMG can only check the large fibers whereas more specialized testing is needed to check the integrity of the small fibers. Autonomic testing which is done in special labs typically at academic centers (ours is run by Dr. Robert Shields, a neuromuscular specialist here at the clinic) evaluates the small fibers by looking at things like your ability to sweat.  If the tests come back positive, then this confirms the presence of a small fiber peripheral neuropathy.  It doesn't tell you the cause, which unfortunately is unknown in about half the cases that we see despite extensive laboratory testing. SYmptomatic treatment is the same for small and large fiber neuropathies including neurontin, elavil, and other pain meds (assuming that the underlying cause is never found).As for lab testing for peripheral neuropathy, I'm sure your doc has checked for B12, diabetes, thyroid, electrolyte abnormalities.  In addition, serum and urine protein electrophoresis is routinely checked to look for immune mediated causes.  ALso, autoimmune/inflammatory markers such as ANA and sed rate are other things we check.You what feel what you feel and even though neurologic testing has not shown anything, it doesn't mean you're not experiencing the symptoms.  It just means that the testing that is currently available can't pick it up or it's non-neurological in nature. Good luck.",
            "post_id": "1817205",
            "timestamp": "1050814800",
            "votes": 0
        },
        {
            "answer": "Where do people go for help when their condition cannot be diagnosed and there are no explanations for their pain, numbness, stiffness and other debilitating symptoms.  Sometimes the medical tests do not show any abnormalities for several years and the medical community dismisses them for being \"nutcases\" or imagining their problems.If most people had a choice of being well again or to accept a life racked with pain, mobility problems, stiffness, numbness, etc.  then how many would chose to be in that category.  Prescribing antidepressants or labelling these patients as being psychotic, only increases their stress and adds to the burden they are afflicted with.  Only when you lose your quality of life, do people actually realize what a disabled person goes through.How do you measure or identify pain, who can tell where the numbness and stiffness begins or ends?  Just because the tests show normal, it seems that most doctors tend to dismiss their symptoms and tack it up to anxiety or stress. When the patient can't receive a diagnosis, they are in \"limbo\" as far as eligible for insurance benefits and also lose out on treatments that may benefit their conditions.The ordinary person does not have the financial means available to run from doctor to doctor or invest in alternative therapies. They usually end up feeling very helpless and watch their bodies get weaker and end up losing control over their lives. Friends usually drift away, marriages break up and people stay away.If people have a diagnosis like cancer or a recognized illness, person tend to relate to them more.  If you fall and break your leg or in an accident you may suffer lots of pain, but eventually you will heal.  For those who are trapped in bodies with ongoing chronic pain and don't have an explanation for it, it is much worse.  They lose faith that there will be a healing and that their condition will improve.Some people are in their prime of life when they are struck down with these disorders.  It is a long time to suffer in silence realizing that most people think you are crazy and there are no support groups available to help out. I guess people really don't understand unless they walk in the other person's shoes.  My heart goes out to all those afflicted with pain, numbness etc. and I hope that there will be progress made in understanding what these people go through.The Canadian",
            "post_id": "1832978",
            "timestamp": "1051074000",
            "votes": 1
        },
        {
            "answer": "I've been having the same weird tingling/vibration in my feet and hand for the last year.  I've had a MRI(head & spine), EMG and all kinds of blood work but still no diagnosis.  I was refered to an environmental doctor since I think it may be caused by the new house I'm in.  I'm being checked for pesticide posioning and a few other toxins.  By any chance are you living in a new house/apartment that was treated with pesticides?  Or that has new carpets?",
            "post_id": "1832979",
            "timestamp": "1051074000",
            "votes": 0
        },
        {
            "answer": "Hot Chicken Paste-- for some reason, I had the impression you are from the SF Bay Area. If that's the case, I recommend either Dr. Bernard Wilcosky, a pain doctor at Sequoia Hospital in Redwood City, or Dr. N. John Anegawa, a neurologist in Palo Alto.Both will take you seriously (Wilcosky has personal experience with chronic pain). Anegawa is more aggressive with drugs, while Wilcosky is slow and systematic. Both are happy to answer questions.I agree with the frustration of hearing that a test was negative and therefore we are \"fine.\" What a screwed-up system if we find ourselves actually hoping for positive results!",
            "post_id": "1832986",
            "timestamp": "1051246800",
            "votes": 0
        },
        {
            "answer": "I'd be happy to give it to you by email-- what's your address?",
            "post_id": "1832992",
            "timestamp": "1051419600",
            "votes": 0
        },
        {
            "answer": "I have identical symptoms to rtchrg440 plus I have been on neurontin (1200mg/day)for several months. Just switched to Tegretol and neither has reduced pain. Epidural helped for one day and 5 pack steroid resulted in first two pain free days since December of 2002. Is there any way to communicate directly with rtchrg440 ?. You are providing a wonderfull service....",
            "post_id": "1833005",
            "timestamp": "1051678800",
            "votes": 0
        },
        {
            "answer": "Your explanation just shows how different doctors give different diagnoses for the same thing. The etiology may never be known because sometimes it is just too difficult to figure out, or the physician does not know the answer (but they may not admit it).  I actually feel much better when I know that my physician has to search for an answer and we have a team approach for the solution.My PN was due to a tetanus shot over 2 years ago.  I continue to have intense burning pains, tingling, difficulty walking, fatigue, etc.....  Recently, I had a B-12 shot that was supposed to help regenerate the nerves.  The next day my hands were folded toward my wrists, toes were also cramped, and both were numb.  This also happened a month after the tetanus shot. I saw the doc the next day and, of course, he couldn't see anything wrong.  Pain cannot be seen expect by the best of them.  The common denominator in the two shots is aluminum and there has been a lot of research going on now to find out what it does to people.As far as medications, I take Neurontin but I am trying to keep the amount down by taking Motrin (600mg) and Tylenol (500mg) 3-4 times a day.  I exercise several times a week and stretch my fingers a lot so they don't seize up on me.  Ouch.Thanks.   ....jande....",
            "post_id": "1833024",
            "timestamp": "1052110800",
            "votes": 0
        },
        {
            "answer": "nurse at work has friend who complains of numbness/tingling from nipple line down to feet, history of diabetes, but symptoms go away when lying down, too. Also some slurred speech at times. Worked at Tinker AirForce base many years..............anyone else having these symptoms?",
            "post_id": "1833034",
            "timestamp": "1052197200",
            "votes": 0
        },
        {
            "answer": "Over 2 monthas ago I started experiencing numbness and tingling in right foot.....weeks later the left foot.  Then really bad pain in my right leg, especially the calf muscle, that never goes away.  For the last 2 weeks i have been having tingling in my fingers and thumbs of both hands.  I have had an MRI that shows a bulging disc in the L5 area but the doctor does not think it is bad enough to be causing this.  He has referred me to a neurologist.........peripheral neuropathy.  In all this time i havent been able to work and it's very depressing staying home and dealing with this pain all day.has anyone else had this when the MRI \"doesnt look that bad\" for numbness and pain according to the doctors?I've started physical therapy and that is helping me more than anything else.thanks,",
            "post_id": "1833106",
            "timestamp": "1053406800",
            "votes": 0
        },
        {
            "answer": "My daughter woke up about a week ago with numbness in her legs.It seems to be located on the inside of her legs from her big toes up to about three inches above her knees.She had two MRI,s,one for her head, and one for her lower back.Blood testing was done,all came back O.K.. Anybody else have that type of, or,location of numbness? We are currently waiting to go for nerve testng next week. Any ideas? Thanks!",
            "post_id": "1833129",
            "timestamp": "1053666000",
            "votes": 0
        },
        {
            "answer": "ihave had numbness,tingling,stabbing shooting pain that started in my feet up to my back also had all tests done mri brain and back back xrays,emg,and alot of blood work,all of which has come back negative. I feelas though my doctor has given up on me.my last visit in may he told me he would keep me on observation and my next visit would be in 6 months.. Iam so disgusted I dont know what to do. I currently am not able to workand am on 300 mg of neurontin which is not helping me am also taking anti inflammatory too.  help!!!!",
            "post_id": "1833160",
            "timestamp": "1054270800",
            "votes": 0
        },
        {
            "answer": "This is for the many posters on this board who report variations of peripheral neuropathy and MS-like symptoms, especially the many who are frustrated that conventional medical testing and workups have left you without solutions, or even diagnoses.In people who report sensory and/or motor disturbances, tingling, numbness, and other unusual sensations in BOTH upper and lower extremities, and/or the face, the cause is most likely not a localized lesion, nerve root entrapment, or other focal problem. These types of complaints smack of a systemic problem, one attacking the body's entire nervous system and possibly the cardiovascular system as well. Environmental exposures, namely chemicals should be suspected, especially when there is a history of such exposures.For at least some of you folks with these types of symptoms, I would strongly suggest you ask yourself whether you consume aspartame in your food. I would bet that many of you use diet products, especially \"sugar-free\" lines of products containing the now ubiquitous aspartame artificial sweetener (sold as \"Equal\" and \"Nutrasweet\"). The two amino acids making up 90 percent of aspartame are neurotoxins/excitotoxins in large enough doses, which themselves can cause problems with the nervous system. But the most harmful constituent of aspartame may be the 10 percent of the product that binds the two amino acids together -- methanol (wood alcohol). That substance breaks down in the body into first formaldehyde (used in embalming) and then formic acid (the poison in ant stings).Methanol is a powerful neurotoxin, one that may slowly be pickling your nervous system. The damage may be permanent, but you can at least halt the progression of methanol poisoning by halting your intake of the poison. There are, on the other hand, many instances of people having improvement in their symptoms upon eliminating aspartame from their diets.I certainly understand anyone being skeptical that aspartame is the cause of their problems, but there is an easy way to prove this suggestion wrong. Simply eliminate ALL aspartame from your diet for 60 days, and see if your symptoms improve. If you need artificial sweeteners in your life, there are at least four or five others that are available.Many of you have expressed great frustration at the inability of the medical profession to even identify the cause of your problems, let alone treat your illnesses. What do you have to lose by trying my suggestion?",
            "post_id": "1833164",
            "timestamp": "1054270800",
            "votes": 0
        },
        {
            "answer": "Same here everyone. Aspartame? never use it! 35 yr old male. Started having a sore arch in right foot months ago. Then one morning I noticed my feet (soles) felt tingly. Next day my whole feet were tingling. Like when a limb falls asleep. Day after that it spread up to my waist symmetrically. Both legs, butt, everything. Been eight days. Now middle of back has a touch along with small amount in left fingers. Blood work was fine along with MRI of entire spine. No cramping, or real pain yet. Feels like someones giving me a wedgie also in my groin/pelvic area. My feet and knees seem so stiff every day. Like they're petrifying. Going for a Nerve conduction next wed. I researched on the web and think I have PN. What else could it be? I have diabetes in my family history. And thought I was Hypoglycemic. I get shakey if I don't eat all thru the day. I've always had a shakey muscle thing as far as I can remember. Like if I hold my arm in a certain position while trying to hold a small object. Everyone dismisses it. It comes and goes. But like I said blood shows no diabetes.",
            "post_id": "1833548",
            "timestamp": "1057813200",
            "votes": 0
        },
        {
            "answer": "Bilateral neuropathies are often an indicator of methylcobalamin (methylB12) deficiency.  This can be deficient even if taking large doses of cyanocobalamin or even injected with cyanocobalamin if your body can't convert the cyanoB12 to the active methylB12 form.  It costs about $8.00 at the healthfood store to test this hypothesis.  The one brand my family and friendss have found to be effective is Enzymatic Therapy Bioactive B12; 1000mcg methylcobalamin.  Also you will neeed a high potentcy bcomplex and additional folic acid as cofactors.  A quick trial with the methylB12 could tell you much.",
            "post_id": "1833575",
            "timestamp": "1058072400",
            "votes": 0
        },
        {
            "answer": "I also have tingling and numbness in both feet and a lot of lower back pain. A cat scan revealed very slight bulging discs(2 of them) but not enlugh to cause my symptoms. Now they want to do nerve testing.  I have read all of the comments here on this site and am trying to find the Enzynatic Therapy B 12 methylocholmin form to try Could someone point me to where I can buy it?  Thanks",
            "post_id": "1833687",
            "timestamp": "1059714000",
            "votes": 0
        },
        {
            "answer": "The site www.enzy.com (Enzymatic Therapy home page has a directory of local stores by zip code.  Also, www.iherb.com and www.vitacost.com are two of the many internet site.  If you look up methylcobalamin in Google a bunch of paid advertisers will come up on the rifght offering it for sale.  Good luck.",
            "post_id": "1833713",
            "timestamp": "1059886800",
            "votes": 0
        },
        {
            "answer": "I would like to suggest that a \"slight\" bulge between (L4/L5) verterbrae can definitely cause sciatica, and if it is severe enough, peripheral neuropathy can develop.I was diagnosed with Diabetic Polyneuropathy in 2001. Problem is the initial disc herniation was in 1983, with several repeated injuries leading to a sciatic nerve spasm in 1989 that last 8 days. My doctors at the time and my chiro agreed that something serious had happened but didn't really know what it was. I went through a series of tests between 1995-98 but the results were generally inconclusive. Luckily, my doctor believed me. But that 8-day spasm created the pain associated with PN and in those days I went through sensations of intense cold (entire leg) and then packed my leg in ice because of intense heat. Eventually, most of the leg healed, leaving a badly nerve-damaged foot and ankle. By 1997, I found a name for my disorder shortly after my left leg began to pain me as the right had 8 years earlier.In 1994 I was diagnosed with carpal tunnel syndrome, which I thought was a bit off as I'd only had my PC two years. My research indicated that the baby finger is not nourished by the carpal nerve and it tingled along with the rest of them. In 2001 the specialists confirmed that I had peripheral neuropathies (stocking - both hands) over carpal tunnel syndrome.Somehow, when I finally had a full battery of tests at the (newly opened) Diabetic Neuropathy Research Centre in Toronto (2001), the doctors informed me that there was no doubt. I had Diabetic Polyneuropathy! I challenged their findings but was assured it was confirmed by the experts. What was I to do? At least I could get treatment and after 2 years I've managed to reduce the pain levels to an acceptable level. I was told that people can be glucose resistant for 10 years before they are diagnosed. I accept that but my spasm occured 12 years earlier and I have had many blood tests in the intervening years as I gained weight and edema resulted. Glucose levels was standard in most of those tests. My blood glucose measured 14 when I diagnosed and I keep it simmering between 5.5 and 6.9 (sorry I don't know the US equivants) most days now.I am looking into other causes for the ongoing PN discomfort and associated problems, but I know exactly when (Mar 19, 1989)and why I got neuropathy pain(By which time I had very little disc left and had a pinched sciatic nerve diagnosed 2001.)There are many causes of PN. I agree with others who have posted that you are your own best medical researcher. There are a lot of terms to learn and contradicting opinions.I wish you all the best,Lynne",
            "post_id": "1833740",
            "timestamp": "1059973200",
            "votes": 0
        },
        {
            "answer": "Lynne-i had numbness and tingling in my arm and fingers on one side as well as carpal tunnel like symptoms years ago in which i had nerve conduction tests done and the whole 9 yards.nothing was found.later i had nerve pain and sharp shooting pains along my shoulders and down my legs.this was caused by weak muscular support to my skeleton caused by growth hormone deficiency.after this diagnosis was made-- everything came into light.now i know why i was having strange unexplainable symptoms all these years (10-18).after being diagnosed with GHD-- my endocrinologist ordered a DEXA scan and it showed i have severe osteoporosis of the spine at age 34 due to the growth hormone deficiency.the poor muscular support and the osteoporosis--- caused my peripheral neuropopathies from poor support of my spine and nerves.GHD also affects neurotransmitters in the brain.i had a lot more from what i list here--- but this was the affects to my spine and related nerve problems.as you saw in my other post the studies relating diabetes, neuropathies, etc to low IGF-1 and GHD.hgfound.orgmagicfoundation.orggrowthhormonedeficiency.org",
            "post_id": "1833745",
            "timestamp": "1059973200",
            "votes": 0
        },
        {
            "answer": "Lynne-i had numbness and tingling in my arm and fingers on one side as well as carpal tunnel like symptoms years ago in which i had nerve conduction tests done and the whole 9 yards.nothing was found.later i had nerve pain and sharp shooting pains along my shoulders and down my legs.this was caused by weak muscular support to my skeleton caused by growth hormone deficiency.after this diagnosis was made-- everything came into light.now i know why i was having strange unexplainable symptoms all these years (10-18).after being diagnosed with GHD-- my endocrinologist ordered a DEXA scan and it showed i have severe osteoporosis of the spine at age 34 due to the growth hormone deficiency.the poor muscular support and the osteoporosis--- caused my peripheral neuropopathies from poor support of my spine and nerves.GHD also affects neurotransmitters in the brain.i had a lot more from what i list here--- but this was the affects to my spine and related nerve problems.as you saw in my other post the studies relating diabetes, neuropathies, etc to low IGF-1 and GHD.hgfound.orgmagicfoundation.orggrowthhormonedeficiency.org",
            "post_id": "1833746",
            "timestamp": "1059973200",
            "votes": 0
        },
        {
            "answer": "Have you found out any more what could be causing your symptoms?I have the same.Thanks",
            "post_id": "1833779",
            "timestamp": "1060405200",
            "votes": 0
        }
    ],
    "post_id": "1817204",
    "question": "I have been experiencing tingling sensations in both of my feet for over a year now.  Since it has started, I have seen a neurologist who has had two EMGs performed, lower and upper back MRIs, and full blood workup - including diabetes and two lyme disease tests.  Both EMGs were tested from my back to my feet, and they were said to be normal for a 6'-2\" male (my height).  Both MRIs had no signs of bulged discs or signs of MS according to my neurologist.  All blood work came out normal, including looking for heavy metals in my blood.  My neurologist says I'm normal even though these symptoms persist.  Things I can count on are that when I go to sleep at night, the tingling goes away.  When I wake up in the morning (even while laying in bed), the tingling comes back.  It will sometime \"pulse\" in my feet off and on, rather than just consistently tingle.  I can almost guarantee the sensation will always be worse around 2:00pm-3:00pm each day for some reason.  After experiencing the feeling for the first 4 months, I had a panic attack (my first one) which increased the tingling and my family doctor put me on Effexor, which he felt would solve problem, but it did not (it actually increased tingling).  Neurotin has been suggested but I rather try and investigate this more than just go on a drug to mask symptoms.  Could you recommend any other useful tests or reasons for this neuropathy?  At times the tingling is so intense the top of my feet are sore the next day.  Thanks much in advance - any advice is appreciated.",
    "timestamp": "1050728400",
    "title": "Cause of peripheral neuropathy?"
}