{
    "answers": [
        {
            "answer": "Your case does not sound typical for HIV neuropathy which usually becomes symptomatic later on in the course of the disease. This means that people usually have other manifestations of HIV like infections before they experience neuropathy like symptoms. And the symptoms of neuropathy, (like numbness and tingling) are usually in the lower parts of your legs and arms rather than the upper parts. It sounds like you may have a peripheral neuropathy which can be caused by numerous things such as diabetes, vitamin deficiencies, electrolyte abnormalties etc.., but HIV is certainly NOT at the top or even near the top of the list unless you have risk factors such as multiple sexual partners and needle sharing in IV drug use.Good luck.",
            "post_id": "1816068",
            "timestamp": "1020747600",
            "votes": 0
        },
        {
            "answer": "You may wish to go to www.neuropathy.org and/or www.braintalk.org and search out your condition as it relates to Peripheral Neuropathy.  I have no interest in either site, but am a PN sufferer along with Tarsal Tunnel Syndrome and Spinal Stenosis.  My Pn is caused by vasculitis.",
            "post_id": "1830927",
            "timestamp": "1020747600",
            "votes": 0
        },
        {
            "answer": "I have numbness and a mild tingle feeling in my left pointer finger; this condition has been present for approx. one week; had thought that the condition may be due to current medications (e.g., doxicycline - taking for prostate problem); are there any screening tests that are performed for this?",
            "post_id": "1830929",
            "timestamp": "1020834000",
            "votes": 0
        },
        {
            "answer": "Hi Rusty, sorry to hear about the pretty awful symptoms you are having to put up with.I also have very similar symptoms,along with others such as fatigue, visual disturbances, foggy head and others.What has your doctor given as a possible explanation for your symptoms. Has he done any blood tests, in particular has he checked your vitamin b12 level. I don't know what is causing your symptoms but there is no doubt that a b12 deficiency can cause great damage to the central nervious system if it goes undetected.Ask if he has checked your b12, and don't accept that it is normal without knowing what the actual result is. I know many doctors do not accept that you can have a problem if it is above the lower normal level (about 200pg/ml in the US).If it is anywhere in the 200's ask to have your methylmelonic acid and homocystein levels checked, they often can detect a b12 malabsorbtion problem when the serum b12 level still shows within \"normal levels\" if there is such a thing with b12.It may be nothing to do with your problem but it is definately worth checking out.Best of luckGraham",
            "post_id": "1830932",
            "timestamp": "1020834000",
            "votes": 0
        },
        {
            "answer": "Yes, my b-12 was found to be normal along with thyroid,diabetes,liver counts,and so on and so on. My pcp and nuero both believe my symptoms are not the result of any serious illness.My neuro says it is not at all unusual to expierence symptoms of numbness and tingling and be healthy.He also stated that neuropathy can occur without cause in up to 30% of cases.I'm having trouble accepting that i can be healthy and have all these symptoms.",
            "post_id": "1830936",
            "timestamp": "1020834000",
            "votes": 0
        },
        {
            "answer": "Rusty, you said your blood tests including b12 were normal, sorry to labour the point but did your doctor tell you what your b12 level was. I know from communicating with several people, who suffered a long time with this problem before being diagnosed, that they were told their levels were normal when in fact they were in that \"grey area\" that some doctors are either sceptical of or unaware of.If your b12 level was way above the 200's (pg/ml) then fair enough but if not don't overlook this, many doctors do. All you have to do is ask.Best of luckGrahamKris, I read your post also, I don't want to sound as if I have a bee in my bonnet (no pun intended) about this subject but again many people with b12 problems , were on acid blockers, like myself, for stomach problems and this can effect the way that b12 is absorbed into the system. If anyone is told they don't have a neurological disease and yet they have neurological symptoms this is an area which is greatly misunderstood, accept by the  good doctors who are aware the studies that have been ongoing over the past years.Again, it may not be your problem but have you had your vitamin levels checked, if not it has to be worth a try.I know your symptoms must be very worrying for you but hang in there, there are a lot of us in the same boat.Graham",
            "post_id": "1830941",
            "timestamp": "1020920400",
            "votes": 0
        },
        {
            "answer": "Hi, I'm 27 years old and last year in October 2001 I started having a stomach pain/disturbance that ended up in acid reflux (U know the gnawing pain in your throath that feels as if a semi-tire spinning slowly) . I took Prevacid and it got fixed. 2 months later my symptoms:1. Pain in the abdomen area (left and right) and a feeling of nausea. I feel as if I've been poisioned 1.5 months of constant sickness. Went to doctors (same routine depressed,  it's in your head etc.) I also started to have hypertension and panic and depressive attacks.Not because I was unhappy but due to the sickness.I also had a 38 hours insomnia that accompanied all of this. I knew then that I'm about to step into something very unormal with my body. I work out and I'm in good shape so this is not an issue.2. Not much later my nausea started to expand and I started to have some unexplained pains inside my head just as electrical pulses and sickening pressure at the base of my skull that felt as if I'm about to faint. The headache seems to be worsened after meals. I also had upper/lower jaw pain that was running through my teeth (randomly) as if I had taken severe bites out of ICE/LEMON. This is very weird since I was never sick in my life. I've been on blood pressure medication and serotonium resoration (paxil) I still believe that all this malfunctions are comming from the  middle of my body (abdomen area) I don't know if I have IBS or what in the world I have. It seems that if I allow air into my stomach and expunge it out I get a little relief (that one needs practice :-)) I've been in this condition for about 8 months already and still don't know what's going on. #2 also looks loose and not like it used to be before. I'm also affraid to drink water (paranoia of lead poisoning etc) Diet coke seems ok.3. February 2002, I started to have muscle spasms and involuntary twiches (small scale). When the nausea was severe; which it was for me for about 1.5 month, all I did is sit around and do absolutely nothing. I looked ok from the outside but something very weird was going on inside.  I'm in good shape and nothing is visible from the outside. I did notice when I had severe pains inside my brain that my pupils were contracting and expanding visibly like my heart beat. Very odd.4. Latest news, March 2002 now I have something new. Pain in my head is 80% less and the new adition is I get dizzy as if someone unplugs me for just a second. I get a sensation of motion sickness that lasts for just a fraction of a second and comes at random times.My teeth only hurt when I go to sleep (upper rabbit teeth) they feel as if someone is applying current to them and mostly when I lay on my back. What in the world is wrong with me.5. I started trying pot as some friend suggested. Yes it does help the nausea (more like it blocks it) but I get the \"current\" like pain inside my skull and the jaw/teeth pain instantly after smoking. This seems to be triggered by the weed. It does help me go through the night but with these side effects.I don't want to smoke weed, I'm not a drinker nor a smoker. Nausea seems to come and go and sometimes i feel sharp stabs around the liver area and sometimes in the opposed side in the pancreas area. Most of the time when I'm nausiated it comes from those two places.I did notice that if I interact and do things the pain goes in the background but I think that's about it. I just forget about it. I'm already sick entire of this weird illness. If anyone has any idea what's going on plz e-mail me.QUICK DESCRIPTION OF MY SYMPTOMS.A. Pain in the spleen area.B. Pain in the pancreas area.C. Pain in the middle upper abdomen.D. Pain in the liver area.E. Heat flashes.F. Weird discomfort.G. Bowels don't look normal, very loose and lots of      mucus. Long time since hard healty feces. only 10% of time they look ok.H. Trembling (I solder electronics every once in a while)and just found out that I can no longer hold the soldering iron steady (I'm 27)I. Vision blurring... not all the time.J. Stabbing pain in the eyes.K. Mild background pain at the base inside the skull daily.L. Stomach acid. (does not come up my esophagus)M. Motion sickness without being on anything.N. Sex drive down to 0.O. Even when I'm ok I still feel the nausea in the background just waiting to get me.P. That lead heavy pressure in the back of my skull radiating through my gums and snapping & popping.The only thing I can confess is that I do go to sleep very late at nights (computer geek) and being doing it for about 8 years. Still I've never had anything like this.The worst is that doctors don't know what this is.Speculation... IT's being  happening to many people lately starting in year 1999' and up.Anyone that experiences these symptoms please feel free to e-mail me to discuss them further or possibly to develop a pattern of everyone that has this, we might find out what's triggering these. Dust, detergents, animals, water, athmosphere changes, going outside, smoking marijuana, we need to know.Unless the government is restoring the country with our medicine money.****************UPDATE 05/01/02*****************Latest Update, my nausea/ibs symptoms subsided I now experience the back/base of the skull pain/pressure and random pulling on my teeth upper and lower. I also wake up with numb hands. I still have pains left & right of my upper abdomen. I also experince extreme teeth sensitivity only in my upper \"rabbit\" teeth but only when laying on my back.I can wake up with no pain then after any meal or a glass of water I instantly feel the pulling/lead sensation in the back/base of my skull. Also when this occurs I feel sounds as if wafers (popping & snapping sounds) slowly squashed in the back of my head at the base. When this inflating feeling occurs it stops just seconds from being intolerable I also feel as if air is being released through my nose. Activity seems to make these symptoms less painfull and sometimes if I get caught up in a discussion I even forget about them.It's still verry annoying since I had no health problems prior to October 2001.I still don't know what's wrong nor my doc.HELP!!l8r and good luck to everyone and I'll pray for all of us this condition is not something to be unserious about.I'd rather have stiches that this ****.***@****",
            "post_id": "1830940",
            "timestamp": "1020920400",
            "votes": 0
        },
        {
            "answer": "I've got one for the books, A 28 y/o, w/f, good health, starts getting tired, then withen one week she burns left arm dominant, spreads to her right arm,( tops of arms only in about a 2\" wide path from wrist to shoulder), when it gets really bad it spreads to her back (all over), and then to the tops of her legs ( left side first then right, tops only), she has had mri's, ct's, ekg's, emg's, and so on. She goes in the hospital anywhere from 15 to 53 days at a time, and has only managed to stay out the longest 3 months. 8 nuerologists have totally given up on her, and 2 have set her up for a Physic. consolt, inwhich they said it is not a physic. problem. So where do I go from here??????",
            "post_id": "1830949",
            "timestamp": "1021006800",
            "votes": 0
        },
        {
            "answer": "My right leg feels a sort of pain rather than cold when put into a cold shower-also the sole of my right foot feels cold when it is not.  I am wondering if a neuropathy caused by a fungal toxin at the dermal level could cause such a phenomenon.",
            "post_id": "1830956",
            "timestamp": "1021179600",
            "votes": 0
        },
        {
            "answer": "Has anyone here tried a good chiropractor? Many of the symptoms you are describing are nerve related, (face,eye,leg,arm,and yes, abdominal pain) which is what a chiro frees up. But, make sure you get those initial Xrays, or other tests necessary to make sure nothing is broken first. I also had many of these symptomsincluding the wierd stools.",
            "post_id": "1830965",
            "timestamp": "1021266000",
            "votes": 0
        },
        {
            "answer": "I was wondering about your conditions. I have MS and have had sight problems and all the other problems related to ms.. I use to drink.. but dont anymore because it made my right foot feel cold and numb in the morning. I now have really bad tingling in arms .. mostly left but right also. I do have carpal tunnel but when I went today to the plastic surgeon my nuero sent me to.. for the carpal tunnel... he said I have more than carpal tunnel because my arms go numb when they are being used at a level higher than my heart such as brushing hair... using phone etc.I wanted to know about your vasticulitis(sp?)I also get pains behind my left eye .. like a very bad head headache since I started taking Paxil.  I sometimes smoke marijuana for nausia... I find that I have worse symptoms in the morning... like an electrical buzz in the mornings after I have done this.My feet swell sometims and I just feel very tired although my system feels wired.I know I have MS... but some of the symptoms I have are unlike some of the other MS sufferers I have spoken to...Any ideas.?email - ***@****thanks",
            "post_id": "1830962",
            "timestamp": "1021266000",
            "votes": 0
        },
        {
            "answer": "My symptoms are those of PN (peripheral neuropathy) or so I am told.  Numbness, tingling, pain and weakness of the feet, legs, hands and arms as well as the tops of the shoulders, pain at the base of the neck.  Use a cane to walk and use the scooters in the stores to get around.  Have a handicapped parking permit.  It all started 3 years ago, or at least that's when i went to the docs.  At that time was only right foot, since then the other appendages have developed this condition.  As of about Jan. the arms and hands got involved.  Lot of shakiness, dropping things and running into things with my feet.  Doc now is concerned about ALS possibly being included.  Jury still out on that one, hope to know within the next week. New symptom this week in right shin and left forearm (these are the 2 worst appendages as to weakness, pain, etc.)---feels like someone has a knife in the bone and they are twisting it.  Concerned that I continue to regress.  Vasculitis is a disease, as I understand, whereby the T-cell and Leuko cells think that there is an antigen, or bad thing, and they attack it, in my case, thus far, only the nerves are involved as they are being \"killed\" off.  Possibility exists of it attacking major organs.  Possible treatments are long term usage of Prednisone which would probably lead to ostioporosis, or cyclophosphamide which has a possibility of degenerating any of the major organs.  In my case dr. said at best a 50% chance of curtailing the progression using the aforementioned meds.  Opted not to go thru with the meds as figured I run the risk of major organs being involved anyway and why take the chance of expediting the problem.  The vasculitic neuropathy was determined via a sural nerve biopsy on Feb. 18th of this year.  Have to say that my life is going down hill all of the time, unable to do the things that i did in the past.  I hope for you that your condition is not vasculitis as the prognosis can be very poor and even fatal...Good luck,  Dennis",
            "post_id": "1830974",
            "timestamp": "1021438800",
            "votes": 0
        },
        {
            "answer": "Have your doctor order a hemoglobin A1C test for diabetes.  This test will give you an average over the past 3 months of your sugar levels and the best part is you don't have to fast.  Fasting blood tests are only an indicator of diabetes and could show normal in some patients.  I was diagnosed with peripheral neuropathy before I was diagnosed with Type II diabetes.  My fasting blood sugars were always below 120 mg/dl, a bit unusual for diabetics, especially since my A1C result was 10.3%.  Approximately 7 to 10% of diabetics go undiagnosed for many years experiencing a variety of neurological symptoms, including peripheral neuropathy, optic neuropathy and a loss of cognitive skills, because their fasting blood sugars and triglycerides were within normal limits and the medical community did not order a A1C test to \"officially\" rule diabetes out.  Good luck!",
            "post_id": "1830991",
            "timestamp": "1021870800",
            "votes": 0
        },
        {
            "answer": "I am 46 years old and was diagnosed with plantar fascitus about 10 years ago. One year ago I got tired of pain in both feet and lower legs with no numbness. An EKG revealed PSNeuropathy with no known cause. I am a hazardous materials inspector and have been exposed in my job to various organic compounds i.e. gasoline constituents of benzene, xylene,toluene and total petroleum hydrocarbons from underground tank removals. Doctors don't know how to test for organic only heavy metals. Heavy metals show non-detect, no diabetes, b12 is ok but now I have pain in both hands and swelling in hands and feet when I use them.  I take neurontin and elavil and it helps quite abit. This disease appears to be progressing and it worries me since I don't know the cause. Can anyone help.  My eyes and memory seem to be getting worse. Maybe I'm just getting old....",
            "post_id": "1831069",
            "timestamp": "1023080400",
            "votes": 0
        },
        {
            "answer": "I've read most of your e-mails and I hope that you can find some solutions to your problems. It's a shame that we have to go through so many sickness and doctor's really can't seem to help us. I'll pray for you all.Please help me. I'm pretty nervous about this one.I've been diagnosed with acid reflux (although I no bile comes back up in my throat). I refused to take the medications I was prescribed, i.e. Prevacid, Prilosec because they made the pain worse. Over the past year, I have been experiencing a tingling sensation (no pain, just annoying) on the left side of my back that is transient and feels as if it is going down and it moves over to the right side at times. I frequently get headaches (but that has been the case since I was born), but recently I have gone to a rheumatologist for what he diagnosed as costalchondritis (pain in the left side of my chest and it was hard for me to breathe. (I had just recently moved and I also work out using weights) He prescribed Celebrex. I took it a few times, but the pain subsided by itself. (Can you see that I am not in favor of modern medicine?) Anyway, I've been feeling pains, tingling, itching sensations in my feet (sharp pain under my big toe). I'm used to wearing heels, but in the past have been wearing flat shoes (could this be a source of my pain that my feet are too low the ground affecting my natural arch?) Anyway, I'm scheduled for a neurology appointment today and just found out that my primary physician wants to rule out neuropathy. What is that? Can someone shed some light on this issue? Has anyone ever experienced anything like this? Could this be a part of some underlying disease or infection? Please help if you can!!",
            "post_id": "1831108",
            "timestamp": "1023426000",
            "votes": 0
        },
        {
            "answer": "i have a foot drop on my left foot i have had seizure in the past but not now iam takeing neurontin for that but the dr. seen me to a anther dr.for back prombles but it dont heart what have i got does anyone know,",
            "post_id": "1831181",
            "timestamp": "1024462800",
            "votes": 0
        },
        {
            "answer": "Hi i was diagnosed with diabetes type 2 in Sept.  Several months ago I statred having a tingling in my back feels like a bug crawling up it.  Then it went to shooting burning pain. My Dr sant me to a neuroligist who had me take an MRI. the results show two bulging disks and the Dr, not the radioligist said there is a bone spur.  I am on trileppta and it is not helping much.  I am waiting to see an orthopedic Dr and am confused about who I should see him or a neuroligist. I got my diabetes under control fast lost 80 lbs and my hba1c was 10.6 when I first found out 3 months later 6.2 now 5.6. Please help I am in a lot of pain no pain in the legs just the backCyndi",
            "post_id": "1831406",
            "timestamp": "1028350800",
            "votes": 0
        },
        {
            "answer": "A related discussion,/posts/show/628829was started.",
            "post_id": "3411948",
            "timestamp": "1221579856",
            "votes": 1
        }
    ],
    "post_id": "1816067",
    "question": "I have been suffering from undiagnosed neurological symptoms for several years now.Symptoms include numbness in upper legs,occasional tingling in face, feet, and tingling can pop up anywhere occasionaly (back,forehead,lips, and toungue just to name a few)These symptoms although aggravating are mild in nature.These symptoms have remained largly unchanged over the last few years untill recently.Now my right foot feels like its FREZZING and wet even though its warm and dry to the touch.This sensation comes and goes and seems to get worse while sitting for long periods of time.Seemsto get better upon walking or on warm days.Does this sound like peripheal neuropathy? I have not taken an HIV tests due to the fact a positive result would possibly jepordize my career, and the fact im scared to death to take one.I am not in a \"high\" risk group for HIV so my doc thinks HIV is extremly unlikly.Do any of my symptoms sound suspicious for HIV desease? How does HIV related neuropathy usualy begin? Is it possible to have symptoms like numbness and tingling and NOT have anything serious going on.",
    "timestamp": "1020747600",
    "title": "Nueropathy ???"
}