{
    "answers": [
        {
            "answer": "Michalo,As you may know, we're not physicians here; we are volunteers with a lot experience related to diabetes.  Pls check out what you read here with your son's pediatric endocrinologist.I'm glad you clarified that the pain is not associated with ketones.Sometimes there can be digestive issues -- not necessarily related to diabetes.  Can you relate the pain to foods causing severe gas \"in general\" or perhaps foods that he's uniquely intolerant to?  Many folks with diabetes have difficulty with gluten/wheat products and others have trouble with dairy.  Are there any patterns that suggest either of these food types might be a culprit?Any associated diarrhea or constipation or stressors in life?  I agree with your parenting instincts that something is not right and encourage you to push further perhaps along the lines I've suggested here.  If \"once in a while\" means weekly or even monthly, it's surely worth finding the source & a solution.There'll be quite a bit of information out there lactose intolerance (dairy related), Celiac (gluten/wheat related) or possibly Chrohn's disease (digestive tract).http://digestive.niddk.nih.gov/ddiseases/pubs/crohns/http://digestive.niddk.nih.gov/ddiseases/pubs/celiac/http://digestive.niddk.nih.gov/ddiseases/pubs/lactoseintolerance/",
            "post_id": "2430278",
            "timestamp": "1124168400",
            "votes": 1
        },
        {
            "answer": "I apologize, I should mention that I had checked to make sure he did not have Ketones and he didn't - so that wasn't the case.",
            "post_id": "2434512",
            "timestamp": "1124168400",
            "votes": 0
        },
        {
            "answer": "I haven't heard about kidney stones & diabetes before at all.  In general, it's best to drink plenty of water to keep the concentrations of minerals in our urine from being extreme.I've read \"somewhere\" that our urine should be nearly colorless with jsut a bit of yellow; darker yellow means we're not well-enough hydrated.  I use that rule of thumb myself, but do check it out with your child's doc.Perhaps others will post with good info to share, too.",
            "post_id": "2434515",
            "timestamp": "1124168400",
            "votes": 0
        },
        {
            "answer": "It happens maybe once to twice a year.  I have never noted any reactions to food, but will keep a closer eye.  He does not have diarhea with this nor vomiting - which is why it's confusing me.  I have heard through the grapevine that people with Diabetes develop lots of kidney stones and was told children have these sort of symptons for years until one day, the pain is extreme and it's off to surgery.  I don't know how true this is and have never seen this kind of information posted anywhere.  Has anyone heard of this?",
            "post_id": "2434514",
            "timestamp": "1124168400",
            "votes": 0
        },
        {
            "answer": "My daughter had the same thing last year.  Every couple of weeks for about 8 months she would complain of stomach pain.  School nurse called me at least 3 different times to tell me Em was in the office with a stomach ache but had no other symptoms, her sugar was fine and did not have keytones.  She missed a lot of school, we went to the doctor several times, they did blood work and all kinds of tests but could not find anything wrong.  Every time she would complain and I would keep her home or go pick her up from school, by the time we got to the doctor's office the pain was gone or subsiding.  They suggested giving her antacids as they could not find anything wrong.  The antacids didn't help.  We started thinking it was all in her head or maybe she was doing it for attention.  In reviewing her sugars, I noticed that whenever she was running high for more than 24 hours, (not high enough to cause keytones in Em but maybe in others)it seemed like when she came back down she would crash and have a bad low, then level out and that's when she would get the stomach pains, after her sugar was back to normal.  That is the only thing we could pin point as a pre-cursor to the stomach aches.  She's on a pump now and so far we haven't had this happen any more.  I know that's not much help and I know how frustrated I was when this was going on with her.",
            "post_id": "2434520",
            "timestamp": "1124341200",
            "votes": 0
        },
        {
            "answer": "Your insight into the pattern for little Em seems to be quite relevant.  Our bodies endure some trauma with a sustained high and a subsequent low.  I could envision that the digestive tract and/or muscles supporting it could experience some element of fatigue thru it all.While we'd normally expect to see adverse symptoms during the high or low, itself, perhaps it's the total accumulatoin of all that that causes the symptoms in the aftermath.I'm glad to hear things have levelled out with the pump.  **Thank you** for taking time to share your insights here!",
            "post_id": "2434522",
            "timestamp": "1124341200",
            "votes": 0
        },
        {
            "answer": "I am wondering about my son and his similiar stomach pains.  He complains every day that his stomach hurts.  He has also on his own decided not to eat meat and he has limited his dairy.  He is only 12 years old but has had diabetes now for 10 years. I am worried the diabetes has damaged his stomach. Where can I find more information?",
            "post_id": "2434677",
            "timestamp": "1129611600",
            "votes": 0
        },
        {
            "answer": "I have experienced the same reaction.  The best way I can explain it is a gastritus... spelling.. and occasionallyafter that my body goes through a dumping syndrom. I usually end up with the trots.  I think it's part of the diabetes. I also think it tends to happen when I'm a little more stressed.",
            "post_id": "2919515",
            "timestamp": "1211087268",
            "votes": 0
        },
        {
            "answer": "i too have a 13 yr old son with type 1 for 7.5 yrs, he has had many days from school and holidays (so not wagging school) with stomach ache, also not feeling hungry. He is a faddy eater but make sure he gets the 5 a day. He is lathargic alot. The dr say the food could sit in stomach and take time to digest and this may be the cause. It is reasurring, if not sad, to know we are not alone. Not nice how many 'off' days he has.",
            "post_id": "3345094",
            "timestamp": "1220126793",
            "votes": 0
        },
        {
            "answer": "My son was diagnosed this past July with juvenile diabetes, he will be 3 October 11th.  He complains of stomach pain EVERY day.  I am very concerned.  I tried to address this with his pediatric endo however when i mentioned it to her she told em to speak to his pediatrician which I found a bit bothersome.  I was confused by that because, every time we had a visit with the endo they always ask about stomach pain, well if they are asking they must know something about it yet she referred me to his reg Dr.  After speaking with the pediatrician, she first asked we keep a journal of when he gets stomach pain and any other info about that time that may be helpful.  She then contacted a GI Dr. they asked her to have us get some blood work done as there are a few things that have been associated with diabetes.  As I read above, the gluten intolerance, celiac disease, but she also mentioned something with the liver could cause it, as well as something with his pancreas function that has also been known to not only cause pain in the stomach but through to the back as well.  We have not had the blood test yet, she said wait until we go into the endo next week and they will have to stick him for the ac1 test so they can just draw it at the same time.  So for those of you not knowing what route to take maybe talk to your pediatrician or go straight to the pediatric GI Dr...It is difficult enough to see your child suffer with diabetes.",
            "post_id": "3487402",
            "timestamp": "1223087771",
            "votes": 0
        },
        {
            "answer": "Some of this is redundant - I posted it on a different comment trail as well.Hello - I am the parent of a 9 y.o. with diabetes (originally said to be type 1 but now they are looking into MODY).  Our daughter is not Celiac -She has a very high pain tolerance but has had intermitent bouts with stomach pain over the past year and a half - which is when her diabetes started.OUR pediatrician and endocrine both state that they \"don't think her stomach pain is related to her diabetes\" - I know it is - she NEVER had this pain especially this often before her diabetes.I can say that we have gotten to a point of nearly ZERO stomach aches and pains by either removing or significantly reducing her intake of dairy (milk and cheese), processed foods, high wheat foods and complex carbs (bread, pasta, white rice etc).  We also increased her intake of fresh fruits, veggies and natural foods.  And added a fiber supplement (benefiber) just to help her body with digestion and processing what she does eat.  Her body did not have any problems diagesting the foods that she struggles with now before her diabetes.The pancreas has multiple functions in that it produces and secretes hormones (including insulin) and digestive enzymes necessary to break down carbs, protein and fat.I actually found this website just this evening looking for some type of study about the pancreas and its' other functions and how it could affect a person with insulin dependent diabetes.....We are 100% sure that this has helped our daughter - but I am determined to find a study or something to help substantiate our findings so that I can forward that information to other parents that deal with our same frustrations.It is such a powerless feeling to just watch my daughter in pain.  We are new to diabetes (11 months) but we have always been a very nutritionally conscious family.By keeping her diet clean and simple - we have made a huge difference in our daughters stomach aches.If we all keep reaching out to one another and working toward gaining more knowledge and empowering ourselves - hopefully we can figure this out so that our children don't have to suffer......as  KManis stated above - It is diffucult enough to see your child suffer with diabetes.",
            "post_id": "3490870",
            "timestamp": "1223180312",
            "votes": 0
        },
        {
            "answer": "To all the people with type one and stomach pain. Deffidently bring up celiac desiese with your doctor. 1 in about 33 diabetics have it and its very underdiagnosed. Unless you bring it up you may end up having loads of unnecessary tests.",
            "post_id": "3558869",
            "timestamp": "1224632474",
            "votes": 0
        },
        {
            "answer": "Everything that you have said about Em is what we are experiencing with Lexie.  She is 6 years old and was diagnosed with Type 1 Diabetes  1 1/2 years ago.  Just a month ago she started complaining about stomach pain around her belly button.  She only complains when she's really in pain.  She also loves school and have been missing a lot of school because of the pain.  At first it started out happening about every few days then it got more and more and now it was happening constantly.  She said that she was always in pain but at times it would hurt very badly.  It seemed to be morning and night and everytime she ate food.  So she started not eating very much.  She thin any way so she lost about 2 lbs over the past month.We took her to the pediatrician and they did an X ray of her stomach area and a blood test to test her pancrease to rule out pancreatitus.  They also tested for bacteria in her stomach/blood stream.   All tests came back normal.  He put her on Prevacid.So we kept track of her blood sugar, keytones and food eaten.  I did this for a week and then called her Endocrinologist.  I faxed them the log and they said that they didn't feel it was diabetes related and told us to go back to her pediatrician and have him do a Celiac test.We went back in to see her doctor and he took some more blood to do the Celiac test.  While at the doctors she seemed in no pain.  This happened all of the time.  No one seemed to be witnessing the pain she gets in so it seemed that no one belives us.  The pediatrician increased her Prevacid to 2 pills a day.  I had tried Prevacid for a week now with no change in the pain.  I tried Tums and Peptobismo.  Neither helped the pain.  I tried childrens Tylenol (doesn't help).  I also tried Hydrocodone (she had this from when she broke her leg) and it didn't phase the pain and infact she said it made it worse.So when we were leaving her doctors after the blood test for the Celiac, she doubled over in pain.   She was getting in the car and had just shut the door and was screaming.  I thought that she had shut her hand in the door.  When she could finally talk she said it was her stomach.  Of course I was panicking and was going to rush her to the hospital.  I thought it may be her appendix.  It ended up subsiding so I took her home but she was very lathargic and wouldn't eat.  We took her to the childrens hospital that night.They did a blood test and a CT Scan and tested for all kinds of things.  All came back normal.  While we were there the pain was gone.  So all the doctors saw was a little girl with nothing wrong with her.  It's been very frustrating.  They ended up saying that her bowels were slightly impacted (but she was always having daily bowel movements).  So they gave her an enima and sent us home.  So we still have no answers after all of this.We started exploring the posibility that it was in her head and possibly stress related to school.  Although we noted that over the holiday while she was out of school it continues to happen.  So that kind of discounts that.  Her blood sugar has been high for no reason.  I'm going to start watching for it to go high then bottom out and then get normal and see if that is when the pain happens.  She has had some keytones but not consistant.She's back at school and having less pain but she went through about 2 days of no pain and then it was back at one point.  So I'm not confident that this is over.  Nothing helps the pain at all.  If we could just at least get her some relief from the pain, that would be better then nothing since no one can figure this out.  It's bad enough that she has to got through shots and finger pricks but now stomach pain.  What more could a 6 year old go through.  I just am so frustrated and concerned.We feel so alone but reading everyone's emails make me feel slightly better.  At least we are pretty sure that this ISN'T all in her head.  What's hard is the lack of help we got from her diabetes team.  The doctor is really, really good but very busy and didn't provide much help to us.  I would think that he'd be familiar with the stomach pain related to diabetes.  Reading all of this sounds like there are lots of people going through this.  Surely someone has figured this out.Meanwhile, our tiny daughter is in pain and we are attempting to get her mind off of things and get her back in school so that she's not behind and left out of life with friends and class mates during the holidays.  She seems to be a little better but what the heck caused all of this???!!!What I'm wondering is if this might have anything to do with her pancrease finally shutting down completely.  We've been in the \"honeymoon\" period all this time and with the blood sugars going high for no reason, I'm wondering if possibly the stomach pain is related to the extrem highs then lows and the hights might be caused by her pancrease completely shutting down.  We have started increasing the insulin over the past 2 weeks but are going slow since shes so young.  Don't want an extreme low in the middle of the night.  It's happened a few times and she hasn't woke up every time.I'm just frustrated that we're having to diagnose this all by ourselves.  Good luck everyone who is going through this same thing.  My heart goes out to you and your kids!",
            "post_id": "3786303",
            "timestamp": "1229638054",
            "votes": 0
        },
        {
            "answer": "My daughter had daily stomach aches for years and was diagnosed with IBS. Upper and lower GI tests showed nothing. We tried going 100% gluten free and her stomach aches have been alleviated.  Gluten SENSITIVITY or INTOLERANCE do not show up on tests for celiac.  Try going 100% gluten free for a few months. It is hard at first, but you can do it. my kitchen is a GF kitchen and we are all healthier.",
            "post_id": "5176891",
            "timestamp": "1260895443",
            "votes": 0
        },
        {
            "answer": "This happened to my daughter and after tests for celiacs. then the dr mentioned the high sugar alcohols in sugarfree candies and products can give them a stomachache  , we did then notice a corralation.",
            "post_id": "5181371",
            "timestamp": "1261001195",
            "votes": 0
        },
        {
            "answer": "My son is 10 years old and has type 1 diabetes. He was diagnosed when he was 7. This morning he was complaining about stomach pains. This is not the first time this has happened. He does have a poor diet. He's very stubborn and I can't get him to eat better. He's blood sugar is often high as well. But I read the post here and will try a gluten free diet and benefiber. I appreciate this site very much. No one in my immediate circle understands what it is like to have a child with this condition.",
            "post_id": "5291875",
            "timestamp": "1264095698",
            "votes": 0
        },
        {
            "answer": "I have a sister who has diabetes and it just started about 3 or 2 weeks ago and she has pain in her tummy. I'm not sure what kind of pain cause she is only 6 and she wont speak much but she did say it was/near her belly button. she hasn't been scratching it, her sugar level was normal and it was still hurting. It comes and goes and last night she was sick but not anymore, I am really worried and I am not sure what to do please can you help me.and good luck to everyone else!",
            "post_id": "5870917",
            "timestamp": "1278274102",
            "votes": 0
        },
        {
            "answer": "I am an RN at a local elementary school and I am helping care for an 11 year old boy there (3 years type one diabetic with Pod insulin delivery) who has lately been having these stomach pains.  His sugars have been all over the page also.  I just talked with him and his mom today about eliminating dairy to see how he feels and if no change, then try eliminating gluten. I didn't know until reading this forum today that there is a tendency towards celiac with diabetics.  I do know my adult daughter (non-diabetic) has a gluten intolerance and has these symptoms.  She's so much better now on a GF diet.I've been doing a search on this topic (stomachache and diabetes) because some of the school staff think my student is malingering and I (and his mom) don't think he is.  I'm printing out some of the comments here so I can help the staff have a greater appreciation for this issue.I wish you all luck.  You all work so hard to give a great life to your kids.  It is frustrating to have to be the diagnostician as well as advocate for your child and to get wildly differing opinions regarding what's going on.  I encourage you all to continue to follow your \"gut\" (no pun intended!) and to think outside the box in caring for your kids (and yourselves).  Also, don't forget to address the issue of stress...The Institute of Heart Math has done numerous studies about how to lower A1C levels using heart variability training through breathing and games.  Might be a great way to help and have fun.all the best and happy holidays!",
            "post_id": "6367475",
            "timestamp": "1290039246",
            "votes": 0
        },
        {
            "answer": "Hi, my 12 year old son has stomach aches on a daily basis and I too KNOW in my gut that is is directly related to his type 1 diabetes. I did have them check for celiacs and he is negative for that. His endo does not think they are related as well. THEY ARE!! I am going to start journaling his food intake TODAY and see if there is a link in the food choices. Thanks for the idea.",
            "post_id": "6723583",
            "timestamp": "1299785569",
            "votes": 0
        },
        {
            "answer": "My daughter, age 8, recent diagnosed, suffers from stomach aches in the week or two before she seems to need her insulin dosages changed.  I, like someone earlier in the post, feel that this is related to the breaking down of the pancreas's beta cells.  I believe my daughter experiences sympotms when this occurs, and I believe this breakdown coocurs in spurts, not a gradual loss.",
            "post_id": "7044364",
            "timestamp": "1309962483",
            "votes": 0
        }
    ],
    "post_id": "2430277",
    "question": "My child often complains of stomach aches - which I can relate it to having a low.  However, once in a while (since he's been diagnosed 6 years ago) he has bad pain just below his belly button and this last Saturday was the first time I've seen him bent over.  Although by the time we see a dr. the pain is gone no one seems overly concerned but it's not normal.  Has any one had this and what is the cause and what can we do to eliminate this happening again.  Something tells me it's in relation to his Diabetes but am not certain.",
    "timestamp": "1124168400",
    "title": "Stomach pain and Diabetes"
}