{
    "kulsinski": [
        {
            "answer": "Hello.  I'm not a medical professional, just the parent of a kid with diabetes.  Does he check his blood sugars when he has these memory issues?  If he doesn't, then he can't blame them on diabetes.  Having low blood sugars does affect the way the brain works.  The brain requires glucose to function properly, which is why someone who is hypoglycemic has balance issues and often doesn't remember severe lows.  Personally, I don't think what you're seeing has anything to do with diabetes.  If he is otherwise able to function, isn't having lows at the time of the memory lapse, then it isn't diabetes that are causing those problems.",
            "id": "2432536",
            "rank": 1
        },
        {
            "answer": "I agree with RL about the memory issues not being typical of diabetes unless the person's blood sugar is low or maybe high when he is showing this poor memory condition. However, I HAVE read some research reports that state that it is currently thought that repeated severe lows can and do cause permanent memory damage in some people who have participated in tests. Usually, this is in short-term memory, if I remember correctly from reading the articles.But the key here is to make sure his brain is getting adequate glucose supply NOW and from now on, no matter what he has done in the past. This means no significant lows OR highs, for both deprive the body from properly-absorbed glucose. And the only way to do this is to build testing often into his routine so he can adjust his levels before they go up high or drop low. This can at least protect his brain from further damage if indeed he is one of the few who has suffered from glucose lows  enough to have some memory loss. This is NOT typical, though, and it may be wise for him to have his doctor run some tests in case he is showing signs of some other health issue.",
            "id": "2436578",
            "rank": 1
        },
        {
            "answer": "What is he smoking. No I'm just kidding but watch very carefully at his behavior. Anytime someone changes there is usually a reason. Stick him with the truth about his behavior do not belittle yourself. No excuses, I know 30 years type 1. Cut no slack no different from anyone else.",
            "id": "2436648",
            "rank": 1
        },
        {
            "answer": "I have Type 1 diabetes -- I was diagnosed two years ago at the age of 33 having gone undiagnosed for several years.  Once I started on insulin injections I almost immediately began experiencing symptoms typical of someone who was suffering from long-term complications of the disease (eg. intense neuropathic pain -- I took Lyrica for several months and was barely able to get more than two hours of sleep a night for 8 or 9 months).  I have noticed is that my memory has become absolutely horrible.  Just a few years ago I had a very good memory -- as one former boss of mine put it only seven or eight years ago, I had \"a mind like a steel trap\" -- but now I have a very hard time remembering details of conversations I've had or what I did when I repaired someone's computer a couple of months ago.  It's very frustrating.  My wife will bring up things that happened in the last year or two and sometimes I honestly have no idea what she's talking about.So, for the person who said \"cut no slack no different from anyone else\" you should probably consider that not everyone is the same.  What I went through when I started taking insulin is apparently very, very rare -- nobody I dealt with at the time had heard of anything remotely like it, and only a handful of instances could be found when they did research into my condition.  I'm painfully aware that my memory isn't as good as it was, and I hope time will bring it back.I know this conversation is at least a year or more old by now, but maybe someone will stumble onto it like I did and read my posting and know that there's at least one person with Type 1 diabetes who is having memory problems.",
            "id": "4037666",
            "rank": 18
        },
        {
            "answer": "dear friend/s my name is Alex and i been diagnose with type one three years ago at age 23. I am now 26. I graduated as an Engineering major and now i working on my master. I you may know already engineering revolves around math. I as i become type I, i notice my lack of memory in math and analytical thinking. I getting worse and worse, to the point that i cant barely remember simple math. I might go and solve an problem and then i go back 30 minute later and i wont remember hot to do it anymore. It sad to see that i very extremely good at my major and i am a total disaster. Graduated with 3.5/4.0 GPA at FSU and now finishing my master.This is a real burden for me, i fell i am trowing away 5 + 2 years of college away.So Yes diabetes is affecting  immensely my short term memory.sad very sad..  hanging in there..",
            "id": "4039804",
            "rank": 1
        },
        {
            "answer": "i apologize fro the grammar. I wrote it really fast. sorry",
            "id": "4039809",
            "rank": 1
        },
        {
            "answer": "I have been experiencing memory loss of and on since July 2009. Every diabeticwill experience some sort of blood vessel damage at some point; especiallyin eyes and feet. So why couldn't memory loss issues happen because of blood vesseldamage that affects the blood flow to the brain?  I think it's something that we allneed to be aware of.",
            "id": "4926961",
            "rank": 1
        },
        {
            "answer": "I am also an engineer and a diabetic.  I found this forum because I was searching for a connection between my Type 1 diabetes and memory loss.  It was just a hunch, a constant wondering if there was a connection because I'm certain that something isn't right.  My memory is not what it should be.  I can think and I can analyze but recall and learning/applying new skills is very difficult.  The worst part is probably my confidence.  I don't trust myself.  I can work my way through any problem, but if I encounter the problem again, I have to repeat much of the work.My A1C is excellent, typically in the low 6's but a tighter margin means more low blood sugars.  Only once in 20 years have I been hospitalized for hypoglycemia, so they are almost never extreme.  I have none of the long-term effects typically associated with diabetes. My eyes are good, my kidney and liver function is normal and my circulation in my feet is good. Still, I am wondering if my brain is being damaged slowly over time.I'm glad to hear I am not alone, but diabetes care is egregious.  The professionals, even those in reputable children's hospitals aren't telling people what they need to LIVE with diabetes. . . but they do a good job of keeping us from dying.  I was diabetic for 7 years before I discovered that hypoglycemia affects my brain.  It was before I had a pump and I was in college, failing my linear algebra class right before lunch.  I had to discover for myself that even before any other physical symptoms were expressed, my mind was being affected by low blood sugar.Granted, I hold myself to a high standard as far as the expectations I put on my mind, but I used to be able to hold my own, and though I'm only 33 years old, I'm scared that I've lost my edge and I don't know where the bottom is.My wife complains of these memory problems too.  I forget conversations,  I'm unable to remember names, I am unwilling to do research for things like home mortgages, car insurance, etc, because I don't trust that I'll remember what I read and so I make excuses to do other things.  It affects us.  She doesn't understand because she still sees me as \"the engineer\" but inside me something isn't right.",
            "id": "4990118",
            "rank": 15
        },
        {
            "answer": "i can't guarantee this but i recall reading somewhere that diabetes does prevent higher learning to a certain degree.  I'm not sure if it is due to sugar levels or just happens in  some cases.",
            "id": "5012036",
            "rank": 1
        },
        {
            "answer": "I too am a type 1 diabetic and found this website looking for a solution to my memory problems. I am 26 diagnosed at 24, my memory and learning abilities seem to be on a quick decline. My sugars are kept at healthy levels, yet I still have these problems- hoping for a solution : )",
            "id": "5705567",
            "rank": 20
        },
        {
            "answer": "I am 60 yo now.  Been type 1 since I was 16.  I have been having these memory probs for a long time.  I was a computer programmer/analyst for years, but had to take disability 10 years ago because I just couldn't do the job anymore.  Sorry I don't have any solutions for you, wish I did.  I am getting a reputation for forgetting, whether my sugar is low, high, or just fine.  The 44 years of lows and highs do take their toll even tho I have no prob with my eyes, heart, circulation or any of the classic long term diabetic problems.  Hate to be a pessimist, but maybe it is best to try to learn to deal with it.  More recently, I have had TIA probs.  I really lost memory after this last one.  But then the emergency room didn't treat me for a TIA because they were convinced from the start that I was having a prob due to illegal drugs which I am vehemently against.  Even tho my lady friend told them many times that I don't do drugs and that it was a TIA but I distinctly remember hearing them say \"if you don't tell us what drug he took, we can't help you\"....  I was unable to speak coherently to tell them myself(I did 'dress them out' once I began to recover.  They still put me out the back door, in the cold of 5 A.M. , no car in sight (came by ambulance), cell phone dead, and no shoes.   Since I can't prove severe and permanent damage, I can't sue them.  What a crock .  Lesson to be learned.....don't go to St. Pete General Hospital in Florida and carry proper documentation of your condition(I don't call it a disease). .........good luck......Tony",
            "id": "5706542",
            "rank": 1
        },
        {
            "answer": "Wow. I'm glad to hear I'm not the only person suffering from this frustrating condition. I am 40 and was diagnosed with Type 1 diabetes at 3. For the past 5 or so years, my memory is getting more and more erratic. I am also experiencing word loss, which is very frustrating because I'm a college English instructor.The idea that this can be attributed to blood vessel damage makes sense. I've also wondered if episodes of severe hypoglymecia--throughout my life, I've had a few of these--might attribute to this condition. I don't know. Are there studies out there looking into this? The Joslin Clinic maybe?",
            "id": "5816424",
            "rank": 19
        },
        {
            "answer": "I am 24 years old and have had type 1 diabetes since 1 1/2 years old. I have been on the insulin pump for 4 years now and have experienced much better control....still not where it could be, but way better prior to the pump. Recently I have found myself wondering what is wrong with my memory. I have trouble remembering most of my childhood or even events that happened months ago. I can only truly remember portions of conversations I have. My boyfriend tells me all the time....I just don't understand why you cant remember things or our conversations. Even in my line of work I tend to forget simple things if I don't do them on a daily basis. Its very frustrating, but I am too young to be having memory issues.  I also have headaches a few times a week and feel tired ALL the time. I feel like I am 80 years old trapped in a 24 year old body. I work out but it tends to make me more tired. I have very little energy.",
            "id": "5918599",
            "rank": 16
        },
        {
            "answer": "I am Type 1 since the age of 2 yrs---I'm 39 now---my memory is terrible!!  Both short term, and long term.  I have to write things down if I need to remember them.  Other than that---my health is wonderful.",
            "id": "5931037",
            "rank": 1
        },
        {
            "answer": "reading this blog makes me feel reassured but upset at the same time. I've had type 1 since the age of ten. I'm now 21 and my flatmate and I are noticing that I will tell her stories that I've already told her about and when she tells me her stories I won't remember she did the next time it comes up! I'm healthy like most of the people here, go to the gym, eat right. But I've been finding it very tedious working on my final year dissertations in college, I keep having to re-read things before I write about it, and I know I've read the paper two or three times already! I've never let my condition get to me but now I'm starting to lose motivation, I don't want to be someone that needs extra help! I'm still fighting and I think we all should too, even if the goal is limited",
            "id": "6374942",
            "rank": 1
        },
        {
            "answer": "well i'm here for the same reason...im 43 and type 1 for 16 years (a late starter)quite simply my short term memory is deteriorating. I was renound for my recall both short and long term but even my daughters have noticed a difference its frustrating....I find myself standing in the kitchen or bedroom having forgot what I went there for in the first place I remain ther for a while hoping it will come to me but it doesnt so I leave only to think of what I wanted  to do or get much later. There is a link i am sure of that. I have had a few severe hypos over the years and i dont think its good for ones brain to be starved of fuel lack of oxygen causes brain cell death lack of glucose  must do the same surely???I also agree that hyperglcaemia must cause damage anurisms haemorrages and exudate to form in the fine vessels within the brain too. I'm no medic but it makes sense that an organ that is dependent on the oxidisation of glucose to function will not be chronically affected by both hyper and hypo glycaemic states.Tim",
            "id": "6688356",
            "rank": 1
        },
        {
            "answer": "Hi all I am 32 years old, and I have been diabetic for 17 years. My memory is shot. my blood sugars are not too horrible. i have been in instances where i have forgotten entire events, people, simple things. I have forgotten complete sequences, many happy, from my life. I can walk into a room and just stand there and think, what in the world am i doing now. I thought i was the only one with this issue. i am glad and yet sad and terrified all at the same time that this happens to other people as well. I stumbled upon this blog the same way as many did that found their way here. linking type 1 diabetes and memory loss. and as i can see it looks as though even though there aren't a lot of posts here, they are all common with the same issue.  hopefully a cure will be found for this condition. May you all be blessed, and try not to let diabetes get the best of you.",
            "id": "7053871",
            "rank": 17
        },
        {
            "answer": "THANKS for your response.  I had just decided to stop reading when I saw yours.  My 9 yr old is very very bright, not to brag, but she even skipped a grade, lol ;0 and she even skipped a grade. She was diagnosed two years ago, and I get soooo frustrated with her when she forgets something.  Her long term is fine thank God because her grades never suffered and shes on the honor roll every year.  But her short term is another story.  It drives me crazy that I tell her to do something or get something and she comes back 5 or 10 min later saying she forgot!  A member of my gym told me that it could be her diabetes.  I really hope thats what it is because I NEED a reason, and with me being an educator, I know there are things we can do to help. I was beginning to think that she was ADD. I needed a reason to allow me to be more patient with her, and know that its not her having \"selective memory\" as my mom says.  I never believed that because she forgets to do the fun stuff too!  It kinda reminds me of having a \"bad\" kid in the class that drives u crazy.  But when you find out that the kid is really ADHD or has lead poisoning, it gives you sooooooooo much more patience as you know they really cant help themselves.  I just pray it gets better.  The dr suggested activities that we do . But most of all, I'm gonna continue to pray.  Not just for her memory, but for the day they cure this horrible disease!  IT WILL HAPPEN ONE DAY!!!",
            "id": "7314659",
            "rank": 1
        },
        {
            "answer": "I am 49 years old, diabetic for almost 30 years.  I've not had great control for a lot of my life, but ok.  I have had retinopathy and hypertension but my organs seem to be alright.  My memory however is horrible.  It is embarressing to me.  I can't remember names or numbers.  When I talk, a word, a simple word that I want to say won't come to me (it's almost always a noun).  My reasoning skills are still good, I just can't seem to communicate any more.  I have recently given up diet sodas because I thought the chemicals in them probably wasn't helping either.  It's scary to think of it getting worse.  I feel that I am a shell of my former self.",
            "id": "7834280",
            "rank": 1
        },
        {
            "answer": "I'm going to be a contrarian.  I am 61 years old and have had diabetes for more than 50 years (1961), having gotten it when I was 10.  I have always watched my blood sugars closely to keep them acceptably low and have suffered many, many eipisodes of low blood sugars.  It is so much easier now with the new meters.  My A1c is almost always in the low 6's and I have no complications but do have controlled hypertension. Exercise (and partying) have always been important to me.  Before I got married, I would travel extensively by myself and spent two summers backpacking in Europe during college.  My memory never was the best (just like my non-diabetic brother) but doesn't seem much different than when I was in college or graduate school.  I am currently taking classes (and exams) with newly minted college graduates in pursuit of an advanced professional designation and am holding more than my own.  I believe I am as articulate as I ever was, smarter and more knowledgeable than I was when I was 25, and do not have problems with complicated math.  I believe strongly in this lifestyle design for diabetics: good blood sugars, exercise, exercise, exercise, and have a good time.",
            "id": "8243634",
            "rank": 1
        }
    ],
    "votes": [
        {
            "answer": "Hello.  I'm not a medical professional, just the parent of a kid with diabetes.  Does he check his blood sugars when he has these memory issues?  If he doesn't, then he can't blame them on diabetes.  Having low blood sugars does affect the way the brain works.  The brain requires glucose to function properly, which is why someone who is hypoglycemic has balance issues and often doesn't remember severe lows.  Personally, I don't think what you're seeing has anything to do with diabetes.  If he is otherwise able to function, isn't having lows at the time of the memory lapse, then it isn't diabetes that are causing those problems.",
            "id": "2432536",
            "rank": 1
        },
        {
            "answer": "I agree with RL about the memory issues not being typical of diabetes unless the person's blood sugar is low or maybe high when he is showing this poor memory condition. However, I HAVE read some research reports that state that it is currently thought that repeated severe lows can and do cause permanent memory damage in some people who have participated in tests. Usually, this is in short-term memory, if I remember correctly from reading the articles.But the key here is to make sure his brain is getting adequate glucose supply NOW and from now on, no matter what he has done in the past. This means no significant lows OR highs, for both deprive the body from properly-absorbed glucose. And the only way to do this is to build testing often into his routine so he can adjust his levels before they go up high or drop low. This can at least protect his brain from further damage if indeed he is one of the few who has suffered from glucose lows  enough to have some memory loss. This is NOT typical, though, and it may be wise for him to have his doctor run some tests in case he is showing signs of some other health issue.",
            "id": "2436578",
            "rank": 1
        },
        {
            "answer": "What is he smoking. No I'm just kidding but watch very carefully at his behavior. Anytime someone changes there is usually a reason. Stick him with the truth about his behavior do not belittle yourself. No excuses, I know 30 years type 1. Cut no slack no different from anyone else.",
            "id": "2436648",
            "rank": 20
        },
        {
            "answer": "I have Type 1 diabetes -- I was diagnosed two years ago at the age of 33 having gone undiagnosed for several years.  Once I started on insulin injections I almost immediately began experiencing symptoms typical of someone who was suffering from long-term complications of the disease (eg. intense neuropathic pain -- I took Lyrica for several months and was barely able to get more than two hours of sleep a night for 8 or 9 months).  I have noticed is that my memory has become absolutely horrible.  Just a few years ago I had a very good memory -- as one former boss of mine put it only seven or eight years ago, I had \"a mind like a steel trap\" -- but now I have a very hard time remembering details of conversations I've had or what I did when I repaired someone's computer a couple of months ago.  It's very frustrating.  My wife will bring up things that happened in the last year or two and sometimes I honestly have no idea what she's talking about.So, for the person who said \"cut no slack no different from anyone else\" you should probably consider that not everyone is the same.  What I went through when I started taking insulin is apparently very, very rare -- nobody I dealt with at the time had heard of anything remotely like it, and only a handful of instances could be found when they did research into my condition.  I'm painfully aware that my memory isn't as good as it was, and I hope time will bring it back.I know this conversation is at least a year or more old by now, but maybe someone will stumble onto it like I did and read my posting and know that there's at least one person with Type 1 diabetes who is having memory problems.",
            "id": "4037666",
            "rank": 1
        },
        {
            "answer": "dear friend/s my name is Alex and i been diagnose with type one three years ago at age 23. I am now 26. I graduated as an Engineering major and now i working on my master. I you may know already engineering revolves around math. I as i become type I, i notice my lack of memory in math and analytical thinking. I getting worse and worse, to the point that i cant barely remember simple math. I might go and solve an problem and then i go back 30 minute later and i wont remember hot to do it anymore. It sad to see that i very extremely good at my major and i am a total disaster. Graduated with 3.5/4.0 GPA at FSU and now finishing my master.This is a real burden for me, i fell i am trowing away 5 + 2 years of college away.So Yes diabetes is affecting  immensely my short term memory.sad very sad..  hanging in there..",
            "id": "4039804",
            "rank": 1
        },
        {
            "answer": "i apologize fro the grammar. I wrote it really fast. sorry",
            "id": "4039809",
            "rank": 1
        },
        {
            "answer": "I have been experiencing memory loss of and on since July 2009. Every diabeticwill experience some sort of blood vessel damage at some point; especiallyin eyes and feet. So why couldn't memory loss issues happen because of blood vesseldamage that affects the blood flow to the brain?  I think it's something that we allneed to be aware of.",
            "id": "4926961",
            "rank": 1
        },
        {
            "answer": "I am also an engineer and a diabetic.  I found this forum because I was searching for a connection between my Type 1 diabetes and memory loss.  It was just a hunch, a constant wondering if there was a connection because I'm certain that something isn't right.  My memory is not what it should be.  I can think and I can analyze but recall and learning/applying new skills is very difficult.  The worst part is probably my confidence.  I don't trust myself.  I can work my way through any problem, but if I encounter the problem again, I have to repeat much of the work.My A1C is excellent, typically in the low 6's but a tighter margin means more low blood sugars.  Only once in 20 years have I been hospitalized for hypoglycemia, so they are almost never extreme.  I have none of the long-term effects typically associated with diabetes. My eyes are good, my kidney and liver function is normal and my circulation in my feet is good. Still, I am wondering if my brain is being damaged slowly over time.I'm glad to hear I am not alone, but diabetes care is egregious.  The professionals, even those in reputable children's hospitals aren't telling people what they need to LIVE with diabetes. . . but they do a good job of keeping us from dying.  I was diabetic for 7 years before I discovered that hypoglycemia affects my brain.  It was before I had a pump and I was in college, failing my linear algebra class right before lunch.  I had to discover for myself that even before any other physical symptoms were expressed, my mind was being affected by low blood sugar.Granted, I hold myself to a high standard as far as the expectations I put on my mind, but I used to be able to hold my own, and though I'm only 33 years old, I'm scared that I've lost my edge and I don't know where the bottom is.My wife complains of these memory problems too.  I forget conversations,  I'm unable to remember names, I am unwilling to do research for things like home mortgages, car insurance, etc, because I don't trust that I'll remember what I read and so I make excuses to do other things.  It affects us.  She doesn't understand because she still sees me as \"the engineer\" but inside me something isn't right.",
            "id": "4990118",
            "rank": 1
        },
        {
            "answer": "i can't guarantee this but i recall reading somewhere that diabetes does prevent higher learning to a certain degree.  I'm not sure if it is due to sugar levels or just happens in  some cases.",
            "id": "5012036",
            "rank": 1
        },
        {
            "answer": "I too am a type 1 diabetic and found this website looking for a solution to my memory problems. I am 26 diagnosed at 24, my memory and learning abilities seem to be on a quick decline. My sugars are kept at healthy levels, yet I still have these problems- hoping for a solution : )",
            "id": "5705567",
            "rank": 1
        },
        {
            "answer": "I am 60 yo now.  Been type 1 since I was 16.  I have been having these memory probs for a long time.  I was a computer programmer/analyst for years, but had to take disability 10 years ago because I just couldn't do the job anymore.  Sorry I don't have any solutions for you, wish I did.  I am getting a reputation for forgetting, whether my sugar is low, high, or just fine.  The 44 years of lows and highs do take their toll even tho I have no prob with my eyes, heart, circulation or any of the classic long term diabetic problems.  Hate to be a pessimist, but maybe it is best to try to learn to deal with it.  More recently, I have had TIA probs.  I really lost memory after this last one.  But then the emergency room didn't treat me for a TIA because they were convinced from the start that I was having a prob due to illegal drugs which I am vehemently against.  Even tho my lady friend told them many times that I don't do drugs and that it was a TIA but I distinctly remember hearing them say \"if you don't tell us what drug he took, we can't help you\"....  I was unable to speak coherently to tell them myself(I did 'dress them out' once I began to recover.  They still put me out the back door, in the cold of 5 A.M. , no car in sight (came by ambulance), cell phone dead, and no shoes.   Since I can't prove severe and permanent damage, I can't sue them.  What a crock .  Lesson to be learned.....don't go to St. Pete General Hospital in Florida and carry proper documentation of your condition(I don't call it a disease). .........good luck......Tony",
            "id": "5706542",
            "rank": 1
        },
        {
            "answer": "Wow. I'm glad to hear I'm not the only person suffering from this frustrating condition. I am 40 and was diagnosed with Type 1 diabetes at 3. For the past 5 or so years, my memory is getting more and more erratic. I am also experiencing word loss, which is very frustrating because I'm a college English instructor.The idea that this can be attributed to blood vessel damage makes sense. I've also wondered if episodes of severe hypoglymecia--throughout my life, I've had a few of these--might attribute to this condition. I don't know. Are there studies out there looking into this? The Joslin Clinic maybe?",
            "id": "5816424",
            "rank": 1
        },
        {
            "answer": "I am 24 years old and have had type 1 diabetes since 1 1/2 years old. I have been on the insulin pump for 4 years now and have experienced much better control....still not where it could be, but way better prior to the pump. Recently I have found myself wondering what is wrong with my memory. I have trouble remembering most of my childhood or even events that happened months ago. I can only truly remember portions of conversations I have. My boyfriend tells me all the time....I just don't understand why you cant remember things or our conversations. Even in my line of work I tend to forget simple things if I don't do them on a daily basis. Its very frustrating, but I am too young to be having memory issues.  I also have headaches a few times a week and feel tired ALL the time. I feel like I am 80 years old trapped in a 24 year old body. I work out but it tends to make me more tired. I have very little energy.",
            "id": "5918599",
            "rank": 1
        },
        {
            "answer": "I am Type 1 since the age of 2 yrs---I'm 39 now---my memory is terrible!!  Both short term, and long term.  I have to write things down if I need to remember them.  Other than that---my health is wonderful.",
            "id": "5931037",
            "rank": 1
        },
        {
            "answer": "reading this blog makes me feel reassured but upset at the same time. I've had type 1 since the age of ten. I'm now 21 and my flatmate and I are noticing that I will tell her stories that I've already told her about and when she tells me her stories I won't remember she did the next time it comes up! I'm healthy like most of the people here, go to the gym, eat right. But I've been finding it very tedious working on my final year dissertations in college, I keep having to re-read things before I write about it, and I know I've read the paper two or three times already! I've never let my condition get to me but now I'm starting to lose motivation, I don't want to be someone that needs extra help! I'm still fighting and I think we all should too, even if the goal is limited",
            "id": "6374942",
            "rank": 1
        },
        {
            "answer": "well i'm here for the same reason...im 43 and type 1 for 16 years (a late starter)quite simply my short term memory is deteriorating. I was renound for my recall both short and long term but even my daughters have noticed a difference its frustrating....I find myself standing in the kitchen or bedroom having forgot what I went there for in the first place I remain ther for a while hoping it will come to me but it doesnt so I leave only to think of what I wanted  to do or get much later. There is a link i am sure of that. I have had a few severe hypos over the years and i dont think its good for ones brain to be starved of fuel lack of oxygen causes brain cell death lack of glucose  must do the same surely???I also agree that hyperglcaemia must cause damage anurisms haemorrages and exudate to form in the fine vessels within the brain too. I'm no medic but it makes sense that an organ that is dependent on the oxidisation of glucose to function will not be chronically affected by both hyper and hypo glycaemic states.Tim",
            "id": "6688356",
            "rank": 1
        },
        {
            "answer": "Hi all I am 32 years old, and I have been diabetic for 17 years. My memory is shot. my blood sugars are not too horrible. i have been in instances where i have forgotten entire events, people, simple things. I have forgotten complete sequences, many happy, from my life. I can walk into a room and just stand there and think, what in the world am i doing now. I thought i was the only one with this issue. i am glad and yet sad and terrified all at the same time that this happens to other people as well. I stumbled upon this blog the same way as many did that found their way here. linking type 1 diabetes and memory loss. and as i can see it looks as though even though there aren't a lot of posts here, they are all common with the same issue.  hopefully a cure will be found for this condition. May you all be blessed, and try not to let diabetes get the best of you.",
            "id": "7053871",
            "rank": 1
        },
        {
            "answer": "THANKS for your response.  I had just decided to stop reading when I saw yours.  My 9 yr old is very very bright, not to brag, but she even skipped a grade, lol ;0 and she even skipped a grade. She was diagnosed two years ago, and I get soooo frustrated with her when she forgets something.  Her long term is fine thank God because her grades never suffered and shes on the honor roll every year.  But her short term is another story.  It drives me crazy that I tell her to do something or get something and she comes back 5 or 10 min later saying she forgot!  A member of my gym told me that it could be her diabetes.  I really hope thats what it is because I NEED a reason, and with me being an educator, I know there are things we can do to help. I was beginning to think that she was ADD. I needed a reason to allow me to be more patient with her, and know that its not her having \"selective memory\" as my mom says.  I never believed that because she forgets to do the fun stuff too!  It kinda reminds me of having a \"bad\" kid in the class that drives u crazy.  But when you find out that the kid is really ADHD or has lead poisoning, it gives you sooooooooo much more patience as you know they really cant help themselves.  I just pray it gets better.  The dr suggested activities that we do . But most of all, I'm gonna continue to pray.  Not just for her memory, but for the day they cure this horrible disease!  IT WILL HAPPEN ONE DAY!!!",
            "id": "7314659",
            "rank": 1
        },
        {
            "answer": "I am 49 years old, diabetic for almost 30 years.  I've not had great control for a lot of my life, but ok.  I have had retinopathy and hypertension but my organs seem to be alright.  My memory however is horrible.  It is embarressing to me.  I can't remember names or numbers.  When I talk, a word, a simple word that I want to say won't come to me (it's almost always a noun).  My reasoning skills are still good, I just can't seem to communicate any more.  I have recently given up diet sodas because I thought the chemicals in them probably wasn't helping either.  It's scary to think of it getting worse.  I feel that I am a shell of my former self.",
            "id": "7834280",
            "rank": 1
        },
        {
            "answer": "I'm going to be a contrarian.  I am 61 years old and have had diabetes for more than 50 years (1961), having gotten it when I was 10.  I have always watched my blood sugars closely to keep them acceptably low and have suffered many, many eipisodes of low blood sugars.  It is so much easier now with the new meters.  My A1c is almost always in the low 6's and I have no complications but do have controlled hypertension. Exercise (and partying) have always been important to me.  Before I got married, I would travel extensively by myself and spent two summers backpacking in Europe during college.  My memory never was the best (just like my non-diabetic brother) but doesn't seem much different than when I was in college or graduate school.  I am currently taking classes (and exams) with newly minted college graduates in pursuit of an advanced professional designation and am holding more than my own.  I believe I am as articulate as I ever was, smarter and more knowledgeable than I was when I was 25, and do not have problems with complicated math.  I believe strongly in this lifestyle design for diabetics: good blood sugars, exercise, exercise, exercise, and have a good time.",
            "id": "8243634",
            "rank": 1
        }
    ]
}