{
    "answers": [
        {
            "answer": "well im not in my 2ww yet i think i will o tommorrow beacuse my opk getsdarker everyday.i started taking fertility blend for women this month.thoughti would try something different!!!so i dont know if the pills are making mycycle longer.one thing i do know is that i have had ewcw for the last 4 daysnow which i never had before.so the pills are helping in that way.i will leteveryone know how it turns out.i wish everyone lots of bfp this time!!!",
            "post_id": "1326920",
            "timestamp": "1179291600",
            "user_id": "user_14832",
            "user_link": "/personal_pages/user/14832",
            "votes": "0"
        },
        {
            "answer": "Hi Nicki. How are you doing? My levels were 15440 today and I am going back on Friday to re-test. It was supposed to be tuesday, but I don't want to wait all weekend to find out if they are dropping or rising.",
            "post_id": "1326929",
            "timestamp": "1179291600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Nicki don't worry. Just because what's happening to me doesn't mean it will happen to you too. Actually if you go by your retreival dates you will be 7weeks on sunday not friday. Keep that in mind when you go for your u/s. I am sure everything will be fine. As for me I have some brown spotting and feel very nauseaus. Don't know if I should go to work or the hospital. I just told my boss yesterday what I was going through, funny thing is that I felt great afterwork yesterday. I am very scared, don't want to tell DH.",
            "post_id": "1326936",
            "timestamp": "1179378000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "LJ- well the fact that your nauseous is a good sign.  And spotting early on is also normal.  I would stay home from work.  Stay home and try to relax. You must be going crazy.  I'm so sorry sweetie.  I'm glad you're going back tomorrow to see the levels.  I have faith.  And I'm keeping the faith strong for you!And I get so confused with how far along I am.  If I go by the day of my last period - it was March 30 so it would make Friday 7 weeks.  If I go by my ER then I'm only 5 weeks on Sunday.  By ET date 5 weeks on Wednesday.  How do they calculate?  I thought it goes back to the day of your last period?  I always think to myself how many days old they are and I count that to the day of my ER which would make them 5 weeks old on Sunday.Thanks for trying to put my mind at ease.  I know it doesn't mean it will happen to me too.  I just thought I would enjoy this more.  And I just can't seem to.  I'm be checking in on you all day.  Let me know if you need anything.",
            "post_id": "1326950",
            "timestamp": "1179378000",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi girls,LJ,Still praying for you sweetie!  I am so sorry that you are going through this right now.  Please keep the faith as I am keeping it for you too.  Please let us know when you can.  I am taking the day off tomorrow, so I will be checking for your post all day.  Here for you!!  XOXONicki,I know it must be difficult not to worry, hon, but I agree with LJ, you will be fine.  Hang in there!!  Countdown to Monday!!Girls,I really need your prayers. They have asked DH and I to be foster parents for the 16 yr. old pregnant girl from church (Maria) I was telling you about.  We need to find out if we can do it since she is here illegally. So strange that the day I found out about my BFN was the day they called me to ask if we would be interested in meeting this girl.",
            "post_id": "1327047",
            "timestamp": "1179378000",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Wow Audrey. That is really something.  Wow.  That's a big decision for you and DH.  So I guess that would mean you would help the 16 year old and the baby, eventually when he/she is born??  You spoke of her a few posts ago right. You said she wants to keep the baby?  Since she is here illegally I don't know how that will work.  I can't imagine the state would help with support but like I said, I don't know.  That is big.  Huge.  You think and pray on it.  I'll pray for you too.  And there is some irony about the same day as the BFN.",
            "post_id": "1327052",
            "timestamp": "1179378000",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "LJ,Noooo!!!!! I am soo very sorry...that's devastating!  I am praying that you and DH find the strength to get through this.  You are a very strong woman and have been all of our strengths since December.  You are truly an inspiration!! We are all here for you!  God Bless.  XOXO",
            "post_id": "1327087",
            "timestamp": "1179464400",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "LJ, Audrey really said it best. I will also say prayers.  I am just so terribly sorry for you and DH.  And, you have been our leader and rock and it's making me sick to hear that this is happening.  You must be so very upset.  If you need anything we're all here for you girl.  Super big HUGS :(",
            "post_id": "1327149",
            "timestamp": "1179464400",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Whoa that is steep - $100,000 is a lot of $$$.  Didn't realize it was that expensive.  Glad AF came for you.Sorry your furbaby is not doing well but glad to hear there are something to make him feel better.",
            "post_id": "1327152",
            "timestamp": "1179464400",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Audrey that is really exciting news. I think somethings are just meant to be.As for me it's bad news. I spent the evening in the hospital as I was having some pain. They tested my hcg levels and they dropped to 11000, but there is no sign of bleeding at all or miscarriage yet. I am going back to the hospital today for a final ultrasound, but I know it's not good news. They have advised me that the baby has passed away, but they want the ultrasound to be 100%.Nicki hang in there, Monday will be here in no time and I am looking forward to your good news.",
            "post_id": "1327131",
            "timestamp": "1179464400",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "H all,I am so stupid I didn't see the other post was maximized and I was wondering why nobody was writing.  Glad I found you again!LJ - that is terrible I am so sorry.  It just has to be devastating after how excited you were and how much you have tried.  Much much worse than a BFN.  I can't express how badly I feel for you and DH.Nicki - LJ is right tho, you have to stay calm because all is fine with you and it will stay fine.  I don't really understand how the calculations are for how far along you are either.  I still thought is was from your last period but I don't know for sure.  Don't stress!Audrey - that is cool about the foster care thing.  I am not sure how that works since she is an illegal either.  It sounds like fate tho.  Is she sure she wants to keep the baby?  I think Nicki is right that she wouldn't get support.  Let us know what happens!Got all the results from my puppy's tests yesterday and he is pretty sick but there are some things we can try to make him more comfortable.  He is now like a walking pharmacy.  I got AF today so am happy because I can start the mock cycle.  I also looked into surrogacy but that plus the egg donation would be over $100,000 and my insurance doesn't cover anything.Please take care all and you are in my prayers!",
            "post_id": "1327136",
            "timestamp": "1179464400",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Thanks everyone for their support. DH and I are off to the hospital now. Take care. Hugs to everyone.",
            "post_id": "1327160",
            "timestamp": "1179464400",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "LJ,Thinking of you.  Please give us an update when you can.Nicki,Only 2 more days til Monday!  About Maria...yes, we'll have to see what they say.  Immigration laws have gotten so much stricter, I'm sure you've heard about all the marches.  We're hoping that they might be more lenient with minors and that she may qualify for a student visa and temporary citizenship.  We'll have to see what the social worker says. As far as her baby, at this point, she's saying she wants to give her baby up for adoption to us, but we are not going to count on that.  She could easily change her mind after the baby is born.  If we provide foster care, it is to help her and not with ulterior motives to adopt the baby.  We have decided that January 2008 is the month to start the process through an agency.  Will keep y'all posted.Hi Deb,So sorry about your baby, but so glad you're keeping him comfortable.  It must be soo difficult! : (  Praying for him too!That's great that AF came and you can start your mock cycle.  Please keep us posted...how does that work?",
            "post_id": "1327250",
            "timestamp": "1179550800",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Tonight I will ge going to a \"Rosary Bowl\" at the Rose Bowl in Pasadena.  People from all over at meeting at the Rose Bowl to say the Rosary for peace in the world.  I will also be praying for my crew ( you gals) lol!!!!Enjoy your weekend!",
            "post_id": "1327251",
            "timestamp": "1179550800",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Ultrasound confirmed the worst. The sac was still growing - showed that I was in my tenth week but the baby still showed 6w 3d, no change since in size since the may 5th ultrasound. I waited 9 hours in the hospital to be told that I could wait 6 - 12 hours more for surgery or opt to come back for a scheduled surgery on Sunday. Plus there was a chance that the doctor who did such a bad job on my tubial ligation 12 years ago would be the one performing the surgery if I waited. We chose Sunday. Anyway DH and I are hanging in there, debating whether to try again or not. I can't imagine not trying, but it depends on my health. My blood pressure has been extremely high and my kidney function has dropped. Hugs to all of you. TTFN.",
            "post_id": "1327263",
            "timestamp": "1179550800",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Audrey- that's really incredible.  the lord works in mysterious ways.  That is really something. time will tell what happens with that situation but i'm glad you have your start month all lined up!LJ- this is all so terrible what you're going through.  It's been a string of bad news for days.  I can't believe your now having these other problems.  Probably b/c of all the stress from everything.  Hang in there. I know this is probably the worst week / weekend of your life.  So sorry your going through all this.  XO :(",
            "post_id": "1327269",
            "timestamp": "1179550800",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "I am so sorry I am at a loss for words, Nothing I will say will make things better but I am sorry as well. Don't make any decisions right now just deal with what you have on your plate..",
            "post_id": "1327313",
            "timestamp": "1179637200",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "LJ,I know today must have been a very difficult day for you and DH.  Praying for you...please let us know that you are o.k.  Hugs",
            "post_id": "1327337",
            "timestamp": "1179637200",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "I am finally home after a very long day. I was a terrible experience but I am glad it's over. I am doing okay phyically and mentally. I thought all of you laying in there in the hospital bed waitng for an operating room to come free. I plan to take care of myself and get better then hopefully try again some time later this year.Nicki good luck with the ultrasound today. Everything will be fine.Hugs to all of you, thanks for being there for me.",
            "post_id": "1327339",
            "timestamp": "1179723600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Nicki,Excited to hear about your us today!  Please let us know as soon as you do.",
            "post_id": "1327344",
            "timestamp": "1179723600",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "LJ,Glad to hear that you are back at home and doing better.  I know what you mean by \"terrible experience.\"  I felt like I was having an out of body experience...like is this really happening?  It does get better day by day.Keeping you in prayer.Nicki,Can't wait to hear about your U/S!!!!!  We are all excited...Hey Audrey, Deb, and Amy-  How are you all?Nikki",
            "post_id": "1327354",
            "timestamp": "1179723600",
            "user_id": "user_196647",
            "user_link": "/personal_pages/user/196647",
            "votes": "0"
        },
        {
            "answer": "Thanks Nikki for beign excited to hear.  Sometimes when I post, I feel happy for me but so sad for some of the terrible pain some people on the thread have experienced.LJ- how are you doing?? You've been in my mind SOO much this weekend. I'm sure it's what Nikki said, that it will get better each day.Hope the rest of you are doing well.I had the U/S this morning.  It went very well.  Both measure at .9 (centimeters??) I don't know if it's cm, mm??? I'm so bad at all this ****.  They are slightly less than a 1/2 inch in size and the heartbeats were both 137 beats per minute.  So they are only checking proges. now to see if I can discontinue it.And I figured I'd ask you girls first.  I was going to bring into RE next week to give to someone that doesn't have insurance (which I did once before), but wanted to ask you girls first that might not have insurance.  I have 2 boxes of Menapur left with I think like 15 vials per packet - so like 30 doses, 1 packet of Bravelle with 5 vials and 5 doses of cetrotide. Plus a cr@p load of syringes.  Do any of you know if you'll take menapur on your next cycles?  If yes, you're welcome to mine.  I also have a full thing of proges. in oil.",
            "post_id": "1327356",
            "timestamp": "1179723600",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi all,LJ - so sorry for all you are going through.  As always though, you are an inspiration for the rest of us with your positive attitude, even during such a horrible time.  Please take care of yourself and I am glad you are thinking of trying again.  My heart goes out to you.Nicki - how exciting!  From one extreme to the other on this board.  That must have been so cool hearing the heartbeats.  I am smiling just thinking about it.  I can't imagine how great that feels knowing you have those two little ones growing inside.  Relax and get lots of rest!Audrey - I hope all works out with the fostering.  I think you are doing it with such good intentions that things will work out for you and DH one way or another.  Let us know what happens after you talk to the social worker.  How was the Rosary Bowl?Nikki - good to hear from you and that you are doing well after such a trying time.  This is sure a challenging process.Take care all!!",
            "post_id": "1327362",
            "timestamp": "1179723600",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Nicki,Awesome news sweetie!! Everything sounds great, Congrats to you and DH.Nikki,How are ya?  So true, time and the help of God does heals all wounds!Deb,How's your lil guy doing?  The Rosary Bowl was amazing!  There were soo many people, Cardinal Mahony and other priests, famous actors and other speakers who gave inspirational talks, music, food, and the best part, people formed a living rosary on the field and the Hail Marys were done in different languages from around the world.  What an uplifting event!!",
            "post_id": "1327448",
            "timestamp": "1179723600",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Nicki that's great news. I am so happy for you. I hope you have one of each and your family can be complete. Hugs.",
            "post_id": "1327558",
            "timestamp": "1179810000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi guys.I hope everyone is doing well. I am doing better. Just got to get back up on that horse. We are hoping to try again in August but I have to meet with my clinic first to see what their protocol is after a miscarriage. What's the saying...if at first you don't succeed, try, try, try again. Keep up the spirits.Hugs.",
            "post_id": "1327727",
            "timestamp": "1179982800",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "LJ - glad you are doing better.  Such a tough thing to deal with.  If you are going to try again in August you will be right with me as it looks like that's when my next try will be too.Audrey - the Rosary Bowl sounds great.  Any news on Maria?  My furbaby is doing ok - I had to take him yesterday for a plasma transfusion which is supposed to help the pancreatitis.  He seems to be getting more energy back.I go back to the RE tomorrow so hopefully my lining is thinner and I can start the mock cycle.  I really don't want to do the D&C.  I told the acupuncturist to give me lots of herbs to make my lining thin!Take care all!!",
            "post_id": "1327820",
            "timestamp": "1179982800",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "LJ,So glad to hear that your spirits are up and that you are trying another cycle in August...And...that you will be 2ww buddies with Deb, awesome!!Deb,Glad to hear that your baby has more energy and is comfortable.  Do you have insurance for him?  I know that pets can be soo expensive.  Once Romeo got stung by a bee and they charged us $70.00!  So good you will be 2ww buds with LJ!  Praying that your lining will be thin too...and great that you're still going for acupu.  How's that going?As far as Maria, a social worker has been contacted, but we have not heard back...I'm sure they are inundated with cases.  We will pick up Maria tonight, ))(she lives in Santa Ana), and we will have her for the long weekend.  She is definitely warming up to us and she really is a sweet girl.  We are enjoying spending time with her and getting to know her.  I'm dying to take her to Disneyland, she's never been.Our daughter Caitlyn is going to the Prom this weekend...we went shopping for her dress together... it's Red!  Gosh, she looks so beautiful.  Do y'all remember your prom?  Mine was in the 80's...ughh, my dress and hair were hideous!Happy Memorial day weekend to all!XOXO",
            "post_id": "1327832",
            "timestamp": "1179982800",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "LJ--I am so glad you are feeling a little better and already thinking ahead. It will happen!Audream- Prom seems like a long time ago, but what I remember most is all of the preparations and shopping with my mom for the \"perfect\" dress. It's almost summer for you, right? I've been wanting to go to Disneyland lately too,...but I can't ride any of the rides right now...so it will have to wait.Deb --August is not that far away. I just took my fur baby for a walk. I was glad to hear yours has been getting his energy back. It's sad when they're not themselves. My dog had a hurt paw from a skateboarding accident....yes, skateboarding...my dh needed someone run next to him. He only got the skateboard to exercise the dog and then the dog ends up with a limp! He's doing better now...he is a LOT of drama though...he just turned one and seems to have one issue after another lately. He's a chocolate lab...and he ate my shoe yesterday...I feel like god is trying to prepare us for being parents..Nicki--I am so excited about your twins! I've only got one growing in me, I can't imagine feeling two moving around...Mommy2selena will have all the answers..",
            "post_id": "1327839",
            "timestamp": "1179982800",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "Hi ladies I have been busy the weather has been hot and my feet are sooooooooooo swollen I look like the marshmellow guy from gostbusters. Babies are doing good they move alot nowI have gained about 20lbs I just turned 25 weeks today. Pool is up and running but the water is still so cold LOL. Glad to see all of you doing good, LJ I am glad your not giving up, I here it is easier getting PG after a loss I hope that holds true for you. Best to you all Toni",
            "post_id": "1327954",
            "timestamp": "1180069200",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "Sorry for disappearing girls.  I was in deep depression for a few days and then my mom came over to visit and i must say she is just the strongest person.  She made me belive it is possible and we will get through it together.  So now i am all strong and ready for FET round 1 in June.  Just got my AF yesterday so 4 weeks to go for FET.LJ - I am so sorry for all that you have been through while i was away.  You are in my thoughts and like I said we will get through it together.  DH told me how I should not put anything on hold for the baby.  He's like \"just live your life and things will happen\".  So try to think about normal stuff more and finish chores that are top of your list while you wait.  For instance I needed to do up my apartment and I am spending most of my waiting time doing that now.  And trust me it helps to take your mind off these things.Audrey - I have come to the same conclusion as you.  My motto \"Make a baby & Take a baby\".  So next year regardless of what happens on my IVF, we will register for adoption.  Again DH said if we are successful - why not be even happier?  we will have 2 babies that way...Nicki - Good going girl.  Hope thinsg go very well for you.All girls - A bit of info which you may find useful.  I am an Indian by origin but I live in Singapore.  Now with all this IVF stuff, I have done extensive research for myself.  And what I have found (still talking to the docs) is that IVF in India is a fraction of the costs it is elsewhere.  Now i know what you could perceive india to be but I have spoken to other Non indians here in Singapore and have found that there are some really world class labs in India.  The cost what i have been told to get IVF done by a top fertility specialist in India are USD 3K to USD 4K.So if indeed i need another round of fresh IVF, I will consider going there.  If any of you are constrained by costs, do let me know and I can provide you all the contacts I have for your independent research.Sorry for a really long post girls!!! (too much to share)",
            "post_id": "1327962",
            "timestamp": "1180155600",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Hi guys.Welcome back Sweedy. Glad you are doing better too.Patience and hope are the key to ivf survival. My husbands' family are from India (he was born here in canada) and I have known many people to go to India for surgery or to see specialists. If it's an option then definately take that opportunity.I hope everyone else enjoys their long weekend. Unfortunately my long weekend was last week, but at least I was able to have a fews day rest without taking time off work. They get so picky about being off and I certainly didn't want to explain my situation.Toni, I am glad everything is going well with you and the boys. Just think in 11 to 13 weeks you'll be have three kids three and under. Sorry just had to throw that in there:) Everything will be fine. Keep up the good work.Deb how is your furbaby? What's happening with the mock transfer?Audrey any news about Maria? You have such a generous heart, only good things will come your way.Nicki, you are coming upto 8 weeks already. Amazing. Is the nauseaus starting? Make sure you take it easy, you are now three people.Hugs to all.",
            "post_id": "1327963",
            "timestamp": "1180155600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi gals.  Feels like I haven't \"talked\" to you guys in so long.  I was away for a few days enjoying the good old NJ beaches.  Nothing compared to the nice CA beaches you west coast girls probably enjoy.  But definitely enjoyable.  Hubby had to work on Sunday so got in a lot of R&R that day.  I rented the pay-per-view Holiday.  It was really cute!  Total chick flick so try not to involve the hubby if you can : )So Audrey- I'm dying to hear how the first weekend with Maria.  I hope you'll hear back from the social worker soon.  I give you such credit girl.  What a great thing to do.LJ- I'm so psyched to hear you have your next plan mapped out already.  That's awesome.  See you are our inspiration.  August will be a great month to try again!  And it's so cool you'll be 2ww pals with Deb.  Come on baby dust.... sticky, sticky baby dust!!!Amy- thanks for the congrats.  How are you feeling?  Well I hope.  How many months til your pink bundle comes??Sweedy- Sorry you had a few low days. It's amazing what moms can do for that huh?  You have to keep that positive attitude for your FET so NO MORE bad thoughts.  This is your first time too right?  Meaning you only had one fresh cycle and now your doing the FET with the leftovers right?? It's like I said to Audrey (and I am proof), sometimes, you have to try a few times b/c it's a matter of the right med combination, or how good the embrios develop, or what you ate and drank the day of for Gods sake.  It a number of things but we have to try to be positive as hard as that is!!  4 weeks is right around the corner girl.  Your almost there.ALL- I'm feeling very well overall.  Aside from being tired I can't really complain.  I don't even feel PG. Though I know everything is going well.  I am going in on Friday for another u/s b/c I'm crazy and can't go more than a week without making sure the hearbeats are good.  Gosh only 8 weeks... Time is going so slow.  BUT, I leave for the Bahamas on Saturday and I'm so psyched for that.  I asked RE 5 times if he's sure I can go and he said he sees no reason why not (we booked the trip months ago b/c my cousin is getting married there).  So I am trying to read up on all the fish I can / can't eat and all that fun stuff.  Sorry again for the long post.  Like I said, feels like forever since I posted last!",
            "post_id": "1328182",
            "timestamp": "1180414800",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "It does feel like forever. I check everyday, and all I find is my lonely post. I hope everyone is doing well.Deb - How did the mock transfer go?Audrey - What's happening?Sweedy - So when are your dates?Nicki - Don't feel crazy. It's totally normal, especially after hearing everything I went through. I read up that you can by a home sonogram that lets you listen to the babies heart beats you get a little farther along. They cost about a hundred bucks though, but you can check out ebay.As for me I have an appt on June 6th. I am hoping they can give me a reduced price this time after everything I went through. I hoping to start the cycle late July and have the transfer early august. I am on vacation for july7-aug7. I hope the dates work out.Hugs to all.",
            "post_id": "1328195",
            "timestamp": "1180501200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "LJ- I know! That's exactly how I feel when I check and only see my lonely post : )  Oh and great minds think alike.  It's so funny you mention the hearbeat monitor because I just rented one yesterday.  It's coming in the mail tomorrow.  It works from about 9 or 10 weeks.  The one I got costs $25 / month.  I told DH I don't care. I said if that makes me less worried in between appointments, I'd spend twice that!  He said he better not see me hiding in the closet sneaking listens all the time ; )  I said of course not. hee hee.Well the inlaws are in town from sunny Florida so I'll be going for dinner tonight.  All I really want to do is go home and go to bed.  But I'll check in on you gals later!TTFN",
            "post_id": "1328278",
            "timestamp": "1180501200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "That's great Nicki. I may look into it myself next time. Only a few more weeks and the fatigue will lessen, just in time for summer. Oh and I know DH will be finding you in the closet/bathroom sneaking little listens. Hope you had a great dinner. I am so looking forward to the weekend. I haven't had a decent weekend in a month...Hugs.",
            "post_id": "1328485",
            "timestamp": "1180674000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "hi there all,i was trying to reach u guys but the previous thread was closed and i was not able to find it somehow.LJ. im really very sorry to hear abt ur situation but i just wanna tell u that dont ever lose hope. i know we all r going thru lot more than many women  but i know this too that it'll be  rewarding in the end. i have full faith n i pray that u have a very healthy pregnancy in your next cycle.Nikki. im really glad that things r going good at ur end. its really nice and comforting when i read nice stuff abt all u guys.well abt me i was on stim meds for 12 days which were gonal F and menopur. cetrotide was added later. i had a slow start this time . the whole testing and U/S period was very tense . my follicles were growing but slowly. so we retrieved 12 eggs on may 28th and the doctors had already decided this time that they will be doing day 3 transfer this time. so yesterday i had my transfer. they wanted to be aggressive this time as my previous two cycles(one fresh and one FET) were not successful. so they put back 4 embryos which were 2 grade b and 2 grade c.im kind of low in spirits this time bcuz of my previous history. its only one day after transfer but still im feeling very low. i dunno wats gonna happen this time. please pray u all for me. i really need this . n im so scared this time also that I'll have fever after a week of ovulation . it kills me, makes me so weak . i told my nurse abt it n nobody seems to have any answer for that. anyway im keeping my fingers crossed. will keep u posted when i get time from work. please please pray that i get symptoms as each day passes like the previous cycles and i get no symptoms makes me more and more depressed.tc all..love",
            "post_id": "1328502",
            "timestamp": "1180674000",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Nicki - Thanks for your encouraging words.  I am now 3 weesk away from starting my FET cycle.  I am really lookign fwd to it.  I mean i know it can fail but at least i will be doign somethign about tryign to get there rather than waiting (which is quite frustrating).LJ - your next try is just round the corner too.  Do you have any embryos left from last cycle or start afresh?oth - what is happening to you is similar to what i went thru.  Slow response and actually my doc only say 3-4 eggs but upon retrieval he got 12 eggs and 9 matured.  so its not all bad.Audrey - whats the latest with you girl?",
            "post_id": "1328526",
            "timestamp": "1180674000",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Hi all,Nicki,Can't wait to hear your results from your us today.  What a great idea to rent a fetal heartbeat monitor!  That's awesome that you are heading out to the Bahamas...enjoy the crystal clear turqoise waters and the sun!LJ,So glad to hear that you have already made plans for your next cycle...and that it will be here before you know it...the summer always goes by so fast!Sweedy,3 week countdown girl...how exciting!  I like your motto \"make one and take one\"!  Glad your spirits are up again.  This is  such an emotional rollercoaster!Oth,Praying for you girl!  Get lots of rest and think positive!  Sending you lots of sticky baby dust!!Well, I had quite a week...had to go into the emergency for excruciating lower abdominal pain.  Turns out I had a ruptured cyst in my left ovary, possible fibroid, and an urinary tract infection...I'm a mess!  Taking meds and feeling much better now.As for Maria, I don't think it's gonna work out. Amazingly enough, her illegal status here is not an issue, and she does qualify for services. However, I called up the adoption agency and they said that if we take her in as a foster child, we will not be able to move forward with our own adoption procedures.  I absolutely don't want that...so...A social worker has been contacted and last I heard, they were unable to locate her parents.  It's all so complicated.  Will keep y'all posted.XOXO",
            "post_id": "1328577",
            "timestamp": "1180674000",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Audrey - Sorry to hear about Maria. I know it was giving you something to look forward too. I hope you all feeling better now. It seems like the planets are out of line or something that so many crazy things happen to us all at once. Take care of yourself. Cysts can happen to anyone, but they are also very painful. I had one after my first IVF cycle. If you get re-occuring urinary tract infections, look into cranberry pills. They are suppose to help. A doc once told me that you would have to drink enough cranberry juice to pee red for it to really help with uti but now they have concentrated cranberry pills available. You can find them at costco.Nicki -  I hope your u/s went well. They grow so fast at this age. Enjoy some sun for me. Have a great trip.Oth- Thanks for the support. I am glad you were able to find us again  Please get lots of rest and take it easy. Remember not everyone gets symptoms this early. I didn't have nausea until 8 weeks. A temp after you ovulate is normal, the progesterone hormone keep you temp up as long as it's not over 103. Try to be positive. PUPO-pregnant until proven otherwise.Deb- How are things going with you?Toni-Happy 25 weeks. Not too much longer, just the summer to get through. lol.",
            "post_id": "1328593",
            "timestamp": "1180760400",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi all,Sorry I haven't posted in a while.  We sold my parents' house so I had to arrange a quick trip to CA so my brother and I could clean up all the stuff that is left.  I am in Laguna Niguel now and working my butt off!  I will be here until Wednesday.  We are making good progress but man is it an emotional rollercoaster.  I break into crying jags every half hour or so!!  What a way to spend my vacation.Glad to hear you are all doing well.Nicki I think the heartbeat monitor is a great idea!  Worth every bit of $25 per month.  Soon you won't feel so tired.  Hope you have a great time in the Bahamas - nice place for a wedding!Audrey sorry to hear about you troubles.  Glad you are on the mend tho.  Also sorry to hear about Maria but I think you are making the right move and not risking messing up the adoption.  Are you working with a local agency or is it national?  My brother and sister-in-law are also doing the donor IVF - they will be doing another fresh cycle this month it looks like.  My sister-in-law was asking about adoption and since they live in Aliso Viejo, I wasn't sure if they could hook up with the same place you are using.  And me too!  Take care.LJ let us know what happens after 6/6.  It looks like it will be early August for me also so maybe we will be 2WW buddies.  I am really glad you are moving forward again.  Will this be a fresh or a FET for you?Sweedy glad you are back and your next try will be in no time.  It's nice your mom was able to visit and help your spirits.  My mom died in Dec 2005 and I really miss that.  Are they going to change your protocol at all?  Did you decide if you are going to use all 7 embies?Oth007 good luck this try.  Just relax and you may not feel any signs at all.  Wishing baby dust your way!Amy and Toni hope you are both feeling well!I did start my mock cycle.  It was iffy because my lining was still too thick.  However, after starting the lupron, I went back on Wed before I flew out here and it looked good.  Instead of estrogen shots this time, she has me using a cream because she thinks it will be more natural and my lining won't be so thick.  I go back Thurs and if it looks good I start the progesterone and then she is going to do another biopsy to see if the lining looks better.  If so, then I look for a donor and target early August.  I am feeling really good about it and I think the acupu is helping also.  So we will see next week.Sorry for the long post!  And my furbaby is doing ok.  My husband stayed back in PA to take care of him.  We have good friends that stay with him when we go but I just didn't feel comfortable leaving him with anyone.  So he is holding his own.  Take care everyone!!",
            "post_id": "1328613",
            "timestamp": "1180760400",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Hi All,Audrey - Sorry to hear about Maria.  On your adoption route - what are the timeframes you have been given?  Also, have you now decided to completely stop trying or will you adopt \"make one take one\" :DLJ - Will you be doign accupunture from now until august?Debbie - Good to hear that you are upbeat this time.  Half the battle is fought in our minds so we better think positive.At my end, I am just glad that days seem to be passing by quickly.  I am just so looking fwd to starting my FET.  Its been 5 weeks since my first fresh cycle failed and i feel that i have healed adequately now to have this next cycle.  And in a way I am glad i was forced to wait.  Now all the chemicals are out of my body and hopefully this will improve my chances this time round.Baby dust to all!!",
            "post_id": "1328652",
            "timestamp": "1180760400",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "I didn't have any left to freeze in march, so this will be a new fresh cycle for me. I have never done accu with an ivf. I did massage therapy with my son and was thinking of doing it again, but I just haven't got around to it.",
            "post_id": "1328762",
            "timestamp": "1180933200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "hi all,im 5 dpt and im still not having any symptoms. can anyone please tell me what are the usual signs at this time? it wa sday 3 transfer on the 31st. im beginning to freak out here.",
            "post_id": "1328802",
            "timestamp": "1180933200",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "5 days is really soon. They could still be just barely implanted. I didn't have hardly any symptoms until after I found out I was indeed pregnant. I just felt normal...a little bloated from all of the drugs and procedures...but nothing else. I wouldn't freak out yet. Although, I understand how crazy the 2ww can make a poor girl. I tested at home before my second blood test and got my positive. I didn't get the results from my first bloodtest, so it was a very exciting morning! I hope you get your BFP.Hi Girls! I am 25 weeks now..I've gained almost 20 lbs.....that's as much as mommy2selena and she has TWINS! Ugh! I don't know if I'm too big too soon. The doc says everything is fine. It's going by pretty slow. UNbelievably, the weight goes everywhere. I was a runner before doing ivf and now even my calves and especially my upper arms seem bigger. It's all worth it. I forget sometimes and then will catch my profile in the shadow of my LCD projector at school and I almost fall over! It's still hard to believe this happening.Stay positive, if this can happy to me...a person who has had zero luck,....then it can happen fo ryou!",
            "post_id": "1328833",
            "timestamp": "1180933200",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "thanks Amy for listening to me . i know its making me crazy which i shouldn't be , but i just cant help it. this 2ww is really difficult and for me as its the 3rd try, its more and more hard. its just that at every post i see that everyone who got pregnant, had sore boobs right after transfer which i never had and still does not. its making me really impatient. but im still keeping hope that things might turn my way also, just like u lucky people. dont say that u had zero luck, u r one blessed woman !!! touchwood. i really really hope everything goes well with all of u .",
            "post_id": "1328838",
            "timestamp": "1180933200",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "hi there . today im 5 dpt and am feeling feverish since yesterday , i saw my temp today was 99.0 . does anybody have any idea why this temp goes up at this time of cycle? or if anyone of u experienced it before? im trying to find clues here...and getting more and more depressed that this time it wont happen too. lets see",
            "post_id": "1328915",
            "timestamp": "1181019600",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "hi,LJ good that u can start a new cycle ASAP. i really hope its successful this time for u . im today 10 dpo and still dont have any symptoms at all. feeling kind of down bcuz of it , but still thinking that things might change for good, still hoping....",
            "post_id": "1329242",
            "timestamp": "1181192400",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Oth-Temp spike could be from the progesterone or it could be a positive sign. An embryo implants anywhere from day 6 - 11, but usually day 6-7 post ovulation, meaning that u r are currently 8 days post ovulation. Everyone is different with symptoms and the meds play funny tricks on us. Also you have hcg in your body up to 14 days from the hcg injection(usually 2 days prior to retreival/ovulation). Stay positive and busy-mentally, physically take it easy.Don't test until your are at least 11 days post transfer, you don't want to test too early and get a false negative. Hang in there.Amy - the price we have to pay to have babies... I experienced severe weight gain all over when I was pregnant with my dtr - I here that girls usually do that to you. That is why this time I was positive it was a girl, I still look 4-5 months pregnant. I noticed weight gain in my face especially, plus my hair went so oily and I started breaking out - I never break out not even when I was a teenager.  If you were a runner, you will be again. You will lose the weight and have a nice little pink bundle too.As for me, I met with my RE doctor today and got the good news that I can try again as soon as my AF returns. Since I would have an additional AF after starting the suppresent meds and prior to the injections. So hopefully my AF comes sooner than later.",
            "post_id": "1329108",
            "timestamp": "1181192400",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Glad to see everyone is doing well Good news for you LJ I am tired and run down been a busy week, I finished up my shopping for the boys, I got them really cool seats that glide from fisher price. Spent a ton of Money. My feet are swollen no more red lobster for me to much salt in it I looked like the good year guy. I think I figured names for them Riley and Ryan. It just came to me over the weekend. Selena is out of Preschool next week that has been a big help now what to do to keep her busy LOL...Would like to see some updates as to where you ladies are in your cycles. SPREADING BABY DUST AROUND THE ROOM ( TWIN DUST )",
            "post_id": "1329297",
            "timestamp": "1181278800",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "Glad to see everyone is doing well Good news for you LJ I am tired and run down been a busy week, I finished up my shopping for the boys, I got them really cool seats that glide from fisher price. Spent a ton of Money. My feet are swollen no more red lobster for me to much salt in it I looked like the good year guy. I think I figured names for them Riley and Ryan. It just came to me over the weekend. Selena is out of Preschool next week that has been a big help now what to do to keep her busy LOL...Would like to see some updates as to where you ladies are in your cycles. SPREADING BABY DUST AROUND THE ROOM ( TWIN DUST )",
            "post_id": "1329298",
            "timestamp": "1181278800",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "I really love those names Toni. I am happy to hear from you. I am glad you are doing okay besides the swelling. Hang in there. Are you 27 weeks yet?Unfortunately my ordeal is not over. I went to my family doctor yesterday to check my kidney function, but when I told her of my bad experience and that I am still bleeding she sent me for an emergency ultrasound. I had the u/s done today and they found that they missed a lot with the d & c. So off I went back to the hospital (different one this time) and had another d & c. Hopefully this is the end of it. At least my kidneys improved slightly.I hope everyone else is doing well. Hugs to everybody.",
            "post_id": "1329410",
            "timestamp": "1181365200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Audream...it is long since I have posted. After the first thread was closed to comments, I tried a number of times to comment on the second thread and could not remember my password nor could access it. Just now I thought I would make another effort and, bingo, I got it right. I now have to note it down for the future.Like you I had my FET (but natural cycle) which failed miserably. I had one frozen embryo which was transferred as the others did not survive the thaw and that one did not take....So I am going to start a fresh cycle but I am not sure whether I will be changing clinics. I want something different, although the staff were nice etc. I hesistate to put so much money down in what could be a drain if the same protocol would be adopted. I have tried to put IVF out of my mind but of course if I would like to start within another two months or so I have to give serious thought of who I should go to to have a comprehensive gynaecological exam to see if that shows up something that was missed the first time.I had read that you were considering adoption and I was wondering whether you did not want to go on this IVF ride one more time in the hope that it would work. If it works, it would truly be worth it, having your own flesh and blood. That is not to say that there is not value in the choice you are considering.LJ, sorry to hear about all that has happened. When we think that it cannot get worse, it surely can. But it can also get better, much better. So we must continue to hope...I read that you are thinking about starting in a couple of months. I trust that it will work this time for you.The Others, who have been successful, congratulations. I hope to be on the your side some day. But only God knows what is in store for me....",
            "post_id": "1329467",
            "timestamp": "1181365200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Still trying to come to terms with my luck in remembering the password after so long, I have decided to post one more time before going to bed. It is almost 6 months since my first IVF cycle and I am back to square one, a bit poorer and much fatter :).  Hmmm. I have come off the folic acid and even though we baby dance, I do it now not with the expectation of getting pregnant....which makes the dance not as interesting.Lots of questions enter my mind, did I choose the right clinic, was it my fault, was it theirs, was it simply not meant to be at the moment. Even with this last attempt, I was hopeful even though there was blood on the catheter after the transfer, but nothing, nothing, nothing but disappointment and fat. I have started to modify my diet and do a bit more exercise but I have to do better. I would like to lose a few pounds, let my body adjust and then try again. But I do not want any medication in my system in June or July. If I were younger, let us say, if I were younger than 35 perhaps I would have taken a year off from all of this. But I can only take months.Do I go back to the clinic that I know or do I try a new one where there are fresh eyes? Or am I just wasting money as the REs do not really know what is going on but just try by a process of elimination?I have to do this IVF thing one more time just so that when I am grey I would not be saying \"what if I had tried one more time?\" I have to be stoic about all this otherwise I could not cope. I have not been posting recently, except for tonight, nor have I been discussing it with others. I am not sure what is worse - carrying the burden alone (with God's help) or wasting time confiding in people who simply talk out your business and stress you out more? I have opted for the former, apart from my chatting on this site...Life is truly about choice and decisions. As, to the best of my knowledge, my question is male factor, I could find another man. But then what? I would lose the one who does not mind spending his life with me....Isn't life something else? It is easier to find a sperm donor than it is to find a good husband. I think that I will leave it here rather than try in one night to overcompensate for my absence.",
            "post_id": "1329470",
            "timestamp": "1181365200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "LJ - so sorry to read about your D&C drama.  Dont worry things will be fine and hopefully you can start your next cycle soon.Audrey - Whats the latest goign on?  HAvent seen you post in a whileBemyyear - Welcome back.  Reading your posts, all i can say is that we all go through a few tough days in this very difficult time.  However, the one thing i will say is never lose faith in GOD and your partner.  If there is anythign stable in life right now its these two beings.  Also, imagine if you were in IVF coz of a problem with you, how would you feel if the thought even so much as crossed your partner's mind to find nother woman!!dont fret we will get there.  Like my doc in UK said - \"every infertility patient she has thinks she is the worst case of infertility\".So chillax!!Update at my end:just waiting for AF to arrive (may be another 10 days) and then go for my first FET cycle.  Am really excited.Love to all",
            "post_id": "1329472",
            "timestamp": "1181365200",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Sweedy, well said! I will let your words keep my thinking in check. Good luck with your FET!",
            "post_id": "1329492",
            "timestamp": "1181451600",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Congrats, Mommy2selena, on persevering. I would love to have twins, particularly identical. Although identical twins are not genetic there are number in my family. I guess I would be happy if I could get at least one child, but would be satisfied with two. I am open to having more. I guess that I am between clinics at the moment, particularly too because my other half wants one nearer to where we live. I have heard about US clinics with that type of program. I am not sure what the position is outside of the US.",
            "post_id": "1329519",
            "timestamp": "1181451600",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Yes LJ I am 27weeks and 3 days now, My feet are really getting swollen I feel bad I think because I look so bad and if people don't stop saying OMG your so huge, I have only gained 20lbs thats not alot. the babies weigh 2lbs and 7oz and 2lbs and 9oz as of last Wed at this rate they will be 10lbs by birth glad to be having a C-sec LOL.Ladies keep on trying I did not give up for 10 years I did everything I had a wonderful clinic, Trust your instinks if your thinking about changing clinics then do it. My clinic was great and I had alot of wonderful luck, I had a few IUI that did not work my IVF was successful and my frozen was. You just have to belive it will work. I also went threw a program called ARC it gave me my money back if it didn't work so I think they did everything just right to reasure they would keep my money LOL...",
            "post_id": "1329495",
            "timestamp": "1181451600",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "hi guys, im sooooooo tense riht now, this morning (im in NJ) was my BT  and im waiting for the doctor to call with the results. i gave my husband's cell number as i dont have the nerves to hear what she will say. i still have no symptoms so my hopes are not that up but still till the test result comes i can only hope n pray. please pray for me , this wa smy third try i dunno what i'll do next if this fails...will keep u posted as soon as i hear from the doc....",
            "post_id": "1329622",
            "timestamp": "1181538000",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Oth-  YEAH!  Congrats girlie.  That's wonderful.  Third time was a charm for you too.  Whew hew!!!!  51 sounds like a good number.  At 12 DPO I was 155 and I'm PG with twins.  I've been told anything over 25 is a sure positive.CONGRATS!!!!!!",
            "post_id": "1329655",
            "timestamp": "1181538000",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Oth-  YEAH!  Congrats girlie.  That's wonderful.  Third time was a charm for you too.  Whew hew!!!!  51 sounds like a good number.  At 12 DPO I was 155 and I'm PG with twins.  I've been told anything over 25 is a sure positive.CONGRATS!!!!!!",
            "post_id": "1329656",
            "timestamp": "1181538000",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hey all! I've missed you so much.  The Bahamas was great and suprisingly, the week did not go by fast at all so I really felt like I got a good vacation in.  Hope you are all doing well!Welcome back BeMyYear.  Sorry to read about your disappointments.  But Mom2Sel said it right.  You can't give up.  Many of us have been trying for years.  I went through 3 fresh IVF cycles (I never had any left to freeze) and on try 3 BAM .. Twins.  You have to hang in there.  I would look into another clinic, even if it's only for a second opinion.  Usually they say after 2 fails you should do that but it depends on you too.  Oh and yes...... it is much easier to get some donor sperm than it is to get a new man.  Especially one who loves and is good to you.  So no more of that kind of thinking!!!LJ- I'm so sorry to hear that your first weekend you were looking foward to ended up crummy.  That's terrible that they have to go back and do another D&C.  It's been a tough month for you girl.  I'm sorry but I know things are going to turn around.  Is this going to change your August attempt?Oth- Can't wait to hear the news and I hope and pray for you that you get your BFP.  Good luck!  Call DOC Call!!!Audrey- bummer about the maria situation but I agree.  If it's going to mess with your adoption chances it's not worth it right now.  Plus I know your still contemplating which way you'll go in January so .... things like this happen for a reason.  Did she find another foster situation?  Hope so.Deb- sorry about the trip to Laguna again.  Sounds stressful.  But hey, it sold right.  So now onto the bigger and better things.... BABY MAKING.Sweedy- glad to see your keeping that positive attitude.  Can wait to start hearing all the action the closer you get.  Times flying probably huh?Update on me:  I went to RE today and everything is fine.  Actually we came home on Saturday night and I went right for the hearbeat monitor (the one I ordered online.)  It's soooo cool.  I heard the heartbeats!!! It's wild.  I can't believe it.  I heard both of them.  Then today at RE I saw them moving their hands and feet!!!! How cool is that.  I've never seen this stuff before so it's just amazing. This is probably my last appointment with RE :(   (so sad to be leaving.)  I have my first consult with OB tomorrow after work.",
            "post_id": "1329638",
            "timestamp": "1181538000",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "OMGGGGGGGGGGGGG my husband called me an hr back n told me the doc called him n said the test came out to be positive. n i was like please tell me the truth n he was like yessss its positive. u know im going crazy here , bcuz i just cant beleive it, i cant beleive its happening with me after 5 failed IUIs , two failed IVfs . oh my God . the beta is 51 today so theyve called me on wed again to chk on the levels.can someone pleaseeeee tell me is 51 a good number , my nurse told me anything above 5 is good n positive. and told me not to over analyze stuff . i now truly beleiev anything can happen, even to me . will kepe u all posted.thanks sooooooooooooooooo much for ur prayers , i need it soooooo much thanks everyone...",
            "post_id": "1329644",
            "timestamp": "1181538000",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "This board has gotten so interesting once again. Nickimike926, when I read the part of your post which relates to me, I could not help but smile. You are absolutely correct. Thanks for the gentle chastisement and the encouragement. Congrats to you on persevering and being pregnant with twins. I do hope that the good fortune of having twins befalls me.Oth2007, congrats to you too!!!!! You have also persevered. So I must do like you and nickimike926 and so many others and keep the faith. The fact that it has not happened does not mean it will not happen.Audream, where are you? I hope that you are okay.",
            "post_id": "1329657",
            "timestamp": "1181538000",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hi all,So sorry I have not posted for awhile.  My best friend from grammar school contacted me after 20 years and drove up from Las Vegas with her partner.  So...we have been entertaining and catching up.  It was so much fun!Nicki,Welcome back girl.  So glad you had a great time and that your wee ones are doing well.  That heartbeat monitor sounds like a godsend! That's so amazing that you got to see them moving their hands and feet...beautiful! Good luck with your doc today.LJ,So sorry you had to go through that D&C.  I'm getting so excited for your next cycle in August!Oth,Congratulations Mommy! Once again, the third time is a charm... You must be on cloud 9! 51 sounds good...I was told that anything over 40 is great. Please keep us postedBemy,Hi girl!  So good to hear from you again! I feel your pain girl...but it sounds like you are not giving up which is key.  I agree with you about taking some time off to cleanse your body.  I got a ruptured cyst and a fibroid all because of the meds.  And, because of the hematomas on my tummy due to the Heparin, I have what look like shadows...not to sound vain, but summer is coming!!  Hang in there girl...we are your support system!Sweedy,It's countdown for you girl!  Are you still planning to put all of your frosties back?  So exciting...sending you lots of sticky baby dust in advance!Hi Deb,Glad you got the whole house thing taken care of.  It must be so hard to lose your parents and then have to sell their home.  All the memories!!  But...now you have so much to look forward to!  I'm so glad they are getting your lining under control...sounds like you have an excellent ER!  Glad your baby is doing well also.Thanks everyone for asking about Maria.  Very strange situation.  The social worker visited her home and said that it seemed very stable and suitable for Maria.  When Maria was told that she would have to return to her parents, she ran away again! Sounds like way too much drama for us.  The one that is going to suffer the most unfortunately is the baby!  So sad!7 days til summer vacation!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!XOXO",
            "post_id": "1329668",
            "timestamp": "1181538000",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Hi all,It took me a while to recoop from CA and then a while to read all the posts.LJ - so sorry about the D&C issue.  That is awful.  Glad your kidneys are better tho.  Will this put any delay on the next cyle for you?Oth007 - congrats that is wonderful.  Just another example of how persevering can work!  My RE keeps telling me its an odds game and this time you won!Nicki - that must be so cool to hear the heartbeats and see movement.  I would be so excited.  I think that would be the best part of being pregnant.  Glad the Bahamas were great.Audrey - glad you are well.  Any adoption news?  The situation with Maria does sound like more stress than you need right now.Bemyyear - hang in there.  Its not easy.  It might be good for you to at least talk to another clinic to see if they would do something differently.  I too have the fat issue and I am quite a bit older than you so it is tough getting it off!Sweedy - any idea when your next cycle is going to be?  And how many embies you are going to use?Toni - glad you are doing well and your babies sound like they are a good size!  You haven't gained a lot of weight so just ignore those folks that say you are huge - you are carrying twins after all.I went to the RE on Friday and my lining doesn't look right again in the ultrasound.  My estrogen levels are good and I started the dreaded progesterone shots this weekend.  I am going back next Friday for a biopsy to see what that shows after being on the hormones.  If it is still too thick, I will have to have a D&C.  I am keeping my fingers crossed that it is not!  If it is ok, I begin the search for a new donor.  That is what I am hoping for!Take care all!!",
            "post_id": "1329679",
            "timestamp": "1181538000",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "CONGRATULATIONS OTH2007!!!! That is fabulous news, and yes 51 is a good solid positive. Your levels will double every 2-3 days. I am so happy for you:)As for me I am not feeling very well and will post to everyone when I am better.It has been a very stressful and difficult time especially since DH had surgery only two weeks ago and is on bed rest. Think I am burning out a little, and yes this could affect our August cycle. We are not going to play the wait and see game...Promise to talk to you soon. I just had to post my congrats!",
            "post_id": "1329685",
            "timestamp": "1181538000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "I have a retroverted uterus and I am wondering whether this makes it more difficult for the doctor to see where exactly to place the catheter during the FET and how to slide it out. I remember flinching when something was touched. After the FET I went to the bathroom and there was blood.... This did not happen in my fresh cycle....Has anyone had a similar experience?",
            "post_id": "1329761",
            "timestamp": "1181624400",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "so u can ask them if they can do the transfer under anesthesia , it might help.and    all the 3 times i had little blood after my transfer , when i first wnet to the restroom. i think its bcuz of the catheter going in or something . but theres nothing to worry abt it unless its heavy... take care",
            "post_id": "1329771",
            "timestamp": "1181624400",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "hi all,thank u so very very much....u guys must know how much strength u all have given to me. u have all been sooo inspirational...im glad i found this site and found some great friends here...LJ. keep going girl..hopefully august cycle will work...think positive . u know the day of transfer me n my husband argued so much over my eating habits ( which r bad as im very thin) and i was so sure that on transfer day we r fighting n arguing n im so tense , its not gonna happen at all but it did... im sure u will go thru this n come out more n more strong...my wishes r with uNicki. im glad u had a great time...u r my inspiration...keep going :)))sweedy. i wish u the very best of luck for ur next cycle...praying that it'll work...as for me i will be going for my 2nd BT tomorrow...hoping the beta will be up n up:))) im not feeling nauseas at all but my mouth tastes bitter. n theres some tingly sensation in my breasts which comes n goes...in my lower abdomen im feeling some painless gaseous feeling which is continuous...the only one thing which was different in this cycle for me was the absence of menstrual cramps which was strangest for me. im the kind who gets the worst menstrual cramps every cycle of the month since puberty( may be it comes from my mother ) but this time i was like why am i not having that crampy feeling???...i didn't know it would be this...i m happy n i cant believe it still, its happening with me.thank u allll for ur love u support...will keep u posted.",
            "post_id": "1329723",
            "timestamp": "1181624400",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Audream, glad to know that you are alright! I am so sorry to hear about the ruptured cyst and fibroid because of the meds. I wonder what long term effects all these meds can have on me, particularly as I am going through this whole process again once I decide on a RE and a date. Apart from concern about the long term effects,  I dread the egg retrieval process. For me that was physically the most painful of all the processes associated with IVF. I had general anaesthetic but I remember feeling something being punctured even though I was supposed to be asleep. That in itself was not painful but later the night when the meds wore off, I was in such great pain. Luckily the pain had disappeared by the next day.Following my failed FET, my RE suggested that I should go on Heparin the next time even though the tests do not show up a problem with the antibodies... more medication. I am willing to try this if it would a difference. I will have to pray, pray, pray that nothing goes wrong or fundamentally wrong.Old Debbi,I hope that you do not have to do a D & C. I had to do one of those some time last year to remove a polyp...The doctor said that this was necessary to facilitate implantation. What implantation? On a different note, I am looking forward to seeing what positive on a pregnancy test looks like. I have seen positive with a LH surge but never the former. I wonder if I do the tests wrong :)) I do hope that you find the new donor soon.LJ, I wish that I could join you in August but I doubt it since the earliest appointment for an initial consultation that I can get is August. I hope to try in September. Hope that you feel better soon...pace yourself.... Take it from me even though I am burning the candles at both ends at present. Tonight though after I am finished this post, I am going to get ready for bed....Oth2007,  I am anxious to hear about your beta as well as whether you are having twins. I am glad to hear about your success. I hope it comes to us all soon. In January after my failed IVF cycle, I came up with this name \"Bemyyear\" in the hope that I would get pregnant in 2007. The months are going fast and I am back to square one. I feel like I have been eaten by a giant snake on a snake and ladders game and I am now at 1.Audream, any plans to try IVF again?",
            "post_id": "1329760",
            "timestamp": "1181624400",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "hi,i know this is a difficult time but what works for whom u cant tell. i did not expect that my 1st and 2nd try would fail but they did. and i dont know what combination of meds made this try work. so hopefully things will work out soon for u too. u r in my prayers. i wanted to tell u that i have retroverted uterus as well, and surprisingly my doctors never mentioned it as a problem or anything. but i know this for sure that people with retroverted uterus have more pain as it touches the catheter when it goes in. the doctor can see your uterus on ultarsound machine when doing the transfer so they can see where they are placing the catheter. as for me i used to flinch sooooo badly even on normal examination that my doctor suggested that i MUST have anesthesia on transfer also. all the 3 times i had anesthesia. though in my second and 3rd try they tried to clean my cervis when i was awake, to see how i would tolerate it, but i could not. so they decided that they must put me to sleep on transfer also. so dont worry about this at all. hopefully it will work out for u soon...",
            "post_id": "1329770",
            "timestamp": "1181624400",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Oth2007, Thanks very much for the response. I was put to sleep when the transfer was done but the problem was the pain I felt in the night. I think that something was punctured to receive the many follices. I am glad to know that you were successful notwithstanding having a retroverted uterus. It gives me more hope. Hope that your beta continues to rise. Keep us informed.",
            "post_id": "1329887",
            "timestamp": "1181710800",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "LJ,Thinking of you and hoping that DH is recovering well and that your spirits are up...Hugs!!!",
            "post_id": "1329920",
            "timestamp": "1181710800",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Bemy,Hi girl.  I honestly don't know if I will try IVF again.  I'm leaning more more towards adoption at this point, which can be quite expensive...approx $20,000.  Since IVF can be equally expensive after multiple tries, (not to mention the toll on one's body), we will have to weigh the pros and cons and see.  Since my husband already has two daughters, we will definitely be happy with just one more miracle.  We'll see what the Lord has planned for us!Regarding Heparin...I was also put on it without having any tests done beforehand to see if I had a coagulation problem.  I was really upset about this when I realized.  Please question your RE about this before going on this strong med.  I mentioned before about the huge hematomas and the shadows they left behind.  I am still very tender in that area still..after 2 months!!!Oth,Looking forward to hearing how your us went.  Also was wondering what part of the world you were from??",
            "post_id": "1329945",
            "timestamp": "1181710800",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "bemyyear - retroverted uterus do not affect fertility. I already asked/researched that question and I have had successful pregnancies previously. When you are pregnant & in 2nd trimester it actually falls forward to the natural position. The RE should go by the u/s and adjust their intrusment to the angle of your uterus. Don't worry.",
            "post_id": "1330054",
            "timestamp": "1181797200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi guys. I hope everyone is doing well. I am a little better.As for the retroverted uterus, the only time that it has caused me a problem was with this D&C. The doctors are saying that is why they had to do it twice because it's very tilted, but I did remind them right before I went into the OR. I think they just rushed. What sucks is I have been bleeding for almost four weeks now, they say it should only be a couple days. When I went to my family doc last week & told her, she sent me for the u/s that showed I needed to go to the ER for a repeat surgery. It's been almost a week it's better but still there. The only problem is that who knows how long it will be for my AF to return and be able to start my next cycle. Probably will more likely be september now, but I will pray for sooner. I go back to my doc on Friday.Audrey I am glad you are feeling a bit better. IVF does take a toll on the body. For me I put on weight, AF got worse & my kidney function was affected. I know it's really hard to think about going through it again, but you only had one full cycle. It might be worth one more try before giving up altogether, as long as your health is okay.Take care.",
            "post_id": "1329950",
            "timestamp": "1181797200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "hi,hope u all are doing good...Audrey i'm in NJ but originally from India. when we told my mother yesterday on phone back there she was in tears, so was my mom in law. they both r planning to come and care for me... im waiting soooo much for that .it will be 5 yrs in august since we got married so everyone was impatient to hear this news.i had my Blood work yesterday to see my beta levels and my doc said its looking good, going up nicely ... i was so relieved to hear that. tomorrow will be another beta test to see how its progressing , then the nurse said next week sometime i will have U/S. i hoping every test goes good.LJ im hoping you could start soon hopefully in august.  be positive...bemyyear..after retrieval i felt that all my lower stomach is raw n i was always bloated for a week after that . even when i went to restroom i could urinate with such difficulty and pain but it went away after 3-4 days every 3 times that i had my retrieval.im still not feeling any kind of nausea , dont have any food aversions right now. its just my breasts which are tingly and im feeling constant gaseous feeling in lower abdomen. i work so i am usually tired at the end of the day but yesterday i felt like running away from my desk , i was feeling restless for sometime.hope everything goes well with all of ustake care all",
            "post_id": "1329960",
            "timestamp": "1181797200",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "Hi girls,LJ- hope you and DH are doing ok.  Sorry to hear you've been bleeding now for 4 weeks. What a nightmare all this has been.  Ugh.  xoxoOth- glad your numbers are climbing.  Good luck tomorrow and with the us next week.Hope everyone else is doing well!!  My first OB appointment went well.  They scare you a bit.  Well me anyway.  Talk about amnio's, first trimester screening etc., not to mention potential threats of bed rest and pre-term labor YIKES.  Was a lot but I guess that's what they have to do.  Inform you of it all.  I really liked him and am glad my RE recommeded him.  He said the babies are exactly where they need to be in terms of growth right now so all is good.  PS- said both heartbeats are very fast (sign of 2 pinks!!!!)  but we have to wait for an official on that in another 8 weeks or so :)Chat soon.",
            "post_id": "1330004",
            "timestamp": "1181797200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Audream, I have my doubts about using Heparin. I am going to have the blood tests done by another lab and see whether the results show up any problems with antibodies. If there are no problems, particularly after what you told me about the hematomas, I would decline to follow that method.Did any of you who are now pregnant use heparin?Audream, good luck with the adoption. I am not leaning in favour of adoption though. I want my own child and if I cannot have my own child, I will give what I have, including lots of love, to my niece and nephew.LJ, so you too have a retroverted uterus. I am now starting to wonder if there is any link between the shape of our uteruses and problems with conception. I plan that if I go to another clinic to tell the RE and remind the RE that my uterus is tilted and that he must factor that in in the transfer. He would probably thinking that I am overstepping my bounds, but it is my body. If he has never done a ET with someone with a retroverted uterus, I will be telling him \"goodbye\".Oth2007, your news about your stomach feeling raw is a bit frightening. I was also bloated. Good luck with your appointment tomorrow...Nickimike926, glad to know that things are progressing well for you. You referred to amnios. Is this the test for downsyndrome? Why did you need amnios?Sweedy, Olddebbi and all who I have forgotten, I hope that things are alright with you.",
            "post_id": "1330026",
            "timestamp": "1181797200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "hi everyone,i had my beta test again today . the doctor said it soo fast on the phone that im not sure what it was exactly but she said 400 soemthing . either it was 406 or 460. im today 15 dpt and 18 dpo (retrieval) . can anyone tell me if this level is looking like a singleton or twins...11 dpt or 14 dpo it was 5113 dpt or 16 dpo it was 137please anyone have any idea what it can be??",
            "post_id": "1330083",
            "timestamp": "1181883600",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "i had a day 3 transfer on the 31st of may...",
            "post_id": "1330084",
            "timestamp": "1181883600",
            "user_id": "user_206731",
            "user_link": "/personal_pages/user/206731",
            "votes": "0"
        },
        {
            "answer": "I am jealous you are almost done. I have 2 more weeks with this group ...which includes report cards, testing and cums and the a week of meetings and then the new year starts in July 9th. Year round is bizarre!Audream, I love your names! Choosing names has been difficult..since my DH and I have to agree..:) being in schools for so many years means a lot of  the names are off the list.  But I think we've decided on Sierra Katherine....Katherine is my mom's name and a family name on DH's side...",
            "post_id": "1330128",
            "timestamp": "1181883600",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "oth- Congrats! At 11 dpo MIne was 83. I am having only one. After my ultrasound to confirm only one, the doc asked if I felt ripped off because I only had one :) .....but no way. One is perfect.Be My year- I have not used Heparin. Due to some test results they said I didn't need it. I'm not sure what it does or what they measured. I too have a retroverted uterus, but I have not had any pain with the procedures..sometimes the transvaginal ultrasounds were uncomfortable but I don't know if it was the tech or if it had something to do with my build. All doctors have told me it shouldn't cause a problem. But I've known several people that have had them and needed fertility treatments. Also, I heard once you are pregnant the uterus \"right\" itself and straightens up. I wonder if it stays that way or goes back to being retroverted?Happy weekend girls! SO glad it's Friday. The last two weeks feel like they've been at least a month!",
            "post_id": "1330104",
            "timestamp": "1181883600",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "LJ,Good to hear thay you are feeling a little better...and August or September,  it will be here in no time!  Thanks for your advice about trying IVF again...we are really thinking about it.Nicki,Whoooo!!  Possibly 2 princesses?  Awesome that everything is going well.  Have you come up with 2 boys and 2 girls names yet?  Gosh, my DH and I came up with names even before we were married and still plan on using the same ones...Christian Angelo and Sophia Isabella.  I am so happy for ya!!Hi Amy,Whoa, are ya feeling the end of the year paperwork crunch?  Are ya counting down?  Have you come up with a name yet for your princess?Happy Father's Day to all the Daddies and Daddies to be!!!!!!!!3 more days til summer vacation!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "1330117",
            "timestamp": "1181883600",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Amy, thanks for the response and congrats on your pregnancy. Wishing you all the best.",
            "post_id": "1330137",
            "timestamp": "1181970000",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Audrey and Amy I love the names. I have close friends one with an Isabella the other with Sophia, and they are both beautiful girls. I had thought of Katherine too, as it's my grandmothers name. I have my boys name still picked as I let my husband pick our sons name 100% with the condition I get to choose the next - Alexander Jeevan or Jeevan Alexander. This time around I was sure it was a girl and I had picked out Sarah Jayne or Avani Jayne. Sarah means princess and Avani is means earth in sanskrit, Jayne is my middle name and my great grandmothers. Hopefully I will get to use one or both soon.Oth2007 the numbers are looking like a healthy singleton, but you never know - could be two. When is your ultrasound?Take care.",
            "post_id": "1330169",
            "timestamp": "1181970000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hey all,For some reason my home computer is making me reset my password, so I couldn't post a comment over the weekend.  You guys probably enjoyed the quiet.. hee hee.I love all the names you guys have been throwing out there.  I am leaning towards Dillon and Devon if 2 girls OR if a boy or girl.  That's if I can convince hubby not to name the boy Mike after him. LOL.Oth- my numbers at 18 DPO were 1,691 and I'm having twins so it sounds like you have one healthy singleton bean in there!Hope the rest of you are doing well.  I have to go back and re-read this weekends comments but I'll chat more later.  Back to work UGH!  Wish I had a summer break Audrey!",
            "post_id": "1330272",
            "timestamp": "1182142800",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi all,Hope everyone is doing well - it sounds like it.  All of the names sound great - man I didn't even get that far yet.  I guess I should start looking!LJ - I'm glad you and DH are doing better.  What a bad experience for you.  Hopefully it leads to good luck for the next try.Audrey - I think either way you go will make you happy.  You just have to feel comfortable with the decision.Oth007 - Glad your numbers are doing well.  I am in eastern PA so not far from NJ.Nicki - Girl power!  Just kidding - boys or girls who cares.  I guess the OB does have to tell you all of the things that could happen with twins although I'm sure you will be just fine.Amy - Nice to hear from you.  I am jealous of you and Audrey having the summer off.  My brother is also a teacher in CA and is really psyched.Bemyyear - Since I am using donor eggs, I never had to go thru the retrieval process but it sounds yucky.  Thank goodness the donors are willing to do it.  I would not have any qualms about getting as much information from your RE as you can.Well, I thought I was having my biopsy last Friday but it is not until this Thursday.  I am keeping my fingers crossed.  My donor is still hanging in but probably won't for much longer.  I am thinking positive thoughts!!  Take care!",
            "post_id": "1330325",
            "timestamp": "1182142800",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Hey Deb- just our lonely posts.  Where are ya all girls??Deb- sorry its up in the air with the donor.  That stinks.  But maybe your patience will pay off.  I tell ya, I said to DH a while back that if I could after I had a baby, I would definately donate my eggs.  Going through all this IVF stuff really makes you feel for everyone else that's going through it.  Good luck on Thursday.  Let us know how it goes.",
            "post_id": "1330413",
            "timestamp": "1182229200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Deb good luck with the biopsy tomorrow. I hope all goes well. I hope your donor sticks with you, I know it must be hard to find someone.Nicki, I can't believe that you are almost at 12 weeks already. How are you feeling? So when is your hopeful due date?Toni - How are you and the boys doing? Time hopefully is flying by now. 29 weeks? Is it still Riley and Ryan? Did you ever find out if they are identical or not? I think they are. How is everything else going?Aubrey - How is summer vacation starting for you? I hope you are enjoying some \"me\" time.Amy - it's almost summer vacation - just around the corner. How are you feeling? When is your due date?Oth2007- How is everything going? Have you had your ultrasound yet?As for me, I am doing okay. Bleeding almost gone, just waiting for AF to return and counting down the days until I am on vacation too.",
            "post_id": "1330573",
            "timestamp": "1182315600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Deb,Hope your biopsy went well today...please let us know how you are doing.  The angel that donor works out for you is the one that's meant to be!Nicki,Love the names you have chosen!  How is your pregnancy going?  Still checking those lil heartbeats regularly? : )Amy,What a lovely name for your lil angel!  I just read a book where the main character is Sierra...sounds exotic!  Getting all your paperwork done? It can be painful...lol...LJ,So glad to hear that the bleeding is less now.  Countdown to August/September!Bemy,Did you talk to RE about your Heparin concerns?  When will you begin your next cycle?Sweedy,How's it going?  Got any dates lined up yet?Oth,Anxiously waiting your us results.Today was technically my last day (without students)...so...I am freeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee!Happy weekend all!XOXO",
            "post_id": "1330605",
            "timestamp": "1182402000",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Deb, Hope that you are well. How did your biopsy go today? I am dreading going back to a gynaecologist. The longer I stay away from one, the harder it gets.Audrey, Hope that you too are well. I have not spoken to the RE about my heparin concerns. I am going to have two other opinions on my need to have IVF as well as the protocol that would be adopted. One appointment is on July 23 and the other is for early August. I cannot remember the exact date at present. My thinking is that I will be embarking on cycle 2 either in August or Septembr or as soon thereafter as possible. It is just a question of deciding which RE to go to and what they say. I wanted to buy some household items but I have put that on hold until I find out how much the second cycle is going to cost me. Hope that you will be my cycle buddy.",
            "post_id": "1330722",
            "timestamp": "1182488400",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hey girls.Happy Summer!  Hope your all doing well.  And happy vacation for those of you kid-free teachers!  You guys must be psyched to be off!LJ- how are you feeling?  Has there been any new news on how long you'll need to wait? Or do you think you'll still be on for August?Deb- hope your doing ok.  What's happening with the donor?  How's your lining?Audrey- summer is going to fly by girlie, then we're onto you. How are things in CA and what are you doing with all your extra summer time?I'll do more personals later.... I was thinking of Sweedy.  Wasn't her cycle starting very soon.  We haven't heard from her.  Hope she's in her two week wait and waiting for her good news.I just wanted to hop on quickly to let you know I was thinking of you all.  I'll be in my 13th week soon and my next OB appoint is Thursday.  Goodbye first trimester!!",
            "post_id": "1330908",
            "timestamp": "1182747600",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi guys. Hope everyone is well. One more week until I am on vacation for a month... Last weekend was the first peaceful weekend I have had since Easter. I am doing okay. Going a little crazy waiting for AF. I hope I will be able to go ahead in August, but who knows. Nothing I can do but keep myself busy daydreaming about vacation. No plans to really go anywhere, just to have a little R&R from work.Just a warning, I think that we may get cut off soon. Be prepared to find the new post.Hugs.",
            "post_id": "1331240",
            "timestamp": "1182920400",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi all,Nicki I cannot believe you will be in your 13th week.  Time flies so fast it is unreal!  That is super because things will be better during the second trimester although it doesn't seem like you have had a hard time to date thank goodness!I have been reading but not posting, altho the postings have been sparse - you can tell it is summer vacation!  My husband and I just bought a cottage on Cayuga Lake at the Finger Lakes in NY so we have been busy the past few weekends with looking at houses and then the home inspection.  It is about 3 1/2 hours from our house so should be good for weekends.  I am really excited and it has taken my mind off the IVF worries.  I had my biopsy on Thursday and was supposed to find out something by today but did not hear so I have to call the RE tomorrow.I hope everyone is doing well.  We are having a heat wave here and I hope it ends soon.  I envy you all on the west coast!  Take care!!",
            "post_id": "1331114",
            "timestamp": "1182920400",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "I was thinking the same as LJ that we might be cut off soon - I keep checking this time as I was not that observant last time.Called my RE but still haven't heard about the biopsy.  Keep thinking of the book \"The Secret\" and trying to stay positive.  I really wish I wouldn't have waited until I am so old and now having to do this in such a short time frame.  I started this process two years ago and I guess I thought it would just happen correctly right away.  I never thought it would take this long!Hope you are all well and I will let you know when I have news.  Hope I have a 2 ww buddy!",
            "post_id": "1331243",
            "timestamp": "1182920400",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "HI everyone,Haven't posted in awhile as we were almost though the adoption process and just two days before we paid the fee I was contacted by a lady in NV who donated 4 embies....god works in strange ways. SO now we have started our meds and look to thaw and transfer on 7/24. I am so nervous as I know there is a chance they will not make the thaw but am trying to stay pos. Will keep u posted. Baby Dust to all of us.....",
            "post_id": "1331256",
            "timestamp": "1183006800",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "LJ- I'm glad to hear you had a peaceful weekend. And a month long vacation of not doing much but R&R sounds good to me.  I'd take it!!!  I'm praying you'll be good to go for August.  Isn't waiting for AF to start the pits. I hope she shows soon so you can get on with it.  I hope the time goes by quickly for you.Deb- I know what you mean about the waiting part.  I think we ALL would say the same thing.  I know with me I thought exactly as you.  Ok will if I try at this age I'll have a baby by this age.  Yeah.  Funny stuff now.  Doesn't quite work that way.  It's so difficult b/c at the time, you think your doing the best thing.  Getting established, making sure you can financially afford etc., and then when you're finally ready, it doesn't happen.  I guess that's where the advice of \"It's never going to be the right time\" came from.  And it looks like we're almost out of this heat wave we're in thank goodness.Audrey - hope your enjoying your vacation.  Whew hew for you!!  What's going on with you.Hope everyone else is wellI go today to my ob appoint.  Hopefully I'll find out the results for the nuchlear (spelling) test.  Blood test was done two weeks ago.  I'll get another U/S to make sure babies are growing strong.  I'm nervous.  But then again, I'm always nervous.  I'll let you know how it goes.",
            "post_id": "1331196",
            "timestamp": "1183006800",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Just wondering???How old are you. I am 44 and trying again. Some people think we are selfish at this age but I know in my heart this is what we wish for. To us age is just a number. I am afraid of MC again because of my age but pray for the best. RE thinks is was just the egg last time and we should be okay. Debbie I know you are around my age and was wondering how long you have been ttc. Any advise. I am starting massage therpy next week hope that will help...Love to all",
            "post_id": "1331428",
            "timestamp": "1183093200",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "I'm 33.  But whether 33,35,40 or 45.... women wait for many different reasons.  It's so frustrating when you're so close (in your case maybe an egg issue with the last time) and then you just get knocked down.  Women are having babies later and later in life and modern medicine just keeps advancing.  I'm hopeful this is your time.  I think it's going to be time for all of us.  Everyone just has to try to keep the faith.",
            "post_id": "1331453",
            "timestamp": "1183093200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Audrey, it is me again. This is just a correction. I meant to say \"although I know that the injections were NOT bad\".",
            "post_id": "1331531",
            "timestamp": "1183093200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "mstrex- glad to see your back and you found us.  And that is GREAT news about finding someone who would donate embies.  God does work in strange ways.  It's just wonderful. Keep us posted.The rest of you gals have to bump up the action on this board :)  I'm lonely posting all by myself :)My appointment went well yesterday.  They are growing fine and the heartbeats are strong.  The first trimester tests call came back normal.  I passed with very high score :)   While the tests are not 100% accurate, we do feel much better and will likely NOT do the amnio.  There will be one more test they will do in about 4 weeks called AHT??? I know I have the letters wrong but they say it so darn fast all the time. And that will further test for any kind of chromosonal or downs issue.  BUT.... I know everything is fine in my heart so I'm really not worried.  You believe that's coming from my mouth!!!!!!  So I saved the best for last.  Forget the pink.  Doc says he is almost positive it's 2 boys!  He said it's a little early to be 100% sure but he's about 95% sure and he's calling it 2 boys from what he saw.  Can you believe it.  BLUES!!! Oh god, look out.   Well I think I typed enough for one day.  Sorry so long again. xo",
            "post_id": "1331363",
            "timestamp": "1183093200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi all,Enjoying not having to wake up early and love lingering through my vacation days.  Went to Disneyland on Monday ( LOVE IT!)  We cannot afford to go on a BIG trip this summer because of the new house, but we will be going waterskiing at the Colorado River in July with the whole family!Nicki,Congratulations on finishing your first trimester!!!  It went by so quickly!  AND boys...Whooo Hooo!!!  That's awesome news!!  DH must be thrilled!  Will you stick with the same names? Devon and Dillon will work for two princes as well. You must be on cloud 99 girl!!   LolLJ,So glad you will be on vacation for a month.  I think we have all been through so much and truly deserve R&R.  Praying that AF arrives soon for ya!Deb,Can't wait to hear the results of your biopsy.  I know what you mean about wishing we had tried sooner.  I wish I would have met my soulmate sooner and then I could have started sooner.  But, everything happens for a reason, I believe, and God has a special plan for us all. How is your furbaby doing?  Congratulations on the purchase of your Lake House...sounds amazing...what a great place to get away! That book \"The Secret\" has been recommended to me by others as well...think positive!!Oh, Deb,  just curious, how much does it cost for a surrogate mother?  DH was asking and I had no clue.mstrex,Welcome back!  God does work in misterious ways...all I can say is that it was truly meant to be for you to get those donated embies and I have a real good feeling for ya this time!Amy,Are you on summer break yet?  Hope so! When will your maternity leave begin?Sweedy,How did your ET go?Bemy,Got any dates lined up yet?  Have you gotten your second opinions yet?Nikki,Miss you!  How are ya girl?  What will be your next step?Happy Weekend!XOXO",
            "post_id": "1331488",
            "timestamp": "1183093200",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Audrey, in response to your question, I have two dates lined up. One on July 23 and the other one in early August. These appointments would probably be very preliminary since it would be my first visit. One of them might even coincide with AF. There was little I could do since that is the first available date. I will be using my instincts to see if I feel comfortable with the RE in question. If I am not comfortable, I am out of there....But from there to where? I do not know. Time is going so fast. I just have to surrender all to Jesus. It is just too much to handle, too much to hold. I dread the injection process. The thought of it makes me feel as though I would hyperventilate, although I know that the injections were bad. I am telling you, the longer I wait the harder this gets. It only takes a few challenges to overwhelm me now. I guess this is because at the back of my mind I know that I have to take the plunge into ivf again and I must do it sooner rather than later. I will let prudence prevail and step forward as soon as a reasonable opportunity presents itself. I wish that this was all a dream.Well you do seem to be in very high spirits. Congrats to you.",
            "post_id": "1331530",
            "timestamp": "1183093200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Bemy- I can totally relate to your post about the obstacles getting overwhelming...and waiting from month to month for this appt. or that test..without getting started. It's gets easy to start thinking forget it...because it probably won't happen anyway. BUt keep trying! I know it's hard to keep the faith. But you will definitely be able to say you tried everything possible.It will happen!Congrats Nicki you passed a huge milestone! Two boys! That's awesome! The test is an AFT. I did that aoround 14 weeks or so..I was really nervous to get those results because they could lead to more invasive tests and so many people get false positives and then have to decide which further tests to do. I am lucky to have them come out normal..Hooray! I will keep my fingers crossed for you and your two little ones! It took 4 weeks to get those results because they sent it to a state testing facility.Audrey- no summer break for me..I am very jealous. I am so glad to hear abotu the fun you are having. You deserve this time to relax and recooperate from the year. I am year round and today it HAD to be over 110 out here. It was my last day with this group of Kinders today. We had a huge performance and it turned out great ..plus everyone had left by 10:). SO my mom and dad came and helped me paper my boards and stuff. I have meetings next week and get a new group of students the following mOnday. I do have August off. I just have to get to August. About 5 weeks total. Once I go off-track I won't go back probably until January.I'm kind of glad I have work to keep me busy while waiitng for this little one to be ready to make her appearance. Only 11 weeks to go...if she's on time. :)Girls, It's good to hear from so many of you. Enjoy the weekend!!!",
            "post_id": "1331541",
            "timestamp": "1183093200",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "Happy 4TH weekI am still PG Just a quick update on me I am 30 weeks now and things sure have slowed down these past few weeks the babies are really draining me, I am due Sept 7th But I am thinking they will be here much sooner, I decided on Riley and Ryan for names. So far other than the normal PG things like swollen everything LOL things seem ok I have been getting pregnancy massages, Just a excuse but it seems to be helping with some of the swollen feet and legs. Baby A is much more relaxed than B he is always moving and kicking me alot.Glad to here you ladies are all doing well. Enjoy your summer vacations I will not be traveling no where this year. First year I have been home bound good thing we put a new pool in this year.Well it is 12:30 I need a Nap the tiredness has kicked in worse than first trimester.... have a great week ladies Best to you all and twin dust in the room........",
            "post_id": "1331575",
            "timestamp": "1183179600",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "Hi guys.That's great news Nicki. I am so very happy for you. It seems two boys is getting popluar, first Toni and now you.The AHT test is probably what they cal here in canada a triple screen and I have heard more people get a false postive than an actually negative. I opted not to have it as I didn't want to be stressed the whole pregnancy. Besides if you get a false postive, then you have to have a amnio to clarify.I hope everyone is planning a great week and summer, it's the 1st of July for us and hope there will be lots of sunshine.Toni, I think you'll make it to at least 34 weeks but hopefully 36. Glad everyone is doing well in there. How's Selena?Three more day of work ahead then a month off. YEAH! I went for my kidney u/s today and good news, there has been no significant change since 2000. Hopefully that will be the end of my tests. Still no AF, had spotting this week again but that's it. IT'S DRIVING ME CRAZY. Oh well It happend sometime or other...",
            "post_id": "1331620",
            "timestamp": "1183179600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Wow!! I have a lot of catching up to do to do!! I think this is the second message board  since I last left messages in March or April. I entered Audream's name in goggle to find you guys.  Look forward to hearing from you girls.",
            "post_id": "1331817",
            "timestamp": "1183352400",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,Hope you all are having a safe 4th. If any of you are wondering, there is a site out there miricalswaiting.org. I know that most of you are using your own eggs but others are using donors. This is the same thing as using egg donors but they are the embies. The cost is so much lower than most treatments. Our ivf was 17000. We have had two donors donate their embies and the cost is for procedure and all 2000. You do not have to sync your cycles with donors or anything invaseive. I will be on meds for three weeks and then do the transfer on 7/27. The wait is less as we will know in 6 days if they stick or not.  Just thought I would pass on the info. Love to all.",
            "post_id": "1331863",
            "timestamp": "1183438800",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Amy, thanks for the support. I hope that you, and the others are doing well. Nothing much is happening at my end other than having to find strength to keep my spirits up. I went to a party yesterday and the children there were so beautiful and precious. Their interaction with their parents was just amazing. I am looking forward to my turn. All the best.",
            "post_id": "1332014",
            "timestamp": "1183525200",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "I hope everyone had a nice holiday. I am doing okay. Friday is my last day of work for a whole month, I am so excited. Still no AF, but I am trying to keep my spirits up. Played baseball yesterday evening as work event and had a blast. Miss being active like that and might help lose this IVF/baby weight...",
            "post_id": "1332198",
            "timestamp": "1183698000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi All,Sorry I haven't posted in a while.  I have been a bit depressed.  My biopsy came back again with hyperplasia.  My RE said I need to get it taken care of whether I want to get pg  or not so I am having a D&C on Friday 7/13 (lucky day I hope).  I hope I will recover quickly because I am having a baby shower for a friend the next day - not at my house but am one of the sponsors.   Then I have to be on meds for a couple of months before doing IVF.  If it works it may be the reason the IVF didn't work before - I am hopeful this will give me a great lining for an implantation.   I started this process over two years ago thinking things would work ok.  I just turned 48 and I don't think I can do it much longer - not fair to the child.  My brother and his wife just did donor IVF yesterday- they implanted two boys - she is 6 months younger than me but altho it worked for her the first time, she miscarried for an odd reason.  'Since both my parents died recently, I am so hoping their IVF will work and mine will too so we have cousins close to the same age.  I love reading about all of you but am so sorry that today I am just being selfish. I will ask more soon and am very happy for all of your joys and good news!",
            "post_id": "1332549",
            "timestamp": "1183784400",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Debbie, I am sorry to hear about your initial disappointment. If this was indeed the cause of the lack of implantation last time, then it is really good that the biopsy showed it up. We should then celebrate your result rather than be sad. I am keeping my fingers crossed for you and am hoping that by Christmas you will be pg. Keep your chin up.",
            "post_id": "1332557",
            "timestamp": "1183870800",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hi girls,Am back after a long while.  News from my end, embryo transfer done on last friday july 6.  6 of my 7 frozen embryos survived the thaw process and so we transferred all 6.Now is the painful 2WW.  This part is just not fun.LJ - am hoping you start your IVF cycle soon too.Nicki - good to hear abt your progressAudrey - hows it going??",
            "post_id": "1332663",
            "timestamp": "1183957200",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Deb- I'm so sorry your depressed and bummed.  All this IVF stuff will drive anyone nuts.  Factor in your lining issues and it's a recipe for major highs and lows.  I am so sorry.  Be angry today.  Your entitled.  But get your positive vibes back so you can mentally be pregnant, then the doctors will do the rest.  Have faith b/c I do feel everyone on this board is going to have thier wishes fulfilled this year.  I'm sorry you'll have to go thru the D&C but I have heard that it turns your uterous into a terrific oven for baby making!Sweedy- yeah for you.  Holy cow 6!!! Hope the 2ww goes by super fast for you. Can't wait to hear some good news from you.  When do you test?LJ- I'm very jealous.  It's Monday and I'm at work and you're not.  Hope the start to your vacation is going great.  Did AF arrive yet???  Girl, I'm keeping my fingers crossed for ya.Hi Audrey and Bemy - hope your doing well too!",
            "post_id": "1332674",
            "timestamp": "1183957200",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi Deb. Sorry to hear that you have to wait, I truly feel likes it's worst part. Everything is over quickly the waiting is what drives us nuts. To make you feel a bit better is that my second D & C was easy, I was fine the next day and I had light bleeding for a couple of days that's it. I hope Friday the 13th is good luck for us both.Sweedy I am glad that you were able to do your transfer. As I said waiting is hard, when do you test? 20th?I am glad to hear that you are doing well Nicki. You MUST be showing now. Still using the heart monitor everyday, probably before you go to sleep each night. Any crazy dreams or craving yet?I am doing good. I am on vacation and it beautiful outside. The temp is very warm, in the 80s. Trying to spend my free time in the garden and with my son.Hope everyone is well and looking forward to hearing from you.",
            "post_id": "1332816",
            "timestamp": "1184043600",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "It is sooo hot here. It's over 100, and you thought las vegas was hot. I took Delaire shopping for the day just to be in air conditioning. Wish I had Toni's pool about now.I hope everyone else is well.",
            "post_id": "1333129",
            "timestamp": "1184130000",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "if our thread is discontinued again.. Please could someone email me.. I'm sure we it's going to happen soon.. ***@****.",
            "post_id": "1333143",
            "timestamp": "1184130000",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Hi All,I finally finished catching up on the posting for the past 4 months.  I'm sending prayers up for all who are pregnant and those of us continuing on.  After going through the dreadful 2ww and getting the BFN, I was so disappointed that I said I wasn't going to try again.  After receiving encouraging words from you guys, especially Audrey, DH and I decided to try again. My RE told me I had excessive clotting and this could have been the reason for the failed implantation.  She also mentioned something about my immune system and something about my DH and I system are alike and my body doesn't know where his ends and mines begin (whatever, right?)....to be honest. I really was still too upset to pay attention like I should have been. :-)  We have 14 frozen embryos ..straws of two and three.  She wants to transfer no less than 3 since I made 35 two months ago.  I'm starting new meds today and was wondering if anyone else is/was on this cocktail of Delestrogen, Lupron, AND Prednisone.",
            "post_id": "1333140",
            "timestamp": "1184130000",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Just wanted to say that I was thinking of everyone. Sweedy hope your 2ww is going well. Half way there...",
            "post_id": "1333477",
            "timestamp": "1184389200",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi Girls,Am going crazy in this 2WW.  But yet again I feel no symptoms and so am not hopeful it will happen this time round either.I think if it doesnt happen this time, i will go in for another laproscopy to get rid of my endometriosis and open up the blocked tubes at the same time.  And of course go for IVF again right after.I was so hoping it didnt come down to that.  But i realy dont think i will succeed  this time.Hope everyone else is well.",
            "post_id": "1333484",
            "timestamp": "1184475600",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "I see they made some upgrades...Happy 15 weeks Nicki! Hope all is well.Sweedy it's too soon, just try to be patient and optimistic.AF finally came (sunday) and this means mid August it is. Funny how life works. I went to BBQ on Saturday and everyone had newborns or were pregnant. I felt really depressed being there wondering was I ever going to feel like them again, then the next day AF arrives. I guess it's just a reminder not to give up.Take care.",
            "post_id": "1405370",
            "timestamp": "1184571764",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "LJ - Thanks for your kind words.  I feel some AF like symptoms so am quite worried.  But I have seen some internet sites and some women felt AF like symptoms and finally found they were pregnant.So am still not totally losing hope.  So lets see how it goes.Good to hear about your Aug plans.  I hope things go well for you.",
            "post_id": "1405793",
            "timestamp": "1184600707",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Hi all,It took me a while to catch up on everything but I think I am back!  It was so nice to catch up on everyone.Sweedy I have my fingers crossed for you!!LJ I am glad to hear AF came - I thin you are right about the reminders.  It must be fun to have a month off, even if its hot.  I'm glad to hear I'm not the only one with IVF weight!Nicki how cool twin boys - be prepared to run around!  Hope all is going well.Mstrex thanks for the donor embie info - man that is cheap.  My live cycle was 22,000 and each of my FET's was 4,000.  This donor cycle is going to be even more because I have to go to an agency for a donor.  I have to keep the donor embies in mind.  Good luck on 7/27!Mommie2b I did Lupron and Delestrogen but not Prednisone.  I am glad you are trying again.Bemyear you will find a good RE and you are right you need to be comfortable with him/her.  Don't give up.Toni and Amy glad you are doing well.  Before you know it, you will be delivering!Audrey - the life of a teacher (or one who has the summer off)!  Glad you are having fun.  From the info I got, the surrogate plus the donor seemed to be around $100,000.  I am going to talk to the agency further and will get better information which I can get you.I had my D&C on 7/13 and it went very well.  I had no bleeding until today as a matter of fact, and I was sitting at work and thought omg - had to run home and change!  Felt like I was in high school.  The only problem is my RE thinks the one fibroid that she left during my myomectomy because it was near the blood supply is growing.  I go back on Friday and we'll see.  My brother and his wife got the BFP so I am happy for them.  I just pray my turn will come!  And everyone else's on this board also.  I sure hope Nicki is right!!  Take care!!",
            "post_id": "1416621",
            "timestamp": "1184705148",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Hey Girls,Missed you all.  I was down at the NJ shore for a long weekend (took off Monday).  Yeah I know that's small potatoes for you 1-monthers and summer vacationers :)Deb- Glad that D&C went well and wasnt to painful.  Hope that fibroid issue is ok too.  I am right.  This is the time for all of us.Sweedy - which brings me to you.  Girl, you have to chill for a few more days.  AF symptoms are similar to PG symptoms.  I actually got cramps as if AF was coming.  So hang tight and don't freak.  Glad you have a plan b already but don't go throwing in any towels just yet.  When do you test? The 20th?  We're looking so forward to hearing good news from you.LJ- YEAH! AF!!! YEAH AUGUST!!! I'm so happy for you.  That's great.  Trust me, I know exactly what you felt at the BBQ.  But at least you have a darling son already.  Picture that but with no children and that was my life for so long.  Its sad. But don't worry.  Good things are going to happen for us all now.  Oh and yes, whatever curves I had have gone to a big round ball of baby bulge.  I am slowly starting to say goodbye to my decent figure and saying HELLO to flab, sag and.... well you get my drift :)Audrey- where ya been girl?  I miss you.  You must be having way to much fun on your summer vacay.  What's new with you on the TTC front. Anything?Toni & Amy - Tick Tock. You guys are getting close.  Oh man. Yikes! It freaks me out and I'm not even 1/2 way through yet.Great attitude Mommy2be.  Definately try again.  I'm living proof that sometimes you have to go a few rounds for those embies to stick!I have another appointment on Tuesday so I don't have much new news for you now.  Just trying to get through each day and hope the time goes by fast!  Chat soon.",
            "post_id": "1430818",
            "timestamp": "1184722083",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "I a very interested in this forum. You guys are definetly on my speed. Currently i am on my 2ww and i am going crazy every moment. I have cramps as if AF is coming soon, but i am trying to be positive. I just had a transfer on Friday 13th and the wait is crazy. This is my second IVF attempt. The first was a fresh cycle and  BFN. This cycle is from the 10 that were frozen. We transfered 3, and i am praying on a daily basis",
            "post_id": "1431346",
            "timestamp": "1184733840",
            "user_id": "user_220083",
            "user_link": "/personal_pages/user/220083",
            "votes": "0"
        },
        {
            "answer": "Nicky - thanks for your encouragement.  dont worry abt the curves and the figure once your boys have popped they will ensure u run around enough to be slim n trim.Girls - i hope u're having fun on your vacations.My side - ok so my terrible AF type feelings are much better today and actually i did a test.  But i must be really stupid coz i cant convince myself one way or another about it.  Its either a very very faint positive or a shadow and therefore a negative.I used clear blue.  Anyway i called the clinic and was told to hold my guns until 20th.  but i do plan to test tomorrow to prep myself for the worst if i have to.i never had this problem the first cycle - i saw it was blank straight away.  so it could be good???i dont know i am crazy",
            "post_id": "1432380",
            "timestamp": "1184776464",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Sweedy - that's good to hang onto for 24 hours.  I'd take it!  Some times you see evaporation lines if you wait to long to read the results so even though RE told you to hold your guns, I'd be testing tomorrow too with a faint positive.  Yippee if it is.  Can't wait to see your post tomorrow.2year - welcome.  We can all totally relate to your craze especially Sweedy who is in her 2ww too.  It's the absolute worst and feels like forever.  Some light cramping 5 days after is a good sign.  Could be implantation.  What day transfer did you do 3 or 5 day?  Hang in there and keep the faith.  I know how hard it is.  I had to go through the 2ww 3 times (all fresh cycles) until I finally got my BFP (then found out it was twins).  So it can / will happen!",
            "post_id": "1433386",
            "timestamp": "1184798529",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Thanks for the encouraging words. They really make a difference. All of this is new for me and i am very emotional right now. My transfer was with a 3 day. But I was very unsure about transfering 3 at once. My doc. encouraged me and my husband since the first fresh cycle was a BFN. I do have the AF feelings, but they come and go. (hopefully it was implementation). How many did you transfer to get the twins?",
            "post_id": "1434412",
            "timestamp": "1184818156",
            "user_id": "user_220083",
            "user_link": "/personal_pages/user/220083",
            "votes": "0"
        },
        {
            "answer": "Sweedy, I just caught up on your IVF history with 6 transfers. I will say a special prayer just for you tonight! I pray that God truly bless you! I am in the 2ww in will get my results on the 25th. I do feel a weird feeling like AF is coming also. Hope to God it is implantation! Stay encouraged, and the best of luck to you. You seem like a very strong woman and i wish you the best!",
            "post_id": "1434453",
            "timestamp": "1184819286",
            "user_id": "user_220083",
            "user_link": "/personal_pages/user/220083",
            "votes": "0"
        },
        {
            "answer": "Welcome! and I am wishing you good luck, sending out sticky baby thoughts. The 2 ww is really hard. I transferred 3 fresh 3-day embies and only had 1 stick.  But we are ecstatic with one. My husband wanted to try 3,I was worried and wanted to try two- it was our first try at ivf, the embryos looked really good so I was worried about trying all three...but we went with three anyways and then afterwards my dh had to say...aren't you glad we tried 3.....I am now 31 weeks preganant. I can't believe I have 8 1/2 weeks left. Toni, you're even closer!Try to stay postitive and what worked for me was being totally distracted by work and my husband. It's hard not to watch the clock tick on an hourly basis.Sweedy, I'm thinking about you too! Keep us posted.",
            "post_id": "1434510",
            "timestamp": "1184821373",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "Hi lovely ladies,So sorry I have not posted in sooo long.  We have our daughters here for the summer and I have been busy playing Mommy to two teens.  It's been a blast!!Nicki,So glad to hear that your pregnancy is going well!  Pregnant women are the most beautiful...embrace your new curves!  Have you decided on two boys names yet?  Miss ya!LJ,Great that AF finally arrived...and...mid August will be here in no time!  Enjoy your well deserved month off!!Deb,So happy that the D&C went well.  Keep us posted on the fibroid.  Congrats to your bro and sis...your turn is next girl!!Sweedy and 2year,Praying for you girls! Stay positive! When do you test?  Sending you lots of sticky vibes!Bemy,How are ya?  Gettin psyched for your next try?Amy,How's your new class?  Just think...very soon you will be holding a lil princess in your arms!mstrex (Rene?),Welcome back!  You're transferring soon girl...praying for ya!!Much love to all!!!XOXO",
            "post_id": "1434503",
            "timestamp": "1184821705",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Update from me:Tested again today (thursday morning july 19) and i felt again that it was a faint line.  But since DH is traveling until today i dont trust myself with this.  I feel my eyes may be playing tricks on me.  Anyway my official date to test is tomorrow so i will test with hubby and if he agrees with me, off we go to do our blood test.OMG i am sooo anxious.2yeartry - thanks for your very kind words.  I am praying for you too.  Dont worry, i read somewhere - when god gives us problems, he also gives us the strength to deal with them.  So relax - and hopefully we will both have good news this cycle.Nicky - your comment made me feel so positive.  I guess i feel good about having a confusion rather than no confusion with a BFN.Audrey - good to hear you're having a great time.  Whats the news on the TTC, any new plans ?Amy - its stories like yours which keeps people like me going.  Thanks for your thoughts.Ok girls - i will update again tomorrow and i pray its something good to say!!!",
            "post_id": "1435001",
            "timestamp": "1184853650",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Sweedy,When I tested with our first IVF cycle, our re said a line is a line and that is good and sure enough we got BFP> If you are really wanting to know for sure, get a digital read test. It simply telles you pregnate or not pg. Then there is no guessing with the lines. I am praying so hard for you will look for your post tomorrow but i know it will be postive I just have that feeling....next week is my turn and I will be holding my breath. Hugs to all. I will be thinking about you !!!!!!!!!!!!!!!!",
            "post_id": "1435025",
            "timestamp": "1184854241",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Quick Post for you 2year... 3 day seems to be the popular choice but if you did a frozen cycle, it must have been a 4 or 5 day no?  What day did they freeze the 10?  Anyway, I transfered 3 on my first try (day 3) = BFN,  transfered 3 on my 2nd try (day 5 blasts)= BFN, and transfered 3 on my 3rd try (day 3)= BFP with twins!!  All of them were fresh cycles.  So I am a living proof that the average amount of tries for IVF is 3 times.  That's what it took for me.",
            "post_id": "1436982",
            "timestamp": "1184891111",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Sweedy,I have a good feeling as well.  Will be thinking of and praying for you...can't wait to get your post tomorrow!  As far as TTC, we cannot do anything til 2008...honestly, I am enjoying being off the IVF rollercoaster!!Tomorrow we're off to San Francisco...Happy weekend to all!!!!",
            "post_id": "1436986",
            "timestamp": "1184891182",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "They froze the 10 on day 3",
            "post_id": "1437155",
            "timestamp": "1184894739",
            "user_id": "user_220083",
            "user_link": "/personal_pages/user/220083",
            "votes": "0"
        },
        {
            "answer": "All,Update from me:  So i tested again this morning and again i got a faint line.  So I asked the doc to do a beta test to confirm.and he did and while the result is BFP, the beta is quite low at 14.  He expected it to be at least 50 by now he said.so he told me to relax and pray to god.  if the numbers go up over the next 48 hours its good.  if not - its not meant to be.i am heart broken...",
            "post_id": "1437980",
            "timestamp": "1184921736",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Wow Sweedy!  Yeah.  Ok we're all sending sticky vibes your way and I will say a prayer for you also.  The number should double on your next beta.  I have heard that anything over 25 is a good thing so just hang in there b/c the embie may have just started a little later.  Oh god I hope this is it for ya girl!  I know the next 2 days will be tough.2year - Ok so then you technically probably had a 5 day transfer which is good too.  It just makes my suspision of your light cramping to be implantation even more so (b/c implantation occurs 7-10 after transfer).  So you hang in there too.  I have a good feeling.",
            "post_id": "1438310",
            "timestamp": "1184939945",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Ladies, just wondering, I have been on estrace(estrogen) for two weeks now with no problems. On Wed they upped it too three times a day. Today I am having some pain on left side and feel as though I cannot catch my breath at times. What is going on. When I took it with my last cycle I had no problems at all???????Any one have advise?",
            "post_id": "1438754",
            "timestamp": "1184949868",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Welcome 2yeartry. You made it through week one, just one more to go. Stay positive.Sweedy I am so happy for you. Nicki is right (as usual) - a line is a line, some test says they are fainter when the levels are lower. As for your hcg it could be a late implantation, hang in there. Levels should double over 2-3 days.Nicki - Glad things are going well. BE proud of your prenancy body, you can worry about it later.Deb- Happy about your brother & sister in law. Your time will come too. I hope everything is okay with this fibroid.Audream - Welcome back. You were missed.I have been tired and lazy this week. Feeling a little nervous about trying again. Especially since the clinic is a little dazed and confused - where have all the good nurses gone. My start date is either Aug 15 or 16, they want to postpone me because one other person is starting that day... Another downer is that my doctor won't be around to do the transfer. AS always trying to be positive about it.",
            "post_id": "1439005",
            "timestamp": "1184956602",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi all,Sweedy stay positive - you never know if it implanted late.  The next test may be fine.  I'm keeping my fingers crossed.2Yeartry I am also keeping my fingers crossed for you.  Just relax because its out of your control.Rene I had no trouble with estrace and I was doing it three times a day also.  Maybe it is something else.LJ wow August 15 or 16 - cool!  Sorry your doc won't be there.Nicki everyone is right - pg women are beautiful!!Audrey glad you are doing well and enjoying the summer off.  I love SF.Amy you are getting so close!Well more bad news for me.  I saw the RE today and she actually took pics of my fibroid.  It is definitely growing and is in a bad spot for implantation.  My choices were to do 2 months of Progestin for the hyperplasia and ignore the fibroid, do another surgery (would be my 4th), or do 3-4 months of high doses of Lupron, which may shrink the fibroid and should help the hyperplasia.  Unfortunately the side effects of the Lupron are bad - all of the menopause stuff plus severe joint aches.  I decided to try the Lupron, which means I can't do the IVF again until probably January.  I think this will be my last go - if this doesn't work I think I need to look at adoption, since I think the surrogate route is too expensive.  I'm going to try meditating and \"think\" the fibroid smaller!!Take care all and have a great weekend!",
            "post_id": "1439794",
            "timestamp": "1184975116",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Hi girl. so sorry about the news but here is a thought. where do you live. we are in Ms. I could carry the baby for you(after ours is born). It is just a thought and I pray you do not have to go that route but if you do I would gladly do it without the fee just because I know where your heart is at and we are all there together. just think about it. I called my clinic and you were right on the money. they said I am having anixety attacks. I went and got a massage and have calmed down some. Freaking out about the et on fri. Keeping you in my prayers and hopeing for the best. Hang in there girl we all love you .",
            "post_id": "1439918",
            "timestamp": "1184978006",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Mstrex - you are so beautiful to offer something like that.  I said that after I have my twins I will be donating eggs.  I'll still be 34 at that time and my eggs have been very good quality.  I hear you about all being in this together.  This infertility c-r-a-p stinks. As for you pains.  It might not have anything to do with the estrace.  I was on it all 3 times with no problem. It sounds like you might be a little hyper stimulated.  What you describe is exactly what I had this last time (first 2 times no problems with that).  Unfortunately nothing really helps with that although I have heard many girls say that drinking a lot of gatorade helped them.Deb- I'm so sorry to hear about this set back.  January will be here fast tho and you and Audrey can be 2ww buds (If Audrey decides to go the IVF route).  I am sorry about this fibroid issue.  Totally stinks.LJ-  I know what you mean about it being hard to get back into the process.  Remember with me, this last time, I went to a completely new facility (one of my RE's counterparts), and it was very hard b/c I had bonded with old office and nurses etc.  And I so hear ya with the \"where are all the good nurses\", I spoke to probably about 10 of them, and I know they are busy but my God people, have some empathy.  Its tough.  If it makes you feel any better, I don't think the ER is as important as the ET so you have to feel comfortable with who would do the ET.  If it's not your RE find out who it will be.  I had a veteran (an asian expert), who looking at, you would never think she'd be so skilled but I feel 100% that because of her, I became PG.Sweedy - did you test again today? Is the line any darker?  Or did you get a digital test?  Maybe your just going to wait til next beta but I said my prayer for ya last night.2year - when was your ET?  Are you going to test soon?Audrey - hope you're having an awesome time in San Fran with the girls!!!",
            "post_id": "1441315",
            "timestamp": "1185040624",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "I am sorry for say that i tested again today and it was a BFN.  so my HCG levels must have totally dropped.  I am almost disbelieving.  why did it have to go this way..anyway i have cried it out (want to grieve it out) and then start thinkign about next step.i think i'll go for a lap and get my endo taken out and also my tubes unblocked.  that will surely give me more of a chance to crack this...dont know - i have a thousand thoughts racing through my mind",
            "post_id": "1442570",
            "timestamp": "1185074765",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Wow been a long time for me dropping in the room, seems as if the room is hopping.  Update on me I have hypertension and swelling bad now and my urine test was not to good just trying to hang 2-3 more weeks to give the Boys a good shot. I was 33 weeks on Friday I hit the 300lb mark last week so I was pretty upset. I am nervous about these babies comming  now LOL. I have to do stress test on the babies 3 x a week now because of the problems I have run into, Baby Ryan has been a trouble maker he don't like to be watched so usually end up having a ultrasound because he will not do what they want him to.Baby Riley on the other hand is very active and always willing to move around. Selena has really been giving mommie **** these last few weeks dad is in LA and I am on my own now so she has decided to just be bad and bossy OMG I need Nanny 911 LOL. How will I ever be able to do this on my own, Getting really scared now. I need some rent a sisters LOL.LJ things happen for a reason so if they post pone you another month except it it just might be gods way of telling you one more month, I was starting transfer when I had the pulmanary embolism and kidney cancer last year I was 3 days from transfer I had to call it off so heck you never know.",
            "post_id": "1443212",
            "timestamp": "1185113283",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "Alright ladies, et if Fri. Wow. Last time I did this I was sent home without any instructions. I am finding out now that I did alot of things I should not have that may have caused our MC. So I am going to draw on your experience and suggestions. I know now that I am not suppose to pick up anything over 10 lbs????What else is there that I should not be doing and is there anything I should or should not be eating that may help with getting these little ones to stick around????Would love to hear what you all think and know...Thanks",
            "post_id": "1449027",
            "timestamp": "1185153796",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Well for starters go to bed as soon as you get home and stay there for 36 hours MIN>>>>> I have had transfers 2 times and both time I was successful then limit what you do for about 4*-5 days after that be light on your feet and drink plenty of fluids like water gatoraid or power aid Not pop to much caffine.. Try to get someone to bring you dinner in bed too that night only get up to pee I hope you have the help I did then but no one to help me now :o(...Thats what I did both transfers and I have a 3yr old and twins due soon sooner than I think  or wish I got the feeling....I am sending you baby vibes twin vibes at that Good luck...",
            "post_id": "1453510",
            "timestamp": "1185160898",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "So I did a hpt on Saturday and it was a BFN. I will go on the 25th to get my blood test. Hopefully I tested to early. Still having cramps as if AF is coming right now. I am really hoping that this works out.Sweety, I am so sorry to hear about your news. I will continue to have you in my prayersMytrex, you are the sweetest person to offer yourself and body for another, not many people would have offered such. You are a true woman that should be praised for your warm heart! I truly commend you!",
            "post_id": "1453591",
            "timestamp": "1185164023",
            "user_id": "user_220083",
            "user_link": "/personal_pages/user/220083",
            "votes": "0"
        },
        {
            "answer": "Hi ladies,Well had u/s today and it is a 12. Yeah.........last time I got pg and had mc it was a 10 so we are ahead of the game. Started on Prog shots today. Hate them but it is all worth it in the end...",
            "post_id": "1455966",
            "timestamp": "1185234790",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Hi all,I missed a lot over the weekend!  Rene your offer really touched me - I almost started to cry.  It is truly unbelievable how selfless everyone on this board is.  I appreciate it so much.   I am sure you are going to be PG this time with success and no heartache.  Make sure you are resting as much as possible.  I agree with Toni - that is the key.  I am sending baby dust your way!!Sweedy I am so sorry about the BFN.  It is such a tough process but it sounds like you are making plans for the next go round so that is good.2yeartry good luck tomorrow I hope it works for you.Toni just hang on for a few more weeks!  I am sorry you are going through this alone - I hope you can get some help after the twins are born.  I'm sure Selena will be better then.  I think it is normal to be scared facing what you are.Nicki thanks for the kind words.  Hope you and the boys are doing well.You know, I feel very humbled when I read this board and all of the adversity people have had to go through in one way or another and how dedicated everyone is to achieving the goal of getting PG and how much faith everyone has.  I am so happy I found this group!!",
            "post_id": "1458040",
            "timestamp": "1185301036",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Audrey and others, yesterday I had my first post IVF consultation regarding the next steps. As it was the first time seeing this new RE much of the consultation concerned preliminary discussions and preliminary examinations. My uterus was examined using ultra sound equipment and all appeared to be okay. The RE then suggested that I should have a hysteroscopy to see if all is really well within the uterus given the failure of the blastocysts to implant. That appointment will be towards the end of August. I was very comfortable with the RE although not as comfortable as if I were at the first clinic. It seems as though I will try IVF 2 in October or thereabouts.I have my second post IVF consultation with another RE in about two weeks. As I am quite happy with the one I met yesterday, the other one would have to be really good and persuasive for me to do IVF with his clinic.Sweedy, I am so sorry to hear about your test results. I have been there with a failed fresh cycle and a failed frozen cycle. You are doing the right thing thinking about the next steps and chatting with the ladies on the board.",
            "post_id": "1458346",
            "timestamp": "1185308853",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "",
            "post_id": "1458358",
            "timestamp": "1185309098",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hi everyone.Debbie - I am sorry to hear your news. Waiting till January will be hard but we'll get you through it.Sweedy - Did you go back for a second hcg? I know this is really hard, Audrey went through it in December and kept praying the numbers would improve.Toni - Well the hypertension and swelling was unavoidable with your kidneys. Just take it easy the best you can and lots of deep breaths. Try to enjoy time with Selena as much as possible because she is going to miss being the centre of attention.Bemyyear- Have asked why the hysterocopy? Usually they are no big deal but there are risks. Check it out. Especially after only one try, it's very common for it now to work the first time. I think they should almost to test runs first and save us some money.As for me, I am still feeling surreal about trying again next month. My start day is Aug 15th. I also have a kidney specialist appointment friday and may get some advice or input from him.",
            "post_id": "1458972",
            "timestamp": "1185322026",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hi all,Sweedy,I am so very sorry.  Like LJ said, I also had a chemical pregnancy and it was so difficult to be sooo close.  My HPT also came out positive which made it even more painful.  We are here for you!!  Making plans for your next try really does help the healing process.  Hugs!!Deb,I know that Jan. seems so far away...but it WILL come!  Plus, you and I may be 2ww buds after all...DH and I are thinking about trying IVF once more before adoption!  I will pray that your fibroid shrinks quickly.  Please keep us posted.2year,Thinking about you for tomorrow's test.  Sticky vibes, sticky vibes!!  Please let us know ASAP!!LJ,Countdown to August 15, girl.  I am sooo excited for you!  Please let us know what the Kidney specialist says.Nicki,XOXO to you and the twins!! Hope you are enjoying your summer!Rene,You have a heart of gold and I know that it's gonna happen for you this time!!  When do you test? Sending you lots of sticky angel dust!!!Bemy,Great you are on your way!!  Trust your instincts, you will know who the right ER is for you! Let us know who you decide to go with!Had a great time at our family reunion in San Fran!!  Friday we leave to the Colorado River for waterskiing!XOXO",
            "post_id": "1459195",
            "timestamp": "1185327596",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Audrey- you are quite the busy summer traveler.  All these excursions.  Fun Fun.LJ- I know what you mean. It's ok to have some mixed emotions.  you had a lot of ups and downs girl.  but you'll do great.  Only a few short weeks away!Sweedy- sooo sorry about the BFN but I am so proud of you already thinking of next steps.  See that's what we have to do girls.  He have to realize that being mother's is our destiny and that no matter what, we'll keep trying.Mstrex / Rene- we are all pulling for you. Can't wait to hear some news from you.2 year- come on now.... lets get some good news.  I've been crazed at work but i'm going to try to pop on tomorrow to see if you post.Bemy- when it feels right, its right. Granted you'll probably be going through the motions with the next clinic since it sounds your feel very comfortable at last appointment but you never know.  Glad your getting multiple opinions.Everything is good with me.  Twins are each 5 oz and all the measurments are where they should be.  Still 2 boys so I'll have my hands full!  I feel good.  I just get some pretty bad headaches.  Doc wants me to see a neurologist but I don't really want to.  I heard it's common for people to get bad headaches so I'm going to wait a week or so and see if any better.  Aside from that I feel really good.Touch base with you all soon. Hugs to all",
            "post_id": "1523211",
            "timestamp": "1185504274",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Thanks Nicki,I was starting to wonder. I thought I had lost my support team nobody was responding to my comments. I guess it was old news.Monday is the big day for me and then the dreadful 2ww. I'm not as nervous as before, everything is happening so quick this time.  Please spread some baby dust for me. I asked for 4 to be implanted but my RE refused, we are going with 3.Sweedy - Sorry to hear.... Keep trying. I was ready to give up in March but here I am.....Just as prayful as before....LJ- I found out yesterday that my doctor will not being doing my ET. I was bummed. But then again, after she did the transfer the last time, i had some slight pulling on my left side so maybe it's a good thing. Either way, I'm sure everything will be fine.",
            "post_id": "1523468",
            "timestamp": "1185510055",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "",
            "post_id": "1523514",
            "timestamp": "1185510853",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Good luck Mommie2b. I feel a little down about my doctor not being there, but as long as they know their job it should be fine. Three is good, you'll still have eleven frozen. Hope it all goes well.* Crossing my fingers for a positive tomorrow - hoping for good news for you bemy. *",
            "post_id": "1523510",
            "timestamp": "1185511309",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Correction - 2yr what is the news!!!",
            "post_id": "1523516",
            "timestamp": "1185511466",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Today is the day. Will post later to let you know how many we transfer then we start the wait. Have to wait 10 days so test on 8*6. Love to all and sticky baby dust.",
            "post_id": "1523933",
            "timestamp": "1185536488",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Kidney specialist appt got cancelled...",
            "post_id": "1524690",
            "timestamp": "1185554678",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "We transfered all four embies. 3 were day 5 and 1 day 4. All AA, AB. Now we wait.Feeling a little crampy but all is great.",
            "post_id": "1525406",
            "timestamp": "1185571897",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "LJ, your posting gave me a fright! :)) I never for one moment considered that there are risks associated with a hysteroscopy. After reading your posting, I went on google and there I saw them. Hmmmmm. Thanks so very much. The RE had suggested a hysteroscopy because she cannot understand why on the one hand I had good embryos but poor implantation. I just hope that all these exploratory procedures do not result in my being worst off.How long will you have to wait for another appointment? I hope not too long...Audrey and Nickimike, thanks too for the advice. The appointment with the next RE is the first Monday in August. I was thinking of cancelling it as he might have an expectation of my continuing but DH said no...I guess he has a point in us getting another opinion. But there is only so far we can go if we have no intentions of moving forward. I would not want to pay for exactly the same type of tests. I will see if he suggests a different route that I am more comfortable with but he would have to do really well for this to happen. I am hoping that I get better monitoring this time and that it would work out and so I am tempted to go to the RE that I had the appointment with in July. She does not live too far from me and so if there is a problem, I should have someone who is treating me quite close to hand Today I was in a store looking at flat screen tvs and I saw a couple with a baby. My first thought was, I would prefer to have the baby....Audrey, you do seem to be enjoying life. Congrats!!!! For me being happy seems like an achievement rather than something that is normal :)Mstrex, congrats! I am looking forward to reaching the waiting stage again although it surely is not the best. But it would mean that the injections would be largely over. I am wishing you all the best.Mommie2b, Monday is just around the corner...I wish you all the best too.",
            "post_id": "1527848",
            "timestamp": "1185662399",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Yeah Mstrex - here's to twin minimum sticky dust!!!!!  Sending lots your way.  So excited for you girl!!BeMy- keep your head up girl. You're doing really good hearing all the scenarios presented.  Keep us posted.Sweedy - how are you girl?  Hope you're doing ok and focusing on those next steps.LJ - your coming up soon.  Are you ok with starting around the 15th still?  I know your bummed about RE not being there to do the ET.",
            "post_id": "1528078",
            "timestamp": "1185669383",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "my BB's are soooooo sore and feeling heavy. There are blue veins showing as well. (TMI). All good signs or is it just the prog and estrace?????Am I just getting my hopes up and over analyizing things????Opinons.!!!!!!!!!",
            "post_id": "1529972",
            "timestamp": "1185751461",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Mstrex  - It could be the meds or it could be a good sign. Stay positive. My fingers are crossed.Bemyyear - I would only do the the hysteroscopy if you failed a second time. There are so many factors to IVF, it is a science - and it not exact. I had excellent quality embryos and a very healthy uterus but it took me three fresh cycles of IVF to have my son. And even this last year, second fresh cycle that led to pregnancy. If you have symptoms of something else like fibroids that consider this, but if not I wouldn't risk it.Hope everyone else is well. Happy 17 weeks to Nicki and 32? to Toni:)",
            "post_id": "1530651",
            "timestamp": "1185775894",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "girls - thanks for all your very positive words.  Last few days I was busy talking to a ton of doctors and getting opinions on whether i should get my laparoscopy done to get rid pf my endo or if i should go for another round of IVF.Finally we decided to go for another round of IVF as i was told that laparoscopy may reduce my ovarian reserve.  In fact my doc even said that if i wanted i could start fresh cycle this cycle it self on day 21.I havent yet decided whether its going to be this cycle of next.  But i have a week and a half so am taking it easy.2year - what was your result?mstrex - i am keeping my fingers crossed for youLJ - u are to start very soon isnt",
            "post_id": "1531044",
            "timestamp": "1185804664",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "LJ, I do not know what to do. I will go to the second RE and see what approach he suggests and then make a decision. Thanks for putting me on the alert though, particularly as I have a retroverted uterus and the procedure might be even more difficult.All, I was just reading Sweedy's comment about a laparoscopy reducing one's ovarian reserve. I did not know this. The first RE I went to wanted to do one, but as he was so incompetent doing another procedure, I got scared and then went to the clinic where I did the first IVF. I remember the RE at this clinic told me that it would have been pointless doing a laparoscopy because the scar tissue that would result would make natural conception more difficult if not impossible.I do hope that I would be successful with IVF2. The time is going so fast. It is almost a year since I did the first one and I am hoping that this year would be-my-year, hence my name. If this does not succeed, I will probably change my name to \"AllforJesus\" or something of the sort.Nicki, congrats on your progression. I wish that I could have twins, but I prefer to have twin girls. Of course if I were to have boys like you, I would also be happy. Right now, one child healthy child would be fantastic. Having two stops me from having to have another fresh or frozen cycle.All, I would like to change jobs but I do not want to change and then get pregnant. If I had changed since last year, it would have been okay for me to get pregnant now without the employer disapproving. But I did not know that IVF 1 would have been such a flop.",
            "post_id": "1531754",
            "timestamp": "1185821414",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hi all,Rene - glad everything went so well for you.  I think next time I am going to do 4 also.  Just relax and don't over-analyze.  It is going to work for you I have a good feeling.  You are in the same boat as my brother and his wife - it worked for them the first time but they miscarried and now it worked again the second time.  And it will for you too and you will end up with a healthy babe!Mommie2b - hope everything went ok today - I am blowing baby dust your way.Sweedy - sounds like you got lots of advice and I am glad you are trying again.Bemyyear - I agree with LJ.Nicki - the weeks are flying by!Audrey - sounds like you are having a great summer - one trip after another.  I look forward to being 2ww buddies!LJ - you must be getting excited - only a few weeks!Toni - any news?I start the Lupron on Thursday - hopefully I won't get the horrible side effects.  Keeping my fingers crossed.  Take care!!",
            "post_id": "1532219",
            "timestamp": "1185831118",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "I had a hysteroscopy and I have a retroverted uterus. It took only a couple minutes and was not at all painful. My doctors had me do the hypersalpingogram to check the tubes and the hysteroscopyto make sure that the uterus looked fine and had no problems,  before they even tried any ivf .....prior to spending the money on a fresh cycle. Fotunately, as a result we just learned I had a \"perfect looking\" uterus..he showed the pictures to my husband....and then we proceeded to have a a successful ivf cycle. I haven't met anyone who's had any side effects in the slightest. Hopefully, you'll trust this doctor and get some good advice. It's all confusing!!Only one more week of work for me and then I'll be free like Audrey! Although I don't have near as fun plans...33 weeks done for me. I hope to get things ready for the baby...and relaxing as I grow bigger.Keeping my fingers crossed for all of you girls!!! I just had anohter friend get a BFP after 5 IUI attempts failed...and her first ivf cycle got canceled a week before retrieval becuase of a hormonal problem so they did a 6th IUI instead and now she's pregnant....",
            "post_id": "1532479",
            "timestamp": "1185838459",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "Amen to that LJ.... see Bemyyear... 3 fresh cycles for LJ and 3 fresh for me before it worked.  LJ has a beautiful boy and I am PG.  Remember what I said a while back.  I saw that statistically it takes an AVERAGE of 3 tries at IVF before a successful PG.  So we all have to hang in b/c for some it works in 1 or 2 times but for many others it takes 4,5 or 6 times.Amy - congrats on the 33 weeks.  and and extra congrats on your friend.  I love hearing wonderful news like that.  Just goes to show with a little faith and luck anything can happen.  Did you have your shower yet? I'm sure you did.  How is the soon to come princess room?  I'm sure you're busy preparing at this point.  Only a few weeks to go!!Mstrex - I like the sound of those symptoms.  But like LJ said.... it can be the meds BUT it can mean great news too so I'm praying for ya.Deb- Good luck with the Lupron.  I hope so much that it does the trick and it gets you back on track.  Hope those nasty side effects stay far away.Sweedy - wow that's fast.  Take your time deciding.  Very glad to hear you can jump back in when you are ready.Hugs to all.",
            "post_id": "1532770",
            "timestamp": "1185845032",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "nicki - i felt really good reading your comments about 3 tries.  I have just done 1 fresh and 1 frozen cycle.  So may be i will get there is i try another time.  I was thinking yesterday about how happy you must feel now.  Like for me this seems like my ONLY problem in life and i feel like if i overcome this i will be released of this and free to be truely happy.bemyyear - keep the faith, we WILL get there.  our job is to keep trying - that is the most we can do - lets do that and leave the outcomes to the one aboveDebbie - thanks for your words and best of luck to you tooamy - good to hear that things are progressing well.",
            "post_id": "1555228",
            "timestamp": "1185894006",
            "user_id": "user_201800",
            "user_link": "/personal_pages/user/201800",
            "votes": "0"
        },
        {
            "answer": "Amy, Nickimike, Old Debbi and Sweedy, thank you for your very helpful and encouraging comments. It is good to have you and the others to chat with, particularly as I have not been discussing IVF with anyone else, apart from DH and the RE.  I will let you posted on whether or not I have the hysteroscopy.Amy, congrats on reaching 33 weeks. I hope that we will be all there some day! I am so eager to buy a cradle and clothes etc., but I must wait.Sweedy, you said that IVF seems like your only problem in life. I must hand into you. I have a couple problems worse than IVF. My greatest problem is my mother's failing health. Sometimes I feel that if she dies, I would too and it would be easier as I do not have kids. I trust that God would give me the strength when the time comes. If I have a kid, it would be easier to justify living given that there would be someone who really needs me and who I would need to live for. Anyway, let me stop being so morbid....",
            "post_id": "1555708",
            "timestamp": "1185903744",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Hi all,Everything went well yesterday.  As I mentioned, my regular RE was on vacation, this RE was nice but a little cocky, when I asked why she wasn't using the u/s to transfer the embryos so told me she has been doing it over 25 years and she 'just knows\".  She also made the decision for me not to transfer 4 but 3..... Now for the dreadful 2ww. I have decided not to do the hpts this go around and to just wait. I know about day 8 or 9 I will change my mind.  I have my fingers, legs, eyes, and everything else crossed!Sweedy -- Sorry to hear about your mother's health. I will keep you in my prayers.Amy - Congrats.. Hopefully I will be receiving congrats soon... ;-)Mstrex - Keep the faith.. Stay positive.. My BB were sore before the transfer so it can definitely be the meds.  Just remember to take it easy...As for me, I'm going back to bed before DH walks in and catches me on the computer. Bedrest is so hard!! I rented 6 movies. I think I'm going to need 6 more.... :-))    Baby dust baby dust baby dust....",
            "post_id": "1555780",
            "timestamp": "1185905398",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "This bed rest suckssssssssssssss. I am so tired of being in one room. My husband freeks out if I get up to get a glass of water. And If I have to pee one more time I will scream. It seems I am running to br every 10 min. Thank goodness Re said I could get out of bed tomorrow but could only do light things. I am medicial leave for two months and that will drive me crazy as well. Ugggh. I bought hpt (6 of them) before the transfer as I know I will test probably Sat or Sun as Beta is on Monday. I am feeling some sharp cramping on both sides and hope that is the little ones digging in for a long nap. SSBD to you and hope we will be due at same time.!!!!!!!",
            "post_id": "1627365",
            "timestamp": "1185919168",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Okay ladies, did hpt(day 5pt) and got neg. this happened last time too I am sure it is toooo soon. Last time I got pos on day 8 so will test again then.",
            "post_id": "1639022",
            "timestamp": "1186007163",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "I can't believe it.  I posted a bunch of personals and it doesn't show up.  UGH.  Let me see if I can recall everything.But first Mstrex you crazy girl you.  Yes, 5 dpt is way to early so wait a bit.  I know it's hard.  What i had said in my post that never showed up is that I still feel the 2ww is the hardest part.  You get used to the u/s, the blood draws, the injections, heck even the ET & ER but that bed rest is the worst in my opinion b/c no matter how many movies you rent or how you preoccupy yourself, you are still alone with your thoughts and it can drive you nuts.Bymy- I'm so sorry to hear about your mom's health.  But remember, life is for the living and your mom would never want you to feel as though you wouldn't want to be here if she weren't.  Plus, God has great things in store for you.  Believe in that no matter what.Sweedy- I so understand your last comment to me.  And yes, for a long time it seemed like not having a baby was the only obstacle to happiness in my life.  I had such tremendous highs and lows its crazy.  Now all I want if for you girls to join me in success b/c I'm so fond of each of you.  And take your time deciding to jump right back.  Take a breather.  I think that's what helped me the last time.  I had 3 months off.  But if you jump right back on... Great.  No matter what.LJ- so are we starting in a couple days or what?  Come on girl.",
            "post_id": "1640823",
            "timestamp": "1186070575",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi all,Rene - that is too early to test!  With donor eggs (or embies), you can test in a week, but only a blood test.  My RE said the over the counter tests won't show up that early.  Be patient - testing now will make you crazy!Bemy - so sorry about your mom - both my parents passed away in the last year and a half and it is really tough, but life is still worth living and they would want me to be happy.  Your mom wants the same thing for you.Mommie2b - how are you doing?  Resting I hope.Amy - wow you are really getting close.  It's hard to believe so much time has passed.  Congrats to your friend!Nicki - I agree with you about the multiple tries.  I did one fresh and 2 frozen and nothing worked.  I figure the fourth time will be a charm.  My RE says sometimes its your time and sometimes its not.  We just can't control the implantation process yet.  Glad you are doing well!!I had my first Lupron shot today so I am waiting for the hot flashes!  My brother and his wife (also donor IVF) are at 6 weeks and heard the heart beat this week so they are ecstatic.  I am keeping my fingers crossed - at least I'll have a nephew!Take care!!",
            "post_id": "1641665",
            "timestamp": "1186091010",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Same here. I have been experiencing some cramping as well. My BBs feel like I have two sand bags on my chest. WOW!Nicki - I'm glad the two days of bedrest is over. You are right. I was thinking about what I did wrong the last time that I could prevent this go around.OldDebbi - Don't worry. Hopefully, you don't experience any hot flashes. I also suffered from fibroids and had surgery twice. I decided no more surgery which is the reason I became a vegetarian. My last surgery was two years ago and so far so good. I could just remember the gynecologist saying to me... a man of course.... hurry up and have some babies. Was this the best and only advice he could give to me.  I guess I don't have to tell you I haven't been back to him.",
            "post_id": "1677304",
            "timestamp": "1186197359",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Hi all. I went out of town for a couple days to get some real R&R before I have to go back to work on Tuesday. I started my first set of meds yesterday and have an u/s booked for the 13th. If all is well I will start the 15th or 16th.mommie2b - Your symptoms sound really promising. Fingers are crossed.mstrex - I hope the test goes well.Nicki - How are you feeling? I don't want to hear that you feel like a house, at least not yet.Deb - How are you doing? Any hot flashes yet? The meds I started give symptoms of menopause -fun... I am so happy for your brother & his wife.Sweedy - I don't know how a laprascopy and ovarian reserve could be connected. I had a laprascopy a few months before my very first IVF cycle, they make a small incision at your belly button and insert a small camera for a look around. Good luck on your next IVF.",
            "post_id": "1687787",
            "timestamp": "1186338925",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Hello I had the Boys on July 31st they weighed in at 5lbs 15 ozs was twin A and his name is Riley and the Twin B weighed in at 4lbs 3 ozs His name is Ryan. Ryan should be home tomorrow while his big brother will be a while longer as he is on a resparator for a short time his lungs were not as developed as his brothers.. I am exausted and still quit sick they were born at 34 weeks.. I just got home today... Will update later",
            "post_id": "1688111",
            "timestamp": "1186350944",
            "user_id": "user_177182",
            "user_link": "/personal_pages/user/177182",
            "votes": "0"
        },
        {
            "answer": "Well Congrats and Welcome to Riley and Ryan!!LJ- I sure hope so.  I woke up  around 5am with severe hunger pains and I had a late dinner at 9pm. Hopefully that a good sign.  It's day 7 and I haven't purchased a hpt yet. I'm so proud of myself.   :-)Happy Monday to Everyone....Have a great day!",
            "post_id": "1689201",
            "timestamp": "1186401686",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Beta came back BFN. We will try again late Sept. Good luck to all the others testing today.",
            "post_id": "1689719",
            "timestamp": "1186419196",
            "user_id": "user_174119",
            "user_link": "/personal_pages/user/174119",
            "votes": "0"
        },
        {
            "answer": "Hi girls!!!  Wow, so much has happened since I last posted...First of all, welcome Riley and Ryan...first babies born on our 2ww forum!!!  Milestone #1!LJ,Glad you got some last minute R&R before starting your cycle...you'll be nice and rested for your wee ones!  Sending lots of positive energy your way for the 13th!!Nicki,Hope all is well with you three!!!  When will you have an us to find out the definite sex of the twins?Deb,I'm so sorry you have to go on Lupron...but, I hope it does the trick in getting rid of the fibroid!  Hope the side effects are not too bad.  Please keep us posted.  Would LOVE to be 2ww buddies with you in January!!Amy,When are you due?  Soo excited for you and DH!  Got the nursery all ready?mom2b,Your symptoms sound good and I pray that they are preggo symptoms.  When is your bt?  Thinking and praying for you...sticky vibe, sticky vibe!!Rene,I'm so very sorry about your BFN...but so glad to hear that you have already started to think about Plan B in September.  How many frosties do you have?  HugsBemy,Any news about the hysteroscopy?  So sorry about your mom...it sounds like you two are very close.  I will keep her in my prayers.Sweedy,Do you have any dates set yet for your next cycle?Well, the River was awesome and we have the girls for about a week more.  I have 3 1/2 weeks of vacation left...it's going by sooo fast!!  It's gonna be so hard to go back to work!!Ladies,  was wondering if we could all post our birthdates so that we can celebrate one another on our special days!Audrey-   September 10",
            "post_id": "1690084",
            "timestamp": "1186426631",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Toni - Congratulations! I am so happy that everything went well and that you made it to 34 weeks. How are you feeling? Welcome Riley and Ryan. Hugs to you all.mstrex - I am sorry about the BFN. There is nothing comforting to say but to stay positive and look ahead to trying again.Audrey - Mine is April 13. I happy to hear from you and that you are having a great summer break.",
            "post_id": "1690198",
            "timestamp": "1186428877",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Toni - Congrats!!!  That is wonderful news.  Take care of yourself and try to get some help.Rene - so sorry - that is tough.  I am glad you are trying again in September.Mommie2b - when are you testing?  I also had two myomectomies for fibroids.  Glad my doctor never said anything like that altho I wish I had started much earlier in my life!LJ - glad you got some rest - now you will be ready for the whole process next week.  My fingers are crossed already.Audrey - glad you had a great time.  Boy I would love to have the summer off!!No hot flashes so far but I do have a few joint aches.  Nothing bad at this point so hopefully I will be lucky!  Take care all!",
            "post_id": "1690277",
            "timestamp": "1186429478",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Mstrex - Sorry to hear about your results .. stay positive..September is around the corner.Deb/Audrey - August 13th is the big day for me. I just broke down and asked DH to purchase a hpt.. he said NO! LOL!Audrey - have some fun for me!  DH is also a teacher, he returns back to work tomorrow. I'm going to miss the clean house and dinner when I get home.  Oh my BD is May 11LJ - baby dust to you.",
            "post_id": "1690807",
            "timestamp": "1186440878",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Hey All.  Man I missed a lot.Yeah Toni!!! Congrats on your delivery.  Hope you feel better real soon and your little guy does ok and comes home real soon.  I'm sure you have your hands full.  I'll be joining you in 5 months!Rene - girl I am so especially sorry for you.  I was really thinking this was it. Man this is so disappointing to hear.  I'm sure your are upset but I hope you are thinking next steps. It's so important to keep your faith. hugs to you : (Mom2be - 8/13 - couple of days away now!! Sticky baby dust to you!LJ - I feel great really.  Sunday will start my 5th month.  Do you believe it?  I'm 1/2 way there!!  And YEAH for you.  I didn't know if you were definitely starting and so happy to hear that you did!!! I'm super excited for you.  XOAudrey - that's cool about starting a birthday chain.  Although you guys will ALL have to celebrate with my first.  My b-day is Thursday!!! Yep.  The big 34 or as I like to say... I'm 20  14.  Get it... twenty fourteen ..  hee hee.Deb - how's the Lupron going?I'm feeling well.  Waiting for my AFP test to come back.  Hopefully it will be good news.  I don't really have any complaints and have my next appointment next week when I am 5 months!  I can't believe how fast it's going now.  My oh my.B-day list (copy and paste into your message when you add yours)Audrey - Sept. 10LJ - April 13Nicki - Aug. 9",
            "post_id": "1692210",
            "timestamp": "1186495369",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,Took me a while to catch up since June.  Time surely has flown by. I took some time off to clear my head and during that time my Grammy passed on unexpectedly.  This year has truly been an emotional roller coaster, but I'm back and encouraged.Toni- Congratulations on the birth of the boys...So exciting!!!Nicki- Wow, you've progressed so fast.  Sooo happy for you!!!!Deb- We can get you through until January.  This circle of women is a tremendous support, as you know.Audream- Glad to see that you have truly enloyed your summer.  My DH started his school year last week.LJ- So glad that things worked out and you're starting the next cycle.Audrey - Sept. 10LJ - April 13Nicki - Aug. 9Nikki- Oct. 1",
            "post_id": "1692661",
            "timestamp": "1186504798",
            "user_id": "user_196647",
            "user_link": "/personal_pages/user/196647",
            "votes": "0"
        },
        {
            "answer": "Audrey - Sept. 10LJ - April 13Nicki - Aug. 9Nikki- Oct. 1Amy- July 30thJust had my birthday-so it willbe quite awhile before we get to mine again. Looks like NIcki's is super close! Happy birthday.Congrats to Toni! That is so exciting. ANy news on when Riley gets to come home? I am wishing you all the best. Bringing home two is going to keep you very busy. What a double blessing!!Nikki- I am sorry to hear about your Gram. It's so hard to when someone goes unexpectedly. My Grandpa was the same way. I still think about him everyday.Audream- I am so gla dyou are enjoyign your summer. SOunds like you have made the most of everyday! Enjoy these last few weeks. My class has just gon off track. I am in the midst of adjusting to vactation life. I've been doing a lot of work so far though getting ready for the baby. BUt that is fun work.Tomorrow I am going back to school to get ready for my maternity sub. I am having mixed feelings about being gone. I know I will feel good when the baby is here...I just think having worked for so many years, it's hard to imagine being gone. I am sure if I were one of those super young moms it wouldn't be that big a deal. I get to create a whole new identity...mom. I guess I never believed it would happen...I'm due September 17th-21st...somewhere in there. Based on my IVF dates it should be the 17th...but my doc came up with the 21st off of one of my early ultrasounds..so who knows. I can't wait. Less than 6 weeks to go if she's full term...such a miracle!!!LJ- how are you doing on those drugs?  am looking forward to hearing about your ultrasound. It's just around the corner. Is this the ultrasound to see how many eggs? or just checking the condition of the lining or ovaries?...sooooo many ultrasounds in this whole process.",
            "post_id": "1698142",
            "timestamp": "1186628377",
            "user_id": "user_177611",
            "user_link": "/personal_pages/user/177611",
            "votes": "0"
        },
        {
            "answer": "HAPPY BIRTHDAY NICKI !!!!!!",
            "post_id": "1698356",
            "timestamp": "1186637091",
            "user_id": "user_173509",
            "user_link": "/personal_pages/user/173509",
            "votes": "0"
        },
        {
            "answer": "Amy - that's so cool.  6 weeks to go.  My oh my did the time fly by.  And I can totally relate with you about the work / super mom thing.  I am so torn on what to do when the time comes.  I am a principle of my advertising agency but I fear I will not be able to juggle both.  I would like to teach.  Maybe I can be a substitute??? But no matter what, the time you will have with your little princess will take away any doubt you had.  Enjoy it.  And it's not like you can't change your mind a year or two later and give it an go working again.LJ- hope your doing ok with the meds.  What are you on this cycle?  When is your ER going to be? Do you know about when?  I'm so excited for you.",
            "post_id": "1698810",
            "timestamp": "1186667630",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Thanks LJ!",
            "post_id": "1698803",
            "timestamp": "1186668117",
            "user_id": "user_174267",
            "user_link": "/personal_pages/user/174267",
            "votes": "0"
        },
        {
            "answer": "Happy Birthday to you...cha cha cha...Happy Birthday to you...cha cha cha...Happy Birthday Dear Nicki...Happy Birthday to you!!!!!!!!!!!!!!!!!!!!!And many more girl!  Hope you have something fun planned...whatever it is...enjoy...you deserve it!!!AND I know that you've already received the best birthday gift ever!!   XOXONikki,Sooo good to hear from you again...missed you girl!!  Is your DH on the year round schedule?  Have you decided what your next plan of attack will be?LJ,How are you feeling? Hope your cycle is going well.Amy,Yeah, school's out!!  Cannot wait til little Sierra comes...you and DH must be so excited!!  How are you decorating her room?  Is there a certain theme?Mom2be,How are you holding out girl?  Sending you lots of prayers and sticky baby dust!!!  Countdown to the 13th!!  Are you going to POAS?Deb,How are you doing with the Lupron?  So far so good I hope.  How is your furbaby doing?Bemy/Sweedy,How r u 2 doing?  Any possible dates yet?DH and I went to go see ER yesterday...we still had not done a follow up visit for the last cycle.  He said he really recommended us trying at least 2 more fresh cycles before adoption...so we'll see what happens in Jan. I know that DH REALLY wants to try again.  A friend of his was proudly showing everyone us pictures of their new baby, and DH got so emotional and really inspired to try again.XOXO",
            "post_id": "1699672",
            "timestamp": "1186682963",
            "user_id": "user_173738",
            "user_link": "/personal_pages/user/173738",
            "votes": "0"
        },
        {
            "answer": "Happy happy birthday to you Nicki and many many more.  This year will be the best for you of any!!",
            "post_id": "1700327",
            "timestamp": "1186697147",
            "user_id": "user_181754",
            "user_link": "/personal_pages/user/181754",
            "votes": "0"
        },
        {
            "answer": "Happy Birthday Nicki...Hope you enjoyed your day..Audrey - I'm doing pretty well.. NO HPTS!!  I'm going to wait until the 13th.",
            "post_id": "1700622",
            "timestamp": "1186702515",
            "user_id": "user_189186",
            "user_link": "/personal_pages/user/189186",
            "votes": "0"
        },
        {
            "answer": "Hello everyone, the board has been rather busy these last few days..which of course is a good thing. Mstrex, sorry to hear about the BFN. A BFN is truly a BFD- a big fat disappointment. Keep thinking of the next steps. I find that when I think of the next steps, I am happier.Mommy2selena, congrats!!! Well done. I am happy to hear about the birth of Riley and Ryan. For you at least one mission has been accomplished.OldDebbi, Nickimike, thanks for the kind regards regarding my mother.Audream, yippee!!! I am so glad to hear that you are trying again. We have had a similar history regarding BFNs.Audream, LJ, Amy and everyone, I had my consultation with the second RE who works in a different country. Her view was that a hysteroscopy is unnecessary and carries risks. Of course I remembered LJ. She said that she would not interfere with the uterus particularly as the ET would be done weeks after. She noted though that in some countries REs insist on patients having hysteroscopies. Here I am hoping that things go well for me, as they did for Amy. LJ's words are at the back of my mind.  I have decided to go with the RE, who unfortunately has advised a hysteroscopy...only because she lives in the same country as me and I am hoping that my stress levels would be less. Provided that the hysteroscopy does not show up anything untoward or that I do not suffer complications as a result of stupidly doing the hysteroscopy, I will do IVF 2 in September/October 2007 and if it fails, I then plan to have IVF 3 with the second RE who resides in a different country. I guess this would have to be in December/Jan 2008 - a whole year after IVF1.Sweedy, do not give up the fight!!! Hang in there with us. Keep thinking of the next steps. One of these days, God willing, your dream will be fulfilled. Have you considered changing clinics or getting a second opinion as to the likely reason for the failed cycle and FET?",
            "post_id": "1704156",
            "timestamp": "1186816635",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        },
        {
            "answer": "Oth2007, I just realised that we have not heard from you in a while. Are you having one or two or is it too early to tell?",
            "post_id": "1704178",
            "timestamp": "1186817337",
            "user_id": "user_178513",
            "user_link": "/personal_pages/user/178513",
            "votes": "0"
        }
    ],
    "post_id": "1304748",
    "question": "Girls we have to, yet again start a new thread.",
    "timestamp": "1179291600",
    "title": "2 Week Wait Pal - Audrey, LJ, Deb, Nikki, Toni, Amy NEW POST",
    "user_id": "user_174267",
    "user_link": "/personal_pages/user/174267"
}