{
    "answers": [
        {
            "answer": "I have not much new to report. I am still having lots of BH and or contractions. I have a doctors appt tomorrow for an U/S and an internal exam to figure out if i am dilated more and Logan's position. According to my family, my belly is dropping and i am noticing the pressure in my body getting lower and lower. Add to that the dizzy spells are back. So now i no longer drive anywhere. Everyone thinks Logan will make his appearance at the beginning of Feb.On this past Sunday i had my baby shower. It was great we got so much and only have a little left to get. Its amazing and overwhelming to think that he is coming anytime now and that we are preparing his room. His room is about 75% done we are just finishing some final decorating things. His back is just about done being packed for the hospital and mine will be done tonight.My last day of work is 1/30. With all the pain and the dizziness the DH and I decided that the 2 extra weeks would be good. Plus we may go early anyways. So for now i get driven in and out of work because of being dizzy and don't want to cause any accidents.Thats all for now. Updates will be up tomorrow after the doctors appt and U/S.Good luck all,Jonelle",
            "post_id": "3896094",
            "timestamp": "1232468564",
            "user_id": "user_354219",
            "user_link": "/personal_pages/user/354219",
            "votes": "0"
        },
        {
            "answer": "I'm just over the 37 week mark. Feeling pretty miserable most days, but some days are good. I think taking care of a 21 month old is to blame on that! LOLI have an appt today to see if I've dilated at all...which I'm keeping my fingers crossed!Claire is moving around a LOT, and will suddenly press on my bladder to the point I have to freeze for fear I'll pee myself. Everyone says it looks like I've swallowed a basketball because she is right out there in front (I was more \"rounded\" when I carried Levi). Even the doctor told me last week that I am ALL baby this time around. So I guess that's a good thing! Hopefully I won't have to work as hard at losing the weight this time.Other than that, it's the usual...peeing every 1 to 1 1/2 hours each night, hips hurting every hour, can barely roll over, can barely get out of bed, and having a really hard time shaving my legs! LOL And acid reflux rears its ugly head constantly, which makes Tums Smoothies my best friend again.I think that's about it on my end. I'm just so glad we're near the end! Good luck to everyone!",
            "post_id": "3896114",
            "timestamp": "1232468833",
            "user_id": "user_151668",
            "user_link": "/personal_pages/user/151668",
            "votes": "0"
        },
        {
            "answer": "I am now 36 weeks.  I go back to the doctor's on Thursday where I'll get my Strep B results and hopefully another internal exam (he said he'll do one depending on how I feel, but I am going to request that he do one).  I have been feeling really crappy the past week.  I am nauseaus all the time.  My acid reflux is getting worse (I've had it bad through the whole pregnancy), so I resort to taking a Zantac every so often because if I don't then I can't eat - which makes me feels worse.  I am sooooo uncomfortable all the time and can't sleep well at all.  My back pain has increased and I get these pains downstairs as if I just did a workout down there! LOL!  I also feel what I think is the baby's head pushing down on my pubic bone, so hopefully with all these symptoms I am somewhat dialated or on my way!!The nursery is pretty much done, hubby put up the plantation shutters and framed the window yesterday.  So now all we have to do is put some things on the wall like the letter of her name and some shelves.  I am gettting more and more anxious to meet this little one and become a mommy :)  I think that all the sleepless nights I get are just preparing me.  It's funny because my dog has been doing things to prepare us also, like roll around in his own poop (NEVER been done before until recently) and hacking all night long keeping us up because we are worried about him.Well hopefully I'll have some good news on Thursday after my appointment, because my bags are packed and ready to go!",
            "post_id": "3896200",
            "timestamp": "1232470273",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "I'm just 36 weeks and I have an appointment on Thursday for my Group B test and an internal, so I won't know much until then.  I'm going to be talking to my doctor, again, about induction.  I talked to him about it when I was about 12 weeks along and just wanted to make him know that I worry about being home with my other three kids and the weather is horrible...so hopefully I'll find out more with my internal exam and see if my cervix is favorable.  If not this week, then I'll know more next week.It's crazy to know that we'reall so close and over the safe point now to have these babies :)BH and some back/hip pain have been my biggest problem still...I'm really outgrowning my sports bras.  LOL  I went out and bought a couple nursing bras from Target...SO COMFY!!  My bags have been packed for a couple weeks now.  I still find myself putting clothes in there for the baby.  LOL  I'll end up taking three or four bags by the time I really have to go.  :)  Oh well....Being dizzy, sleepy or having this huge burst of energy at times just are signs that I'm almost done :)  This poor house can't get clean enough for me and I freak out.  Hubby and the kids don't help, so I'm finding myself stressed abou the place, the van not being clean...little things I really shouldn't be freaking over about.This baby is all up in my ribs when it stretchs out, but mostly just hangs out in my pubic area.  I can feel the head turning under my pubic bone and a arm/hand in my hips...I can't wait to see what she/he looks like and just hold it in my arms.  :)  I still haven't gone out for blues or pinks because I've still haven't gotten the *100% sure* thing on the gender yet.....so those are things we have to do when it's once born :)  Hopefully I have family to help out~",
            "post_id": "3896347",
            "timestamp": "1232473164",
            "user_id": "user_514428",
            "user_link": "/personal_pages/user/514428",
            "votes": "0"
        },
        {
            "answer": "I'm so excited for everyone!I had a routine appointment yesterday, where I met with an OB instead of one of my midwives, and I didn't care for him at all. When I told him I wanted to try going natural, he burst out laughing, and sat there giggling for like 5 minutes about how he heard that all the time, and then spent another 10 minutes trying to talk me out of it. Not a very favorable impression, but I really love the midwives there.I'm still only having occasional braxton hicks, which is a little discouraging. Terrible pubic pain at night.....like Hope said, rolling over in bed, getting out of bed, and shaving are all pretty excruciating right now! But I think the worst thing is the Restless Leg Syndrome I started experiencing last week.....it's AWFUL, is anyone else struggling with this?? I've had a terrible time getting to sleep at night because of it....I just found out my sister had problems with it too, and I know it's supposed to run in families. Anybody have any suggestions on coping with it? I read that it's sometimes linked to low iron, but I'm taking in tons of iron, and my levels were fine two weeks ago. Do you think I should ask to be tested again?Anyway, I can't wait till things get going...I'm due in two weeks, but if she is two weeks late, I am looking at the possibility of being pregnant for almost another month, which is an extremely discouraging thought right now. I'm so jealous of all of you who have stuff happening! I know my time will come sooner or later.",
            "post_id": "3896625",
            "timestamp": "1232477536",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Hi there ladies...another week down already??  WoW!! hard to beleive...I had a gret appointment today, the Nurse was awesome!!  We went through my birth plan line by line, and made a few changes on her suggestions,  but she didn't change much....i also told her about the gush of fluids I had felt about 40 hours ago now, so she checked me again, did all the tests, and then did an ATF scan to check the fluid level...she said that it was low-normal, but not too be concerned...I guess they want more then 80 cent, and I had 78.9.  I am dialated barely though, a finger tip,  and 25% effacced!!  So almost there...Oh I got my Strep B results back..Neg...and baby's heartbeat is great 142!!  Ready to go.  I will be 39 weeks on Friday...definately hoping for a delivery by the next weekly check!!  We shall see....I have all the same uncomfortableness with my body as well...lots of pubic pressure, really bad heartburn to the point of vomiting, pretty good appetite, hard to sleep at night (hips hurt, constant peeing, hard to roll over..etc), tired some days, lots of enegy others...oh, and lots of tailbone pressure!!!",
            "post_id": "3896780",
            "timestamp": "1232480210",
            "user_id": "user_643558",
            "user_link": "/personal_pages/user/643558",
            "votes": "0"
        },
        {
            "answer": "Me....same ole same ole......playing the games of pregnancy at this point. Is she coming....is she not?? I have 3 appts on Thursday to hopefully give me some answers and find out where I am . They think I am retaining water and showing signs of preeclampsia and things of that nature..and they did mention induction in the office yesterday....but we will see. Only time will tell. I am very uncomfortable....and at this point..i just want her to come into our lives....Hopefully I will know more on Thursday.I did get my Group B results and they came back negative...which is good!Hope everyone is doing well!Stephanie",
            "post_id": "3896800",
            "timestamp": "1232480670",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "wow all you ladies are moving right along.i am 35 weeks and barely anything.  I am not even sure if i had had one braxton hicks yet.  I have been having awful acid reflux every night to the point where i am vomitting profusely.  i also ended up with the pregnancy carpel tunnel which is very very painful and prohibits most of my hand movements.  But other than that i am good, not many pains besides the normal aches and pains when i over do things and being more tired.  Oh Jaedyn also is very active.  he kicked me a couple of times today so hard i nearly doubled over.i get my group b strep test next week.",
            "post_id": "3897579",
            "timestamp": "1232493693",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "I haven't had any RLS this pregnancy but I do know a lot of women who experienced it during their pregnancy. I've just heard the worst thing to do is lay down and go to sleep...you should get up and walk around and try to tire your legs out. Or try massaging them or take a nice warm bath to relax them.Sounds like were all doing some kind of progressing!",
            "post_id": "3897698",
            "timestamp": "1232495801",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "well hey all not much has changed  same old  same old i  have been out  of work for a week and i  dont think  i am  going back to  work unitl after she is  born i  can  barely  walk  around to  get my  other  kids what they  needed  never mind run a  lab  on my  feet all  night long.  Same pain in the lower back and  now  tons of  pressure  in my pelvic area along with  fun stabbing  pain  in the  cervical area makes for  such a  fun time. Getting tons BH   nothing that is consistent to call the  dr. so  iam playing the waiting game  i  go in  fro appointment tomorrow and i  hopefully w ill get some  answers on  her side cause they  are believing her to be bigger than what she should be so  hope   all are feeling  good   have a good eveningjesselynn",
            "post_id": "3897975",
            "timestamp": "1232500603",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "Went to the dr today and was told that I am only dilated the width of a fingertip. She said that I'm starting to \"soften\", too. I was SO hoping for better news!She also told me that the baby would more than likely be around 8 pounds give or take. I hope she's not too big by the time I give birth. If my epidural wears off like last time (or I don't have time to get one) I don't know how I'll get through the pain!BH have been pretty regular and moderately strong. Most of the time it is enough to make me have to stop in my tracks. Hopefully, this is a sign that the end is growing near. I'm so miserable, and I really can't wait to start the next phase...getting used to a new baby AND taking care of my toddler! Not to mention, the sooner I have Claire, the sooner my body can heal.",
            "post_id": "3898516",
            "timestamp": "1232509095",
            "user_id": "user_151668",
            "user_link": "/personal_pages/user/151668",
            "votes": "0"
        },
        {
            "answer": "Hi,37 3/4 weeks and baby is still staying put after all the fuss of the last 2 weeks.Walking is very painful.  Waddle is a graceful way of describing my walk!  Pubic pain is excrutiating and moving in bed interesting in a painful way....  Feel like I am walking with a melon in my vagina.... am peeing frequently but it's always only a dribble.  Reckon baby's head is pressing on things...Baby dropped about 4 weeks ago and I've lost my plug.  So reckon it shouldn't be long...  but they stopped the contractions well and good. Hardly even having braxton hicks at the moments.  But feeling lots of pressure down there and shooting pains in my lower pelvis.  But nothing like the contractions that they stopped before...Have lost weight (about 3-5 lbs), and the swelling is back and increasing (after reducing when on complete bed rest).  That means I have gained no weight this 3rd trimester.  But am monitoring BP and it's still normal so I'm not too worried.  No appetite.  Having trouble controlling blood sugar too (it's going high and low)...My obe told me she didn't want me to go too much over 38 weeks.  That will be this Friday.  But I have no appointment with her any more.  She just said \"see you in the delivery room\".  I guess I'll have to call her clinic if baby is still in place by Monday.After being really constipated for the past weeks am finally moving again today.  Hope that is a sign that things will happen soon.And am super tired.  Still doing work stuff remotely and trying to pop into the office daily to check what's up and sign things and direct people (office is only 5 minutes from my house).  But also catching extra sleep.Am so looking forward to baby, but it has not been an easy pregnancy and I am so looking forward to having my body back and returning to my active lifestyle.  My first trimester was major abdominal pain and \"morning sickness\", which turned out to be appendicitis and amoebiasis.  My second trimester was recovering from the appendectomy/laparotomy, and this 3rd trimester hasn't been comfortable and is getting worse.... plus also having problems with what my doc thinks are adhesions from the surgery... with major tummy pain again...Please baby come soon!  I love you so much already, but you've had your time in my belly and it's time to safely be born and join the world and grow into the person you are meant to be.",
            "post_id": "3899276",
            "timestamp": "1232537404",
            "user_id": "user_231441",
            "user_link": "/personal_pages/user/231441",
            "votes": "0"
        },
        {
            "answer": "just got back in  from my dr appointment 35wk appt well  good news is  the baby is doing great they decided to hold off on the  the strep B  test until  next week when i go  back on  the wednesday. Again  i measured at 42 wks  instead of  35 but hey always measured  big while preggo. WEll bad news is the  BP is  up and i apilling protien in my urine which mean  I am  offically  on  leave as of  today  but my company  took it better than i thought they  would. and i will still have my job when i  go back after she is born  when my leave is up .  So i am home on  almost bedrest  as much as u  can with two other kids at  home. They are est her size today at  close to  seven pounds. So they are going to do another u/s on the  2/3 and if they  fear she is to big they are going to  induce any time  after 37 wks  that is my  BP stables out well hope all u ladies are doing  good",
            "post_id": "3901443",
            "timestamp": "1232576111",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "I have my appointment today~so I'll update later~I've been up all night with cramps and contractions once again (hasn't happened since I went into L&D 2 weeks ago)  I'm feeling pain on my cervix and feling like she's wantingto come out....I was 1cm and 50% effaced when they sent me home that day~and I really haven't had problems until lastnight...I'm 36w3d currently, so like I said, I'll be back on to update today's appointment.  Just wanted to let you know how I was feeling and maybe it means something!  Got that darn GBS test today, but looking forward to the internal :)",
            "post_id": "3903425",
            "timestamp": "1232629843",
            "user_id": "user_514428",
            "user_link": "/personal_pages/user/514428",
            "votes": "0"
        },
        {
            "answer": "I am there with you Momof threecrazykids.....last night was hell...I was having contractions, upset stomach, back pain, bad heartburn, nausiated, everytime I got up to pee...every hour...it felt like I was going to blop him out in the toilet....I felt like I had to go number#2, but nothing would come out!!!  Pressure, Pressure, and more pressure!!A new symptom as well...I noticed last night my vagina is swollen!!  Yeah, when I sit on the toilet...there is a big buldge that I can feel just above the lips...almost as if I was constipated and plugged up....I guess they call it \"cheesburger crotch\"...I didn't have it when I went to the OB on tuesday...I guess it is from him being so low, and all the weight pushing everything down....I thought for sure last night was the night.....but I guess I fell asleep finally around 4:30 for a good hard sleep, woke up at 6:30...and nothing.....Man, I want him out already....Bring on the PAIN!!",
            "post_id": "3903854",
            "timestamp": "1232639607",
            "user_id": "user_643558",
            "user_link": "/personal_pages/user/643558",
            "votes": "0"
        },
        {
            "answer": "SARgirl~Yes the inside of my vagina is swollen~It's horrible!!  But that means the baby's head is resting in the right spot :)  That's crazy  SARgirl because I had the same thing happen...I feel asleep about 4:30 after taking 2 tylenol for my headache and pasted out until 6:30 to get my son ready for school...WEIRD!!*I just got back from my Dr. app...Well, NO CHANGE!  So I'm happy about it because i want the baby in for atleast a week or two more, just to make sure the lungs are developed...other then that I'd LOVE for it to come out.  LOL  So, I'm stuck at 1cm and 50% effaced...I guess that's better then nothing :)",
            "post_id": "3904365",
            "timestamp": "1232648308",
            "user_id": "user_514428",
            "user_link": "/personal_pages/user/514428",
            "votes": "0"
        },
        {
            "answer": "I just got back from my appt as well and nothing new to report. I am really getting sick of all the tests and things.My fluid check came back at 13 today which is good. NST came back good after poking and proding around at her to move.....and overall I am doing good I guess.I have lab work and another NST at the hospital on Sunday, and as for next week, an u/s, and ob appt and 2 nst's. I am just really done with all of the tests and want this baby to come out already!!!Im done being pregnant!",
            "post_id": "3904390",
            "timestamp": "1232648550",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Wow, it seems like we're all stuck in the last few weeks here! I'm reading all your ladies symptoms and maybe I'm not as close as I think! I've been getting BH contractions but not as intense as some of you ladies wrote. And I feel pressure when I get up to walk and turn over in bed, but other than that, not really. I mean my belly feels heavy but maybe I'm not as close to labor as I thought! Man I feel like I am going to be pregnant forever!My U/S could not come any quicker! It's tomorrow at 11:00 and I am so anxious to find out whats going on and how big he is! I just need some answers...I'm still comfortable being pregnant but I want to meet my son already!",
            "post_id": "3904561",
            "timestamp": "1232650953",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "I have an appt on sunday at the hospital with my favorite midwife...and I am going to ask her about induction..and what the options are..because i am running out of time at home...and I want to be able to spend some time with her when shes born! we will see.",
            "post_id": "3905586",
            "timestamp": "1232667439",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Ok, my EDD is Jan31 but I have this feeling Im heading into Feb!  (but I sure hope not!)  Most of the Jan09 mommies have given birth, so I decided to join Feb09, too!Im a full 39 weeks today, starting into my 40th week tomorrow.  At my last appt. on Monday, I am still 1cm dilated and 70% effaced but the midwife said I was getting softer and she guessed I would goto labor this week. Well, we have one more day for that to happen!I lost my mucus plug (in one big loss) last Wednesday and my baby has defin dropped.  I go Monday for my next appt. and Im going to ask if induction is on the table or not. I know they would not let a normal healthy pregnancy go over 2weeks past a due date but Im curious to see what I can expect.Right now I feel like I am going to be pregnant forever (I can't imagine how I will feel if I go past my due date!) but I know they have never left a baby in there yet!",
            "post_id": "3907778",
            "timestamp": "1232726436",
            "user_id": "user_489000",
            "user_link": "/personal_pages/user/489000",
            "votes": "0"
        },
        {
            "answer": "I am now having spiratic pain in my lower area....like, here and there..more frequently than not..I am getting sharp pains or almost kits in the crouch. Its quite uncomfortable! I am just counting down the days til she is due to enter the world, 20 more to go!",
            "post_id": "3909322",
            "timestamp": "1232750939",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Well ladies...just go back from the hospital, had to have more labs done and another NST test...both came back fine. However, they told me my last 24 urine that I did last week had a level of over 300 (protein in it) and that when I hit 38 weeks they want to induce. So, being that I hit 37 weeks yesterday, looks like I may possibly onyl have one week left!!!Will keep you ladies updated!",
            "post_id": "3914976",
            "timestamp": "1232907572",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "WOW!!!!  Good luck!   Im sure all will work out a-ok!",
            "post_id": "3917712",
            "timestamp": "1232975774",
            "user_id": "user_489000",
            "user_link": "/personal_pages/user/489000",
            "votes": "0"
        },
        {
            "answer": "So much for the induction...i swear..all the docs at my office dont know what they are doing.....the doc i talked to today said they wont do it!",
            "post_id": "3919051",
            "timestamp": "1232997249",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "So one doctor said they were going to induce you and than another said they won't? That makes no sense! AHH sometimes doctors frustrate me so much! Hang in there girl!",
            "post_id": "3919344",
            "timestamp": "1233001730",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "Yea, the midwife that I saw in the the hosptial for tests yesterday said that I had a high level of protein in my urine and being that my blood pressure has been up...that they should induce..and to call the office today to talk to the doc in office. The doc tells me that unless she does a full evaluation of me with another 24 hour urine and bloodwork to see if they get the same results than there will be no induction. She says she does not induce at 38 weeks unless absolutely necessary because of lung development. I then told her that 4 weeks ago I had teh steriod shots for lungs...and she said that she would leave a note for the doc that I am seeing in office on friday to check on things with me..and that we will see from there. Im just frustrated because I was so excited that I finally knew that next week would be it...and then for her to shoot my spirits down the drain. I literally started crying when I got off the phone.I am done being pregnant. I am done going for tests 2-3 times a week. What teh heck is bedrest if you have to go to appointments that many times a week??Who knows...all I know is I have already been out of work for 4 weeks...and I am not going to be able to afford to stay home much longer.....I mean, its mandatory for atleast 6 weeks for regular delivery..but at this point..i wont be able to afford that!",
            "post_id": "3919389",
            "timestamp": "1233002406",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "My OBGYN was concerned about me having preeclampsia because of my swelling, rising BP and quick weight gain - so I did the 24 hour urine collection over the weekend.  I am 37 weeks today and he said that if the results came back with my protein levels over 300 then he would induce me this week, due to risk of seizures - among other effects.  He said that even if my levels aren't above 300 he will probably induce me between 38-39 weeks because of all the symptoms I'm having.  So it's not all the baby that they need to be worried about - it's you also - that's the main reason they would induce because of preeclampsia.  My doc even told me that if preeclampsia is discovered earlier in pregnancy he suggests inducing at 34 weeks because of the risk to the mother.  I would really raise he*l about this because it's your life here!  I haven't gotten my results yet, but I'm not sure if they will call me if the results are ok.  I would seriously call your doc and ask him why he woudl wait when this has to do with your health.",
            "post_id": "3919492",
            "timestamp": "1233003586",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "hey  i know u feel i have been  out of work  since 34 wks due to horrible  back pain and them  worry about my daughter;s size.   I know i wont be able to  afford to stay  out much longer either  it is  even  worst cause i have the  job that  pays for the health insurance for the  family luck  atleast we can  say it  is close to tax return time lol  that is what helps me not to  worry to much  thank god for HR Block and  rapid refund lol.My doctors are  talking about induction due to my baby 's size they are believing her to be bigger than  what they  would like her to bei am going for  u/s on the  3 to determine her size.and i am also  have issues with my BP by the i will  be 37 wks  adn they  have no  problem  inducing after that  but that is my  doc.  Try talking to them and telll them what u are  feeling and make them  listen . I know that  seems hard but in the  end they are not only going to  do what is  right for the baby they will do what is  right for u too. Hopefully it wont be to long for u i know what i feels like to be done with being pregnant  i am so there Good luck  keep us posted",
            "post_id": "3919529",
            "timestamp": "1233004053",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "KM604 & Jdamico,Thanks for your responses.KM-yes..my level was 304 i believe..thats why the one midwife mentioned induction. I am going to talk to the other midwife on Friday...she was really nice and the one who pulled me from work so hopefully i can get somewhere.THey need to understand that this whole situation affects my life....and I am going to try and get them to understand the situation. This truly cant  be helping my blood pressure at all right now..being its already been high lately...and they have been watching that too!",
            "post_id": "3919874",
            "timestamp": "1233008705",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        }
    ],
    "post_id": "3895800",
    "question": "Another week has gone by ladies!! How is everyone feeling? Getting anxious? Any new Symptoms? Tell me your thoughts and feelings this week!Nothing really new to report on my end. I thought for SURE that I would have had my little boy by now but I guess he's going to come when he's good and ready. I feel great though, so I can't complain. I get a little uncomfortable at night when I sit too long and I've been getting more BH contractions..stronger ones too. So I know its my body just prepping itself. So I'm just as anxious as ever! I'm sleeping fantastic, passing right out, peeing every couple hours but still sleeping awesome. My appetite has increased these last couple weeks but I've also been getting really BAD acid reflux...it burns and makes me want to yack! So on one hand I'll be hungry, on the other I won't want to eat because of the aftermath. I've had my days too where I am just completely exhausted but for the most part I am bouncing around getting the house ready for Caidens arrival.Oh yea and Caiden is still soo very active! I don't know if he still has room in there or what but he is always moving around..or punching and kicking!So just waiting and waiting!Were in the process of interviewing Pediatricians right now and we haven't found one we like. I think I'm being too picky..its such a tough and important decision! Other than that, just looking forward to my Ultrasound on Friday, finding out his weight, position and hopefully a lot more information! I just can't believe I'll be 39 weeks in 3 days!! The end is near!!Hang in there girls! Let me hear your updates :)",
    "timestamp": "1232464672",
    "title": "Another Week! January 20th-Weekly Check-In",
    "user_id": "user_341551",
    "user_link": "/personal_pages/user/341551"
}