{
    "answers": [
        {
            "answer": "SO SO SORRY FOR YOUR LOSE...:(Typically that is true, but those tests should be able to tell you something....there is hope and your not alone...GOOD LUCK to you.",
            "post_id": "2019598",
            "timestamp": "1193244414",
            "user_id": "user_285080",
            "user_link": "/personal_pages/user/285080",
            "votes": "0"
        },
        {
            "answer": "Hi Kat0513,I have also had 2 miscarriages and 2 D & E's this year.  I really feel for you.  I miscarried the first baby at home but some of the placenta got stuck in my cervix and I bled and was in a lot of pain for several days.   Then I went in for an emergency D & E.  It was traumatic because of the amount of blood and  pain but mostly because I saw the baby.  The second time around I had a missed miscarriage and I had to make a decision.  After a week, I decided to go ahead and get the D & E so that I could start getting some closure and begin healing physically and emotionally.I pressed my doctor to get some tests done.  I asked her for all the screenings I could get with a blood test including a karyotype of my husbands and my genes.I also asked to get the baby tested to see what was wrong and to find out the sex.  Finding out the sex was really important to me so that I could give my baby a name.I found out that I am compound hetertozygous for MTHFR on 2 different genes.  I won't go into all that.  But it can cause multiple miscarriages, stillbirth, preeclampsia , and  birth defects related to folic acid.  It can also cause stroke, heart disease and high blood pressure in my body.  There is a treatment thank goodness.I could not imagine that anything good could have come from a 2nd miscarriage.  But the loss of baby #2 may have saved my future pregnancies and my life and my children who are already born (they have 50% chance of having it).But be warned... unless your insurance covers testing like this it can cost a lot of money.  It costs about $1500 to get the baby tested and about $800 per person for the karyotyping.",
            "post_id": "2020064",
            "timestamp": "1193249258",
            "user_id": "user_305396",
            "user_link": "/personal_pages/user/305396",
            "votes": "0"
        },
        {
            "answer": "Thank you for the encouragement and advice.  This has been a pretty hard day.  My doctor would like to see me in a week if I haven’t passed the tissue and fetus.I’m afraid to have another DNC, I’ve heard that multiple surgeries can be damaging to my uterus and possibly cause scar tissue.I’m not sure what panel of tests she is referring to and the price involved, but hopefully she will be willing to do them for us.  If she isn’t then we will find someone who will.Forums like these help me get through these hard times and  I appreciate all of the women who are willing to take a few minutes out of their busy days to share their ideas and stories.",
            "post_id": "2020151",
            "timestamp": "1193250282",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I am soo sorry for your loss. I have passed all my mc (6) naturally, so i don't know what a d&c is like. I can tell you for me it was just like a very hard period, with lots of cramping and passing tissue. All my mc were <7weeks. I said a prayer for you...God BLess!",
            "post_id": "2021068",
            "timestamp": "1193262366",
            "user_id": "user_283",
            "user_link": "/personal_pages/user/283",
            "votes": "0"
        },
        {
            "answer": "Ask your Dr. for a clotting study.  Thats what they found was causing my m/c's.  I also have the MTHFR and a clotting disorder that causes microscopic blood clots in the placenta.  Sorry for your losses.Deb",
            "post_id": "2021596",
            "timestamp": "1193269320",
            "user_id": "user_224896",
            "user_link": "/personal_pages/user/224896",
            "votes": "0"
        },
        {
            "answer": "I'm sorry for your loss. I have gone through 2 m/c since last March and both were natural. I was just over 6 weeks with both. my dr. gave me tylenol 3 to help with the cramping and with that it wasn't too bad. each was a little different-first one was over about a week of bleeding and the second was only 2 or 3 days of heavy bleeding. I went back and forth with the d&c idea but my doctor and I decided it was better at this early stage to let it happen naturally. I too was afraid of too much scarring (I've already had a csection) because I want every chance to carry another baby to term. do whatever you feel is right for you and take care-I know it's extremely hard emotionally.",
            "post_id": "2022066",
            "timestamp": "1193276295",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "sorry, I forgot to say that my dr. also said that they really don't do any testing until after the 3rd one as well. so I still don't have a reason for mine either. it's so frustrating because if there is something we could \"fix\", I'd hate to go through another m/c if I really could have avoided it. by the way, I am from WI also...are you anywhere near Wausau?",
            "post_id": "2022091",
            "timestamp": "1193276608",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry to hear your sad news....I had a m/c in June at 7 weeks.  I decided to have a D and C..well my ob didn't really give me a choice.  I have a VERY good piece of advice for you...you do what makes you feel comfortable meaning...insist on the blood work.  Since I only had one m/c I got the usual speech..\"it's common and we don't test unless you have multiple m/c's\".  After pondering for a bit I decided that wasn't good enough for me.  I went to see an RE and he ran a full panel of blood work and you know what it probably would've happened again to me b/c I am compound heterozygous MTHFR (blood clotting disorder).  I can honestly say that I think my RE was shocked to find this.  The thing is now I know I'm taking extra vitamins and a baby aspirin a day.  You never know...if you want your blood tested insist.  You may or may not find out something.  For me it gave me closure and a reason...good luck to you and again I'm sorry for your losses....",
            "post_id": "2022156",
            "timestamp": "1193277642",
            "user_id": "user_237300",
            "user_link": "/personal_pages/user/237300",
            "votes": "0"
        },
        {
            "answer": "i am soo sorry for your lost. my prayers are with you. i know how difficult it can be. keep your head up!melissa",
            "post_id": "2022437",
            "timestamp": "1193281845",
            "user_id": "user_242380",
            "user_link": "/personal_pages/user/242380",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies for all your stories and comments.  I'm excited to finally get some answers and if my doctor decides she would rather I wait until I have 3 m/c's before she wants to test, than I will be off to see a new doctor.  It sounds like this blood clotting disorder is pretty common.  I will keep you all posted.  Thanks again!  I'm doing my best to keep my head up and stay strong.Kat",
            "post_id": "2023323",
            "timestamp": "1193315659",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I currently live in Fond du Lac, but will be moving to possibly Appleton in the next year.",
            "post_id": "2023334",
            "timestamp": "1193315851",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "ok, my aunt lives in Appleton. just thought I'd ask thinking maybe we were near eachother and could compare dr. notes. oh well. good luck to you and let us know what happens!",
            "post_id": "2026542",
            "timestamp": "1193360482",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "Too bad we didn't live closer.  I would suggest finding a new doctor if he/she won't do any testing yet.  There is no need that you have to wait for a third to happen.  If mine doesn't want to do any, I'm off to a new doctor.",
            "post_id": "2032644",
            "timestamp": "1193498255",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I was just seeing a family dr. with my last pregnancy that resulted in a live birth (my son is 3). when I got pregnant in Jan. 2006 I saw her again...I ended up spotting and had an ultrasound at 6 weeks and saw the heartbeat. spotting was still going on so I went back a week later and no heartbeat. I know a lot of women on here unfortunately know exactly how your heart just feels like it's being ripped out of your chest at that moment, including you. anyway, I got pregnant again in Sept. of 2006 and started spotting again right around the same time. we had 2 ultrasounds, dr. put me on progesterone supp. to see if that would help. m/c again, this time we never saw a heartbeat. after the 2nd m/c she sent me to a high risk ob dr. and he said because of my cycles being irregular maybe the clomid would help. he did say we could go ahead and start testing but that most ins. don't cover it until after 3 m/c...so it could be quite expensive and that a lot of times they can't find anything wrong. but I think he's willing. his nurse said my next step would be being sent to Green Bay for specialist care. the thing is my husbands ins. doesn't cover all the extra fertilty stuff but his open enrollment is coming up in Nov. and if I can change it to cover that maybe it will be a different story. I was just hoping we would become pregnant on our own and our luck would change. we do have 2 children that were both conceived naturally but adding a third seems to be an uphill battle. let me know how things go for you ok? sorry I rambled on!",
            "post_id": "2034666",
            "timestamp": "1193548476",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "I didn’t feel like you were rambling on.  It is always good to hear different stories.I'm not sure what my doctor will do or if my ins. company will cover the testing. I certainly hope so; I don't understand why I would have to go through this again before anything can be done about it.  DH and I decided that if our ins. company doesn't pay for it, then we will get pregnant right away this time without waiting as recommended by my doctor for 3 periods.  That may sound horrible, but my instincts are telling me that something is wrong.  I felt it from the very beginning of my first pregnancy.One of the hardest things for me right now is that I’m throwing 2 baby showers next month, one for my sister and the other for my sister-in-law.  I’m just not in the mood to do this right now, and I know I have to be strong for them.  It is not their fault.  Also, 2 of my good friends and a cousin of mine are due in March.  I’ve considered joining a support group, but am not able to find any in my area.  Maybe I just don’t know the right places to look.  DH is an excellent support person to have, I just need more.Keep me posted with your research and findings and best of luck to you.  Keep in touch!",
            "post_id": "2036276",
            "timestamp": "1193603598",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry for your loss.  I have gone through 2 MC myself.  One recently this month.  It doesn't get any easier each time.  I still break down from time to time.  I'm also surrounded by pregnant people...2 at work and my sister in law.  The advice I would give you is not to be strong for anyone.  I tried to do that, and it made it worse.  I made myself believe that other people needed to be strong for me during this time, not the opposite.  I also gave myself a day to just simply cry about it.  I'm sure you've given yourself that time...but if not, do it.  I let myself have the one day and then I got up the next day and went back to work.  Good luck to you in the future!  You'll be in my prayers.",
            "post_id": "2037452",
            "timestamp": "1193626187",
            "user_id": "user_270696",
            "user_link": "/personal_pages/user/270696",
            "votes": "0"
        },
        {
            "answer": "I understand exactly how you feel. right when I found out I was pregnant, one of my husbands cousins found out she was pregnant-we were due within a couple of weeks of eachother. I m/c in March, found out another of his cousins was pregnant-due in Nov., sister in law found out she was pregnant-due end of Dec. When I found out I was pregnant again in Oct. I thought everything was going to be ok, only to m/c in Nov. I couldn't go to my husbands cousins baby shower let alone go to see her in the hospital when she had the baby. I didn't even call them for a few weeks, it was awful. I felt sad and on top of that guilty but I couldn't do it. my husband turned 30 in Dec. so we had a surprise dinner for him and neither of them (cousin or sister in law)  were invited by me...I felt totally selfish. so the holidays were extremely hard, I wanted to be happy for them but I was so sad for me. why did they have their babies when we didn't?! it just doesn't seem fair sometimes. this March we found out my sisters best friend-who is almost like a little sister to me found out she was pregnant, and in May I found out 2 of my closest friends are pregnant also-one due Dec. 10th and one the 11th so they are pregnant together. neither of them were trying of course and one of them is having twins on top of it. I finally brought myself to go to my sisters friends baby shower in Sept. and it wasn't bad once I got there. but I won't lie and say I didn't feel sorry for myself. I saw my dr. for a check up a few weeks ago and she asked how I was feeling about the m/c now and I told her even after almost a year since the last one it's still hard. not as hard but still extremely frustrating, especially not knowing why they happened. she said it's totally normal-take the time you need to grieve. I also thought about joining a support group but never went that far. I'm sure if you ask your dr. or call a local hospital they could point you in the right direction. thanks so much for \"listening\" to me, it helps to talk it out to someone who understands. like yours, my dh is very understanding but as a woman you feel like your body betrayed you and it helps to talk with another woman. nobody in my family or circle of friends has ever had one so nobody feels that pain. just do the best you can and I like what love1221 said-I made myself believe that other people needed to be strong for me during this time, not the opposite. keep in touch and I hope you figure something out real soon!",
            "post_id": "2037861",
            "timestamp": "1193635555",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "I like what you said \"The advice I would give you is not to be strong for anyone.  I tried to do that, and it made it worse.  I made myself believe that other people needed to be strong for me during this time, not the opposite.\"  I agree 100%.  I need to stay strong for myself.",
            "post_id": "2039163",
            "timestamp": "1193675077",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "How can I add you as my friend on this website?One of my biggest frustrations is that unless you’ve been through what we’ve been through, NO SEEMS TO understand.  DH and decided that we would still tell our parents and brothers and sisters this time around but NO ONE else.  We thought they would be a good support team.  The heck with them…..my sister came over for a few hours on Wednesday when she found out and I haven’t heard from her since, I haven’t heard from any of my in-laws.  Two of them I would consider good friends of mine.  I guess to everyone else, it is no big deal.  It makes me never want to share anything with them.  How can people be so heartless?  The last time I miscarried, my sister stayed away from me because she was pregnant and didn’t want to stress over my loss.I feel I need some sort of support group to keep me going.  I’m so pleased that I’m making friends with people like you on this website.  Keep in touch.  I'll keep you updated on my situation.  I'm praying that I'm able to pass this one naturally and soon.  I really don't want to have another DNC this year.",
            "post_id": "2039168",
            "timestamp": "1193675174",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "There is nothing worse than people avoiding you because they're pregnant.  My sister-in-law found out about my miscarriage and then didn't want to tell me that she was pregnant.  I understand that people are concerned with my feelings, but avoiding me isn't the right thing to do either.  Can't people just act as normal as possible?",
            "post_id": "2041015",
            "timestamp": "1193699504",
            "user_id": "user_270696",
            "user_link": "/personal_pages/user/270696",
            "votes": "0"
        },
        {
            "answer": "I'm sorry your family doesn't seem to understand. like I said nobody close to me has gone through this plus with all the new pregnancies in the family last year they seemed to put more effort into their lives. maybe they just don't know what to say so they think it's easier to say nothing at all? how are you feeling? it's been about a week right? were you on progesterone? I had to stop that before my m/c began and even after stopping it, it took another 3 days or so before it really started. know that you're in my thoughts and I hope you're feeling better soon. I'm not sure how to add people to your own list on here??? I'm just watching to see if you reply.",
            "post_id": "2042121",
            "timestamp": "1193718334",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "I'm sure that most of my family just doesn't know what to do or say. And I’m sure they care.  I'm just the type of person that would at least send a card, give them or call to say I'm sorry... etc.  Not just leave you hanging.I’m feeling okay… cried my eyes out for a few hours last night and a little bit this morning.  It seemed to help me a little.My doctor has scheduled my DNC for Thursday, but I did however, start to bleed, slightly cramp and feel like I’m running a little fever.  I’m praying that this is the start of my m/c and that I won’t have to have the surgery.  Keep your fingers and toes crossed.  I’ll give doc a call tomorrow to see what she says.I am not on any medications or progesterone.Thanks for being there for me.  By the way what is your first name?  My name is Kathryn, 27 years old from Fond du Lac, married to Ryan for 8 years.  No kids yet but hoping to have one someday.",
            "post_id": "2044880",
            "timestamp": "1193779665",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I know it totally sucks but hopefully things are going to take care of themselves now. All the sooner you can move on somehow. Crying does help, a couple days before I went to that baby shower I started in the shower-don't know why it was there but in a way I feel like a little more sadness comes out...for lack of better words. I'll keep hoping that everything happens naturally for you. Like I said, the Tylenol 3 helped me, not only with the cramps but helping me fall asleep at night. Otherwise I laid there wondering what I could have done differently. Anyway, my first name is Stephanie and I am 29(will be the big 3-0 this March :( ha ha) My husband Brett and I have been married 10 years and live in Mosinee. We have two boys-one is 9 and the other is 3. We never wanted them that far apart but my cycles were so irregular that's just how it happened. They are great. My 3 year old keeps talking about \"when he has a sister,,,\" I just hope someday we can make him a big brother. My 9 year old knew about the pregnancies and the first m/c was very hard on him. We kind of told him what was happening to prepare him a little. We went for the first ultrasound and saw the heartbeat so a week later when I was still spotting I honestly just wanted to reassure myself everything was ok. He was at my in laws so when we picked him up he slipped his grandmas shoes on and ran out onto the porch and said \"Is it still there?!\" I couldn't even speak, I just shook my head no and he ran in the house crying-went right to grandma. I went upstairs and just laid on the bed and cried. To him it wasn't just a 6 week old embryo, it was his brother or sister. A lot of our family told us we needed to be greatful for the two children we already have but really, is that supposed to make me feel better?! My first was a natural delivery in a Naval Hospital no less. No complications at all. My second was induced because of high blood pressure. It started at about 8:30am and by about 11:30 I thought my water had broke. The nurses came in to check me and said that's not your water it's blood. I've never seen so much blood in my life. My contractions started immediately and I could't stay on top of them. They called for an epidural and called my doctor to come up. She arrived and checked to see if I was dialating and also put the fetal monitor on his head. She no sooner looked up at the stats(baby's heartrate) on the computer and declared emergency c-section \"stat\". Nurses came flying in the room, unplugged everything from the wall and ran me down the hall. From the time a c-section was declared to the time our son was born was 13 minutes. My husband couldn't be in the room and I was completely knocked out. My placenta had abrupted so they kept saying it was good I was already at the hospital because if it happened at home we may not have made it in time and could have lost the baby and possibly myself. It was the scariest thing I've ever been through. My son's apgar scores were super low and he was hooked up to an IV and under oxygen so we couldn't even hold him for a good 24 hours. He turned out absolutely fine and is a pistol :) Too smart for his own good. So after that my doctor said I could have more children but I'd probably be seen by a high risk ob. I thought, \"to hell with that. I'm not having anymore children!\" So when we got pregnant last Jan. it was a one time oops,  which totally surprised me because we had tried for so long for our second child. I was devestated at first. Scared out of my mind I'd go through the same thing. I cried the whole way home from the dr.'s office. I finally accepted the whole thing and thought \"God does these things for a reason so everythings going to be fine\"  So I started to get excited, we told the family and our boys-although the younger one had no idea. All to have it taken away. So now I'm determined to have one more. There is supposed to be another one there yet and I will try until it happens. Just makes you wonder why the big man upstairs does what he does. Sorry to go on and on, just thought I'd fill you in on my story with this fertility thing. I hope you are feeling ok with the bleeding and cramps. Have the hubby take good care of you and I'll \"talk\" to you soon!",
            "post_id": "2046379",
            "timestamp": "1193805841",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        },
        {
            "answer": "My cramps, bleeding and fever were signs of miscarriage.  I started bleeding heavily around 10:00pm last night.   Not to be too graphic, but was passing huge blood clots until about midnight.  Then the unbearable pain started.   OMG… it was horrible, I couldn't do anything about it and my poor husband was soooo sad that there wasn't anything he could do.  The pain lasted until about 1:30, when I was finally able to sleep.   I woke up around 4:00pm because I felt another blood clot coming on.  When I went to the bathroom, I had passed it.   It was sad; all I could think was \"What could have been\".  I'm so grateful that I was able to cancel my surgery this time around.  I didn't want to have to go through another one.   The pain is gone today and I'm only slightly bleeding.  I have my follow-up appt. scheduled for the 12th.   I'm excited to find out what type of testing can be done.BTW... I have the best hubby in the world.  He always takes great care of me.  I'm not sure I'd be able to go through this without him.As for you, are you guys TTC right now?  Or are you waiting for a bit?   Your story of your oldest running out to the care asking \"if it is still there\"  broke my heart.  I'm was sorry to hear that.We'll both have our day, I'm sure of it.  The least we can do is stay postive.  I know it is hard, but I truely think it helps!  Have a good night.  Talk to you soon!!!!",
            "post_id": "2049829",
            "timestamp": "1193880263",
            "user_id": "user_186877",
            "user_link": "/personal_pages/user/186877",
            "votes": "0"
        },
        {
            "answer": "I'm glad to hear everything is progressing the way it should...I mean, I know it's mixed emotions but now you won't have to have another surgery. I am anxious to find out what testing they do too. I'm wondering if you need to have it done around a m/c time or if I could try to start that even though it's almost been a year since my last one??? I could call my dr. I suppose. Yes, we have been trying to conceive like crazy;) Since the m/c was over last March...I think we went against dr. recomendations and didn't even wait the 1 month. Then went through the second m/c in Nov. and started right back up in Dec. Nothing happened so far. I was put on Clomid for 5 cycles and the last time I took that was the end of June. I don't know what the heck is the problem. Everyone says \"stop trying so hard and that's when it will happen\". WHATEVER!!!!!!!! How long have you guys been ttc? Glad things are progressing for you, onto the next step. What time are you normally online? For me it's late-after the kiddos go to bed. They had way too much sugar today I'll tell ya! Happy Halloween!",
            "post_id": "2050281",
            "timestamp": "1193890114",
            "user_id": "user_245020",
            "user_link": "/personal_pages/user/245020",
            "votes": "0"
        }
    ],
    "post_id": "2019441",
    "question": "I found out at 16 weeks on 4/24 that our little had stopped growing and died around 11 weeks.  And now today the same thing happened, I went in for a 10 week u/s and found that our little on stopped growing, but this time at 7 weeks.  I’m totally heartbroken and don’t know what to do.  Why does this keep happening?  Am I just not capable of carrying a baby?My doctors on vacation this week and we have decided to pass this one naturally.  I’ve had two DNC’s this year and don’t want to have to deal with another.  I hear that passing them naturally is extremely painful, and I’m really scared.  Next week we will ask my doctor if we can have a panel of tests done to see what is going on, but the nurse said that they typically don’t do this until you have 3 miscarriages.  Is that typically true?",
    "timestamp": "1193242169",
    "title": "Another MISCARRIAGE",
    "user_id": "user_186877",
    "user_link": "/personal_pages/user/186877"
}