{
    "answers": [
        {
            "answer": "I definitely believe it can be from anxiety.  This past summer, my right arm always felt extremely heavy.  It seemed even hard to lift!  It was anxiety related.  Our bodies can do so much to us!  Aside from a pinched nerve or syatica (spelling?) and your heart is fine (thank goodness!) that is what it is!Notice how it goes away when you are exercising...you are releasing anxiety and stress when you do that and it isn't building up inside.You do not need to be overstressed or over anxious to have anxiety symptoms...as a matter of fact, I get more symptoms when my life seems the calmest!  The more you dwell on it...the more it will be that....and I can attest to that!!",
            "post_id": "16165",
            "timestamp": "1169618400",
            "user_id": "user_165308",
            "user_link": "/personal_pages/user/165308",
            "votes": "0"
        },
        {
            "answer": "Thanks for your input suzi-q.  It's just something I never had experienced until a few months ago - it's debilitating.  But as all my docs eliminate the nasty things, I'm becoming more and more a believer of anxiety (which is initially what my psychologist has said all along).Do you have any helpful books, websites or tips related to this ailment?God Bless all of us,nm",
            "post_id": "16166",
            "timestamp": "1169618400",
            "user_id": "user_181609",
            "user_link": "/personal_pages/user/181609",
            "votes": "0"
        },
        {
            "answer": "i recommend the anxiety and phobia workbook. it should be available through any town bookstore. it has good distraction methods which seems to me would help you. if you distract your mind from the pain, it goes away. eventually it will just stop coming back. every time you feel anxious use one of the distraction methods, such as saying the alphabet backwords in your head.hope it all works out.",
            "post_id": "16167",
            "timestamp": "1169618400",
            "user_id": "user_181618",
            "user_link": "/personal_pages/user/181618",
            "votes": "0"
        },
        {
            "answer": "Try a heating pad at night it might ease some of the pain... Get a handle on your stress and Try some new posture and breathing techniques it can help tremendously! I have been through what you describe and have seen cardiologists.. ER's ETC.I found that eating right and improving your posture in your daily activities can help you to recover quicker!",
            "post_id": "16184",
            "timestamp": "1169704800",
            "user_id": "user_181582",
            "user_link": "/personal_pages/user/181582",
            "votes": "0"
        },
        {
            "answer": "go to anxietycentre.com  lots of info there on anxiety.  Best to you....best to all of us!!!",
            "post_id": "16190",
            "timestamp": "1169704800",
            "user_id": "user_165308",
            "user_link": "/personal_pages/user/165308",
            "votes": "0"
        },
        {
            "answer": "I am relatively new to this anxiety thing too.  The one thing that casts deep shadows of doubt into that diagnosis is the chest pain.  Strictly left side.  I have been checked out by three cardios (2 thoroughly) and I SHOULD be able to find some relief in that....but I don't.When I feel the craziness of the anxiety, I truly believe I \"JUST\" have an anxiety issue.  But when the weirdness of the chest pains and those symptoms come, I'm a wreck.  They seem to be two different things.  I know rationally that a serious heart problem wouldn't be knocking at my door for a good part of a year and not come in.  But, unfortunately, I am not always rational when the weirdness starts.I am getting worse I think and I fear I WILL make myself have some kind of heart issue.  I even was at Disneyworld last weekend and wouldn't go on the Space Mountain rollercoaster because of the warnings about heart conditions.   That's pretty stupid, I know.  I don't HAVE a heart condition.I just wanted to let you know that you aren't alone and if you've been checked out--you are okay.  (Now if I could only listen to that!!!)  I'm not sure where I am going but this forum has been great for peace of mind, the people who answer have been most helpful--I don't feel like such a wreck after the support.Good luck to you.",
            "post_id": "16228",
            "timestamp": "1169877600",
            "user_id": "user_171429",
            "user_link": "/personal_pages/user/171429",
            "votes": "0"
        },
        {
            "answer": "I to have been getting chest and left arm pain for a few months and same thing went to doctor then hosp only to be told that it is either anxioty or muscle pain very very destressing for me so i know how you feel.",
            "post_id": "17171",
            "timestamp": "1173848400",
            "user_id": "user_193377",
            "user_link": "/personal_pages/user/193377",
            "votes": "0"
        },
        {
            "answer": "i am new to panic disorder and I have had almost constant chest pains for 4 months.  I have been through the ringer with doctors and nothing is wrong with me.  But there is major pain and i still feel like something is the culprit.  My pain happens most at night when I am trying to relax.  When I am exercising and am active, I don't feel it.  I am a wreck and am having a hard time dealing with it.  Reading forums like this really helps.  I see people in the same boat and I don't feel so helpless anymore.",
            "post_id": "3102988",
            "timestamp": "1214879500",
            "user_id": "user_550149",
            "user_link": "/personal_pages/user/550149",
            "votes": "0"
        },
        {
            "answer": "Hi all, glad to hear that there are so many of you suffering from the same symptoms that I have. I often get these feelings, sometimes two or three times in a day, although the pains in the arm and chest aren't always there, I always feel as though I am on edge and that something bad is going to happen to me. I have been suffering from these symptoms for close on 4 years and nothing has changed, they haven't got better and thet haven't got worse. Been to the hospital on several occasions for ECG's etc and everyone comes back fine, eventually went to the doctor the other day and explained howmuch of an effect my condition was having on my day to day life. He prescribed me some Beta Blockers, Propranolol 40 mg tablets, have only been taking these for 2 days so am unsure if they are going to work!! Often wake up in the middle of the night feeling tightness across the chest and sometimes I feel like I have an armband around the biceps of both arms, like I said very frightening. Think that we are just some of the unlucky ones in life, although would love to be able to go through a day without havinf to worry about every little ache and pain being \"the big one\".....",
            "post_id": "3109966",
            "timestamp": "1215020776",
            "user_id": "user_551566",
            "user_link": "/personal_pages/user/551566",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing left arm and chest pain. Mainly in my left arm though. I have been tothe doctor and had examinations for lumps etc but he is happy there is nothing wrong! I have lost my appetite and feel sick alot, I am short of breath at times and my chest feels tight, I also keep crying! I know this is anxiety and I believe that I am feelinglike this because of my arm pain. About 5 weeks ago I found a lump in my left armpit and since the second I found it I was convinced that I was going to die, Thankfully it went away ina few weeks after a course of antibiotics but I worked myself up that much over it I think this is where the pain in my arm has come from... I am constantly thinking about it! I need to snap out of it, my doctor has given me anti-depressants but I want to try and sort myself out on my own! Any suggestions?",
            "post_id": "3238589",
            "timestamp": "1217874890",
            "user_id": "user_579956",
            "user_link": "/personal_pages/user/579956",
            "votes": "0"
        },
        {
            "answer": "i too have suffered with chest pains, tightness, breathless etc i have had it on and off for 14 yrs but its been pretty bad since my grandad passed away nearly 2 yrs ago. i have had tests which were all normal, so jus have to accept its anxiety. as soon as you get it in your head that it is a heart problem you will have the symptoms anyway cause its your brain that is causing these symptoms. im having therapy which helps re-train my brain and thoughts its hard but we have to think if it was really our heart that was the problem surely it would get WORSE by excercise, surely we would have major symptoms by now ie fainting, see my chest gets tight with exercise but thats cause its in my head that exercise will strain my heart too much lol or something will happen when i exercise.the key is to trust the tests and start living again",
            "post_id": "3241511",
            "timestamp": "1217928763",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "I do the same thing.  Everyone tells me to exercise but i get anxiety thinking about exercising because I am afraid I will have trouble breathing if I exercise!  It is a cycle I would like to break!",
            "post_id": "3263449",
            "timestamp": "1218408808",
            "user_id": "user_585895",
            "user_link": "/personal_pages/user/585895",
            "votes": "0"
        },
        {
            "answer": "have you tries CBT? look into it they help you break this stupid cycle there were times when i was even afraid to go upstairs incase i collapsed, i was to scared to go the toilet!!! i still get nervous if im alone, and still have bad days but im better than i was, its a slow process but gotta be worth it. my next goal is to walk my dog alone its horrible cause i love my dog lol and my hubby has to do it after a long days work",
            "post_id": "3264817",
            "timestamp": "1218449238",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "I been having a constant chest pain (I mean all day long) for almost six years now. I did the whole blood work, chest x-ray, and of course an EKG.My pulse hits 115 sometimes, the docotor says it's because I get stressed when I'm about to take it. Because in the last year he caught me at rate of 60 and 70.My head was foggy in the fourth year, I did hit it  but at least xanex helped.I'm finding after years of Xanex it really has no effect on me beyong going into a freak out.I only get freaked out because I worry about my heart but I have been checked out and I'm told if there was a problem they some how missed I would be dead after 5-6 years.Anyone has two cents on the subject.",
            "post_id": "3366019",
            "timestamp": "1220594152",
            "user_id": "user_610599",
            "user_link": "/personal_pages/user/610599",
            "votes": "0"
        },
        {
            "answer": "as you have probably read i have exactly exactly the same symptoms i hate it i had it on and off for 14yrs and same as you i dont believe the doctors or the tests,you would have been dead before 5/6 yrs and you would have had miles more symptoms ie fainting if there was anything really wrong. just try and trust the tests and get some therapy",
            "post_id": "3366268",
            "timestamp": "1220607330",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "These posts are the only thing that keep me from running to the doctor every time I have a chest/arm pain.  For the last 7 years I have had on and off episodes of chest pain, arm pain, shortness of breath, racing heart, fatigue, etc.  After several EKG's over the years, my symptoms too have been diagnosed as anxiety related.  I took Lexapro for 9 months which seemed to help tremendously.  I went off it in May and now the physical symptoms are creaping up on me again.... each day I have some symptom I fear is life threatening.  It's really controlling my life and mood.I hate to go back on Lexapro... I am a 27 yr old female who would like to have children someday and don't want to be dependent on Lexapro during pregnancy.  Hopefully I'll get over this without drugs!",
            "post_id": "3392832",
            "timestamp": "1221152139",
            "user_id": "user_617006",
            "user_link": "/personal_pages/user/617006",
            "votes": "0"
        },
        {
            "answer": "as you have prob read im the same we have to trust the tests and the doctors. although its horrible anxiety wont kill us and trust me i know when the symptoms happen thats hard to believe, i dont take meds only beta-blockers but im thinkin only meds are gonna help me. although therapy is great i still have bad days and im greedy and want them all to be good",
            "post_id": "3393165",
            "timestamp": "1221156707",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "Gosh, I seriously thought I was the only one having this constantly...going on 2 years here of pretty much daily chest, left arm, shoulder pain. It goes into my jaw, yup pretty easy to convice myself I am having heart problems.  I have had multiple EKG's and a full work-up by Cardiology, so I should know better by now.I swear I have this even when I am feeling calm and relaxed.  Get the shortness of breath and can't swallow symptoms, which really drives me nuts.Is anyone on medications for these issues? I just started Amitriptyline a couple weeks ago, so it is not kicked in yet...just wondering if anyone has had relief from this by taking anti-anxiety meds?",
            "post_id": "3393276",
            "timestamp": "1221158292",
            "user_id": "user_252284",
            "user_link": "/personal_pages/user/252284",
            "votes": "0"
        },
        {
            "answer": "Thanks for the advice. Has therapy worked for you?  I guess that's my next option if I don't want to take the medicine.  I'd like to have my life back.... the days are long when I'm constantly worrying about my health.  It's really wearing on me as I see it does others also.",
            "post_id": "3395125",
            "timestamp": "1221185407",
            "user_id": "user_617006",
            "user_link": "/personal_pages/user/617006",
            "votes": "0"
        },
        {
            "answer": "I have chest pain from anxiety. It is more of an uncomfortable feeling that comes in waves. Sorry to hear you are going through the same thing.",
            "post_id": "3398296",
            "timestamp": "1221251963",
            "user_id": "user_615727",
            "user_link": "/personal_pages/user/615727",
            "votes": "0"
        },
        {
            "answer": "im still in therapy i started weekly session in feb and now dropped down to monthly, it hasnt cured me but deffo helped loads. like before when i had symptoms i would get in a state and get really upset i would wanna go hospital and be convinced i was dying were as now im calmer and can ignore things more, the symptoms dont feel as bad even though i still get them, dont get me wrong i still have bad days but i deal with them differently. i just wish there was a miracle cure but unfortunatly there aint so we just gotta work hard at it x",
            "post_id": "3400303",
            "timestamp": "1221300819",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "I started taking a b complex vitamin last week which is supposed to help with anxiety.  Just wanted to report it has helped some.  It's no cure all but it has kept me from running to the doctor to get some meds.  Has calmed my anxiety a bit which in turn has relieved some of the scary physical symptoms.  Hope it keeps up the good work and I'm not jinxing myself by posting this........just wanted to share in case it may help someone else.",
            "post_id": "3419042",
            "timestamp": "1221705325",
            "user_id": "user_617006",
            "user_link": "/personal_pages/user/617006",
            "votes": "0"
        },
        {
            "answer": "i know a few people that have taken vitamin b and said it works so you know what im gonna ring my chemist see if i can mix it with beta-blockers and if i can im off to the health shop, cheers for the advicep.s dont worry if your wee goes bright yellow its the only side effect!!!!!!!!! haha",
            "post_id": "3419964",
            "timestamp": "1221736687",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "Wow , I feel better too after hearing all of your stories. I have had anxiety since July 08 after a alergic reaction. Since then i have been tested for every desase known to man. Also im a us soldier that was supposed to be deployed for the 3rd time which gave me ample amounts of stress. But now im not getting deployed due to that and A-fib . I had 2 bouts of A-fib due to stress . Let me tell you , wow you can really feel like something is gonna happen or that i have a unknown diesase. I have had burning skin sensations , Sharp arm pain , chest pain , shoulder pain , back pain and my burning sensations were all over even tongue and throat . I also had a fear of having clots? for some reason lol .. i mean how could i get them in the first place. I get burning sensations from my chest to my finger tips up my neck like a sharp and cold stinging sensation it comes and goes . Well after all of this i was checked out by the best docters (military docters/Vetern) And im completely normal .. it has to do with the nervious system. And im on metropolol but by choice. besides that im on stoamach pills (nexium).BUT!! All of this is UNNESSARY. Everyone one of us have the same or almost same symptoms. Now think ppl we r all healthy (told by drs.) and we all have same problems. I finally got over anxiety attacks 2 weeks ago. If i can do this we all can . I have had support and no drugs so far and well Its very hard but like quiting smoking you can do it if you want. After you try very hard and cant try anymore you Still have to try alil harder. It will work ppl. You can do it. Like nike says .. Just do it ! So !! -- With all my symptoms and feelings and er visits , I learned that anxiety is a pain in the behind but you can over come it and live witht out it . Even in less then 30 min you can tell your self no more im done with this. and totally ignore it. it worked for me so far. and eventully (depends on how bad you have it ) it will go away and you will be happy agin . lol i remember 1 time i couldnt even sleep laying down i set up all night next to my wife for the fear of a heart attack ,i look back and laugh at my self for being like that lol at the time it wasnt funny though lol im a infantry soldier and i was still scarded to death. You guys will be alright lets all start living .. only one life lets have fun :) and make the best of it. WE ARE NOT SICK!!  Its in our heads we just have to get it out.",
            "post_id": "3422848",
            "timestamp": "1221782825",
            "user_id": "user_624493",
            "user_link": "/personal_pages/user/624493",
            "votes": "0"
        },
        {
            "answer": "good post and im glad you are better i bet your very happy. but.....if it were so simple to stop anxiety wouldnt be all be free of this ****? how the hell did you stop the chest pains coming? cause i just shouted at myself and said right chest pains go away i wanna be normal but the bloody chest pains didnt listen!!!",
            "post_id": "3424516",
            "timestamp": "1221829811",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "Hello Everyone,Wow these posts are helping me tremendously. I am 29 and I starting experienceing my first bouts of anxiety at 23. I thought it was a heart attack. Went to the doctor and all the tests were normal. I think I might have the hiatal hernia as well. I have had a stress echo and many EKG's this year. All came back normal. Thank goodness. I work out too so that does help somewhat. Much like everyone else, I wondered if the workouts were making the condition worse. But I have decided to work out because it's been determined that it's not my heart. I just started having the arm pain like 3 days ago. I guess that's the progression of it. I do not want to take anything for it because I would like to overcome it psychologically if possible. But sometimes the pain is unbearable. Also, I'm in school to be a PA and any class discussing the physiological effects of the body totally freak me out....I have to get through this. I think I might start a yoga class and try some meditation. I'm praying that we are all freed from this anxiety. Remember mind over matter. We can do this. Thanks to everyone for posting.-Risa",
            "post_id": "3424714",
            "timestamp": "1221833220",
            "user_id": "user_625035",
            "user_link": "/personal_pages/user/625035",
            "votes": "0"
        },
        {
            "answer": "hi all,it's very interesting reading all your posts. and it is comforting.i'm just wondering, has anyone had intermittent pains in their hands, different parts of the hands, wrists, forearms, and sometimes thighs, knees, and ankles? coupled with occasional shoulder pain, and tightness in forearm muscles? as well as slight numbing, and tingling/prickling? i also have gerd. it all started when i'd been on pantaloc for the gerd for about eight months on and off, but the last two months everyday. i've been off the pantaloc now for two weeks, but the complaints continue. i'm not on any antidepressants, but definitely have a tendency toward being depressed and anxious.i just really want to know if this could really be anxiety related! i've been freaking out about a lot of possible diagnoses (and have started medical investigation) but now the worst is that i'm worried it's als.anyone have some insight?",
            "post_id": "3700760",
            "timestamp": "1227620099",
            "user_id": "user_693562",
            "user_link": "/personal_pages/user/693562",
            "votes": "0"
        },
        {
            "answer": "PalpitationsPalpitations are short, abrupt periods in which the heart suddenly starts beating fast. If you’re in a sensitive state, this can ring alarm bells because you fear a sudden heart attack. The more you panic, the faster the heart beats. It’s therefore understandable why many people in this situation jump to conclusions and call for medical help. What you have to remember is that palpitations are perfectly natural and can often be caused by exhaustion or stimulants like caffeine. Your heart is an incredibly strong muscle, and it won’t stop or explode simply because it’s beating hard and fast. A healthy heart can beat fast all day long and not be in any danger.Missed HeartbeatsThe medical term for missed heartbeats is extrasystoles. A missed heartbeat is usually an extra beat between two normal beats. Given the pause that follows this premature beat, it just seems as if one beat was missed. And because the heart’s lower chambers fill with a greater-than-usual amount of blood during the pause, the next regular heartbeat can feel like a bit of a jolt. When you feel this sensation, you often freeze and wait in terror to see if your heart is in trouble.Such missed beats are generally harmless. It can help to sit down when you feel this sensation, but if you wish to keep moving, do so. Exercise won’t cause the situation to get worse, and don’t convince yourself that going home to lie down is the only way to help the situation. If you retreat every time you feel an unusual sensation, that behavior can reinforce a negative idea that your home is the only safe place to be. Our hearts are not atomic clocks that always keep time; they speed up, slow down, or occasionally beat in an irregular fashion. People with anxiety are very keen observers of all bodily functions. From time to time, you may notice an irregular beat or two. This is nothing to get upset about.Sometimes, individuals go through similar worries about their heart as they do with their breathing. People convince themselves that if they worry enough about their heart, or concentrate too much upon its actions, it may somehow get confused and forget how to beat correctly. It’s quite common for people who suffer from panic attacks to check in on their heart at regular intervals to make sure it’s still beating away.If you simply can’t stop obsessing about your heart, here are some tips:• Get a full medical examination. If you don’t, your mind will always bring up the “what if something really is wrong” card. When you get a clean bill of health, trust in the results and don’t second-guess them. If you really must, get a second opinion—but after that, stop doubting your good health.• Remember that your body has incredible internal intelligence. Simply telling your heart, out of panic, that it might stop doesn’t mean that it heeds your fears. Learn to become more comfortable with your heart, and let it do its job. Listen to it when you’re relaxed and also when you’re exercising. The more comfortable you are with the diversity and range of your heartbeats, the more confidence you’ll have in it.• Allow your heart to beat in whatever rhythm it sees fit. Don’t try to control the natural rhythms of your body by always insisting on a calm heartbeat. The more you allow your body to flow in the manner it so chooses, the faster it will return to a state of rest.Very often, your heart only wants to palpitate a bit, thump a few beats harder. Why? That’s the heart’s own business. It’s your mind that interferes and panics, causing the adrenaline to kick off a longer cycle of rapid heartbeats. So from now on, make a verbal agreement with your heart that you’re going to stop interfering and obsessing over its health and trust in it 100 percent. Then hand over the controls. Let go to whatever way your heart wishes to behave. By allowing the sensations to happen and simply getting on with your day, you release the anxiety that you hold around your heart as well as the cautious monitoring of every heartbeat.",
            "post_id": "3726618",
            "timestamp": "1228258817",
            "user_id": "user_698733",
            "user_link": "/personal_pages/user/698733",
            "votes": "0"
        },
        {
            "answer": "Great posting KirstinMc. I am in my mid 40s and I had my first nasty episode back in July and have been suffering for the last several months. Your posting is very helpful. I am trying to force myself to work out as I feel better when I do. However, some times  after I work out the palpitations and chest pains play havoc on me and I am not sure if it is self induced. Post like this help keep me going. I have been meditating and doing Tai-Chi but was thinking of trying  celexa as well, do you have any experience with that and is it worth a try?",
            "post_id": "3798195",
            "timestamp": "1229972890",
            "user_id": "user_716719",
            "user_link": "/personal_pages/user/716719",
            "votes": "0"
        },
        {
            "answer": "For 2 years off and on, I've been experiencing left arm and hand aches; worse in 2007.  2 years ago when it started it was the worse as I had left chest aches, left arm and hand pain, irregular heart beat, extreme fear, and dizzingness especially for a few days following a few Korean or Chinese beers which are undoubtebly full of bad chemicals. Funny thing, I learned I get this from Asian beers, but not from German and microbrew beers.  I'm not a hardcore alcoholic, but I like to enjoy a 6 pack once a week such as on Friday night or the night before a holiday off work. I went through 6 months of these symptoms in 2007, then a couple months in Spring 2008, and then recently for the past 4 months off and on without drinking or smoking anything.I get terrified by any left arm, hand, or chest ache, but don't show classic signs of heart disease such as angina when doing physical work like climbing up stairs, getting hot and sweaty in the gym, and climbing up 4000 to 6000 feet mountains. No chest pains, no arm pains while exercising. I always feel better from excersize, but nights can be sleepless and making me exhausted.  When I'm exhausted, lacking sleep, and forced to get up too early, I have more left side, left arm aches and sometimes feeling of weak and terrified of failing.With being 35 years old and knowing my dad had his 1st heart attack at 35, died at 54, and his dad dropping dead at 42 to heart attack from blocked arteries, I'm scared I've been dealt a premature death sentance. My 36 year old brother also has coronary heart disease and is on SSI disability already, but is grossly over weight, did a lot of meth in his days, went to prison twice for stealing, and smokes heavily anything he can get his hands on. He's a thief always trying to sick the police on you when you don't let him rip you off. Needless to say, I've experienced a great deal of fear and anxiety resulting from my dysfunctional family and lack of love of support, but I'm strong in that I just have to keep trucking on through life on my own. I must be experiencing anxiety over economic uncertainty, dysfunctional relatives I've had to bail out of trouble over their irresponsibilities, fear of going broke, and a general sense of lacking security.I live very differently than my parents, grand parents, and brothers in that I avoid milk, cheese, fatty meats, fried foods, don't do drugs, got a high school and college education, served in the military, get regular physical exercise 6 days a week, and look very good. Me and my brother are like night and day. I hope I avert the heart disease disaster by being contrarian to my relatives, but I know I take on a hell of a lot of pollution. It's hard for anyone to believe me when I express concern I could be coming down with CAD as I look good and am strong and healthy otherwise. I'm still single; not settled down, not in a relationship since teenager years, don't plan on having kids, live and work abroad in Asia, and enjoy traveling to many countries.My blood pressure was found to be high 2 years ago at 155/105, but I didn't receive ACE inhibitor pills until last August which lowered it to normal levels, but this didn't make me feel any better. I know to keep it in check as that's really bad for your heart, arteries, and everything else. I'm only 10 pounds overweight, but very physically strong and healthy otherwise. These left arm left hand and sometimes left chest pain aches come unexpectably and the fear sets in.What terrified me about these left side aches is possible heart disease.  I reasoned that if it were anxiety, why didn't I experience this anxiety in my 20's during the extreme stresses of army life and then times of extreme dire straights?  Maybe my 35 year old mind is weaker to anxiety inducing stresses like economic uncertainty and the stresses of work and career and relatives I'm not proud of.I took a 1 month vacation to Thailand last month and just felt aweful most days feeling left side aches and fear of heart attack, but upon return to Korea where I work, I immediatly started feeling fine the day I flew back through symptom returned within a week so I went to a doctor. A year prior, I felt like a million dollars during a 2 month trip to Cambodia, Laos, and the Gulf of Thailand south islands, but upon return home to the states, I got horrible symptoms from day 1 upon being around my mother having serious mental issues and trying to committ suicide by hydrocodone overdose which I averted by taking her to the ER with a BP of only 50/30. When I left home in the states again last June for Asia again, the symptoms went away, but returned in September.  The pattern and symptoms indicate an anxiety disorder in itself, but CAD must be ruled out first. It's perplexing as I would think I'd felt this in my teens and 20's too if I'm suseptable to anxiety disorder as my early years were very difficult and stressful due to the lack of finances. I still don't have a lot of finances and am facing economic uncertainty as the economy tanks, but that's par for the course in our time.  This is not mom and dads time period where you inherit money, house, and a good stable job.2 days ago, I went to the doctor, EKG checked out healthy as a young bull, given nitro pills to test if it releaves arm aches which it seemed to despite the resulting tremendous headache, and given a Beta blocker and mild benzodiazapines which seem to have relaxed me in reducing fear and not feeling like I'm going to have a heart attack. My blood cholesterol is a low 150 due to giving up milk, fried foods, meat with visible fat, and eggs 2 years ago for fear of fat clogging my arteries.   I was told 10 years ago my cholesterol was a very high 300 back when I chugged milk, munched cheese, fried lots of catfish and zuchini, was 30 pounds overweight, and just gorged on anything late at night not yet realizing it's not OK to do that.I'm going Monday for further heart testing at a larger hospital in the big city in attempt to find out if I have and how bad arterial schlerosis is inside my body.  With my left arm aches, extreme fear at night and sometimes at work, and my family history of heart disease, I've been so convinced I've got a partially blocked artery or CAD, but don't show classic symptoms of angina during physical exertion. I only wish I could go talk to my dad and grandpa to find out more of what they felt like, but they're long gone dead many years ago from blocked arteries causing fatal heart attacks. Even both of my grandmothers succombed to blocked coratid arteries leading to stroke where they to be sadfully put down or euthonized by starvation when they couldn't no longer be concious and feed themselves. My mother had congestive heart failure 1 year ago, but is surviving though lost a few of her marbles.  Needless to say, she's moving into an assisted living unit this Spring which deeply saddens me that she won't be able to continue to enjoy the roses I planted in the front yard of her public housing apartment 2 years ago. She's just getting too weak and forgetful to do her own house work, cook, shop, and get around.  She's on all those heart meds and has always suffered severe anxiety and depression, but has been medicated for years.  She never worked as she was in a wheel chair since 17 due to breaking her back during the 1st ride in a car with her 1st boyfriend.Any drugs that can disolved plaque in the arteries to cure arterioschlerosis or for preventative maintenance?  This is my priceless question as this would be the holy grail of curing CAD. Lipitor is rumored to disolved arterial plaques, but I don't have any of these pills.  I know back in my dads and grandpas time, they're wasn't much more technology than nitroglycerin pills while today, we have beta blockers, ACE inhibitors, benzos, and cholesterol reducing drugs.",
            "post_id": "4057033",
            "timestamp": "1236218392",
            "user_id": "user_783964",
            "user_link": "/personal_pages/user/783964",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for sharing your feelings. I can't explain how great is feels to know I am not alone in my struggle with terrible anxiety. Always worried, hypersensitive, never trusting the doctors and tests, afraid of dying.. I'm sorry others have to feel this pain.. this prison.. but knowing there are others strong enough to share and even offer help to others like me gives me strength.I'm 24 years old and have had anxiety and panic disorders my entire life. Everyday I pray I can win the struggle to stay functional and baseline. It takes so much strength and focus to just appear normal a lot of the times and the days that I actually do feel safe and strong and secure are such a blessing. I take nothing for granted anymore. I appreciate everything beautiful about life, especially my loving wife and great friends/family. Because of the love and support of family, friends, and others like me sharing their thoughts and feelings - I feel like I might just be ok.Thank you all so much. I'm in tears right now from the sense of release in knowing I can beat this that I AM ok. I can't really explain it but this just really gives me strength. A lot of the times I just feel crazy because I feel like as much as family and friends and doctors/therapists try to help its like they don't really understand. I know you guys do. Completely. So in a way it is a new kind of comfort. I will always be thankful for those that are there for me, especially my wife who has given so much for me.. but like I said this is like a support group for me in a way I guess.I'll stop rambling.. thanks again. I wish everyone the best of luck and the happiest of futures. I hope you have many calm days ahead.",
            "post_id": "4074928",
            "timestamp": "1236659680",
            "user_id": "user_788922",
            "user_link": "/personal_pages/user/788922",
            "votes": "0"
        },
        {
            "answer": "I've been taking a beta blocker and Clobazam, a derivative of benzo, since March with no change along with my ACE inhibitor with my blood pressured controlled around 110/65 and 60 to 70 resting BPM. I'm still working out 5 days a week and seeing cardio and muscular gains over the months. I almost always feel good when exercising, standing, walking, hiking, cycling, working and anything else on my feet regardless how tiring and sweaty it is. The harder the better, but when I sit down at night, I get dull left arm/hand aches and sometimes mild chest pain. I often don't feel comfy laying down, but seem to feel my heart working harder to beat, especially laying on my back. I prefer sleeping on my left side. Oddly, 3 weeks ago, one morning at 7am, I was having a dream I had just arrived in the states after doing a 1.5 year round the world trip to find I was so jet lagged I had acute chest pain. I do not know if I was actually experiencing the chest pain while dreaming, because it seemed so real, but I immediately woke up and no pain. As you can imagine this makes it hard to go to bed. I wonder how common this is? I'm not seeing a whole lot of posts on these boards, but there's a handful. I quit drinking altogether which didn't help, but I'm worse a day or two after when I did have a drink.  I drank twice in the past 3 months and I thought the hangover was going to kill me as the dull aches were worse so I avoid drinking situations and enjoy the savings as it's not cheap to drink.I am working overseas and haven't been home in 14 months and anticipate I'll be back in October so that 1.5 year round the world trip is my reality as I'm planning to do some traveling into the Fall season. This dream 3 weeks ago was the realest dream I ever had. Back in March, 2008, I was in Southeast Asia for a few months after working in Korea for a year, felt great and normal during my tropical vacation, but when the next day after landing in LAX, I had chest and left arm pain with severe exhaustion or jet lag. I went to bed that afternoon after walking around in Hollywood, slept like 14 hours, got up,(went nutz at Denny's on Sunset eating American high fat heart attack food) and had a great day at Universal Studios Hollywood. Even road all the rides, including the Mummy roller coaster with heart warnings at the entrance with no ill effects. 2 days later, I flew to St. Louis to visit home and the symptoms returned a day after that flight. I went through 1 month of it until I joined a gym. No more symptoms again until last August. I had EKG, stress test, and chest xray done back in March of this year with normal results. Unlike in 2008 where working out prevented it, working out no longer prevents symptoms, but I know it's good for me. I thought if it was anxiety, I would had suffered this back in my 20's as I had a very hard 20's when it came to money, military duty, and issues with greedy selfish relatives. It's quite a miracle if it's true I am as healthy as I look, because these dull ache symptoms in my left arm and most often, hand make me cringe.Of course I'm scared with heart disease running deeply in my family, but I don't live like them. I'm educated, don't smoke, work out regularly, eat lots of healthy foods like salmon and fresh veggies/fruit, rice, and not grossly over weight like they were. Well, I'm totally different in mind and body than them. Just 30 pounds over for my height which are tough to lose. I'm not a steak and fries eater nor hamburgers nor any pastries nor any of those bagged snacks nor Zingers as those sorts of things have hydrogenated shortening. My 38 year old brother has already had heart attack and stroke, but he's 350 pounds, just sat the past 8 years on disability over his back from factory work, and looks awful. Ironically, when they started taking $400 a month for child support 4 months ago, he's laying roof under the table, but time will only tell if he can actually handle it. I still look young, can handle long walks, even up mountains, lifting weights, and anything, but feel better when on my feet unless exhausted due to badly needing sleep. I wanna sleep in the morning; not at night, but must get up for work. On days I was just too tired and needed sleep, I get left arm and sometimes chest dull pains regardless of position or activity. This is not bad pain, just very mild dull ache that comes and goes, but it worries me.  I've never had tightness in chest nor shooting severe pains. Doctor said to forget it when I talk about heart anything, but that's not good enough to personally clear me.  I want that 64 slice scan done to get a visual on my arteries to see if I have blockage requiring angioplasty, but the machine is not available in my local area. When I was growing up, I did eat food fried in shortening, was around smoking parents, smoked a few years, and ate anything, but was never obese. They say after 5 years of getting away from all that, you're as good as a nonsmoker who never ate junk food. I find taking a drink of water at night helps me and then I relax and finally fall asleep. I drink about 1 gallon a day most days very rarely drink soda and other sugary drinks. The only oil in my house for the past 2 years is extra virgin. Even corn oil and deep fat frying of any sort is out of bounds. Only a tiny bit of milk for morning coffee and things like cheese and eggs only on rare occasion. That's why my cholesterol is low.  What's wrong? I know I'm not imagining these dull aches. I know we all need instant full body scan high tech machines like on Star Trek due to our level of knowledge as unprecedented knowledge and hyper-ultra sensitive awareness of our bodies and the world may very well be our excess burden. So we need the who sheebang; not just talking to doctors and doing EKG's.",
            "post_id": "4630203",
            "timestamp": "1246893024",
            "user_id": "user_783964",
            "user_link": "/personal_pages/user/783964",
            "votes": "0"
        },
        {
            "answer": "Ok i just posted a similar post today about my symptoms.  After posting i decided to search farther into the forums and finally found this posting.  This is exactly what i was looking for.  I get chest pains, i get loss of breathe, i've even almost lost conciousness got extremely lightheaded and lost balance.  My chest would feel like i was being stabbed, and my arm would go numb, i actually had similar feelings when i smoked weed in my younger years.  Weed releases dopamine, dopamine is the chemical in your brain the produces anxiety so as far as step by step it makes sense.I too, can't listen to my logical sense and still feel as though everyday is my last, and i cant believe there are so many who have said the same.  i stop and wait to see if its the big one lol...I'm going to get my heart checked out just incase, and if anything like a few of you said it will cause me some peace of mind just making sure my hearts fine.  I've had an er visit, 6 ekgs, a chest x-ray, blood test, and ct scan, and yet im still not convinced completely it's anxiety.  I think after i get an echo i will be more than satisfied for some reason.I've been on lexapro for a few months now and it seems to supress the pains, but not get rid of them, they also have been getting worse lately even on the medication.I do get pains when exercising and my heart feels like it's working overtime, which is different then alot of the other postings, but as another post said that could just me being worried i'll strain my heart.",
            "post_id": "4640614",
            "timestamp": "1247130422",
            "user_id": "user_769093",
            "user_link": "/personal_pages/user/769093",
            "votes": "0"
        },
        {
            "answer": "Seems like to me its anxiety not sure i am not a Doc but i have anxiety attacks and it seems like everyday i experience something new.Like now i have been having chest pains but i am just thinking its nothing bad its just anxiety I have gotten chest x rays- Cat scan blood work everything..",
            "post_id": "4750216",
            "timestamp": "1249867712",
            "user_id": "user_955560",
            "user_link": "/personal_pages/user/955560",
            "votes": "0"
        },
        {
            "answer": "I have had this feeling for a couple of weeks now and its scaring the s*** out of me! i just wish it would go away! x",
            "post_id": "4791144",
            "timestamp": "1250845214",
            "user_id": "user_1012027",
            "user_link": "/personal_pages/user/1012027",
            "votes": "0"
        },
        {
            "answer": "i have anxiaty problems for over 5 years now. i am 29.  i get chest painsjust over my heart, racing heart, pains in my arms, neck you name it exspecially when i am about to fall asleep and then im up all night paceing the floors waiting for my heart to stop.  have had every check there is done to me with no problems found.  i just recently check into the emergency room to find out nothing is wrong with me even though my blood pressure was around 198/90.  ever thing went back to normal when they told me the ekg was normal.  this **** *****. i just had a eco and stress test done last week and every thing again was fine.  i wish they would find something wrong with me so i could have an explaination why this happens to me.  i have been told its stress which it probley just is. i have been on all this pills, paxil, lexarpo, xanax, and one i have forgotton,   looks like i have to go back to them and probabley stay on them this time no matter how they make me feel or side effects they have. i have tried working out and staying busy and it works sometimes, but not always.   nice to read that im not the only one with the problems. good luck everyone",
            "post_id": "4917878",
            "timestamp": "1254148926",
            "user_id": "user_1055468",
            "user_link": "/personal_pages/user/1055468",
            "votes": "0"
        },
        {
            "answer": "i've had panic and anxiety since i was in 4th grade. it manifests itself in many different ways over the years. important thing to remember is that it will pass and you arent dying...even though it really does feel like it. it isnt pleasant, but there are many ways you can calm it down so it doesn't snowball into a huge event. i tried lucinda bassett's attacking anxiety and depression program and it gave sooo many helpful tips and tools. medication isn't part of this program, although she doesn't knock it. she gives you self-tools on how to live and handle things. it's an ongoing battle, but there are things you can do to help yourself and manage your thinking. this doesn't have to run your life! beat it. :)",
            "post_id": "4972015",
            "timestamp": "1255470724",
            "user_id": "user_1072636",
            "user_link": "/personal_pages/user/1072636",
            "votes": "0"
        },
        {
            "answer": "I have been having weird arm pains for almost a year. I first noticed last year that my left arm would ache after I would smoke a cigarette. It wouldn't happen all the time but it has continued to happen. Over the last few weeks it has gotten so much worse. I've had EKG's this year with a physical and they \"say\" my heart is fine. But I'm not convinced. I also have really sharp pains on the left side of my chest but am not sure of it's origination (rib cage/intercostal muscles, breast pain, or cardio issues). I am currently trying to stop smoking since it is such a horrible thing to do anyway but it is a very hard (14 year) habit to break. I have been on anti-depressants because of anxiety and Panic Attacks for 3 years. Zoloft worked for the 1st two years and then I had to switch to Lexapro this last April because the Zoloft turned on me. Now after 6 months on the Lexapro I have weaned myself off of the anti-depressants all together. I am struggling but really only have the worst anxiety at night. I have had horrible insomnia since May and stay up til the wee hours of the morning and sleep most of the day. I lay in bed at night in fear that I'm gonna have a heart attack because of the various aches and pains in my chest, arm, stomach, etc. It's the most frustrating thing in the world! I feel better at times by reading other peoples posts but find it hard to believe that so many people suffer from the same experiences with no real answers other than \"it's anxiety\". I recently started seeing a Psychiatrist and I am just not sure it's worth my time or money. I got Mirtazapine first. I took that for 1 night and was \"stoned\" for 24 hours. I slept like a baby and did not experience the somatic issues (i.e. aches and pains, racing thoughts) that I normally feel from the anxiety at night but the next day I was in a stoned stupor and could not function as well as I needed to. Next I was given Klonipin. Told to start out on a very small dose (1/8 of a mg) as I am very sensitive to all drugs. All this seemed to do was give me more anxiety and heart palpatations and faster heart beat. Called my psych to tell her what happened with that drug and she has not returned my calls. So I feel completely uncompelled to up the dosage to 1/4 mg. Psychiatrists are so flakey! Or at least mine is. She completely missed the 2nd appointment that we had scheduled. Now if I had missed the appointment I would have been charged for a full session. Where's my compensation?? So at 30 years old I am terrified of medications, terrified of my heart giving out from all the years of strain I have done to it with alcohol and cigarettes, and can't sleep. This is not a way to live. I have quit drinking (except for maybe 2 drinks at the most -- once a month), tried to cut out MSG and aspertame (as this can affect my anxiety), no caffiene, and just trying to eat better in general and taking supplements (albizzia calm, omega 3-6-9 oils, magnesiem)-- which seem to be helping but a very slow process as I introduce them each individually (next is a B-complex) and slowly to see what works best. I've also started acupuncture and continuing to see my wonderful chiropractor for the pains that I experience (which ironically there is aways something out of alignment that can explain the pains I'm experiencing). I just want to say that no matter how debilitating it can be, I think there's hope, you just have to find what works best for you. As time passes, I have had to change with it because what worked for the first few years (zoloft and talk therapy), is not working now. It seems that the anxiety evolves in my body and takes on different forms over time. I'm getting a referral to a cardiologist to put my mind at ease, hopefully once and for all. Then I'm ready to find my next step. I'm just ready to live again and stop living in fear that I'm going to drop dead any freakin' minute. Stay strong people and BELIEVE in yourself!",
            "post_id": "5004396",
            "timestamp": "1256276686",
            "user_id": "user_1083342",
            "user_link": "/personal_pages/user/1083342",
            "votes": "0"
        },
        {
            "answer": "I've been suffering depression and anxiety for as long as I can remember, probably even as a young child (3 or 4 years of age). My symptoms have recently become more pronounced as I started university and work etc.Anxiety chest pains have been a big thing for me, and they've been getting increasingly worse over the last few months (pain over my heart area, pain in my neck and then up and down my left arm.. tingling, weakness) needless to say, I freak out every time I have one of these episodes and think that it's the big one.. that I'm having a heart attack and will be dying shortly. I've been to numerous doctors and have had blood tests, ECGs, you name it. Each time, tests come back with nothing. My doctor has even said that my heart is \"perfect\". I can accept that all these symptoms are anxiety related but the train of thought that develops in my head when I experience one of these episodes is debilitating and frightening.Anyway, just wanted to share my experience on this forum. It is comforting to know that I'm not the only one out there experiencing these symptoms.I am seeking help with ongoing counselling as well as looking up resources on the net. I work hard every day to stay positive, keep fit and to \"untwist my thinking\" and stop obsessing about my health. It's tough! But I'd say most days are manageable, some days are great, other days are bad.Keep positive people and don't give up learning new strategies and take it easy on ourselves, never think that you're a failure and that you'll be living with this condition forever. You just gotta pick yourself up and keep at it.",
            "post_id": "5005321",
            "timestamp": "1256309129",
            "user_id": "user_1083650",
            "user_link": "/personal_pages/user/1083650",
            "votes": "0"
        },
        {
            "answer": "Hi.I'm a 21 year old girl and ever since I moved a decent amount of furniture in late September, I've been having, more aches than pains in my left arm, left side of my back and chest. I went to the doctors in early October and to be honest, he made me feel worse.He said basically, do something to get over it and forget about it. Not to mention bringing me to tears. I'd been having crying tendencies a few days before and on the day of the doctors visit.Somewhere in his little speech, he attempt to reassure me 21 years olds don't have heart attacks. He said the aches were probably muscular due to what I had been doing a couple of weeks previously.The aches did fade away and I had no problems however, over the past few days they have returned and I feel they are worse than the previous bout.Especially in the nights. I really cannot sleep with the fear of not waking up in the morning.An example: last night, I was up going to the loo, vomitting and when I returned to bed I started shivering. I was literally jumping from being cold, whilst the arm and chest aches worsened - sometimes it felt like pain. I just did not want to sleep.This morning I still have the aches alot, including my back and I was sick again.I am trying to understand that it's all in my head but with the constant ache in the worst possible places it's hard to do.It's horrible, and making me cry.I would return to the doctors but we can't choose who we see so I'd likely see him for a second time.And I just don't know what to do. I don't think I can take it.",
            "post_id": "5064041",
            "timestamp": "1257855478",
            "user_id": "user_1103025",
            "user_link": "/personal_pages/user/1103025",
            "votes": "0"
        },
        {
            "answer": "Do you suffer from any Back injuries at all?I have these same pains and they are both due to anxiety and a Back Injury.Here a Picture of my MRI. Where you see the disk poking out, The nerves in that area go straight to you chest and can cause symptoms of Heart attacks just like anxiety can. Its Super crappy and I can wait to get this fixed and I prey that this is whats causing my anxiety this time around, But I guess I'll never know untill I have the disks replaced and see if my problems go away.MRI Picture: http://img.photobucket.com/albums/v118/Buffalony/Shawn/DSCF1852.jpg[IMG]http://img.photobucket.com/albums/v118/Buffalony/Shawn/DSCF1852.jpg[/IMG]",
            "post_id": "5232715",
            "timestamp": "1262637049",
            "user_id": "user_1151955",
            "user_link": "/personal_pages/user/1151955",
            "votes": "0"
        },
        {
            "answer": "All of these posts were really helpful! I feel like the only one in the world who has these problems and doubting doctors, etc. I have been through so much in the past half a year with these weird chest pains. They manifest themselves in different ways and are very scary! Sometimes they feel like horrible cramps over my heart that make me almost feel faint or sick to my stomach. I quit my job when this happened to me at work, and left for the ER. They did an EKG (which I had already had done and was normal) and a chest x-ray. Normal again. They sent me to a gastrologist and they thought it was my gall bladder. I then had my gall bladder taken out (which caused wayy more anxiety as one can imagine!) and now taht its been out for 6 weeks the pain has returned. I noticed that this pain originially started this summer when I was having bad panic attacks over a hard college course. But the pains in my chest don't happen DURING the attacks, they randomly come on later, sometimes even a day later. I feel like it has to be anxiety, but like many of you have said, its impossible to convince my brain of this. I keep thinking theyre not finding something, but I am only 22 and 112 pounds and try to work out as much as possible. I feel like if I had heart problems i would fall over and die when I work out. I still want to go to a Cardiologist just to rule out everything even though Ive had EKG's. This problem has also made me slightly agorophobic. Like Im afriad to go out and go to parties because Im afraid the pain will strike! This is sad that Im a college student and can't even let myself have fun! I want to live again and all of this has caused me to be grumpy all the time and sad and cry. I think I've developed mild depression. Sorry this is so long! Feel free to input, anyone.",
            "post_id": "5233312",
            "timestamp": "1262647119",
            "user_id": "user_1059996",
            "user_link": "/personal_pages/user/1059996",
            "votes": "0"
        },
        {
            "answer": "My husband, i think has a very high anxiety level, which i am not sure of, but tends to lead to several health problems, I sometimes wonder if the health problems come from anxiety, and they are as follows : prostatis, nasal infections, post nasal drip, chest pain, arm pain, shortness of breath, heel pain, leg pain, sleeplesness, mood swings, headaches, backaches i think this list can go on and on,,it is for this reason i have decided to stay at home and not work, as it does relieve some of the everyday stresses.  He has seen several doctors, has taken anti anxiety medication,,antibiotics, several nasal rinses, nasal sprays and that list can go on and on as well.. I have tried several teas with him, steams, baths, i have no idea of what else to do !  At times i get frustrated of not being able to do anything for him... Any suggestions please????",
            "post_id": "5242545",
            "timestamp": "1262872670",
            "user_id": "user_1163335",
            "user_link": "/personal_pages/user/1163335",
            "votes": "0"
        },
        {
            "answer": "Guys, I am also going through the similar problems.I am 29 year old My symptoms are listed below1. Pain in left side of chest2. Spreading to Left hand, shoulders.3. GERD4. Hiatal HerniaNow I believe GERD & Hiatal Hernia together cause Anxiety ( 95% of case ). I excercise a lot which includes body buidling. I have been to cardiologist & have done ECG and Echo however I cleared all test. Now I very strongly believe all those people who suffered from anxiety always follow below mentioned activity - :1. Drinking milk before sleep.2. Not much gap between dinner & Sleep.3. Heavy Excercise.4. Sleeping less then 7 hours.5. Stress in Work.Please correct me if I am wrong anywhere or If you guys disagree with me.Messiah",
            "post_id": "5369487",
            "timestamp": "1265997602",
            "user_id": "user_1210056",
            "user_link": "/personal_pages/user/1210056",
            "votes": "0"
        },
        {
            "answer": "I came across these postings while trying to research my symptoms like I do every time I am experiencing something with my body that is freaking me out. Usually what I find makes me feel worse and terrified and I end up making a trip to the ER, but this time after reading this I am definitely feeling a lot better!! I have been having the exact same problem with chest and arm pains for about a month now and as much as I feel so bad others have to experience it, it comforts me to know I'm not the only one. I have a history of anxiety starting from when I was 15. I was on antidepressants for a couple years and was slowly weened off with the help of a therapist. My anxiety was under control for a long while there and I even managed a stressful 3 years of university with no problems. Currently 21 and in my 4th and graduating year I feel like I have been experiencing a lot more stress lately.My chest pains started about a month ago on the left side of my chest as sharp stabbing pains. Not extremely painful but very irritating. I was also experiencing heart flutters, skipped beats and palpitations a lot more often than normal. The pain immediately made me anxious but I managed to ignore it for a week hoping it would disappear. Finally the discomfort got to me too much and I decided to go to the ER. I had all the typical tests for these problems, EKG, xray, bloodwork etc and everything came out fine other than that I have a mild irregular heartbeat which is apparently not dangerous. The doctor told me that the chest pain was probably an inflamed membrane or cartilage in my chest and told me to take ibuprofen for the pain. With the pain in my left side continuing intermittently for another week after this I was not convinced at all that I was ok.I was at work one night (serving at a restaurant) and the pain became so bad that I had to ask my manager if i could sit down and rest for a minute. Instead of the sharp stabbing in the left side that I was used to, this pain was in the center of my chest and was more of a severe burning aching feeling right over my heart. I was terrified I was having a heart attack and had to leave work to go to the hospital. The doctor monitored my heart rate and blood pressure for a few hours but refused to do more tests since he said they did so many the first time I was there. Again I was told everything was fine and that the pain was an injury and the rest was anxiety and was sent home. The very next night the pain was so bad I couldn't sleep. I got out of bed about an hour after I had gotten in and noticed that both my neck and leg hurt and they were both swollen..this being a new symptom I immediately freaked out again thinking I had blood clots and went back to the hospital. I had the same doctor as the night before who agreed to do more blood work. Same thing...tests fine. The worst experience of my life was when this doctor tells me that it is all in my head!! He said that because I am a psychology student the things I am studying are getting to me and creating these symptoms. If you've experienced this you know it is not in your head!! The pain is very very real and very scary. I was so fed up with the health care system and insensitivity of the doctors I had seen I told myself i was going to ignore the pain from now on.I am very aware that a lot of my symptoms with chest tightness and heart racing are from my anxiety because I have experienced it before in my life but it is sooo hard to accept that anxiety can actually cause you physical pain!  Knowing that other people are feeling the same way is helping me trust more what the doctors have said. Recently the pain has continued and been right in the center with the burning feeling and sometimes on the left side with the sharp stabs. It has also been radiating through my shoulder neck and left arm and fingers. My arm has also felt weak and tingly. With my heart constantly racing and skipping beats it has made me afraid to exercise or really do anything that increases my heart rate because it feels like it will stop beating. I noticed many people saying that the pain goes away with exercise but I am definitely the opposite! My chest kills and tightens and makes it hard to breathe. Probably anxiety as someone else mentioned. It is very debilitating not feeling comfortable with exercise as I am normally a very active person. What really made me laugh was the post that said a person with a panic disorder will constantly stop and monitor their heart rate to make sure it is still beating properly. I do that at least twice a day!! I am really hoping that with this knowledge from all of you I can beat this! It is still very scary when I feel how real and physical the pain is and especially the weakness and pain in my left arm. It will definitely be a process to overcome it. Sorry about the long winded explanation it just feels very good to get this all out in the open! In fact my chest feels a lot less tight than it did 15 minutes ago when I began writing this. Thank you all for sharing your stories and feelings it has been very helpful to me.",
            "post_id": "5402833",
            "timestamp": "1266893993",
            "user_id": "user_1221941",
            "user_link": "/personal_pages/user/1221941",
            "votes": "0"
        },
        {
            "answer": "Hi,im 29 now and this horrible condition has been with me for the last 8 years. i think it's much worse than an actual physical ilness as it leaves you very lonely and misunderstood. im finding it very hard to deal with it lately, i had a good while of peace, however since last Sept i have been struffling through each and every day. everything suffers - my friedships, my ambitions, my relationship. all i think about is death and dying. the Sept episode which was a full night of really fast heart beat that had left me totally exhausted, was triggered by a story my boyfriend told me. a guy he knew, around my age, died of a cardiac arrest, at night, was found dead by his girlfriend. the same night i got my attack. the attack was followed by yet another series of doctro's appoitments. it was the third cardiologist, yet another GP, third stress test, third echo, holter and a two week heart monitor (not even mentioning the blood tests and ECGs - dont even know how many of these i had done).my symptoms? well, what dont i have? sharp pain in my chest - the middle, under my left armpit, stabbing pain, coming and going, lasting days, weeks, etc., dizziness, weakness, almost fainting feeling, this weird unreal feeling, as if im going crazy - i call it wooly head feeling, also palpitations, missed beats, flutters, tingly feling all around my body, pins and needles on my face, around my head, breathlessness, and this constant fear that something bad is going to happen to me, that im going to dir, if not from a heart attack, then definately - that's my new fear - stroke, blood clot or somethingits mad because i see the pattern, i realise that when something is disproven - like the heart problem after the most recent cardiologist - then im finding something else.....and when it happened to me for the very first time - i managed to get rid of it for a very long time by exercising, but only recently i found out that the rule is - real heart problems - pain when exercising - since then - well you probably quessed now, ive pain after exercising and there's nobody in the whole big world that could convince me im fine its crazy so crazyin therapy and exercising regardless, im a true believer in the power of exerscing - it will pay off eventually, it just has to - but im refusing to take drugs, my granny's addicted to some stuuf and i dont want to end up like her (this bloody thing is the the family)i also wonder is it hereditory? and what is it really? some chemical imbalance in the brain? and is that enough or do we need special circumstances too? it's such a horrible diseases - it affects you physically and mentally and you become so self obsessed - when you the symptom, nothing else matters (and why would it?! you are convinced you're going to die shortly, what can be more important? im not being sarcastic, i know how it feels to be convinced you're dying, i feel it every second day or so! does anyone believe us? can they believe us? they cant experience it so they cant believe us - just like they cant feel how a diabetics feel when they're low on sugar) - the only thing is that we are not dying and when you look at it from this perspective - well then - this whole self involvent and self obsession is not really justified - it's just that there's no easy fix, eating a bar of chocolate will help a diabetic instantly - it wont help us and that's the curse of this condition, no easy fix, no easy answers.......it's like we should know the reason first - maybe then we'll find the cure?sorry for babbling ive had a very bad few monthsAggie",
            "post_id": "5405568",
            "timestamp": "1266957488",
            "user_id": "user_1222867",
            "user_link": "/personal_pages/user/1222867",
            "votes": "0"
        },
        {
            "answer": "hi all. i recently started having simaler pains as to what is described on here a couple of weeks ago. i am 30 yrs old and pretty healthy i guess. the first time it happened i thought i was gonna die it was so bad. since then i have had all the usual tests ecg/bloods/ chest x-ray and all are normal. a couple of days ago i went to see a different doctor and he reckons i had anxiety and prescribed me beta blocker atenolol in a low dose. it has done nothing yet as only been a couple of days but since i read through all the posts on this forum i feel a lot better already. i found myself laughing along at some of the stories realising that it is all in the head and that ill be fine. what i dont understand is why it started in the 1st place after 30 yrs of my life. anyway it has been very reasurring reading these posts and hopefully i can train my brain to realise every little ache or pain is not going to kill me. not just yet anyway. lets hope we can all conquer this condition in our own ways and live long and happy lives. regards jon",
            "post_id": "5482816",
            "timestamp": "1268945603",
            "user_id": "user_1250323",
            "user_link": "/personal_pages/user/1250323",
            "votes": "0"
        },
        {
            "answer": "Feeling the exact same way as described in the above comments, I definitely feel it's combination of muscle pain, like a trapped nerve or something in that vein( pardon the pun) and aniexty and most likely feeding each other! I'm actually trying to get sleep right now, reading these comments is actually quite therputic, even made me smile, Browsing med boards on an iPhone at 3 in the morning...best thing you can do somtimes is laugh about!",
            "post_id": "5499837",
            "timestamp": "1269400914",
            "user_id": "user_1256336",
            "user_link": "/personal_pages/user/1256336",
            "votes": "0"
        },
        {
            "answer": "Yeah it's nice to see that People all over the world share the same things as we all do. I love it when i read these and say to myself, \"Thats exactly what I feel like\". It has helped me in the past and thankfully \"Right Now\" I have a lil control on this. but it's not always forever.",
            "post_id": "5499862",
            "timestamp": "1269401512",
            "user_id": "user_1151955",
            "user_link": "/personal_pages/user/1151955",
            "votes": "0"
        },
        {
            "answer": "you know i have been having chest pains today too but it is just the anxiety thats what everyone tells me even the doctors. its hard to believe it but its true.Anxiety ***** i feel for you.",
            "post_id": "5500470",
            "timestamp": "1269429280",
            "user_id": "user_1256591",
            "user_link": "/personal_pages/user/1256591",
            "votes": "0"
        },
        {
            "answer": "I have been having aches in my right arm, nearly constantly (but different feelings and different parts of my arm) for over 3 weeks now.  I am on Prozac for anxiety, because I have had a wide array of symptoms over the past few months (increased heart rate, chest pain, light headed, the whole deal).  I am actually on 18 years old, and this is simply driving me crazy.  I have had two benign bone cysts in my right humerus already, and had both of them surgically removed.  However, now with something happening to my arm I keep thinking I have bone cancer.  This pain can be as high as the shoulder, and as low as the forearm.  It radiates from point to point, and isn't terribly bad pain, but it is very much an annoyance...this is all just really frustrating.  I have been to the doctor so many times recently that I just can't bring myself to go back and see her.  It's rough out there...good luck everyone.",
            "post_id": "5502302",
            "timestamp": "1269463370",
            "user_id": "user_1221537",
            "user_link": "/personal_pages/user/1221537",
            "votes": "0"
        },
        {
            "answer": "i can't believe i found this site and i can't tell you how relieved i am that i did...i never really gave much credence to \"anxiety\" i used to think it  was a condition reserved for the wealthy, justifying expensive visits to an analyst.  last year i experienced my first \" heart attack.\" i had all the classic symptoms, chest pain, pain and numbness in my left arm, tingling in my fingers and toes, light-headedness,etc. i went to the er where they did all the necessary tests. they found no signs of a heart attack, prescribed protonix, an acid inhibitor and told me to see my dr. after several visits to my pcp and a heart specialist who performed a chemical stress test and had me wear a 24-hour monitor, i was told that i was fine but that i may have had an \"episode.\" i have had several more since but they never culminated in the \"big one.\" this past week, i have experienced a kind of weight on my chest, pain beneath the shoulder blades  and extreme fatigue. apparently, like the rest of you, the symptoms vary in type and intensity. like you, i figure \"damn, if this is a heart problem, it shoulda killed me  by now.\" i want to stop all the pills and dr visits and  resume my exercise program but i'm a little apprehensive.whatta you guys think?oh, maybe i should qualify this...i'm 70, last year was one of the most stressful in my life, there's never been a history of heart disease in my family and one thing i've learned so far from all this is when i go to the er with my symptoms they see me in a hurry....",
            "post_id": "5607071",
            "timestamp": "1272077701",
            "user_id": "user_1285912",
            "user_link": "/personal_pages/user/1285912",
            "votes": "0"
        },
        {
            "answer": "I am 36 year old healthy man. I exercise regularly and I am not overweight. About 3 months ago I had a panic attack. I felt a loss of control and thought I was going to pass out. I was having a very stressful week. My wife is pregnant and she was spotting(she and the babies are fine), my brother went to the emergency room(he is fine) and work is always very stressful. I am in senior management position and have alot of responsilbilities which can get to me. Since that day I have tightness in my chest on and off and pain in my left arm. I went to many different doctors for EKG's and stress test and they said I am very healthy so must be stress. I thought after getting a clean bill of health I would feel better but I still have anxiety pretty regularly. They put me on 10mg of paxil which I do not believe is doing anything and I am speaking to someone now as well. My doctor wants to be me on 10mg of Lexapro instead of Paxil. What is everyone's thoughts on that? What about vitamin B complex and B12? Of course when I exercise or I am completely distracted I feel fine but if I have time to think I get anxiety.It does make me feel good hearing so many people going through what I am going through but I it doesn't help when I am going through an anxiety attack. I just want to get control back of my life especially that I am going to be a father soon too. Any advise would be greatly appreciated.",
            "post_id": "5615707",
            "timestamp": "1272315003",
            "user_id": "user_1293515",
            "user_link": "/personal_pages/user/1293515",
            "votes": "0"
        },
        {
            "answer": "Hey I posted earlier a couple months back when I was experiencing all kinds of chest and left arm pain. I do have a fast heart rate and get PVCs as well, but the docs try to convince me that I'm fine. Basically it causes me all sorts of anxiety when I think about what could possibly be wrong with my heart and if it is going to hurt me. This makes the pains worse and it turns into a horrible cycle.Anyway I wanted to let you know that I started on Cipralex about a month ago which is basically the same as Lexapro, they're both escitalopram. It has worked wonders for me. I still get anxious thoughts but it has been a while since I have had the pains and the bodily symptoms that i struggled with for months. It is worth a try! I have also started taking B12 vitamins (because I was found to be a bit low on it), so I don't know if that has helped me as well or if its just the meds, but it couldn't hurt. I know the feeling of being stuck in that dark hole, like there is no escape. But there is, and you WILL feel better eventually. Good luck with everything!",
            "post_id": "5629338",
            "timestamp": "1272599651",
            "user_id": "user_1221941",
            "user_link": "/personal_pages/user/1221941",
            "votes": "0"
        },
        {
            "answer": "i have the same thing but most of the time my pain is under the right breast right shouder,neck right arm...face pain head ache..sometime i wake up and it son the left side..i dont get it..my heart dr says other than my miniamal smalll vessell ischemia my heart is finetons of test oveer the years but the last too i anm worse than i have ever been to where my ***** even though i have so much to be happy for i have anxiety for 20 yeras and refractory depression..dr trying new meds sinced march...i see him in may and then he retires and i dont know what i will do",
            "post_id": "5637862",
            "timestamp": "1272845160",
            "user_id": "user_605581",
            "user_link": "/personal_pages/user/605581",
            "votes": "0"
        },
        {
            "answer": "i been getting axciety over a dumb test that u have to wait 3 months which i really shounld not be getting pain in right arm worried for nothing can do almost any thing to ur body pain where legs arms looks like ur arm is getting smaller which its still the same arm this can cause any thing butter flies in stomach which makes u like not want to do any thing excerses does that the pain away for the time being but the second u sit in a chair and thinck it over again about what ur thinck ing there its back u have to change ur mind and i dont belive meds are the way out its simply takeing ur time deal with the time u have to wait for some thing gay which they just scary people over nothing to be honest wish i  never read up on any thing because i know more then a docters in my area now to be honest i dont know how a docter can be a docter its scary when i really thing of all the things out there in life i really dont want to know any more then what i do all just because a yeast infection",
            "post_id": "6006119",
            "timestamp": "1281324491",
            "user_id": "user_1378594",
            "user_link": "/personal_pages/user/1378594",
            "votes": "0"
        },
        {
            "answer": "pills are not the way out u are not ur self and u never will be once u hooked ur hooked for life dont get caught up in pills it can be good at first but when it gets rough a little bam ur way over ur head so bad it dont mbot ake any sense of all best thing is slowly get off the pills if ur on because u will not be ur self for ever be ur self not a robot or be in a dream",
            "post_id": "6006141",
            "timestamp": "1281325131",
            "user_id": "user_1378594",
            "user_link": "/personal_pages/user/1378594",
            "votes": "0"
        },
        {
            "answer": "me again best thing to do is start going to church and belive u can do it and u will belive in power i never did before do not belive in pills do the right thing in ur live come out of it before its to late with these pills its a money game dont be fooled be ur self be tough take it as strong as u can go come off those pills before its to late in ur life they work at times dont get me wrong but when some thing bad happens bam u 100 times worst condtion then u wounld be with out the pillTRY AND BE UR SELF NOT A ZOMBIE",
            "post_id": "6006168",
            "timestamp": "1281325887",
            "user_id": "user_1378594",
            "user_link": "/personal_pages/user/1378594",
            "votes": "0"
        },
        {
            "answer": "WOW WOW I suffer from all thesame thingsprettymuch...  left arm pain, neck pain, chest pains, chest tightness , sharp pains around heart.. and It scares me all the time.. I am now in my 3 month of having these symptoms or attacks.... been told its anxiety also... I take lorazapem and it does the job for a little bit, and then a few hours later im in pain again and freaking out thinking its my heart.. ive had several ekgs done, have had stress echo test done, and a few other hear test also... all came out clear.. I am living in fear.. I hate being alone cause I get scared.. I hate goin out in public cause i get nervous and anxious just thinking bad stuff will happena nd ill have ana attack... its so miserable... i have yet to find a remedy to calm myself or slow it down... and each month or day it gets worse... so if any one has any other ideas than already suggested , please send them my way.. add me as your friend, all of you if you want.. so we can fite this together... it is so comforting reading all these post, knowing im not alone... i thank you all.. and we can fite this crapo together",
            "post_id": "6044095",
            "timestamp": "1282194899",
            "user_id": "user_1384357",
            "user_link": "/personal_pages/user/1384357",
            "votes": "0"
        },
        {
            "answer": "I feel exactly the same! i was told everything is okay with my heart and had blood tests and everything but that still doesnt put my mind at rest, i think it must be something in our minds! i have been up all night worrying, really getting the best of me, i feel relieved that i am not alone but how can we beat it?! Take care Rhiannon",
            "post_id": "6112676",
            "timestamp": "1283829633",
            "user_id": "user_1437806",
            "user_link": "/personal_pages/user/1437806",
            "votes": "0"
        },
        {
            "answer": "I am a 30 year old female. I have three kids under 4years of age and own my own daycare. Stress is something that is so hard for me to get away from. I have been on and off of zoloft ever since I had my first child. The docs diagnosed me with Post Pardum. I am currently on zoloft. The last few months have been really stressful dealing with income issues and we had our house broken into while we were home at night. I have had chest pains for awhile but lately I  have been having really bad pain in my left arm. I keep worrying that I am having a heart attact and I am going to die. I have had an ekg at my doctors office and went to the ER on night and they ran a whole bunch of test on my heart. My Doctor says that this is all from anxiety and that I probally have post tramadic stress disorder from the break in. I just cant stop feeling as if I am going to die and not be here for my kids. I wish I could just get over this. It is so reassuring to hear that others are suffering with the same things. I just dont understand why the stress would cause my left aarm to hurt. Thanks for listening!!",
            "post_id": "6404142",
            "timestamp": "1291073661",
            "user_id": "user_1520713",
            "user_link": "/personal_pages/user/1520713",
            "votes": "0"
        },
        {
            "answer": "Thanks for helping me not feel alone.  I started having chest pains and feelings of doom two months ago.  I put off going to the doctor for a few weeks until things got really bad.  He instantly asked if I had ever been diagnosed with anxiety issues.  After a weekend heart monitor and blood tests nothing turned up.  So anxiety it was.  I just got married and have been dealing with some normal life stuff but nothing to crazy.  I'm a laid back 35 year old who is in good shape with no past anxiety issues. SO WHY NOW?  That is the most confusing part, my life was really starting to take shape after years of trying to find myself.  I'm so afraid this is going to affect my marriage and the future.  I was prescribed xanax and it definitely helps.  I usually take a 1/2 0.125mg tablet in the morning and nite.  I try everyday not to take it but the anxiety is pretty constant so it is hard.  I will try the B vitamin.  Any other recommendations are much appreciated.  May we all be able to get our lifes back on track.",
            "post_id": "6776555",
            "timestamp": "1301358771",
            "user_id": "user_1648080",
            "user_link": "/personal_pages/user/1648080",
            "votes": "0"
        },
        {
            "answer": "I have just recently started experiencing constant chest pains a little left of center where my heart is. Its constant now for a couple days and is always there. Its not debilitating though, just a little worrying. I dont feel it all the time but when I move or get in a certain position it is there. Ive always had heart palpatations infrequently in the past but doctors have dismissed them. The palpatations hardly ever happen but they seem to have been occuring more frequently since this chest pain. Anxiety from the chest pain causing them? I thought maybe I bruised my sternum somehow, because the pain does not go away. I am 34 years 6\"8' and I weigh about 190 and am in pretty good shape so I dont think it could be weight related but who knows. Guess I will play this one out for a few days and see what happens",
            "post_id": "6802441",
            "timestamp": "1302117685",
            "user_id": "user_1656010",
            "user_link": "/personal_pages/user/1656010",
            "votes": "0"
        },
        {
            "answer": "hello",
            "post_id": "6848024",
            "timestamp": "1303496803",
            "user_id": "user_1419623",
            "user_link": "/personal_pages/user/1419623",
            "votes": "0"
        },
        {
            "answer": "Sorry about the last hello pressed reply by accident lol.I have just finished having a stress test, ecg, echo and cardiac MRI. Apparently my heart is \"normal\" and i have been told to resume my gym work. I did a little bit of work and that night my heart started racing again in the middle of the night, so as you can imagine I stopped again straight away. I went back to the dr and was told there was nothing more he could do and my heart is fine. I take 40mg of propranol a day which i have taken for 11 years for palpitations (my dr scared the life out of me by asking me why had i been on them so long as they cause heart failure! - ah!!!) I also take 15mg of escitralpam a day. My syptoms came on big time when i reduced both my tablets last summer and even tho i have been back to my normal dosage since oct i still suffer from chest pains and arm pains. i dont know whether to up my escitralapram to the max dose of 20mg? my worry is where do i go after that? I am on 2 axiety related drugs and still gettting scary pains in the chest and arms. It controls my life and feel trapped by it. I worry like mad when the pains come and often wake up the them in the morning. No one understands and my partner is great but i can tell he is getting fed up with it. I dont know who to ask for help? I need to find out about this axiety but where do u start?. By the way if anyone lives near Lincoln in the uk and wants to start a group to meet up and discuss and support each other i would be",
            "post_id": "6848050",
            "timestamp": "1303497526",
            "user_id": "user_1419623",
            "user_link": "/personal_pages/user/1419623",
            "votes": "0"
        },
        {
            "answer": "Hello all, My friend was told about 20 years ago that stomach problem can cause anxiety and panic disorders which lead to heart palpatations and such. It may all be tied to your stomach. You could try eliminating the stomach problems and maybe the rest of the symptoms will go away like my friend. from my understanding there are 2 types of Gerd problems. not enough stomach acid or too much. Personally, i like to use natural remedies to avoid other symptoms due to side effects but that is totally your call. if it is not enough acid then you could try apple cider vineger or pickles and see if that helps. if it gets worse then it would be too much acid and there are natural ways to take care of that too. Alot of it is life style changes that all of us have problems doing and  i believe most doctors will state that but they know that most of us will not take that advise so they give us stomach meds which can help relieve the too much acid problem because they block some of the acid that your stomach makes. BUT..... if they are used for a long duration, it could cause worse things to happen because your body uses that acid to help in the digestive department and you could start to lose valuable nutrient that you get from food and are more likely to develope other problems like osteoperousis and etc. So personally, I perfer lifestyle change along with some help from some natural herbs that you can find at local back to nature shops. yes anxiety can cause all sorts of pains in all sorts of places but what causes the anxiety. Maybe the stomach? What causes the stomach problems? Maybe lifestyle? maybe food alergy or intolorence? If we figure out the root cause maybe we'll fix all of it.",
            "post_id": "6848130",
            "timestamp": "1303499445",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "Ive also heard that for men, if you have highblood preasure, fatigue and anxiety it could be from low testostron levels. i'm not a doctor but maybe women would have some of those same problems if their estrogen level were low? just a guess though, like i said im not a doctor but i do ponder on these things.",
            "post_id": "6848151",
            "timestamp": "1303499940",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "I hope i didn't scare anyone with the last statements about stomach problems. I definetly know how anxiety will take over the thought process but i just thought that made more sinse for me at least because i don't have any real stress other than the anxiety itself so, to me, it doesnt make sinse that i would just have anxiety for no reason. There has to be something that triggers it. I understand that not everybody is the same but sinse ive changed my thought process with lots and lots of praying, im starting to see the culprit. My stomach is causing this and you know how i can tell? because i'm treating my stomach problems and it is elimenating my other symptoms. I know, right? I have been thinking i'm dieing of a heart attack, blood clot, stroke, brain tumors, cancer, and what ever else you could possibly imagine and i have been over looking the real problem right along with the doctors this whole time. I dont know if it is actually acid reflux, gallbladder or what that is causing it but it is definetly coming from my stomach when i started having an attack i treated it like a stomach problem and it subsided. who would have thought that some stomach acid could cause you to feel like you are having a heart attack or cant catch your breath or heart palpatations and nearly fainting.  DO me a favor and go to one of these Gerd forums and read those peoples symptoms and see just how close they are to yours. You can even hear the anxiety pooring out of them. We are the same people. I over looked it because i thought evrybody had a litlle heartburn now and then so i didnt pay any attention to that part of it. i was to caught up in dieing to realize this and when i finally did have my own answer it helped my mind quit racing too. I cant say that i dont still think about things but i stick to the stomach and it is working out pretty well.",
            "post_id": "6857204",
            "timestamp": "1303828048",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "BigPicture...there are a lot of medical conditions which mimic the symptoms of anxiety, which is why we suggest that people first experiencing anxiety have a thorough medical work-up to rule out a medical cause.There are also a lot of concurrent medical issues (like GERD) that can exacerbate or trigger anxious feeling based on the medical condition causing similar symptoms.  These conditions don't CAUSE anxiety, but rather trigger it.  Certainly getting something like GERD under control is not only adviseable for health reasons, but also to help with overall comfort and well being.",
            "post_id": "6857296",
            "timestamp": "1303830242",
            "user_id": "user_480448",
            "user_link": "/personal_pages/user/480448",
            "votes": "0"
        },
        {
            "answer": "I certainly understand that not everyone is the same and i stated that. I was only stating what works for me and hoping it would help someone else and also, A trigger is not a cause? My understanding of a trigger is something that causes it to happen. That would be a culprit to me but i guess everyone has there opinion on things. I see that you have said there are alot of conditions that mimic anxiety? I respectfully disagree. I would say there are alot of conditions that would cause or trigger anxiety but we can agree to disagree if you like. I am happy to say that i have been able to live anxiety free without anxiety medication though and i suffered with it  for nearly ten years or more, So for some people it might be in there best interest to look into this. Can we agree on that?",
            "post_id": "6857823",
            "timestamp": "1303842217",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "By conditions that mimic anxiety, I mean things like thyroid disorders, other hormone imbalances, diabetes, etc.  These conditions can actually mimic panic attacks, when in reality, it is the symptoms of these diseases that are causing those same sensations.\"Trigger\" and \"cause\" may be similar in some respects, I agree.  When speaking of \"cause\", I was thinking more along the lines of the many professional speculations as to how anxiety disorders originate.  There is believed to be a genetic component, possible chemical imbalances, and so on.I'm glad you found some answers for yourself.  I think if there is any kind of connection between something like GERD and anxiety, it would be the uncomfortable symptoms that create anxiousness, and once that anxious cycle of thinking starts....it becomes hard to stop.  Just like a person with panic attacks aren't actually fearful of the grocery store they HAD a scary attack in, but rather, they fear the sensations and begin to relate those symptoms with the store itself.  Hopefully you get what I mean, it's a bit hard to explain.I just don't want anxious people reading this to think that their GERD (which is a very prevalent issue for many) is the \"cause\" of their anxiety and therefore forego important treatment to address the anxiety itself.  Certainly if someone has GERD, it should be treated.Anyway, thanks for sharing your experiences and I'm glad you found relief!",
            "post_id": "6857978",
            "timestamp": "1303845998",
            "user_id": "user_480448",
            "user_link": "/personal_pages/user/480448",
            "votes": "0"
        },
        {
            "answer": "It is definetly important to control the anxiety. I myself had to take medication for years. I did not mean to come across as someone who is totally against medication but i also know that the medical field is a practice and does not always no the cause or triggers therefore not always diagnosing it correctly. For me, it helped to pinpoint it to one certain thing instead of 100 different things like all the what if's that run through our heads. Like am i having a heart attack? no it's the gerd. do i have  cancer? no it's the gerd. do you see how that helped with my anxiety? i did not have all thoughs what if's anymore. i had one culprit i could blame it on and that in itself eased my anxiety even if i was wrong, i was right. I know this might not apply to everyone because we are not all the same but by establishing the thought that anxiety is a disease all in itself rather than a symptom of something else tends to strengthen it's authority in our lives, \"At least for me\", but maybe that helps some people and if it helps then do what you must.  I somewhat agree with the chemical imbalance theory because that is exactly what is happening with Gerd. our body is either making to much acid or not enough therefore throwing the body out of sinc. The heraditary theory is plausable too and i say this because i have a few people in my family that deal with anxiety but they also have Gerd and other stomach issues which alot of doctors say the anxiety and stress cause the stomach problems but what if it is the other way around? It works for me. it really, really, really, works for me and it is starting to work for some of my other family members also. There are alot of people, i'm sure that suffer with anxiety that don't have Gerd so you can't tie it to that and i totally understand that. it wouldn't make sinse but i do have gerd and it is the cause/trigger and when i say i had anxiety it was not the mimic form. it was the real deal, full blown, think i'm dieing, rush to the hospital because my body was all contorted from hyperventaling, doctors running gazillions of test just to tell you that your fine and it's all in your head, walk around in a daze or like you don't belong in your own body, scared to go anywhere, cant hold down a job without the medication and barely doing that kind of anxiety. It is a wonderful thing to find a place where we can talk about these things that some people would stare at you like you are plum crazy for. Thank you for being so kind and letting me express myself.",
            "post_id": "6863349",
            "timestamp": "1304001033",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "TheBigpicture...Thanks for sharing your experiences!  We are all here to help one another navigate through anxiety and we all have differing approaches and views and sharing those is what helps us to learn and grow.This is truly a great and helpful community with many people supporting one another, which many times is more important than anything!Hope you stick around!  :0)",
            "post_id": "6863376",
            "timestamp": "1304001765",
            "user_id": "user_480448",
            "user_link": "/personal_pages/user/480448",
            "votes": "0"
        },
        {
            "answer": "One of the reasons i posted this here is because i saw a lot of complaints that are simular to what i had. Having to lay on the left side at night for more comfort. Thats because it helps your digestive system when you lay on the left side. The burning tingling sensation in the mouth and throat. acid reflux. the lump in the throat that feels like you cant swallow or hawk it up. acid reflux. chest pains and arm pains.irratation of the esophagas.palpatations and dizziness. irratation of the Vegas/Sinus Nerve. stomach in knots and etc. It all sounds like Gerd. Oh,  the soldier that took Nexium for it and finally found away to beat anxiety. If you didn't catch that earlier in this discussion. That is exactly what i am trying to get across. Some of you may be experiencing Gerd or stomach issues and it has not been identified as the culprit to your anxiety. If that isn't jumping out at you right about now then it probably doesn't apply to you.",
            "post_id": "6864055",
            "timestamp": "1304016396",
            "user_id": "user_1663430",
            "user_link": "/personal_pages/user/1663430",
            "votes": "0"
        },
        {
            "answer": "my chest pain seems to be a bit different in such a way that it does respond to nitro. the left sided chest pain also radiates to my left arm, and the pain is usually unprovoked, it could happen while i'm resting or while i'm working, it does cause some degree of shortness of breath, Just had a stress/echo done today which was normal. my cardiologist stated that my chest pain could be arising from my stomach as in gerd or esophageal reflux (which I doubt as I had gastritis and gerd before and this does not feel anything like it). Now if it is not cardiac in nature, why then do i get releive from nitro which dilates the blood vessels????? Help anyone....thank you.",
            "post_id": "7026587",
            "timestamp": "1309327636",
            "user_id": "user_1702144",
            "user_link": "/personal_pages/user/1702144",
            "votes": "0"
        },
        {
            "answer": "Hi every one I been going threw this pain for over a year now, its been in the leftside of my chest which go to my shoulder up my neck and to my jaw and also down my arm I been to the hospital a lot of times and they say everything came back normal they said its not my heart but that's what it feel like Im so tired of going threw this pain Idk what to do nomore I'm only 20 years old everyday I feel like I'm going to die I have a 2 month old son that I think I won't see grow up I had I kinds of catscans and mri I'm waiting to see a nureogist hopefully they find something I'm just rey give up I can take this pain nomore!!!! Please help",
            "post_id": "7088758",
            "timestamp": "1311365501",
            "user_id": "user_1745163",
            "user_link": "/personal_pages/user/1745163",
            "votes": "0"
        },
        {
            "answer": "I'm also going through the same thing everyday worrying about pain in my arms I had ekgs and blood test and they say I'm fine but the paion is so annoying and make me feel so anxious and it gives me so much anxiety I'm so happy that its not just me",
            "post_id": "7107701",
            "timestamp": "1311976484",
            "user_id": "user_1751234",
            "user_link": "/personal_pages/user/1751234",
            "votes": "0"
        },
        {
            "answer": "hi all i am a 17 year old girl ive been experiencin pains in my chest and down my left arm ive had alot of symptoms mentioned ive recently been checked by many different doctors and had many test like ecgs etc everythin came back clear,i was also diagnosed with generalized anxiety disorder, i understand were you are coming from its very frightening ur constant worrying but lets battle this together and be free from anxiety,if your tests have all *** back clear try and be positive dat there is nothing physically wrong with you its ur head telling you there is excerise more eat healthy no medicine can cure you only urself can by thinking positive and getting them what if sumthing is wrong with you when there isnt if you have anxiety it is very worrying and scary alot tyms cause of the pains i know am the exact same but i know its easy for others to say its anxiety or its all in ur head but please do believe its all ur head and u will get thru this as days go on u get stronger nd u will be cured from all this if you believe urself there is nothing wrong with u ive had all the symptoms you can have like chest pains,left arm pains,headaches,burning skin sensations,theres not one symptom i havent had so you are not alone in all this just say to yourself over and over that the pains you are experiencing are there but its nothing serious or there nothing serious wrong with you the more you go doctors or hospitals your only given into ur head because your heads telling you u have a pain you do feel pain but its  not serious so more you go docs etc more your reinforcing the thought in ur head, and heart attack pains do not start in the chest and if you had anything serious like heart attack it wud not last as long as pains you experiencing or if it was anything serious as to anything yous have mentioned use would not be still here so people please trust me when i say anxiety can be severly painful and can go from place to place in the body no matter how painful the pains are its all your anxiety i hope ive helped use to understand what your going thru :)",
            "post_id": "7167358",
            "timestamp": "1313852443",
            "user_id": "user_1769168",
            "user_link": "/personal_pages/user/1769168",
            "votes": "0"
        },
        {
            "answer": "I am so glad that I am not the only person that have same health issues. I have been having chest pain for about 2 months now. I have done all blood work, EKG, scope, Stress test, chest x ray  and everything looks good. Recently I suffered from bad anxiety/panic attacks, went to see a psychiatric and she told me all this pain in my chest is due to stress, and severe anxiety. I am taking laxapro and klonopin but I am still having pain in chest and my arm now shoulders sometimes too. I am so worried every day and want this pain to stop it is so annoying. What else can I do, any suggestions.",
            "post_id": "7199825",
            "timestamp": "1314823394",
            "user_id": "user_1670937",
            "user_link": "/personal_pages/user/1670937",
            "votes": "0"
        },
        {
            "answer": "I've suffered from chest pains, pain in shoulder and shoulder blade, and down my left arm for two years with no exact cause other than its not my heart I've had several EKG's, one stress test, blood work, ECG's, and chest x-rays and all came back clear I've had several different dr.'s administer these tests and one family dr. At first they said it was costochondritis brought on by driving a forklift and constitly using my muscles, then they said it was chest wall inflammation, and then they said it was costocondritis and chest wall inflammation, now family dr. says its anxiety and made me an app. with a counsler but until then she gives me muscle relaxers and they help tramendusly but as soon as they're gone my chest pains are back and i still can't help but to think they all missed something and that i'm not going to get to watch my little girl grow up cause i worry that everyday is my last and i don't like to leave the house but when i do my pains get better when i workout my pains get better i just wish they could figure this out so i can get back to living my life as i am only 23 with a wife and daughter and another child  on the way it does really help to read everyones stories, a peace of mind persay i wish everyone the best of luck in there battle with anxiety and hope mine helps you as well,thanks, Chase",
            "post_id": "7224079",
            "timestamp": "1315551765",
            "user_id": "user_1796093",
            "user_link": "/personal_pages/user/1796093",
            "votes": "0"
        },
        {
            "answer": "I'm glad I found this place(2 minutes ago) and instantly see that other people have the same issues as me. I went to the doctor for 4 months before they told me it was anxiety. I was SURE it was heart related. They tested me over and over,but them telling me it wasn't my heart didn't help at all. When you have chest pain and pain down your left arm of course you think it's heart related. I have managed,5 years later,to sort of calm myself down when it happens,but the anxiety of heart issues kicks in the second I get anxiety....if you know what I mean! I do feel better after reading some of the comments here and knowing I'm not alone with these symptoms!",
            "post_id": "7224136",
            "timestamp": "1315555087",
            "user_id": "user_1796127",
            "user_link": "/personal_pages/user/1796127",
            "votes": "0"
        },
        {
            "answer": "I just wanted to confirm that lots of us feel like this at times. But I also want to say that for some of us at least, it gets better. It started 5 years ago with me, panic attack, A&E, convinced I was going to die. Strangely, that didn't worry me, my focus was on the effect it would have on my kids, Wife, Mum and Dad. This just made it worse. After 2 bad years it steadily got better, a wee bit if relaxation, meditation, exercise and...time. I still feel anxious and down at times but I'm not sure it's any worse than feelings I had before the anxiety appeared. I take a drink (as we say in Scotland) but try to keep it light, enjoy an esspresso in the morning and have generally list that horrible fear that my quality if life has gone for good- that was the worst thing. Taking your anxiety on helps some. Heart racing? Go for a run 'I'll show you racing!'; think you're dying? 'Come and get me- I'm ready!' And rationalise: I won't die...I might end up huddled in my room sweating profusely but, hey, I came through that last time. Hope all of you feel better each day. People are good. Get our, volunteer help. Try and think 'I'm feeling **** I might as well get something done!'",
            "post_id": "7303890",
            "timestamp": "1318021625",
            "user_id": "user_1832149",
            "user_link": "/personal_pages/user/1832149",
            "votes": "0"
        },
        {
            "answer": "I was sooo relieved to read many of your posts and know that I am not alone.  I still worry every day though.  I had a major panic attack almost 6 months ago and then started having weird symtoms- chest pain, left arm pain, neck pain and tightness, shortness of breath, random pains in my jaw, etc.  I also have a weird tingling sensation across the left side of my back. And, I've had a random dry cough too. I was POSITIVE it was my heart.  I am a 24 yr. old female and have been healthy my whole life.  I finally went to a cardiologist who did a whole bout of tests.  My plain stress test came back abnormal so he ordered a thallium or nuclear stress test which came back great.  He told me the second test is much more accurate and that he feels certain my heart is fine.  I am also on Zoloft 100 mg. for anxiety.  I'll do great for weeks and then my symptoms will get worse again, I freak out, and start going back to the Dr.  I thought for sure if I saw a cardio and ruled out heart problems I'd feel better, but now I am just over analyzing everything- I keep wondering why the plain stress test had an abnormality, and maybe the second test was wrong, and what if what if what if... I've even been contemplating getting a second opinion and round of tests- is this crazy? Can anyone else relate?",
            "post_id": "7319948",
            "timestamp": "1318519832",
            "user_id": "user_1839220",
            "user_link": "/personal_pages/user/1839220",
            "votes": "0"
        },
        {
            "answer": "hi there,,my sympathy goes out to you,i have suffered like this since my teens,i am now 40 yrs old and still no respite,,i know exactly how you feel,could have written a book on it by now,,tight chest= heart attack....pain in arms,neck= heart attack....headache= brain tumour,,any pain anywhere is something life threatening,,i know its not true,but my thoughts are too powerful and they overpower any common sense reasoning...unwanted thoughts from waking in the morning to sleeping at night....this truly is a nasty trap which only one that suffers it can truly know,,,,its so easy to say...SNAP OUT OF IT,,,,DO SOME DEEP BREATHING,,KEEP YOURE MIND OCCUPIED,,DO LOTS OF EXCERCISE ETC...i have tried all these things and still do,,problem is i am still getting these thoughts while doing them,,they overpower everything...its as if my thoughts are hell bent on torturing me....ive had cbt twice,,seen numerous counsellors and therapists,been prescribed many anti depressants\\\\\\and to be honest nothing has worked at all,,i eat healthy,dont smoke,,i have a couple of cans of beer at night and thats my only vice....i live in hope,,,,i can see how some people turn to drugs and drink...definetely not the answer i know,,,i said to a dr recently that i am always low and feel anxious,scared,tense uptight all of the time,,i then added AT LEAST SOMEONE HOOKED ON DRUGS OR DRINK FEEL GOOD SOME OF THE TIME.....he just laughed....not a nice statement and i shouldnt have said it ,,but its how i felt......anyway sorry for waffling on..it really saddened me to read youre post,,,youre 24 years old and have all youre life ahead of you,,i so wish i had the answer for you,,,you most certainly are not alone,but you can beat this...i am going to ..i have to ,,i have an 8 yr old son,i owe it to him and myself...i am sick of this miserable existence and it has to end....endless visits to doctors,therapists,mind ticking at ten billion miles an hour,,,i worry what all this worrying is doing to my health.....life is life and worrying wont change the outcome of anything,,thats for sure..everyone on the planet will die at some point,thats the nature of life...i am telling myself this and there are no second chances in life,,once youre gone youre gone,,we dont want to look back years down the line at 70 year old and say that this problem has ruined our lives entirely,there would have been no point in existing in the first place,,,sorry for rattling on ,im at rock bottom right now,tired of fighting,,but life goes on..i have to pick myself up and fight....at 24 years old you have so much to live for and so much to do,,dont let this monstrous anxiety eat away at you,,youre worth far more than that....i am going to beat this and you are younger and fitter than i probably am,,so i have every confidence you can beat it too.....this problem has affected people for years,my parents era were given mind altering pills for this,,,but doctors will no longer prscribe such medication,,whether it helps or not,,probably rightly so,,,,im surprised youre dr gave you zoloft,,mine is reluctant to prescribe anything,,,he did however try and enrol me in TAI CHI classes.....nothing against TAI CHI but sorry that wont help,,,when it comes down to it we have to fight this ourselves,,i have never tried zoloft,,i really hope they help you,,i am currently into my 2nd week of amitryptiline,,they do seem to have improved me slightly,so fingers crossed....there are medications out there that help,,i once took a 3 day course of a certain pill and felt like a new man for 3 days,,,brilliant,,,but said tablets are addictive and dangerous long term,,so doctors wont go anywhere near them...who are we to argue...so chin up and i hope you can get out of this horrible rut...you are not alone...a friend of mine always says...WERE HERE FOR A GOOD TIME....NOT A LONG TIME....interesting theory...who knows....i wish you all the best in tackling this,,,,great to have read youre letter,,you have inspired me to type in my thoughts,took my mind off die,ing...(slightly)....for a good hour...take care and best wishes,,neil....",
            "post_id": "7324135",
            "timestamp": "1318626508",
            "user_id": "user_1840859",
            "user_link": "/personal_pages/user/1840859",
            "votes": "0"
        },
        {
            "answer": "I have had these chest pains since I was 11. When I turned 19 the pain got severe and it was hard for me to breath. I went to the ER that night and many test were done on my heart. My heart rate was around 173 and the doctor didn't know why. He said they couldn't find anything wrong with my heart but that it shouldn't be beating like this. I even saw a heart specialist and she said she couldn't find anything wrong with my heart. I am 21 now and the pain has come back and I have been dealing with it for 3 weeks. I wake up some mornings with a fast heart beat and painfull chest but these past 2 days my heart beat has been really slow almost like it's week. I'm not sure what to do...",
            "post_id": "7381869",
            "timestamp": "1320538811",
            "user_id": "user_1877987",
            "user_link": "/personal_pages/user/1877987",
            "votes": "0"
        },
        {
            "answer": "Hello there, I  started getting anxiety since last october from trauma and its already been going now. i have had no symptoms of anxiety for atleast 3/4 weeks.It does get better, you have to go through the worst and face your fears,mainly we are anxious about being anxious.We are constantly thinking about our anxiety,therefor it stays with you. the symptoms fade away the more you try and block it out of your head even if its ugly head shows itself,one by one.Also i havent took any medication,i guess ive been brave enough to face it on my own.I would recommend the charles linden program.I was struggling and decided to read instead.It states about diverting your thoughts constantly to bury the negative ones.....have you had moments where you have not focused on anxiety and been involved in somethink else and felt better? Distraction and Diversion is the key. I have faced all my anxieties.Ive flew on planes on my owns numberous of times since last october and i felt so horrible,but it soon passes.All of us have anxiety,everyone on this planet!its just some people's levels go to high.and we need a way in which we can bring it back down..being more anxious about the symptoms is not the right way.1. Anxiety is a learned behaviour (Habit)- our subconscious mind stores all the negative and brings it to the conscious mind.2.A 'limited symptom attack 'is person who has 4 or less symptoms..this usually means they are recovering.3.Find your 'holy grail' a hobby that you can involve in to make yourself better and be your key diversion.4. Anxiety is not an Illness....its a learnt behaviour...therefor it needs no cure!!...you must try bury the anxiety as much as possible.I hope you all recover,there is hope.you just have to be patient and positive.firstly ive read anti-anxiety medication only works for some people...and its to do with our mind which manifests this physical symptoms....if your taking medication for a learnt behaviour...then you should come off those...and unlearn the behaviour yourself.Things do get easier,dont learn to just 'manage' replace the anxious habit with the new Non-anxious.If anyone has any questions feel free to write back.Good luck and bless all of you.",
            "post_id": "7385884",
            "timestamp": "1320668282",
            "user_id": "user_1880911",
            "user_link": "/personal_pages/user/1880911",
            "votes": "0"
        },
        {
            "answer": "Hi there.  I am so pleased to see all the similiar stories to mine well, not pleased that other people are suffering but it just goes to show that we are all NORMAL.  I too have been suffering with anxiety for years, almost twenty years now and its horrible.  When my life goes out of control or changes in anyway I notice I start suffering more than ever before.  I ended up in A & E a few weeks ago with pains shooting into my right shoulder.  I mentioned to the doctor that I am always getting pains in my left arm and shooting pains over my left breast.  They did an x-ray, bloods and an ECG.  She said she wasn't happy with the ECG which frightenned the living daylights out of me and that she wanted me to come back in the morning for a stress ECG.  When I came back the nurse Cardiologist told me that I didn't need the test that my ECG was normal.  I was so relieved but I did ask why did they say there was minor changes and he said that some doctors just don't know how to read ECGS.  I have a family history of ischemic heart disease.  He said I was healthy but I just don't believe him.  I went to my own doctor and she said to believe the Cardiologist.  My blood pressure is good, my cholesterol is okay.  I am 40 years of age and have been convincing myself for years that I am going to have a heart attack, stroke, brain hamorage etc.  Anytime I get a slight pain or symptom my mind immediately relates it to something serious.  I have done CBT, counselling. I refuse to take any tablets because I feel it is all in the mind and I can deal with it.  I also get this sensation sometimes when I go out of my house.  I end up walking sideways and feel all disorientated.  It goes away when I talk to myself and tell myself I am okay.  I know what you are all going through.  I just wish they could find a cure.",
            "post_id": "7394750",
            "timestamp": "1320879166",
            "user_id": "user_1021241",
            "user_link": "/personal_pages/user/1021241",
            "votes": "0"
        },
        {
            "answer": "Can I ask everyone what the left arm pain feels like?  Mine scares the heck out of me.  It is in the mid arm in front of the elbow.Dull, sometimes a jab, aches, had ekgs stress test blood work, all normal.  They put me on Ativan a year ago and that took the pains away but now a year later I went way down on the dosage and guess what, the pains came back only now they are worse and last longer, and the Ativan is not working as well as it use to.I am trying to get more heart tests because I have heard that stress tests can miss things that mris or catheters will show.Can't convince my dr to refer me though.  Oh this is sooo frustrating and scary.",
            "post_id": "7401998",
            "timestamp": "1321077465",
            "user_id": "user_1890457",
            "user_link": "/personal_pages/user/1890457",
            "votes": "0"
        },
        {
            "answer": "I get the same symptoms too, pain in left side of chest and left arm and shoulder, also pain in my neck and jaw, I convince myself it's a heart attack and it brings on a panic attack, I've had panic attacks since I was 11, I'm now 30 and it's developed in hyperventilation syndrome:( I always think it could be a blood clot, as there is a history of blood clots in my family and my nana passed away from one this year and since then the panic attacks have come back, I've been worse since having my daughter because a lady I knew died and left behind her son and daughter who were only 3 and 1 yrs at the time! I'm fed up thinking every ache and pain is something serious, I also have fibromyalgia which doesn't help!",
            "post_id": "7442307",
            "timestamp": "1322248502",
            "user_id": "user_1913621",
            "user_link": "/personal_pages/user/1913621",
            "votes": "0"
        },
        {
            "answer": "Hi there, the pain in my left arm is where you get it, at my elbow, sometimes even a tight feeling like a tight band around my arm just above my elbow, it's a sharp pain, sometimes a dull ache but the pains I get on the left side of my chest is starts from my breast bone and shoots across where my heart is! Does anyone have swelling on their breastbone/ribcage? I found a lump (convinced it was cancer if course!!) and the doctor said it was just inflammation but it causes A LOT of pain, catches me by surprise and takes my breath away! Pains under my ribcage on left hand side also!",
            "post_id": "7442505",
            "timestamp": "1322254466",
            "user_id": "user_1913621",
            "user_link": "/personal_pages/user/1913621",
            "votes": "0"
        },
        {
            "answer": "Hey guys,Just thought I'd add the SAME story to the hundreds already posted on this forum! I've been having chest and arm pains (I don't need to describe them, same as ALL the other posts) for the past couple of years now, got the checkups (I don't need to say which ones, same as ALL the other posts) and things turned out fine (same as ALL the other posts.)So here's my deal tonight. I started having strange sensations in my left arm again tonight, right now in fact. I was sitting on my ocuch about half an hour ago and as soon as I started feeling these sensations, YOU KNOW them, my mind began to hone in on them:\"Why the hell is my arm hurting? Why my left arm? Can I really just ignore it? Maybe my body is trying to tell me something. Maybe its telling me that somehting is wrong. Why would my body hurt for no reason? Something must be wrong.\"Now I'm good and focused, at this point I'm practically waiting for a stiff breeze to blow across my left arm and notice what the sensation feels like. I know that left arm pain is linked to heart attack, and now I'm waiting, literally just waiting for any slight discomfort, any slight abnormality, and bingo---thats a trigger----this is it, say goodbye. I have pulsating, radiating discomfort through my left arm, and now I feel something changing in my chest, it can be nothing BUT a heart attack.Yes------- this is the same story all over again. This is my story---itsyour story too, I know it is, because I've seen it SO many times. Don't think this is the first time I have come to this site looking for a little psychological comfort. I know that I have anxiety, because I have been diagnosed with it. So do you. I know that I don't have a heart problem, because I've been thoughly examined by professionals who train for years upon years in order to know the human body and how it works BETTER THAN ME.Yet I end up thinking that I am going to have a heart attack anyway....thats absolutely insane.So heres my approach:In a sense I'm giving up. I'm giving up on the idea that this pain, this shortness of breath, this uneasiness has anything to do with my heart. I'm giving up because I'm tired of toying with the idea, and I'm tired of being afraid, because IT DOESNT MAKE ANY DAMN SENSE.I am NOT giving up on the pain, however. The pain that my anxiety produces on a regular basis is not \"just in my head\". It can't be because I feel it, and it hurts, and its discomforting, but this pain will not kill me.My anxiety-ridden brain says, \"Oh yeah?\"I say \"Fine, let it kill me then, because what else can I do?\" I have been tested for heart problems, and I am a healthy 24 year old man. I STILL have a sensation in my left arm, and right now I am literally just trying to LET it hurt, and if later I feel as though I can't breathe, then -----I will just let myself feel like I can't breathe because that's what my body is doing at that moment.And later tonight, when I just let all of that pain take its course and I finally have that heart attack, I'll say \"Thank God\", because apparently I've been waiting for it to come along for two damn years now. And when I see whatever God there is in heaven he'll say \"what were you so scared for? Don't you know that there are plenty of other ways to die? Didn't you realize that it doesn't matter when or where or how it happens because it's going to happen anyway? Could you not somehow find a way to live instead of WAIT to die?I guess my point it, I feel like I can't beat this anxiety. I'm going to join it. I've done my part, AND YOU HAVE DONE YOUR PART to take necessary measures in light of given situations. I feel strange pains in my body, strange pains that are DIRECTLY related to critical symptoms of heart disease and heart attack, yet any test performed  in this age of technology has revealed NOTHING that suggests that I am in any immediate danger of heart failure, and neither are you.This post has been for me, and I've tried to make it for you too, and hopefully we can move on with this affliction. Don't try to beat it, try to bear it, and then maybe we can move past it.Take courage, know that pain is pain, and thats all it is.",
            "post_id": "7455675",
            "timestamp": "1322642143",
            "user_id": "user_1921240",
            "user_link": "/personal_pages/user/1921240",
            "votes": "0"
        },
        {
            "answer": "Has anyone been tested for costochondritis?? I've just been diagnosed with this, I also have fibro which can come hand in hand with costo(inflammation of the ribcage, the parts where ribs meet breastbone) the pain can mimic a heart attack, I'd get the pain radiating across my heart area, left arm, shoulder and neck and get pins and needles which is the symptoms of costochondritis then that would make my panic attack worse! Please google costochondritis as it added up with me then my doc confirmed it by examining my ribs, but I still don't know what this lump is on the bottom of my breastbone, they say it's inflamed cartilage but being an anxious person I fear the big C! I've had panic attacks since I was 11, I'm 30 now and it's developed into hyperventilation syndrome, surely life can only get better, I would give up if I didn't have my daughter who makes me smile everyday",
            "post_id": "7484815",
            "timestamp": "1323464794",
            "user_id": "user_1913621",
            "user_link": "/personal_pages/user/1913621",
            "votes": "0"
        },
        {
            "answer": "From what I'm reading above, could you be suffering from costochondritis/tietze syndrome, here are the signs/symptomsThe primary presentation of the syndrome is significant, acute pain in the chest, along with tenderness and some swelling of the cartilages affected, which is commonly palpable on examination. Although many times it can be extremely painful, to the point of being debilitating, Tietze's Syndrome is considered to be a benign condition that generally resolves in 12 weeks. However, it can often be a chronic condition. The pain can be identical to a heart attack and can cause hyper ventilating, anxiety attacks, passing out, panic attacks and temporary numbness/paralysis.Many cases of heart attack victims have been re-considered and improperly diagnosed, due to the identical nature of the symptoms.Perceived pain is often exacerbated with respiration.Costochondritis symptoms are similar to Tietze's, the prime difference being that the pain radiates to the arms and shoulders in the latter.My doc diagnosed me with this this week, my symptoms mimic those of a heart attack, pain in chest, left arm, shoulder, pins and needles, feeling sick etc and I get massive panic attacks that I nearly pass out! I'm not saying you definitely have it, but maybe worth checking out? It's not a serious condition but can be debilitating?",
            "post_id": "7486119",
            "timestamp": "1323512383",
            "user_id": "user_1913621",
            "user_link": "/personal_pages/user/1913621",
            "votes": "0"
        },
        {
            "answer": "Reading all these responses really helped me calm down and further reassure myself that I am not alone. I suffer from panic attacks that started when I was 15. I was diagnosed with panic disorder and was able to stablize with Paxil. Although I often would have small attacks here and there I was able to control them with breathing techniques and calling my mother who is an RN. I have moved, had a baby, live with my amazing boyfriend of three years and have managed quite nicely until just recently (i'm 26 by the way) when I had a really bad attack on Thanksgiving. All because I had the worst tummy ache and diarrhea. My whole body felt hot and I was in an instant panic over the symptoms my body was experiencing from the stomach ache. I was about to make my BF take me to the hospital, but I was able to calm down enough and relax my mind. Well I had another attack on the 6th of December and this time it was REALLY bad. I ate Pizza Hut (THE DEVIL FOOD) and it gave me the worst tummy ache. I started to panic and this spiraled out of control for two days. I could barely sleep, eat, function. I couldn't drive, which was a new symptom for me..Finally I had my mom come and take me to urgent care where they gave me lorazepam for the anxiety. Now I HATE taking pills but they actually work and help me just...exhale. relax. I have been struggling still with the idea of having to take a pill to calm myself but I am planning on using it just to get me back on track. I also am going to cognitive therapy and joining a support group so I can really manage this and keep it in control. That is the MAIN thing here. I CONTROL THIS. IT DOESN'T CONTROL ME. I have trained my brain to INSTANTLY think there is something wrong and there ISN'T. I am learning every SECOND to just let my body do its thing. its made to panic. and fighting it is just going to make it 1,000 times worse. I have been diagnosed a healthy 26 yr old female, havent had any tests done on my heart because I KNOW there is nothing wrong. Yet my brain is like UH YES THERE IS. WELL YOU KNOW WHAT? **** YOU BRAIN. I am 100% committed to live my life to the fullest and not let this define who I am. I have made it this far living with this panic disorder and I will be DAMNED if I let it stop me now.",
            "post_id": "7493480",
            "timestamp": "1323753431",
            "user_id": "user_1939417",
            "user_link": "/personal_pages/user/1939417",
            "votes": "0"
        },
        {
            "answer": "Yeah so a month ago I was lying in bed and my heart had a little spas which went on a few seconds, afterwards it felt like it was about to happen again for about 3 days but it never did, I went to my doctor and she basically fobbed me off and told me to go home, I felt better for a month, 4 days ago i'm at work and I start to feel odd, it gets difficult to breathe and my chest becomes tight and it's still like that 4 days later, it isn't so much \"pain\" more of a discomfort, then my chest went ok and my right arm has shooting pains in it, this thread has made me feel better but most of them say \"i've had the relevant blood work, heart scan ect and i'm fine\" I haven't because my doctor is arse and they're just going to ignore me if I go back, this ***** man i'm only freaking 20.",
            "post_id": "7497506",
            "timestamp": "1323875273",
            "user_id": "user_1941204",
            "user_link": "/personal_pages/user/1941204",
            "votes": "0"
        },
        {
            "answer": "Oh also, whenever I'm in bed I feel totally fine, I always waking up feeling normal then as soon as I get out of bed it becomes difficult to exhale because of tightness. It's like I'm always on \"manual\" breathing, when I exhale I just don't inhale again, it's like apnea or something, just very strange. It does feel like there isn't enough blood into my arm, I don't know what's wrong with me but I suspect it's anxiety, I just keep telling myself, \"you're only 20 so thats less of a risk, you don't smoke and if it WAS something with your heart you'd know about it, you'd be blacking out or whatever.\" Sorry to hear you guys have this too but its nice not to be alone in this.",
            "post_id": "7497539",
            "timestamp": "1323875949",
            "user_id": "user_1941204",
            "user_link": "/personal_pages/user/1941204",
            "votes": "0"
        },
        {
            "answer": "I would like this message to go to everone in this forum.  I am a 37 year old male and have suffered with anxiety all of my life.  I have boughts of pain that occur with it, usually in 3 month to 1.5 years cycles.  The pain is not there constantly but when it is it can be all over.  My arms, wrists, legs, neck, and shoulders.  Quite frankly, it feels as though I have rheumatoid arthrities (though I do not).  The pain seems to go away when exercising or when I am around people and my mind is totally on other things.  Medications will calm me down but not necessarily cure the pain.  The pain is cyclical, period.  That is probably what most of you are experiencing and here is what happens.  We all have an anxiety order to begin with that in it of itself is likely managable.  Naturally, because we are anxious we are over achievers so we push ourselves to the limit then crash, useally after the \"big event\" is over.  Then the pain, severe anxiety, and sometimes depression set in.  We thing we are dying, life *****, we think we have some type of chronic disease because of the pain.  Well we do, it is called anxiety, but the good news is that it will not kill you and it is treatable (though I have yet to master it).  What happens next is we pull back and slowly start to asert back into life, then the pains mysteriously lift until the next time we push oursevles over the edge.  Anxierty will always be there though, just absent of pain, when times are \"calm.\"  The take away here is that 1. you are not dying, 2. the pain ***** but is is usually cyclical and goes away with proper relaxation, 3. you are certainly not alone and have many fellow suffers just like you.  Reach out to them, they will make your journey more bearable.  Good luck to all.",
            "post_id": "7516907",
            "timestamp": "1324483093",
            "user_id": "user_1949925",
            "user_link": "/personal_pages/user/1949925",
            "votes": "0"
        },
        {
            "answer": "Great last post ericb!  I have been fighting anxiety for a long time as well.  I am now 28 and have had at least one issue a year that I have thought to be some sort of disease or cancer since I was in high school.  It never fails!  I cannot chalk it up as something minor and move on.  I almost have to always hear the doctor say all is ok to close that chapter.  Additionally, up until a little while ago I occasionally smoked marijuana as a stress relief tactic but now, as I get older, almost any and every issue I have I immediately start to think may be related to years of smoking!  I lifted a bunch of heavy boxes last week and did something to the middle of my back -- its either a muscle or rib injury but I cannot chalk it up as that.  I have been researching lung cancer etc on the internet -- of course I have zero symptoms of that but I cannot stop focusing on it.  Additonally, the power of anxiety often allows one to read a certain symptom and then feel it 10mins later!  I am thinking about trying the anxiety and phobia workbook as well.  I play tons of basketball (3-4 times a week) and feel totally fine when exercising -- which is a good thing.  I enjoy reading all these posts as a sense of reassurance and hope everyone is working towards combating this harmless, yet very unfortunate disease that is anxiety!!",
            "post_id": "7516968",
            "timestamp": "1324484438",
            "user_id": "user_1949959",
            "user_link": "/personal_pages/user/1949959",
            "votes": "0"
        },
        {
            "answer": "I do suffer from anxiety or panic attacks, ans as I am reading all these post, is like describing what's happening to me.  I been told by varius people I know do exercise more by my dr.  Also, when I am feeling stress out, I try to go out and walk for a few mins. And breath fresh air, it helps.  Lately I been getting pinches in my chst, dr has ruled out heart attack, my heart is find, no problems, but is always in the back of my mind",
            "post_id": "7528006",
            "timestamp": "1324921804",
            "user_id": "user_1955135",
            "user_link": "/personal_pages/user/1955135",
            "votes": "0"
        },
        {
            "answer": "Hey everyone, I am new to this forum! I always get chest pain, palpitations pain in the middle oft shoulder blades, bathroom breaks, muscle pain shortness of breath....I can go on and on!!! I have had 4 holster monitors 48 hours. Ekg's numerous ones! 4 heart ultrasounds !! All came back normal.  Thank god! I try to convinceYself that these are just symptoms and to not give them any credibility.  Eventually they will go away!! I have generalized anxiety every day! I know I am a major hypochondriac. This is taking over my life!!! I can relate !!! I did the Lindon method, and I have to say it has helped me some! Does anyone else feel these symptoms!",
            "post_id": "7692833",
            "timestamp": "1329529350",
            "user_id": "user_2035276",
            "user_link": "/personal_pages/user/2035276",
            "votes": "0"
        },
        {
            "answer": "Hi I'm 19th year old girl iv had anxiety for about 2years now I used to fill like I was gunna fanit all the time I got to cope with that now I get really bad chest pains and my heart fells like its beating really fast been getting them for about 3 weeks now waiting for a doc app just wanted to no if any one else gets them it really scears me I have a 17mth old little girl and I fill like it stops me from doing a lot of things with her like going park because I get so sceared I could just wake up and have chest pains I try and take myMind of it but it so hard would really help me to no it any 1 else has the same thing thank youSinead",
            "post_id": "7717267",
            "timestamp": "1330221120",
            "user_id": "user_2048707",
            "user_link": "/personal_pages/user/2048707",
            "votes": "0"
        },
        {
            "answer": "I am 12 years old and I am having the same problem. The pain that I am having is making me sometimes feel dizzy at night and the pain is having to do with my family and religion. I know that chest pains can be really severe when having a heart attack. My mother is goes nuts when I start worrying about it and she told me it doesn't have anything to do with my heart and so did my family doctor. I sometimes think about negative things that might happen to me in the future such as depression, health problems, etc. Please help me before I start thinking more deeply! I really appreciate it.",
            "post_id": "7737928",
            "timestamp": "1330822884",
            "user_id": "user_2061503",
            "user_link": "/personal_pages/user/2061503",
            "votes": "0"
        },
        {
            "answer": "Hi, I too have anxiety, my doctor said its not sever it scares the heck outta me. Yes I have all the same symptoms as you and yes I have a small child as well. Our everyday life & worrying about our children, health, $ and just everything will lead to anxiety/panic attacks, they work together. I had my heart checked out 3 times, went to the e.r about 4 times, was given ant acid for my gas(which comes from anxiety as well) I went through so many test and I worried more and more and the anxiety worsen. Personally I take my moms meds when I am tired of feeling faint, irrible, scared AND most of all worried. My doctor won't prescibe me with anything.I sure if you read your religous book or Bible you can fight it. Because its all in the mind. Take Care~ Kish",
            "post_id": "7751715",
            "timestamp": "1331235309",
            "user_id": "user_2067759",
            "user_link": "/personal_pages/user/2067759",
            "votes": "0"
        },
        {
            "answer": "Hi Guys. I thank God for leading me to this forum. I was diagnosed with Generalized Anxiety Disorder about a month ago. In just one month I have had almost all physical symptoms of Anxiety Sufferer. Chest pains, shortness of breath, sweating, lightheadedness, pins and needles, palpitations, pains on my arms and shoulders (mostly on left hand side), etc. Believe it or not, I’ve had all these symptoms and more. I’ve had three Panic Attack all in different forms, thought I was gonna die each time they happened. I’ve done CT scan, MRI, ECG, blood/urine tests, heart sonar, nerve tests and others that I don’t even know what they are called. All these tests came out with normal results. All the symptoms have gone away except palpitations and chest pains.Though I’ve had all these symptoms, they did not come all at once. One symptom would come and once I have been able to convince my mind that its all in my head, the symptom would stop and a new symptom would follow. That’s anxiety is! Once u manage to deal with one symptom, its presents itself in another form.I must say, this past month with this thing was probably thus far the worst time in my life. But at the same time these experience is changing my life to be a better person. You see I have been living with fear and worries for a better part of my life. Had these fears never presented themselves in this way (Attacks and other symptoms), I was gonna live with them for the rest of my life without ever confronting them. I with these attacks and other symptoms, It’s a way of God to make me confront my fears and worries in to be a better person.I urge everyone on this forum to take this experience as a blessing in blessing in disguise. Fact is, if you suffer from anxiety it means you have constant negative thoughts and negative thoughts disrupt life. Take you condition as an opportunity for you to confront these negative thoughts and eliminate them for Good. I know this is easier said than done, but IT CAN BE DONE!!  In my case, have requested a divine intervention from God. I have revisited the basis of my faith and brought closer to God. People who have true faith in God never fear or worry. You always know that God got you!The next step is for us to be in control of what our minds absorbs and choose deviate from the negative. Our minds feed our subconscious and anxiety emanates the subconscious (most times). STOP thinking the worst of every situation (I know it’s not easy, BUT IT CAN BE DONE)!!!. BE FREE!!!  Reprogram your way of thinking.  Leave no place in your mind for negative thoughts!! Read positive books/articles, mix with positive people, find interesting hobbies.Make an informed decision that YOU WILL STAY POSITIVE whether attacks/other symptoms come or not. Have a phrase of reaffirmation that you always say when these attacks come.  One of my phrases is  “My Redeemer lives!!”.  Take mine or make you own, don’t just say them, believe in these phrases. You will be amazed that change that your way of thinking will bring into your life!!!!Jesus Bless you all!!!!!!",
            "post_id": "7771802",
            "timestamp": "1331821270",
            "user_id": "user_2076276",
            "user_link": "/personal_pages/user/2076276",
            "votes": "0"
        },
        {
            "answer": "Great Forum!I have found it really helpful reading through these posts as it does seem we are all sharing the similar/same symptoms. I am a 30 year old man, non smoker for 16 months , no drugs.My first experience with this was a year ago, but last week it has come back again. Basically I woke up at 3am suddenly, my heart immediately starting racing, I started sweating and could not stop. I had to get out of the covers to calm and cool myself down. (a classic panic attack I am told)Since then I have a dull ache in my left chest, which sometimes moves to my back or left shoulder and arm, I also have the odd sharp pain and iregular heartbeat from time to time. I was wondering if anyone else walkes up in the middle of the night with these pains? of course, I wake up, worry and cant sleep properly.I have been to the Doctor who thinks it is Anxiety once more, heart sounds fine, lungs seem fine, oxygen levels are fine and ECG seems fine. (had a chest x-ray last year, fine)This saturday, I still had the pains and felt bad so my family took me to the walk in clinic who immediatley hooked my up to an ECG and started panicking because my heartbeat was irregular and my blood pressure shot up...yet my ECG was fine. I got reffered to an out of hours  hospital GP who said I was ok, and has reffered me to have a heart stress test to rule out every possibility. I am assuming (hoping) that the experience of being hooked up like that in the walk in clinic caused my anxiety levels to rise and affect my BP and heart rythymn.Of course since then, I have tried to remain positive. Like we all should. Sure enough, taking your mind of it for a while does make the feelings and pains go away...until you notice you dont have the pains any more and they come back.A horrible loop to be stuck in and I fully appreciate how everyone is feeling.I have been applying for numerous jobs and trying to progess my career over the last two months or so, I've had many interviews and I have always been 'the runner up'. whilst I have have had good feedback from the interviews I keep telling myself that this is my bodies way of dealing with the ups and downs.Chin up folks, we will get through this",
            "post_id": "7806606",
            "timestamp": "1332845736",
            "user_id": "user_2091362",
            "user_link": "/personal_pages/user/2091362",
            "votes": "0"
        },
        {
            "answer": "Hello I am a 21 year old male who also has bad anxiety ive gone through it since i was 18 years old when i moved to Guam it had seemed to go away but it has just returned at its worst i constantly think im gonna die of a heart attack because i feel pain in my chest and my left arm hurts but what i think sometimes if im not dead in the first 20 mins then im not going to die but my mind always says other wise all i can say is keep trying to fight this as so will i we will all get better sooner or later :D",
            "post_id": "7817154",
            "timestamp": "1333122983",
            "user_id": "user_2095499",
            "user_link": "/personal_pages/user/2095499",
            "votes": "0"
        },
        {
            "answer": "Hi all I'm constant in pain all the time with chest and left arm pain been havin panic attacks for 6 months now iv been to a±e loads of times had ecgs blood tests and xray all came back normall but still I worrie a lot Iv just gone 30 and these pains are getting me down a lot.I just want to get back to my normall self but I can not cause all I do is worry I'm taking medication at the moment I'm on beta blockers propanolol and citralopam they do work but I don't want to be on medication all my life just want my life to be normall again......... :( x",
            "post_id": "7870825",
            "timestamp": "1334701758",
            "user_id": "user_2118027",
            "user_link": "/personal_pages/user/2118027",
            "votes": "0"
        },
        {
            "answer": "I suffer from anxiety.Last September, I went to two doctors because I had a pain in the right side of my chest. The doctors could not figure out what was wrong with me, but I remained convinced that it was a case of appendicitis – even though the only symptom I experienced was a pain. No vomiting or any of the other symptoms.Finally, one day I went to the ER. They ran blood work and did a CT scan, and they found nothing. They gave me some pills for acid reflux, which I began to take. I also began to eat a lot healthier. Eventually it went away.Then, in October, I was sitting on the couch one night, when I felt a cold sensation in my chest. I felt like there was a leak in my chest, and it was leaking a cold fluid. This worried me a lot. This sensation made me more aware of my heartbeat, which I thought was too fast. I believed I was having heart palpitations so again I went to the ER. At the ER they ran an EKG and some chest x-rays. Everything was normal. The doctor told me I looked anxious, and that I shouldn’t be because I had nothing to worry about.After the second visit to the ER, I followed up with a new doctor. This doctor performed a physical and blood work and said I looked healthy. He said I just needed to exercise regularly because I don’t.I even saw an Asian herbalist doctor. He gave me herbs that promote better circulation, but also said just from looking at me that I worry too much.November went on with a lot of odd pressures or odd feelings in my chest.December was the same. During the holiday season, I had an irrational fear that something bad would happen on my birthday (December 24th or Christmas). Nothing of the sort happened. On the 24th, during my church’s Christmas Eve service, I felt some more heart palpitations and began to panic. However, as soon as it was over, I was fine.Also during December and for months after, I felt that I needed to have my hand over my chest to prevent something from happening.Around late December, I began experiencing some chest tightness. I visited the doctor and he performed an EKG. Everything was fine.In January, I started at a new school. I began attending a four-year institution, which was more stressful than the community college I was attending. Chest pain and discomfort seemed to go away during January and through March. I feel that the new stress from school was a good thing, because it gave me something to focus on. Other than continue worrying about my health.Again recently, after coming home from a very stressful week of both work and school, I came home and felt a sharp pain in the right side of the chest. I had experienced this type of pain before, but it lasted for around one-hour and 45-minutes. I was freaking out, so I called my doctor on his cell phone. He asked me several questions, and decided that I just needed to take some Advil and that there was no need to go to the ER. I felt fine almost immediately after getting off the phone with him.But in the days after, the chest pain and discomfort continued. One night, I had started to feel a pain in my arms, reading that pain in the arm is associated with heart attacks I panicked. That night I went to the ER again. At the ER the performed some blood tests and x-rays. Again, they found nothing wrong.I’ve had other with feelings, such as tingling in my body, random spasms, even a cold sensation in my forehead. But I’ve decided this is all stress. After so many doctors that have studied for years and had years of experience, none of them have found anything wrong with me.Why am I worrying? I don’t know. But I need to stop. I want to cast my anxieties away. I want to declare myself free from these fears. These pains and weird sensations are all because of my anxiety. I want to stop. No more anxiety, no more fear. I want to be free.It all started when I overanalyzed and concluded the worst possible situation over some stomach pain. I declare no more. I declare freedom.",
            "post_id": "7900697",
            "timestamp": "1335506506",
            "user_id": "user_2129928",
            "user_link": "/personal_pages/user/2129928",
            "votes": "0"
        },
        {
            "answer": "Can someone tell me if they have had constant (doesn't go away) left side chest pain for more then 3 months.  To make my story short over the past three months I have gone to the ER once thinking I was having a heart attack which I wasn't. The symtoms I had which took me to the ER were rapid heart beat and felling of passing out.  I didn't have chest pain when I went to ER this chest pain came a week after ER visit.I have had the following test done: 4 chest X-ray, 1 chest cat scan (with dye), 2 echo, 3 EKG, 1 stress test, 1 endoscopy, ultrasound of liver, pancreas and gallbladder, thyroid, 1 mammogram,  3 complete blood work and 2 urine test. All came back negative and well. I was also tested for mono virus (negative also) because in between my panic attack (visit to ER) and the chest pain (a week after ER)  I had kind of bad cold with a lot of cough.I'm being sent to a Rheumatologist this week for some other tests.  I have been diagnosed with supposed pleurisy (because of the bad cold / cough I had 2 months ago) and or perhaps some anxiety or stress. I don't know what to think anymore.  One minute I think I might be dying or have something they haven't discover yet.  Sometimes I think the constant pain in the chest could be pleurisy like the doctor think it could be or that it could be coming from my back or something with nerve disfuntion due to past car accidents (I never experienced chest pain then or never in my life until this past 3 months). I do have anxiety due to all this constant pain on my left side that doesn't go away but I'm confused because I don't know if this pain is real or is just my mind. I feel pain all over my chest muscle or rib from time to time but the main pain that is always constant for the past 3 months I only feel when I take a deep breath I feel it like a sharp pain but only on the left side.  Someone has the same? Can someone be so kind to tell me what they think?....sorry for misspellings english is not my first language.  Thank you so much!",
            "post_id": "7952220",
            "timestamp": "1337023000",
            "user_id": "user_2164412",
            "user_link": "/personal_pages/user/2164412",
            "votes": "0"
        },
        {
            "answer": "This message board has helped me today. Just like every other day I have some weird symptom that makes me feel like I'm dying. This week it has been left arm pain. But last week it was feeling confused and foggy. The month before it was chest pain and palpitations. A few months before that it's tight chest and shortness of breath. Sometimes is hot/cold flashes and clammy fingers and tingly toes and dry mouth. It's like my anxiety is always trying to out-smart me. As soon as I get used to a symptom or get it checked and know it's not fatal, my body moves on. I'm in constant fear and confusion because how will I ever know if a symptom is serious or just the new manifestation of anxiety? I hate fighting my way through every day telling myself I'm going to be okay, telling myself I'm going to live. I think the longer this goes on perhaps the more strength I'll have to fight it because I can count the days I've won before. Lately reading the Bible has helped and if you are fearing death, perhaps having faith in the afterlife and strength from God is the best of comfort. We all need to read these posts and remind ourselves that these symptoms aren't just ours, they are common and we all suffer but knowing we aren't alone can help us fight back against our symptoms.",
            "post_id": "7984067",
            "timestamp": "1337891004",
            "user_id": "user_2184599",
            "user_link": "/personal_pages/user/2184599",
            "votes": "0"
        },
        {
            "answer": "Hi Guys, am glad am not the only one going through this problem, also have symptoms that were mentioned below and have been to several doctors including physiotherapist, blood tests, ecg chests scans, everything is fine. They prescribed Azlam 0.5 mg, which does not help that much. I stay alone, it gets worse when am on my own but when my girlfriend is sleeping over it gets better. Is there anything that can be done or diet that I can take to calm palpitation especially because they are the worst? Gudluck to everyone",
            "post_id": "8023283",
            "timestamp": "1338993938",
            "user_id": "user_2208372",
            "user_link": "/personal_pages/user/2208372",
            "votes": "0"
        },
        {
            "answer": "Hey all, I've been feeling my symptoms for about 6 months now arm pain, chest pain, neck pain,jaw pain, and finger pain(which is really bad). At first it was every now and then but this past month its been there all day everyday. It driving me frigging nuts.. Its there when i'm calm and in a good mood and its there when i'm stressing about it. I've been to the emergency 3 times and got a ecg done and it was fine. But that doesn't ease my mind at all, i cant stop thinking that it has to be something wrong that's serious, It seemed to be getting a little better 2 months ago but then my cousin who lives across the country had a heart attack after overdoseing on his prescription meds(this was intentional) After i heard that the pain has doubled.. ughh i just dont know what to do its ruining my life.. I work out of town and every time i go i get scared because i'm thinking this could be the time i have the heart attack.. Im hoping this is anxiety and if it is what do you all do to get rid of it cause all the things i have tried haven't worked(excercise,accepting it and eating better. Can anxiety be there all day evryday happy,sad, sleeping or working????????",
            "post_id": "8106062",
            "timestamp": "1341287983",
            "user_id": "user_3101966",
            "user_link": "/personal_pages/user/3101966",
            "votes": "0"
        },
        {
            "answer": "Hey! I'm only 17 and recently like maybe the past 2-3 weeks i have been hurting n my chest and having chest tightness and horrible headaches. they did bloodwork EKG's xrays and alot more and havent found a thing and told me mine was anxiety and put me on meds twice a day for it. which the meds make me sleepy and so i really dont function right but if its not one thing its another! lol",
            "post_id": "8114587",
            "timestamp": "1341551461",
            "user_id": "user_3108028",
            "user_link": "/personal_pages/user/3108028",
            "votes": "0"
        },
        {
            "answer": "Please try yoga it has done good to me. Practice pranayam(you can find the techniques on youtube) for just 30 mins daily it would do wonders trust me.Try for at least a month with determination things will definetly change for good.Good luck all",
            "post_id": "8118239",
            "timestamp": "1341672458",
            "user_id": "user_3110586",
            "user_link": "/personal_pages/user/3110586",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone. If you are suffering from any anxiety, Please please please read a book by Dr Claire Weekes, its called Essential Help for Your Nerves. I have suffered for years with every symptom possible, been to A & E and have had numerous test and trust me this book has worked wonders. I can not recommend it enough. I think she has several books out and all deal with anxiety. They are amazing.......A real life changer. I have never read a book like this before. Dr weekes seems to understand and explain every symptom possible in anxiety and why we get them. The book has practical solutions on how to remover which is the best bit.",
            "post_id": "8131427",
            "timestamp": "1342045770",
            "user_id": "user_3120067",
            "user_link": "/personal_pages/user/3120067",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone. If you are suffering from any anxiety, Please please please read a book by Dr Claire Weekes, its called Essential Help for Your Nerves. I have suffered for years with every symptom possible, been to A & E and have had numerous test and trust me this book has worked wonders. I can not recommend it enough. I think she has several books out and all deal with anxiety. They are amazing.......A real life changer. I have never read a book like this before. Dr weekes seems to understand and explain every symptom possible in anxiety and why we get them. The book has practical solutions on how to remover which is the best bit.",
            "post_id": "8131437",
            "timestamp": "1342045919",
            "user_id": "user_3120067",
            "user_link": "/personal_pages/user/3120067",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm a 13 yr old girl and have anxiety. I have been CONVINCED I am going to have a heart attack even though I've had an EKG, ECG, and chest xray done. The reason for my worries are because I have had indigestion, sharp arm pains(mostly in the left), back aches, abdominal cramps, sharp jaw pains(again, left side), chest pains, headaches, lots of lightheadedness,the list goes on and on. The pains come an go. It started about a month ago when I was in camp, not stressed or worried at all and suddenly I had a sharp, shooting pain in my left arm that came and went, and diarrhea that week. In camp last week, we went to an amusement park an I was even to scared to go on some of the rides because  of warnings of heart conditions. Do you think this might still be a heart attack???",
            "post_id": "8195109",
            "timestamp": "1343782000",
            "user_id": "user_3163138",
            "user_link": "/personal_pages/user/3163138",
            "votes": "0"
        },
        {
            "answer": "I'm 33 and have been suffering with the dreaded anxiety diagnosis. Its rough to say the least and has taken my life over. It started when I was 19. I took every medication under the sun it seems but none helped. I don't smoke.or even drink anything with caffine. My brain runs costantly..I wake up light I got hit by lightning, and I can't go back to sleep, or get any relief. My shoulders are always raised, my toes curled, jaws clinched, sweaty arm pits, on top of the chest pains. Its a nightmare and it has destroyed my life. If anyone had it this bad and found relief, id love your input. Thank you.",
            "post_id": "8210611",
            "timestamp": "1344216529",
            "user_id": "user_3173374",
            "user_link": "/personal_pages/user/3173374",
            "votes": "0"
        },
        {
            "answer": "35 and yes all of the above mentioned chest, arm, neck back of neck and even palpitations all freak me out espacially when you have young children at home and a family depending on your well being, but foe some reason I believe its Gods way of keeping me in check cause out of all the ER visits, specialist holster monitors doctor appointments EKGs and so on, it all comes back normal... I'm praying for all of you and I ask the same in return God Bless you all",
            "post_id": "8219875",
            "timestamp": "1344466968",
            "user_id": "user_3179641",
            "user_link": "/personal_pages/user/3179641",
            "votes": "0"
        },
        {
            "answer": "Thank you for your post justlookingforanswers!  I too suffer terribly from anxiety - same issues with the heart/chest pain.  Been to the ER, have had stress tests, ECGs and everything looks great.  I know that my heart is fine in the logical part of my brain - but when the panic/anxiety kicks in... forget about anything logical.  It's sad so many of us suffer with this, but it's also comforting to know that we are not alone.",
            "post_id": "8306422",
            "timestamp": "1346962130",
            "user_id": "user_3247427",
            "user_link": "/personal_pages/user/3247427",
            "votes": "0"
        },
        {
            "answer": "Thank you KirstinMC - I just joined this forum and so grateful to have found it!  Your post was exactly what I needed to read today - I always start panicking when I feel the slightest difference in my heartbeat and that just leads me down a road of craziness (ER visits, wanting to go home and rest, not wanting to drive).  So, thank you for posting your message - I know it was written a long time ago, but it's helpful for newbies like me.",
            "post_id": "8306457",
            "timestamp": "1346962852",
            "user_id": "user_3247427",
            "user_link": "/personal_pages/user/3247427",
            "votes": "0"
        },
        {
            "answer": "Yes to all of that off and on for 25 years. Ativan should help you. Ask your doctor for it. It is a wonder drug, but it does cause dependency. In my opinion a dependency is better than anxiety. Maybe you'll agree. Antidepressants can help but take a while to kick in. Steer clear of Effexor because you cannot miss a dose or stop taking it. The withdrawal symptoms are hell. Lexapro or Zoloft are good choices. Cognitive Behavioral Therapy has been proven to help. There are web sites that allow you to do that on-line for free.",
            "post_id": "8323151",
            "timestamp": "1347478333",
            "user_id": "user_1717974",
            "user_link": "/personal_pages/user/1717974",
            "votes": "0"
        },
        {
            "answer": "Two weeks ago, my husband called 911 coz I woke up shaking and in cold sweats.  My face experienced involuntary muscle spasms/twitching and I started mumbling words and just could not speak.  I thought I was having a stroke.  Weeks before this episode, however, I also have been experiencing some chest discomfort (not pain but more like a twitching or spasm) sometimes on the left side and sometimes on the right but mostly on the left side.  I have been also having some left arm discomfort which became worse after the episode two weeks ago.  Just like all of you, they did all kinds of tests, EKG, MRI, CT scan, Carotid x-ray/ultrasound, EEG-all came back negative. I am back home resting but once in a while I still feel the shakes, the sudden chest discomfort which will last only a few seconds and the pain on my left arm.  Sometimes I feel my jaw also tightening and discomfort on my neck.  I am now on a very low dose of Xanax and that's just about it.  Doctors said it ia all anxiety and stress related.  I would like to believe that it is just that and not anyhting physical but I think anxiety and stress are so mcuh more difficult to treat than any physical/structural problems.  I am just so \"glad\" (coz I am really no glad that we are experiencing these) that I am not alone andthat I am not crazy!",
            "post_id": "8366063",
            "timestamp": "1348700044",
            "user_id": "user_3941776",
            "user_link": "/personal_pages/user/3941776",
            "votes": "0"
        },
        {
            "answer": "I havent read this thread in a long while but it is reassuring to know of the experiences of others - i have had most of the symptoms described above at one time or another over the last 3-4 years and also all the heart/blood testsI have now stopped taking Sertraline (50mg) which had been prescribed by my doc - the last few months i was only taking one tablet every other day anywayStress is difficult to shake - i have recently left my old job (which I had attributed to most of my stress) and started a new one in the sunshine with less work and a lot more money - and after 5 weeks of being completely fine i got the chest/arm pain and anxiety symptons the other dayI just try to get off my feet when it occurs and I hope that a prolonged period of less work and the sun will help mattersI do find that if i am having a conversation with someone who I find 'boring/annoying' my symptoms are more likely to arise (that is a serious comment btw not a rude one)(ps i have a slight numbness/twitch in my left eye as I type this (another of my most common but less annoying symptoms!! :) )",
            "post_id": "8555976",
            "timestamp": "1354003754",
            "user_id": "user_4399970",
            "user_link": "/personal_pages/user/4399970",
            "votes": "0"
        },
        {
            "answer": "I'm 13 almost 14 and for the past year I've had very bad anxiety and I was diagnosed with moderate to severe deppression and latly I'vebeen very scard cause I get pains in the fingers and my upper left chest and I've had a terrible fear of dieing and I'm to afraid to tell my mom about it cause for some reason I'm terrifyed of going to the doctors what should I do?",
            "post_id": "8720044",
            "timestamp": "1357888016",
            "user_id": "user_4679616",
            "user_link": "/personal_pages/user/4679616",
            "votes": "0"
        },
        {
            "answer": "It is best if you start your own thread and repost your problem there, rather than list your problem on someone else's. You will get more replies that way. There is also a teen section on Medhelp which you might get help from.",
            "post_id": "8720070",
            "timestamp": "1357888528",
            "user_id": "user_676326",
            "user_link": "/personal_pages/user/676326",
            "votes": "0"
        },
        {
            "answer": "I have constant chestpain in the middle of my chest all day it hurts when i ben down or try to lsyon my side what can it be",
            "post_id": "9368219",
            "timestamp": "1375942832",
            "user_id": "user_5879088",
            "user_link": "/personal_pages/user/5879088",
            "votes": "0"
        },
        {
            "answer": "Have you asked your doc about it? If it is from bending and lying it sounds like a physical thing, perhaps pulled muscle.",
            "post_id": "9376770",
            "timestamp": "1376192478",
            "user_id": "user_676326",
            "user_link": "/personal_pages/user/676326",
            "votes": "0"
        },
        {
            "answer": "Wow, reading all of this is very helpful for me as well.I have had anxiety issues in different capacities for as long as I can remember. I am now 30 years of age and it has manifested itself much like you all are describing.I, too have found that the more distracted I am (exercise, work, socializing, etc) the less I feel the symptoms both physically and emotionally.I also have had reassurance from physicians after ekg's, blood pressure/pulse monitoring, and blood tests that there is nothing physically wrong with me and I am in ideal health. They even chuckle when I tell them I run 3-5 miles per day/5-6 days per week as if it were a serious physical condition I would A) not be able to handle even half of that exercise and B) I wouldn't feel relief both during and after.It's tough to live with the fear, but I have researched some CBT, meditation, and even some religious therapies and exercises which all help a little bit at a time. Medication has also never been much of a help to me and I have been in trying, anxiety-filled times in the past where it always has passed as long as I didn't let it completely control my life.This time around is a bit more confusing however, having the symptoms more so physically than emotionally, but as we all can see, this thread is helpful on it's own as it has stood the test of time!Just wanted to show my appreciation for it.",
            "post_id": "9628957",
            "timestamp": "1383585581",
            "user_id": "user_6668645",
            "user_link": "/personal_pages/user/6668645",
            "votes": "0"
        },
        {
            "answer": "Hi, everybody I had anxiety for three years now and now I am sure that anxiety is what I have. Before I thought it was a heart condition or maybe I was going crazy; I feared everything, since I was too used to being healthy. Well I've come to realize that anxiety is like bullying, it teases you and frightens us, but that will end if we start fighting it and no let it take over our lives. We only live once and this is not the way to live.We need to relax and stop worring. Remember when you used to not have anxiety and our heart would beat fast after exercising, and you wouldn't get scared?  But since the first attack we have been fearing the nextand the next. And we give it to much important and that why it does what it does. Lets relax and fight it, talk to it tell it I feel you and that's fine but you don't scare me anymore. Keep practicing until that day that it knows you don't follow the game then it will leave.Something that really helped me is changing your lifestyle a little like don't drink as much exercise a little like run.and try not to stress, nothing in this world is worth more than our health.",
            "post_id": "9637510",
            "timestamp": "1383809438",
            "user_id": "user_6692658",
            "user_link": "/personal_pages/user/6692658",
            "votes": "0"
        },
        {
            "answer": "my husband 82 with Alzheimers was put into a VA Hosp, Baltimore two days ago, I have had anxiety for many years, but never had to take any more then 1 & 1/2 tabs at bedtime, I am 66the pains started up yesterday, and today I thought I was going to actually die the burning pains were so bad I could not stand up straight , I took my max of 4 500mg Tylenol during the day trying to ease it, no luck, finally took one Xanax fell asleep on the couch and woke with no pain. the stress here is so thick it could be cut with a knife,",
            "post_id": "9642514",
            "timestamp": "1383952345",
            "user_id": "user_6705935",
            "user_link": "/personal_pages/user/6705935",
            "votes": "0"
        },
        {
            "answer": "Me too.  Left side and seems to radiate down my arm.  Been going on for two years but recently morphed into a slightly more stabbing pain on occasion.   I have made the correlation of stress by 1) happens when I drive as passenger with my hisband and 2) I got pulled over and it started.  One thing that does help is regular vigorous exercise.   Asprin, tylenol and nothing else mkes it better.  I know its stress but here I am \"reassuring\" myself.   Have not sought help through doctors yet.",
            "post_id": "9672837",
            "timestamp": "1384820563",
            "user_id": "user_6789512",
            "user_link": "/personal_pages/user/6789512",
            "votes": "0"
        },
        {
            "answer": "I was recently diagnosis with anxiety, I am so tired of feeling this way. I am wondering when relief is going to come because I feel like sometimes I am not going to make it. My doctor said I need to exercise more and from reading this thread I know it helps . I need all encouragement because I am not use to this feeling... I want my life back !! HELP",
            "post_id": "10149368",
            "timestamp": "1395933523",
            "user_id": "user_7977836",
            "user_link": "/personal_pages/user/7977836",
            "votes": "0"
        },
        {
            "answer": "lipitor (and all statins) can cause muscle pain.",
            "post_id": "10318487",
            "timestamp": "1398805213",
            "user_id": "user_8581193",
            "user_link": "/personal_pages/user/8581193",
            "votes": "0"
        },
        {
            "answer": "You have demons and need to be delivered.  The demon of fear and anxiety especially. I wasn't a believer until I had this happen and you can literally feel these things crawling out of your back up your arm, making you cough and vomit them out.  Ever since that night I believe in demons but more so I put my faith in Jesus Christ. I know, I used to laugh at people that post crazy **** and said they should be committed.  Craziest night of my life and better ever since was the night.  I swear I just googled something and they are about to release a film here in 2014 called \"Deliver us from Evil\" the D is right above EVIL. Jerry Bruckheimer based on true events in 2001.",
            "post_id": "10514554",
            "timestamp": "1401905029",
            "user_id": "user_9137841",
            "user_link": "/personal_pages/user/9137841",
            "votes": "0"
        },
        {
            "answer": "I everybody I am new to this. I know what is GAD and sever panic attacks. I know what i have is this because i was diagnosed with it.  I also know i basically have all the symptoms under the sun that relate to tjis and i could freak out over the littlest thing if it relates to my health. I have been cleared medically of any ill health ekg are s ok etc..i see a shrink once a week i am on a beta blocker and two tiny water pills for my bp.i also take one atavan on a as need basis. This post site helps some what knowing people have the same as i do. I have had panic attacks for 17 years and i started only resently since i was discharged from the hospital for having a bursa sac infection started having the anxiety panic strike me the same way it did when it started back in 97. The attacks for the last 5 years have been almost nkn exsistant. Any segestions or comments on how to get my head around to commen sense and telling my self what i know what it is.  I want to be undercontrol and pain free. Thanks for taking the time to read it and listen.",
            "post_id": "11431669",
            "timestamp": "1414605047",
            "user_id": "user_11018511",
            "user_link": "/personal_pages/user/11018511",
            "votes": "0"
        },
        {
            "answer": "You might get a better response if you start your own thread because this one has a hodge-podge of old issues and many of the people only post for a week and so aren't here anymore.If so, just use this link.http://www.medhelp.org/posts/new_with_new_subject?forum_id=71",
            "post_id": "11433051",
            "timestamp": "1414620406",
            "user_id": "user_676326",
            "user_link": "/personal_pages/user/676326",
            "votes": "0"
        },
        {
            "answer": "Hi, I have panic attack 5-6 months ago, since then my anxiety went of the roof, my life turned upside down, getting all sorts of symptoms everyday, mental and physical torture, it's hell but after a few months I was able to control my anxiety and started getting a day or two feeling normal again then suddenly out of the blue i get a tingling pain in my lower breastbone, I didn't freak out instead I googled the symptoms and and found out it can be heartburn or heart attack, since then I'm back at square one with my anxiety, monitoring my chest every second then 1 night both my arms feels numb and I freakout and was about to go on a full blown panic attack but was able to calm it down, after that my left arm (inner bicep area) feels like nerves being stretched inside at first it doesn't hurt much but later on its mild and severe and goes away in a few minutes, it comes and goes randomly mostly when I'm unaware of it, then after a few days it got milder and almost gone but then the next day its my right arm and had the same pain with random shoulder and back pains too.Now its been 3 weeks having this awful symptom and torturing my mind knowing I might die anytime, a week after the symptoms occur I was able to go to the doctor and got some Ecg, Xray and blood work test... all came out fine, yet I'm still not convince, they may have missed something or is this my anxiety?, the pain is real and it gets worse each day.I'm just wondering how are you guys doing right now those who posted here with the same symptoms, I wish all you people are doing great and already free from this.",
            "post_id": "11718915",
            "timestamp": "1419359265",
            "user_id": "user_9852476",
            "user_link": "/personal_pages/user/9852476",
            "votes": "0"
        },
        {
            "answer": "I too have anxiety. I experience hot flushes, chest pains, I find myself crying a lot, can't sleep properly and I cry myself to sleep most nights and sometimes I cuddle my pillow to help me sleep. My doctor told me I'm not having a heart attack, my family have told me too, I just can't seem to get it out of my mind some days. I have been to the orthodontist about my teeth and as it turns out I have a crossbite and will be needing braces within 6 months. I also have a jaw that locks and clicks and my orthodontist told me that's what caused my crossbite and he even said to me that I'm not having a heart attack either. He asked me if I get nervous and anxious at dentist and orthodontist and I said yes I do. I've had braces before, I know this sounds crazy, but I'll be glad to get braces back on. I'm like a bag of nerves and on edge, feels like I'm going crazy. My doctor also told me if I got my jaw fixed, it could fix my ears, so I'm staying hopeful for that, hopefully it could fix the anxiety and on top of all that I have dizziness, so it could fix everything. I'm trying to stay positive, but its really hard. I also get chest pains and don't like them at all, my arm hurts every now and then. I probably had this before and didn't even notice anything. I went to the website anxiety centre and read all the symptoms it said on there and I have it. I clench and grind my teeth without me knowing and after that happens, it hurts and I cry. I just want this anxiety to go away and want my life back.",
            "post_id": "12120568",
            "timestamp": "1425528511",
            "user_id": "user_12484910",
            "user_link": "/personal_pages/user/12484910",
            "votes": "0"
        },
        {
            "answer": "One the hardest things in life is coming to realization that we all have to go through things.  Everyone will not go through the things the same. Some people will have severity and some very minor.  I think what tops it off is the unknowing. No one but God knows what we will face and as we watch others face things in their life, we often say \"what if that happens to me\" will I be able to handle it.  This is where the anxiety rears its ugly head. I think everyone experiences some sort of anxiety at one point in their life, but there are a select few  that reaches the peaks of anxiety. Not sure how long I have been experiencing it but I think after 30, the anxiety really hit me!  I try my best not to let it get to me, but sometimes I can't help but think \"am I dying\"... Especially when you see others \"as young as you\" dying of some of the same issues you totally fear.  However, I am a person who trusts God!  My parents are well in their 60s and doing well and they have taught me how to lean on him. Everyday, I work to get closer and closer to him and every day  a little of my anxiety fades.  Its a battle that we must fight daily, but I won't give up! I love my life and will continue living it to the best of my ability as long as I have God on my side!!!  Take care everyone! #wegotthis",
            "post_id": "12241518",
            "timestamp": "1427318945",
            "user_id": "user_12803789",
            "user_link": "/personal_pages/user/12803789",
            "votes": "0"
        },
        {
            "answer": "Hi all I'm glad I found this site as I believed I was going madIt all started for me approx 12 months ago after a heavy drinking weekend on a stag tripIt's gradually got worse and I've been taken to a and e twice but all tests show my heart is goodI've seen the doctor and specialist more over the last 12 months than I've seen my wife(Yet I still think I'm having a heart attackI've got most of the descriptions that belong to a heart attackAr/shoulder pain/ fast pulse etcI can't seem to get it into my head that it's anxiety and it's driving me crazy",
            "post_id": "12302007",
            "timestamp": "1427926238",
            "user_id": "user_12955728",
            "user_link": "/personal_pages/user/12955728",
            "votes": "0"
        },
        {
            "answer": "I feel the exact same way. Im only 22 and my left side chest hurts arm hurts my back and left shoulder hurts. Doctors say im fine but i need to exercise and do more things but im scared my hearts going to pop. Im scared to do anything strenuous when i walk up the stairs in my house i have to do it slowly or my heart will start racing really fast. I cant believe i have such bad anxiety at such a young age. I used to wrestle in high school and do mixed martial arts now im scared to even walk up stairs...... i just wish there was some factual explanation besides stress and anxiety causing this.",
            "post_id": "12933313",
            "timestamp": "1436436190",
            "user_id": "user_14775422",
            "user_link": "/personal_pages/user/14775422",
            "votes": "0"
        },
        {
            "answer": "It is very comforting to see that other people feel the way I do (though I wouldn't wish these feelings on anyone else). My anxiety has come and gone for 3 years now. Flared up when my grandpa had a heart attack, then again when my sister died of preeclampsia, then again when my mom died of a heart attack. The last year I was on Lexapro and did wonderful. but I quit taking it because I wanted to see if it was gone, and if not I wanted to try to cope with it on my own and see if I can get passed it. Well....I've been off the meds for about 4 months now and the symptoms have come back: chest pain, arm pain, constant shoulder and upper back pain, nervous stomach, panic attacks, feeling like I'm going to die, constantly researching heart issues and anxiety because i'm convinced im going to have a heart attack. What scares me the most is the week before my mom's heart attack she thought she had anxiety, she described her symptoms to me and asked if that's how my anxiety felt and it was exactly the same. The morning of her heart attack she asked for a klonopin that i had because she was feeling very \"anxious\".... two hours later she has a heart attack and dies. Now I CANT stop obsessing about it and worrying that I'll just think I have anxiety and end up having  a heart attack too. I have been to the ER 3 times thinking that I'm dying and had EKGs that have fine, along with chest xrays. But I still don't feel peace of mind, and this anxiety is literally taking over and ruining my life....",
            "post_id": "13015427",
            "timestamp": "1437798129",
            "user_id": "user_14997314",
            "user_link": "/personal_pages/user/14997314",
            "votes": "0"
        },
        {
            "answer": ". I am describing my problem here. Please help me in this context. Please suggest me. I wiil follow Your suggestions. Please reply for this message.I am a having anxiety problem (based on my symptoms i concluded) from past two years. Continuously I am having chest pain and the pain is transferring back side of left shoulder to front side of chest. My left finger nerve is shaking also paining. I met five doctors who are general medicine and one neurologist, ENT and Psychiatrist. I have taken test like ECG and chest X-ray, Blood test and thyroid test. Everything showed normal. It’s taken me one year to recognize it is due to anxiety. Doctor suggested me clonazepam 0.25mg for two months, after taking that tablet I feel 80% reduction in my pain. The dosage was increased to 0.5mg and used for two months. Almost my problem disappears and at that time I stopped taking tablets. For three months everything is ok and after that the problem come again and again. Whenever I am taking clonazepam I feel ok and if I am not taking I can’t able to bear the nerve pain, chest pain and uneasy and confusion. Sometimes I am frustrated and feeling hopeless. Even exercise also not giving any relax to me.Sometimes I am feeling something happen to my heart, I will get heart attack and so many negative thoughts. I am unable to concentrate on my studies. Even I can’t able to enjoy fully, things like parties, watching movies and chat with friends. I am always having fear of chest pain and anxiety. I am always keeping clonazepam in my pocket. That much bad situation I am facing. My friends are suggesting me to go to yoga and try for acupuncture. But I am feeling nothing will cure my problem. I am avoiding lonely traveling and going far places where there is no availability of doctor. I know all this things are nonsense. Sometimes I will feel like I am brave person and I can overcome all this things. Whenever fear comes I am becoming over anxious. This problem was severe at staring but now I started reading so many articles on this and got some confidence. But help me to fully and completely getting out of this and continue my routine life without taking clonazepam. Fully irritated and frustrated with this problem. Its completely taken away my life from the past two years. Plzzzzzzzzzzzz suggest me.I am expecting a solution because I met all doctors all are saying it is due to your thinking and you don’t have any health problem. Always they are prescribing clonazepam. Suggest me some Ayurveda medicines which will cure my symptoms",
            "post_id": "13161429",
            "timestamp": "1440482889",
            "user_id": "user_15427003",
            "user_link": "/personal_pages/user/15427003",
            "votes": "0"
        },
        {
            "answer": "Yes i hav. but all are saying its due tp anxiety",
            "post_id": "13161502",
            "timestamp": "1440484490",
            "user_id": "user_15427003",
            "user_link": "/personal_pages/user/15427003",
            "votes": "0"
        },
        {
            "answer": "There are over 100 anxiety symptoms and signs for anxiety, anxiety attacks (panic attacks), and other anxiety disorders including symptoms:• Numbness and tingling• Dizziness• Chest pain• Headaches• Neck tension• Stomach upset, nervous stomach• Pulsing in the ear• Burning skin• Fear of impending doom• Nausea• Shortness of breath• Electric shock feeling• Shooting pains in the face• Heart palpitations• Weakness in legs• Feeling like you are going crazy• Inability to rest• Sleep problemsThere are a great many more anxiety symptomsThe first part of the battle is knowing that it is just anxiety",
            "post_id": "13164915",
            "timestamp": "1440541242",
            "user_id": "user_8021128",
            "user_link": "/personal_pages/user/8021128",
            "votes": "0"
        },
        {
            "answer": "I studied so many articles on that. but whenever the pain is physical i cant able to believe its due to anxiety.",
            "post_id": "13166815",
            "timestamp": "1440568217",
            "user_id": "user_15427003",
            "user_link": "/personal_pages/user/15427003",
            "votes": "0"
        },
        {
            "answer": "Lots of the symptoms are psychsomatic so being anxious and depressed do cause alot of them.Beat your mind and conquer the fear, hard but it can be done and im going through the same thing you are.",
            "post_id": "13174926",
            "timestamp": "1440706856",
            "user_id": "user_8021128",
            "user_link": "/personal_pages/user/8021128",
            "votes": "0"
        },
        {
            "answer": "I'm 22 years  I had  the same issue which was worse irregular heartbeat skipping 2 to 3 seconds,  the burning effect and pain extending to my left jaw and arms, constant palpitations of upto  150 per min,  several diagnosis revealed am Okey of which was wasn't at all.  But now the issue  has gone completely. First and foremost you have to believe you will heal yourself.  You the only one who knows what's going on inside you and every minute you ain't sure if you will  be alive,  the following is what I did and completely healing myself.1.  Change life style.  Start walking 1hour  daily. Do not do strainous activities,  it will lead to internal bleeding.2. Cut down all fats and processed foods.  Do not eat anything that has a face or a mother. Meaning all kind of meats. Avoid fastfoods.  Eat food in there natural state.3 Start eating fruit salad  or simply alot of fruits daily,  don't take avocado it has fats.4. Start taking warm water after every meal, when you wake up in the morning make it a habit before breakfast.  Add some lemon to the water as you take daily.5. MEDICATION MOST IMPORTANT.a) get Atorvastin 20mg Tabs and take it 1/2x1 at night for a week then stop it. It's for reducing cholesterol that is  hidden can't be determined by most doctor,  that's why you feel your heart strains and getting tired to pump.b) get Neptune tabs 25th and take it 1 x 1 daily  for a month,  the Last week reduce the intake slowly by 1/2 x 1.c) get Ascard-75 tablet and take it for a month  also.The last days you can try to get away from the drugs in a smooth way by reducing the intake by half daily for 4 days then start skipping a day,  for a week.Follow it strictly and you going to be fine as I am at the moment.   We are here to help each other. Incase of any question email me ***@****",
            "post_id": "13421870",
            "timestamp": "1446355085",
            "user_id": "user_16236717",
            "user_link": "/personal_pages/user/16236717",
            "votes": "0"
        },
        {
            "answer": "I'm 22 years  I had  the same issue which was worse irregular heartbeat skipping 2 to 3 seconds,  the burning effect and pain extending to my left jaw and arms, constant palpitations of upto  150 per min,  several diagnosis revealed am Okey of which was wasn't at all.  But now the issue  has gone completely. First and foremost you have to believe you will heal yourself.  You the only one who knows what's going on inside you and every minute you ain't sure if you will  be alive,  the following is what I did and completely healing myself.1.  Change life style.  Start walking 1hour  daily. Do not do strainous activities,  it will lead to internal bleeding.2. Cut down all fats and processed foods.  Do not eat anything that has a face or a mother. Meaning all kind of meats. Avoid fastfoods.  Eat food in there natural state.3 Start eating fruit salad  or simply alot of fruits daily,  don't take avocado it has fats.4. Start taking warm water after every meal, when you wake up in the morning make it a habit before breakfast.  Add some lemon to the water as you take daily.5. MEDICATION MOST IMPORTANT.a) get Atorvastin 20mg Tabs and take it 1/2x1 at night for a week then stop it. It's for reducing cholesterol that is  hidden can't be determined by most doctor,  that's why you feel your heart strains and getting tired to pump.b) get Neptune tabs 25th and take it 1 x 1 daily  for a month,  the Last week reduce the intake slowly by 1/2 x 1.c) get Ascard-75 tablet and take it for a month  also.The last days you can try to get away from the drugs in a smooth way by reducing the intake by half daily for 4 days then start skipping a day,  for a week.Follow it strictly and you going to be fine as I am at the moment.   We are here to help each other. Incase of any question email me ***@****",
            "post_id": "13421898",
            "timestamp": "1446356637",
            "user_id": "user_16236717",
            "user_link": "/personal_pages/user/16236717",
            "votes": "0"
        },
        {
            "answer": "I'm 22 years  I had  the same issue which was worse irregular heartbeat skipping 2 to 3 seconds,  the burning effect and pain extending to my left jaw and arms, constant palpitations of upto  150 per min,  several diagnosis revealed am Okey of which was wasn't at all.  But now the issue  has gone completely. First and foremost you have to believe you will heal yourself.  You the only one who knows what's going on inside you and every minute you ain't sure if you will  be alive,  the following is what I did and completely healing myself.1.  Change life style.  Start walking 1hour  daily. Do not do strainous activities,  it will lead to internal bleeding.2. Cut down all fats and processed foods.  Do not eat anything that has a face or a mother. Meaning all kind of meats. Avoid fastfoods.  Eat food in there natural state.3 Start eating fruit salad  or simply alot of fruits daily,  don't take avocado it has fats.4. Start taking warm water after every meal, when you wake up in the morning make it a habit before breakfast.  Add some lemon to the water as you take daily.5. MEDICATION MOST IMPORTANT.a) get Atorvastin 20mg Tabs and take it 1/2x1 at night for a week then stop it. It's for reducing cholesterol that is  hidden can't be determined by most doctor,  that's why you feel your heart strains and getting tired to pump.b) get Neptune tabs 25th and take it 1 x 1 daily  for a month,  the Last week reduce the intake slowly by 1/2 x 1.c) get Ascard-75 tablet and take it for a month  also.The last days you can try to get away from the drugs in a smooth way by reducing the intake by half daily for 4 days then start skipping a day,  for a week.Follow it strictly and you going to be fine as I am at the moment.   We are here to help each other. Incase of any question email me ***@****",
            "post_id": "13421900",
            "timestamp": "1446356877",
            "user_id": "user_16236717",
            "user_link": "/personal_pages/user/16236717",
            "votes": "0"
        }
    ],
    "post_id": "14585",
    "question": "I'm 34 yr old male and have been experiencing various chest and left arm pains for about three months.  I've seen a plethora of doctors from cardiologist to internist to GI doc to psychologist.  Heart problems have been ruled out by numerous EKG's and stress echo test.  GI doc found I have a hiatal hernia/GERD from upper GI and is currently being treated with Nexium.  Have also had ultrasound of liver/gall bladder and MRI of abdomen - all normal.  Feel like a pin cushion from all the blood work - again all within normal ranges.My psychologist insists anxiety is the culprit.  Though I have been under a fair amount of stress with work and family, can these pains linger around for this long just from anxiety?  They come and go throughout the day and are very disruptive to my thinking of 'what's going on with me? - which I'm guessing only breeds more anxiety.The only other med I'm on is Lipitor for cholestorol.I'm reluctant to try any anti-anxiety meds since I had a bad bout with cymbalta a few months back and I really don't feel as though I need it.  I just want the pain to stop.  I've tried numerous relaxation and meditation methods which are very calming and helpful, but still the pain comes.  The only time I don't notice it is when I'm exercising (usually run 3-6 miles/day).Any thoughts of what's going on?  Anxiety, current med side effects or something else?",
    "timestamp": "1169618400",
    "title": "Anxiety and constant chest/arm pain",
    "user_id": "user_181609",
    "user_link": "/personal_pages/user/181609"
}