{
    "answers": [
        {
            "answer": "Hi, I know how you feel!  I have been a life-long anxiety sufferer (ever since I can remember, probably age 5 or so).  I had panic attacks and anxiety while pregnant with both my children.  I took Xanax throughout my last pregnancy, about .5 mg per day.  I was advised by my doctor to stop but I just couldn't do totally without it.  You should know it could possibly cause birth defects, though this risk is low.  Lots of women take Xanax while pregnant.  You should talk to your doctor about it, of course.  I just want you to know you are not alone - I too have struggled with anxiety while pregnant and know how hard it can be!",
            "post_id": "17297",
            "timestamp": "1174280400",
            "user_id": "user_84183",
            "user_link": "/personal_pages/user/84183",
            "votes": "0"
        },
        {
            "answer": "Wow.  Easy for me to say, perhaps, but I certainly wouldn't take them.  Even if the risk of birth defects is low, it would be too high for me.If you take them, please take very small doses.",
            "post_id": "17299",
            "timestamp": "1174280400",
            "user_id": "user_193245",
            "user_link": "/personal_pages/user/193245",
            "votes": "0"
        },
        {
            "answer": "Hi, i'm 37 weeks pregnant and although i've had a history of anxiety attacks throughout my life, i didn't start having any until about 8 weeks ago.My o.b. and pharmacist recommend to not take xanax, however, every person is different. You may want to ask your o.b. this question \"which will cause more damage to my babies, xanax or stress hormones\".. I really don't know what his answer will be, because only he will know the severity of your anxiety based on what you tell him. But no matter what, be honest, don't over embellish. Think about your little ones and concentrate on a healthy pregnancy and the attacks will come less frequently. I wish you lots of luck..",
            "post_id": "17412",
            "timestamp": "1174712400",
            "user_id": "user_195890",
            "user_link": "/personal_pages/user/195890",
            "votes": "0"
        },
        {
            "answer": "I'm on the pill (Ortho-Cyclen) and didn't get my period this month. I'm now officially 2 weeks after my period was supposed to start.  I took at pregnancy test and it said negative.  So I continued my next pack of birth control pills.  Along with that, I suffer from severe anxiety since the birth of our daughter (I had post-partum depression and anxiety).  So I take 1mg Xanax usually before bed- and occasionally .5 during the day.  Now I'm getting paranoid and thinking \"what if I am pregnant\"?  I'm a nervous wreck thinking that I could have done something.",
            "post_id": "72729",
            "timestamp": "1182238748",
            "user_id": "user_219759",
            "user_link": "/personal_pages/user/219759",
            "votes": "0"
        },
        {
            "answer": "When I became pregnant 2 years ago, I was taking zoloft, wellbutrin, and klonopoin. The doc said to continue taking them as MY side effects would be harmful to the baby (stress, anxiety attacks, etc.).  I never took the klonopin, but continued on the wellbutrin and zoloft.  The baby is FINE!  Maybe you could change the xanax out for klonopin as I believe it is a lesser med.  Best of luck to you.",
            "post_id": "192982",
            "timestamp": "1182643054",
            "user_id": "user_187799",
            "user_link": "/personal_pages/user/187799",
            "votes": "0"
        },
        {
            "answer": "I am a mother of 3 and have suffered from anxiety attacks before my first child.  However, during my pregnancies I was anxiety free.  I thought that it was because of the changes in my body.  My last child was born in 2003 and I had continued to live an anxiety free life until July of 2006 when the stress started piling on.  I was prescribed xanax and zoloft to control the attacks.  I refused to take zoloft because of all the horror stories but need to take the xanax as an instant relief.  I find myself living my life scared of losing control and now I am pregnant.  I am affraid because now that the anxiety seems worse will that affect me more now that I am pregnant?",
            "post_id": "193057",
            "timestamp": "1182655765",
            "user_id": "user_221257",
            "user_link": "/personal_pages/user/221257",
            "votes": "0"
        },
        {
            "answer": "I am currrently 7 weeks pregnant.  I had been taking zoloft and klonopin (.5mg) for the past two years for anxiety and panic attacks.  When i found out i was pregnant i stop taking my klonopin as my doctor told me to, if i was every to get pregnant.  But now i am so anxious and have a lot of panic attacks.  I am not sleeping and not eating....which is all bad for the baby.  I want to go back on my klonopin but i don't think my doctor will allow it.  What should i do?",
            "post_id": "1803432",
            "timestamp": "1188320402",
            "user_id": "user_262006",
            "user_link": "/personal_pages/user/262006",
            "votes": "0"
        },
        {
            "answer": "beck congrats on the twins hope you can enjoy your pg and not be stressed the whole time . congrats on everyone pg hope its not in the water lol.",
            "post_id": "1804229",
            "timestamp": "1188333337",
            "user_id": "user_212161",
            "user_link": "/personal_pages/user/212161",
            "votes": "0"
        },
        {
            "answer": "I am 3 weeks pregnant and have pretty much always had anxiety and panic attacks where I could not catch my breath.  I take xanax as needed, about .50 mg once every other day.  Now that I am pregnant, the panic attacks are coming on really strong and I need the xanax to make them stop. My doctors say that I can not take xanax since it is classified as a category D in pregnancy.  I am so worried about this and not sure what to do next.  Any one have any information that can help me?",
            "post_id": "1892778",
            "timestamp": "1189971073",
            "user_id": "user_277926",
            "user_link": "/personal_pages/user/277926",
            "votes": "0"
        },
        {
            "answer": "I am a anxiety panic attack sufferer for over ten years now. I have had almost a whole year of panic attack free. I just recently found out I was pregnant and I was off my medicine. I went in a total spriral I didn't know what to do. I was only pregnant for five weeks then misscarried. I thought for sure it was because I was anxious. I get the worse butterflies and unreal feelings and at the pit of myh stomach I sometimes feel like I skip a beat sometimes. But I realized that is not why. you can take your medicines maybe not zanx as much as zoloft or fluxotine. But know if something is going to happen its going to because that is gods plan. Dont look on the internet for negative things that will be my goal for the next time I try to get pregnant. Its a stressfull world out there just keep telling yourself you are stronger than everyone else you can't control that you have anxiety but you can control how you want to take care of it. good luck. you are the one who can get yourself through it.",
            "post_id": "1962866",
            "timestamp": "1191858529",
            "user_id": "user_295109",
            "user_link": "/personal_pages/user/295109",
            "votes": "0"
        },
        {
            "answer": "i have had anxiety and panic attacks on and off for over 11 years.  it seemed that as soon as i found out that i was pregnant, my anxiety kicked in (i think it was the hormones as well as worrying about the pregnancy itself).  my obgyn put me on zoloft and i was on a rather low dose 75 mg/day and it helped.  i had a handful of panic attacks where my obgyn said that it was ok to take a low dose of xanax.  my son came out just fine - he had mild withdrawal, which is normal, that consisted of him just being a little sleepy for a few hours after he was born.  my husband and i will be trying for baby #2 in a few months and i will remain on zoloft (which is now at 100 mg as i have had a bad month).everybody is different and you need to be open and honest with your obgyn b/c you need to take care of yourself and your baby.  you are not alone and don't feel ashamed for asking to get treated.  good luck and i wish you all nothing but the best!",
            "post_id": "1963748",
            "timestamp": "1191872924",
            "user_id": "user_294513",
            "user_link": "/personal_pages/user/294513",
            "votes": "0"
        },
        {
            "answer": "I have anxiety everyday.  I try breathing techniques and try to think happy thoughts.  I just found out I'm 6 weeks pregnant and I'm on xanax 2mg a day and lexapro 20mg a day.  My doctor wants me to quit the xanax, but it's hard.  I went down to 1mg of xanax a day trying to wing myself off.  I just don't see how someone can go off these kind of meds cold turkey.  I think the stress I have may be worse on the baby.  Any suggestions or other techniques I could try.",
            "post_id": "2716999",
            "timestamp": "1206980982",
            "user_id": "user_466511",
            "user_link": "/personal_pages/user/466511",
            "votes": "0"
        },
        {
            "answer": "i am 8 weeks pregnant and i usually don't suffer from anxiety until i get on an airplane then i get really sick. Take off and landings are the worse and i have a connecting flight both there and back. That means 4 take offs and 4 landings! The only thing that  helps me not to get violently sick is xanex, my doctor said that i not only do i get motion sickness but i have anxiety when i'm airborn. My doctor said that i shouldn't take xanax because it is a class D drug. But i'm so scared to fly with out them. Would it be ok to take it for my trip? I'm just worried that i'll get so sick and i don't want to go through hell if i can help it. Is there anyone who has taken this while pregnant and did baby turn out ok?",
            "post_id": "2867846",
            "timestamp": "1210005260",
            "user_id": "user_499582",
            "user_link": "/personal_pages/user/499582",
            "votes": "0"
        },
        {
            "answer": "I am pregnant and called my doctor one day in tears asking her for a referral to a counselor for my fiance and I, and she put me on Zoloft. I was quite reluctant to take it and waited a couple days before I started it, but ended up doing it anyways because I was tired of being so stressed out all the time. Now, I am happy, the baby is doing well, and no side effects. I take 50mg of Zoloft every morning, and I am not the only mommy to be on this site that takes it. IT is very safe, and in fact safer than the stress it causes the baby for you to be having panic attacks all the time. Call your doc and ask about ZOloft.",
            "post_id": "2868170",
            "timestamp": "1210009572",
            "user_id": "user_305180",
            "user_link": "/personal_pages/user/305180",
            "votes": "0"
        },
        {
            "answer": "ive been living with severe anxiety attacks ever since i moved on an army base almost a yr ago. I was on xanax 0.5 mg extended release and it helped me out a lot.  my md insisted on getting off the medication due to becoming addicted to it. About a month ago i slowly started tappering off going to xanax 0.25 mg to half of that every other day its been 2and a half weeks and i havent used it sure i got withdrawal symtoms like muscle spasms on my neck, anxiousness and nausea but it went away and now im five weeks pregnant! i had a miscarriage a year ago not on any meds and im sure if you talk to your doctor he'll find a way to help you and keep you comfortable. Im focusing on my baby to keep me from taking any, but trust me if i find myself needing one (since my husband will be leaving to afghanistan in two weeks) i will ask my obgyn if i could take half of one. Try exercise it sends endorphins to your brain and therapy with a counseler but dont rely on xanax for it only numbs the feeling find out what triggers your anxiety and dont give up, keep busy and go to church. Get on these groups and keep a support system just know you are not alone.",
            "post_id": "3069087",
            "timestamp": "1214147601",
            "user_id": "user_542740",
            "user_link": "/personal_pages/user/542740",
            "votes": "0"
        },
        {
            "answer": "It's good to know that other women have suffered the same issues. I have been fighting against anxiety for a while now and  I am winning. Prayer changes things.  I tried to take medication and felt terrible. I felt like I wasn't myself.  I did not continue the meds. Being a Christain woman I believe I have to be in control of my thoughts, have faith, and not worry.I did have a miscarraige last year and I totally thought it was because of the anxiety. I realize that symptons of anxiety are negative thoughts and feelings stemming from fear. Now I that I can think more rationally I  don't believe it happended because of the anxiety. Most miscarriages occur due to chromosome abnormalities, not axiety attacks.These are scriptures I meditate on to keep peace of mind:2 Tim 1:7 For God has not given us the spirit of fear, but of power, and of love, and of a sound mind.Matt 6: 25 Therefore I say unto you, Take no though for your life",
            "post_id": "3126084",
            "timestamp": "1215437614",
            "user_id": "user_554902",
            "user_link": "/personal_pages/user/554902",
            "votes": "0"
        },
        {
            "answer": "this site has helped me, i am a 23 year old woman 12 weeks preg with my 2nd child, the first panick attack I had was the day my husband and I brought home our baby girl, however in time I had no signs of panick or anxiety. my husband is in the airforce, so when family comes around and then leave is when my anxiety and panick attack raise to thier highest. it gets so bad that I can barely function at work (where i was just fines weeks prior) i keeps me wanting to just be at home, I have to talk to my husband on the phone at least every two hours and once in a while I have the feeling im just spaced out. this usually goes away within a day or two of family leaving, however gets worse and time progresss' and they come to visit. I am usually very independant, and a hard worker now I have trouble just droppin off our daughter to the sitter. I just want something that will get me to myself with no harm to me or my babie. But not being able to function in a society is a terrible feeling, and I just want to be me again",
            "post_id": "3132891",
            "timestamp": "1215565820",
            "user_id": "user_556463",
            "user_link": "/personal_pages/user/556463",
            "votes": "0"
        },
        {
            "answer": "i know what everyone is going thru i am 33 weeks pregnant with a baby girl and i should be happy about that but my life right  now is hell. everyday and night its nonstop anxiety and that leads to panic. i have now developed a fear of going places i cant even go to my familys houses. im stuck in my home and feel there is no way out. i cant even go to my doctor appt. i dont know how im going to deliver this baby. i dont take any meds ecept for high blood pressure meds. this is just driving me nuts. i feel like i will die if i walk outside. i dont want to take nothing that might harm the baby but i feel like what im going thru cant be good on the baby either.",
            "post_id": "3312257",
            "timestamp": "1219418609",
            "user_id": "user_597250",
            "user_link": "/personal_pages/user/597250",
            "votes": "0"
        },
        {
            "answer": "I too am worried about the side affects of anxiety medication on unborn children.  My man and I are trying to get pregnant, but I'm on 40mg of Prozac a day.  I know the doctor say I should discontinue once I have confirmed my pregnancy, but I'm worried I'll kill someone if I do!  Not being medicated and being hormonal is just asking for someone to die!",
            "post_id": "3314286",
            "timestamp": "1219453332",
            "user_id": "user_597160",
            "user_link": "/personal_pages/user/597160",
            "votes": "0"
        },
        {
            "answer": "I just want to put some peoples fears to rest.... I have been on xanax for 7 years now.... I became pregnant and my OB sad the risks from me stopping xanax are greater than me taking them. I stayed on xanax  my whole pregnancy and had all the same fears as everyone else. My baby girl was born 6lb 8ounces and healthy. She never went through withdrawl or had any breathing problems or muscle weakness.. Nothing! She is almost 2 now and is FINE! Im not saying everyone should stay on it or will be as lucky as me but I stayed on .25 a day because i simply had to.I think low doses arent harmfull in my opinion, speaking from someone who went through it and came out on top! Good luck all",
            "post_id": "3452109",
            "timestamp": "1222380140",
            "user_id": "user_631521",
            "user_link": "/personal_pages/user/631521",
            "votes": "0"
        },
        {
            "answer": "Like pp ( i think it was ipz ), my anxiety disappeared while I was pregnant. It was strange because I suffer from anxiety really bad but during my pregnancies I had never felt so relaxed! Must have been the hormones or the comfort of being with child?I wish I knew what to say, are you feeling worried about the baby's health and well being all the time? That will cause you to feel more anxious during pregnancy.Good luck and hope you feel better soon.....",
            "post_id": "3452461",
            "timestamp": "1222385250",
            "user_id": "user_351661",
            "user_link": "/personal_pages/user/351661",
            "votes": "0"
        },
        {
            "answer": "I am 32 and my husband and I are trying to get pregnant right now.  The problem I have is the anxiety and panic attacks.  Fortunately I take 20mg of Lexapro every day and .25 or.5 mg of Xanax (when needed).  I have heard many stories about taking any type of anxiety medication while pregnant.  I am not pregnant yet but I am already worring about what is to come.  My husband and I have talked about what we will do when I get pregnant.  He is going to do everything he can to keep me calm and stress/worry free.  I am also very fortunate to have family that is ready for the \"fall-out\".  I wish you all good health during your pregnancies.  I hope mine will be healthy as well.",
            "post_id": "3457321",
            "timestamp": "1222477755",
            "user_id": "user_632743",
            "user_link": "/personal_pages/user/632743",
            "votes": "0"
        },
        {
            "answer": "I have suffered from anxiety attacks for years. I'm 26 and 7wks pregnant with my third child. My doc put me on xanax 1mg three times a day. He said the risks of stress related effects on the baby are greater than the risk of me only taking the xanax when I need them. I don't take them every day but do take one every couple days when needed. I hold out as long as I can until I can determine if I will get over the attack or not. Taking a bath and deep breathing, sometimes screaming in my pillow for a few minutes will make the attack go away. I only allow myself about 10 minutes until I know I need the xanax.I think it is based on your doctors experiance with the drug during pregnancy and also how bad your attack get and what physical changes you have during these attacks.",
            "post_id": "3464162",
            "timestamp": "1222650548",
            "user_id": "user_634446",
            "user_link": "/personal_pages/user/634446",
            "votes": "0"
        },
        {
            "answer": "I am 19 weeks pregnant.  I have a cronic anxiety disorder that I take Effexor XR slow release tablets for.  I went off them the first month of pregnancy because my doctor said it wasnt good for the baby.  My anxiety is so bad that I feel like I am dying.  It doesnt help that my fiancee is never home and gambles all the time, that I live 3000 miles away from my friends and family, and that I dont work anymore.  I want so bad to stop my anxiety and panic attacks but have no way to.  My fiancee thinks I am just crazy and need to be a strong woman by controling it on my own.  He shuts his phone off so I cant contact him when I am anxious.  What other coping skills do people use to handle their anxiety besides medication? How do you get your significant other to understand the pain of anxiety and what it does to a person?",
            "post_id": "3603843",
            "timestamp": "1225571767",
            "user_id": "user_669033",
            "user_link": "/personal_pages/user/669033",
            "votes": "0"
        },
        {
            "answer": "I'm also an anxiety sufferer and have been for the last 11 years. About 2 years ago I also started suffering severe panic attacks and thus became agoraphobic, never wanting to leave the house.I never went on meds for this, I did take them years ago when I first started getting anxiety attacks, but I felt they weren't much help. Medications are not a cure, they are necessary when severe and you can't cope any other way, but anxiety is not something that goes away, it does get better, but it is important to learn coping methods.I got over my agoraphobia and stopped having panic attacks by meditation and relaxation, yoga, learning breathing techniques and undertsnading my thoughts. I also don't panic when I start to have anxiety symptoms, I just let those 'feelings' pass through by sitting down or lying down and just 'watching' them pass (it sounds scary, but it works) I used to find by trying to distract myself it made them worse, I guess becauise I was active and moving and thus more stressed.I'm now 8 weeks pregnant, extremely tired, nauses all day/night, loss of appetite, and am just overall exhautsed by all the changes.I think it's because of the lack of control I feel, but I have not left the house in 2 weeks and also because I feel so sick all day. I'm hoping it's not just my anxiety, but I think it is, which is frustrating because I was doing so well.I've been told by my obgyn that by week 12 the sickness and tiredeness will go away and I should have more energy, so I'm hoping this will lessen the anxiety. So far it's a wait and see and I'm just going to stay in bed, relax and not feel bad about it.If I still have the anxiety after this, I will definately be back on my relaxation path of meditating, yoga, and possibly getting some cbt therapy to help with my thought processes.",
            "post_id": "3743387",
            "timestamp": "1228615299",
            "user_id": "user_704149",
            "user_link": "/personal_pages/user/704149",
            "votes": "0"
        },
        {
            "answer": "My hubby and I found out a week ago I am 5 weeks pregnant! This was definitely a planned pregnancy... We both wanted this baby so badly!! Yesterday my \"outlook\" completely changed. I started feeling so overwhelmed about everything that has happened! \"Did we make the right decision? Are you really ready? How will we be after a baby is here?\" I have my first doctor's appointment tomorrow... My family keeps telling me its just my hormones that are startingto go out of control. But i dont want to feel this way the rest of my pregnancy!! I want the desire and anticipation i had when we were TRYING for a baby... Please let me know I'm not the only one who has felt like this, and what did you do!! HELP PLEASE!",
            "post_id": "3780259",
            "timestamp": "1229517135",
            "user_id": "user_712775",
            "user_link": "/personal_pages/user/712775",
            "votes": "0"
        },
        {
            "answer": "hi. no u are not alone. i am about 7 weeks pregnant and am going crazy aiwth anxiety and panic attacks. i don't know what to do to feel better. just always have a fear of something going so wrong. i have 3 other kids, this was an unplanned pregnancy and i don't know how i can make it to the end of pregnancy feeling this way! anyone have advice",
            "post_id": "3819120",
            "timestamp": "1230655918",
            "user_id": "user_722066",
            "user_link": "/personal_pages/user/722066",
            "votes": "0"
        },
        {
            "answer": "hey so i just found out im about 5 weeks pregnant and i to also have anxiety disorder and im so afraid that it will harm the baby i dont so much have attacks more like constant worry to the point of not eating not sleeping and freaking from the time i wake up to the time i try to sleep im not haveing an episode rite now but im really getting worried that i might and hearing all the horror storys about some of the possible compications that come from anxiety and pregnancy and im also trying to quit smoking which isnt helping at all HELP!",
            "post_id": "3824224",
            "timestamp": "1230762835",
            "user_id": "user_723159",
            "user_link": "/personal_pages/user/723159",
            "votes": "0"
        },
        {
            "answer": "I am 10 wks pregnant with baby #1. My husband and I tried to get pregnant for over a year. When it happened we were thrilled. A week or two later I started with my anxiety/panic attacks again. I have had anxiety/panic for 5+ years- was on Effexor 75mg and Xanax .25mg as needed. Before I got pregnant I went to a high risk OBGYN and they told me to take Zoloft during pregnancy, not Effexor. I am on 175mg of Zoloft now and still feel anxious. I called the OB and they said to take Ativan .25mg when needed, but not daily. It does help some.. I started to see a therapist as well and she tells me that after our hormones level off alittle anxiety usually decreases as well.Just know- we are never alone. There are so many pregnant women dealing with this horrible anxiety. I am not sure how on some days, but we make it through each day and it just has to get better! It does not feel it on many days, but just close your eyes and remember yourself at your happiest moment in life- and know that we will get there again!!!!! Please feel free to reach out to me- I know we are all having different experiences, but anxiety & panic is all to farmiliar to all of us!",
            "post_id": "3832651",
            "timestamp": "1231027580",
            "user_id": "user_725502",
            "user_link": "/personal_pages/user/725502",
            "votes": "0"
        },
        {
            "answer": "I hope that your twins came out ok. As you know, twins are a high risk pregnancy. I hope that you did not complicate it by using Xanex. There are alternative medication for anxiety which do not pose as high  a risk. You had three children already. I understand not wanting to stop for yourself, but once you became pregnant, it is no longer about yourself. Piece of advice. Get some sleep. I was having panic attacks after my second child. It was almost like post traumatic stress. I went without sleep for so long so much that when I could sleep, I would have a panic attack. Being well rested will eliminate much of what you are going through including depression which is ultimately related to your seritonin levels, ie sleep. You don't need medication if you get natural rest. I hope you can afford a Nanny or have lots of help. It is time for your husband to get his tube tied. Once your youngest is 3, you will return to normal again. Good Luck",
            "post_id": "3915727",
            "timestamp": "1232920407",
            "user_id": "user_746176",
            "user_link": "/personal_pages/user/746176",
            "votes": "0"
        },
        {
            "answer": "I just found out i am 5 weeks pregnant and my anxiety was doing pretty good until i found out i was pregnant.It was not planned.I was using vcf and apparently it didnt work My heart rate is just racing everyday day because of the worry.I hope that we will all be ok.good luck",
            "post_id": "4033751",
            "timestamp": "1235676885",
            "user_id": "user_777765",
            "user_link": "/personal_pages/user/777765",
            "votes": "0"
        },
        {
            "answer": "I'm now 7 weeks pregnant. I was taking so many meds it's hard to count. One of them was a heart med because I have severe Tachycardia. I was also taking Xanax to help control the tachycardia and for severe anxiety and Demerol (tore my ligaments and tendants in my foot). The doctor told me to stop taking the Cardizem (heart meds) but to keep taking the Demerol and Xanax (just sparingly). I take 1mg a day sometimes less of Xanax and 100mg of Demerol (sometimes non at alll) a day. I go for my first UltraSound next week @ 8 weeks. The doctor whats to check to see if the baby has a heartbeat because of all the meds I was on. He says the Xanax and Demerol are okay to take but the Cardizem could have caused problems. I'm just stating this because alot of women are wondering about the Xanax. My doctor seems to think it would cause me more harm than good.",
            "post_id": "4097019",
            "timestamp": "1237223230",
            "user_id": "user_795151",
            "user_link": "/personal_pages/user/795151",
            "votes": "0"
        },
        {
            "answer": "Just be glad you aren't in my boat.  My anxiety is so severe that I take 6 mg. of Xanax XR every day (2 mg. 3xper day).  I am not pregnant yet.  The doctor worries, but she says she can live with me getting down to 3 mg. per day.  She says that Xanax has not shown to be as much of a problem as other benzos, but because it is a benzo, it is in the same category and it has to be assumed that the same risks are possible.  She told me cleft pallet is the worst risk.  She says she wishes I didn't have to take anything but is afraid the benefits of the drug outweigh the risk.  My former OB/GYN thought I was some kind of idiot and wanted me to just come off Xanax...FYI withdrawal is awful.  Hopefully I can taper down where she wants me or farther.  The thought terrifies me.  I have horrible panic disorder.  I function just fine in everyday life with meds.  I take Wellbutrin XL too, as well as Lamictal (for migraines, off label use).  Here's the funny thing...I'm a therapist myself!",
            "post_id": "4792041",
            "timestamp": "1250870844",
            "user_id": "user_1012300",
            "user_link": "/personal_pages/user/1012300",
            "votes": "0"
        },
        {
            "answer": "hell0 i am a  panic attack suffer. i am on xanax taking 0.5 mg. 3to 4 times a day and always been on pain medicine. i asked to come off my pain meds but knew i cannot come off my xanax. now the doctors tell me DO NOT come off either! so i listen to them and now they are bringing in DCF and taking my kids from me even though they told me i have to stay on my  meds! anyone have any thoughts are maybe know  what i can do to keep my children?? maybe someone went threw this and can help me too make sure i do not loose my kids  are give me advice on how they handled there situation??????????????????",
            "post_id": "5050914",
            "timestamp": "1257467968",
            "user_id": "user_1098447",
            "user_link": "/personal_pages/user/1098447",
            "votes": "0"
        },
        {
            "answer": "Are you saying that DCF are going tot ake away your baby because you took Xanax while pregnant, or that they're trying tot ake away your other children because you're taking Xanax? Are you taking any ilicit drugs as well? Do you have a prescription for the Xanax? If you have a valid prescription, I don't think DCF can take your kids away.",
            "post_id": "5148106",
            "timestamp": "1260082002",
            "user_id": "user_1129892",
            "user_link": "/personal_pages/user/1129892",
            "votes": "0"
        },
        {
            "answer": "I am not a doctor but I think I can help. I have always had severe anxiety and panic attacks. I have been on xanax and antideppresants for about 11 years. I am pregnant and I had to quite everything of course. If you are looking for something that will get through the nausea and anxiousness try dramamine. I have done research and it seems to be fine. Please ask your doctor first but I think this is a wonderful drug to get me through this pregnancy.",
            "post_id": "5332708",
            "timestamp": "1265083229",
            "user_id": "user_1196678",
            "user_link": "/personal_pages/user/1196678",
            "votes": "0"
        },
        {
            "answer": "This is an interesting topic. As for me i have had anxiety for the past 6 years, along with the panic attacks.I felt like i had them under control and I just found out i am pregnant and my anxiety level seems like it has SKY ROCKETED. the cure that i am planning on using is the one i have used throughout the years. which is Lucinda Bassitt's Attacking Anxiety and Depression. I am so serious i have never EVER taken any medicine to try and calm it cuz as everyone with anxiety knows its the fear of overdosing and or needing it to much. But if any of you have not tried Lucinda Bassitt I strongly recommend it because it DOES work  believe it or not. I was to the point i would not get out of bed, my head would feel like it was constantly spinning i felt like something VERY terrible was going to happen out of nowhere. You all know what im saying. Point is even if you get it from limewire or you pay the $400 for the program like i did you will NOT regret it. Just a way to cope especially bieng pregnant. http://www.stresscenter.com/mwc/",
            "post_id": "5367546",
            "timestamp": "1265938974",
            "user_id": "user_1209213",
            "user_link": "/personal_pages/user/1209213",
            "votes": "0"
        },
        {
            "answer": "I'm 22 and recently found out I'm pregnant. I haven't been to the doctor yet, so I don't know how far along I am, but I sometimes take pain meds for cramps and for backaches I get. I'm also a sufferer of anxiety and have been for years. Since I found out I'm pregnant, Iv'e been taking a xanax here and there to calm my anxiety. It's hard for me to stop taking it alltogether, but it seems to be the only thing that helps me. I don't want to harm my baby, but I don't want to be stressed out all the time either. What should I do?",
            "post_id": "5404265",
            "timestamp": "1266938089",
            "user_id": "user_1222449",
            "user_link": "/personal_pages/user/1222449",
            "votes": "0"
        },
        {
            "answer": "hi i just turned 26,and suffer from PTSD as well as sever anxiety disorder/panic attacks and insomnia,due to witnissing my beloved mothers sudden heart attack 10-15-07 i was just 23=( the doctor has had me on 8 mg of xanax and 20mg of ambian i have been tapering off the xanax as much as possible and even more so since i found out i am pregnant i am now about 6 and ahalf weeks along and down to 2mg a day (1mg in the morning and 1mg at night) and will be down to just 1mg come monday which is in 2days GOD HELP ME! and i quit the ambian cold turkey,but didnt sleep much for a few days maby a few hours a night. i am so worried that the xanax is gonna harm my baby(which is a God send from Heaven and a piece of my Mommy=D) But i am soooooo anxious about every little thing every little pain cramp and the racing thaughts of what if,its driving me mad!!!!i am just so worried the damage is already done and its all my fault=( i go for my first ultrasound next thursday and i pray to God everything looks and is normal and healthy.this pregnancy has saved my life and i feel purpose and areason for living and being healthy,i dont know what i would do if somthing was wrong or if i lost my baby=(i will post the results next week keep me in your prayers and GOD BLESS all you expeting mothers and moms to be=)",
            "post_id": "5465387",
            "timestamp": "1268498937",
            "user_id": "user_1244199",
            "user_link": "/personal_pages/user/1244199",
            "votes": "0"
        },
        {
            "answer": "Hi everyone.  I am 27 years old and into my 6th week of pregnancy, and I have had severe panic disorder for as long as I can remember.  I've been on 20mg Lexapro for years, and my doc told me to keep on it during my pregnancy (seeing as how my panic causes me to shake, have rapid heart rate, vommit, have food fears/aversions, insomnia. . .yeah.  The works.)  The problem is, all of a sudden, the attacks are back despite me being on the Lexapro.  I had a brief bout of morning sickness, and that triggered my anxiety big time.  I am freaking out.  This is my first pregnancy, and I really want a healthy baby, but I am terrified of what is happening to us.  Plus, I am trying to get through my work days, which is close to impossible.  I keep praying, but I feel like maybe this is happening because I am not a good enough person or something.  I just want the baby to be okay, and I want to be okay too.  I feel like I am going to end up losing both the babby and my mind.  Please help.",
            "post_id": "5477815",
            "timestamp": "1268836488",
            "user_id": "user_1247898",
            "user_link": "/personal_pages/user/1247898",
            "votes": "0"
        },
        {
            "answer": "Hi I'm currently 16 weeks pregnant and have to drive 21 hours to see my husband in Oklahoma. He is graduating form Basic training. I have been suffering from panic/anxiety attacks for as long as I can remember. My mother has the same problem. I am very nervous about the trip to Oklahoma. I really don't want to have a panic attack while on the road in the middle of nowhere. I don't take any meds and when offered by my doctor to take them I refused. But now I find myself thinking I need to take them for the trip there and back. I just want to ask if it would hurt my baby if I took them on the way there and then 3 days later on the way back?",
            "post_id": "5489905",
            "timestamp": "1269147580",
            "user_id": "user_1252823",
            "user_link": "/personal_pages/user/1252823",
            "votes": "0"
        },
        {
            "answer": "Hi again everyone.  I was just wondering. . .does anyone have any theories or experience about why Lexapro would stop working like it was before once I got pregnant?  Could it be the changing hormones somehow affect serotonin in the brain, so the same dose I was on isn't working the same way?  I am so confused and scared.  I feel like if I at least had some idea why this was happening, I'd deal with it a bit better.  Thanks.",
            "post_id": "5490485",
            "timestamp": "1269174963",
            "user_id": "user_1247898",
            "user_link": "/personal_pages/user/1247898",
            "votes": "0"
        },
        {
            "answer": "There is a medicine that is safe for pregnant women that you guys can take for panic attacks and anxiety. They prescribe it to pregnant women all the time. It's called Welbutrin. I was one it for anxiety before I was pregnant, even though it is known as a antidepressent medicine. It increases the dopamine and norepinephrine the chemicals that really help with your moods. Also it is additionally sold under the brand name Zyban to help stop the urge to smoke. So they prescribe it a lot to prgnant women to quit smoking..",
            "post_id": "5918766",
            "timestamp": "1279299369",
            "user_id": "user_1382767",
            "user_link": "/personal_pages/user/1382767",
            "votes": "0"
        },
        {
            "answer": "HI! I am 32 weeks pregnant with a history of anxiety and depression. I was taking 50mg of zoloft before I found out I was pregnant. I have since stopped and have been fine for the past 5 months until recently...my anxiety has returned. I am not sure if its due to hormonal changes or the stress of all the changes with having a child for the first time and life changing in general. Can it be both? I plan on breast feeding along with formula feeding but I am not sure if it is safe to be on Zoloft and do so. My Psych. to me I can take a xanax or 2 if needed and if I'm not well by weeks end to return back on my 50mg of zoloft. I really do not want to do so but do not want to live with this feeling and have it affect my baby.  My OB/GYN is against any form my meds during pregnancy but what is best? Living with panic with the duration of my pregnancy and add stress on my baby or go back on meds and hope that doesn't affect my baby? I am also having a hard time sleeping and have indigestion from time to time. I'm not sure if both of those things are contributing to my anxiety or if its the other way around. Does anyone have any advice or some encouraging words for me. I really feel lost, confused and so many other symptoms that go with this disorder. Thanks for your time!",
            "post_id": "5977966",
            "timestamp": "1280676773",
            "user_id": "user_1399578",
            "user_link": "/personal_pages/user/1399578",
            "votes": "0"
        },
        {
            "answer": "Hi there, I too am pregnant (28 weeks) and suffer from anxiety and panic.  I have had anxiety issues on and off since I was 18 and I'm 28 now.  I have 3 kids (9,8 and 15 months) and I had no problems with those pregnancies, but for some reason (maybe the loss of my job or my grandpa and my husbands cousin passing or just the pregnancy itself) I started having bad panic attacks around 8 weeks.  I figured I could just suck it up but then around 20 weeks I started to feel anxious daily along with a few attacks a day.  I was a mess and my ob at the time was no help and my gp was very reluctant to prescribe anything.  I finally went to a phsyc. and he prescribed zoloft.  I changed ob and he also suggested zoloft.  I finally took it after lots of thinking and back and forth with myself. It has been about a week so I'm still feeling weird and kinda jittery. I'm just hoping that it will be working by the time I have the baby.  I also wanted to mention that I tried acupuncture over a month ago and it was amazing.  The acupunture really took the edge off so maybe you might want to consider that. Just know that your not alone and if you need to talk feel free to mess me.  best of luck with the rest of your pregnancy. :)",
            "post_id": "5978959",
            "timestamp": "1280697885",
            "user_id": "user_1362292",
            "user_link": "/personal_pages/user/1362292",
            "votes": "0"
        },
        {
            "answer": "Thanks sooo much. I'll def be in touch and will message you. Keep me posted on how you are feeling and if you find that the meds are helping you. It has only been a week that you are on them and sometimes it can take from 2 to 6 weeks to get into you system and start working :o.  KIT",
            "post_id": "5979019",
            "timestamp": "1280698914",
            "user_id": "user_1399578",
            "user_link": "/personal_pages/user/1399578",
            "votes": "0"
        },
        {
            "answer": "I feel the hardest part of coping w/ anxiety while pregnant is that I feel like i'm loosing control & and that I won't be able to be a good mother.  I try to remind myself that I have always got through anxiety in the past and I will again.  It is just so hard sometimes.  I start to think I  am going crazy (of course this is a classic symptom).  Meditation and mindfullness have helped me in the past.  I was also thinking of trying accupuncture.  Has anyone tries this?  Or other non-medication methods for dealing w/ anxiety and panic?  I'm not against medication, I just want to hold out as long as I can and be sure i've exhaused all other options first.  I am currently 25 weeks and trying to stay hopeful.",
            "post_id": "5980218",
            "timestamp": "1280721474",
            "user_id": "user_1031478",
            "user_link": "/personal_pages/user/1031478",
            "votes": "0"
        },
        {
            "answer": "Hi ladies, leelee I will def. kit. and Hazelandie I have tried acupuncture and it did take the edge off of my anxiety and panic.  The only thing is the cost for me.  I plan on having my 2nd treatment soon being that it has been almost a month since my last.  Along with the acupuncture I had massage and I'm sure that contributed to the acupuncture so you might look into it.",
            "post_id": "5980290",
            "timestamp": "1280723553",
            "user_id": "user_1362292",
            "user_link": "/personal_pages/user/1362292",
            "votes": "0"
        },
        {
            "answer": "I am debating on whether I should start back up on my meds. I spoke to my therapist and he said he would start me at 25mg of zoloft for now to see if that helps. If not he would put me on my regular dose of 50mg that I was taking before I knew I was pregnant. My anxiety has gotten worse and I am getting depressed. I can just cry for no reason at the drop of a hat. He said I can take xanax when or if needed. It's .25mg. Last night I was so anxious and thought I was going to lose my mind so I took half of the .25mg of xanax. I really want to get through the rest of my pregnancy without taking my meds but I fear I'll get worse. I also I have a fear that my meds won't even work and I'll be like this forever!  Please...any thoughts or advice?!",
            "post_id": "5989733",
            "timestamp": "1280929895",
            "user_id": "user_1399578",
            "user_link": "/personal_pages/user/1399578",
            "votes": "0"
        },
        {
            "answer": "I am 35 years old and my husband and I just found out that we are expecting another baby. Our youngest is going to be 2 in October. I was diagnosed with panic disorder when I was 22 years old and have been on xanax or klonopin since then, with the exception of my pregnancy almost 3 years ago. I have also been on Paxil, on and off throughout the years. At the time of my last pregnancy, we were planning on becoming pregnant and everything was planned out. I was off all meds when I found out that I was pregnant. Afer our daughter was born, I had to return to the klonopin when she was about 3 months old. I also returned to Paxil shortly thereafter.4 days ago, I found out that I am pregnant. Only this time, I had no time to wean myself off any medications. I was taking Paxil and Xanax. When I saw the results from my test (home pregnancy test, as I have not been to my first ob appointment), I stopped taking all the meds. I called my doctor that prescribes the anxiety medications and they said yes, discontinue all meds. My ob said only to discontinue the xanax and to continue the Paxil until I come in for my first appointment on Aug. 18th.I am nervous because of the info I have heard in regards to Paxil....and I am not sure how long it remains in your system. I DID discontinue all meds, and am going through horrible withdrawl symptoms. I have not taken anything though. But I can tell you that with these type of side effects, it is SO hard. I feel like I have it double, because of the xanax withdrawal and the Paxil combined. Any suggestions? And is it better to have these horrible symptoms from discontinuing the medication or to take the medication itself? The way that I am feeling cannot be good for the baby. Please help.....",
            "post_id": "6002899",
            "timestamp": "1281234127",
            "user_id": "user_1406540",
            "user_link": "/personal_pages/user/1406540",
            "votes": "0"
        },
        {
            "answer": "Ok I am pregnant and suffer from anxiety and I havn't been diagnosed with depression but fear that I could be and I was perscribed bupropian. I was just wondering if there was anyone out there that has taken it and everything turned out fine. It is a category C for pregnant woman and I just don't know if I trust it",
            "post_id": "6014272",
            "timestamp": "1281498206",
            "user_id": "user_1409774",
            "user_link": "/personal_pages/user/1409774",
            "votes": "0"
        },
        {
            "answer": "I've never heard of that med. but i'm sure your doctor wouldnt have put u on it if he /she felt that it hurt the baby.",
            "post_id": "6020833",
            "timestamp": "1281645955",
            "user_id": "user_1399578",
            "user_link": "/personal_pages/user/1399578",
            "votes": "0"
        },
        {
            "answer": "try homeophatic medication is the best I suffer for anxiety too and I never use xanax because make us worse,I take arsenicum album is homeophatic treatment and Rescue Remedy or go to naturapath doctor and will say what remedy you need.Good luck and quick recovery.",
            "post_id": "6066205",
            "timestamp": "1282711651",
            "user_id": "user_1424600",
            "user_link": "/personal_pages/user/1424600",
            "votes": "0"
        },
        {
            "answer": "I had a baby one year ago today, I have very bad anxiety and was on prozac, klonipin and busburin(for chest pain) My doctor told me I could continue the medication but I decided I didnt want to dope my fetus up, she dosen't have anything wrong with her I do. I stopped taking everything but the klonipin wich I only took when I absolutly had to(maybe 1mg twice a week) Thank the Lord I took that action because a few months after I had my baby all these comercials were coming on about people taking prozac and their child born with heart defects. I was feaked out cause that could have easily been me. My child is healthy and smart, the klonipin did not have any negative affect.",
            "post_id": "6244585",
            "timestamp": "1287004521",
            "user_id": "user_996688",
            "user_link": "/personal_pages/user/996688",
            "votes": "0"
        },
        {
            "answer": "I believe that which helps pregnant mom relax, be calm and most important-be happy... will allow baby to relax, be calm and be happy.  Take anything man- made, in moderation. Daily Viniyoga practice helps me through with focused breath awareness, gentle movement and meditation.",
            "post_id": "6262827",
            "timestamp": "1287473461",
            "user_id": "user_1479601",
            "user_link": "/personal_pages/user/1479601",
            "votes": "0"
        },
        {
            "answer": "Hi, I just want you all to know that you are not alone. I have suffered with Severe Anxiety Disorder since I can remember. And Im only 23.. I have been on every medicine known to man to try to help the matter, finally now I am the right meds but I still have anxiety attacks. My husband and I are talking about having kids and Im TERRIFIED to have a child without being on my meds... Any suggestions? Thanks",
            "post_id": "6400766",
            "timestamp": "1290984630",
            "user_id": "user_1519624",
            "user_link": "/personal_pages/user/1519624",
            "votes": "0"
        },
        {
            "answer": "I have had 3 pregnancies with severe anxiety/depression (had it for 13 yrs). I wish I had been on meds, I suffered so badly. Please eat & drink healthy, sleep, take your prenatal vitamin, and find a med that is safe and works. Nobody should have to suffer.........",
            "post_id": "6403848",
            "timestamp": "1291067119",
            "user_id": "user_560272",
            "user_link": "/personal_pages/user/560272",
            "votes": "0"
        },
        {
            "answer": "Almost 7 years ago, I too was diagnosed with severe Panic disorder and depression. I turned agoraphobic and started developing OCD and was unable to go to my college classes out of fear of having a panic attack. The doctors prescribed every medication. Although it helped, they also had many side effects. I also became addicted to Ativan during this time because I would ALWAYS \"take as needed.\" Tired of feeling numb and a prisoner to the meds., I decided to try other options. If you are able, I highly suggest seeing a Cognitive/Behavioral Anxiety Specialist. After being told I was the worst case he had EVER seen, I was able to taper off all medication and I'm not afraid anymore of my panic attacks. Once you stop avoiding, stop being fearful of what may happen, the panic begins to lose its power. Now this is definitely easier done than said- it takes hard work, but eventually you start learning about how to deal with the panic feelings. I'm finally getting my life back and it feels absolutely amazing! I wish all of you the best of luck! Just know there IS hope! Try other options rather than just the medications- all they do is cover up the symptoms, rather than dealing with the problem. My husband and I are planning on getting pregnant soon, and I can't be happier! I now have the tools and resources, and though it might be difficult, I know I will be able to do it now.",
            "post_id": "6455648",
            "timestamp": "1292439486",
            "user_id": "user_1535192",
            "user_link": "/personal_pages/user/1535192",
            "votes": "0"
        },
        {
            "answer": "May i suggest people with anxiety and depression go for hypnotherapy. At least ten or more sessions while pregnant! It has helped me a lot and i have been able to have a drug free pregnancy. It is not a cure but it has made me see life in a different way. Don't be conned into thinking it will take 1 or 2 sessions. Like any therapy it takes time. Insist on going for lots of sessions even if the hypnotherapist thinks you are 'cured' after one or two sessions. In the past I have emailed the therapist before a session explaining ALL(bad and good) of my problems from birth right up until present day. This allows the therapist to understand you as a whole and where you need the help.Try not to hold back even if your past is embarrassing or you think (or have) done something wrong.",
            "post_id": "6511362",
            "timestamp": "1294174140",
            "user_id": "user_1552158",
            "user_link": "/personal_pages/user/1552158",
            "votes": "0"
        },
        {
            "answer": "Hi all, it makes me feel better to know I'm not the only one who is suffering this horrible anxiety. I am 33 weeks pregnant, and have had the hardest 33 weeks of my life. I had panic attacks pre-pregnancy for about 5 years and was on 25 mg Paxil and .5 mg Ativan (as needed). I went years without needing the Ativan, and was doing great. Then, I found out I was pregnant and my OB switched me to Zoloft and advised me not to take the Ativan. Switching from Paxil to Zoloft was a very difficult 2 weeks for me, but I managed. At about 12 weeks pregnant, I ended things with the father due to his abusive behaviors and addiction to drugs. This was hard for me, but my anxiety was manageable. That was up until about 20 weeks pregnant. I have gone totally downhill and my anxiety is the absolute worse it has ever been. My doctor switched me to Welbutrin about two weeks ago, but I have not seen any results yet. I am barely able to make it to work, and have become agoraphobic (spelling?). I hate to admit It, but I have even broken down and taken .25 mg of Ativan when the anxiety was so overwhelming that I could not handle it. I am terrified I am harming my baby by feeling this way, and I am driving myself crazy. I pray that these feelings will go away after delivery, but I just do not know how I can handle another 7 weeks or so.",
            "post_id": "6518240",
            "timestamp": "1294332722",
            "user_id": "user_1554278",
            "user_link": "/personal_pages/user/1554278",
            "votes": "0"
        },
        {
            "answer": "I also am a anxiety sufferer i had a panic attack when i was 10 years old and then i got married and had two kids and my anxiety shot i think it was the worst when my daughter was 6 months old but now i am 4 weeks pregnant now and irritable i get nauseous whenever i go outside and i went through a bout of agorophobia last year so im really determined not to get back to that point i appreciate and will need you guys support but thanx for the information i am on vistaril now for anxiety but its  not working im shaking while writting this message just from my nerves but i am going to my doctor and finding out my option im just scared of the impact itll have on the baby and i was on xanax at one time and the withdrawls are awful i dont want to be depended on a pill but i have a disorder may it be temporary i pray but i need some kind of comfort. its freaking me out? any advice im just real irritable and thats hard especially to keep patience with a 2 year old and a 4 year old who always ask why?",
            "post_id": "6532901",
            "timestamp": "1294709589",
            "user_id": "user_1558848",
            "user_link": "/personal_pages/user/1558848",
            "votes": "0"
        },
        {
            "answer": "I have had panic and anxiety since I can remember. I was on celexa and also took Attivan when needed. I have now stopped taking them since I am pregnant with my second child. With my first child I stopped taking them too and did ok while I was pregnant. Then went back on the meds. after my child was born. I have really found that  going to therapy helps ALOT and also I have a book that has helped me so much named The Anxiety and Phobia Workbook by Edmund J. Bourne PH.D. This book is awesome. It teaches ways to handle anxiety and panic natural ways. I have done alot of what it says in this book and my anxiety is not near as bad as it was. I couldn't even leave the house until I went to therapy and read this book. Now I feel like I get out alot compared to a year ago. Please be careful taking that kind of medicine when your pregnant. I know it seems like it will be terrible if you quit taking it, but maybe just try and see.",
            "post_id": "6580685",
            "timestamp": "1295966261",
            "user_id": "user_1574465",
            "user_link": "/personal_pages/user/1574465",
            "votes": "0"
        },
        {
            "answer": "My doctor said I could take benadryl for anxiety during pregnancy. You guys might want to ask your doctors if that is an option for you.",
            "post_id": "6735674",
            "timestamp": "1300158167",
            "user_id": "user_1635361",
            "user_link": "/personal_pages/user/1635361",
            "votes": "0"
        },
        {
            "answer": "does benadryl actually work?I deal with anxiety every day.",
            "post_id": "6844780",
            "timestamp": "1303401478",
            "user_id": "user_1668191",
            "user_link": "/personal_pages/user/1668191",
            "votes": "0"
        },
        {
            "answer": "I cant believe im NOT alone and you are all dealing with this aswell !!! omg this is so comforting !! thank you ALL for sharing your stories :) wish me luck on my scary journey",
            "post_id": "6992221",
            "timestamp": "1308233074",
            "user_id": "user_1710826",
            "user_link": "/personal_pages/user/1710826",
            "votes": "0"
        },
        {
            "answer": "i am crying because i am so happy to see ppl who have gone through this !! I am 26 yrs old and have had anxiety and severe panic attacks all my life prob due to my bad childhood :( It has tortured me for so many years and all i want is a normal happy family and i refuse to let this stop me but i am a couple weeks pregnant and soo soo soo scared I cant even take it !!! My therapist told me to stop all my meds (zoloft kolonopin, ambien) COLD TURKEY! this cant be right ! I am beyond nervous about this my first pregnancy ! this web site has made me feel some much needed comfort and relief . thank you all so much for sharing you have no idea what this means to me .... or mabey you do :)",
            "post_id": "6992253",
            "timestamp": "1308233890",
            "user_id": "user_1710826",
            "user_link": "/personal_pages/user/1710826",
            "votes": "0"
        },
        {
            "answer": "I'm 37 wkd along. I suffered major attacks off and on for about 6 yrs. No medication. Just the old fashion, just dealing with it. What I do, to help me. I focas on breathing. I attend to smoke more cigerates though. That I don't want to do too. I need help. Thyrpists didn't help...I just want my baby to be 100% ok. While takins care of 2 other at home. Who can o turn to that will understand, and help?",
            "post_id": "7005177",
            "timestamp": "1308652224",
            "user_id": "user_1714392",
            "user_link": "/personal_pages/user/1714392",
            "votes": "0"
        },
        {
            "answer": "All the best.wish you well in your journey:)i know how comforting it is to hear from people who have gone through the same.| have had anxiety and panic attacks though am not pregnant.My attacks started last year after an ectopic surgery and since then I have really been scared of conceiving. I have not had an attack in a couple of months now and I thank God.It's not easy but until you realize that you worry in vain, you continue to wallow in this mess called anxiety! -it is all in God's hands, you have to let go and let God.I know its easier said than done but that's the ultimate because regardless of how much we worry, nothing much we do other than worry more...Wish you all the best and all other mums out there battling with anxiety and panic attacks in pregnancy.",
            "post_id": "7232363",
            "timestamp": "1315829964",
            "user_id": "user_1800096",
            "user_link": "/personal_pages/user/1800096",
            "votes": "0"
        },
        {
            "answer": "Hi, I am about 23 weeks pregnant and I have had anxiety ever since I was in middle school.  It all started with public speaking.  Before I found out I was pregnant I was taking Zoloft daily, and Xanax when needed.  But my doctor advised me to stop taking them, so I did.  I find myself worrying about everything and can't stop thinking about it, making me more anxious, and I wish it would all just go away and stop making me nervous for no reason. Any ideas?",
            "post_id": "7281987",
            "timestamp": "1317335126",
            "user_id": "user_1822806",
            "user_link": "/personal_pages/user/1822806",
            "votes": "0"
        },
        {
            "answer": "Believe me, if you suffer from severe anxiety, taking your medication (depending on what it is) outweighs the side effects. Last year me and my husband decided to start trying to get pregnant and I made the decision to taper off my xanax and prozac. My anxiety level was ok the first trimester, but when the stress that comes along with bringing in a little one to the world started to set in, my anxiety went through the roof. The anxiety and stress caused my blood pressure to peak unexpectedly during an attack, and because I was unaware of the signs this led to the onset of preeclampsia ( hypertension during pregnancy). My placenta ended up separating because my blood pressure was so high, and my son passed away just 3 weeks before my due date. So talk to your doctor, of coarse, because in some cases the benifit of the medication outweighs the risk.",
            "post_id": "7284257",
            "timestamp": "1317407040",
            "user_id": "user_1823661",
            "user_link": "/personal_pages/user/1823661",
            "votes": "0"
        },
        {
            "answer": "I think you're absolutely right!  The stress is worse on the baby and the benefits outweigh the risk of taking xanax or any benzo!  I'm 36 weeks pregnant and have been on 2mg clonazepam for 10 yrs. so when I found out I was pregnant the doctor wanted me to get off and I stopped cold turkey wound up in the ER for severe withdrawls, heart palpitations, uncontrollable shaking, you name it I had it.  Now im on 1mg on clonazepam and have been through my entire pregnancy.  People who don't have panic attacks do not understand this.  They think well I wouldn't want to take any chance on harming my unborn child and rightfully so but we feel the same way.  It's better to try and get off of a benzo before becoming pregnant but it's life and it doesn't always work out that way.  You have so many aches and pains when you're pregnant it makes you're anxiety a hundred times worse.  Now that im towards the end im having them more than ever. Hope this helps anyone that reads it:)",
            "post_id": "7300357",
            "timestamp": "1317921480",
            "user_id": "user_1830733",
            "user_link": "/personal_pages/user/1830733",
            "votes": "0"
        },
        {
            "answer": "I am also 11weeks pregnant & have been taking zanax for the last 6 years. I have done research upon research on the effects of zanax while pregnant. I read an article from a world renouned obgyn who stated they have done many many studies on zanax while pregnant. It turns out zanax has little to no impact on harming the baby. It will actually cause more stress on the fetus to stop them.. due to withdrawl & more stress on baby. If u do decide to stop you shoud ween yourself of off them very very slowly. It can take up to 6months to completely taper off depending on how long you have been on them.",
            "post_id": "7305096",
            "timestamp": "1318066687",
            "user_id": "user_1832686",
            "user_link": "/personal_pages/user/1832686",
            "votes": "0"
        },
        {
            "answer": "Not to worry.I had panic attacks and awful anxiety with my first child and he turned out healthy and 2 days after his prefered due date. He is a very very happy and well mannered boy so I dont see how people say that if you suffer from anxiety through your pregnancy that you will have a child with ADHD or an abnormal child.That is so intrue as my anxiety waas so so bad that I was waking throughout the night so anxious that I couldnt get back to sleep.Dont worry as you deserve to be happy as when the baby comes you would so regret that you felt that way as you wont have anytime to think at all with the newborn baby there.I respect yoour worries as I know exactely how you feel.You will be fine and you baby will be so perfect to you that you will wonder why we worried at the start.Much love and GodBless you and your beautiful baby.",
            "post_id": "7308936",
            "timestamp": "1318209584",
            "user_id": "user_1834589",
            "user_link": "/personal_pages/user/1834589",
            "votes": "0"
        },
        {
            "answer": "i am 25 wks pregnant and taking methadone as well as 2 mgs of xanax daily. i want to get off the xanax because my councelor at the methadone clinic said the baby will have a real hard time withdrawing.  also, even though i have a prescription for xanax, i was told  dcfs could still get involved. i wanted to go in inpatient but cannot find a single place that will take me this far pregnant on xanax. there are places that will take pregnant women on methadone but not any that i can find will take pregnant women on xanax. i do not know if i should wean myself off or to a lower dose? but that too may not be safe for baby. also is not too safe staying on 2 mgs of xanax until i have the baby. i am going to talk to my doctor who perscried the xanax to see what he says. but any suggestions?",
            "post_id": "7324704",
            "timestamp": "1318641768",
            "user_id": "user_1841094",
            "user_link": "/personal_pages/user/1841094",
            "votes": "0"
        },
        {
            "answer": "So I'm really glad I found this site and that I'm not alone in having really bad anxiety while pregnant. I am close to 8 wks now and am in recovery from drug addiction. I was on heroin when I found out I was pregnant. I obviously quit and got back on a very low dose of Suboxone, which is Category C b/c they don't know much about it during pregnancy; they do suggest switching to Subutex, which I will be asking for from my doctor on the next visit. But I am still having horrible anxiety, partly due to quitting heroin, partly b/c of hormones from pregnancy and partly b/c I suffer from anxiety anyways. My problem is that b/c I'm a recovering drug addict AND b/c I'm pregnant, I don't want to use benzos. But I don't want to keep feeling like this either. It's also making my morning sickness much worse. I plan on getting into some CBT and possibly yoga and acupuncture, but I'm wondering if I should go ahead and take a couple xanax just until I get the other stuff going. If I do, I'm afraid of it hurting the baby, especially since I used before I knew I was pregnant, I'm already high risk. What do I do? If I tell my OB I used I'm afraid he/she will automatically classify me as a drug seeker and if I do need meds, they won't give them to me. I stay worried about the baby all the time and I'm so sick of feeling this way! My fiance is very supportive but I still feel lonely a lot and I have horrible nightmares almost every night. Should I tell my OB about the prior drug usage or should I just tell them my symptoms and let them decide what's best?",
            "post_id": "7381299",
            "timestamp": "1320523713",
            "user_id": "user_1877593",
            "user_link": "/personal_pages/user/1877593",
            "votes": "0"
        },
        {
            "answer": "Iam a 23yr old mother and when pregnant with my 2nd son I went through the worse time of my life I started to go through anxiety I felt like I had to lie to everyone about because if I said anything they will think i was crazy and finally i let my ob know about it and she said she could't take anything for it i left crying as soon as i was out i though she was going to tell me everything was fine that it was normal later that week things didnt seem to make sence and i was getting my first anxiety attack it was the worse feeling of the world i had a 1yr old son that it was hard to attend to and pregnant with another i didnt go through that with my first so it was all new to me now when ever i think of pregnancy i dont think i ever want to again i have two boys and will love to have a girl but the anxiety is too much for me to handle let alone through pregnancy its been almost 3yrs since my pregnaacy and i still have anxiety not as bad as when i was prego but i thank everyone for their story so i can ask for the medication that you guys recommed and to know iam not alone and even though i  didnt use anything while pregnant i want to tell you that if i was gjiving the chance i would taken it was HELL so nobody needs to feel bad for taking anything only somebody going to anxitety know what it really is and if someone wants tp talk about it please let me know and maybe we xchange number or email",
            "post_id": "7401460",
            "timestamp": "1321061499",
            "user_id": "user_1890147",
            "user_link": "/personal_pages/user/1890147",
            "votes": "0"
        },
        {
            "answer": "I'm new to anxiety and usually only take Ativan when I fly, however being prego now I have had small anxiety attacks. Meditation helps greatly, not eating fatty foods also helps, lots of citrus such as grapefruit and oranges too. I would stay away from RX mess as there are severe side effects. Take a small vaca even if it's close to home, prenatal massages also work great. Good luck",
            "post_id": "7439700",
            "timestamp": "1322146389",
            "user_id": "user_1912102",
            "user_link": "/personal_pages/user/1912102",
            "votes": "0"
        },
        {
            "answer": "I've been a severe anxiety and depression sufferer for almost 12 years with several suicide attempts in my late teens (I'm 27 now). I am curently 30 weeks pregnant with my first baby and have had a pretty rough go of things.  I was on xanax and several other drugs every day but stopped when I found out I was pregnant. My husband and I were trying to get pregnant for two years so we had a lot of time to anticipate the challenge of going off these meds and to research other options. This is what I've found.A couple options that are safer for baby that you can ask your doctor about are buspar (a non-benzo anxiety medicine: category b) and hydroxyzine (category c). Hylands also makes an over the counter pill called calms forte that has helped me a lot.  It's pregnancy safe, although a little pricey. I have alternated using these medications (under a drs. care of course) and although things have still been rough, they've helped me manage the worst of it.One other thing that has helped that I'm sure people will have mixed opinions on is acupuncture. I'm not sure it helps the anxiety, but it has helped control the hormones that come along with pregnancy and can make anxiety worse (it also helps with constipation which is a big annoyance in pregnancy!!)  I hope this information helps!",
            "post_id": "7442593",
            "timestamp": "1322257178",
            "user_id": "user_1913769",
            "user_link": "/personal_pages/user/1913769",
            "votes": "0"
        },
        {
            "answer": "Anxiety is manageable, even if you need medication to help make it manageable.  I am pregnant with my second child.  I am 25 weeks now and take a low dose of cymbalta, the lowest available.  Some days, I feel it is not enough, but I grin and bear it for the safety of my unborn baby.  I just got back from Thanksgiving in CA, and I came back in worse shape than before.  I miss my family terribly.  My husband doesn't seems to understand.  We live 7 hours away, so it is not possible to visit more than 2 or 3 times a year due to finances and taking time off.  I am taking everything day by day.",
            "post_id": "7448387",
            "timestamp": "1322450204",
            "user_id": "user_1917382",
            "user_link": "/personal_pages/user/1917382",
            "votes": "0"
        },
        {
            "answer": "i am 33 years old and 11 weeks pregnant. i suffer from really bad anxiety and panic attacks. i have taken lexapro for 10 years and about 4 months ago they changed me to effexor now i stoped cold turkey. my panic is on.  i have palpatations wich in turn sets off the panic and the panic sets off the palpatations. really need someone to talk to or GOD just prey for me.",
            "post_id": "7543376",
            "timestamp": "1325383387",
            "user_id": "user_1962695",
            "user_link": "/personal_pages/user/1962695",
            "votes": "0"
        },
        {
            "answer": "Hi, I was reading peoples posts on here and i was wondering is there any risk for what you are on for anxiety while being pregnant?? i am 31 weeks now and just started having severe anxiety because of a rapid heartbeat that i was in the ER for, totally scary!",
            "post_id": "7553184",
            "timestamp": "1325650778",
            "user_id": "user_1967792",
            "user_link": "/personal_pages/user/1967792",
            "votes": "0"
        },
        {
            "answer": "Hi,Just read your post, I know exactly what your going through. When I found out I was pregnant with my daughter who is 2 now, I was on Paxil, and .25 xanax # times daily. The doctor told me I can stay on the xanax but had to get off the Paxil..my daughter was born early at 33 weeks and was perfectly fine. I have a history of preterm labor that's why my baby was born early. So if your anxiety is that bad get on xanax, after you deliver I highly recommend Paxil, it really helps with social anxiety what I have also..I truly belive it saved my life, with God's help of course. Best of luck to you and your baby.April",
            "post_id": "7580251",
            "timestamp": "1326326976",
            "user_id": "user_1981749",
            "user_link": "/personal_pages/user/1981749",
            "votes": "0"
        },
        {
            "answer": "Hi,Just read your post, I know exactly what your going through. When I found out I was pregnant with my daughter who is 2 now, I was on Paxil, and .25 xanax # times daily. The doctor told me I can stay on the xanax but had to get off the Paxil..my daughter was born early at 33 weeks and was perfectly fine. I have a history of preterm labor that's why my baby was born early. So if your anxiety is that bad get on xanax, after you deliver I highly recommend Paxil, it really helps with social anxiety what I have also..I truly belive it saved my life, with God's help of course. Best of luck to you and your baby.April",
            "post_id": "7580959",
            "timestamp": "1326342256",
            "user_id": "user_1981749",
            "user_link": "/personal_pages/user/1981749",
            "votes": "0"
        },
        {
            "answer": "i am going throught the SAME exact thing!! this relates to my situation the best i am 20 years old and found out i was pregnant about 4 weeks ago or so and i am about 7 weeks pregnant now my doctor totally refused to let me take them anymore and referred me to the emergency room if i couldnt handle it and of course i couldnt handle it as i have been on benzos for 4 years and klonopin i been on for a year and a half alone. I went to the ER yesterday and they told me how bad it was taking klonopin while pregnant as it is a category D (look it up if you'd like). They gave my six .5 klonopin to wean help wean off i have take three .5s for 3 days like .25s for 3 days and then .25s every other day for four days. I was taking 1mg a day every day sometimes more so to dramatically wean me off of them is a little much and i do still wonder if the stress is going to be worse or just taking the klonopin will have to ask my ob doc.but they should NOT take you off of them cold turkey absolutely not! not good for u or the baby. They gave me a script (category or A or B pregancy safe anxiety med) for after im done weening myself from the Klonopin is called Buspirone. Maybe look ino that? good luck!!",
            "post_id": "7582224",
            "timestamp": "1326385177",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "i am going throught the SAME exact thing!! this relates to my situation the best i am 20 years old and found out i was pregnant about 4 weeks ago or so and i am about 7 weeks pregnant now my doctor totally refused to let me take them anymore and referred me to the emergency room if i couldnt handle it and of course i couldnt handle it as i have been on benzos for 4 years and klonopin i been on for a year and a half alone. I went to the ER yesterday and they told me how bad it was taking klonopin while pregnant as it is a category D (look it up if you'd like). They gave my six .5 klonopin to wean help wean off i have take three .5s for 3 days like .25s for 3 days and then .25s every other day for four days. I was taking 1mg a day every day sometimes more so to dramatically wean me off of them is a little much and i do still wonder if the stress is going to be worse or just taking the klonopin will have to ask my ob doc.but they should NOT take you off of them cold turkey absolutely not! not good for u or the baby. They gave me a script (category or A or B pregancy safe anxiety med) for after im done weening myself from the Klonopin is called Buspirone. Maybe look ino that? good luck!!",
            "post_id": "7582230",
            "timestamp": "1326385254",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "I think you should ask your ob doc whats going to benefit you more. having the panic attacks or just taking the risk of staying on the xanax.. they have me weaning off of klonopin and gave me a script for buspirone for after im done doing that and they gave me 2 weeks to wean myself off of them after being on benzos for 4 years now.. so i know how u feel and its going to be really hard just replace it with something like anything to keep ur mind occupied that good for the baby of course.. i am personally going to see a counselor for help. I want to try my hardest to stay away from any benzo cuz it has been proven to cause birth defects. good luck!!",
            "post_id": "7582266",
            "timestamp": "1326385792",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "ive heard that zoloft is really bad for pregnancy and have seen the commercials about it.. i wouldnt feel safe being on that while pregnant only because what ive heard.. i would do some research on it before continuing to take it but that is all up to you of course good luck!",
            "post_id": "7582282",
            "timestamp": "1326386135",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "I would deffinitly tough it out for the rest of your pregnancy with no meds! that is awesome you arent on any. After the baby is born however i think you should see a doctor about the panic/anxiety disorder as i have had this for 4 years i cant even go in big stores without freaking out so i know how you feel! try and stay calm and know that everything will be okay tomarrow is always a new days. i wouldnt suggust going on any type of benzo suxh a xanax klonopin ativan or valium they are so addicting and they end up making you ALOT worse in the long run you begin to depend so much of taking them just to feel normal every day that it is sickning ive been on benzo for 4 years just found out that i am pregnant and i am in the process of weaning myself off of klonopin and it is one of the worst feelings in the world.. I can say that it has absolutely ruined my life! and wish i was never introduced to it! It helps let me tell you but its very temporary. i would suggest any natrual way to fix your problem and seeing a councelor. Have someone go with you that you feel extra safe and comfortable around! good luck! my heart goes out to all u guys as i know exactly what you are going through!",
            "post_id": "7582316",
            "timestamp": "1326386654",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "This is exactly what i said! After finding out i was pregnant! i wish it was planned so that i had time to wean myself off of the Klonopin before i got pregnant so that it didnt have to be so quick and sudden! they had just given me my usual klonopin and advised me to start prozac and i bought a pregnancy test before starting my prozac and found out i was pregnant didnt start taking it but continued the klonopin as i am now weaning myself off of this now its a HORRIBLE feeling as i am so addicted to it after taking it for 4 years but i have to do what is best for the baby and everyone has told me klonopin cant be continued as it is a category D. So if you are trying to get pregnant i would DEFFINITLY recommend starting to wean urself off of them (ask your doctor)  so that when you do get pregnant your not overwhelmed about still being in the prozac and your body will have time to get used to the change. Good luck!",
            "post_id": "7582342",
            "timestamp": "1326387020",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "This was very comfortable reading this! Made me feel alot better! I just started weaning myself off of klonopin afterr finding out i am pregnant and it is the worst feeling in the world as it has ruined my life! or atleast started too i woke up last night crying sitting in the bathroom puking praying to god for his help and guidence!",
            "post_id": "7582351",
            "timestamp": "1326387213",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "i am on and off with those feelings but my pregnancy was unplanned but very obvious i was going to get pregnant. it is deffinitly your hormones running back and fourth! think positive and be happy! just think that you have accomplished something that you have tried for! Think of how happy you will be when you get this baby out! Think of names and talk with you husband about everything maybe he can reassure you that everthing will be okay. I have to be reassured by my boyfriend every day that this is what he wants and that he isnt going to up and leave he does a very good job keeping my comfortable but also stresses me the hell out sometimes and i have my doubts but i am trusting what he says and trusting in how i feel. as this is a new relationship so its very iffy and scary but im beleiving good luck!!",
            "post_id": "7582371",
            "timestamp": "1326387578",
            "user_id": "user_1982676",
            "user_link": "/personal_pages/user/1982676",
            "votes": "0"
        },
        {
            "answer": "I have been suffering from anxiety since I was in my early 20's. I am 26 now and am 27 weeks pregnant. When I first learned about the pregnancy I was on 30mg/ Paxil daily. My family doctor told me to wean off of them, so I did. Worst mistake of my life..My anxiety and depression became so unbearable that I had to start taking Celexa. I am now on my 2nd day of the full 20mg dose after 5 days of 10mg. I feel absolutely hopeless and I am so scared..of everything. How am I suppose to take care of a newborn baby if I feel this way when she is born ?!  I can barely take care of myself. I am on a waiting list for some counselling and am hoping this medication will kick in sooner than later.  This site has helped me not feel so alone..",
            "post_id": "7599268",
            "timestamp": "1326846642",
            "user_id": "user_1967740",
            "user_link": "/personal_pages/user/1967740",
            "votes": "0"
        },
        {
            "answer": "My 17 year old daughter is going through the same thing,I have gotten her to go out of the house but soon as we get to the doc office she wont go in.she says she cant.we have tried everything nothing has worked so far .she is 31 weeks pregnant.",
            "post_id": "7689555",
            "timestamp": "1329438611",
            "user_id": "user_2033898",
            "user_link": "/personal_pages/user/2033898",
            "votes": "0"
        },
        {
            "answer": "I am 37 weeks pregnant and I have been dealing with anxiety for about 11 years I was on Zoloft and Xannax before I got pregnant but stopped once I found out. My anxiety is so bad all I think about is death and dying! I'm hoping she comes soon so I can feel myself again but in scared I won't ever feel the same! Can anyone relate to the way I feel or am I alone",
            "post_id": "7704503",
            "timestamp": "1329866766",
            "user_id": "user_2040735",
            "user_link": "/personal_pages/user/2040735",
            "votes": "0"
        },
        {
            "answer": "You're almost there!  You're not alone. I suggest talking to your doctor about the different options that there are, wether it be counselling or baby safe medication to get you through the last few weeks of pregnancy. You won't feel this way forever!",
            "post_id": "7711766",
            "timestamp": "1330053216",
            "user_id": "user_1967740",
            "user_link": "/personal_pages/user/1967740",
            "votes": "0"
        },
        {
            "answer": "this site has helped but also scared me at the same time I am almost 28 weeks with my first child I have been taking Xanax and benzos on and off my pregnancy for depression and anxiety I know there are others that doctors can prescribe but if u are not suffering u don't understand what its like. I feel horrible and worry everyday about the help of my little girl its driving me insane can someone please give me some answers let me know if my baby will be ok or if u have had a child and took Xanax throughout ur pregnancy is your child healthy.....thank u",
            "post_id": "7773808",
            "timestamp": "1331868583",
            "user_id": "user_2077153",
            "user_link": "/personal_pages/user/2077153",
            "votes": "0"
        },
        {
            "answer": "I have the exact same fears!  I feel as if I am going to have a heart attack any second and die right in front of my son.  I hate this feeling.  It is so not me.  I think everytime I turn on the news someone is dying.",
            "post_id": "7889889",
            "timestamp": "1335229627",
            "user_id": "user_2125720",
            "user_link": "/personal_pages/user/2125720",
            "votes": "0"
        },
        {
            "answer": "anxiety *****! i to am 23 pregnant and suffer from this!! WHY !? I ask myself!",
            "post_id": "7939954",
            "timestamp": "1336619466",
            "user_id": "user_2154886",
            "user_link": "/personal_pages/user/2154886",
            "votes": "0"
        },
        {
            "answer": "It is so good to know that I am not alone.  I am not pregnant yet, but my husband and I were going to go through artificial insemination.  But I have suffered for anxiety for 25 yrs.  I am on Paxil right now.  The thought of conceiving, being pregnant, delivering a baby has brought on severe attacks.  I cannot function, eat, sleep, work.  Now I am wondering if it is all worth it. Maybe I don't need to have a baby, maybe adoption is a better answer for me.  I have prayed for God to take this burden from me.  Everyone says just let God have your worries, or trust God more, but I don't know how to trust God more.  It is so hard when no one around you knows how you feel.  I have \"pushed\" through attacks before, but I can't imagine living with this feeling for 9 months, maybe longer.--I can't live with this feeling for 9 months.  I feel like I have let everyone down(husband, mother, family) if I can't have a child naturally because of my disorder, or I feel like less of a woman because I don't want a child bad enough to go through the attacks. Help please!",
            "post_id": "8173895",
            "timestamp": "1343221603",
            "user_id": "user_3149375",
            "user_link": "/personal_pages/user/3149375",
            "votes": "0"
        },
        {
            "answer": "I can relate to a lot of what you said. My husband and I also want to start a family fairly soon. I had my first anxiety attack last March and have been on Wellbutrin (75mg/twice a day) and Xanax (.5 mg/day). I'm in my last year of dental hygiene school which I'm also concerned about because of the added stress. The reason we want to try now is that I'm 27 years old and I'm not sure how easy it will be for me to get pregnant. I'd like time to monitor my cycle, etc. I don't know what to do about my meds... I tried not taking the xanax but I just felt off the entire day. I can't imagine doing that for 9 months. I just feel so alone and I'm tired of stressing over this stuff. My husband is really encouraging and tells me to just trust God. But how can I when things like birth defects, etc is a possibility. I know I should have faith...but I don't know how. I feel guilty for not being a more \"glass half full\" type person. Anyways, just wanted to vent that out.",
            "post_id": "8487116",
            "timestamp": "1352087109",
            "user_id": "user_4276882",
            "user_link": "/personal_pages/user/4276882",
            "votes": "0"
        },
        {
            "answer": "I had same issues, same medication. Let me ask, are u ok on your period? I was on every medicine u can think of with aniexty and depression and panic attacks, but realized none were working so I looked into what caused what.. I realized I'm the nicest person (I ask every bf too) on my period but not the rest of the month.. Go figure I was sane when I was pregnant too! I have a hormone imbalance. :) I started a birth control pill w the extra hormone in it, go figure didn't need the other meds. I suggest you should try it. :) good luck",
            "post_id": "8516508",
            "timestamp": "1352899006",
            "user_id": "user_4329911",
            "user_link": "/personal_pages/user/4329911",
            "votes": "0"
        },
        {
            "answer": "My doctor put me on Xanax and I'm trying to get pregnant. He informed me that If i get pregnant to stop taking xanax. I was on a very low dose and it seemed to be really helping. My cycle days went from 60 days to 28 days. When I called to get a refill (30 pills in 3 months) so I don't take often and when I do I take half. He said no. He said that that is not safe while I am pregnant or trying to get pregnant. I asked him if there was anything safe that I could take during pregnancy that he would recommend and he said no. He said that when I get pregnant and I still have anxiety come see him and we can discuss our options. :(",
            "post_id": "8541883",
            "timestamp": "1353595779",
            "user_id": "user_4373945",
            "user_link": "/personal_pages/user/4373945",
            "votes": "0"
        },
        {
            "answer": "I miscarried from taking xanax while pregnant but i didnt know untill it was to late i was only eight weeks any kind of benzo is not safe unless you start it later then 12 wks which its still not safe, i was on 4 mg a day and i stopped by slowly taking myself off of it going down .5mg a week, its not easy but is possible",
            "post_id": "8618459",
            "timestamp": "1355428696",
            "user_id": "user_4493717",
            "user_link": "/personal_pages/user/4493717",
            "votes": "0"
        },
        {
            "answer": "I'm 19 weeks pregnant and I'm 18.My anxiety & panic attacks were so bad that my doc had Me on 2mg a day Xanax.Once I got pregnant a little before my 2nd trimester the anxiety got worse. My doctor said that the stress, no sleep, no eating, panic attacks etc. are worse on the baby then taking Xanax. I continue taking my dose & my baby is growing perfectly !!",
            "post_id": "8848586",
            "timestamp": "1360947107",
            "user_id": "user_4913800",
            "user_link": "/personal_pages/user/4913800",
            "votes": "0"
        },
        {
            "answer": "I am 3 weeks pregnant and started crying when I saw your post.  I am going through the exact same feelings and I am freaking out. How did you do and how is life now. Please help!",
            "post_id": "8864785",
            "timestamp": "1361392872",
            "user_id": "user_4946626",
            "user_link": "/personal_pages/user/4946626",
            "votes": "0"
        },
        {
            "answer": "I am also a long time sufferer of anxiety and panic attacks and have been on the generic brands for Zoloft and Xanax. I am trying to get pregnant but I need to know if I can take those meds during my pregnancy. I've been told not to because of birth defects so I desperately like to know if there are alternative medications that I can take while pregnant. Someone please help!!!",
            "post_id": "8906030",
            "timestamp": "1362553299",
            "user_id": "user_5029560",
            "user_link": "/personal_pages/user/5029560",
            "votes": "0"
        },
        {
            "answer": "I am also a long time sufferer of anxiety and panic attacks and have been on the generic brands for Zoloft and Xanax. I am trying to get pregnant but I need to know if I can take those meds during my pregnancy. I've been told not to because of birth defects so I desperately like to know if there are alternative medications that I can take while pregnant. Someone please help!!!",
            "post_id": "8906032",
            "timestamp": "1362553442",
            "user_id": "user_5029560",
            "user_link": "/personal_pages/user/5029560",
            "votes": "0"
        },
        {
            "answer": "Ask your doctor if there is an anxiety medication that can be used as an alternative to xanax. I am going through the same exact problem.  You are not alone. I asked my doctor if it was safe to take clonzepam and she told me no bc it was a category d.  She is going to start me off on something else when I am in my second trimester. Right now you should exercise daily which releases endorphins and keep yourself busy.",
            "post_id": "9062550",
            "timestamp": "1367075936",
            "user_id": "user_5374663",
            "user_link": "/personal_pages/user/5374663",
            "votes": "0"
        },
        {
            "answer": "I have this sometimes, too. Most of the times I am having an anxiety attack, I am either driving in my car or somewhere far from home. Something about being on the road (with no one else along) causes me anxiety. And sometimes sheer panic. It's such an irrational fear but I admit I have it. Hang in there! All I can say is it helps me to call and talk to someone on the phone or take a small dose if ativan.",
            "post_id": "9144562",
            "timestamp": "1369596812",
            "user_id": "user_5543944",
            "user_link": "/personal_pages/user/5543944",
            "votes": "0"
        },
        {
            "answer": "I am struggling with this as well. I am about 5 weeks pregnant and have been taking xanax for 10 years. I am TERRIFIED that I am going to have a baby with birth defects. I have been weaning down on it but my anxiety and depression symptoms are getting SEVERE. I feel suicidal because I am so exhausted, sleep deprived and sick to my stomach and simultaneously terrified that I am going to have a baby with birth defects. I am not in a good place. Psychiatrist put me back on an SSRI to help with the sx so I can go off of the xanax. But its the worst to take xanax during the first trimester and that is when I will have taken it. this is hard.",
            "post_id": "9354962",
            "timestamp": "1375574025",
            "user_id": "user_5858626",
            "user_link": "/personal_pages/user/5858626",
            "votes": "0"
        },
        {
            "answer": "Oh my god. Reading this just made me almost cry. I have SEVERE anxiety disorder, depression and PTSD. I have taken xanax for 10 years and I have been trying to wean off of it because I am beyond terrified of hurting my baby or having a deformed, sick child. It is causing me so much terror and anxiety that it just compounds everything else.To hear that your doc said the stress, no sleep and not eating is WORSE for the baby than xanax makes me feel like 1000x better. I have been in a living hell for the last 2 weeks. And its so sad because i feel like most people I know who get pregnant are SO happy and feel great. I felt like there was something so wrong with me that I was having worsening anxiety sx and horrible fears.",
            "post_id": "9354977",
            "timestamp": "1375574357",
            "user_id": "user_5858626",
            "user_link": "/personal_pages/user/5858626",
            "votes": "0"
        },
        {
            "answer": "I am so sorry u are going through this. I don't even know u and my heart is hurting for u.",
            "post_id": "9627739",
            "timestamp": "1383541593",
            "user_id": "user_6664651",
            "user_link": "/personal_pages/user/6664651",
            "votes": "0"
        },
        {
            "answer": "hi so sorry for your issues, am curious so how did your pregnancy go? I am asking because where i live doctors dont take anxiety issues seriously. Any time i speak of my anxxiety sysmptoms to my doctor he says i shd relax n will be fine, no medication or any thing. av had m.c's in the past n still ttc. am just wonding if i can carry a pregnancy to term with butterflies in my stomach always and palpitating heart and sleepless nights. I work full time too.",
            "post_id": "11465114",
            "timestamp": "1415120402",
            "user_id": "user_11078606",
            "user_link": "/personal_pages/user/11078606",
            "votes": "0"
        },
        {
            "answer": "I&#x27;m 9 weeks pregnant, and I take .5mg of ativan as needed I have anxiety so badly I get these uncontrollable movements... That last for hrs longest is 24hrs it makes it hard to function through out the day and take care of my two boys.... I'm desperate for some advise for somebody who has experienced this same thing.",
            "post_id": "13605160",
            "timestamp": "1452737611",
            "user_id": "user_16973440",
            "user_link": "/personal_pages/user/16973440",
            "votes": "0"
        },
        {
            "answer": "My mother took Gardenal and diazepam during her 2 pregnancies. My brother and I turned out fine. My impression is that doctors in general don&#39;t want to be blamed if something goes wrong. Once I saw a pregnant mom jump from the 18th floor since her OBgyn told her to go cold turkey on AD+benzos. Sometimes you just need the meds and since there are no human studies correlating pregnancy and risks with the use of such meds (and it&#39;ll never be!), do what&#39;s best for you and seek other specialists to take this burden off.",
            "post_id": "13869866",
            "timestamp": "1464652206",
            "user_id": "user_18409478",
            "user_link": "/personal_pages/user/18409478",
            "votes": "0"
        }
    ],
    "post_id": "14832",
    "question": "Hello, I was wondering if there are any women out there that have gone through or know anybody that has, having severe panic and anxiety attacks while being pregnant? I have suffered from this disorder all my life and have had 3 other children while not taking anything, just in the last 2 years have I been taking xanex .25 to .5mg a day. I am now pregnant with twins around 8-9 weeks. I am horriably afraid to stop taking these and am also afraid of the side-effects of the drug itself on the babies. I was just wondering if there's anyone out there that has gone through this and if so what advice do you have for me.",
    "timestamp": "1174280400",
    "title": "anxiety and pregnant!!!",
    "user_id": "user_141719",
    "user_link": "/personal_pages/user/141719"
}