{
    "answers": [
        {
            "answer": "I just googled septate uterus and found many good articles, perhaps these would be helpful?  Sorry I don't have any direct information.   Best of luck to you for an healthy baby.",
            "post_id": "1185799",
            "timestamp": "1156050000",
            "user_id": "user_130738",
            "user_link": "/personal_pages/user/130738",
            "votes": "0"
        },
        {
            "answer": "yeah I have looked it up just wondering if anyone out there knows first hand about it????",
            "post_id": "1185801",
            "timestamp": "1156050000",
            "user_id": "user_152163",
            "user_link": "/personal_pages/user/152163",
            "votes": "0"
        },
        {
            "answer": "I also have a uterine septum. I m/c back in Jan and now am 14 wks preggers YEAH! I didnt even know I had his problem until I went to high risk dr and he told me I had this. What it is from what I understand... a split in the utrice an can be corrected by a surgical procedure. It can cause m/c as well as premature labor. Unfortunately I didnt know I had it until the u/s tech found it at 6wks. I was on pins and needles the entire first trimester. What was really interesting is it doesnt seem to be a topic of concern in the last several visits. There are 3 types of septums of the uterice and this type is the better of he 3 to have.",
            "post_id": "1185808",
            "timestamp": "1156050000",
            "user_id": "user_144395",
            "user_link": "/personal_pages/user/144395",
            "votes": "0"
        },
        {
            "answer": "Check in the archives for this forum, the topic has been discussed a lot and you will find some pretty interesting information.",
            "post_id": "1185811",
            "timestamp": "1156050000",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "thanks Annie thats good advice",
            "post_id": "1185812",
            "timestamp": "1156050000",
            "user_id": "user_152163",
            "user_link": "/personal_pages/user/152163",
            "votes": "0"
        },
        {
            "answer": "I dont have any other children :(  and this is my first :) I was told I couldnt have surgury while being pregnant. Back in Jan when I had blighted ovum, obgyn u/s me several (4) times and never mentioned anything regarding uterine septate. I dont think its extremely common although looking on this site it doesnt seem that rare. High risk doctor found mine on the first u/s and told me I was born with it. Like Annie said depending on the severety of it, your uterice could split. This doesnt sound like your problem because you already have children. Sorry to hear abour your losses. Good luck to you, stay well.",
            "post_id": "1185836",
            "timestamp": "1156050000",
            "user_id": "user_144395",
            "user_link": "/personal_pages/user/144395",
            "votes": "0"
        },
        {
            "answer": "If you have a uterine septum (I'd ask for confirmation, one ultrasound is not enough, an HSG will tell you more), the problem is if the baby implants right on the septum.  If so, there is usually not enough blood supply for an embryo, which creates a higher likelihood of a m/c.  Otherwise, according to my fertility doc, the septum gets pushed aside by the growing embryo and its amniotic sac, and doesn't cause problems.  This might explain why some of your babies did fine and others didn't, but also keep in mind that miscarriage is usually for the baby's own reasons that have nothing to do with the mom's uterus, so maybe at least one or two of yours were from other issues independently of whether you have a septum.  Septums can be removed, they are just soft tissue hanging down into the uterine cavity, but even that is not always necessary.  The only time it would be worrisome is if you had a totally divided uterus, with a wall going down the middle that creates two halves.  This reduces the space for the baby to grow, which is where the stories of preterm labor come from.  But given your history, you don't have that! :)",
            "post_id": "1185817",
            "timestamp": "1156050000",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "I dont have any other children :(  and this is my first :) I was told I couldnt have surgury while being pregnant. Back in Jan when I had blighted ovum, obgyn u/s me several (4) times and never mentioned anything regarding uterine septate. I dont think its extremely common although looking on this site it doesnt seem that rare. High risk doctor found mine on the first u/s and told me I was born with it. Like Annie said depending on the severety of it, your uterice could split. This doesnt sound like your problem because you already have children. Sorry to hear abour your losses. Good luck to you, stay well.",
            "post_id": "1185833",
            "timestamp": "1156050000",
            "user_id": "user_144395",
            "user_link": "/personal_pages/user/144395",
            "votes": "0"
        },
        {
            "answer": "Do you have other children?Did you have the surgery?As I said I have had 3 healthy births and children and then in the last yr. 3 m/c's and they said that they think its this Septate but what I dont get is if I've had it all along would it not have stopped the other pregnancys?I'm going to see the OB on Tues. and I'm sure he will be sending me to a specialist.It was through a u/s that they saw this on me as well, but from all the u/s I've had I find it hard to believe that they would just see it this time?Anyways will go and ask many many questions",
            "post_id": "1185813",
            "timestamp": "1156050000",
            "user_id": "user_152163",
            "user_link": "/personal_pages/user/152163",
            "votes": "0"
        },
        {
            "answer": "my cousin has a heart shaped uterus and she was able to hold the preg well. She had to have a C section. I also have 2 uterus. At first it was thought to be heart shaped but during removal of my ectopic they found out that they are completely seperated. I also have 2 cervix. One is in the right place but the other is in the wall of the vagina and that is why it is hard for me to conceive. I only have one tube now as the ectopic side had to be removed as it suptured. Good luck with you.",
            "post_id": "1186063",
            "timestamp": "1156136400",
            "user_id": "user_89233",
            "user_link": "/personal_pages/user/89233",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with a septate uterus at my 6th wk U/S, which came as  a total surprise to me as I had had two U/s prior to that for PID which did not indicate the septum.I was worried till my next U/S which was on my 9/10 week, where the U/S tech could find nothing after abdominal U/S and a  Trans vaginal U/S. My ob gyn suggested the septum could have been pushed aside by the growing embryo.I had posted question on the same some times back, the ladies out here really helped me calm down.I am at my 20wk right now with no complications except for the normal preg discomforts :)As Annie said, it might not be an issue, even if you have one, as you hv already had successful pregnencies.All the best.",
            "post_id": "1185895",
            "timestamp": "1156136400",
            "user_id": "user_150847",
            "user_link": "/personal_pages/user/150847",
            "votes": "0"
        },
        {
            "answer": "i have a septim i have had 2 successful pregnancys its never been a concern for me and the doctors have never been concerned about its just a wall down the middle of the womb so it meas you have to wombs and the baby can be on either side and most of the time the baby can be  breech therefore they would book you in for a section 1 st son was on the right side and my 2nd son was on the left it does ache you alot more than a normal pregnancy if no septim cos it means the baby only has half the room to move in its quite rare but ther is nothing to worry about the reasons you could have premature labour is cos the baby  has half the space so as it gets bigger there is a chance of going into labour but i had 2 big babys and one was 2 wks early just cos i had section which has to be done 2 wks prior to due date and my 2nd sone was 6wks early and that was cos i had strep b infection. hope this helps",
            "post_id": "1767175",
            "timestamp": "1187547496",
            "user_id": "user_255001",
            "user_link": "/personal_pages/user/255001",
            "votes": "0"
        },
        {
            "answer": "I have recently found out that I am a few weeks pregnant and the doctor has informed me that I have a septated uterus as well as a Cyst on my ovary. I am really concerned and my husband and I are trying to figure out what the best thing to do is. If anyone has any advice from experience please help!",
            "post_id": "2812897",
            "timestamp": "1208883112",
            "user_id": "user_487808",
            "user_link": "/personal_pages/user/487808",
            "votes": "0"
        },
        {
            "answer": "I had a healthy baby boy 15 months ago.  I went on my due date and he was over 8 lbs.  I just learned that i have a septate uterus..the wall is done to my cervix and the doctors are against surgery because it can weaken my cervix.  THey say I was born like this but I dont understand how i carried my son full term.  I'm trying now to get pregnant again but i am a nervous wreck.  Any adviice????",
            "post_id": "3053332",
            "timestamp": "1213805146",
            "user_id": "user_539395",
            "user_link": "/personal_pages/user/539395",
            "votes": "0"
        },
        {
            "answer": "Do you have two cervix?  I have a septate uterus which duplicated my cervix, so I have two, and the septum also comes down into my vagina, so, I have a vaginal septum as well.  I carried my baby to full term, but was unable to deliver vaginal because she was breech.  Where you able to deliver vaginally?",
            "post_id": "3053377",
            "timestamp": "1213806019",
            "user_id": "user_271130",
            "user_link": "/personal_pages/user/271130",
            "votes": "0"
        },
        {
            "answer": "I had been told after my daughter was born during my c-section that I had a heart-shaped uterus. That was the reason my daughter was breech. She was born exactly one week before my due date. About a year and a half later I had a miscarriage. A few months later I was pregnant with my son. He was also breech and I had a c-section a week before his due date. For the last 2 years we have been trying to get pregnant again with no luck. My ob/gyn did an HSG a couple of months ago and determined I had a bicorneate uterus and send me to a fertility specialist. The specialist did an ultrasound and determined my uterus was not bicorneate, but it was a septate uterus. Since I have had two successful pregnancies and just one miscarriage, he is not too concerned. He mentioned surgery, but doesn't think that is necessary. We haven't determined why I am having fertility issues now when we had no problem getting pregnant before. I had been taking Clomid, but recently began taking Femara for fertility. There is a risk of multiples, mainly twins with these drugs. I was wondering if it was even possible to carry twins with a septate uterus. Has anyone ever heard anything about that?",
            "post_id": "3163467",
            "timestamp": "1216236388",
            "user_id": "user_563163",
            "user_link": "/personal_pages/user/563163",
            "votes": "0"
        },
        {
            "answer": "I honestly believe that it is possible to carry twins to term.  Look at all those women who carry MORE than two with a regular sized uterus.  :)",
            "post_id": "3163522",
            "timestamp": "1216236968",
            "user_id": "user_271130",
            "user_link": "/personal_pages/user/271130",
            "votes": "0"
        },
        {
            "answer": "I have a septate uterus, and had a beautiful, healthy baby girl 9 months ago.  I had lots of problems during my pregnancy (she was measuring a few weeks too small, she was breach, had the cord wrapped around her neck, didn't move a lot)  So during the last part of my pregnancy I was monitored a lot.  They had me come in once a week for a non-stress test and an ultrasound to look at blood flow and the fluid around the baby.  At 38 weeks I had to have an emergency c-section because during the last appointment while I was doing the non-stress test her heart rate dipped pretty low.  So that night I had my c-section, and my doctor discovered that the reason why she didnt move very much and was breach was because I have a septum in my uterus.  He said that it is about 2 inches long (while my uterus was stretched out to 8 1/2 months... but Im not sure how long is it when my uterus is a normal size).  My daughter was 6 pounds 3 ounces and perfectly healthy.  I got pregnant as soon as we started trying, so my doctor said I shouldn't worry about the septum unless I have miscarriages.  and then if that happens, then I should have surgery to get it removed.  But my septum is the reason she was so behind in her growth... now my daughter is in the 90th percentile in everything... so she definitely caught up!  I would say to those who have this... make sure you find a doctor who is familiar with this problem, and who will not shrug off your concerns.  My doctor had me come in to his office frequently (at least once a week for the last 2 months of my pregnancy), ran lots of tests and did lots of ultrasounds to check up on her, and addressed every single concern of mine like it was the most important thing.",
            "post_id": "3397141",
            "timestamp": "1221235621",
            "user_id": "user_618032",
            "user_link": "/personal_pages/user/618032",
            "votes": "0"
        },
        {
            "answer": "florencemom,I am concerned about future pregnancies... now that I know I have a septate uterus.  I want to get pregnant again next summer, but am scared that it might take a while for me to get pregnant, and that I shouldn't put it off.  Do you know how long your septum is?",
            "post_id": "3397166",
            "timestamp": "1221235929",
            "user_id": "user_618032",
            "user_link": "/personal_pages/user/618032",
            "votes": "0"
        },
        {
            "answer": "i am a 26 year old and i have a 3 year old son. i have never had anything wrong with my uterus (i know because i have extensive testing done earlier in life) but after i had my son who was very high risk, i began to be very ill. after 3 years of testing they found that my uterus is actually starting to split in half. i wasn't born like this. i have had 2 m/c in the last year and they don't think i'll be able to carry again. has anyone ever heard of this happening without being born with it?",
            "post_id": "3513852",
            "timestamp": "1223648367",
            "user_id": "user_646859",
            "user_link": "/personal_pages/user/646859",
            "votes": "0"
        },
        {
            "answer": "I was told 2 1/2 years ago that i had a bicornate uterus - i'm not even sure why i had the ultra sound at the time but it the first one they could not find my ovaries.  I'm getting married in 5months and we are hoping to start a family so i went to talk to my doctor (a different one) who said that i have a bicornuate uterus with a septate and now i am very confussed.  Since i was little i have wanted children and i feel i'm getting obsessed about the idea that i might not be able to and that it's possible i will have alot of trouble.  My parents know but my mother-in-law to be doesn't and she is eager for us to start a family because she thinks she is too old - not that this is true.  How do you cope with the thought of it all??  I just need to keep busy i think - it doesn't help that i am a child carer and only work casually!!",
            "post_id": "3523415",
            "timestamp": "1223867560",
            "user_id": "user_649255",
            "user_link": "/personal_pages/user/649255",
            "votes": "0"
        },
        {
            "answer": "My husband and I have been trying to conceive for over a year; we had a miscarriage @ 6 1/2 wks in April 2008.  I decided to seek out more info and went to a wonderful reproductive endocrinologist through Johns Hopkins in Baltimore.  I am Catholic and not interested in \"fertility treatments,\" but figured knowledge is power and perhaps some blood tests were in order to see if there is anything organic I could possibly do something about.  She diagnosed the problem within 2 minutes of examining me.  Using a transvaginal ultrasound (the same type used after my miscarriage), she identified a partial septum; she then sat me down, drew pictures to illustrate what this meant and discussed my options.  The most concise and complete information I have found regarding congenital anomalies can be found at this link:http://www.gehealthcare.com/usen/ultrasound/education/products/cme_uterus.htmlIt took a lot of Googling about Septate Uterus, but I ended up with quite an education!  In all my fertility and pregnancy books, \"uterine anomalies\" usually only had a few sentences and referred to endometriosis or fibroids.  Congenital anomalies are more common than people think and unless you know what you are looking for, the available information is scarce.  I just spent 3 hours in Barnes & Noble today and found only 2 books that referenced it in any detail.  I am doing a lot more research into this and am planning on writing much more about it to post on other sites where people look for possible clues and answers, but felt compelled to share what I've learned so far with you now at 2:00 AM because I can relate to your anxiety.When my doc discovered this, the first thing that popped into my head was, \"Hallelujah!  There is something my husband and I can do about it.\"  BTW, my doc also checked out my ovaries and found many, many follicles waiting to become bebes!  Another BTW, I am the eternal optimist: I was conceived after a miscarriage, I waited for many years to find the right man, got married in 2006 and am trying start a family.  I am now 40 years old and my mother was 42 when my baby brother (now 30) was born - doc said that's good news for me.  But, I digress.  My second thought was, \"Why is this simple diagnostic test not being performed at least once during a routine gynecological exam in women before they suffer the pain of miscarriage or unexplained infertility?\"  I intend to find out why or why not.The next step was to get an hystersalpingogram (HSG) to confirm my doc's diagnosis and to check if my Fallopian tubes are open (if they weren't, she could easily perform a Tuboplasty right then and there - similar to an Angioplasty in the heart).  This involved scheduling between days 6 & 10 of my cycle (to allow the best view of the uterus) and the injection of contrast dye.  My tubes looked great and the septum was clearly defined; it was larger than she had originally thought.  BTW, any radiologic tech can perform an HSG, however, many times a misdiagnosis of bicornuate uteri is made.  Therefore, I had to pay $430 out-of-pocket because my doc was the one performing the HSG and the outpatient radiology place is not on my insurance's provider list - I was happy to pay it to have it done properly and will attempt to appeal the denied claim (will update on success).The next step was to schedule outpatient surgery (again between days 6 and 10 of my cycle) where my wonderful doc would essentially \"snip away\" the fibrous tissue that lacks a blood supply and therefore can cause recurrent miscarriage, placental problems and/or pre-term delivery and only allow a full-term baby 4.4% of the time.    Initially, she was going to us a local anesthetic, but because the septum was broader than she had originally anticipated, it was necessary to use a general and intubate me for the procedure.My surgery was this past Friday, October 10th.  It took less than an hour and my super doc said she basically snipped and the tissue pulled back like a spider web; she stopped when I started to bleed.  Her job was to know how much to cut without perforating and when to stop.  Bravo!  I felt some cramping as I came around (probably from what they used to expand my uterus so she could see, either fluid or gas - I'm thinking it was gas), but a heating pad and Ibuprofen did the trick nicely.  She advised, \"I can't put a band-aid on it or stitch you, so you may bleed for a few weeks, maybe until your next period.\"  I've been home taking it easy all weekend... except for cabin fever late Saturday that made me suddenly want to stain the deck - I paid for it that night though.  Aside from over-doing it, my only discomfort was a slightly sore throat from the LMA they used to tube me and that pain was gone Sunday afternoon after sucking on a few cough drops.All in all, I was never nervous and felt empowered that my husband and I could do something about this; he's been great!  I have been bleeding bright red blood since Saturday night (wearing only panty liners), but there's been no pain and I will schedule my follow-up for 2-3 weeks from now - only light exercise now, so no kickboxing.  Family has been sending care packages and I've resorted to box-kicking instead. haha  Doc wants us to wait until after my next period before we resume sex and I'll ask her when we can start TTC again.  I hope this information is helpful.  The best advice I can offer is:* Ask questions.  Write them down.  Don't feel rushed - ASK them.  If you are not satisfied with the answer, ask them again.* Be your own advocate.  Educate and empower yourself.* You are ENTITLED to a second opinion.  It will not offend your doctor; if it does, find a better doctor with thicker skin.All the best.  Oh, and this is from a very good friend of mine:{{{{{{{{{{{{{{{{{BABY VIBES}}}}}}}}}}}}}}}}}}",
            "post_id": "3527927",
            "timestamp": "1223967443",
            "user_id": "user_650251",
            "user_link": "/personal_pages/user/650251",
            "votes": "0"
        },
        {
            "answer": "having a septate does incresase you chance of a miscarage. i have had 3. one a set of twins. i have also had 1 secsessful preg. my daughter who is two. the problem with the septate is that the egg can implant on that, then does not have enuff blood supply to grow, so you miscarry. i have had two d&c's b/c of this. i am having a natural m/c right now b/c the egg went to the septate, not the uterine wall. it just makes it a bit harder for some. others have no prob at all. it also depends on if it is partial or complete. good luck to all.",
            "post_id": "3787018",
            "timestamp": "1229652190",
            "user_id": "user_714259",
            "user_link": "/personal_pages/user/714259",
            "votes": "0"
        },
        {
            "answer": "i was ttc for a year then after the use of clomid i got preg in August but it was an ectopic preg and i had to remove one of my tube... while having ultra sounds before getting pregnant dr were asuming that i have a bicornate utreus but while doing the laproscopic removal of tube they saw no dimple on the uterus this means uterus is not bicornate after then later in december i had HSG done which proves a septate uterus which almost dividing the uterus in 2 but not complately.. after having ectopic pregnancy removal in September dr has asked me not to concieve for 6 months. NOw they have suggested a hysterscopic removal of spetate and since the septation is big it will be done in 2 steps (2 surgries in time span of 1 month).and before having the hysterscopic treatment i have to take 2 injections of zoladex to suppress the blood flow in uterus where as my FSH levels are 7 they said zoladex will elevate these levels ....please help me can't i be pregnant again without undergoing this treatment ...all of my hormons are well within range except for prolactin which is slightly higher.",
            "post_id": "5238170",
            "timestamp": "1262764742",
            "user_id": "user_1161765",
            "user_link": "/personal_pages/user/1161765",
            "votes": "0"
        },
        {
            "answer": "Hi ladies,I was trying to conceive since last two years with no luck.Then we went to a reproductive specialist and came to know that, i have septate slightly bicornuate uterus that was diagnosed by HSG. The doctor said its not a problem and i can still conceive. Doctor kept me on clomid for two cycles and fortunately now i am 7 weeks pregnant. My HCG level is 16000 and progestrone is 46 and HSG is increasing as it should. I have ultrasound next week and i am worried if the fetus is implanted on uterus or septa? does any body know am i on safer side since my hormones are good and its eighth week?and i was wondering since i was on clomid i could have, twins would it be safe.",
            "post_id": "5563116",
            "timestamp": "1271084802",
            "user_id": "user_1277555",
            "user_link": "/personal_pages/user/1277555",
            "votes": "0"
        },
        {
            "answer": "Hey,im 17 years old and got results back from an ultrasound saying i possibly have a septate uterus, and i have a appointment with a gynaecologist next week. i am really freaking out about having a hysteroscopy! is there any other way you can diagnose a septate uterus? i have read MRIs have been used to diagnose it...?",
            "post_id": "6054355",
            "timestamp": "1282439779",
            "user_id": "user_1421160",
            "user_link": "/personal_pages/user/1421160",
            "votes": "0"
        },
        {
            "answer": "An MRI is a good way to see what is going on in the uterus.",
            "post_id": "6055032",
            "timestamp": "1282455224",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "okay, thankyou that calms me down alot, ill just ask if i can get an MRI rather than hysteroscopy then. thanks",
            "post_id": "6058401",
            "timestamp": "1282545978",
            "user_id": "user_1421160",
            "user_link": "/personal_pages/user/1421160",
            "votes": "0"
        },
        {
            "answer": "We have been trying for a baby for one and half years with no sucess.The ultrasound report said that i have a septate uterus.My husband has 94% abnormal shaped sprem.I am worried.Can i have a baby.",
            "post_id": "6194066",
            "timestamp": "1285765218",
            "user_id": "user_1459998",
            "user_link": "/personal_pages/user/1459998",
            "votes": "0"
        },
        {
            "answer": "I have a septated uterus. I found out when I was 16yrs old when they suspeected I had a tumor. Further testing revealed a septated Uterus. Dr. told me I would never have children. I am 35 now and have had 3 pregnancies, 2 of which were healthy almost full term, low birth weight. They are now 10 and 15. Btw I have the rarest form of septated uterus.good luck",
            "post_id": "6674070",
            "timestamp": "1298426240",
            "user_id": "user_1613943",
            "user_link": "/personal_pages/user/1613943",
            "votes": "0"
        },
        {
            "answer": "i had m/c month ago and the doctor told my h have a septated utures and ovary cyst iam so mad i cant imagine my life without kids i scare if i can not get baby i m/c at 8 weeks do u have any advice for me?",
            "post_id": "7315298",
            "timestamp": "1318387356",
            "user_id": "user_1837341",
            "user_link": "/personal_pages/user/1837341",
            "votes": "0"
        },
        {
            "answer": "Just curious what form do you have. I have recently discovered that I have a septated uterus and longitudal vaginal septum. I am wanting to pursue reconstructive options but am having difficulty with insurance. Anyone else with this issue?",
            "post_id": "7450021",
            "timestamp": "1322501135",
            "user_id": "user_1918323",
            "user_link": "/personal_pages/user/1918323",
            "votes": "0"
        },
        {
            "answer": "I had a miscarriage with my first pregnancy at 11 weeks. After trying to conceive for 8 months my husband and I went to a specialist and he told me I have a septate uterus.  I had an HSG and got pregnant that same month. I am 6 1/2 weeks and a bag of nerves because I am terrified I will miscarry again.What are the chances I will be able to carry this baby to term???",
            "post_id": "7511422",
            "timestamp": "1324325240",
            "user_id": "user_1947624",
            "user_link": "/personal_pages/user/1947624",
            "votes": "0"
        },
        {
            "answer": "I am 30 yrs old and in early october 2013 I was told at 8weeks that I had a bicornuate septum but there was also no heart beat found for my baby via uterine ultrasound by the local hospital. I currently have two children and I had one by csection. I had 4 miscarriages and 4 previoius abdominal surgerys and I had my gallbladder removed by laproscopy. I have stayed pretty much with the same ob for several years and have never been told I had a bicornuate septum and that was because I dont have one. Sometimes early on in pregnancy the sac for multiples can not be seen clearly on U/S. I was carrying twins and the septum the u/s tech thought she saw was the early loss of one of my twins. I am still currently pregnant and I am due in 6wks. My obgyn did two ultrasounds since my visit to the hospital, one at 20wks and still have not seen a (bicornuate septum) in my uterus. He also ensured me that with my past procedures and surgeries, as well as previous two full term pregnancies, I would have been notified if I had a septum in my uterus.  Good luck and I hope this has helped you.",
            "post_id": "10432710",
            "timestamp": "1400610780",
            "user_id": "user_8918921",
            "user_link": "/personal_pages/user/8918921",
            "votes": "0"
        },
        {
            "answer": "I also was told I have a septate uterus. I found out when I was 18 during an ultrasound I had to try to determine why me periods were so bad. The doctor told me that I would defiantly have trouble getting pregnant, but carrying to full term was something that could happen. Getting pregnant took a long time and I also had three miscarriages before I finally carried my daughter to 38 weeks (This was our last go at starting a family). I had a lot of complications during my pregnancy, none of which were related to my misshaped uterus, so I was induced at 38 weeks. I was in labor for over 24 hours and I would not dilate past 5cm, so I had a C-Section. I'm not sure if the lack of dilating was a direct result of my uterus issues though. But in the end my daughter was healthy and perfect. Three years later, she still is. After all we went through, she will be an only child. Just my personal experience.",
            "post_id": "11112550",
            "timestamp": "1410488487",
            "user_id": "user_10487223",
            "user_link": "/personal_pages/user/10487223",
            "votes": "0"
        },
        {
            "answer": "In 1987, I gave birth to fraternal twins at 36 weeks.  They were taken a month early due to preeclampsia.  During the c sect the Dr.'s found a complete uterine septum-they cut it out in order to find the 2nd baby.  Both babies were 4-5 lbs and in great shape.Doc said this was congenital and we did not know we were having twins until 20 days before they were born.  Back then, routine ultra sounds weren't done-even though there was a little bit of bleeding early on.  I've always wondered if I was pregnant with one baby and then got pregnant with the second one the next month as there was a good pound or so  size difference.Anyway, 3 1/2 years later I had a singleton via section and the wall had not come back.  13 months later our last singleton was born naturally.In all this time, I've found little to nothing on pregnancies and this anomaly.",
            "post_id": "11613315",
            "timestamp": "1417573626",
            "user_id": "user_11365220",
            "user_link": "/personal_pages/user/11365220",
            "votes": "0"
        }
    ],
    "post_id": "1063831",
    "question": "Hi I'm on my 3rd m/c I have 3 other children but just last Sept. found out I was preggers since then I have had 3 m/c's now they are saying that I may have a Septate Uterus.Anyone know anything about that?",
    "timestamp": "1156050000",
    "title": "anyone hear or have a Septate Uterus?",
    "user_id": "user_152163",
    "user_link": "/personal_pages/user/152163"
}