{
    "answers": [
        {
            "answer": "I'm 36, and I've just recently found out I was pregnant with our first IVF try.  But I'm worried because my first HCG did not double and I feel great, which is not a good sign either, per my nurse and doctors.  I am scared that my levels are dropping and am anxious for friday to come, which is when I get my next bloodwork done.  Good luck to you....sounds like you are well on your way.",
            "post_id": "1330542",
            "timestamp": "1182315600",
            "user_id": "user_218842",
            "user_link": "/personal_pages/user/218842",
            "votes": "0"
        },
        {
            "answer": "I am 39 and still trying to conceive, I have one DD who is nine that was conceived natural, and since then nothing.. all though only just started again in september..",
            "post_id": "1330543",
            "timestamp": "1182315600",
            "user_id": "user_159063",
            "user_link": "/personal_pages/user/159063",
            "votes": "0"
        },
        {
            "answer": "Hi Kelly,I'm 36 and have been trying for almost 2 years.  I am 9 dp my 3rd iui.  I got pg on the first iui, but it was ectopic, and I lost my right tube.I don't have any children and have never tried before now...  I know I want this more than anything, and feel like my life will lack real purpose if I don't have a family, but sometimes, when I think about the reality of it too much, I feel this fear well up inside me.  I think it is pretty natural to be more afraid of change and the unknown the older we get... So anyway,,, that's my story..Good luck to you and congrats on the reversal.. I hope it all goes well for you... I'll keep an eye out for your updates..",
            "post_id": "1330546",
            "timestamp": "1182315600",
            "user_id": "user_189192",
            "user_link": "/personal_pages/user/189192",
            "votes": "0"
        },
        {
            "answer": "How about 41 and not trying again, ttc #1, lol. Actually, it would be #2 conceived. I lost #1 in Jan due to placental separation at 12wks. There are quite a few of is here. I know I'll miss someone but Jaggie, OrphanAnnie, Yvette come to mind right away. I'm on my second round of clomid, so hoping this is my month. I hope your wait is a short one :)",
            "post_id": "1330551",
            "timestamp": "1182315600",
            "user_id": "user_178239",
            "user_link": "/personal_pages/user/178239",
            "votes": "0"
        },
        {
            "answer": "ya know I gotta tell you, you are one of THE MOST optimistic people  I have ever met, or not met lololol.. I give you a lot of credit for being so positive and upbeat, sometimes i am ready to take the bridge after all my failed IUI.s but then I get on here and there you are being positive.. just wanted to let you know, your words make a huge difference to me as do a lot of others on here.. so to every one THANKS!!!!",
            "post_id": "1330564",
            "timestamp": "1182315600",
            "user_id": "user_159063",
            "user_link": "/personal_pages/user/159063",
            "votes": "0"
        },
        {
            "answer": "WoW````~!I  am so glad to see there is others like me or should say around my age going to take this challange on...lol   GOOD luck to all of you and thank you for sharing your situation with me. I wish all of you the best of luck!!!! I will certainly keep posting would love to keep up with all of you , I think with all this postivity among us we will all get our wish~****.Look forward to all your posts =)Kelly~",
            "post_id": "1330571",
            "timestamp": "1182315600",
            "user_id": "user_171867",
            "user_link": "/personal_pages/user/171867",
            "votes": "0"
        },
        {
            "answer": "I've got all of you beat. How about 45 and ttc. First IVF failed. So heart broken. Had an ectopic pregnancy years ago then a miscarrige. But not giving up. You have to hold on to hope. Means everything. Prayers for all of us struggling with this. Debra",
            "post_id": "1330572",
            "timestamp": "1182315600",
            "user_id": "user_218177",
            "user_link": "/personal_pages/user/218177",
            "votes": "0"
        },
        {
            "answer": "You know, you are pretty inspirational yourself...  Not many people would be able to handle going on to #6 IUI.  Not to mention all you have to go through before you even get to #1.  I have to say, I thought you handled this last one like a champ.  You had your day of mourning, but you seemed to have bounced back, ready to take on the next challenge.  That what is all about.. being able to handle the disappointments, and being able to see the potential ahead of you.  I've learned a lot from you also.  :)As well as many others...",
            "post_id": "1330574",
            "timestamp": "1182315600",
            "user_id": "user_189192",
            "user_link": "/personal_pages/user/189192",
            "votes": "0"
        },
        {
            "answer": "I am 40 and have a 16 and 10 year old..I have only been TTC since march 2 cycles on my own and 2 on Clomid 50mg I am in the 2WW and hoping fo a BFP this month.",
            "post_id": "1330576",
            "timestamp": "1182315600",
            "user_id": "user_220412",
            "user_link": "/personal_pages/user/220412",
            "votes": "0"
        },
        {
            "answer": "You all are great ! this is hard but we can all do it and hang in there =)-Good luck to all of you this month, maybe it will be a luck one.  I have to wait but thats ok it is a short time.  Keep posted .... Sticky Baby Dust To Everyone!!!!Kelly~",
            "post_id": "1330617",
            "timestamp": "1182402000",
            "user_id": "user_171867",
            "user_link": "/personal_pages/user/171867",
            "votes": "0"
        },
        {
            "answer": "I'm 39 and it took us 5 months to conceive. I was pretty surprised that it was so quick and we feel incredibly blessed.  I'm now 14 weeks and feeling good.I wish I could take our good fortune, bottle it, and send it out to all of you!I would do it in a heartbeat!!!! You girls are the best!!!((Sue))",
            "post_id": "1330619",
            "timestamp": "1182402000",
            "user_id": "user_171703",
            "user_link": "/personal_pages/user/171703",
            "votes": "0"
        },
        {
            "answer": "im 36 and have been trying for about 7 months.i hoping this is ourlucky month.i have no children and have been married for 5 years.i really didnt think it would be this hard to get pregnant.i guessi was fooling myself.i do wish every one here the best of luck!!!!",
            "post_id": "1330666",
            "timestamp": "1182402000",
            "user_id": "user_14832",
            "user_link": "/personal_pages/user/14832",
            "votes": "0"
        },
        {
            "answer": "I am 37y, TTC for 1.5 years.  two miscarriages behind me.  I have PCOS.  metformin since october 2006.  First cycle of femara, hcg trigger and prometrium got me a BFP.  Am currently 9 weeks!!  Good luck!!",
            "post_id": "1330700",
            "timestamp": "1182488400",
            "user_id": "user_182263",
            "user_link": "/personal_pages/user/182263",
            "votes": "0"
        },
        {
            "answer": "I am really new to this....I am 41.  I have never had any children.  I had 2 miscarriages.. one when I was 25 and anothwr in 1998.I have been ttc for 6 months.  I just got my period today so I am kind of sad.I am making an appointment with my gyn tomorrow.What should I expect?  What are the first steps?  I have read on this board where some of you are taking a drug called Clomid...Any advice on what to expect would be appreciated.Thank you all in advance.",
            "post_id": "1330894",
            "timestamp": "1182661200",
            "user_id": "user_221412",
            "user_link": "/personal_pages/user/221412",
            "votes": "0"
        },
        {
            "answer": "Well I had  my tubes reversed so havent taken any meds..... I know clomid makes you ovulate at least I think? there are so many women on here who can answer your question. I would post a new one, more people will see it! Good luck and kudos to you for trying at 41, I am 38 and just had the reversal so we get to try next month... I am excited and scared! silly isint it..lolWell good luck to you, hope you get pregnant soon =)Kelly",
            "post_id": "1330972",
            "timestamp": "1182747600",
            "user_id": "user_171867",
            "user_link": "/personal_pages/user/171867",
            "votes": "0"
        },
        {
            "answer": "Hi,I am 41 and TTC for five months. AF just arrived today and I was so sure that this was the month.I had a very short luteal phase but now with the help of agnus castus, vitamin B complex and progesterone cream I have managed to lengthen it from around seven days to eleven this month.I have two sons from a previous relationship and my husband has kids from his first marriage too. We just want a baby between us now to make our family complete.Good luck to you all.Eileen",
            "post_id": "1757018",
            "timestamp": "1187212558",
            "user_id": "user_252534",
            "user_link": "/personal_pages/user/252534",
            "votes": "0"
        },
        {
            "answer": "Hello ladies, I'm 37 and 61/2 weeks pregnant.  I've been pregnant 4x this being my 5th and I've had one micarriage and My second son passed away with SIDS.  My youngest child is six and me and my husband have not been using any protection in all those years and did not even have a scare.  Until August when my period did not happen and I started checking dates and guess what?  Now all I have to hope for is that I don't have a mc which is high at our age and I'm hoping for a little girl this time...I have 3 boys and guess what...My 21 year old daughter is expecting a lilltle girl in December! I'm going to be a grandmother and new mother at the same time, whew!!!  I say good luck to all you  ladies and don't give up hope, look what happened to me and I was told I wouldn't have kids after 30.  I think stressing about it also keeps us from conceiving, once I found out that my daughter told me she was pregnant and having a little girl, I started relaxing and getting into the role of being a grandmother, you know spoil them and then send them home (ha, ha).  I said to myself ,\"self, my daughter is having the little girl and your done with babies\" and then next thing I know I'm pregnant.  All I know is that when I stopped trying is when I got pregnant.   The mind is a very powerful tool and It can be good or bad.  Oh well...GOOD LUCK TO ALL OF YOU LADIES AND SAY A LITTLE PRAYER FOR ME AND LETS HOPE THIS LITTLE BEAN STICKS.",
            "post_id": "1781446",
            "timestamp": "1187984359",
            "user_id": "user_251639",
            "user_link": "/personal_pages/user/251639",
            "votes": "0"
        },
        {
            "answer": "I am 34, lost my L ovary and uteris due to severe endometriosis about 6 years ago. Almost lost L kidney too, because adhesions and endo sticking to it and my uretor. I just had another consultation and doc thinks it's back and I knew, just knew he was right due to pain etc.  As you have probably guessed wants to take R ovary now.  Anyone else been through this?  Any advice?  I know I can't have children now, and want to desperately, but I don't even know who in Okie land harvests eggs, if even an option.I'm not excited about HRT either.Just needing a little hope right now, I'm kind of down about latest news.",
            "post_id": "3408221",
            "timestamp": "1221500756",
            "user_id": "user_620863",
            "user_link": "/personal_pages/user/620863",
            "votes": "0"
        },
        {
            "answer": "Hi, 40 turning 41 in late October, I have a 15 1/2 year old son from my first marriage. DH and I have been TTC for 2 years. We've been preg twice, sadly both ended in a miscarriage. We turned to fertility treatment to enhance our chance. We've had two unsuccesful IUI's 4-amps of Repornex and Trigger shot; currentyly I am resting due to a cyst on my right ovary which I am sure will disappear by next round unless I get a BFP later next week RE told me that I could still get pregnant on my resting cycle. Whit that being said this site has brought smiles to my face, and lots of hope so each day I am praying that we all get blessed soon. I figure that as along as AF pops in my chances are still there.Claudia",
            "post_id": "3408313",
            "timestamp": "1221502257",
            "user_id": "user_590782",
            "user_link": "/personal_pages/user/590782",
            "votes": "0"
        },
        {
            "answer": "I had my tubal reversal in febuary 2008Im 39yrs oldI fell pregnant inmy 4mth after tubal reversalBut had m/c on the 31st of julyI am now cd8 and hoping to concieve again, i started trying again last mth but\"(( no luck!!!But hopfuuly this mth",
            "post_id": "3454406",
            "timestamp": "1222434127",
            "user_id": "user_475222",
            "user_link": "/personal_pages/user/475222",
            "votes": "0"
        },
        {
            "answer": "Ok~~~~I am gonna jump in here too! I am 37 (on saturday), and I have been ttc #2 for 2 years now. I am on my 2nd RE and LOVE her, and I am getting ready to start my 5th fertility drug! Whew!! So, I am bound and determined to give my 3 1/2yr old son and lil sister!! :)So far:Clomid 50mg--didnt workFemara 2.5mg 2x's a day (cd3-7) 1st 2 cycles made nice follies, last 2 NOTHINGNovarel 10,000unit trigger shot---didnt OFollistim shots---started with 150 units (2 shots) for 7 days, and 225 units (3 shots) for 4 days--Eggies were too small to even talk about!!NEXT step is doing REPRONEX, anyone here tried it??Have great weekend ladies!!TinaMerr~~~That is WAY cool!!! A new mom AND a grandmother at the same time!! Wow! Double blessed!! :)",
            "post_id": "3455857",
            "timestamp": "1222454988",
            "user_id": "user_529933",
            "user_link": "/personal_pages/user/529933",
            "votes": "0"
        },
        {
            "answer": "I turn 40 in 2 weeks and am in the middle of my 2 week wait (I'm still trying to figure out all the abreviations, 2ww?) I've had a little pain in my lower abdomin but today I feel a lot of cramping and lower back pain.  Very much like mentrual pain.  Am I reading right that this might be a good sign?  I'm glad to read others are going through similar things a similar ages.  I feel a bit weird at 40 and just now trying to have a baby.",
            "post_id": "3456056",
            "timestamp": "1222457854",
            "user_id": "user_627721",
            "user_link": "/personal_pages/user/627721",
            "votes": "0"
        },
        {
            "answer": "Hi all!I'm 38 and have been trying for eight months. I miscarried twins 9/3/08 at seven weeks. I just got the green light for my Dr. to try again with my next period. We are full steam ahead and not looking back. I know my baby is yet to come!!Good luck and prayers for all who go through this struggle.",
            "post_id": "3456902",
            "timestamp": "1222470159",
            "user_id": "user_583515",
            "user_link": "/personal_pages/user/583515",
            "votes": "0"
        },
        {
            "answer": "I'm new to this I'm 38 and I have a 3 @ half year old son concieved naturally after I had my son my thyroid went haywire. Then 8 mths ago my thyrod went normal but I was then I was told I have pre menapause. I've arrived in Chicago from Australia 6 mths ago cause my husband got transfered here. I've just started seeing a womens specalist here & all my tests have come back normal (thank god) no menapause the doctor thinks it was stress that cause it. Any way I've been proscribed colomid & I took it on day 3-7 I'm on day 12 & I've been doing ovulation testing but nothing yet I'm on 100 of clomid. I've never been able to get a posative on those ovulation kits so fingers crossed these clomid tablets work",
            "post_id": "3457389",
            "timestamp": "1222479086",
            "user_id": "user_632443",
            "user_link": "/personal_pages/user/632443",
            "votes": "0"
        },
        {
            "answer": "HOPE THESE HELP!!!! :)tww - two week waitaf - aunt flo (period)bd - baby dance (sex)dh - dear husbanddb - dear boyfrienddd - dear daughterds - dear son or donor spermhpt - home pregnancy testbeta - blood work pregnancy testre - reproductive endocrinologistmc - miscarriagebbt - basal body temperaturedpo - days past ovulationdpiui/ivf - days past intrauterine insemination/in-vitro fertilizationbfp - big fat positivebfn - big fat negativebbs-breastsopk-ovulation predictorFertility and General Posting Acronyms is 1/2 way up on the page on the right, there are a whole bunch more to help!!Tina",
            "post_id": "3457665",
            "timestamp": "1222483548",
            "user_id": "user_529933",
            "user_link": "/personal_pages/user/529933",
            "votes": "0"
        },
        {
            "answer": "Hello ladies. Here's my story. I'm 35 with 2 boys, 16 and 9. When I had my youngest, i wanted to get my tubes tied. My then Dr. urged me to wait. I was 25 then. She said when a women turns 30 something, many experience their biological clock's ticking. At that time, I thought is she crazy my clock is all ticked out. I'm glad to say, for some reason I followed her adivce. She was right. With a new DH, and feeling the need to procreate we have been trying for 2 1/2 years. The first year and half, I had 5 m/c, 2 being ectopic. Spent the last year trying. Went through IVF on 08/16, finally got a BFP 10dp3dt, and just had a D&C today. The baby stopped growing at 6wks. Just like all the rest of my angels. This has been very difficult for us. At this point, I am feeling better, but I have to be honest I am a little upset with GOD right now. Can I do that? Well, we are planning on moving forward. However I have a consult with my RE, and a new one. I think maybe we need a change. Good luck to all you ladies here.",
            "post_id": "3457752",
            "timestamp": "1222485148",
            "user_id": "user_200957",
            "user_link": "/personal_pages/user/200957",
            "votes": "0"
        },
        {
            "answer": "Hi there- I am 35 and have one daughter 12 conceived naturally.  Am now trying to have a baby with my new hubby and so far have had one miscarriage and am just hoping that we will have the chance to have one little miracle together.",
            "post_id": "3457984",
            "timestamp": "1222491531",
            "user_id": "user_534261",
            "user_link": "/personal_pages/user/534261",
            "votes": "0"
        },
        {
            "answer": "Hi there.  I am 39 years old and had my 4th child in jan 08.  I had my 4th c-section as well and had all high risk pregnancies due to preeclampsia.  My last pregnancy went very well with the exception of my screening result of 1/22 for DS.  I didn't do the amnio and waited it out till her birth.  She did NOT have DS.  But with the stress of the 4th section, possibility of DS etc, at the time of her birth I decided to get my tubes done......big mistake and I am having huge regret.  Not the end of the world, I have 4 beautiful children and 4 sections already is a risk factor but I can't help but feel a little sad.  I am wondering how your tubal reversals went and the details etc.  I haven't mentioned this to my dr, with fear he'll think I'm a nut.  But truthfully, I do haev regret.  I have mentioned it a little to friends and family, and they just stare in disbelief.  Anyhow, its how I feel.",
            "post_id": "3458829",
            "timestamp": "1222524245",
            "user_id": "user_626889",
            "user_link": "/personal_pages/user/626889",
            "votes": "0"
        },
        {
            "answer": "Hi everyone, i am 37 yrs old, never have children and had never tried until i got married in March 2008. My husband (36yrs old) and i started trying in April 08. Now it's Oct and i am still not pregnant. I am a bit worry and wondering if i should go see my doctor, or should i just keep trying for couple more months?",
            "post_id": "3568624",
            "timestamp": "1224809860",
            "user_id": "user_660586",
            "user_link": "/personal_pages/user/660586",
            "votes": "0"
        },
        {
            "answer": "Since this would be your sixth month trying, I would probably set up an appointment with a specialist or RE. They say to wait one year if your under 35 or six months if you're over 35. Maybe start by talking to your obgyn and see if he can refer you to an RE. Best of luck to you!",
            "post_id": "3568686",
            "timestamp": "1224810962",
            "user_id": "user_318181",
            "user_link": "/personal_pages/user/318181",
            "votes": "0"
        },
        {
            "answer": "Thanks so much for your advice. I am going to make an appt with my doc for next week, see what she has to say. may be some fertility meds will help. keeping my fingers crossed. thx!!",
            "post_id": "3568784",
            "timestamp": "1224812492",
            "user_id": "user_660586",
            "user_link": "/personal_pages/user/660586",
            "votes": "0"
        },
        {
            "answer": "I'm 38 ,ttc 2 years ,one miscarriage 1.5 years a go ,two round clomid and two round letrazole or femara with no success ,I'mstarted to be really depressed no more hope , My husband doesn't like to do any speciall thing like IUI or IVF,so any time any of my friend get pregnant My hope goes lower,I'm frustrated I don't know what can I do I'm almost all the time crying and feel depress ,please if you know any thing that it can help me to get pregnant let me know.",
            "post_id": "3569430",
            "timestamp": "1224823839",
            "user_id": "user_312176",
            "user_link": "/personal_pages/user/312176",
            "votes": "0"
        },
        {
            "answer": "sorry, i am quite new on this and don't have enough knowledge to give you any advice. however, i do feel your pain. Hope other people in this group can help.",
            "post_id": "3594169",
            "timestamp": "1225369971",
            "user_id": "user_660586",
            "user_link": "/personal_pages/user/660586",
            "votes": "0"
        },
        {
            "answer": "Hi, I will be 35 in March and have one girl who will be six at Christmas and my hubby and I have been trying for #2 for almost 5 years now. I put off testing, thinking that if it worked once it will happen again, just be patient, but my time is ticking....very loudly for the last 2 years! I had fully accepted that is was not my fate to have another child, 3 months ago but recently I decided to not give up without knowing for sure, so I finally made the step of seeing my doctor. I will be going for my first blood tests tomorrow.  I am 90% sure I am the one with the problem, and have had a deep sinking feeling for 10 years that something wasn't right, but was given new hope when I conceived my daughter. Now that hope has faded into an abyss of confusion, regret and self doubt. Trying to stay positive month after month is difficult, and gets harder as each year passes. Time waits for no one. Hope I didn't bum anyone out.....just dealing with a flood of mixed feelings right now.",
            "post_id": "3596527",
            "timestamp": "1225402555",
            "user_id": "user_593038",
            "user_link": "/personal_pages/user/593038",
            "votes": "0"
        },
        {
            "answer": "I'm 39 and also had my tubes reversed in June last year.  Since then I had on ectopic and one miscarriage at 8 weeks - Jan 27, 2011.  Since then, I haven't had any luck conceiving.  CHTR were only able to repair my right tube and clearly I've been able to conceive so its working - just not since my mc and D&C in January.",
            "post_id": "7042817",
            "timestamp": "1309902649",
            "user_id": "user_1727996",
            "user_link": "/personal_pages/user/1727996",
            "votes": "0"
        }
    ],
    "post_id": "1305480",
    "question": "Hi there,I am 38 yr old just had my tubes reversed on June 15th, 2007. Just would like to find others that are older and are trying to conceive as well. I have 3 children 22, 19, 8.I see alot of younger women on here trying to conceive, though we all share a common desire, some people think older women are nutty for trying again. I get that alot , so looking for support, for other who are going through this same situation.If you would like to share your story, PLEASE post !!! We get to start trying in about 6 weeks, just being 5 days outside surgery I can wait that time...LOL This is very exciting  yet stressful as the possibility of not becoming pregnant, and the xtra challenges older mommy to be's face.  I wish everyone who is trying the best of LUCK!!! =)Kelly~",
    "timestamp": "1182315600",
    "title": "Anyone over 35 and trying to get pregnant?",
    "user_id": "user_171867",
    "user_link": "/personal_pages/user/171867"
}