{
    "answers": [
        {
            "answer": "Hi!  Im 34 weeks tomorrow and feeling pretty good.  Ive gained 11 lbs so far.  SEX DRIVE....whats that??  LOL!!  I dont have much of one but I did go through a spurt around 6 months.  Now my belly is too big and its just awkward.  We are moving on Monday so we are very busy getting ready for that.  6 more weeks to go!!  Cant wait!",
            "post_id": "1405820",
            "timestamp": "1184601442",
            "user_id": "user_145997",
            "user_link": "/personal_pages/user/145997",
            "votes": "0"
        },
        {
            "answer": "So far, so good! The only new news that I have is that Max's crib is all put together and the nursery is almost complete! Yay! :)  I certainly hope I'll be able to tackle being a new mom! I know one thing for sure.....I'm ready to quite alternating the same 3 pairs of jeans!!! lol I told dh I will feel like I hit the lotto when I get to unpack all my prepregnancy clothes!  I've only gained 18 pounds so far...but I have 6 weeks to go so I'm sure I'll be gaining more! As for the energy level and sex drive...I think they go hand in hand! When I have energy all day long I'm at work and by the time I get home at 5 I'm so drained that I couldn't possibly have sex if I wanted to! lolFunny story....I turned sweet 25 today (ugh) and had to go get my driver's license renewed. Welllll...I forgot about it needing done this morning when I was getting dressed. So I'm wearing a cute tank top...it's lower cut, but cute and simple. Soooo I get the pic taken on my license and I look like a total big boobed s.l.u.t. with NO shirt on! HAHAHA! I told dh that maybe this way I'll luck out the next time I get pulled over because the trooper will think I he's really sneaking a peek at something in the license picture! lol *sigh* The little things that amuse me.........",
            "post_id": "1405830",
            "timestamp": "1184601705",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "LOL!!  Your too funny....Im sitting here laughing and Dh came in and is like \"You ok?\"  He thinks Im nuts!  Happy Birthday by the way......Are you doing anything fun tonight?   Whats up with this forum?  Theres posts from back in march and april posted.",
            "post_id": "1405872",
            "timestamp": "1184602833",
            "user_id": "user_145997",
            "user_link": "/personal_pages/user/145997",
            "votes": "0"
        },
        {
            "answer": "Haha Ruby, good story.  I turn 25 on the 27th of August... 3 days before my baby is due!  We're always so close together with stuff!  I think I\"m going to try and have an invalid license for just a bit to see if I can't get that pic done AFTER the baby is born... or maybe she'll come early and it wont matter lol.  Right at the end I prob wont be driving anywhere anyway!Anyway, in great news, my husband and I hung up the wall paper border in our nursery and it is SOOOOO adorable ! The walls are lavender and the border is up... were just waiting on the carpet to get installed (it's here just waiting on the guy to put it in) and then we too can finally set up the crib and what not!  My shower is on saturday and I'm scared he wont have it done before we have to bring all this stuff home!  And our garage is PACKED!  Eeek!I've been feeling pretty good.  I've gained 20 lbs so far but just feel huge.  I am retaining water like crazy... if I eat salt I've screwed myself... or drank soda.  And sex drive?  There isnt one.  Not at least when it comes to DH.  I dream about it but don't actually want to do it lol.  And my enegry level is non existent!  I am soooooooooo tired all the time.  I havent begun nesting yet... I really need to though the place is a mess!",
            "post_id": "1405959",
            "timestamp": "1184604472",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "Thanks for the bday wishes, Ally! No big plans. DH got me a new digital camera for my birthday and gave it to me yesterday. I'm in love with it!  My whole entire family is in Alaska this week so not much going on. It doesn't feel like much of a birthday because no one knows! lol My mom did leave me a note here at work saying happy birthday. Under that she wrote \"Don't let Max have a birthday while we're gone\" LOL Don't feel bad.....my dh thinks I'm nuts too. I'm always telling him  about people on here having their babies and stuff. I get so mad when he doesn't really care since he doesn't know any of you! haha!Nikki..that's so funny that your 25th is coming up so soon after mine! We do seem to do things at the same time! I would say hold off on the license.....my pic's awful. They did make me feel good though. The lady at the BMV says, \"Weight still 120?\" I laughed hysterically and said YEP!   How exciting about the border being up! I will have to put the pic of Max's room on my photobucket so you guys can see it!  It's almost done but needs some work for sure! I need that nesting instinct to kick in too....or Max is coming home to a hog sty!  Off that topic, did you find a middle name yet??",
            "post_id": "1406065",
            "timestamp": "1184607809",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Ruby- I am not an Aug. Mommy, but I thought I would comment on the drivers licence. That is too funny! I had to have my licence renewed when I was pregnant w/ Madelyn, and I look far from sexy! I look bloated and fat and unhappy...I have a few more years I have to carry it around too before it is renewal time, ugh! Hopefully I won't be pregnant that time!! :)",
            "post_id": "1406185",
            "timestamp": "1184610168",
            "user_id": "user_189100",
            "user_link": "/personal_pages/user/189100",
            "votes": "0"
        },
        {
            "answer": "On my 21st bday, we went out at midnight to celebrate (since it was technically the next day). So when I went in the next day to have my license renewed I looked AWFUL. lol It was so bad that I was willing to pay the extra $24 to lie and say I lost it just to get a new picture!!!! This pic's not much better...but at least I've got big boobs in it. lol",
            "post_id": "1406206",
            "timestamp": "1184610412",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Here is the link to Max's nursery. (Part of it) Just in case anyone cares! lolhttp://s157.photobucket.com/albums/t68/maxrubynelson/?action=view&current=Maxsroom.jpg",
            "post_id": "1406215",
            "timestamp": "1184611121",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "I still havent finalized on a middle name! I'm seriously stressing out about it!  I thought I was leaning toward Isabelle but my sister thinks it takes away from the first name Leah and nwo I see hwat she's saying.  I am thinking of goign one syllable like Grayce or Beth... Maybe I just wont decide till I see her face and think of what feels right lol.  Ok, I'm going to have a look at max's nursery and I'll get back to u!  PS: Carpet guy comes tomorrow so we can set up things we get on saturday at the shower!  How exciting!",
            "post_id": "1406493",
            "timestamp": "1184615925",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "for some reason it wont take me to your link... even though I'm logged in on photobucket... jsut takes me to their homepage :(",
            "post_id": "1406503",
            "timestamp": "1184616130",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "I'll have to fix that! I don't know what I did wrong. Hmmmm! Try this instead.[IMG]http://i157.photobucket.com/albums/t68/maxrubynelson/Maxsroom.jpg[/IMG]Yay for carpet guy coming tomorrow! I hope it's not my exboyfriend. lol He's a carpet guy...and he works in Indiana! If his name is John and he's got gorgeous eyes......head for the hills! lol",
            "post_id": "1406568",
            "timestamp": "1184616669",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "That one works...don't copy the IMG parts though. I guess the pic is kinda dark....hard to see much in. Oh well. It's on my myspace, too. www.myspace.com/jessicamarie36",
            "post_id": "1406575",
            "timestamp": "1184617326",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Hey Ruby, I also have breasts that are pretty much uncontainable.  Everyone stares at them.  Geesh, I'm scared how big they are going to be when my milk comes in.I am 35 weeks, I've gained 13 pounds, however, I have some swelling so I am sure that number is about to jump.Nursery is still not done.  Poor dh, he is a civvie working for the Canadian Navy and they are working 24 hours a day to get a ship ready for some deployment.  He is working 8 pm to 1 am for the next week.  So, I am trying not to be a total b about it.  Bassinet and diapers are all set up in my room for now.I have little energy. And sex drive?  That's pretty much gone, although I may have to work myself up to it as dh is looking very woebegone.",
            "post_id": "1407354",
            "timestamp": "1184632724",
            "user_id": "user_164559",
            "user_link": "/personal_pages/user/164559",
            "votes": "0"
        },
        {
            "answer": "Hey girls, im due on august 11th, which is right around the corner!!! IM 36 weeks and 2 days. I've gained about 18 pounds so far so not too bad I guess(even though I feel like a whale!) I had a 7 hour childbirth class this past weekend with dh and it was fun and very interesting. Oh! you should have seen these guys faces in the class when they showed a 55 minute video of 3 different ladies giving birth, and yes they showed everything! All the men where making all kinds of faces, and one guy even got up and left, lol. I think it gave my husband a little more appreication for what im going through! I don;t know about you guys but i've been \"nesting\" like crazy! I got the baby's room ready but I just can't  stop cleaning and trying to make sure EVERYTHING is ready... is it just me or do you ladies feel like that too?",
            "post_id": "1407565",
            "timestamp": "1184636620",
            "user_id": "user_164914",
            "user_link": "/personal_pages/user/164914",
            "votes": "0"
        },
        {
            "answer": "I NEED to feel like that.My poor son is going to come home to a pig sty. We just gone done moving (not actually even done yet) and it's such a chore to try to keep things neat and orderly!!!36 weeks....man! You're so close! I told dh the other day that I remember thinking how I couldn't WAIT to be 30 weeks when I'd see women post on here that were so far along. Now I'm 34 weeks and it still feels like an eternity til I make it to 40!! (I'm hoping I don't see 40 weeks....38 would be super! lol)",
            "post_id": "1407831",
            "timestamp": "1184643464",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "38 weeks would be awesome lol, im so ready to meet my  little boy,scared but really ready you know?",
            "post_id": "1407898",
            "timestamp": "1184645224",
            "user_id": "user_164914",
            "user_link": "/personal_pages/user/164914",
            "votes": "0"
        },
        {
            "answer": "Ruby, I kept meaning to say happy birthday and I forgot yesterday so happy late birthday!  Don't worry, we know the carpet guy and he's an older man and I've never noticed his eyes lol.  And his name is Woody orsomething funny like that.  :)Jeesh I feel like I'm the leader on weight gain here at 34 weeks and 20lbs!  All of my friends keep saying that's really good but most of you have gained less.  I know I'm not doing too bad though.  I'll just have a little extra work to do and hopefully BFing will help it all drop off!  I'm starting to feel like my legs and arms look jiggly but it's not motivating me to get off the couch much.  Hopefulmommie, when did your nesting instinct kick in?  Maybe when Ruby and I are 36 weeks here soon we'll start in on the manic cleaning.  I hope so!I know that with the carpet going intoday I'll be able to set up the nursery and htat's super exciting.Ruby, I'm not sure I have you on myspace but I'm going to add you right nwo and take a look at max's nursery!  See ya there!",
            "post_id": "1408746",
            "timestamp": "1184674917",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "I just approved you on myspace. I love you belly pics. Sooo cute!  :)  I'm glad the carpet guy's not John! He's a real @ss but man you'd be staring and drooling all day long! lol (Come to think of it....I had a dream about him trying to run me over last night! LOL)I'm right behind ya on the weigth leader board...I'm at 19 pounds as of last Friday. You have an appointment today don't you?  I'm anxious to hear how it goes with your Dr. Wonderful! lol Are you going every 2 weeks yet?? My next appt. is the 31st and then I go weekly (and plan to beg for another u/s so I'll have an idea how much this little guy weighs!)",
            "post_id": "1408775",
            "timestamp": "1184677101",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "what part of ohio are you in?  My family lives in Arcanum now but my dad grew up in this tiny town called Mt. Gilead. Ever heard of either?  They are both pretty small lol.",
            "post_id": "1409130",
            "timestamp": "1184688585",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "Mt. Gilead sounds familiar......I think my friend's cousins may have gone to school there or something. I live 1/2 hour east of Fort Wayne actually. Right on the border of Indiana!",
            "post_id": "1409301",
            "timestamp": "1184691814",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "ahhhh.  I lived in Ft. Wayne for a short time a couple of years ago right after I graduated from Purdue (the first time).  Now I'm on the other side of the state though... pretty much a straight shot and on the border of IL!",
            "post_id": "1414667",
            "timestamp": "1184694545",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "I used to work in Ft. Wayne a couple years ago! I worked at LaPetite Academy out on the southwest side by Lutheran Hospital!.",
            "post_id": "1414720",
            "timestamp": "1184695554",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Wow, never expected to hear from people in Mt. Gilead.  hehe I lived in Ohio for almost 7 years, Columbus and its counter cities around it.  Now I'm in Michigan, bleh, not really liking this state but it will due for now I guess.I've gained about 16lbs, probably more since I've all but quit smoking entirely.... God I'm craving smokes or snacks.  My NST doctor is a pain in the arse and I've found that I need a nap once a day on average these days to keep my energy level up.  Today I go back for another NST, and Friday I have my MRI/MRV/MRA appointments.Nesting instinct here is pretty high for me.  Then again it is probably because of all the changes and being home.  That and to know that while I'm only 34 weeks this baby will be here in about 2-3 weeks.  I'm driving my 2 daughters crazy because of how clean I'm wanting things, lol, nothing like mom nagging about everything I guess.  I washed all the baby clothing and organized everything.  I can't say that the \"nursery\" looks as nice as yours Ruby but then again I'm shoving the baby and my 9 yr old into the same room, and we are managing well enough.  I've discovered the usefulness of VELCRO!!!  Yeah, that might be a bad thing... I'm velcroing everything to walls... remotes, modems, routers, pencil holders... and the list goes on and on.",
            "post_id": "1415052",
            "timestamp": "1184700807",
            "user_id": "user_175662",
            "user_link": "/personal_pages/user/175662",
            "votes": "0"
        },
        {
            "answer": "You only saw one corner of my nursery! There's a reason for that! lol It's not very organized on the other half of the room yet! Dh's gma is buying our chaning table for us and I will be getting it at my shower next weekend so right now we have clothes galore!Where are you at in Michigan? We have a summer house in Coldwater (actually Quincy, but no one knows where that is! lol)",
            "post_id": "1430151",
            "timestamp": "1184707807",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "The carpet is installed!  So all we have to do before Saturday is put some trim around the bottom and around the door and our adorable, girly littel nursery is done!  I'll def get pics up once we have the crib and stuff in there this weekend!  Soooo excited!  Went to the docs today... I waited for an hour to see him for 5 minutes if that.  He listened to her hb and measured my fundus.  I told him I lost my mucus plug while he was on vacay and he said he hoped to see 3 more weeks out of me but things would be ok if I went sooner.  And that was about that.  I guess my doc wont do an ultrasound this late unless it looks like there is a reason to and he thinks I'm like the most perfect pregnancy ever or something.  I only gained 2 pounds since a month ago so I'm right at 21 pounds as I suspected.Immortal One, my dad grew up in Mt. Gilead so I used to visit my grandparents there a lot when I was a kid.  They lived on 5 acres of wooded land where my grandfather built two log cabins, one as their house and theother as their antique shop.  It was gorgeous and very remote but my grandma moved away after grandpa passed.  That's funny about the Velcro.  When my brother was a teenager at home he used to velcro stuff in his room so he could find it, including his remotes!  Makes sense!  It prob wouldnt help me because I'd just never stick them back on there lol.",
            "post_id": "1430446",
            "timestamp": "1184712944",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "Sucks being perfect doesn't it? lol So did you nearly flip when he said he'd like to see you go 3 more weeks? That's so soon! Especially when you're figuring on 6 weeks! We seem to be neck and neck with things here, though. So....go ahead and go early...that means I shouldn't be far behind if things go the way they have been! lol When did your Dr. Wonderful want to see you again? I assume in a week or 2 at this point!!",
            "post_id": "1430513",
            "timestamp": "1184715063",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "NO!  Can you believe he put me at 3 weeks again!?!  I'ms upposed to be at 2 weeks so i wonder if when I SHOULD be going weekly if he will only have me every 2 weeks!?  He was like... well you can come in at 2 weeks if you want but... I think three is fine.  I do my strep test next week which means an actual exam down there I think.   It's just a swab so I don't know if he'll check dialation in 3 weeks or not.  I'll be around 37 weeks so wouldn't you think so?  Who knows wiht these guys!  Still standing firm that the next time around I will have a female obgyn!",
            "post_id": "1430788",
            "timestamp": "1184721963",
            "user_id": "user_177988",
            "user_link": "/personal_pages/user/177988",
            "votes": "0"
        },
        {
            "answer": "OMG!!!! I mean my appointments are really quick and stuff, but still! They like to check your belly measurement to make sure all is well there, and get the baby's heartbeat and definately check your blood pressure!! My best friend's pregnancy went perfect til 36 weeks when she went for her check up and her bp was super high.... she had preclampsia setting in FAST! They ended up taking her right then and there!I dunno...maybe the appointments aren't that big of a deal. I just think it helps time pass when I go now every 2 weeks! lol Maybe you'll go next time and you'll just be all set to have her right then!",
            "post_id": "1430868",
            "timestamp": "1184722941",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "i am 35wks 4d, i went for my appt today and ended up in l&d for monitering. my bp has been sky high. i am retaining fluid like crazy. on the 7th i was in l&d for pre-term labor, contractions were 2-3 min apart. today my dr took me off work. i am sched for c-sec on aug 15, i figure i will prob make till then. i had the same pattern when i was pg w/ds. well i never went into pre-term labor. hmmmm.....and there is a full moon earlier in aug, we'll see.",
            "post_id": "1430853",
            "timestamp": "1184723231",
            "user_id": "user_121807",
            "user_link": "/personal_pages/user/121807",
            "votes": "0"
        },
        {
            "answer": "I live in Harrison Township, Metro Detroit area.  I know where Coldwater is only because my brother is getting married out that way a week after I do.Mommy, Hang in there, how high was your BP?  Do they have it under control now?   Why are they doing a C-Section?  The next full moon is the end of July and the end of August.  At least that is my understanding.  This baby will be born either with a quarter moon or a new moon for me.My appointments are rather quick, sometimes too much for my liking.  I go every 1-2 weeks because of my own complications, and weekly NST's.  Today I started having some more \"steady\" contractions but they subsided after the NST when I went home and rested, so it was just BH again (god they happen a hella lot).I insisted on a female doctor because of my personal beliefs, and hoping that it might help to have a woman who could understand.  I hate the \"checking\" part though...Velcro rocks!  I swear that stuff is so useful.  Now to make the sticky hooks I bought to hang up the kids stuffed animal hammocks I made (Crocheted actually).  I'm hoping to get the sewing machine up and running to make a few things for the baby's room (organizers for the wall that will just velcro on lol!)",
            "post_id": "1431359",
            "timestamp": "1184733566",
            "user_id": "user_175662",
            "user_link": "/personal_pages/user/175662",
            "votes": "0"
        },
        {
            "answer": "this august mommy became a JULY mommy on monday! i had to deliver monday at 36 weeks due to preeclampsia. i am recovering from the c-section. my kidney function seems to have returned to normal, and while my bp is still high, it's much better than before delivery. baby weighed 4 lbs 13 oz and is doing well.",
            "post_id": "1431694",
            "timestamp": "1184751143",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "Awww! Congratulations! :)",
            "post_id": "1431794",
            "timestamp": "1184762512",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "tiredbuthappy-Congrats!!!!!!!Ruby-I missed your birthday!!!!   I'm sorry!!!   Happy Birthday!!!Everyone-  I went to the doctors on Monday and I'm 1cm dilated and 60% effaced.  Hopefully this continues to keep moving along and we can skip the induction!   I can't wait!",
            "post_id": "1431844",
            "timestamp": "1184765364",
            "user_id": "user_151154",
            "user_link": "/personal_pages/user/151154",
            "votes": "0"
        },
        {
            "answer": "Thanks! :)Woohooooo for being dilated! I'm insanely jealous. The days are really starting to drag!",
            "post_id": "1432479",
            "timestamp": "1184778517",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Lol......I just emailed you to tell you....You must have been writing to me at the same time.",
            "post_id": "1432524",
            "timestamp": "1184779534",
            "user_id": "user_151154",
            "user_link": "/personal_pages/user/151154",
            "votes": "0"
        }
    ],
    "post_id": "1405780",
    "question": "Just wondering how the rest of you August mommies are doing, and those that are in the hospital with their babies or with complications, how are you feeling?  Anyone have new news?  Anyone think they are all prepared and ready to tackle being a new mom (for some \"again\")?  How much weight have you gained?  How is your sex drive?  How is your energy level, etc?",
    "timestamp": "1184599622",
    "title": "August Mommy Role Call",
    "user_id": "user_175662",
    "user_link": "/personal_pages/user/175662"
}