{
    "answers": [
        {
            "answer": "I am 33 weeks now and am ready to have this baby!! Since you and I have spoken before you know I will be retesting after birth. What a great idea to have this thread. I hate this stressful situation.",
            "post_id": "13451583",
            "timestamp": "1447189206",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "It will be up to him, the father. I am gonna give him one last chance to keep it out of court but if he says no then court it will be. I already have my lawyer and paid retainer so I honestly anticipate going to court. I highly doubt he will retest willingly. So it might be a process but I will let everyone know.",
            "post_id": "13454795",
            "timestamp": "1447277508",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "201603 I think it's a good idea you started this thread . Im due in 4 weeks and I plan on comming back as promised I pray my results are right.. I had DDC call me back today on my review and they said everything looked ok and if i wanted a retest they would do it for 600$ if I really wanted too but its not worth it at this point especially with only 4 weeks left.Charamaire Please come back and update..",
            "post_id": "13455081",
            "timestamp": "1447283370",
            "user_id": "user_15769108",
            "user_link": "/personal_pages/user/15769108",
            "votes": "0"
        },
        {
            "answer": "Charmamarie one question did you ever ask DDC about the who mother being listed as father and all that being wrong as you said it was on the results im curious too know what they said upon that",
            "post_id": "13455098",
            "timestamp": "1447283680",
            "user_id": "user_15769108",
            "user_link": "/personal_pages/user/15769108",
            "votes": "0"
        },
        {
            "answer": "I did ask them and they said that that did not matter because it would have been obvious that his blood had no fetal DNA. But honestly I am sure somehow they got messed up. I'll say this when I brought my testing paper work to my lawyer and showed him the chain of custody he laughed and said \"this mess will not hold up in any court\". My name is wrong, the father is listed as the mother and they lost the picture of my id. It's a mess that's for sure.",
            "post_id": "13455195",
            "timestamp": "1447287364",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I can't believe they wanted to charge you to retest when they were offering me everything for free, a free retest and a free test after birth. If only the father would have agreed. Oh well it is what it is.",
            "post_id": "13455200",
            "timestamp": "1447287521",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "The only thing that has me worried is this chimera thing. If the father or my baby is a chimera then all paternity tests would be wrong. My child would be left without a father and that is scary, but it is so rare so very rare that I just can't see that being the case. But then again I can't see how a paternity test could be wrong like this either. I asked DDC for an email or address to send the conflicting results and they said because of HIPPA that all I could do was call them. And that makes no sense to me at all. I need to get past Chris the call center manager to someone who is really in charge but I am being blocked at all turns right now.",
            "post_id": "13455230",
            "timestamp": "1447288413",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "You will get past the call center manager if your lawyer writes a letter, I think.  Right now they think you're just some random person, but if you have representation and look like a suit is in the offing, they should escalate your lawyer's communications to be handled by someone else.",
            "post_id": "13465169",
            "timestamp": "1447596543",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "1"
        },
        {
            "answer": "Ok a little update on me. I am being induced next week and after I recover I will start the process for a paternity test on my son. I am getting induced a month early do to preeclampsia. :(. My doctor feels that it was brought on by stress. I am sending a certified letter to the father today to let him know what my plan is and to give him the opportunity to test without a court order, we will see how that goes. I highly doubt he will though. I have given up trying to go after DDC. I am going wait until the second paternity test goes through and then do what is necessary. If for some reason he gets an exclusion again, it does mean he is chimera and I am in for a long battle. I have meet with a local geneticist and he will help me if that happens. We both highly doubt that that is an option. It is more likely something happened at the lab or collection site. Either way DDC is responsible for who they subcontract out their collections to.No matter what I will not stop fighting. :). I will tel you ladies the outcome.",
            "post_id": "13505855",
            "timestamp": "1448983769",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I think you should use your lawyer as much as possible for this since you are not getting taken seriously by the DDC.  If the subsequent testing proves that the baby is from your boyfriend, you have a claim against them for the stress and pain they have caused you.  I would only question whether or not your boyfriend sent a ringer in his place.",
            "post_id": "13506314",
            "timestamp": "1448991901",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "I really really don't think the father messed this up. They may have listed him as the mother but it was him and his blood they took. I saw the picture and his id.  It was my id that they lost a copy of and my name they got all messed up.  I don't have the energy to fight DDC. My lawyers were clear on the matter. It would be long drawn out and expensive. I can't afford to raise a child on my own, fight with the father, and fight DDC. Not to mention the strain all this has put on job performance, which I can't afford to lose. I have to pick what's important and what I can handle. I have known this man for 19 years I know for a fact when finds out this child is his and DDC, who continually reassured him the test was correct 100%, was wrong, will go after them. He will fight that battle. It is hard to be mad at him although don't get me wrong I am angry with him. But just imagine if you were in his shoes. They repeatedly told him that the test was correct no matter what, I am not sticking up for him but we were not in a relationship. We both travel extensively for work. He had my word and then he had the word of an accredited company. Yes it hurt he would not retest but DDC told him there was no reason to retest and the results were correct. I had no idea about the other girl but to give him a small amount of credit he did break up with her when he found out I was pregnant. He put all his energy and focus on me and the baby. We did the test just to make sure. It broke his heart when he got the results. He shut down and shut me out. That is what he does. So now I am doing what I can and what I can handle. I have a full plate so I will let the father take his wrath out on DDC because I know he will. He is a very powerful man.",
            "post_id": "13506768",
            "timestamp": "1449005552",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Ok so I get induced on 12/20 at 7pm!!!",
            "post_id": "13524376",
            "timestamp": "1449621315",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "UPDATE!We have a case which was tested and given an inclusion and she has confirmed accuracy after birth....I know any bit of hope helps those of us who are waiting :)",
            "post_id": "13531054",
            "timestamp": "1449850445",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "Kaleb Michael was born on 12/22 at 8:23pm, 8 lbs 5oz. He is the most handsome baby!! He is also the spitting image of his father with a full head of black hair!!!",
            "post_id": "13559364",
            "timestamp": "1450936739",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Congrats!  Now talk to the daddy and get your retest.",
            "post_id": "13559496",
            "timestamp": "1450945875",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "I wish I could post a pic Kaleb is so handsome!! What I find so funny is the daddy said if he comes out with a full head of black hair the we will talk. And Kalebs hair is jet black and an inch long!!! When he came out I so filled with relief and love I didn't even notice but then the nurse said wow look at all that hair!!! My whole family is blonde.  I sent him a pic and he he never responded so I will just go through the lawyer and courts. He is the spitting image of his dad I mean looks just like him!!",
            "post_id": "13560310",
            "timestamp": "1450994493",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Girl I think there is any chance he is paying someone within ddc ? I know u mentioned he is a well known person I mean some have influences",
            "post_id": "13566487",
            "timestamp": "1451329824",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "*u",
            "post_id": "13566489",
            "timestamp": "1451329843",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "I don't know. I don't think so. I started the process with child support today and I met with my attorneys on Wednesday. It is gonna be a process but the truth will come out. Maybe there is some funny business going on I don't know. All know is that he is his son. :)",
            "post_id": "13567618",
            "timestamp": "1451362022",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I'm happy to hear that girl and do keep us updated please I wish you and your baby the best of luck happy new year",
            "post_id": "13578049",
            "timestamp": "1451775286",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "A little update, because this is going to take a while. The father got served last week. He has 20 days to respond or default. Then we go from there. I don't know when the test will be.",
            "post_id": "13628583",
            "timestamp": "1453651979",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Good luck girl",
            "post_id": "13629303",
            "timestamp": "1453672642",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "So the father is fighting it and fighting it hard!! I will have have to testify in court and face up to 10 days in jail if I am lying, ugh!!! I am not lying so here we go!! The court date will be at the end of February. Then the judge will decide, based on my sworn testimony and my signed statement whether or not to order a new test!!I have to keep repeating that I am doing this for my son!!!",
            "post_id": "13649974",
            "timestamp": "1454427405",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Oh no!I hope everything turns out the best for you and your son!!",
            "post_id": "13650097",
            "timestamp": "1454430925",
            "user_id": "user_15048916",
            "user_link": "/personal_pages/user/15048916",
            "votes": "0"
        },
        {
            "answer": "Charna, if the judge obliges the guy to test again (and why would he not, since prenatal tests are usually not admissible to determine paternity?) and the test is run by a legitimate lab with witnesses in case the guy did something funny, and he comes out the father, you have a good legal case against the company that did the first test, for your pain and suffering.  Presumably your lawyers have told you this.  So perhaps it will not be for nothing.  I can't believe this guy would fight taking another DNA test (just to get the question answered) if he had a clean conscience, it does seem like he somehow faked the test before.",
            "post_id": "13650174",
            "timestamp": "1454432832",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "He has filed a dismissal and sanctions based on this prenatal test. I have no doubt that the judge will order a retest. But if that retest comes back negative I could get 10 days in jail ( I doubt a judge would order that) and I will have to pay all his legal fees and mine. At the dismissal hearing I will have to testify and then the judge will decide if he will order a new test.",
            "post_id": "13651107",
            "timestamp": "1454461976",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "He has not filed \"a dismissal,\" he has at best filed a request for a dismissal, or a request for summary judgement.  But since prenatal DNA tests have not yet been approved by the courts for purposes of determining paternity, it would be a poor judge who would grant summary judgement based on one being done before the baby was even born.",
            "post_id": "13651392",
            "timestamp": "1454472564",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "Obviously I meant a request for dismissal. And yes I have no doubt that the judge will order a new test. I don't have the court date yet, but my lawyers did give me a worst case situation as in the new test coming back negative.",
            "post_id": "13651467",
            "timestamp": "1454474455",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I'd be worried about two things.  One, that he will find some way to fake the test again.  Ask for witnesses, ask to be there, ask for a disinterested and highly respected lab.  Two, that (rare as this is) he might be a chimera.But frankly, if you didn't sleep with anyone else, the simplest explanation is that he found a way to fake the test.  Let's hope he doesn't have a way to do that again.",
            "post_id": "13651570",
            "timestamp": "1454477927",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "What I meant by that last is, given that you didn't sleep with anyone else, the first logical explanation is that he figured out a way to fake the test.I am very suspicious of his resistance to test again.  It is cheaper to do another DNA test than to go to court and fight it.",
            "post_id": "13651639",
            "timestamp": "1454480706",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "In order to fight the chance that he is a chimera (slim of a chance though it is), you might have your lawyer request a blood test and a cheek swab from the guy, not just one or the other.  It will also reduce the chance that he figured out a way to fake a cheek swab (I don't know how someone could do that, but you want to cover all your bases).",
            "post_id": "13652545",
            "timestamp": "1454523994",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "I can't believe he's giving u such a hard time ! If the baby has his dark hair and he knows he was involved with u at the time why in the hell is he being an ***... Ugh girl I know u want your justice but even if given I wouldn't want him around my son since he fought so hard to get the truth.... Again hope u get to the bottom of this",
            "post_id": "13654846",
            "timestamp": "1454610157",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "This is insane, I will say that. I wish he would just retest but he wants to fight. I thought about backing out but what would I say to my son years down the road. I don't care if he wants to be involved in his life but I will not have \"unknown\" on the birth certificate when I know who the father is. I have been with one man in two years. My son deserves for me to fight. I need to be able to say  I tried everything.As far as what I can and cannot ask for at court, I don't have much control. I can't ask for a different lab and I can't ask for a blood and swab. I will be good just getting a retest. Because he filed sanctions my lawyers can be held to pay his lawyer expenses so all three of my lawyers say me down and made me do a sworn statement about my sexual history and who my sons father is, that was super fun.",
            "post_id": "13657027",
            "timestamp": "1454692942",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "You can't ask for a different lab?  That seems pretty ridiculous to me.",
            "post_id": "13658275",
            "timestamp": "1454739477",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "1"
        },
        {
            "answer": "Trust me I have tried!! I have tried so hard, but honestly no one believes me. It is the hardest battle I have ever fought. I am so close to just raising him alone without his father but I can't to that to my son. He deserves for me to fight. Even if this test comes back negative and the father is chimera at least I tried everything. I will never be able to prove if he is chimera with out his cooperation and I will never have his cooperation. I will always know who my sons father is and that will have to be enough.",
            "post_id": "13658950",
            "timestamp": "1454775407",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Just wanted to note that the prenatal test now being offered by ddc states they only need a mouth swab from the father.... I'm just wondering why they changed it...... I'm still awaiting giving birth here :/",
            "post_id": "13710249",
            "timestamp": "1456951064",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "Really? Is a cheek swab more reliable than a blood test?Since i already gave birth and i see no similarities with my bbys and partner i want to secretly do a paternity test at home. Is it possible?",
            "post_id": "13725146",
            "timestamp": "1457627530",
            "user_id": "user_15048916",
            "user_link": "/personal_pages/user/15048916",
            "votes": "0"
        },
        {
            "answer": "One of my bbys is super light, brown hair, and like colored eyes. So basing my prenatal paternity test on looks is not working lol",
            "post_id": "13725150",
            "timestamp": "1457627726",
            "user_id": "user_15048916",
            "user_link": "/personal_pages/user/15048916",
            "votes": "0"
        },
        {
            "answer": "Hey girl Hmn they have the Walgreens test with ddc but that would be sorta pointless since they already have your DNA on file and I'm sure if u told them u wanted to do it secretly they probably wouldn't allow u too... Maybe look up a second reputable company which accepts hair samples or tooth brushes or other forms of items for DNA sampling... As far as I know both blood and swab form tests are very accurate they are just processed differently",
            "post_id": "13725369",
            "timestamp": "1457634415",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "It's not looking good for me ladies. I go to court in three weeks but my lawyer doesn't think the judge will order another test besides the prenatal one, which blows my mind and breaks my heart. This whole thing has turned into a circus and I think people have forgotten that there is a real life child involved here. People are quoting case law to me and talking about test accuracy and I am just staring at my son wondering why isn't he reason enough. And if they are so sure in the prenatal one then why does it matter if we do another one, unless he doesn't want him no matter what. That is what scares me is that when he finds out the truth he still rejects him and then I have wasted my time and energy. I am going bankrupt with this court case and, according to my lawyer, end up paying his lawyer costs no matter what  and I probably won't get a retest. Here I am a single mom and I know without a doubt who the father is but do I lose everything to prove it. I am very very close to losing my job because I don't have childcare. I have cleaned out all my bank accounts. I am flat broke. I have prayed about it and talked to my preacher and the answer I get is to keep fighting. I just hope that once the truth comes out this is all worth it. I hope ten years down the road when my son has a relationship with his father I can say I did the right thing.",
            "post_id": "13760894",
            "timestamp": "1459423072",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Hey Hun don't give up ! Argue with them that even on the paper it states they aren't court admissible even other women who are fighting to declare paternity for legal purposes have to use a state approved test and facility",
            "post_id": "13761558",
            "timestamp": "1459446419",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "Hey Hun don't give up ! Argue with them that even on the paper it states they aren't court admissible even other women who are fighting to declare paternity for legal purposes have to use a state approved test and facility",
            "post_id": "13761561",
            "timestamp": "1459446426",
            "user_id": "user_15353380",
            "user_link": "/personal_pages/user/15353380",
            "votes": "0"
        },
        {
            "answer": "I don't know why mine is so different. I don't understand why all this is happening. I wish I slept with someone else I really do my life would be so much easier right now. I don't want him to be the father but he is. All this other crap, this three ring circus I am having to go through just to get a test., I won't forget it. The fact that I am having to ask my family to buy diapers and formula right now just so I can pay the lawyers, I will not forget it.",
            "post_id": "13765004",
            "timestamp": "1459608664",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "DDC prenatal test was incorrect. It was proven in court with a post birth test from Labcorp.",
            "post_id": "13855676",
            "timestamp": "1463941332",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "Do you think he found a way to fake the test?",
            "post_id": "13855766",
            "timestamp": "1463945661",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "No DDC is investigating their procedures and we submitted to another test through them. I will have their findings tomorrow. Although they already admitted their mistake to me on the phone on Friday. Tomorrow it will be official and hopefully they can explain what went wrong on the prenatal test.",
            "post_id": "13856141",
            "timestamp": "1463964015",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I personally feel it was error at the sketchy testing center they sent me too.",
            "post_id": "13856147",
            "timestamp": "1463964134",
            "user_id": "user_15512365",
            "user_link": "/personal_pages/user/15512365",
            "votes": "0"
        },
        {
            "answer": "I hope so!",
            "post_id": "13856172",
            "timestamp": "1463965057",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        }
    ],
    "post_id": "13432782",
    "question": "Hi girls I know you've read my posts here just wanted to create another question/support group for us ladies currently expecting after doing the NIPT who will be retesting after birth? If the difference is not obvious I'll probably retest for peace of mind....Currently 21 weeks due March how about you girls?I hope everyone is doing well feel free to post vents etc hope this helps everyone as its difficult to find support for our situations.",
    "timestamp": "1446658578",
    "title": "Awaiting Paternity Confirmation Group",
    "user_id": "user_15353380",
    "user_link": "/personal_pages/user/15353380"
}