{
    "answers": [
        {
            "answer": "Oh, and because I finally feel like I can, here I am posting my ticker for the very FIRST time!!!  LOL",
            "post_id": "6159672",
            "timestamp": "1284938785",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Great job Bridgette... I don't know how you keep us all straight lolSo my feet have been swelling friday after work they were HUGE..then went down over night. Sat. 4 hour drive to GA and a birthday party later they were fat again. Anyone have any tips on how to keep my feet/ankles/calves from getting fat?",
            "post_id": "6159703",
            "timestamp": "1284939553",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Thanks Tausha :)  Just to give you an idea . . . my title at work is \"Organizational Specialist\"  - no joke LOL.  This is what I do for a living!!My DH read in one of the dr's papers that Cranberry juice is supposed to be good for swelling.  I mix mine with sprite and it's a pretty yummy \"cocktail\".  Also, if you are taking a 4 hour drive - you should probably stop once in a while and get out of the car to walk around.  I sit at a desk all day and make a point to get up every 2+ hours and take a stroll through the hallways.  That's also what the dr's suggest for traveling/flying.",
            "post_id": "6159717",
            "timestamp": "1284939878",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Just dropping by to check out this list! WOW!!!!!Bridgette- LOVE THE TICKER!!!!!!!!!!!",
            "post_id": "6159807",
            "timestamp": "1284941800",
            "user_id": "user_693804",
            "user_link": "/personal_pages/user/693804",
            "votes": "0"
        },
        {
            "answer": "OMW! look how far we have moved up the list! thanks Bridgette! loving the ticker :)Still feels surreal though as much as I fee her all the time and the nursery is slowly getting done, cant beleive that in less than 100 days my baby girl will be in my arms! AHHHHHH roll on december :) Hope everyone is doing super well and having a very uneventful pregnancy!",
            "post_id": "6160846",
            "timestamp": "1284972028",
            "user_id": "user_1168353",
            "user_link": "/personal_pages/user/1168353",
            "votes": "0"
        },
        {
            "answer": "Gail - I know the feeling.  I still don't think I've come to total grips with the fact that I'm pg yet.  Does seem very surreal!  We  haven't started the nursery yet, but we got our crib a couple of weeks ago.  Just waiting for hubby to be home to put it together for me.I bet the next 100 days are going to go by really fast for us!!",
            "post_id": "6161096",
            "timestamp": "1284982706",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Awesome, thank you!!! My due date is now March 10th, 2011 :)  Let's keep going with the BFPS!!",
            "post_id": "6161457",
            "timestamp": "1284991125",
            "user_id": "user_778044",
            "user_link": "/personal_pages/user/778044",
            "votes": "0"
        },
        {
            "answer": "Bridgette I am going to pick up some cranberry juice on my way home... Just so happens I LOVE it :) so no issues with that remedy. I am with you all on the still can't believe it!!! You have hit the viability point...yyyaaayy!!! I can't wait to hit 24 weeks :)",
            "post_id": "6161469",
            "timestamp": "1284991378",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Wow- the list is great!  I can't believe its already been almost 2 months since Sarah arrived!  It seemed like time was going so slow when I was pregnant, now time is flying.  Only if Sarah would sleep through the night now would be great.  Good luck to all the soon to be mommies.  I'm loving being home with baby and dreading when I have to go back to work- def. will be stressful.",
            "post_id": "6162993",
            "timestamp": "1285017537",
            "user_id": "user_609020",
            "user_link": "/personal_pages/user/609020",
            "votes": "0"
        },
        {
            "answer": "Thanks for the new list Bridgette!!  I'm right there with everyone with the swelling!!  I'm going to have to try the cranberry juice!  I found out last week that I have low iron, so I now have to take an additional iron supplement on top of my prenatal.  It makes my tummy upset, so that is not fun either!!  I have also been hit with the 3 trimester tiredness already and it is terrible!!  Other than that, everything is good!  We have started the nursery and the furniture is going to be delivered a week from tomorrow.  I'm also super excited because my shower is just over a month away and my SIL sent the invites today!!  I just can't believe how fast it all has gone!  I just hope the last few weeks doesn't drag out, lol!!  I'm glad everyone is doing well!!",
            "post_id": "6163138",
            "timestamp": "1285019822",
            "user_id": "user_1024452",
            "user_link": "/personal_pages/user/1024452",
            "votes": "0"
        },
        {
            "answer": "Good luck with the iron angelbaby.  Are you taking it with food?  I'm not looking forward to the tiredness in the 3rd tri-mester.  I'm already pretty wiped out.Hubby is away from home, so I'm in charge of the dogs . . . which means getting up and taking them outside a couple of times a night.  Good thing I have to pee anyway!!  LOL.  Plus I guess they are just preparing me for baby :p",
            "post_id": "6163643",
            "timestamp": "1285029227",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "anxiouslywaiting910 - Some of the swelling depends on the hormones, and some how the baby is sitting/laying.  The baby could be putting pressure in specific areas making you swell.  This happened to me a bit here and there.  You can always try getting chiropractic adjustments to see if that helps.  I've been adjusted regularly this pregnancy and have only swollen up a very little, not sure if it's just the different pregnancy then with my first or if it's the adjustments.Thanks for the new list Bridgette!  It's so crazy seeing my name second from the top!  I was just talking to DH today about how fast the pregnancy has gone, it feels like just yesterday I found this community!  Hopefully your baby will sleep well for you!  My son was horrible (still is at 2) but I know a few other mom's who's babies slept like angels very shortly after getting home from the hospital.Well I've been having contractions like crazy and expect/hope to have this little one any day now!  I was in labor Sunday evening, but the baby was engaged incorrectly and my body wasn't making any progress so she popped right back up there and I've been working on making sure it's as easy as possible for her to pop back down in the correct position!  I've just tried acupuncture and have been adjusted several times lately, Today it's really starting to feel like something's happening.",
            "post_id": "6166321",
            "timestamp": "1285095251",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Oh gosh Amy, you're so close!!!  It seems like just yesterday when you got your BFP!  Can't wait to see pics of your little girl and hear how the labor went :p",
            "post_id": "6167160",
            "timestamp": "1285109112",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Hi Preggers!!!  How's everyone doing?  So many people are close to having their babies!  Ashlynn and I are doing great.  She is almost 8 weeks old & close to 11 pounds.  Oh how they grow so fast.  I start back to work part time tomorrow...",
            "post_id": "6169525",
            "timestamp": "1285169830",
            "user_id": "user_991222",
            "user_link": "/personal_pages/user/991222",
            "votes": "0"
        },
        {
            "answer": "Wow, its been awhile since I've been on here! My baby shower is tomorrow and I'm super excited! Five weeks left, I can't believe its almost over and little Kirk will soon be here. My OB doesn't check for dilation, but I'm pretty sure I'm starting to dilate. I've been getting stabbing pains in my hoo hoo, that are so bad that I've thrown what I was holding a couple of times lol. Hope everyone is doing great!",
            "post_id": "6179491",
            "timestamp": "1285388158",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "Amy-just read your post on the old message board. I am really suprised too that they didn't check me, but my office doesn't check until I'm actually in labor, or until I'm overdue and they start talking about inductions. I was taken off work though, thank goodness I'm not on bedrest at least.",
            "post_id": "6181106",
            "timestamp": "1285442485",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "Wow ... somehow I've missed the newest belly buddy list!  I've been so busy with work, the kids and trying to get something accomplished before the baby gets here (failing miserably on the last one) I guess I just overlooked it.I'm so excited to be so close to the top of the list now, I didn't think I'd ever get there.  I'm 34 weeks, 5 days today.  Still on progesterone for contractions, and still having them fairly regularly.  There are less of them then before, but when I have them they are stronger.  As of 33 weeks though there is still no change in the cervix.  Now that it's so close to the end I don't worry so much and find myself pushing on through contractions rather then sitting down.  I just can't wait for 37 weeks when I can ignore them altogether and do what I want to finish getting ready for the baby!  Of course my biggest fear is that I won't know it's real labor, I mean the contractions feel pretty real now!  I guess I'll know though when it's time ... and hopefully in time!!!Good luck to those anxiously watching for any signs of labor to start ... can't wait to hit that stage myself, just a couple more weeks...",
            "post_id": "6181292",
            "timestamp": "1285446724",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Well my little girl hung in there so I could make it to class on Sat, I'm hoping it'll be soon now though.  If it's not I'll go insane for sure!  I'm toying with the idea of being induced on either Sun 3rd at 9pm, Tues 5th at 9Pm, or Sun 10th at 9pm.  My midwife said they just use a pill and don't hook you up to the drip of stuff so that's making it much more appealing!  I want out little one to come out on her own but I'm not sure how much longer I can take this physically, mentally and emotionally.  It's been over a week since my body has started the strong labor signs.Steph - 8 weeks already?  Wow that went fast!  How is your adjustment back to work?  I remember with my first he was so colicy that I was so excited to be back just so I didn't have to listen to screaming all day/night.  But it was hard.  I think the hardest part was at 4 months when the babies get an idea of time and our son knew I was gone for so long during the day, he would wake me up at night just to look at me.Theresa - Some dr's will check you at 35 weeks just to see how things progress.  But honestly it really doesn't do too much because it won't help you figure out when the baby will get here.  My midwife basically gave me the option if I wanted to be checked.Pips - you'll be there before you know it!  Although I know how you feel with having contractions that do nothing :(",
            "post_id": "6186047",
            "timestamp": "1285592093",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Saw the doctor today ... I am 1 cm, so maybe the contractions are finally doing something!  At 35 weeks I'm thinking that looks good for delivering at 37 or 38 weeks.  I hope so ... I'll post the whole doctor story on it's own in the forum though so I don't take up so much space here.Hoping you go soon!!!",
            "post_id": "6188482",
            "timestamp": "1285633632",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Great. Ticker bridgette!",
            "post_id": "6189399",
            "timestamp": "1285654559",
            "user_id": "user_550943",
            "user_link": "/personal_pages/user/550943",
            "votes": "0"
        },
        {
            "answer": "Pips - I hope you go soon!  Having contractions so much isn't fun!  The fact you've progressed is awesome and a great sign!  I think I was 1 cm at 35 weeks, at 37 weeks 2 cm, and no change at 38 weeks :(  I'll find out tomorrow how things are progressing.  It's so funny, the baby will drop into place, then it's like she gets scared and pops back up.  I've got a long list of questions for my dr about induction, etc.  I might see what her thoughts are on stripping of the membranes and see if that's something she'd be willing to do tomorrow.",
            "post_id": "6189941",
            "timestamp": "1285677281",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Amy - gosh, really any day now for you!!  So exciting :)Pips - I hope your baby girl doesn't keep you waiting too long after the 37 weeks.  I can't imagine how frustrating it is to have contractions that go no where.Last week I started to have some vision problems.  I'd get an aura like I was about to get a migraine, but didn't get the migraine.  Just spots before my eyes and couldn't see to well.  I just assumed it was because I'm under a lot of stress right now.  Then last night I felt just awful!  Pretty sure it's because I ate too much.  Anyway, called doctor and told them what was going on with my eyes and that I hadn't felt baby girl move around as much lately.  They are concerned enough that they are having me come in for a u/s tomorrow.  I'm worried that it might be preclampsia?  I had high BP before the BFP, but it's been really good sense.  Starting to swell a little, but not obnoxisouly.  Anyway, a little nervous about the whole thing . . . I'm such a worry wort!!",
            "post_id": "6192492",
            "timestamp": "1285718553",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Coca and barn -  Tell me about contractions that go nowhere ... I've had them since around 22 weeks (well, that's when I started meds, so before that even).  I'm glad they didn't go anywhere then, but it's a really long time to have contractions at all!  I don't even remember what a quiet uterus feels like!  I'll take a 1 at 35 weeks.  I figure with the contractions that are breaking through doing their thing ... then going off the meds at 37 weeks and things pick up even more, I'll be good to go!The other reason I want this baby OUT at 37-38 weeks is she seems to be ridiculously big.  I was measuring big at first, then things started to slow down ... then she started flying again!  at 35 weeks, I am measuring 39 cm!  That's big ... keep in mind that the baby is now in the pelvis and the doctor is saying -3 or 4 station.  Not REALLY down there ... but low enough that it should be making measurements smaller not bigger.  Afraid she's going to rip me to shreds!  I do have gestational diabetes, but I'm borderline ... and my sugar is always good when I get checked and never any sugar in the urine.  Also, at 35 weeks I've only gained 25 lbs.  I do cheat occasionally and have some sugar, but don't think I am creating this big baby ... probably just luck of the draw.  My 2nd baby was 7lb 14oz at 38 weeks.Barn ... hoping your BP is low!!!  My sister in law had preeclampsia with the first and delivered at 33 weeks, but she and baby were fine.  With her second they were really on top of it and she made it until 37 and both her and baby were fine again.  She had high BP with the second but never developed into preeclampsia.  So even if the BP is up, things can turn out well...",
            "post_id": "6193047",
            "timestamp": "1285729317",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Has anyone else had problems posting?  I just wrote a whole long post and when I submitted it it lost it all??  THis has happened to me quite a few times...so, this is going to be a short one so i dont waste time!! LOL!Congrats to all the new BFPs and all the ladies moving up on the list!!  I cant believe I\"m 4th from the top??!!!  12 days until c-section!!I go to the drs on Thursday so I will update then...can't believe it's almost time but I am SO SO ready!!! :)",
            "post_id": "6193735",
            "timestamp": "1285755877",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "DMarie ... You are almost there!!!  I'm always jealous of those that have an exact date when they will deliver.  Don't get me wrong ... I don't want a C-section (I know many who've had them prefer it that way but the unknown scares me!), but I hate the anticipation all the same!Hubby has decided it'd be so cool to have the baby on 10/10/10!  I told him that's still a little early (36 weeks, 6 days)!  I think 37.5 / 38 weeks sounds perfect!Tell me what you all think though, do you think it's wrong to wish for the baby to come 2-3 weeks early?  I'm freaked because she's so big, which is a big part of why I want her early ... but the people at work have been giving me trouble for verbalizing that, saying she needs to be in as long as possible to get everything she needs.  Just wondering how you all feel about the issue.",
            "post_id": "6196538",
            "timestamp": "1285807803",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Pips...I think 2 weeks is reasonable to want the baby to come, and really, they are full term at 37 weeks.  I feel the same way sometimes..I think this baby is going to be BIG so I wish that he could come earlier, but they won't do the c section any earlier than 39 weeks.  People will say, oh, she'll come when she is ready....lalalaa..but have all of these people that are telling you this experienced pregnancy??!!  Or remember how they felt at 37 weeks?And yes, 10/10 would be SOOOO cool. I hinted at that to the dr. but couldn't convince her to come in on a Sunday for a scheduled procedure, so unless he decides to come early...10/11 was the only other option...unless i wanted later in the week but, um...NO!  LOL!",
            "post_id": "6197769",
            "timestamp": "1285842916",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "Pips, I tend to agree with Dana . . . isnt' full term considered at 37 weeks?  And if she comes then, she must be ready??  Good luck!!So I had my doctor's appt yesterday and they have decided to be really proactive about the possibility of me having preclampsia.  I had a bunch of blood work done and have to do the 24 hour urine collection this weekend.  I have a growth u/s in 2 wks, another appt 2 wks after that and then another u/s 2 wks after that!!  So sounds like they are going to have me come in every 2 wks until it's time to go to once a week??  Even though my BP is elevated they say not to worry yet and they are just trying to get a baseline for me in case it does turn serious.  I'm very happy to get more chances to see my baby girl and I'm relieved that they are taking my concerns seriously and aren't going to muck around with this!",
            "post_id": "6200433",
            "timestamp": "1285893269",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "bam1014 - that's good that there watching everything more closely, I hope it helps you feel a little more at ease!Pips, if your baby comes early at 37 weeks she should be just fine!  That's why the dr's don't try to stop labor after that.  My midwife also said that some women have it so there baby/body is ready before others that's why some women have the babies at 37 weeks and some at 42.DMarie919 - sorry you can't have your 10/10 baby :(  My midwife only schedules inductions and stuff 2 times a week because she needs to share with other dr's so that's just how they plan it.I'm talking induction and if I haven't had the baby by the 10th I'm thinking of being induced at 9pm meaning I should have the baby on the 11th (my husband's birthday).  I don't think I can hang in there any longer!  I had my membranes sweeped and have been having regular contractions 10 min apart that don't necessarly quit at night.  ugh, I just need this to be over!  lol.",
            "post_id": "6201900",
            "timestamp": "1285938699",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Bridgette glad they are keeping an eye on you. You are lucky you will get to see baby girl so often:)Looks like we will be having some baby pictures to look at soon :) so excited!!! I know yall are excited to meet your little ones.",
            "post_id": "6202482",
            "timestamp": "1285949406",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "So nice to see my name toward the top of that list!To all you who are getting ready to have your little ones...Hope you have healthy deliveries and healthy babies and I am so envious lol!",
            "post_id": "6202895",
            "timestamp": "1285956761",
            "user_id": "user_1225070",
            "user_link": "/personal_pages/user/1225070",
            "votes": "0"
        },
        {
            "answer": "I started walking last week(21weeks) Total I have went walking 3 times. I have lost 4lbs!!! Is it the walking that has me losing weight? I also had a stressful week too. This is the first time I have lost weight since becoming pregnant. I am concerned.",
            "post_id": "6211144",
            "timestamp": "1286202548",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "anxiouslywaiting910 - Don't worry about loosing weight too much.  The baby will take what it needs from you so as long as you aren't underweight there shouldn't an issue.well I hate this waiting game.  It feels like the baby will be here soon, contractions didn't lighten up over night so I'm hoping I can get them to speed up so I can finally be comfortable again!",
            "post_id": "6211234",
            "timestamp": "1286204396",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Tausha - I wouldn't worry about it too much.  Just make sure you're still eating well and mention it to your dr next time around.Amy - sure hope your little girl comes soon!!I had to take the 24-hour urine test this weekend and nurse called tonight to say I passed!  So far good news.  I do my GST and get a u/s a week from Wed =)  Can't wait to see my little girl again!",
            "post_id": "6213523",
            "timestamp": "1286243685",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Well ... Had dr. Appt today at 36 weeks. I am now 1 1/2 cm dilated and am measuring 40 cm.  I asked what he thought the baby might weigh, and he said 8 2 or 8 3 ... All I could say is, \"right now?!?!\". I am so freaked out about delivering a big baby!  He did say again that I stop the progesterone at 37 weeks though, so let's just hope thongs move along then!He did also say my bp was up a little ... 130/80. Not crazy high, but we'll need to keep an eye on it.Oh, and another good sugar ... 91!  And only gained 1 lb!Barn - congrats on your test!  Hope everyone else is doing well!",
            "post_id": "6213662",
            "timestamp": "1286245831",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Tausha...I would just mention it to your dr.  Stress can be a part of it also but just try to eat if you can! :)SOOOOOO SIX DAYS!! :)  I am SO ready as I am really uncomfortable and working this week is about going to kill me but I'm trying to be strong and just deal with it.  I'm just excited to see what he looks like since he didn't really give us a good 3d shot the whole pregnancy, the little bugger!!!Keep hanging in there ladies!!  Bridgette: glad to hear you passed ur test! :)",
            "post_id": "6214433",
            "timestamp": "1286274467",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "Well my body still hasn't made any changes.  After all these contractions, etc no change!!  It's so frustrating.  Well I scheduled the induction, if I don't have the baby by Sunday evening I'll be induced at 9pm and most likely have the baby on Monday the 11th.  I've got midterms on Sat, so maybe I'll be able to make it to class and not have to re-schedule.",
            "post_id": "6219641",
            "timestamp": "1286389059",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Aw Amy...I'm sorry. I know that must be frustrating...well, the 11th is good..that will be my son's birthday as well with the c section! :)  Good luck!!",
            "post_id": "6220347",
            "timestamp": "1286400025",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "It sounds like the 11th is going to be a very exciting day!!  Good luck to the both of you!!",
            "post_id": "6220858",
            "timestamp": "1286409100",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Bridgette: Thanks!  AS for you, how are you doing???  Getting closer and closer! :)",
            "post_id": "6222219",
            "timestamp": "1286447247",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "I'm hanging in there Dana.  DH is out of town and just a little over 4 weeks till he gets back.  I CAN'T wait!!  We have so much to do when he gets home.  And then it's going to be baby showers and birthing classes.  I'm starting to get a little of the pre-mom jitters and wondering what the heck I'm going to do with a little baby??  It seems so easy right now, when I can carry her around with me, and know she is all taken care of - LOL",
            "post_id": "6222339",
            "timestamp": "1286451517",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Dana & Amy you both are soooo close!!!! I'm jealous:) I don't want a c-section but that is soo cool that you know exactly when you will get to meet your little ones.Not to much going on with me.. Still stressing and it's been an emotional 2 weeks. I have cried about everything. Then to top it off little mans movements have changed. They don't seem to be as strong?? I am hoping he has turned around...and that's what's causeing the change. Next appt is on the 20th. Weight seems to be back on track so hopefully I will get all good news at my appts. I have a regular appt at 130 and level 2 us at 330.",
            "post_id": "6222347",
            "timestamp": "1286451640",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "thanks!  Although this waiting for the baby is WAY worse then the TWW.  It feels like forever away now.Bridgette - You'll be a great mom.  The first part is pretty easy compared to when they start moving.Tausha - It is nice to know, although with me if the induction doesn't work they'll send me home.  The majority of the time it does work so I'm really hoping!  I'd love to wait it out one more week but my body just can't take this anymore!  I'm sure it's just the baby moving.  I notice in some positions I don't feel as much movements.  I loved the ultrasound parts of pregnancy, maybe that's the only part I liked, lol.",
            "post_id": "6222751",
            "timestamp": "1286460106",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Tausha: Yes if the baby turns sometimes it will make the movements feel different.  I'm sure everything is fine.  Good luck at your appointments.I don't really want a c-section either but, at least I do like to have a plan and know that I can take Taylor to daycare in the morning and then when my mom picks him up he will have a baby brother! :)Bridgette: New mom jitters are normal!  I am still getting some with my second!  LOL.  well, actually I'm nervous about handling two!!Appointment today...I am measuring 40 weeks!!  I hope I dont have a 10 pounder in there!!  LOL!   I'll be sure to keep you all posted! :)",
            "post_id": "6224828",
            "timestamp": "1286496590",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "Bridgette I'm sure you will do great.Dana my SS is soooo excited about his baby brother. He is trying to figure out how early he can wish him out and have him still be healthy. He has asked a million and one pregnancy questions. Thank God he didn't go into the how to get pregnant 10 is a little early for that convo lol in less then 72 hours you will have your little one!!! I'm excited for you!!",
            "post_id": "6226579",
            "timestamp": "1286548425",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Amy I love the ultrasounds too.. I got spoiled in the begining having one everytime I went lol Now I get them like everyone else =( not that often. But for a healthy baby I will deal with not seeing him for a little while at a time.",
            "post_id": "6226641",
            "timestamp": "1286549852",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Hey ladies.  I know some of you are at the same stage of pregnancy as I am so I thought I would share.  At about 15 weeks pregnant I started to use Palmer's cocoa Butter formula:Tummy Butter for Stretch Marks.  I put a GENEROUS amount on my belly every night before bed and I haven't experienced a stretch mark yet...not to say I wont later but it is working so far.  Just thought I would share.  Be sure to wear an old t-shirt to bed....it will be saturated with belly butter the next morning.",
            "post_id": "6232154",
            "timestamp": "1286719164",
            "user_id": "user_1158221",
            "user_link": "/personal_pages/user/1158221",
            "votes": "0"
        },
        {
            "answer": "I've used the Palmers cocoa butter for stretch marks for both pregnancies and to be honest it didn't help at all.  I used it at least twice a day, it helps keep your skin stretchy so you are less likely to have stretch marks; however, nothing can prevent stretch marks.  I hope it helps you, but it sure didn't help me!Also, make sure you use it afterwards for a while too, I did notice that it helped the stretch marks blend in.  I think it did more good afterwards than before hand.I'm getting so excited!  9 more hours until the induction!  I'm really hoping it goes well!  I got a nursing cover sewn today so I'm all ready for when she's here.  I didn't even spend much on it either, I got 5 yards of fabric at wall-mart for $5, only used about 1 yard, and the D-rings were only a few dollars too.  With my son I just hid in a room when he needed to feed, it'll feel nice to have some sort of thing so I can nurse in front of family.  I'm not sure if I'll post how things go tomorrow or not, depending on how I'm feeling but I'll defiantly update everyone on Tuesday.  I hope everyone is having a great weekend!!Tausha - yes, I'd take a healthy baby over ultrasounds any day.Dana - Good luck on Monday!",
            "post_id": "6232737",
            "timestamp": "1286733827",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Ladies I can't believe it, my AF was due Fri and sure enough that evening there was pink when I wiped, it was mucusy but I didn't take too much notice and put a pad on thinking AF was here.  I felt sooo upset and was really thinking that I couldn't keep going and was seriously considering giving up.  Well I had no more blood, all through yesterday nothing at all so this morning I decided to test even though I've had no preg symptoms (saying that I had no PMT this month either).  It was BFP!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  Well I was shocked, then happy, then shocked, then crying, then shock, lol.  I'm obviously a little worried about that bit of mucus blood and so feel that I've got to remain realistic and not get too excited just yet.  It was a very definite positive though which is a good sign and the lack of symptoms isn't phasing me as with all my successful pregnancies I had none or little symptoms.Please send me lots of SSBD to make this little bean stick, it still hasn't sunk in!Helen",
            "post_id": "6232780",
            "timestamp": "1286734402",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Congrats Helen!!!  I'll be praying for a sticky bean!! :)Next time I log in I will have news to report!  It's so surreal!! Thanks to all my ladies who have supported me through the ttc and pregnancy journey!  Hugs!!!  Couldn't have done it without your help!!",
            "post_id": "6233183",
            "timestamp": "1286744504",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "CONGRATS Helen!!!  Welcome to the other side :)Dana and Amy - good luck tomorrow.  Can't wait to hear the birthing stories and see our new little additions.",
            "post_id": "6233243",
            "timestamp": "1286746601",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Ditto what Bridgette said...CONGRATS HELEN!!!!!Dana & Amy praying all goes well for both of you tomorrow. Put up pictures ASAP =)",
            "post_id": "6233528",
            "timestamp": "1286754919",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "I just wanted to let everyone know, my induction today went really well.  I managed the entire time with no pain meds.  They started the induction at midnight today and I had my little girl at 1:32.  Baby Nori is 8 lb 2 oz and 20 1/2 in long.  We are both doing really good.  The hospital has REALLY slow internet so no picts till after Wednesday.  The funnyest part of my labor was they tried to break my water, then several hours later when checking me, my water litterly exploded all over the room!  It was a good laugh by all (in the end of course!).  If you want to read how the labor went I posted in the Oct 2010 babies group.  Over all I'm very happy it's all over and looking foreword to spending time with our new little girl!  I didn't sleep at all last night as things kicked into gear faster than expected.  I hope everyone is doing well!",
            "post_id": "6237343",
            "timestamp": "1286847567",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Congrats Amy!!!Dana had her little boy yesterday morning too.  Congrats to Dana too!!!",
            "post_id": "6238435",
            "timestamp": "1286883355",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Yaayy congrats!!! We have new babies!!!",
            "post_id": "6238913",
            "timestamp": "1286893025",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Hey all :)  Yes, Mr Brayden Matthew was born yesterday 10/11/10 at 831 am.  He weighed 8 lbs 1 oz and 20 1/4 inches long.  He has his daddy's red hair!!  LOL!  It's kinda cute and it is growing on me.  At first I was like, oh the poor boy...but he really is so cute I just can't stand it!We are doing okay.  Mommy is in some pain from the section but is hanging in there.  Trying to get some rest here and there but you know how many people are in and out of your hospital room all day!!I will try to get some pics up soon... :)Congrats Amy!!",
            "post_id": "6239226",
            "timestamp": "1286898685",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "Awwwwwwwwwww congratulations Dana and Amy :)",
            "post_id": "6240192",
            "timestamp": "1286914190",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "I went to see the doc this morning and I've come away not too happy.  I asked if I could have an early scan (they don't scan till 10 weeks here) and weekly hcg level checks (something they don't normally do) and guess what, it was a no!  They will only scan early if I have any problems, so I've got to wait till the end of Nov.  I also told her that my lmp in Sept was \"strange\", as in it only lasted 4 days and only one of those days was a proper bleed but she didn't seem concerned about that.  I think I'm going to look into getting a private scan done if I can afford it just for peace of mind.Hope everyone is well. xx",
            "post_id": "6242448",
            "timestamp": "1286969797",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Congrats to all the new babies!  Can't wait to start looking at pics!  I'm sure there are alot posted, just don't have time to start looking yet.Bernie ... this waiting for everything to be alright is awful, but before you know it you'll be waiting for that baby to be born ... this part seems even worse if that's possible, but maybe I just don't remember those first couple of months as well.As for me ... 37 weeks and 2 days.  The waiting *****!  The swelling *****!  Well ... just about everything *****!  Grrrr...  Doing everything I can to try and get labor going early.  Really thought once I quit taking the meds for contractions things would progress.  Not so much!  :(  A week ago the doc predicted over 8 lb already, so I'm only getting more and more freaked about the big baby.  Now my blood pressure is borderline as well.  Not awful (130/78 last checked) ... and a tiny bit of protein in the urine.  So, not enough to cause him to induce, but enough to keep an eye on.  I really can't believe the swelling though.  I've always been a sweller, but now it hurts to walk!  Ugh!  I was at 2 cm though ... so who knows.Ok ... complained enough I guess!  :)  Hope everyone is doing well!",
            "post_id": "6242488",
            "timestamp": "1286970796",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Congrats to all of the new babies!!  I can't wait to see pictures!!Yay Bernie on the BFP!!  I have never understood why some doctors won't do some of the smallest things for the mommy to be.  I feel like we are paying their mortgages by going to them which means that they work for us, so If I want something as harmless as a scan or blood monitoring, I think they should just do it to appease us.  We are the ones who get the bills for it and not them and it is nothing that is risky or dangerous.  I don't understand some doctors and I just thank God that my doctor is more lax and tells me if he doesn't think it is necessary but still does what I ask to keep me at ease.  I had a 7 week scan, a 9 week scan, a 13 week scan, and a 17 week scan, lol!  The only ones that I was supposed to get was the 7 week dating scan and the 17 week gender scan, all of the others I asked for and received.  Sorry, I'm ranting but it makes me so mad when doctors do that to women especially if they have already had one loss.Any who, I really have nothing to report, just waiting, swelling, and anticipating!",
            "post_id": "6242906",
            "timestamp": "1286979151",
            "user_id": "user_1024452",
            "user_link": "/personal_pages/user/1024452",
            "votes": "0"
        },
        {
            "answer": "Hi, here in the UK it is no longer policy to scan expectant mothers before 12 weeks (sorry had 10 wks stuck in my head earlier).  They will only test prior to 12 weeks if there has been bleeding or severe cramping :(  You then get another scan between 20 and 24 weeks and that's it!  It's also not policy to test hcg levels, I was really surprised when I came on here and saw how part and parcel it was of ante-natal care to have regular blood tests and I really wish they would do the same here.  Personally I would like to have the hcg tests done and a scan at 8 weeks (which they used to do when I had my first 16 years ago), if a pregnancy isn't viable I would rather know sooner than later.  I've been looking into the cost of my getting a private scan done.  It would mean travelling to the nearest city and would cost about GB£100, for peace of mind I am seriously considering doing this but they won't scan until you get to 7 weeks but at least that's better than 12 weeks.Pips - I am the worlds most impatient when pregnant, lol, all my babies were born early between 35 and 38 weeks, and all very healthy thank goodness.  All the best and trust me try and get as much rest as possible! :D",
            "post_id": "6244576",
            "timestamp": "1287004360",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Well ... started contracting this afternoon.  At first they were pretty frequent but then slowed down to every 20-30 minutes or so.  They are quite intense though ... have me bending over and gripping the table!This may be the early stages, or it may be nothing...  keep your fingers crossed!!!",
            "post_id": "6245008",
            "timestamp": "1287013008",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Yay congrats to Amy and Dana on the arrivals of Nori and Brayden! Can't wait to see pics!I'm so happy to hear about your BFP Helen! Really hope this one is nice and sticky! My doc refused to give me an early scan either. My first pregnancy I had quite a few problems and he refused to scan me even then, and later told me he knew my baby wouldn't be viable so I don't understand why he would put me through four weeks of torture knowing something was wrong and everyone brushing me off because the doc wouldn't investigate. This time around I lucked out and got in with an OB early on so I got a seven week scan. My doc was super mad but oh well he wasn't listening to me and kept telling me I was going to miscarry this pregnancy even though everything was going well lol. After I have this baby I'm giving him another chance then if I'm still not happy with him I'm going to ask if I can switch over to his wife. It's almost impossible to switch soca here in Canada so that may be my only option.Anyhow sorry this is so long. 15 days until my due date and I'm getting nervous! All along I've thought my lol man was going to be early but it feels as if he disengaged the other day and has been flipping around in very odd positions so guess he's gonna be late now :( Braxton hicks are feeling like sharp pains now instead of menstrual like cramps. Wish my OB did checks so I knew where I was at but oh well. Hope everyone is doing well!",
            "post_id": "6246516",
            "timestamp": "1287052333",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "* Sorry about the typo I'm on my iPod. Soca was supposed to say doctors lol.",
            "post_id": "6246530",
            "timestamp": "1287052788",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "I agree with angelbaby about us being the ones footing the bill.  I know when I talked to my doctor about more scans, their big concern was my insurance wasn't going to pay for it.  Saying they only allowed a certain number unless medically necessary.  So that's probably the most common reason.  doctors are afraid that if insurance doesn't pay for it and it comes out of our pocket at $400-$500 that we won't pay for it either and it ends in collections, so I guess I can see both points of view.Good luck Pips!!  Hope this is it for you!!I'll for sure start a new list this weekend.  Lots of babies and BFP's =)",
            "post_id": "6246617",
            "timestamp": "1287056635",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Well decided to lay down and rest while I could ... Then they fizzled during the night!  Ah well, hopefully soon!  Still feeling crampy!",
            "post_id": "6247254",
            "timestamp": "1287068760",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Hello everyone its been a while I've been mia but I am glad to come and find BFP and new arrivals!Congrats Amy & DanaBernie Congrats on your BFP!!!Well I've been trying to keep busy....I can't believe I am 34 weeks today....Doctor will be removing my stitches from my cerclage on Nov 1st.....it'll all be a waiting game from that point on we'll see if we make it to my Thanksgiving due date ( really doubt it)Hope everyone is doing great....",
            "post_id": "6248060",
            "timestamp": "1287081972",
            "user_id": "user_1092905",
            "user_link": "/personal_pages/user/1092905",
            "votes": "0"
        },
        {
            "answer": "MJ (Michael Jr.) was born on October 9th at 11:38.  Please read my birth story.",
            "post_id": "6251212",
            "timestamp": "1287159441",
            "user_id": "user_1139597",
            "user_link": "/personal_pages/user/1139597",
            "votes": "0"
        },
        {
            "answer": "Just want to add my congrats to Amy and Dana, glad you had healthy deliveries and healthy babies!Bernie - Congrats on that BFP, I know it's been a tough road for you and that you'd almost given up but I'm so glad you didn't33 Weeks today...just 7 more to go!!!!",
            "post_id": "6251372",
            "timestamp": "1287162378",
            "user_id": "user_1225070",
            "user_link": "/personal_pages/user/1225070",
            "votes": "0"
        },
        {
            "answer": "Pips :-/  oh how frustrating for you!  Still it's all preparation for the big day ;-)Babyhope - wow not long to go then, how wonderfulNikki - Congratulations :DTrying - I can't believe you are 33 weeks already, I remember when you got your BFP!!!Well I'm more tired than usual as to be expected, my bb's started aching (ouch ouch) and do I have major bloating or what!!!!  I've been a bought some forgiving sweat tops because I just don't want anyone to guess before I'm ready to tell them.  I finally told DH on Tuesday evening while we are the Fair - he was wondering why I wouldn't go on any of the rides, lol!  He's over the moon :D  but also wants us to keep it quiet until we have that first scan.Did many of you ladies also find that you wanted to keep quiet until you'd got past a certain point?",
            "post_id": "6252000",
            "timestamp": "1287174325",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Helen-we planned on keeping things quiet especially this time around but couldnt keep it in, and besides our friends know us too well and guessed right away. Guess part of it was because I was suddenly happy instead of depressed lol. As you know I also have two step daughters. They werent living with us at the time but decided to come over the morning I found out and they found my pregnancy test, and confronted dh about it lol.Well  two weeks to go and at the top of the list, I cant believe it! Went to my OB appt yesterday and told her I thought baby may have disengaged but turns out he is well engaged :) More frequent contractions today but not strong enough for me to think its time yet.On a different note, Im freaking out because I tested positive for strep B and though the doc says Ill get treated with antibiotics and everything will be fine, I looked it up on the internet (bad bad bad!) and now Im really concerned about something happening to my little man. :(",
            "post_id": "6253290",
            "timestamp": "1287206154",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "MissmyAngel - the only thing that stops me from shouting it out to the world is my four children, they were so devastated when I lost my little angel in January at 12 weeks and I just couldn't bear to put them through that again.  DH and I have already discussed that if were to be so unlucky again it will be kept between the two of us and probably my mum and dad.  I don't want my children to know until i've got to at least 12 - 16 weeks.I'm not sure about the whole strepB thing.  Is this the one where if you have strepB they have to treat the baby as soon as he/she is born?  Have another chat with your obgyn to discuss all your worries hon, that's my best advice.",
            "post_id": "6257575",
            "timestamp": "1287342719",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Helen - we had every intention of keeping it quiet . . . But DH couldn't help himself and told his parents right away.  Then a co-worker of my BF is on MH and she texted my BF when she saw me post the BFP here - LOL.  I only told a few close people I work with and the I kept mums the word until 13-14 weeks.  We didn't tell the \"world\" or my job until then.  I think it's important for a few close people to know, in case you need some support or more likely someone to celebrate the first u/s etc, but it must be so hard on the kids.  Can't possibly blame you for wanting to wait to tell them.  One of the girls here didn't tell her kids until after 16 weeks!Ahhh, once again it's a Sunday night and I'm a bad bad group leader for not doing the new list :(  I don't know how the weekends get away from me so . . .  Thanks for baring with me ladies, I promise to get a new one done soon and announce all our babies and new BFP's!",
            "post_id": "6258514",
            "timestamp": "1287364677",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Helen-Ya we were wishing we could have let them know in our own way about the baby, but I guess them finding the test saved us from trying to figure out how/when to tell them lol. His oldest daughter is fine with the baby but the younger one is not happy about it and she has been pretty grumpy the last few weeks because she knows the time is going to be here any day now, and she's going to lose the \"baby\" status. :( Well at least were having a boy, so she will always be the \"baby girl\".Strep B is some sort of bacteria kind of like a yeast infection or bladder infection, its found naturally in about 25% of womens systems. I have to take antibiotics during labor to prevent the baby from being exposed to it. If he is, then it can have devastating side effects. Thats why I'm so scared. I live 45 mins away from the hospital and have already been worried about not getting there in time, and now I'm gonna have to make sure I'm there good and early I guess. I really shouldn't have looked on the internet because the risk is extremely low nowadays because of the use of the antibiotics, but of course we pregnant women like to google stuff and freak ourselves out lol.  ;p",
            "post_id": "6258542",
            "timestamp": "1287365140",
            "user_id": "user_1145691",
            "user_link": "/personal_pages/user/1145691",
            "votes": "0"
        },
        {
            "answer": "Hi hope all the buns are cooking nicely!! Congratz to the new bfp and the babies that have been born!! Just wanted tinker u all know that I had another baby girl on te 7th October, she is called Imogen and weighed 7lb 6oz. She us just perfect has so much hair too!! The labour / delivery was a bad one she turned at got stuck so had to have help to get her out which resulted in some nasty stitches :( but well worth it. Lost quitebalot of blood too so they had to keep an eye on me for a while but everything is good now! I can't believe she is 11days old already it goes so fast!!!",
            "post_id": "6259212",
            "timestamp": "1287390692",
            "user_id": "user_1031343",
            "user_link": "/personal_pages/user/1031343",
            "votes": "0"
        },
        {
            "answer": "Congrats to the new babies and the new BFP!As for how long I waited to tell everyone ... I am VERY bad at this.  I pretty much  pee on the stick and shout it from the roof tops!  I did like it that everyone knew when I had the m/c though cause I didn't have to act ok around anyone.  Everyone knew the deal, so if I wanted to be sad I could.  We told the kids as soon as we got the second round of blood work back and I knew my numbers were rising nicely and that my progesterone was ok.  We told the family shortly after that.  Friends and coworkers however knew the same day that I did!Well ... I've been having contractions off and on every day.  What's with that?  With both of the others I never started labor on my own, now it seems like it's teasing me over and over again but not amounting to anything more then some lost sleep and a lot of frustration!Did go to the doc yesterday ... I am at 3cm now and I have an induction scheduled for Friday night at 6:00 pm.  I still hope I go sooner on my own, but at least inductions have gone well for me in the past.  With #1 it was 8 1/2 hours from the start of the drip to delivery.  With #2 it was 7 1/2 hours!  I'm hoping for a baby by Monday morning at the latest!!!Hope everyone is hanging in there!",
            "post_id": "6266315",
            "timestamp": "1287544471",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Pips - oooh it doesn't sound like you'll be waiting till Monday, lol.  All the best for Friday - or sooner ;-)I have had such a stressful morning :(  my eldest announced at 7.45am that he needed to be at college for 9am which completely threw the routine as his college is a 40 minute round trip away and I have to get my youngest to school for 8.45 (near home).  It meant a mad rush, little one had to get dressed way earlier than usual and then by the time we got back home she only had 5 minutes to brush her hair, teeth etc and had to eat breakfast in the car, grrrr.  So cross with my teen for not having the foresight to tell me of the change of timing yesterday.  Thank goodness today is my pamper day, I have the luxury of lying still for 2 hours while I have eyelash extensions :D  (my friend has just qualified and I'm her practice guinea pig, lol)Very emotional at the moment, could cry at the drop of a hat and still dare not get excited about it all :-/",
            "post_id": "6266766",
            "timestamp": "1287563371",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "Why did I say Friday???  It's Sunday night ... wishful thinking I guess.  The doc did want Monday originally but they are booked, so now the induction is Sunday night.  Maybe it was some kind of premonition and I'll go in to labor on my own Friday!!!  :DBernie ... hang in there.  I remember those terrifying first weeks, and believe it or not ... they fade away in the excitement that is to come, and even pale in comparison to the frustration and impatience of waiting at the end.  You'll be past this part soon!!!",
            "post_id": "6268557",
            "timestamp": "1287602737",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "LOL Pips you ARE ready to have this baby!!  Maybe Friday was a premonition?  Good luck!Helen - yeah, those emotions will get you every time.  I know I was terrified the first tri-mester.  I still get a little scared sometimes, but nothing compared to like then.  Soon you'll ease into the comfort of being pg and can start to enjoy it!",
            "post_id": "6269609",
            "timestamp": "1287623043",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "I'm off the list from 2009 but back on again for 2011! Wow, didnt expect it to happen this quickly :) Due 28th May - i'll be 9wks on Saturday...YAY",
            "post_id": "6270002",
            "timestamp": "1287631209",
            "user_id": "user_550943",
            "user_link": "/personal_pages/user/550943",
            "votes": "0"
        },
        {
            "answer": "YAY Stacey!  I promise to get you back on the list this weekend =)  .  Really,  I mean it this time - I'll get my butt in gear - LOL",
            "post_id": "6270839",
            "timestamp": "1287661221",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Hey all...sorry I haven't been posting much lately.  As some of you know, I developed Bell's Palsy after I got home with the baby and so I've been feeling a little blah.  It's not the end of the world, but mixed with new baby stresses and hormones, and I'm a mess some days. :/Baby Brayden has been doing well...though more active/fussy the last few days.  He has to go to the dr. again tomorrow to see if he's gained weight.  He has been spitting up a lot and so I hope he's getting enough down.  He's still not back up to his birth weight as of Monday so we shall see.Congrats Stacey! :)  I can't believe we've known eachother long enough that some of us are on round two!!  Thats just wonderful news!",
            "post_id": "6271031",
            "timestamp": "1287665578",
            "user_id": "user_773214",
            "user_link": "/personal_pages/user/773214",
            "votes": "0"
        },
        {
            "answer": "Hang in there Dana!!!Congrats Stacey!!Bridgette how are things going with you?Pips hope your ready for tomorrow ;)I had my appt yesterday all went well.., check my journal for details :)",
            "post_id": "6271744",
            "timestamp": "1287678454",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "I mistyped!  :(  I said Friday, but meant Sunday.  Maybe I said Friday because it was a premonition!",
            "post_id": "6272904",
            "timestamp": "1287695764",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Tausha - things are going pretty good.  Still trying to get used to this whole gestational diabetes thing.  Ugh, no sweets :(  And I'm sick of pricking my finger 4 times a day!  But on the upside, as of next week I officially get a u/s every single week :)  I'm pretty happy that I get to see that much of my little girl - hoping it gives me a better chance to bond.",
            "post_id": "6276867",
            "timestamp": "1287790245",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "That's awesome that you get to see her every week Bridgette! I am excited that I have my next appt on the 17th of Nov then it's every 2 weeks =) I think I am going to get on the ball with the nursery this weekend, time is passing me by quicker then I expected. How much do you have done with the nursery??Pips I know... But I was going with you typed it for a reason...so be sure to let us know if your still prego tomorrow ;)",
            "post_id": "6276908",
            "timestamp": "1287791370",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        },
        {
            "answer": "Tausha ... Ahhhh, got it now!  :)  Get busy while you can on that nursery ... you never know when something will slow you down.  I had the contractions that had me grounded, but even when it was safe to get busy again at 37 weeks, the horrible swelling started!  It hurts so much to walk around too much that it's nearly impossible!  Now I'm looking around me and freaking out because everything is messy!  The baby's room is together, just messier then I like!Barn ... when did I miss you getting the gestational diabetes?  I have it, but border line.  With every good number I eat a little worse!  hehe  The doc eventually even quit checking my numbers, and I never had to do it on my own.  So exciting that you get so many ultrasounds!Well ... I'm still pregnant ... and the induction is 34 hours away!  I'm starting to get jittery!  I had two really good deliveries in the past, so chances are this one will go well too.  But I still find myself thinking \"I am actually going to have to deliver this child!\"  LOL  I am worried about laboring with the swollen legs and feet at night.  It just sounds so uncomfortable!  I know I should be keeping my feet up as much as possible in the next two days, but I keep looking around me and freaking out about the clutter and the mess!  Everything I need for the baby is in place, but so is a lot of other stuff!  :(  I guess it will be here after I've recovered and can more easily deal with it ... but who wants to sit in a messy house postpartum with a new baby? Just venting, it will all be all right I suppose...",
            "post_id": "6278249",
            "timestamp": "1287839138",
            "user_id": "user_215342",
            "user_link": "/personal_pages/user/215342",
            "votes": "0"
        },
        {
            "answer": "Pips.. Do we have a new baby yet?? Can't wait to see pictures.",
            "post_id": "6284119",
            "timestamp": "1288003273",
            "user_id": "user_919101",
            "user_link": "/personal_pages/user/919101",
            "votes": "0"
        }
    ],
    "post_id": "6159670",
    "question": "WOW!! LOTS of babies and LOTS of BFP's since the last list!In an effort to make my life a tad easier, I did drop off the babies born in 2009.  I hope none of you ladies mind, but less for me to type.Buns already done:YogoChick - Ziva - 1/16/10MiaIvan - June - 1/16/10GMB - BOY - 3/15/10tinkerbell101 - Daniel - 3/30/10Msteri - Chole - 4/30/10EricaB28 - Emma - 5/18/10Princessa745 - JeydenSteph9803 - Gavin (sending lots and lots of prayers your way!!!)LiLinz - Thomas - 7/7/10Natalie910 - Samuel - 7/12/10HeatherLF16 - Frank - 7/21/10Steph_b - Ashlynn - 7/30/10Peterjl - Sarah - 7/30/10TCGirl - ???TeddiH - Soraya - 9/10/10Buns still in the oven:rachaellou06 - 38W - 10/2/10cocaocolapanda/Amy - 38W - Girl - 10/5/10szw2008/Sam - 37W - 10/11/10Dmaire/Dana - 36W - Boy - 10/18/10nunu/Vanessa - 36W - Boy - 10/22/10Nikkij6577 - 35W - 10/26/10missmyangel/Theresa - 34W - Boy - 10/30/10Youngmum20 - 34W - 10/31/10Pips - 34W - Girl - 11/1/10annalc - 34W - Boy - 11/5/10babyhope8/Ana - 31W - 11/25/10trying_x_3 - 30W - 12/3/101angelbabym/Gina - 29W - Girl - 12/9/10lori0615 - 28W - 12/13/10Gailybaby - 26W - 12/26/10need_answers - 26W - 12/29/10bam1014/bridgette - 24W - GIRL - 1/8/11deedee4321 - 24W - 1/15/11anxiouslywaiting/Tausha - BOY - 2/7/11iloveyson23 - 18W - 2/21/11Dani711 - 17Wandreasmom - 16W - 3/10/11princessjam/Jamie - 16W - 3/12/11Megs2Girls7/Meghan - 15Wtiffh - 13WWannababy10 - 13W1975Sam - 14WAmber 623 - 11WWHEW - my little fingers are tired LOL.  Happy posting ladies :)",
    "timestamp": "1284938733",
    "title": "Belly Buddies - 9/19/10",
    "user_id": "user_549647",
    "user_link": "/personal_pages/user/549647"
}