{
    "answers": [
        {
            "answer": "Hi Hope - I'm still praying for you that this pregnancy is the one you've been praying for!!! I meant to post earlier at how much I appreciate you sharing your losses and experiences with everyone. You are so open about it and it does help everyone else. And your faith is unstoppable. I just needed to say that.So I wish everyone with a bicornuate uterus the best of luck. Let's keep each other posted and keep the words on encouragement going. I know that I need it...Thanks!Shelley",
            "post_id": "1089500",
            "timestamp": "1070517600",
            "user_id": "user_30428",
            "user_link": "/personal_pages/user/30428",
            "votes": "0"
        },
        {
            "answer": "I just wanted to encourage you my dear friend has a bicornuate uterus.  She had several miscarriages, two healthy babies, another two miscarriages and she just delivered another beautiful healthy baby girl a few weeks ago! My thoughts are with you guys! Kellie =)",
            "post_id": "1089506",
            "timestamp": "1070517600",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "Oh Thank-You Kellie - that is encouraging!!Shelley",
            "post_id": "1089507",
            "timestamp": "1070517600",
            "user_id": "user_30428",
            "user_link": "/personal_pages/user/30428",
            "votes": "0"
        },
        {
            "answer": "just a quckie - how are \"bicornuate uteri\" and \"double uteri\" similar? are they the same thing?",
            "post_id": "1089517",
            "timestamp": "1070517600",
            "user_id": "user_56927",
            "user_link": "/personal_pages/user/56927",
            "votes": "0"
        },
        {
            "answer": "I feel like I am reading my own story. I too found out I have a bicornuate uterus when I first got pregnant back in March. I've had multiple ultrasounds previously but it was never noticed. As far as my doctor tells me, it is hard to detect and some women won't know until a doctor is performing surgery or a c-section for a breech baby. I too lost a baby at 19 weeks that had an severe giant omphalocele ( this is so bizarre that both of us have both unrelated things - and that one has no bearing on the other). I am again pregnant (like you) but am 14 weeks along with the baby  up in the right horn. My doctor is considering me high risk but also says that many women with a bicornuate uterus deliver happy healthy babies, we just have a higher rate of early delivery and/or the need for a c-section due to the baby being breech. As far as where the baby is implanted, as long as it is not on the septum, things are generally good (it wouldn't get enough nutrients to support growth). And as far as carrying, only time can tell how big your \"half\" of a uterus where the baby is will stretch before it says, time to have this baby. I'm still in shock to  be reading your post. Please keep in touch and let me know how things go and how your doctor handles your situation. But we do have good chances of carrying healthy babies.Shelley",
            "post_id": "1089492",
            "timestamp": "1070517600",
            "user_id": "user_30428",
            "user_link": "/personal_pages/user/30428",
            "votes": "0"
        },
        {
            "answer": "Thank you for your post.  I am not alone!  How very odd that we have had such a similar experience.  I was also told during the last pregnancy that it was a giant and severe omphalocele.  That is a 1 in 10,000 occurance.  Since nobody knows what causes omphaloceles and bicornuate uteri are often unreported or unnoticed, maybe it is more likely that women with uterine abnormalities have babies with this birth defect.  Possibly it could happen due to lack of blood supply (on the septum like you mentioned) or maybe we produce a few more bad eggs than those without uterine abnormalities.  I did read somewhere that those with uterine abnormalities are more likely to have babies with birth defects.  Maybe someday we will have all the  answers!  More studies will need to be done.  Until then, please let me know how it goes for you and I will do the same.  I have an appointment with a new doc on the Monday after next and I will post any new info I get.  Best of luck to you!",
            "post_id": "1089495",
            "timestamp": "1070517600",
            "user_id": "user_57489",
            "user_link": "/personal_pages/user/57489",
            "votes": "0"
        },
        {
            "answer": "Hey i'ts disheartening to find out you have a bicornate uterus. Mine was detected quite a few years ago after 2 micariages. Ihad a test called hysterosalphingogram or hsg for short. they run a radiopaque dye into your reproductive system. When I was pregnant with my son, i lost him at 19 weeks. Don't know why, there's was nothing wrong with him. any way i went to the complications clinic at UAB and they told my he was implanted midline, not in a horn. they said that was good. but i still lost. I'ts been very hard to deal with this. i alos have ahd a hard time getting pregnant. ususally taking at least one year to concieve, however this time i haveonly had 2 periods since my last miscarriage in aug. now I'm 5 weeks and praying that God will bring this child forth in spite of my uterus. I'm sorry you having to deal with this. most stories you read on the internet are not good. i stopped reading them. like shelley said though, there are many many women who go on to have healthy babies. HOpe",
            "post_id": "1089498",
            "timestamp": "1070517600",
            "user_id": "user_47749",
            "user_link": "/personal_pages/user/47749",
            "votes": "0"
        },
        {
            "answer": "Sometimes the 2 are confused.  A bicornuate uterus can be heart shaped or almost a complet split, but the bottom part of the uterus is together.  When you say \"double\" uterus, you might be referring to uterus didelphys. That is when there are 2 separate uteri and sometimes to separate cervix.  In most of the cases, a septus separates the vagina into 2 parts.  I guess this one is pretty easy to diagnose if the septum in the vagina is present.  If you want more info here's a good site:  http://www.dyspareunia.org/html/uterine_abnormality.htmHope this helps!Eboni L.",
            "post_id": "1089529",
            "timestamp": "1070604000",
            "user_id": "user_57489",
            "user_link": "/personal_pages/user/57489",
            "votes": "0"
        },
        {
            "answer": "Hey sweetie thanks for your sweet post. After everything that's happened to me, if I can help somebody at least some good came out of it.. know what i mean?? i got a good feeling about this one. Ihave bben realy nauseated.. but I'm not complaining!!! anyway, I'll keep you  informed on myself and you do the same!! Hope",
            "post_id": "1089570",
            "timestamp": "1070690400",
            "user_id": "user_47749",
            "user_link": "/personal_pages/user/47749",
            "votes": "0"
        },
        {
            "answer": "Hi to all you lovely ladies out there with heart shaped uterus'I too have a bicornuate uterus and I am 6 months pregnant with my second child.  My first born was a footling breech by emergency caesarian after my waters breaking at 34 weeks.  I am anxiously awaiting the position of this little one as I would like to try VBAC?? Unfortunately my town is very small and a breech birth is not possible.  This is just a short note to let you all know Good Luck to us and our Babies, healthy is all we ask.",
            "post_id": "1089985",
            "timestamp": "1071468000",
            "user_id": "user_58318",
            "user_link": "/personal_pages/user/58318",
            "votes": "0"
        },
        {
            "answer": "I just have a story to tell....I too have a bicornuate uterus which I didn't find out I had until my baby was 6 months old.  I have since found out that I have worst case scenario in that I have 2 cervixes, 2 vaginas and a total split uterus.  Although I did carry full term and had c section birth (elective) my baby has had severe dislocation of his left side of his body and head.  Has anyone else experienced any problems with their babies being dislocated or worse.  I would like to hear about it.",
            "post_id": "1090253",
            "timestamp": "1071813600",
            "user_id": "user_58463",
            "user_link": "/personal_pages/user/58463",
            "votes": "0"
        },
        {
            "answer": "I had a miscarriage last year and found out through an ultrasound that I also have a bicornuate uterus. I was told by my doctor that plenty of women also have this problem and go on to deliever healthy full term babes.  I found out last week that I was 5 weeks pregnant (absolutely excited,yet very cautious and scared).  Well this morning I started bleeding and know that the pregnancy is doomed.  We had no problem conceiving, but I have a big problem retaining the pregnancies. It is at about 5-6 weeks where I will start to miscarry, probably due to the fact that the embryo does not attach itself to a viable area in the uterus.  My question is, how many more times do we try before we give up?  My heart breaks into a million pieces each time this has happened.  Is there anyone out there that has had a successful pregnancy after a few miscarriages?  Please write back to someone who is so hopeful yet so sad.  Thank you.",
            "post_id": "1090381",
            "timestamp": "1071986400",
            "user_id": "user_58578",
            "user_link": "/personal_pages/user/58578",
            "votes": "0"
        },
        {
            "answer": "Bless your heart.  My friend has had the same situation as you with her bicornuate uterus.  She miscarries between 6-9 weeks.  BUT she HAS had three babies go to term and had annoying bleeding and spotting with all of them.  So, she did have viable pregnancies and 4 miscarriages.  I wish you the best and know that you are not alone.  Kellie",
            "post_id": "1090733",
            "timestamp": "1072677600",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "I am glad that I find women who have been going through the same like I have.  I too have a bicornuate uterus which is not fully split, just at the top and have had 5 miscarriages.  I have 1 child, an 11 year old and I'm not once again pregnant.  I have since changed doctors and am being treated by high risk specialists and get monitored every other week.  Right now I'm 9 weeks pregnant, the baby's heart beat is beating strong and I'm optomistic that this is the other child that I've been longing for.  Although from time to time I do have spotting but the doctors ensured me that it's the other horn thinking that it too is pregnant.  I will continue to pray for each and every one of you out there with the same problem with the hope that each and every one of you has a healthy child.",
            "post_id": "1090775",
            "timestamp": "1072764000",
            "user_id": "user_59002",
            "user_link": "/personal_pages/user/59002",
            "votes": "0"
        },
        {
            "answer": "It has been so nice to read all of your emails.  I too have a \"heart shaped uterus\" and have been completely stressed out about it.  I am 26 weeks today and my little baby has chosen the right horn as well.  I couldn't believe it when I read your emails stating the same thing.  I am so nervous that I am going to have this baby WAY too early.  I would curious to hear what your doctors have told you.  My doctor has remained calm, he doesn't seem too worried about my condition.  It sounds like that we won't know until later (32 weeks) because that is when the baby would be too big for the right side.  Is that what you guys have been told?",
            "post_id": "1090917",
            "timestamp": "1073023200",
            "user_id": "user_59293",
            "user_link": "/personal_pages/user/59293",
            "votes": "0"
        },
        {
            "answer": "I have just found out that I have a bicornuate uterus and I am about 6 weeks pregnant.I found out during an internal ultrasound scan because last year, I had a miscarriage at 11 weeks.What is so weird is that it has not been diagnosed before. When I was 17 I had scans to check for endemetrosis.I have a beautiful three year old daughter who was born naturally 2 days before her due date after a 3hour 45 minute labour using only gas and air. I had a problem free pregnancy and she was head down from 32 weeks.This time, I keep repeating to myself \"I am building a strong healthy baby who wil be born in late August/early September\"Good luck to you all who are also bulding strong healthy babies.",
            "post_id": "1091392",
            "timestamp": "1073628000",
            "user_id": "user_59747",
            "user_link": "/personal_pages/user/59747",
            "votes": "0"
        },
        {
            "answer": "So glad I found this site. I am 19 weeks pregnant after being told I would not conceive due to polycystic ovaries and bicornulate uterus. At 6 wks pregnant and totally unaware that I was, I recieved a nasty beating by my now ex partner, I dare say I am very lucky to be 19 wks pregnant!!  My problem is that no-one has explained bicornuate uterus to me. All I have been told is not to worry as nothing can be done about it? I can except this but would really like to know a little of what to expect what possible complications I may encounter and what to look for and take note of! Can anyone help please?",
            "post_id": "1091428",
            "timestamp": "1073628000",
            "user_id": "user_59728",
            "user_link": "/personal_pages/user/59728",
            "votes": "0"
        },
        {
            "answer": "I too had a hystersalpingogram back in Nov. following the termination of my first pregnancy (after trying for 1 1/2 years)It was ectopicI found out I had a bicornuate uterus and my doc told me not to worry and to just keep trying.  What I want to know is if there are any positions or anything that help someone with a bicornuate uterus to conceive.L.",
            "post_id": "1091627",
            "timestamp": "1073887200",
            "user_id": "user_59821",
            "user_link": "/personal_pages/user/59821",
            "votes": "0"
        },
        {
            "answer": "At last I have found somewhere where other ladies have this condition!  I was diagnosed 2 weeks ago, initially with PCOS (Polycustic overies) which just confirmed what I thought,  but then my doc also said the I had a 'split' in there and I was heart shapped.  HE did not tell me what the condition was called or much about it - and I was too shocked to ask!  He has referred me to a specialist but I am awaiting for an appointment.Me and my partner are desperate for a baby - we have been trying since last xmas and niavly thought it would happen pretty quickly!My biggest fear is to never be able to have a child.  I have always been very maternal and known that I wanted children from a very young age.  Now I've finally met the right man and am ready for a family, I find that I may not ever have one!It's very scary because it's all inside.Anway, I shall mark this page and hopefully share experiences with you all.I envy all of you who are carrying special packages ;) but really I do wish all of you the very very best.Take CareNyk x",
            "post_id": "1092133",
            "timestamp": "1074405600",
            "user_id": "user_60376",
            "user_link": "/personal_pages/user/60376",
            "votes": "0"
        },
        {
            "answer": "Hello, everyone.  I too have a bicornuate uterus and am 36 weeks pregnant.  I also have two cervixes.  My baby is in the frank breech position, so I will most likely have a scheduled C-section.  But, what I really wanted to share with you is that a lot of times when women have bicornuate uterus they also have KIDNEY anomolies.  I found out that I only have my right kidney!  Which of course, you can live with only one kidney, but it sure is important to know if you only have one.  If something happens to my kidney(God forbid), I would have to have a donor transplant and/or live on dialysis for the rest of my (I'm sure short) life!  So find out ladies...it's important.  Good luck to all of you!",
            "post_id": "1092178",
            "timestamp": "1074405600",
            "user_id": "user_60520",
            "user_link": "/personal_pages/user/60520",
            "votes": "0"
        },
        {
            "answer": "I was also diagnosed with bicronuate uterus.  I was told the uterus is split all the way and the baby is on the right side.  How can the baby grow only on one side?  Will this baby make it or not since it has little space to grow.  I am so confused and I NEED ANSWERS.  The doc told me everything looks fine so far but won't tell me anything else.  I need to know.  how can the baby grow only on one side.  Can it push the wall out of the way and go to the left side?  Someone help!",
            "post_id": "1094416",
            "timestamp": "1076997600",
            "user_id": "user_62793",
            "user_link": "/personal_pages/user/62793",
            "votes": "0"
        },
        {
            "answer": "I have a bicornuate uterus and I am 8 weeks pregnant.  My uterus is split all the way.  The baby is growing only the right side.  Can someone explain to me how the baby is going to grow only on one side and whether it will survive such little space.",
            "post_id": "1094417",
            "timestamp": "1076997600",
            "user_id": "user_62793",
            "user_link": "/personal_pages/user/62793",
            "votes": "0"
        },
        {
            "answer": "I just wanted to give others with a bicornuate uterus a glimmer of hope. With my first pregnancy, I had a miscarriage at 13 weeks. However, my second and current pregnancy is going great. I am 34 weeks pregnant today. My baby is in the right horn which is obvious if you look at my stomach. The right side of my stomach protrudes out much further than the left side. My pregnancy has had some complications(i.e., spotting, contractions, bedrest) but through careful screening and 400mg of prometrium daily since my 5th month of pregnancy things are going better than planned.For all of you who have a bicornuate uterus, do not give up hope. I have made it farther than my doctors ever thought I would make it. My baby's weight has been estimated through ultrasound to be over 5 pounds.From this point on whenever he decides to come he should do great. I will keep you posted on my progress. I just felt compelled to share my good fortune and offer hope to others with this condition.",
            "post_id": "1095859",
            "timestamp": "1078984800",
            "user_id": "user_64769",
            "user_link": "/personal_pages/user/64769",
            "votes": "0"
        },
        {
            "answer": "I just wanted to give others with a bicornuate uterus a glimmer of hope. With my first pregnancy, I had a miscarriage at 13 weeks. However, my second and current pregnancy is going great. I am 34 weeks pregnant today. My baby is in the right horn which is obvious if you look at my stomach. The right side of my stomach protrudes out much further than the left side. My pregnancy has had some complications(i.e., spotting, contractions, bedrest) but through careful screening and 400mg of prometrium daily since my 5th month of pregnancy things are going better than planned.For all of you who have a bicornuate uterus, do not give up hope. I have made it farther than my doctors ever thought I would make it. My baby's weight has been estimated through ultrasound to be over 5 pounds.From this point on whenever he decides to come he should do great. I will keep you posted on my progress. I just felt compelled to share my good fortune and offer hope to others with this condition.",
            "post_id": "1095860",
            "timestamp": "1078984800",
            "user_id": "user_64769",
            "user_link": "/personal_pages/user/64769",
            "votes": "0"
        },
        {
            "answer": "I also have a bicornuate uterus. At least my doc thinks so - I haven't had a HSG so it could be septate.  I have had two miscarriages both early (4-6 wks.).  I was going to have the HSG done to see if I needed surgery when I found out I was PG.  Now I am almost 8 wks. and hopeful but scared.  They say my uterus splits almost all the way down to my cervix.  It's so hard to find information about this and I just need someone to talk to.  My baby is also in the right horn at the top which they said is good but I want to know how much my uterus will strecth.  Also, I am worrid about an incompetent cervix b/c they say it is more common with this along with birth defects.  It seems like so much to worry about.  All I want is a healthy baby!!  Many of your stories give me more hope.  I'll be praying for those of you with the same worries.",
            "post_id": "1096482",
            "timestamp": "1079676000",
            "user_id": "user_65506",
            "user_link": "/personal_pages/user/65506",
            "votes": "0"
        },
        {
            "answer": "After 3 miscarriages, they finally discovered that I have a bicornuate uterus.  I was devistated when the doctor at the ER made it sound like I would never have children.  I did some research and found out that there is treatment for it and that lots of people have children even without treatment.  I went in for a saline ultrasound and the doctor said that there is a wide separation.  I go to a specialist the end of this month.  I'm pretty nervous about that.  Anyone have the surgery?  I miscarried twins in 2001 and it almost killed me.  I lost way too much blood.  The last miscarriage in October wasn't as bad even though I still lost a lot of blood.  Normal I guess.  My doctor told me that I was not able to get pregnant again until after the surgery because of how it went with the twins.  He's afraid it might really kill me the next time.  I don't know.  It seems like the more I read the more I read bad information.  Info that scares me.  I would really like to hear from someone who has the same problem as I do and hear that it's not all bad and that I will eventually have my children.  What causes a bicornuate uterus?  Does the wide separation sound like it's still a bicornuate or more like a Uterine Septum?  What do ya'll think?Email me if you want at ***@****.Victoria",
            "post_id": "1097683",
            "timestamp": "1080799200",
            "user_id": "user_66568",
            "user_link": "/personal_pages/user/66568",
            "votes": "0"
        },
        {
            "answer": "HI I HOPE YOU GET THIS POST.... ahve a bircorante uterus with a side split too and i have had sevreal m/c's BUT I'm pregnant now with a healthy baby girl. I'm almost 24 weeks... ihave had no problems at all with this pregnancy.... so don't give up. lot s of women have healthy babies with normal pregnancies... a bicornate uterus is a birth defect... when you were foeming in your mother you 2 body halves fused so to speak and came together... like your lungs and heart and all that... but your uterus didn't. this what one Doc told me... he seemed to know what he was talking about.. and it's the only answer i have gotten. It can be repaired... with surgery... but it's major major surgery and my current Doc spoke with a specialist and he wouldn't do it... so i jsut beleived God to have this baby and he's the One who creates life anyway... so i jsut bypassed the Doc... yours could be a septum or bicornate... an MRI is the only way to really know for sure...and hsg cannot determine which one it is only that's it's split. if it is just septate... it s very easy to fix and will be outpatient surgery!! Of course mine wasn't... but anyway i don't think youcan tell by the size of the split... but i could be wrong...jsut don' t give up... Hope",
            "post_id": "1097995",
            "timestamp": "1081227600",
            "user_id": "user_67084",
            "user_link": "/personal_pages/user/67084",
            "votes": "0"
        },
        {
            "answer": "Please don't be disheartened by this,although I know it's hard not to. My daughter was 17 years old when she had a miscarriage,had yet another miscarriage and they discovered she had a bicornate uterus. In her case, the babies never developed a heartbeat and her hormone levels continued to drop,so they did a chromosone test which came out okay,they told her it would happen when the time was right. The third time she became pregnant, she had made a Dr. appt to get the Depo shot and they did a sonogram ( she has several fibriod tumors ). The Dr then said to us, \"gee, I don't know how to tell you this, but you're 51/2 weeks pregnant. See, there's the heartbeat. She was so terrified at that point of losing another one that she would not even acknowledge the pregnancy for fear of losing it with no explanation. The result was a breech birth C Section at 34 weeks of a beautiful baby girl. She needed to learn to breathe a little bit on her own, but she was very healthy. That is the only thing she has to worry about is breech birth and prematurity, but medicine is advanced enough today, that although it can be scary, you don't have to worry too much.",
            "post_id": "1098456",
            "timestamp": "1081746000",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "I too have a bicornate uterus.  In my 20's I had 2 (possibly 3 m/c), then we discovered the bicornate during my first successful pregnancy (in 1995) - it was heart-shaped back then.  But after 2 more m/c we had an HSG test and it is now Y shaped with only a small connecting point at the bottom. In 2002 I had a son who grew entirely in the right horn - I was seeing a very good high-risk OB who said that his only concern was that the single horn wouldn't stretch out as much as normal uterus, so he was worried about pre-term labor.  And although I had a few \"episodes\", they always got the contractions stopped and I ended up carrying 38 weeks and had an 8.5 lb boy!I had 3 more m/c last year but am currently 10 weeks pregnant with TWINS, one in each horn ... again my OB is primarily concerned with pre-term labor but doesn't seem unduly alarmed.So in total this is my 10th pregnancy and I've had 7 miscarriages (all quite early), but if you're willing to go through it, you can have a housefull of kids :)",
            "post_id": "1098875",
            "timestamp": "1082091600",
            "user_id": "user_67828",
            "user_link": "/personal_pages/user/67828",
            "votes": "0"
        },
        {
            "answer": "My daughter was diagnosed with a bicornate uterus at age 9...a fluke while doing an ultrasound for a cyst.  The docs told us to wait till she is older to do the HSG thing.  I was actually in the room during the ultrasound.  From what I remember seeing, they looked like two separate chambers.  Does anyone know: 1) Are the two chambers a better or worse scenario for pregnancy later in life? 2) Is the HSG a dangerous procedure? and 3) Should an MRI also be done?  I would appreciate any help you could provide to a mom who is worried about her daughter's future.  Kristi",
            "post_id": "1689018",
            "timestamp": "1186385729",
            "user_id": "user_245037",
            "user_link": "/personal_pages/user/245037",
            "votes": "0"
        },
        {
            "answer": "Hi i am an 18 year old that just found out that i was  5 weeks and 4 days pregnant. but there is no way that is possible because my boyfriend and i counted back and we werent trying then at all. could the hospital be wrong? I ended up at the hospital because a bad stomach ache that ended up being a uti.. and they did a vaginal ultrasound and told me minutes later my uterus was split completely in half. i havent been to the gynecologist yet b/c we cant get in yet. but the baby is on the right side. i didnt know it was common at all i thought i was some kind of freak. Its really scary to not know what to expect and to talk to people about it when no one has ever heard of it. I want to know why it is like that and what to expect. If someone could help me out it would mean a lot to me. thank you!",
            "post_id": "1758152",
            "timestamp": "1187235955",
            "user_id": "user_252806",
            "user_link": "/personal_pages/user/252806",
            "votes": "0"
        },
        {
            "answer": "When counting your pregnancy, remember that doctors are likely counting that 5 weeks, 4 days from the beginning of your last period, not the \"event\" that lead to conception.If you have two complete uteruses, the term is generally called \"uterus didelphys\". Here is how the Mayo Clinic describes it:\"In a female fetus, the uterus starts out as two small tubes. As the fetus develops, the tubes normally join to create one larger, hollow organ — the uterus. Sometimes, however, the tubes don't join completely. Instead, each one develops into a separate cavity. This condition is called double uterus (uterus didelphys). Each cavity in a double uterus often leads to its own cervix. Some women with a double uterus also have a duplicate or divided vagina. Double uterus is rare — and sometimes not even diagnosed. According to one estimate, double uterus occurs in 2 percent to 4 percent of women who have normal pregnancies.\"It happens very early in the womb. Often, there are some other issues associated with it too, which include kidney or gallbladder (?) issues, so you might want to have the checked out.It's a pretty rare condition (it's more common to have a bicornate uterus -- one uterus divided into two, rather that two seperate ones). It does come with some possible complications -- c-sections are more common 'cause the babies have little room to mover around and are often breech; sometime preterm labor. The uterus has an amazing capacity to stretch, so it's even possible that everything will go completely smoothly. I have the same thing and had one perfect little boy and am expecting another in April.Good prenatal care is essential -- especially if your little one might come into the world a little early -- so make sure you get into your dr asap, tell them of your diagnosis, and start taking the prenatal vitamins.Hope that help.  Good luck!  And don't worry, you have a rare condition, but there are a lot of people out there with the same thing!",
            "post_id": "1801780",
            "timestamp": "1188266159",
            "user_id": "user_255502",
            "user_link": "/personal_pages/user/255502",
            "votes": "0"
        },
        {
            "answer": "In 1974, after miscarrying 6 times at the 4-8 wk gestation, I finally stayed pregnant...until I was at 20 weeks, then I lost my little boy.  Because this was \"back in the dark ages\", I thought I had done something wrong, and thought it was all my fault.  For 11 years I lived with the thought that I was at fault.  After my 8th and last pregnancy, (I had a tubal pregnancy) and ultimately had a tube removed, and the other tube ligated.  During menopause,   my doctor did an ultrasound in her office and found something unusual.  she had be go to the hospital for a laproscopic exam under anesthesia and found that I have a bicornate uterus with two horns.  I was so elated, so joyous to know that my miscarriages were not my fault!  Although I have no children of my own, I find that I have many \"nieces and nephews\" who know me as \"Auntie\".    Be strong, God knows there is a place for your nurturing side and will provide.Auntie Louise",
            "post_id": "1804577",
            "timestamp": "1188340555",
            "user_id": "user_262268",
            "user_link": "/personal_pages/user/262268",
            "votes": "0"
        },
        {
            "answer": "I am so glad to hear that I am not alone with having a bicornate uterus.  I was 11 weeks pregnant and found out that I miscarried.  After having an ultrasound in the ER and a follow-up ultrasound, I was told I had the bicornate uterus.  All my doctor told me was that I had a higher risk of miscarriage and premature labor.  He didn't say much else.  I am scared to death that I am not going to be able to carry a baby.  Does anyone know of any websites that gives information on it?  I have heard many rumors and don't know if they are true...C-Section usually occurs with most births, possibility of bed rest, possibility of twins...I just don't know what to expect.  It broke my heart when I lost this baby and don't want to have to go through that again.  My husband and I want to start trying as soon as possible, my doctor says I should wait until my first cycle.  I am VERY impatient :)  Any advice would be appreciated.",
            "post_id": "1860754",
            "timestamp": "1189038306",
            "user_id": "user_269879",
            "user_link": "/personal_pages/user/269879",
            "votes": "0"
        },
        {
            "answer": "Hello everyone, I just found out today that I am Pregnant and I have a Bi-cornuate womb. I had a miscarriage 7 years ago. (thats when I found out about my womb) It was really painful and I was in hospital for a long time and very unwell. I wasnt with the best of boyfriends then either. 5 years ago I met David and we fell in love, I told him about my womb and he was fine, it just that I haven't wanted to get pregnant since that awful experience I am just really worried about this time and I acually cried instead of being happy today. I am now 27 I was alot younger then and wondered if the womb changes at all over the years? Should I go straight to my Doc's?  I just dont know what to do and I am scared.I am glad that there are other women out there so we can chat and support each other.",
            "post_id": "1923544",
            "timestamp": "1190820901",
            "user_id": "user_285681",
            "user_link": "/personal_pages/user/285681",
            "votes": "0"
        },
        {
            "answer": "the womb wont change. i am two days away from being 18, i had my daughter 4 months ago and they couldnt tell that i had a split uterus until they did an emergency c-section. my little girl...Riley...was born at 32 weeks, breech and was 4lbs 7 ozs and now she weighs 11 lbs. i can't keep it off my mind about my uterus it is something that haunts me every day me and my husband want more kids and today we found out that there is hope out there for those with split uterus' there is a surgery clinic that is Lubbock Texas and they can fix it. i was so relieved when i found this out. things look scary but things will shape up i promise. the number for that clinic if anyone is interested is (806)743-4256.",
            "post_id": "1925946",
            "timestamp": "1190857514",
            "user_id": "user_286230",
            "user_link": "/personal_pages/user/286230",
            "votes": "0"
        },
        {
            "answer": "I just found out today that I have a bicornuate uterus. I am 30. I have tried 2 IUI's and am trying the 3rd next week. If it doesn't work, I will try an IVF in January. I will find out on Monday to what degree my malformation is. I was so shocked. Whoever heard of this? Not me. There is so much scary information out there. I would be absolutely crushed if I miscarried. I don't know what is worse. Not having ever conceived or losing it. Right now it is a toss up. I get extremely depressed after each failed attempt. I can't imagine losing a child. It is hard to get out of bed somedays.",
            "post_id": "1929932",
            "timestamp": "1190947264",
            "user_id": "user_287178",
            "user_link": "/personal_pages/user/287178",
            "votes": "0"
        },
        {
            "answer": "My doctor sent me for a scan last week because my periods are getting really painful.  The scan results suggested a bicornuate uterus with a 13mm edometrium at the right horn and 11mm at the left.  Apparently I also have a fibriod too.  I don't know how heart shaped or split my uterus is - does split mean the same as bicornuate?  Anyhow I just wanted to tell you that I'm 44 and this is the first I've heard of it.  I have 3 strong and healthy sons (18,16 & 10)- all born full term and perfect.  I don't think I have had any miscarrages and there were no complications during pregnancy.  My first two sons were born face up though - do you think that could have been caused by the shape of my uterus?  Can anyone tell me more about the kidney and bladder situation - funny thing is I've been getting a few twinges in my right hand kidney area - I had put it down to old age and/or too many adult beverages.",
            "post_id": "2242829",
            "timestamp": "1197912590",
            "user_id": "user_364238",
            "user_link": "/personal_pages/user/364238",
            "votes": "0"
        },
        {
            "answer": "Gosh these things are soo complicated!  It may be that you have a didelphic uterus like I do.  When will you get another scan done?",
            "post_id": "2243027",
            "timestamp": "1197915462",
            "user_id": "user_271130",
            "user_link": "/personal_pages/user/271130",
            "votes": "0"
        },
        {
            "answer": "hi i found out 3 years ago that i have a bi-cornuate uterus..i was 19.i found out because my son had to be born by c- section at 35 weeks.he weighed 31b 110z. he was born early by (elective) c-section and was so tiny because he has cornelia de lange syndrome (a rare and unrelated genetic disorder causing severe disability), he is happy and relatively healthy...i am worried becuase nothing was explained to me. we are trying for another baby but have had trouble conceiving as my husband has DE (delayed ejaculation). to make things worse i miscarerried 2 weeks ago at 4 weeks.im panicking because i think i will never have another child. is the only reason i carried my son beacuse his syndrome makes him so tiny anyway...i am so down....i also feel guilty because i already have an angel son who lights up my life and i know that many women have trouble just having one...i feel terrible about worrying about a second (well third) pregnancy but i cant help it...i guess im here to chat to others who feel the same.i wish everyone out there well and know that good things will happen for you xxx",
            "post_id": "2632647",
            "timestamp": "1205318257",
            "user_id": "user_447786",
            "user_link": "/personal_pages/user/447786",
            "votes": "0"
        },
        {
            "answer": "I just found out that I have a bicornuate uterus.  My husband and I have been trying to get pregnant for 3 months now.  My period came 2-3 days early this month and only lasted for 1 day.  I am now lightly spotting.  I took a pregnancy test and it had a faint positive.  Could I be pregnant or miscarrying?",
            "post_id": "2727879",
            "timestamp": "1207157422",
            "user_id": "user_468745",
            "user_link": "/personal_pages/user/468745",
            "votes": "0"
        },
        {
            "answer": "Hi there,Go have a blood test. I to have bicornuate uterus + two cervix, we just completed our second round of IVF, we had the embryo transfer on Monday, we hope this time luck is on our side...Good luck to you...",
            "post_id": "2730399",
            "timestamp": "1207191279",
            "user_id": "user_252847",
            "user_link": "/personal_pages/user/252847",
            "votes": "0"
        },
        {
            "answer": "First, I have to share that it is curious that this msg forum started on Dec 4., the day I was born. I just find out today by an ultrasound that I have a bi-cornuate uterus involved by 3 fibroids. I went to the doctor, because I’m having all the symptoms related to uterus fibroid and that’s how I also find out of my heart uterus. I’m 37 yrs old and it seems having a baby it is not a good choice for us right now.I have learned that under God wills is the best way to live. And even when I’m a little scare I also feel his blessing and that a good purpose He have. I'm confident that everything is going to be fine, so therefore what ever happens I just wish is under God will!!I pray the Lord to provide:all of us with the wisdom, courage and peace we need;our husbands with the strength and patients to encourage us, cause it is also difficult for them;the little angels that are about to come with the health and life they all deserve; andour doctors with the wisdom and kindness to treat us for His Only Glory!!!Most of you in this forum have already given birth to your babies; I wish you are all in peace and good health.We should all embrace life by giving Our Life testimony to others.God Bless You All!!!",
            "post_id": "2765759",
            "timestamp": "1207884736",
            "user_id": "user_477079",
            "user_link": "/personal_pages/user/477079",
            "votes": "0"
        },
        {
            "answer": "I also have a bicornuate uterus (heart shaped)  I found this out in my early 20's after I fractured my uterus in Naval boot camp, (I was 24).  The Doc sais I wiuld never get pregnant and if I did I would probably miscarry.  I was devistated.  I have always wanted to be a mom.  Well my husband and I got pregnant with our first son, I was about 3 and 1/2 months along and I started heavy bleeding for about 2 weeks.  The baby was fine.  I did have pre-term labor for almost the entire pregnancy and about 34 weeks along I was having contractions but my obgyn said they were only 10 mins apart, I kept going to the hosp and they would monitor my contractions and still they were 10 mins apart and I'd be sent home. I was complaining of severe back pain in the tail bone area.  I went back to my obgyn and asked for an u/s to check on the baby but he just said it was scheduled for the next week, and sent me home, I could hardly walk b/c my contractions hurt so bad, I went back to the hosp the next day, I was in full labor, actually, I had fully dialated to a 10 at home and by the time I got to the hosp, I was ready to push, my obgyn broke my water, but no baby was coming out and by that time I was about to jump off the table from labor pain, they FINALLY did an u/s and discovered he was breech, so I had to have an emergency c-sec.  I was disappointed but our son was feet first.  He was a 35 weeker and weighed 4 lbs and 1 oz.  No problems exceot jaundice and couldn't regulate body temo to room temo so he was in the hosp for about a month.  No developemental delays.  He did have increased tone (tight muscle tone) so he had occupational therapy for a couple of months and he was fine.  walked and crawled at reular times.  I got pregnant 7 months later w/ our 2nd son and my water broke at 29 weeks, I had to stay in the hosp a week and by the end of the week, my placenta started to tear loose so another emergency c-section, we were already expecting that.  So he was a 30 weeker and weighed 3 lbs 14 oz.  No problems except for jaundice and not being able to keep body temp at room temp, so he had to stay in the hosp for almost a month.  No developemental delays.  That same obgyn recommended we not try for another baby for about 5 years to allow my body to completly heal, well, oops!  we got pregnant again about 2 and 1/2 years later with our 3rd son! and I switched obgyn's b/c I didn't think the last one was doing all he could to check for pre-term labor fluids or enough u/s to make sure of the position of the baby, well our 3rd son was born at 37 weeks and he weighed 5 lbs and 9 oz.  No problems except for a tiny bit of jaundice and he pretty much kept his bodt temp at room temp, so she went home with me.  Now I am pregnant with our 4th baby.  I am only 13 weeks so we don't know the sex yet but we are hoping for a girl.  I am also hoping for a vbac.  I am not able to use my last obgyn but I am hoping my new one will be ok with it.  I hate the epiduar/spinal block so I am really going to try to weigh my options.  I do have lots of scar tissue from the three previous pregnancies and I have not lost the weight from my other three pregnancies, but I am pretty much healthy, so I am going to attempt a vbac.  I just know that I was told I would never get to be a mom and now look, I have three healthy boys and another on the way, I did bleed with this one a little but it stopped and was a lot less than my first pregnany.   I do know that women with bicoruate uterus' are higher risk then others but only slightly, do your research and weigh your options and talk to your obgyn to do the same, then make sure you are a good candidate for vbac. Sorry for such a long story, just thought some one out there might like to know they are not alone and having healthy babies with this type of uterus is posible.  God bless you!RM136",
            "post_id": "2774408",
            "timestamp": "1208106325",
            "user_id": "user_479098",
            "user_link": "/personal_pages/user/479098",
            "votes": "0"
        },
        {
            "answer": "Im 17 and Im 21 weeks preganat. At the begining the doctors told me i may not make it 12 weeks but i proved them wroung.i was so0o0o0...scared but, my family and friends were always letting me know everything was going to be ok.i was told to take it easy stay in bed and eat so the baby grows. i loved it ! who would'nt ?!? i felt like i could run miles but they all made shure i had no where to go or nothing hard to do, i hated being useless! now the doctor dosent really watch me or see me that much anymore but i still have to be carefull. its scary but its your body and i know how much i can handle and i always take it easy anyway im lazy so0o0o0o....just milk every bit of bedrest you can.-nikki",
            "post_id": "2776910",
            "timestamp": "1208155407",
            "user_id": "user_479701",
            "user_link": "/personal_pages/user/479701",
            "votes": "0"
        },
        {
            "answer": "It was good to know your story, it really give me a lot of hope. On this Thursday Iam going to do some xRay exams: hysterosalpingogram and hysterosonogram. My obgyn wants to make sure about the condition of all the other organs: fallopian tubes, ovary, etc... also to know about the form of the bi-corneous.Do your obgyns were specialist in high risk? How old were you when you had your first babe?God Bless Your Family",
            "post_id": "2786098",
            "timestamp": "1208317971",
            "user_id": "user_477079",
            "user_link": "/personal_pages/user/477079",
            "votes": "0"
        },
        {
            "answer": "I am 34 years old and have a bicorn uterus and am 30 weeks pregnant with child #3.  When I found out I had a bicorn uterus, I had just become pregnant with my first child who is now 6.  It was the ultrasound doctor who found the bicorn uterus.  My, (at the time) OBGYN, was claimed one of the best in the country here in Boston, (per all the awards in her office) and upon our first visit with her at 10 weeks, she couldn't find a heartbeat and made an assumption that the baby didn't survive and that i go over to ultrasound to find out what was going on.  My husband and I were so upset walking out of her office, first child and all.  We get to ultrasound, meet the doctor there and she takes a look and sees that i have a bicorn uterus and finds the embryo, heart beating away!  Come to find out my OBGYN had been listening for a heart beat in one horn (not knowing I have a bicorn) and the baby was in the other horn.  Not sure how she could miss this as my stomach wasn't the size of a small island..move the stethoscope around!   Needless to say, the OB with all the merits is not my doctor anymore,...not just because i felt she was incompetent in finding the heartbeat, but mainly due to her lack of bedside manner after telling me the pregnancy was basically a miscarriage.It is also common for woman with a bicorn uterus to only have one kidney.  At the time of my first ultrasound, (trying to find if I was still pregnant or not), i made the doctor aware I only had one kidney (I found that out when i was in third grade) and she told me that it was very common to see that.  Something for those with bicorns to find out (whether they have one kidney or not) in case you ever take a bad back fall (like i did skiing in third grade) where it was found out that i only had one kidney and i was lucky i fell on the other side my kidney was on.Back to bicorns...My first child and my second child both implanted on the right horn and both children came at 38 weeks, on the dot.  My daughter now 6, was 7lb, 11 oz and and my son now 2, was 7lb 6 oz.This third baby, another girl, has implanted in the left horn and I was scared that maybe it wouldn't take, but after 30 weeks, things do look great!I have been trying to find info on the percentages of bicorn that deliver early and is it likely that my third child will come early as well or will I go full term?  i can't find these stats anywhere.  My OB tells me it is likely I will go around the same time, (38 weeks) but I wonder if since it is in the other horn, will I go earlier or possibly later than 38 weeks?  It seems that many women I have read about only carry to their 34/35 week.  interesting.I wish all the women trying to conceive with bicorns the best of luck.  I just wanted everyone to know that it can happen and there aren't always complications.  I read so many things online about bicorns and things that scared me to death.  There are outcomes with happy endings!!  Make sure your doctor is well versed with bicorns (it is considered a high risk pregnancy) and keep reading the positive outcomes that are online.  I find that there seem to be more good outcomes than there are bad.",
            "post_id": "2842259",
            "timestamp": "1209470887",
            "user_id": "user_494003",
            "user_link": "/personal_pages/user/494003",
            "votes": "0"
        },
        {
            "answer": "My first ultrasound at 8 1/2 weeks showed that I have a bicornuate uterus, although they could not tell me to what extent.  I am currently 20 weeks pregnant and have not had any complications at all. So far so good so I'm keeping my fingers crossed. I have been feeling the baby move a lot but always on the right side.",
            "post_id": "3050497",
            "timestamp": "1213743751",
            "user_id": "user_538767",
            "user_link": "/personal_pages/user/538767",
            "votes": "0"
        },
        {
            "answer": "I'm in floods of tears after reading your post, what a brave kind lady you are xxI have suffered 3 miscarriages and been told that I have a bicornuate uterus. I'm just going through investigations at the moment I've been told that I have to have a laproscopic exam next month to see whether my Consultant can shave the septum or not. I really don't want to have to have more surgery but I don't want to be thinking in 20 years time what if? At least the medical team are listening to me now and I'm getting the help that I need.Thanks for your post.",
            "post_id": "3171079",
            "timestamp": "1216390589",
            "user_id": "user_564773",
            "user_link": "/personal_pages/user/564773",
            "votes": "0"
        },
        {
            "answer": "I would just like to say that I carried my 1st son to 39 weeks and 6 days and never knew that i had a bicornuate uterus that is completely split into two.  I was diagnosed with the bicornuate uterus at 5 weeks pregnant with my 2nd child so I am living proof that u can have a normal healthy baby.  I havent had any miscarriages and am praying that my 2nd pregnacy is normal and healthy.",
            "post_id": "3295685",
            "timestamp": "1219094047",
            "user_id": "user_593431",
            "user_link": "/personal_pages/user/593431",
            "votes": "0"
        },
        {
            "answer": "I found out I have a bicornute uterus with my first child.  My water broke at 29 weeks.  My doctor, however, was able to keep me pregnant for 5 more weeks (during which time I was in the hospital) and I delivered at 34 weeks.  Happy healthy baby boy!  He did spend some time in the NICU, and was born at 4 lbs... but you would never know it now!  Now I am pregnant with my 2nd (after a miscarriage in between) and praying every day that this one makes it!  I understand where you are all coming from.  Its unfortunate that this condition has to take some of the excitement out of pregnancy that most moms get to experience.  We have to pay attention to every little detail and walk on eggshells every day!  I would like to leave a bit of advice to all of you ladies out there that are pregnant with a bicornute.  If you sense ANYTHING at all is wrong... go immediately to the hospital.  When I felt something was wrong, I called the nurse, and she advised me to wait it out and that it was normal.  Trust your intuition!  I did... and despite her telling me that, I went in because I just had \"that feeling\".  After several (and I mean SEVERAL) tests, they ended up admitting me.  Always trust your intuition!  You know your body, they know statistics.  Not to say they dont know what they're talking about... but until they can see you and run tests on you, they can't say for sure that what is happening is normal.",
            "post_id": "3357707",
            "timestamp": "1220423138",
            "user_id": "user_608472",
            "user_link": "/personal_pages/user/608472",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with a bicornuate uterus when I first became pregnant when I was 17, a senior in high school, and I carried my daughter up until 1 week to my due date,( 2 months after graduation) where they had to induce her because I was having gullbladder trouble. She was 8 lbs 5 oz, 21 1/2 inches long, and PERFECT. I never bled, never cramped, I was truly blessed by the deities! I am now 22, and just found out that I am 5 weeks pregnant. The only two times I have gotten pregnant, then at 17, and now at 22, I cast the same fertility spell, and both times only 2 months after I cast them, I found out I was pregnant. Many people don't believe in what I believe in, but from all of the tragic stories, pain, and suffering I have heard from the other beautiful women who have the same issue, I feel this was absolutely some kind of divine intervention. I feel that no matter what faith you carry in your soul, as long as you have faith in something, and you always try to be the best person you can be, things will work out as it should. We must all go through trials and lessons of life, but it is all well worth it when we hold a new born life in our arms, and to feel how amazing it is to know that you created that life. I hope you will all be blessed in the end, to have a beautiful healthy child, or children. Blessed be!!!  -Cierra",
            "post_id": "3455738",
            "timestamp": "1222453168",
            "user_id": "user_632371",
            "user_link": "/personal_pages/user/632371",
            "votes": "0"
        },
        {
            "answer": "hello i am 6 weeks pregnant and i found out in 2005 that I have bicornuate uterus.  I was only 8 weeks pregnant when i had  a miscarriage.  Now, 3 years later my husband and i just found out i'm 6 weeks.  However after going to my doctor every week yesterday i found out that my hcg levels have dropped so friday i'm scheduled to have a d&c.  Of course i cried but we are not giving up god does everything for a reason.  Hopefully in 2 months we will some good news.",
            "post_id": "3501242",
            "timestamp": "1223408245",
            "user_id": "user_643669",
            "user_link": "/personal_pages/user/643669",
            "votes": "0"
        },
        {
            "answer": "Thanks to whomever started this forum so we all can share our feelings here - its been great reading the entries and feeling understood. My husband and I were 12 weeks pregnant w/ our 1st child when we went to the dr.'s office to hear our baby's heartbeat on July 7th. Long story short... we instead found out that (1) I had suffered \"missed abortion\" (miscarriage w/out knowing); (2) I had been pregnant with identical twins; and (3) I had a bicornuate uterus. We were crushed, and I was scared b/c my sister's friend has a b/c uterus and has miscarried numerous times. During my pregnancy I didn't have any spotting, but did have some mild cramping and was very sick most of the time ( I think due to carrying twins), but had no idea I had even miscarried.  We've decided to take a break trying again until after my HSG appt. this month.... so we'll see how severe my septum is I suppose and go from there.My obgyn told me a b/c uterus can be surgically corrected in some situations... does anyone know if that's true?  I'm scared to try again for fear of another miscarriage, but my dr. also told me because I had this condition AND twins, a single pregnancy would most likely be successful even with bicornuate uterus.  Has anyone else w/ this conditions carried twins successfully?  Please let me know.  Thanks and best of luck to everyone!",
            "post_id": "3583970",
            "timestamp": "1225164681",
            "user_id": "user_664454",
            "user_link": "/personal_pages/user/664454",
            "votes": "0"
        },
        {
            "answer": "i have a 22 month old son and when i got pregnant in may of 06 i didnt know what i was in for but the doctor didnt know what it was at first and i went into labor when i was 30 weeks and my baby wasnt anywhere near ready to come and they said he had a 40% chance of living if he came then and it took them 6 hours to slow it down and a day to stop it completly and then i was put on pills to stop my contractions untill i was 36 weeks and i went into labor that friday saturday and sunday and i had him tuesday morning and the doctor told me after my c-section that my uterus was bunny eared shaped and he didnt tell me much else except that if i could get preg again that i probably wouldnt carry it to term and i dont know if it is this bicornuate uterus or what and i dont really know much about it so i jut wanted a little more info",
            "post_id": "3616893",
            "timestamp": "1225842128",
            "user_id": "user_672142",
            "user_link": "/personal_pages/user/672142",
            "votes": "0"
        },
        {
            "answer": "I am presently miscarrying and after 2 miscarriages resulting in D&C's  7 weeks and 11 weeks and possibly 2 very early natural miscarriages I am just now being told that I have this problem and that my current pregnancy of 5 1/2 wks gest is now miscarrying. No one had ever told me. The good news is that I did have one successful pregnancy. She did come very early - water broke at 23 weeks and C-Section at 25 weeks after getting a fever. They opted to keep her in as long as possible with steroid shots given to me. She is now 8 and very very healthy. She did need breathing help for a few months but other than that, she was fine. When they told me she was on the \"side\" I simply thought she was laying sideways and made not much of it. They never used the correct term or explained it. When I asked why I miscarried, they said no particular reason. This new doc, I am def sticking with. I have decided to not try anymore but that is because I have one healthy child. If not, I might still try again. Best of luck and just wanted to give others hope!",
            "post_id": "3887440",
            "timestamp": "1232252301",
            "user_id": "user_739308",
            "user_link": "/personal_pages/user/739308",
            "votes": "0"
        },
        {
            "answer": "I am 39 and pregnant with my first at 35 weeks and live in the UK.After one m/c 2.5 years ago at 9 weeks they discovered a heart shaped uterus. Had tests (USG, MRI) which confirmed \"no septum\" which was relief for me as I would have been terrified re waiting for surgery on a septum, hence glad it was a \"truly\" b/c u.At 9wks I had some spotting then at 13+4w a threatening of miscarriage, with blot loss of about 500ml, clots, heavy cramps and a 7x4 cm haematoma which looked to me like a sac, light red (not dark like a clot) smooth and round with a small blue vein on the outside - I was in shock! Hospital staff said \"it was just a clot\", but I am still not 100% over this trauma, it could have been a twin or an empty sac. Anyway it came from the \"other\" horn area though it was close to the pregnancy. Baby's heartbeat remained and still nicely embedded in its horn, apparently the left horn (seen from my perspective). After 6 days bleeding was gone to spotting and I was back home with bed rest. 10 days later more bleeding, about another 200ml blood I guess and then everything settled - the embryo survived! I was 16 w by then, and the doctor explained possible scenario quite well to me.Anomaly scan at 20w showed no problem, they also checked the placental blood flow, all fine. NB - my partner and I are generally quite healthy.Then every single week was passing very slow and after 25 weeks I started to believe I might actually have a baby.The pregnancy (on the left/my left) grew oddly with one horn higher than the other but the right horn kept growing too as baby was swinging from one side to the other especially when I was turning over overnight.Now at 35 wks there is only a small dent left on the top, a quite painful area, but other than that it seems the cavity has def developed a large heart shaped uterus - only the small obstruction on top. Baby keeps changing position still and I still have sufficient amniotic fluid (they gave me growth scans). So all seems fine, despite some discomfort re baby's position/pressure during most of the time as it's been lying a lot transverse - head and feet poking against my sides!!!I am glad I had so many scans to re-assure the health and growth of the baby, its enough to worry about knowing you have a b/c u, so everyone keep pressing for scans as they usually do put your worried mind at ease!!I've been scheduled for a CS at 37+6 weeks but may have to attempt labour if baby went head down again and stayed head down.It's been awfully confusing as to birth options (meanwhile I want a CS to save me traumatic labour trials) and I am not happy that there's a high chance I might try labour, labour fails and then emergency CS, BUT I keep going back thinking its more important that the baby made it this far, despite the prognosis of \"early\", 35 weeks is fine already with maybe 2-3 more weeks to come!!!! I feel happy about this achievement also as I was given corticosteroids at 28 weeks, which, again, eased my mind, so ladies, keep asking for steroids for the baby's lung development which are given between 26-28 weeks for women with risk of pre-term birth!!!My partner's and my disbelief is about 90% gone now - it still seems unreal but great we made it this far.But I think having been able to STOP WORKING after the bleeding and having had bedrest and recovery gave the baby the best chance in this pregnancy, so you might have to ask your partners to support you in many ways as you should TAKE IT EASY. Don't rush back into work if you had bleeding etc and put your feet up.I am still a little worried about uterine atony and the possibility the uterine might not contract properly if labour was upon me but I found this and - in my case - there is hope the uterus may still contract 'evenly', who knows... see an article here: http://www.ncbi.nlm.nih.gov/sites/entrez?Db=pubmed&Cmd=ShowDetailView&TermToSearch=1346607&log$=activityHowever now I am more worried about PPH as I lost so much blood at 13-16 weeks trickling on and on and I was anaemic afterwards and left with super low blood pressure of 75/35 at times, I was close to passing out!What a traumatic start, with a quite dark outlook even before the second pregnancy, but with an end which already takes a good shape!!!! The remaining fears... I will distract myself with by looking forward to cuddling a little squirmy monkey in a few weeks to come!!!Head's up to all who suffer from the problems with a uterus malformation - have courage - it might turn out better than you think or than you've been initially told :-)Caroline",
            "post_id": "4039822",
            "timestamp": "1235827636",
            "user_id": "user_779446",
            "user_link": "/personal_pages/user/779446",
            "votes": "0"
        },
        {
            "answer": "hi my name is tammy and about 4 years ago i gave birth to a 4 pound 13oz baby boy born 6 weeks early he was breech had to do a c-section he spent 5 weeks in the nicu in a city 45 minutes from where i live. It was the hardest thing i have ever been threw in my life when i went back for my 6 weeks checkup after having him the doc said i have a cavity in my uterus and said all my babies will be breech and i will need to have csections with them all but never mentioned a bicornuate uterus i just found out i had this typeof ueterus a week ago when i went for my first visit im 14 weeks pregnant. I go today for an internal ultrasound to see where the baby is in the uterus and i was told im at high risk of having another baby born permature but so far everything is going good like it was with my son until i was 32 weeks then i had him but hes a happy healthy boy and very smart.  im so lucky keep up with your hopes",
            "post_id": "4050301",
            "timestamp": "1236097409",
            "user_id": "user_782168",
            "user_link": "/personal_pages/user/782168",
            "votes": "0"
        },
        {
            "answer": "I also just found out I have a bicoruate uterus.  The doctor did not make it seem like it was that big of a deal, but then I got on the internet and read stories and it really scares me.  I guess I just need more answers to figure out how common this is and what the chances are of having a normal healthy baby.  I'm an accountant so I need statistics to make me feel better!  I'm afraid, from what I'm reading, that the doctor was sugar coating the issue a bit and that the risks are a lot greater than he made it seem.  Does anyone have any suggestions on where I can get answers?  The internet, a book, a specialist?  Just anything to put my mind at ease.  The stories I've read are inspiring and I thank everyone for sharing them with us.  This is my 7th week of pregnancy (1st pregnancy), and I literally thought everything was perfect until a couple of hours ago.Thanks again,Worried",
            "post_id": "4060928",
            "timestamp": "1236296489",
            "user_id": "user_784962",
            "user_link": "/personal_pages/user/784962",
            "votes": "0"
        },
        {
            "answer": "I totally understand how you're feeling!  I found out I have BU when I was 6 weeks preg. and the ER dr. told me I was going to M/C.  Thank God I did not!  Our baby girl is growing well.  I see a perinatologist (as all women with any uteran anomaly should) every two weeks for cervix checks and growth checks.For the in-depth info and stats and an AMAZING group of women who can support you and answers so many questions, check out the yahoo! group for women with this condition here:http://health.groups.yahoo.com/group/MullerianAnomalies/Any woman with an MA (Mulleranian Anomaly) needs to be a part of it!I hope this helps.  Just know there is GREAT hope in having healthy babies.M",
            "post_id": "4080409",
            "timestamp": "1236789886",
            "user_id": "user_790466",
            "user_link": "/personal_pages/user/790466",
            "votes": "0"
        },
        {
            "answer": "I have just found out that I have a bicoruate uterus - had to look up on the net to find out all about it.  I am 47 and had two uneventful pregnancies which went full term (actually both were overdue). Children are now in their early 20's.  Good luck - try and think positive and rest - no stress allowed!",
            "post_id": "4366192",
            "timestamp": "1240007015",
            "user_id": "user_874067",
            "user_link": "/personal_pages/user/874067",
            "votes": "0"
        },
        {
            "answer": "I have a bicornuate uterus as well.  I found out when I was 6 weeks pregnant with my son (now 2 years old).  I started bleeding at 6 weeks.  My son presented breech and was delivered by c-section at 39 weeks.  He was small (6 pounds) but healthy.  I have had two miscarriages since my first pregnancy.  The best advice I can give is to see a high risk specialist (perinatologist).  I made the mistake of not seeking out one until now.  The doctor I'm seeing is helping me through my second miscarriage and I already feel more positive about the next pregnancy.  Some doctors think a bicornuate uterus is not a big deal.  It is a big deal when you really want a baby and have trouble having one.  Seek out a OB that is familiar with uterine abnormalities. Good luck to everyone!  I'm really struggling with my situation, but I can tell you that my son is absolutely worth everything I've had to endure to get him and the next one will be too.",
            "post_id": "4532967",
            "timestamp": "1244171652",
            "user_id": "user_928284",
            "user_link": "/personal_pages/user/928284",
            "votes": "0"
        },
        {
            "answer": "On Sunday, I was five weeks, one day pregnant.  I started spotting early in the morning.  By late afternoon I was bleeding.  I went to the ER and was told I needed a transvaginal sonogram.  I am no longer pregnant as they could not find anything but fibroids.  They also found that I have a bicornuate uterus.  I am 32.  I am waiting for my OB/GYN to call me to discuss my options with me.  This site has given me hope and has scared me.  I'll keep posting and checking because I don't know enough about this condition.  Thanks to everyone for being so open about our \"birth defect\".SD",
            "post_id": "4703580",
            "timestamp": "1248727585",
            "user_id": "user_983618",
            "user_link": "/personal_pages/user/983618",
            "votes": "0"
        },
        {
            "answer": "Finally...someone else who is like me!! AS i tell all of my doctors...i am their \"special\" patient or \"freaky\" patient! And we are not at all....they did a study in my office alone of how many women have bicornuate uteri and the number is astonishing....25% which i think is very high! Anyways....I too have a bicoruante uterus and only one ovary...mine was diagnosed at a very early age....b/c i had my one ovary removed at 3 months....so based on the hospital report...my ob knew at 18.....i have a healthy 4 year old boy who i carried to 37 weeks....yes he was footling breech and i had a c-section...but he was 8lbs 2oz....and the pregnancy was great. but prior to that , i did have HSG and a laprascopy to remove my septum so it wouldn't \"get in the way\". I had one very early miscarriage 2 years ago (4 wks) and i just recently had another one at 10 wks...but i had to have a d&c and asked my ob to remove any scar tissue that I might have from either my c-section or my lap. Try not to be scared....i know once you read on the internet...it can scare you to death....but it truly is okay...one think i have learned is that you have to be your bigges advocate or cheerleader w/ every doctor, specialist you see....don't be afraid to ask questions, get second opinions and seek out other options. YOu are all in my prayers and i feel like we have a sisterhood! Prayers and babydust to you all! please keep me posted! =)",
            "post_id": "4704070",
            "timestamp": "1248735437",
            "user_id": "user_942726",
            "user_link": "/personal_pages/user/942726",
            "votes": "0"
        },
        {
            "answer": "I am 40yrs, diagnosed with bicornuate uterus as part of infertility w/u for IVF. I had embryo transfer done today: one in each horn.I have read of poor implantation rate with IVF.I have also read of congenital anomalies in babies of bicornuate uterus.I do not have many chances with this given advanced age and poor quality  and volume of eggs.anybody in such a situation?",
            "post_id": "4737036",
            "timestamp": "1249512258",
            "user_id": "user_994320",
            "user_link": "/personal_pages/user/994320",
            "votes": "0"
        },
        {
            "answer": "I am 27 years old and i was told that i have a split uterus and we are trying to have kids. is it safe for me to get prego and have kids?.",
            "post_id": "4842550",
            "timestamp": "1252197244",
            "user_id": "user_1029508",
            "user_link": "/personal_pages/user/1029508",
            "votes": "0"
        },
        {
            "answer": "My wife has a BC and we found out just after our first miscarriage. She now prego and only 5 weeks along. Any advice to a husband that is worried about his wife but at the same time trying to keep it all together?",
            "post_id": "5269315",
            "timestamp": "1263522081",
            "user_id": "user_1173717",
            "user_link": "/personal_pages/user/1173717",
            "votes": "0"
        },
        {
            "answer": "I am living proof that it is possible to carry twins to 36 weeks with a bicornuate uterus. I was diagnosed early in my pregnancy after a miscarriage. I can't begin to describe what it felt like to go from having miscarried to find out I was still carrying twins with a deformed uterus to top things off. Last November my twins turned 9 years old. Both girls are very healthy leading very happy normal lives.",
            "post_id": "5282902",
            "timestamp": "1263885494",
            "user_id": "user_1178863",
            "user_link": "/personal_pages/user/1178863",
            "votes": "0"
        },
        {
            "answer": "I just wanted to let people know there is hope.  I have had miscarriages. I wasn't told I had a heart shaped uterus until I had a c-section with my daughter. I carried her to 37 weeks and she was 7lbs 7oz.  I am now pregnant again, 22 weeks.  Keep believing.",
            "post_id": "5300835",
            "timestamp": "1264306270",
            "user_id": "user_1185448",
            "user_link": "/personal_pages/user/1185448",
            "votes": "0"
        },
        {
            "answer": "hey my name is georgiana n im 21 n having my 2nd bby im now 14 weeks n i found out about my uterus whenn i came out pregnant wit my first daughter who is  now gonna b four n they didnt knwo i had two cervixs untill labor (i ihad to have c section cuz i dont dialte fully on both side) the first time my daughter was in my rite horn n now this bby is in my left horn bt im still having my menstrual period every month by my bby is fine ! it is possible to have a gud normal pregnancy no matter wat horn the bby is in i guess it all jus depends on how heavy of work n moving around ur doin i never had a miscarraige (thank god) n i jus keep prayin threw out this pregnancy !",
            "post_id": "5642505",
            "timestamp": "1272945484",
            "user_id": "user_1302277",
            "user_link": "/personal_pages/user/1302277",
            "votes": "0"
        },
        {
            "answer": ",,,fyi....33 weeks prego with my 3rd.1st. born perfect at 36 weeks - left horn, girl2nd. born perfect 38 weeks - right horn, boyand so far so good this time - left horn, girli have only been prego 3 times, never a miscarriage and no issue gettingprego!best of luck to all of you :-)",
            "post_id": "5883384",
            "timestamp": "1278536282",
            "user_id": "user_1372871",
            "user_link": "/personal_pages/user/1372871",
            "votes": "0"
        },
        {
            "answer": "Hi I am 30 years old and found out I too have a bicornuate uterus. We found this out after I delivered a baby girl at 24 weeks and she did not make it and we have had 3 miscarriages as well. My doctor does not tell me much about this condition and we have been trying for over a year to conceive with no luck. Does anyone have any suggestions or anything on how we can conceive with this condition?",
            "post_id": "6359818",
            "timestamp": "1289867983",
            "user_id": "user_1429504",
            "user_link": "/personal_pages/user/1429504",
            "votes": "0"
        },
        {
            "answer": "I am 21 years old I have had numerous gynocological problems such as rubtured ovarian cysts and scrapings on top of heart surgeries due to my heart disease but every since I was a very little girl playing with my dolls I have always dreamed of having my own children someday I have always been mother-like my friends in fact used to call me \"mom\", I always make sure everyone is okay and right now Im not ok, I just found out that I have a completely seperate uterus after having an HSG test done, and I didnt really know what that meant and from reading what Ive read it doesn't seem my chances are that great of my dream coming true. My doctor also informed me that last year when I evperience a very very heavy flow period with a lot of pain, that it could have in fact been a miscarriage. My aunt has always said that I am just like her in everyway and she was never able to conceive a child is this what I have to look forward to, I need some hope right now.",
            "post_id": "6369348",
            "timestamp": "1290092243",
            "user_id": "user_1510669",
            "user_link": "/personal_pages/user/1510669",
            "votes": "0"
        },
        {
            "answer": "HiI am 35 years and around 10 years ago when I discovered I had a bicornuate uterus during my first delivery through a c-section at 37 weeks as she was breech; but she was born with a congenital defect called diaphragmatic hernia and we lost her the very next day. she weighed 7lbs and I had a problem free pregnancy. 4 years later I conceived after a well planned pregnancy however with episodes of spotting and bleeding at 10, 14 and 36 weeks. I had a csection again at 38 weeks and my daughter weighed 9lbs plus and was head down. Since then, we have never wanted another child! however in October this year i discovered I was pregnant again and I am now 17 weeks pregnant for the third time. Since then I have been searching for information on the net as the first two times I wasn't aware what it meant to have a problem uterus. I am actually surprised and glad to know that there are so many of us out there! I hope those that posted years ago have beautiful babies by now.......to everyone else all the best! We just got to do the best we can and be positive i guess!Archana (nepal)",
            "post_id": "6478513",
            "timestamp": "1293108297",
            "user_id": "user_1541800",
            "user_link": "/personal_pages/user/1541800",
            "votes": "0"
        },
        {
            "answer": "I had a 9 pound baby boy with a split uterus I found out the day of my c section that he was breech becuz he had no room so I say to all women with this problem there is hope and I myself say its a blessing to have my son here today",
            "post_id": "6493680",
            "timestamp": "1293664482",
            "user_id": "user_1542298",
            "user_link": "/personal_pages/user/1542298",
            "votes": "0"
        },
        {
            "answer": "im just now six weeks with my first pregnancy & i have a bicornuate uterus.. i cramp everyday like im having a period but theres never spotting. im so scared of this going wrong. all these horrible stories keep me not even wanting to get excited :(",
            "post_id": "6630161",
            "timestamp": "1297229830",
            "user_id": "user_1594375",
            "user_link": "/personal_pages/user/1594375",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with this \"split uterus yesterday. I've had two healthy pregnancy (1 single and twins).  I think it depends on how bad the split is!  Think positive everyone.....",
            "post_id": "6746897",
            "timestamp": "1300472265",
            "user_id": "user_1638916",
            "user_link": "/personal_pages/user/1638916",
            "votes": "0"
        },
        {
            "answer": "Wow lots of scary stories here.. makes me scared. I have a heart shaped uterus and a pelvic kidney..they go hand in hand as they develop together in the womb. I found out about my condition when i was prego with my first little girl. After being scared and told to fear the worst, I was being induced because she stopped growing because she ran out of room, luckily I was 38 weeks, she  went breech during labor so we did an emergency c-section. She was 5 lbs and prefect, not a thing wrong.. I got prego again..an oopy when she was 9 months old with my son, the pregnancy had zero complications and he was 7 lbs, he was in the bigger side so it was problem free... well now I am 7 weeks with my 3rd, I will say I have zero problem getting prego, one time without protection and im pregnant, anyway I have never have a miscarrage I am always scared about it, hoping this one is good and baby is on bigger side again...and another thing, my pelvic kidney has 2 uriters..wierd..and it becomes enlarged during pregnancy, they thought it failed but it is still going strong..have yours checked out!",
            "post_id": "6751558",
            "timestamp": "1300643596",
            "user_id": "user_1640546",
            "user_link": "/personal_pages/user/1640546",
            "votes": "0"
        },
        {
            "answer": "Wow lots of scary stories here.. makes me scared. I have a heart shaped uterus and a pelvic kidney..they go hand in hand as they develop together in the womb. I found out about my condition when i was prego with my first little girl. After being scared and told to fear the worst, I was being induced because she stopped growing because she ran out of room, luckily I was 38 weeks, she  went breech during labor so we did an emergency c-section. She was 5 lbs and prefect, not a thing wrong.. I got prego again..an oopy when she was 9 months old with my son, the pregnancy had zero complications and he was 7 lbs, he was in the bigger side so it was problem free... well now I am 7 weeks with my 3rd, I will say I have zero problem getting prego, one time without protection and im pregnant, anyway I have never have a miscarrage I am always scared about it, hoping this one is good and baby is on bigger side again...and another thing, my pelvic kidney has 2 uriters..wierd..and it becomes enlarged during pregnancy, they thought it failed but it is still going strong..have yours checked out!",
            "post_id": "6751560",
            "timestamp": "1300643637",
            "user_id": "user_1640546",
            "user_link": "/personal_pages/user/1640546",
            "votes": "0"
        },
        {
            "answer": "Hi Shelly,My wife is having bicornaute uterus, can you tell me if you completed your term of pregnency",
            "post_id": "6968143",
            "timestamp": "1307450316",
            "user_id": "user_1703915",
            "user_link": "/personal_pages/user/1703915",
            "votes": "0"
        },
        {
            "answer": "Hi I am 14 years old and been diagnosed with bicornuate uterus. This all began with a sharp pain in my lower stomach when I was in volleyball practice. After 3 weeks I had gotten and ultrasound and had some shocking results. One was my bicornuate uterus but I also learned I had a tumor in my right part. Another thing we found was I was born with only 1 kidney (left) and is double the size of a normal kidney. My doctor says everything is okay but I'm only worried about my bicornuate uterus. I'm young still and I know its a good thing that they found this but just the thought of it makes me worried. I'm glad that I can read all of these posts and to know that many women can have healthy babies and that gives me hope that it is possible. Thank you.",
            "post_id": "7009690",
            "timestamp": "1308774206",
            "user_id": "user_1715758",
            "user_link": "/personal_pages/user/1715758",
            "votes": "0"
        },
        {
            "answer": "I'm just really glad I can read all this posts and have hope that it is possible to have a healthy baby even if you do have bicornuate uterus. Althought I am still young (14) its a good feeling to know that they discovered this so I can be treated. Thank you all for bringing me hope. :)",
            "post_id": "7009713",
            "timestamp": "1308774795",
            "user_id": "user_1715758",
            "user_link": "/personal_pages/user/1715758",
            "votes": "0"
        },
        {
            "answer": "hi, like you i also have a bicornuate uterious and only one kidney. i found out at 20 and am now 39. all is good and i have had one healthy child by choice and no miscarriages. you are to young to worry about these things. enjoy your life and be positive. wishing you the best,",
            "post_id": "7266447",
            "timestamp": "1316858398",
            "user_id": "user_1815768",
            "user_link": "/personal_pages/user/1815768",
            "votes": "0"
        },
        {
            "answer": "I too have a bicornate uterus.  I didnt find out till i was delivering . my baby was breeched and my water broke at 30 weeks . The baby came two weeks after that  4lbs 11 oz she dropped down to 4 lbs and had to stay at the hospital for three weeks it was really hard but everything turned out great she just turned one a month ago and she is 100percent healthy. Toattly possible to have a healthy baby",
            "post_id": "7452234",
            "timestamp": "1322552845",
            "user_id": "user_1919544",
            "user_link": "/personal_pages/user/1919544",
            "votes": "0"
        },
        {
            "answer": "Hey I found out I had a Bicornuate Uterus when I was 14. I was shocked and at that time didn't understand what kind of problems I would encounter. I am now 19 and I still struggle with this problem. I'm terrified at the fact that I might not be able to have kids being only that 2% of women have this. I love kids and would hate it if i couldn't be able to have any. Being so young and going at it for so long I told my doctor and my mom that I wanted to stop with all the birthcontrol, all the doctor visits, and anything to do with it I was only 17. They told me that the only thing that could be done was a surgery but my uterus wasnt mature enough so I don't know we'll see how that goes. But I'm glad to hear that I'm not the only one. Goodluck to all of you!",
            "post_id": "7492112",
            "timestamp": "1323719068",
            "user_id": "user_1938752",
            "user_link": "/personal_pages/user/1938752",
            "votes": "0"
        },
        {
            "answer": "I know that many of the posts on this thread are rather old, but I thought I'd leave some positive words on here for anyone who has this condition and is concerned.I have a bicornuate uterus, which was discovered in 2007 when I was pregnant with my first child. Naturally I was freaked out at first and when I researched online, everything I read scared me. One thing you should know is that this condition isn't always detected. There are many different variations one can have and it's difficult during pregnancy to tell which one someone has. Thankfully the technician doing my first ultrasound is well trained and noticed it. The main concerns with this condition is pre-term labor, which can occur if the baby runs out of space to grow...this can signal your body to go in to labor earlier than you should. The other issue is you're more likely to have a breech presentation because of the unusual shape. This puts you at a higher chance of getting a C-Section. With my daughter, she was breech so at around 35 weeks my doctor decided to go ahead and schedule the procedure and told me if she somehow turns then we could cancel it. She didn't turn though. She was born very healthy and I didn't have any pre-term labor. My doctor was able to closely examine my uterus during my C-Section and confirmed it is heart-shaped.For those of you who don't know, the cause of this type of uterus is something that happens when you are developing in your mother's womb. The uterus doesn't fuse into one whole piece and therefore you can have a split uterus or other types of variations. It is also common to have kidney anomalies. I was checked for that sometime after my daughter was born but thankfully everything there is normal. I wasn't aware of a connection to gallbladder problems, but I did have my gallbladder removed my last year of college, so I will have to ask my doctor about that one.I became pregnant with a second baby in March of 2011 but miscarried at almost 10 weeks. This was not related to my uterus, but appeared to be more of a developmental thing. When I had my first ultrasound early on, I was measuring only 5 weeks, 5 days and should have been 7 weeks, 7 days. A heartbeat was detected, but it was rather low. I had to come back 2 weeks later to repeat the ultrasound but there was no longer a heartbeat. I lost the baby about a week later.Currently, I am almost 30 weeks pregnant with my second child (third pregnancy) and she is very healthy! She is even head down last time they checked, so I may be able to pursue a VBAC, although I'm having doubts about it, as much as I'd like to avoid another C-Section. She is measuring weight-wise exactly what she should, heartbeat is strong, and everything appears to be perfect.I just wanted other women to know you are not necessarily doomed if you have this condition. I was considered high risk during my first pregnancy because they couldn't tell much while I was pregnant, but this time around I've been treated as a normal pregnancy. I've also read on here where people have asked what happens if the baby is on one side, how will they grow? I asked my doctor that same question the first time I was pregnant. I was told that the side the baby is on will push into the other side and take over. So if your baby is on the right side it will continue to stretch and grow like it should and will just make the left side very small. I think you are more at risk for pre-term labor if you have a large baby, but it really just depends on the person.I have had no trouble getting pregnant, as all 3 times I conceived right away. Each person's situation is different, so it's hard to compare your situation to others. Try to keep a positive attitude and take care of yourself. Good luck to everyone who might be reading this. If you have any questions, feel free to email me: ***@****",
            "post_id": "7559872",
            "timestamp": "1325808608",
            "user_id": "user_1674085",
            "user_link": "/personal_pages/user/1674085",
            "votes": "0"
        },
        {
            "answer": "I know the post is quit old but I have the same thing. I have never been pregnant and I am not expecting but I have seen two doctors as well that confirm the same thing of having a split utreus this is ababit confusing and very distressing I am only 23 years old and I am worried about having children with this kind of situation.",
            "post_id": "7600907",
            "timestamp": "1326900544",
            "user_id": "user_1991518",
            "user_link": "/personal_pages/user/1991518",
            "votes": "0"
        },
        {
            "answer": "I had my first miscarriage when I was 10 weeks pregnant.  The Doctors said it is something common that just happens.  My next pregnancy I went into pre-term labor at 22 weeks and the baby was unable to make it.  I tried for two years to get pregnant, and those ovulation tests work great, first time I used one I got pregnant for the third time.  I went through ultra sound after ultra sound trying to find out why I couldn't have a baby.  I was on bedrest for 28 weeks when I had placenta previa and the doctors did an emergency C-section.  During the C-section is when I finally got my answers I had been seeking for six years, I have a heart shaped uterus.  My little girl was in the NICU for three months but now we are about to celebrate her 2nd birthday and she is completely healthy.  I want to have another baby, but my husband is scared.  I was wondering if there is any way to repair a heart-shaped uterus so I can carry full term?",
            "post_id": "7606616",
            "timestamp": "1327047361",
            "user_id": "user_1994063",
            "user_link": "/personal_pages/user/1994063",
            "votes": "0"
        },
        {
            "answer": "Hey everyone,I too was told I have the bi-cornuate uterus, and the diagnosis was totally accidental. I've never been pregnant or tried to have kids (yet) but I was having unrelated pains in the vaginal area and so got myself checked out by my ob/gyn. Well, ultrasound showed the uterus was split. The doctor didn't seem too concerned, she said whenever I'm ready to start having kids I would have a surgery done to remove the septum dividing the uterus. Then, they would put in this balloon type thing that would prevent the septum from growing back but remove it in time for conception. (Who knew this thing could grow back, I guess it thinks it's a fingernail!) Since I'm single and prefer to be married when I have kids, she didn't want me to have the surgery now, again because the septum grows back. So, while I have not gotten pregnant or had kids yet, don't let a bad doctor tell you that you will not have kids, you need a great doctor and sometimes, faith...sorry if I sound preachy:) Good luck to you all, you're all amazing!",
            "post_id": "7614328",
            "timestamp": "1327288558",
            "user_id": "user_1998220",
            "user_link": "/personal_pages/user/1998220",
            "votes": "0"
        },
        {
            "answer": "I had surgery to remove one horn of my uterus.  I went on to have two babies, last one pretty scary, my uterus ruptured and both of us nearly didn't make it.  I first discovered I had a bi-cornuate uterus during my first pregnancy when I started bleeding at about twenty weeks.  I had an ultra sound and my little boy was dead.  I carried my little boy nearly to full term as I was told I would have a miscarriage and they were very reluctant to interfere as \"nature would take its course\".  I nearly had a breakdown during this period of my life, it was hard to carry on with a dead baby inside me.  I was eventually given a c-section when it was discovered that I had a bi-cornate uterus.  I have had about five miscarriages, one with a baby in each horn.  Today I am so lucky I have three beautiful daughters.  I was told I would probably never be able to have children.  Don't give up, doctors don't know it all.  I still think of my first little boy, he would be 17 now.",
            "post_id": "7755493",
            "timestamp": "1331339540",
            "user_id": "user_2069350",
            "user_link": "/personal_pages/user/2069350",
            "votes": "0"
        },
        {
            "answer": "My daughter is 14 weeks and just been told she has a split uterus. This is hereditary, I had my first boy at 36 weeks, the drs put my labor off with my second boy for 5 weeks and I had him at 32 weeks, I miscarriage my next baby and then had my babygirl at 31 weeks, she was born with apnea, bradicardia, agensis of the corpus collosum, and Arnold chiari syndrome. She is doing great and 14 weeks pregnant with her first baby. I will keep you all in my prayers!",
            "post_id": "7847003",
            "timestamp": "1334047869",
            "user_id": "user_2108388",
            "user_link": "/personal_pages/user/2108388",
            "votes": "0"
        },
        {
            "answer": "I too just found out last week that I have a Bicornuate uterus. I am only 24. I cant help but be stressed out since I heard it. I dont want to have to go through having miscarriages or anything else I am reading. My Dr told me not to worry ab it now until i plan on having a baby. she mentioned preterm labor and high risk pregnancy  but nothing about miscarriages and THATS ALL I'VE BEEN READING! I hope the best for you, we are both so young still. I just pray that God will allow us to have healthy babies :) its in his hands now",
            "post_id": "7856911",
            "timestamp": "1334288851",
            "user_id": "user_2112215",
            "user_link": "/personal_pages/user/2112215",
            "votes": "0"
        },
        {
            "answer": "OMG!!! This story really hit home because I jus found out that at barely 8wks, my baby's chance of survival is very slim...I've had 2 ultrasounds and go back in the morning for my 3rd...This is my first pregnancy so to hear that my uterus is \"unique\" was very scary and the thought of losing my baby has me so emotional and depressed...My fiance' and I were talking and I felt like I dind't want to try again because of all the complications I'm having but only time will tell...The worst part of it all was when I heard my baby's heartbeat for the first time,then had that happiness shattered when I was told the heartbeat was extremely slow...I've already fallen in love with my baby and honestly am having a difficult time coping with all of this...Have either of you given birth or just having these complications and miscarriages???",
            "post_id": "7915551",
            "timestamp": "1335918935",
            "user_id": "user_2136029",
            "user_link": "/personal_pages/user/2136029",
            "votes": "0"
        },
        {
            "answer": "I was told a few weeks ago that i have a bicornuate uterus, my husband and i have been trying to have a baby for four almost five years now, i think i had  a miscarrages around the 8th of may but no one will tell me, i pasted a mase almost skin colored and hard any one know what this may have been? also any ideas that would help us get pergnant would be nice because i see many of you have had children i happy to see, so this gives me hope so any help would be great",
            "post_id": "7980572",
            "timestamp": "1337806913",
            "user_id": "user_2182821",
            "user_link": "/personal_pages/user/2182821",
            "votes": "0"
        },
        {
            "answer": "Hey ladies, have hope and never give up! I have a bicornate uterus and I'm pregnant with baby #2. My first was born via a planned c-section because he was footling breech, even tho he flipped two times before that, with a lot of persuasion and pain!! The best thing is to NOT stress out and be relaxed as much as possible. Take care and may God continue to bless you.",
            "post_id": "8111468",
            "timestamp": "1341456608",
            "user_id": "user_3105833",
            "user_link": "/personal_pages/user/3105833",
            "votes": "0"
        },
        {
            "answer": "Hi all, wanted to share my story and ask a question. My husband and I were trying really heard for over 2 years before I got pregnant. Everything was seamed to be fine and my doctor never said even one single word that something is not normal. I have no idea whether he did it on purpose to not make me panic beforehand or not. I was due mid February and in the middle of December I came to his office with preterm contractions, he gave me IV with some fluids and I went home. I had these contractions every single day from that day on. After I believe 34 weeks he told me that the baby is breech and he might try sending me to the specialists who will take him and turn him with their hands! It didn’t feel like something I would look into doing, I was afraid to hurt my baby, so I refused and he scheduled a c-section on 38 week. Forgot to mention that my stomach looked weird right side was sticking out lot more than left. But it didn’t seam to bother my doctor. During the c-section I was told by doc that I have this bicornuate uterus and my baby had the umbilical cord around his neck 4! times (probably while trying to get to the right position he almost chocked himself poor thing!). Doctor was very surprised I was able to have this healthy (thank G-d) child. What bothers me of course is why the doc didn’t see anything during ultrasound?! And what’s more important for me now is that my son is 18 month old, I am 31 and would like to have at least one more child, but my doctor said that there is a risk if the next baby ends up in the “wrong” side that is obsolescent (underdeveloped) it can burst at some point of baby growth and we both can die. So my question is if anyone at all had or has same situation and what doctors say? As much as I want more children not only I don’t want to die but also I don’t want my son to grow without me!",
            "post_id": "8198536",
            "timestamp": "1343869852",
            "user_id": "user_3165396",
            "user_link": "/personal_pages/user/3165396",
            "votes": "0"
        },
        {
            "answer": "o thanks its very helpful for me",
            "post_id": "8348414",
            "timestamp": "1348194730",
            "user_id": "user_3807682",
            "user_link": "/personal_pages/user/3807682",
            "votes": "0"
        },
        {
            "answer": "I have a b/u. I found out I had this when I had very bad period pains an irregular periods. I also found out that I had a lot of cysts on my ovaries, I had them removed just before I got married and got pregnant on my honeymoon. I have had no trouble getting pregnant and have had 4vbac deliveries. I have been induced for all 4 pregnancies. Due to pre-eclampsia and also my first born was a very quick labour (20 mins) and I live 120kms (approx 60miles) from the nearest hospital.My first pregnancy- girl born 36 weeks due to pre-eclampsia (weighed 6\") born oct 2005.my second pregnancy - girl also pre eclampsia at 37weeks (6\"7). Born aug 2007.My 3rd pregnancy- I had a miscarriage at 4weeks (Due to ectopic pregnancy)My 4th pregnancy- boy induced at 39 weeks (7\"13), born nov 2009.my 5th pregnancy - girl induced at 39 weeks (8\"2) in the right horn, born sept 2011.and now I am pregnant with my  6th baby due on 20th aug 2013, in the left horn.There is hope for women with b/u, good luck to you all.",
            "post_id": "8803968",
            "timestamp": "1359716816",
            "user_id": "user_4829277",
            "user_link": "/personal_pages/user/4829277",
            "votes": "0"
        },
        {
            "answer": "I also have a bicornuate uterus. I spotted for the first 8 1/2 weeks of my pregnancy with my son and was so afraid I was going to miscarry. Thankfully I did not. The doctors first noticed when I was 19 weeks pregnant that there was something a little odd with my uterus. They first called it a septate uterus, which really scared me after researching it. I gave birth vaginally to my son at 36 1/2 weeks (I had to be induced because of preeclampsia). He was 5 lbs 11 oz but did not have to spend any time in the NICU! I was officially diagnosed with a bicornuate uterus 6 weeks after my son was born. My pregnancy was a roller coaster but the thing that got me through is realizing that nothing surprises God. He knew the outcome from the very beginning and He knows what will happen next time around (if there is a next time). This is true for you too!  Psalm 139",
            "post_id": "8858474",
            "timestamp": "1361228714",
            "user_id": "user_4934389",
            "user_link": "/personal_pages/user/4934389",
            "votes": "0"
        },
        {
            "answer": "I know this post is very out of date .. but ill tell my story incase people are looking for information now and or worried about there pregnancy .. I also have a bicorniate uterus and with regards to carrying to full term iv had 2 babys born prem one at 35 weeks and one at 31 weeks and both babies were born healthy and are fine now 11 yrs on iam 16 weeks preg again :) so for people out there just now in a panic try to relax its very possible all will be fine :) x",
            "post_id": "9251185",
            "timestamp": "1372747506",
            "user_id": "user_5705392",
            "user_link": "/personal_pages/user/5705392",
            "votes": "0"
        },
        {
            "answer": "I have bicornuate uterus, two cervix and had a divided vaginal septum. My only pregnancy was in the right horn and I now a very healthy 21 year old.  I did have placenta previa and delivered early but they said it had nothing to do with my uterus, it just happens when the embryo implants too low.  I had no special precautions and was treated just like any other pregnancy until I developed the prévia, of course.",
            "post_id": "14135750",
            "timestamp": "1488506733",
            "user_id": "user_20017262",
            "user_link": "/personal_pages/user/20017262",
            "votes": "0"
        }
    ],
    "post_id": "1054134",
    "question": "I am 6 weeks pregnant and just found out I have a bicornuate uterus. This has been confirmed by 2 different physicians after 2 different ultrasounds, one being a level 2 ultrasound. What they didn't tell me is how severe the split of my uterus is. Is there anyway to diagnose whether the split is partial or complete via ultrasound, maybe 3D? Will my chances of having a live birth be lowered if it is a complete split? What I find particularly odd is that I was pregnant before and had several ultrasounds where nobody noticed this. I had to terminate that pregnancy at 14 weeks due to multiple anomilies (omphalocele, neural tube defects, others). I was told that the baby had no chance of survival. How could they miss the fact that my uterus is bicornuate? One last question: does it matter where the fetus plants itself in a bicornuate uterus? Mine is in the right horn, but they did not say how far up.   I have done tons of reading on this subject but have not found answers to these questions.  Thank you so much for you help. I just really want to know what to expect!",
    "timestamp": "1070517600",
    "title": "Bicornuate uterus",
    "user_id": "user_57489",
    "user_link": "/personal_pages/user/57489"
}