{
    "answers": [
        {
            "answer": "Has your doctor tell you there were any risk of another miscarriage? I would talk to the doctor. Every woman is different as well as every pregnancy. Hopefully you do carry this baby to term. I will be praying that you do.Mandi",
            "post_id": "1101261",
            "timestamp": "1084338000",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "Yeah he said I do have an increased chance of m/c and also an increased chance of early labour, I am really scared by the pains I get and expect to see blood everytime I go to the bathroom!",
            "post_id": "1101265",
            "timestamp": "1084338000",
            "user_id": "user_68199",
            "user_link": "/personal_pages/user/68199",
            "votes": "0"
        },
        {
            "answer": "I don't know what to say. That would be horrible to live in fear all the time. I am so sorry that you have to go through all this.Mandi",
            "post_id": "1101269",
            "timestamp": "1084338000",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "My daughter has a bicornuate uterus,delivered her baby at 34 weeks. Her baby stayed in the NICU for 21/2 weeks but was fine. She is now huge and a little stinker! They will moniter you carefully, but it can be done! Good luck and try not to worry!",
            "post_id": "1101359",
            "timestamp": "1084338000",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "I too have a bicornuate uterus and fear getting pg thinking I will m/c.  However, my dr assured me that a bicornuate uterus is not as uncommon as one would think and she has delivered tons of babies with moms that have a b/u.  If you have concerns then call your dr.  He/she should be able to talk to you about your thoughts and the pains you are feeling.  I've been ttc for almost 2 years now and had 1 ectopic....its unrelated to the b/u.  So no matter if you have an anomoly such as ours or not....unfortunately things happen.  Try not to think about the negative and focus on the beautiful baby growing inside you. g/l!",
            "post_id": "1101310",
            "timestamp": "1084338000",
            "user_id": "user_59821",
            "user_link": "/personal_pages/user/59821",
            "votes": "0"
        },
        {
            "answer": "By the way, knowing you have made it to 12 weeks is a really good thing,so stay calm and you should be okay. I am trying to get my daughter to take another test, I think she may be pregnant again, but if she is, she's probably afraid I'll have a coronary! In that case, she for sure won't want me to know! You will want to watch what you eat also because you can not gain the normal amount of weight, that is what starts labor early, the baby runs out of room. Talk to me whenever you want, if that will help you.",
            "post_id": "1101419",
            "timestamp": "1084424400",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "My daughter did have a hard time as she grew because dhe was so lopsided and I know that sounds stupid! But I have to tell you in the beginning she refused to acknowledge the pregnancy at all, she was scared of losing it, she had already lost 2. She did have pain of some kind in her side that was way more obvious. In your shoes, I would take things as easy as you can and try to stay relaxed.",
            "post_id": "1101418",
            "timestamp": "1084424400",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "Did your daughter have a painful and uncomfortable pregnancy? I just need to know if the pain im feeling is normal. Thanks for your help.",
            "post_id": "1101365",
            "timestamp": "1084424400",
            "user_id": "user_68199",
            "user_link": "/personal_pages/user/68199",
            "votes": "0"
        },
        {
            "answer": "Hey thanks alot youve made me feel abit better. I know how your daughter feels its horrible to live in fear of losing the most precious gift in the world. At 13 weeks tomorrow I am getting hopeful but I dont want to get my hopes up too much just in case the worst does happen. How far along was your daughter when she lost her first two, I heard that there is also an increased chance of miscarriage later on. How old is she now, because ive also heard that your chances are better as your uterus becomes more mature. Thanks for all your help!",
            "post_id": "1101460",
            "timestamp": "1084510800",
            "user_id": "user_68199",
            "user_link": "/personal_pages/user/68199",
            "votes": "0"
        },
        {
            "answer": "My daughter was only 16 when she lost her first one , a year to the day when she lost her 2, and again a year to the day when Marlina was born. I know it sounds hard to beleive, but it's true! It makes me believe even more that Marlina was meant to be. She also lost them both at almost 10 weeks. Her relationship with her boyfriend I sometimes wonder if it contributed.",
            "post_id": "1101541",
            "timestamp": "1084597200",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "By the way.she is now 20 and Marlina is 16 months old.",
            "post_id": "1101542",
            "timestamp": "1084597200",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "Yes it is possible to carry a pregnancy to full term with a bicoruate uterus. I have twice the last a girl was  delivered on 9.4.04 at 39+ wks and the first Natasha also delivered at 39+ wks both born normal, I live in the uk where in my experience the Doctors dont bother so much about bicornuate uterus well mine haven't. Mine was diagnosed before both of my pregnancies during fertility investigations, I havent had a m/c that i know of so i dont know how you feel, but i wish you luck with your pregnancy.",
            "post_id": "1101634",
            "timestamp": "1084770000",
            "user_id": "user_69929",
            "user_link": "/personal_pages/user/69929",
            "votes": "0"
        },
        {
            "answer": "Ihave just been diagnosed with a cyst on my left ovary & during the scan the doctor found that I have a bicornuate uterus.I have already had my left tube & ovary removed, dont have children but would like too. The doctor doesnt want to remove the cyst as the adhesions from the op may effect pregnancy. But the bicorn uterus can also effect pregnancy anyway. Has anyone else been in the same boat as me and what did you do. Is it worth getting the cyst removed, and if you did was there any problems with pregnancy from adhesions?",
            "post_id": "1102298",
            "timestamp": "1085547600",
            "user_id": "user_70647",
            "user_link": "/personal_pages/user/70647",
            "votes": "0"
        },
        {
            "answer": "It is possible to carry to term with a bicornuate uterus.  I had my first child in 2000 and was not informed about my uterus until 2004 now that I am 15 weeks pregnant with my second child.  My first pregnancy everything went well and smooth until labor time.  I was a week late and had to be induced...but after 20 hours of labor I had to have an emergency c-section but both my son and I were fine.  My dr. now is curious as to why they never informed me that I had a bicornuate uterus because it's not just something that happens over night.  I have been told now that I will not be able to have a normal delivery this time and will have to have another c-section...I was disappointed but I just want a healthy baby.  This pregnancy I have been a little bit more uncomfortable...I have pains every now and then and I'm always tired, and sick.  I will keep you in my prayers for a healthy baby...Good Luck and just try not to stress yourself out...",
            "post_id": "1103065",
            "timestamp": "1086757200",
            "user_id": "user_71340",
            "user_link": "/personal_pages/user/71340",
            "votes": "0"
        },
        {
            "answer": "I have just found out that I have a bicoruate uterus - had to look up on the net to find out all about it.  I am 47 and had two uneventful pregnancies which went full term (actually both were overdue). Children are now in their early 20's.  Good luck - try and think positive and rest - no stress allowed!",
            "post_id": "4366179",
            "timestamp": "1240006855",
            "user_id": "user_874067",
            "user_link": "/personal_pages/user/874067",
            "votes": "0"
        },
        {
            "answer": "Hello, I am currently 20 weeks pregnant with my second daughter and at 18weeks I went to the emergency room with horrible pains on the entire right side of my body both constant and to touch wrapping from the front right side of my belly button all the way to my back and hip.  In all honesty thought I had a bad bladder/ kidney infection but little did I know that was not the case at all.  After a catscan due to fear of a possible appendicitis... they found I have a bicornuate uterus.  I was as well as my doctors, extremely shocked.  I had already given birth to a beautiful baby girl 2 years ago at term, vaginally, and no complications at all... pretty much a perfect pregnancy.  This pregnancy however started out alot differently... I felt uncomfortable from the beginning, turning to pain, and even having difficulties walking.  After this discovery, I obviously underwent several ultrasounds and tests to find that the reason for the pain was because I am missing my right kidney and this pregnancy is occuring in the right uterine horn where my older daughter we have discovered was in my left. (Which I was aware I was born with a solitary left kidney).  In a \"normal pregnancy\" the uterus is supprted by the kidneys however in my case since I don't have a kidney on the right side to support it it is tilting back and laying on the nerve cord controling the bottom half of my body, my bladder, and the Vena Cava artery... which of course was causing my pain...unfortunately nothing they can do about it.  In addition to the discovery of the bicornuate uterus, it was found that the uterine wall of the horn my current pregnancy is in is extremely thin.. that of a 36 week pregnancy... Making me a High Risk Mom...  The docs are hopeful that I should be able to carry her to a viable point but know that it will not be to term due to concern of the uterus rupturing....  I have thankfully made it to 20weeks with no change in thinning so hopefully my body can hang on for atleast another 8-10 weeks... that would be great!  The pain I can live with if it means I get a healthy baby girl in return!  If anyone else has had a similalr situation please inform me... I can't find a whole lot on someone in my case... one kidney, pregnant in opposite uterine horn then previous pregnancy as well as side with no kidney, and thin uterine wall of pregnant uterus.   But to those who are concerned with getting pregnant and carrying to term, its not unheard of I did the first time and had no Idea of the current situation.  I also have never had any miscarriages, spotting, or trouble getting pregnant, Including this one!   Good luck to you all!Uterus-ly surprised!  :)",
            "post_id": "5136071",
            "timestamp": "1259767658",
            "user_id": "user_1126131",
            "user_link": "/personal_pages/user/1126131",
            "votes": "0"
        },
        {
            "answer": "I also have a bicornuate uterus and have had two full term big baby girls!! I did end up having them both c-section because they were both breech due to the b/u. If you don't already know it means that ur uterus is shaped like a heart and so when the baby gets to a certain size it can't turn upside dowm like most babies do when it gets time to deliver. I am 8wks 4d with baby #3 and hoping all goes well....I also wish you all the best! Just know that it can be done and when I asked my doctor if I should be worried when I was preg with my first, he said absolutely not....it is not all that uncommon!",
            "post_id": "5180747",
            "timestamp": "1260990324",
            "user_id": "user_1140914",
            "user_link": "/personal_pages/user/1140914",
            "votes": "0"
        },
        {
            "answer": "I have a bi-cornuate womb and have a beautiful 2 year old daughter.  I was 2 week over and delivered naturally.  I experienced bleeding at about 6 weeks and was told I had haemoraging on my left side.I am now 11 weeks pregnant and have started bleeding quite heavily with some pain. I fear I'm miscarrying.I have to wait until Monday to get my GP to refer me to the EPU for a scan to deternine if the pregnancy is viable.It's scary.Good luck to all out there.",
            "post_id": "5190115",
            "timestamp": "1261264051",
            "user_id": "user_1143989",
            "user_link": "/personal_pages/user/1143989",
            "votes": "0"
        },
        {
            "answer": "hi im carlyni have a three year old son and also have a heart shaped uterus. i carried normally but had a lot of scan just to be sure josiah was alright. he was born naturally and weighed 6 pounds 8 oz.i am now pregnant with identical twins and they are doing fine so far im 12 weeks , hope this helps",
            "post_id": "5492939",
            "timestamp": "1269244725",
            "user_id": "user_1253989",
            "user_link": "/personal_pages/user/1253989",
            "votes": "0"
        },
        {
            "answer": "I knew I had a bi uterus at 14. I discovered this because of my periods. They were abnormally heavy and I cramped severely. I had a DNC done because the dr thought I had cyst. Turns out no cyst just a heart shaped uterus. I didn't know about any issues on pregnancy until  reading on it right now. I'm 5 weeks pregnant and already have two daughters who were full term by c-section.  They both were breech but very healthy. I was monitored closely and quiteoften but never went into labor for either girl. Ihope for the same with this pregnancy.  Stay positive and healthy. Keep your appointments and take it easy with plenty of rest. Best to all of us",
            "post_id": "5744355",
            "timestamp": "1275417843",
            "user_id": "user_1332699",
            "user_link": "/personal_pages/user/1332699",
            "votes": "0"
        },
        {
            "answer": "I was told at 8 weeks pregnant that i had bicornuate uterus ,i bled the first three months and had on and off pain but scans showed baby was doing well, i was so scared off all the horror stories u read. Although i had alot of extra monitoring and scans  am glad to say i am now 41 weeks pregnant and gettinginduced in 3 days . So there is hope for all of us ladies with b/c uterus :)",
            "post_id": "6009032",
            "timestamp": "1281391326",
            "user_id": "user_1408382",
            "user_link": "/personal_pages/user/1408382",
            "votes": "0"
        },
        {
            "answer": "Well where do I begin? I am on my 3rd pregnancy and the first 2 I miscarried.. The first pregnancy was 2 1/2 years ago, and I lost it right at 3 months along. When I had went to the hospital they kept askin me if I had already lost the pregnancy and didn't know it.. Well I hadn't passed anything and I knew that wasn't possible. I went through about 12-14 hours of contractions or labor and none of the doctors could understand why I was in so much pain! Nothing helped! So after that pregnancy I went through about a year of depression.. I was so disappointed and wanted to know what had gone wrong.. I had followed the books to the \"T\". Then this past June 2010, I discovered I was pregnant again! I was both thrilled and terrified.. I didn't connect with the thought of being pregnant because the first pregnancy. Just like the first pregnancy I experienced pains from the start- spotting- and then I experienced blood clots and they were not in the 1st pregnancy.It wasn't until I began to struggle through the end of my 2nd month and around 3-4 days before my 3rd month checkup- I started to experience severe lower back pain-and I knew what it meant.. When I arrived at the hospital and the ultra sound tech began doing ultrasounds- I was told I had a bicornate uterus.. I was shocked and concerned. It explained why in the first pregnancy they couldn't find the baby and thought I had already lost it- I had been sent home after a while- only to lose that pregnancy at home.  And from experience let me tell you... You KNOW when your miscarrying! You will pass stuff- and if they ask and every make you feel like you wouldn't know- I can tell you that is not true!   -- So anyways I lost my second pregnancy in around August 18 2010. It is now November 8 2010 and in all my experiences with pregnancy- I have discovered that I am about 8 weeks pregnant and I have to be honest.. Once again I am not allowing myself the comfort to get excited. All of my friends are having babies and I can't seem to relax or be happy. Its so stressful knowing what could happen. But I want to say this-- I'm 28 yrs old and not until the last few years have I ever gotten pregnant. So I do think God works in mysterious ways! I am hoping for a baby eventually- but am hoping that by not being too attached I won't get hurt again. I can't say its easy- cause its not. Having a B/U means alot of risk,, Not to mention finding a doctor now who will take a High Risk Mommy.. As well I have an incompetent cervix. So I am sure this will be interesting! Good luck to everyone..",
            "post_id": "6333131",
            "timestamp": "1289213343",
            "user_id": "user_1500194",
            "user_link": "/personal_pages/user/1500194",
            "votes": "0"
        },
        {
            "answer": "Hi. I m/c about a month ago at 9 weeks. It was my first pregnancy. My doctor told me at my first ultrasound that I had a slight dip in my uterus. I had no idea that it was something to be overly concerned about. She made it seem like no big deal. When I actually miscarried, I went straight to my doctor. However, she had left for the day and I was seen by another doctor. I was completely heartbroken. My new doctor said his wife had the same exact thing. She too miscarried her first child, but went on to have two healthy children with a heart-shaped uterus. He told me to keep trying and that it wasn't impossible. I'm going to have an HSG test done to see the true shape of my uterus. I'm just waiting to have my first period after the mc. I'm still sad but hopeful that I will one day be able to have a baby.",
            "post_id": "6349983",
            "timestamp": "1289598520",
            "user_id": "user_1505013",
            "user_link": "/personal_pages/user/1505013",
            "votes": "0"
        },
        {
            "answer": "I have a b/u.  I'm pregnant with my second child...about 9 weeks prego.  At 20 weeks with my daughter Liberty I started passing stuff that looked like chewed up gum.  Drs said it was part of the uterus wall of the un-use horn.  The rest of the  pregnancy went good.  She's now 2.  With my second pregnancy now is a different story.  I\"ve had an IUD in since 6 weeks after Liberty was born.  About 4 weeks ago I thought I had a really bad flu.  After a week I took a pregnancy test which turned out positive.  3 weeks prior i started to have a brown discharge.  I thought I had that instead of a period.  But I'm still having it and some spotting.  I'm also passing the gum looking stuff again.  I don't really have any pain.  Does anyone else have or had those symptoms?  How do u know that you're having a miscarriage?",
            "post_id": "6444093",
            "timestamp": "1292123464",
            "user_id": "user_1531856",
            "user_link": "/personal_pages/user/1531856",
            "votes": "0"
        },
        {
            "answer": "thanks everyone for the positve stories! i just found out last night at the er that i too have a bicornuate uterus. i am 7.5 wks with my first pregnancy. it helps to see moms who have the same thing as i do and had healthy babies at term.",
            "post_id": "6510523",
            "timestamp": "1294159897",
            "user_id": "user_1551581",
            "user_link": "/personal_pages/user/1551581",
            "votes": "0"
        },
        {
            "answer": "I have a Bicornuate uterus and found out during my first pregnancy... Went to full term with my first but it was very uncomfortable with spotting in the beginning.. My doctor gave me vaginal Progesterone to help keep the pregnancy going.. After the first Trimester everything was ok.  But she was a footling breach because she grew too big and couldn't turn because of the shape.  Second child, Carried to 35 weeks but had to be induced because I stopped producing amniotic fluid. Had nothing to do with my uterus.   My third was normal but very uncomfortable...  If you have Bicornuate you should definately ask your doctor about checking to make sure you have normal kidney function and Fallopian tube function if you are having problems.. This is Very rare but it never hurts to check.. My right Fallopian tube was hypoplastic and didnt enter the uterus at all.. but my kidneys are normal.    Keep hope.. You can get pregnant and stay pregnant (even if you need help from a doctor sometimes) with bicornuate uterus and only one tube!",
            "post_id": "6550202",
            "timestamp": "1295150130",
            "user_id": "user_1564288",
            "user_link": "/personal_pages/user/1564288",
            "votes": "0"
        },
        {
            "answer": "im just looking on here and see so many people with the same thing as me.  I never knew i had a bicornuate uterus...i had never even hear of it.  I was pregnant with my second child and she was breech so they schedueld me for a c section.  My water broke at 37 weeks and i went in for an emergency c setion.  When they pulled her out then realized things were not right.  I had 4 ultrasound during my pregnancy and never caught this.  Apparently as a result of this condition my daughter had no room to turn and she we breech for so long it caused her to have club feet and hip dysplasia...among other things.  I was so shock for the fact that my now 5 year old i carried without any problems and delivers her actually 2 weeks after my due date without a c setion and no problems what so ever.  Im curios if there are any other woman who have experienced this as well...",
            "post_id": "6721867",
            "timestamp": "1299729819",
            "user_id": "user_1630589",
            "user_link": "/personal_pages/user/1630589",
            "votes": "0"
        },
        {
            "answer": "update: since my last post I have had two ultrasounds and both did not show me having a bicornuate uterus. So I can only believe that I was misdiagnosed and God healed my uterus. I am now 24 wks and everything is looking good with me and my baby which I found out is a girl during my last ultrasound. Im still in prayer for us both and I pray for everyone in this forum! He is still in the healing buisness.",
            "post_id": "6897183",
            "timestamp": "1305090945",
            "user_id": "user_1551581",
            "user_link": "/personal_pages/user/1551581",
            "votes": "0"
        },
        {
            "answer": "I have a bicornuate uterus and am 12 weeks with my first. I've been told that sometimes in women with a bicornuate uterus that the cervix can be weekend and you can dilate early. My obgyn was saying that some women get a stitch put in to prevent this but that this can be risky because of infection. It can be very helpful though in preventing premature delivery. I'm trying to decide if I should just put one in for piece of mind or not. I am constantly worried about the situation. Has anyone heard of this and what are your thoughts?",
            "post_id": "6968812",
            "timestamp": "1307466845",
            "user_id": "user_1704107",
            "user_link": "/personal_pages/user/1704107",
            "votes": "0"
        },
        {
            "answer": "I just found out that I have a b/u! I've been pregnant twice. The first time I carried twins to full term and the second was a full term fat baby boy! They are all healthy and beautiful! God is totally in control!!!! Keep your heads up and your eyes focused on the Lord!",
            "post_id": "7062871",
            "timestamp": "1310565868",
            "user_id": "user_1736380",
            "user_link": "/personal_pages/user/1736380",
            "votes": "0"
        },
        {
            "answer": "I just found out that I have a bicornuate uterus.. I've been pregnant twice. The first time I carried twins to full term and the second was a full term fat baby boy! They are all healthy and beautiful! God is totally in control!!!! Keep your heads up and your eyes focused on the Lord!",
            "post_id": "7062876",
            "timestamp": "1310565957",
            "user_id": "user_1736380",
            "user_link": "/personal_pages/user/1736380",
            "votes": "0"
        },
        {
            "answer": "hi. thank you for sharing your stories. it has given us all hope!may i ask how old are you when you have your twins. i am 36 already and i want to know if there is still a chance for me to bear have children.thank you!",
            "post_id": "7373278",
            "timestamp": "1320287492",
            "user_id": "user_1871981",
            "user_link": "/personal_pages/user/1871981",
            "votes": "0"
        },
        {
            "answer": "hi. thank you for sharing your stories. it has given us all hope!may i ask how old are you when you have your twins. i am 36 already and i want to know if there is still a chance for me to bear have children.thank you!",
            "post_id": "7373282",
            "timestamp": "1320287607",
            "user_id": "user_1871981",
            "user_link": "/personal_pages/user/1871981",
            "votes": "0"
        },
        {
            "answer": "I had my baby full term with a bicornuate uterus . I had a lil spotting in the beginning but everything else went perfect",
            "post_id": "7419128",
            "timestamp": "1321555868",
            "user_id": "user_1900735",
            "user_link": "/personal_pages/user/1900735",
            "votes": "0"
        },
        {
            "answer": "i have two seprate uterus no any baby but marriage five years",
            "post_id": "7500036",
            "timestamp": "1323941444",
            "user_id": "user_1942281",
            "user_link": "/personal_pages/user/1942281",
            "votes": "0"
        },
        {
            "answer": "have you just got a dip or is it split?i got diagnosed with a bicornaute uterus when i was 21 and mine is totally split but my doctor hasent explained anything, when i asked her if later in life i would be able to carry a child the reply i got was 'we will speak about that when you are planning on having one' i hope you do carry to full term wishing you all the best :)",
            "post_id": "7665796",
            "timestamp": "1328743300",
            "user_id": "user_2023227",
            "user_link": "/personal_pages/user/2023227",
            "votes": "0"
        },
        {
            "answer": "I have a a bicornuate uterus and I had 3 miscarriages and 1 dc with them then I had my first little girl by c-section no one noticed out of all this and then 2 years later I got pregnant with my 2nd daughter and at 10 weeks I had a ultra sound and they seen it hand put me as some what high risk I had to have ultra sound like 2 to 3 times a month and both my girls are fine my first daughter was 4 lbs 10 oz and 16 1/2 in long and I think that maybe that's why she was so little and my second was 6lbs 01 oz and 19 inches I was told that it all depended on where the baby implanted . I know  my right side is bigger and I carried my 2 daughter there I'm not sure witch side my first was in.",
            "post_id": "7761428",
            "timestamp": "1331532567",
            "user_id": "user_2072080",
            "user_link": "/personal_pages/user/2072080",
            "votes": "0"
        },
        {
            "answer": "I have a bicornuate uterus and had 4 healthy babies, all being over 8lbs with no complications at all, other than preeclampsia with my first. I didn't have any issues carrying them, I delivered them all by vaginal birth, no drugs and no breech or any other complications. I've had one miscarriage after my first son was born and it was at 8 weeks, sad but went on to have 3 more healthy babies. So, it is possible to have children with no problems with a bicornuate uterus.",
            "post_id": "7917300",
            "timestamp": "1335974517",
            "user_id": "user_888302",
            "user_link": "/personal_pages/user/888302",
            "votes": "0"
        },
        {
            "answer": "I have a friend who is pregnant with twins and has a bicornuate uterus.She had a miscarriage last year. Is it considered a higher risk to be pregnant with twins. She has never had a live birth baby. What are some of the problems to begin looking for? She has had to go to the ER twice with pain and at 18 weeks she started leaking amniotic fluid she seems to be ok. Just wondering what the rest of her pregnancy could be like and what to look for.",
            "post_id": "8125915",
            "timestamp": "1341902027",
            "user_id": "user_3116375",
            "user_link": "/personal_pages/user/3116375",
            "votes": "0"
        },
        {
            "answer": "i had a bicarnuate uterus pregnancy. I went in labour after my water broke 6 months/2weeks into my pregnancy. My daughter was born even much healthier than many others that day through a c-sectional birth. no extra monitoring was givin as i stated before she was very well and healthy. THANKS BE TO GOD. My aunt prayed and fast when my specialist predicted a less than 50% miscarriage. my first doc had no clue about ma pregnancuy, which is why i switched 2 a specialist on a 2 wks regular check-up, twic a month. My daughter is now 5 yrs old. have faith and leave the worries to God.",
            "post_id": "8390379",
            "timestamp": "1349373049",
            "user_id": "user_4055170",
            "user_link": "/personal_pages/user/4055170",
            "votes": "0"
        }
    ],
    "post_id": "1055240",
    "question": "Has anyone here carried a baby to full term with a bicornuate uterus? I am 12 weeks now, but have previously had one miscariage at about 8 weeks, but did not find out about the dip in my uterus untill this pregnancy. My pregnancy has been very un comfortable and painful so far, could this be due to the bicornuation. I would really like to know what my chances of having this baby are, as I dont think I could bear to loose another baby. Can anyone help?",
    "timestamp": "1084338000",
    "title": "bicornuate uterus",
    "user_id": "user_68199",
    "user_link": "/personal_pages/user/68199"
}