{
    "answers": [
        {
            "answer": "also I've had too blood test done and there is a normal level of protein in my blood.  I would go see my doctor, but setting up an appointment and getting the time off is impossible.",
            "post_id": "2827194",
            "timestamp": "1209138064",
            "user_id": "user_282315",
            "user_link": "/personal_pages/user/282315",
            "votes": "0"
        },
        {
            "answer": "Hi,At this point, I suggest that you continue to observe your urine. Urinating very fast may cause bubbles to show. Also, some substances in the toilet bowl may react with the urine and cause bubbles. These are things to consider. At this point, I suggest that you should not be worrying unnecessarily. I understand that you are anxious about this however, it should be a relief that the test results are normal.Continue observing your urine's character. Note any change in color, odor, and amount. Also note for any changes with urinary patterns eg increase in urine frequency.",
            "post_id": "2851274",
            "timestamp": "1209626707",
            "user_id": "user_375711",
            "user_link": "/personal_pages/user/375711",
            "votes": "0"
        },
        {
            "answer": "I have also had bubbles in my urine for several months.  So far, I have no diagnosis.  One thing to look for is to see if there is ever any white colored tissue in your urine.  This started happening to me 4-6 weeks after the bubbles first appeared. If your symptoms continue much longer, you might want to consider setting up a doctor's appointment, especially if you think that an infection is a possiblity. I'll keep you updated and let you know if anything is diagnosed on my end.  I hope that you start feeling better soon. :)Take Care,Kelly",
            "post_id": "2870701",
            "timestamp": "1210049185",
            "user_id": "user_483628",
            "user_link": "/personal_pages/user/483628",
            "votes": "0"
        },
        {
            "answer": "i only know that it means that there is air in the urine",
            "post_id": "2968290",
            "timestamp": "1212038485",
            "user_id": "user_520324",
            "user_link": "/personal_pages/user/520324",
            "votes": "0"
        },
        {
            "answer": "My docs thought I had a terrible rare disease and if I had protein in my urine, then it would be possitive. No bubbles/fizz of any sort. Then all of a sudden I got BUBBLES...lots of them. I could hear them fizzing. Got so scared. Doc took another urine test and sent it out to the laboratory--no protein. All I had was just bubbles that were popping. My bubbles weren't foamy.My husband came home and had to pee. (this is so embarrising). Anyway, I asked if I can see his urine. He too had lots of bubbles. I still have bubbles for many months and no protein.But do keep an eye out for foaming and see if your bubbles pop and how fast they pop. If it takes a longgg time to pop, then go see your doc. But personally, I wouldn't worry about the bubbles. Make sure you drink 8 cups of water each day and check the color of your urine. If you don't drink water, then your urine might be darker. Even so, if the color is dark, go to the doctor. Relax. I know how you feel. I've been going through tons of scares myself for the past few months. Can hardly sleep or function because my mind is always on it. I'm not a doctor, but do go periodically to check your urine. It doesn't hurt. Oh..about the white color tissue..I had it for a bit and was told that it was most likely dead skin sluffing off.(think sluffing is spelt wrong). I might have had a little infection or whatever. Evenutally, it stopped. Keep an eye on it.",
            "post_id": "2970384",
            "timestamp": "1212083670",
            "user_id": "user_481556",
            "user_link": "/personal_pages/user/481556",
            "votes": "0"
        },
        {
            "answer": "Hi Obession and Lori707, when you mentioned no protein in your urine, did you get this result from routine urinalysis? If so, if the bubbles/foams continue, I suggest that you get a 24 hour urine collection done to detect protein volumn. Urinalysis dipsticks are not good at detecting all proteins. That means negative results doesnt rule out protein in urine completely. The 24 hour urine collection is far more reliable. talk to your doctor.",
            "post_id": "2974097",
            "timestamp": "1212150161",
            "user_id": "user_505597",
            "user_link": "/personal_pages/user/505597",
            "votes": "0"
        },
        {
            "answer": "Good question- My urine was sent to the laboratory for anylysis. Do I still need a 24 hour urine collection?Lori",
            "post_id": "2977260",
            "timestamp": "1212194756",
            "user_id": "user_481556",
            "user_link": "/personal_pages/user/481556",
            "votes": "0"
        },
        {
            "answer": "I would if I were you, just to be sure.",
            "post_id": "2999580",
            "timestamp": "1212664832",
            "user_id": "user_505597",
            "user_link": "/personal_pages/user/505597",
            "votes": "0"
        },
        {
            "answer": "I've been having pain in my bladder and when I urinate I see bubbles. But now I'm getting lots of sluffing to the point that when I first urinate in the morning, small globbs of white skin or muscos is showing up. I don't think I have IC because I don't fit all the symtons. Do I I have fit all the symtoms to have IC? Anyway, I'm on antibiotics but that's not working.I went searching for a urologist and the first appointment any doctor could give me is in a month from now. (that's a long time to be bent over with pain).I'm wondering what could be causing SO much sloffing. Also wondering if bladder cancer can cause that too.If someone out there has anything clue to the increase everday sloffing and pain, please post a comment. I'm kind of anxious.",
            "post_id": "3038293",
            "timestamp": "1213471786",
            "user_id": "user_481556",
            "user_link": "/personal_pages/user/481556",
            "votes": "0"
        },
        {
            "answer": "You need to see a nephrologist, rather than a urologist, have your GFR (glomerular filtration rate) measured.  Mine has been low since about Jan., when I was diagnosed with Stage 3 CKD (chronic kidney disease).  The thing is, since then, I've noticed these bubbles in my urine as you have described.  They were probably there for some time, but I've only noticed them since my diagnosis.Angie",
            "post_id": "3071720",
            "timestamp": "1214213853",
            "user_id": "user_541272",
            "user_link": "/personal_pages/user/541272",
            "votes": "0"
        },
        {
            "answer": "so i went to see a urologist and had a cat scan of my kidneys and xrays taken of my bladder.  The doctor said my urine is clear and also said my scan and xrays were clear.  although he also checked my prostate and said it was tender. So he gave me antibotics for an infection.He said he didnt think i had an infection because there was nothing in my urine.  Now I also had a burning in my lower to mid back which was uncomfortable, and since i've been taking the antibiotics my urine has cleared and the burning goes away.  I'm thinking something must be wrong because when i miss my dose the burning comes back slightly anyway.",
            "post_id": "3098450",
            "timestamp": "1214788995",
            "user_id": "user_282315",
            "user_link": "/personal_pages/user/282315",
            "votes": "0"
        },
        {
            "answer": "Hi ultrasound scan of kisneys and bladder does not rule out any kidney diseases unless the kidneys have been so damaged and they look different in sizes.If your urine culture doesnt have any bacterial growth, I would suggest you see a nephrologist. Can you tell me, do you have any RBC, WBC or protein in your urinalysis?",
            "post_id": "3099343",
            "timestamp": "1214816312",
            "user_id": "user_505597",
            "user_link": "/personal_pages/user/505597",
            "votes": "0"
        },
        {
            "answer": "Everyone keeps saying that my urine is clear.  Which i dont understand because i do believe it is cloudy.  I can go to the ER, but i need to know exactly what i need to ask them for.  The first time i went.  the doctor said my urinalysis came back fine. And when the urologist looked at it under the microscope he said it was clear. And it wasnt an ultra sound.  it was a KAT scan are they the same thing?Thanks Vivian.",
            "post_id": "3119576",
            "timestamp": "1215238726",
            "user_id": "user_282315",
            "user_link": "/personal_pages/user/282315",
            "votes": "0"
        },
        {
            "answer": "i have frothy urine & blood in my urine.I get very tiired butno pain. I have been tested on several occasions for diabetes but always negative. what does anyone suggest",
            "post_id": "3909454",
            "timestamp": "1232754022",
            "user_id": "user_743226",
            "user_link": "/personal_pages/user/743226",
            "votes": "0"
        },
        {
            "answer": "Hi,  my son who is seven had a sinus infection so we went to the dr. and they checked his urine and it had protein in it so we did a first morning urine check and their was no protein in urine but their was alot of bubbles and strong smell but the dr. said that it didn't mean anything i'm still concerned any suggestions of what it could be or what i should do?a worried mom",
            "post_id": "4125914",
            "timestamp": "1237905391",
            "user_id": "user_803139",
            "user_link": "/personal_pages/user/803139",
            "votes": "0"
        },
        {
            "answer": "I RESENTLY HAD A VERY ITCHFUL VIGINIA, SO I FREAKED AND CALLED MY DOCTOR TO FAX A YEAST PILL TO THE PHARMACY, AFTER TAKING THE PILL I NOTICED THE ITCHING STOPED BUT THEN MY CLITIRUS WAS PAINFUL AND ALSO NOTICED ONE SINGLE MEDIUMISH BUBBLE IN MY URINE, DOES ANY ONE KNOW WHAT THIS MEANS?",
            "post_id": "4369570",
            "timestamp": "1240102677",
            "user_id": "user_875832",
            "user_link": "/personal_pages/user/875832",
            "votes": "0"
        },
        {
            "answer": "hello, at this moment, i have a sinus infection (i am twenty three years old though) and my urine also has a lot of bubbles and strong smell. These bubbles are out of character for me, i do not have any kidney disease and my bladder is fine, i also got worried because the bubbles are rather shocking when you see them; it makes you feel that something is seriously wrong, but i have been told that it is just a symptom of my sinus infection.",
            "post_id": "4614685",
            "timestamp": "1246433766",
            "user_id": "user_954611",
            "user_link": "/personal_pages/user/954611",
            "votes": "0"
        },
        {
            "answer": "Wow - so many different issues in one post.  First let me say I went to a urologist for years because of a genetic kidney cancer that runs in our family.  I had urine tests in his office, cat scans and even a bladder scope.  Was told I had blood in my urine but all else was ok.I found out last fall that I have something called IgM Messangiopathy.  I was diagnosed because I had nephrotic syndrome at the time - swelled up and all of my blood tests were all wacky.  I now see a nephrologist.  I had frothy urine but only after my condition got bad.  Had swollen ankels on and off for years but nothing like when diagnosed.  At that time I had gained 70 pounds and was VERY swollen everywhere!I have read that a really large part of the population has kidney problems but are not diagnosed.  I would suggest a 24 hour urine test to check for protein.  It seems to be the really good way to find it.  It did not show up for me in the urine tests in the office.  I think those were checking for infection, kidney function and cancer cells.  I know after I was diagnosed and being treated I had to go for a blood test every week to check kidney function and a 24 hour urine test once a month to check for the amount of protein in the urine.I hope everyone on here gets checked for kidney problems.  It is best to find them before they damage your kidney.  Best of luck!Laura  :)",
            "post_id": "4641703",
            "timestamp": "1247157105",
            "user_id": "user_146110",
            "user_link": "/personal_pages/user/146110",
            "votes": "0"
        },
        {
            "answer": "hi..i am 18 years old...i've bubbles and strong smell in my urine.please could anyone tell me what does it mean??is it  dangerous or not??",
            "post_id": "5399779",
            "timestamp": "1266830765",
            "user_id": "user_1220686",
            "user_link": "/personal_pages/user/1220686",
            "votes": "0"
        },
        {
            "answer": "Hi....my metobolic counts indicate that my eGFR is stage 3 CKD, however I have never had a urinalisis, my Dr. said, my counts were all normal.Craratinine serum (H) 1.21 mg/dL  0.57-1.00dGFR                  (L) 45    mL/min/1.73  <59Just commenting. I don't know if I have anything, since he said, everything was normal, and there has been no urinalis.",
            "post_id": "5437107",
            "timestamp": "1267737032",
            "user_id": "user_1220571",
            "user_link": "/personal_pages/user/1220571",
            "votes": "0"
        },
        {
            "answer": "Hi all, 2 weeks ago my feces color was light and used to float with a strong smell so I took Flagyl 400 mg for 5 days 3 tablets per day, I started to have pain in my lower abdomen and swollen testicles I kept on taking flagyl so I have a dark brown feces now mucus free and I think Normal odor , when Flagyl course is over I started taking VIBRAMYCIN 100 mg twice a day coz I believe I had symptoms for an STD (Chlamydia) my urine used to be cloudy now after the 3rd pill the pain is very less my urine is light yellow colored with normal odor with a presence of white foam. still have 5 more days with the treatment but really worry about the foam can anyone tell me if this normal? Thanks",
            "post_id": "5697872",
            "timestamp": "1274268594",
            "user_id": "user_1318719",
            "user_link": "/personal_pages/user/1318719",
            "votes": "0"
        },
        {
            "answer": "Everyone has bubbles in their urine.  If there weren't bubbles in your urine, what kind of world would this be?  Drink more water.  The bubbles are made from undiluted toxins in your urine stream.  Dilute them, flush them out, and pee freely.  Don't drink soap or laundry detergent.  If problem persists, consider a debubbler.The boundary layer between the stationary and turbulent flow regime in the toilet may be causing freak waves in the seiche-like effects of your urine discharge to the toilet water body.  You may want to consult a hydrodynamics specialist to address the serious urine-water interactions occurring in your toilet.But seriously, when I pee, my urine is yellow, and I see bubbles.  When I drink more water, it mimics water, and is clear and not as bubbly.  You are a man of civilization; you don't live within natural reality.  Holy ****! There is an ad for chicken wings at the bottom of this page! I need chicken wings!Good day to you sir.",
            "post_id": "6182447",
            "timestamp": "1285480280",
            "user_id": "user_1457064",
            "user_link": "/personal_pages/user/1457064",
            "votes": "0"
        },
        {
            "answer": "My urologist told me bubbles in the urine can come from yeast. Not always candida albicans. Specifically ask for a FUNGAL culture of your urine, The lab does not always do this and you have to ask. If it is a yeast infection, have them culture for type and sensitivity, Npn-albicans yeast usually requires different anti-fungals than candida albicans. Can be azole resistant.",
            "post_id": "6458961",
            "timestamp": "1292524465",
            "user_id": "user_1536161",
            "user_link": "/personal_pages/user/1536161",
            "votes": "0"
        },
        {
            "answer": "If a new born baby was to pee in a comode, it would bubble.  It is normal.  In your city water, there are so many PPM of clorine in the water. If you was to pee in strait bleach. it would foam all over the place.  Also, Do you have something that you put in the back of your tank that you bought at the store to help clean or to turn your water blue?   You guys are going to die a young death if you keep worrying about stuff that is as normal as a the sun rising up of a morning.  If your pee is bubbley,  smile and the bubbles and have a nice day.  Stop worrying.Joseph.P.S.If you have blood in your urine, then worry, there is something going on in there, if you burn when you pee, go to doc. takes 10 min. to get a scrip for antibiotics then your all better.  If you go to pee and you find that your tally-whaker is gone.  Call your bf/gf/husband/wife and tell them  you want it back..   LOL",
            "post_id": "6517096",
            "timestamp": "1294300658",
            "user_id": "user_1553941",
            "user_link": "/personal_pages/user/1553941",
            "votes": "0"
        },
        {
            "answer": "jus today I used the bathroom and had a large amount of almost white thick foamy substance!! I used to abuse opiets(hydros/oxy cottons) greatly...ive been clean for one year using suboxen's. but since ive stopped using ive had a very hard time passing my stool(unusually large) each time I bleed....and jus today my urine was VERY thick and foamy can anyone give me any educated advice? Does this sound like any sort of kidney or colen diseases? Someone plz help!!",
            "post_id": "7799716",
            "timestamp": "1332629896",
            "user_id": "user_2088145",
            "user_link": "/personal_pages/user/2088145",
            "votes": "0"
        },
        {
            "answer": "Hi LoriI have the same symptom.  Started having foamy urine and then about a month later, noticed some sloughing.  Urine dipsticks X5 negative for everything.  Still having pain but only on the right side.  CT scan was negative one month ago.",
            "post_id": "8878516",
            "timestamp": "1361775184",
            "user_id": "user_4948583",
            "user_link": "/personal_pages/user/4948583",
            "votes": "0"
        },
        {
            "answer": "My boyfriend went to the bathroom and forgot to flush... There were a lot of tiny bubbles in the toilet.I asked him how long that has been happening, and he said his whole life.Should I be worried?",
            "post_id": "8985735",
            "timestamp": "1364874337",
            "user_id": "user_5187525",
            "user_link": "/personal_pages/user/5187525",
            "votes": "0"
        },
        {
            "answer": "If its been happening his whole life then probably nothing dramatically wrong or other symptoms would likely be apparent. However, having said that, I have ckd (chronic kidney disease) and my urine has so many bubbles in it that a beer pourer would be jealous, that is it has more bubbles than a well poured beer head!!!!!  have tests for protein and kidney function.",
            "post_id": "8986217",
            "timestamp": "1364896309",
            "user_id": "user_4822967",
            "user_link": "/personal_pages/user/4822967",
            "votes": "0"
        },
        {
            "answer": "I occasionally have bubbles in urine and and the amount will be high if I urinate with lot of force,  i am bit confused after reading all your posts< if i have to check or not",
            "post_id": "9688603",
            "timestamp": "1385240167",
            "user_id": "user_438980",
            "user_link": "/personal_pages/user/438980",
            "votes": "0"
        },
        {
            "answer": "Regarding the the white tissue you saw when urinating. I am having same thing. What was your final diagnois?",
            "post_id": "9726778",
            "timestamp": "1386272688",
            "user_id": "user_6939201",
            "user_link": "/personal_pages/user/6939201",
            "votes": "0"
        },
        {
            "answer": "I have bubbles in my urine which is caused from the vaginal suppository base used. I take vaginal diazepam for pelvic floor dysfunction. Certain fatty or peg bases cause itching, frothy urine, and a urinary stream that seeps back to the anal area. What is frustrating is that this compounding pharmacy gets it right one month, where I have no symptoms, then the next prescription I get bubbles in urine with irritation and having to wear a panty liner. Soooo frustrating.",
            "post_id": "9984259",
            "timestamp": "1392924096",
            "user_id": "user_7643254",
            "user_link": "/personal_pages/user/7643254",
            "votes": "0"
        },
        {
            "answer": "OMG. Chill out people. Everyone gets bubbles In their urine when peeing directly into the bowl, especially guys, it's normal. Society has so many people scared up of everything nowadays. Everywhere you look you see ads about cancer, heart disease, diabetes, kidney issues. It's all meant to make you worry. They know that what you think about, you bring about. It is the Law of Attraction. We become what we think about. I would not worry about anything unless you are very very deathly Ill. another thing that can cause bubbles is Candida and dieoff from it. I have plenty of bubbles some days,but when I drink water it goes away. Also when I pee in a cup or something it has no bubbles at all. Everyone needs to chill out or you will cause something bad to manifest in your body temple. Smile and enjoy life, it is an awesome trip.",
            "post_id": "10565308",
            "timestamp": "1402699470",
            "user_id": "user_9262455",
            "user_link": "/personal_pages/user/9262455",
            "votes": "1"
        },
        {
            "answer": "Well said mate..!! I've had bubbles for years it's nothing, get a cup of water & poor that in to your toilet & that makes bubbles too, doesn't mean the water has got an infection does it!",
            "post_id": "11443353",
            "timestamp": "1414773693",
            "user_id": "user_11037435",
            "user_link": "/personal_pages/user/11037435",
            "votes": "0"
        },
        {
            "answer": "Hi,There are some common causes for bubbles in urine. Those are dehydration, high-velocity pee, toilet water and pregnancy. Some chronic reasons for the same are preeclampsia, proteinuria, vesicocolic fistula, urinary tract infection. So if you have any of these symptoms and causes then check with your doctor and get treated. Read this article also for more information: http://www.doctorshealthpress.com/general-health-articles/bubbles-in-urineThanksSamara",
            "post_id": "13874156",
            "timestamp": "1464846358",
            "user_id": "user_18435252",
            "user_link": "/personal_pages/user/18435252",
            "votes": "0"
        }
    ],
    "post_id": "2827000",
    "question": "Hey I have recently been experiencing a varying amount of bubbles in my urine. I went to the emergency room and they sd i didnt have any protein.  He also said i didnt have kidney problems.  I think they were just rying to rush me out. They gave me a sheet and advd that i go see a urologist.  The doctor also asked me if i was ever tested for stds.  I said no, because the only sexual activity ive ever engaged in is body contact.  Can an std cause bubbles in urine.  what could it be if not protein?Many thanks.",
    "timestamp": "1209135733",
    "title": "bubbles in urine",
    "user_id": "user_282315",
    "user_link": "/personal_pages/user/282315"
}