{
    "answers": [
        {
            "answer": "Thanks for updating...I am glad your surgery went well and you are home resting! I was going to do it just to see my name at the top of the BFP list but never had a chance to get on the computer...always on my phone :( I am 23 weeks today and i am having a BOY!!! Just completed my 2 hour gloucose tolerence test (failed the gestational diabetes test) and we will see how that goes, and my BP has been normal everyday so not sure what was going on with my DR. I am going to have to talk to her about stressing me out for no reason!!",
            "post_id": "6746269",
            "timestamp": "1300459295",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "I am still having to take Z.ofran for m/s. It has gotten much better though. I will be 16 weeks Sunday. My next appt is 3.30 with a midwife. We will schedule our anatomy scan at that point. My DH and I both have sinus infections and are on antibiotics. Baby C turned 8 months last Wednesday. She has a double ear and sinus infections. Geesh, what a week! We are STILL waiting to hear a court date for her finalization!",
            "post_id": "6747347",
            "timestamp": "1300482875",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Thanks for the welcome all.dnikki, hope the recovery from your surgery heals fast! It's hard not to pick up your little ones when they want you so bad, but speaking from experiance try and resist, it can really cause you to heal badly on the inside and it can make your outside scars really big and nasty if you are streatching, bending and lifting heavy things.krichar, does your dr have you taking your BP because it was high when you went in? If so it might have just been a one time thing, but being abel to check it at home everyday should help easy yours and your dr's minds. Congrats on the little Boy! Have you picked out a name yet? Dh and I have the hardest time with boy names, maybe that's why we had girls lol.rachjas, does the zofran help when you take it? I get horrible ms when I'm preggers and have never taken anything for it :( Hope the you and your family get over being sick very fast! It's the hardest thing when your baby is sick. Does it usally take so long to get the finalization?AFM, just now 7dpo and not really feeling much. I had a horrible headache last night that wouldn't go away. Usally when I fall asleep my headache's go away by the time I wake up, but not last night. Very weird, but it has never been one of my pregnancy symptoms before. The only symptom I can say I have is extream fatigue right AF is due but with two children I have that symptom all the time lol. Just a little stressed out right now because there's a chace we might not get paid next month, so saving up now.Hopeing all is going well with everyone with ttc, pregnancy and raising your babies!",
            "post_id": "6750741",
            "timestamp": "1300609434",
            "user_id": "user_581359",
            "user_link": "/personal_pages/user/581359",
            "votes": "0"
        },
        {
            "answer": "Thank you everybody!!! we are so blessed last night we where all crying staring at baby!!! I cant thank u guys enough!!!  this has been an incredible journey and will do it all over again but we are done..Afm- burns and blisters on my right hand due to airbag but im just grateful baby was born ok.  Car totalled but the nice part is i finally got a Honda Odyssey I have been wanting. New baby new car cant ask for more..... will post new pics soon ttyl xoxoxo",
            "post_id": "6753999",
            "timestamp": "1300721688",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Just an update. I am doing really well. With this pregnancy it's so much different from my son.....I really don't have an appetite, but that's not really a bad thing. I had my 1st u/s the 10th....the baby looks great we got to see/hear the heartbeat, it was 172!!!! :) :) :) I'm suppose to have my next appt the 31st, but am going to have to change it due to needing to take my mom for an appt. But all in all we are doing GREAT! Conner just turned 8 months :( the time goes by sooooooo fast!! I will be 13 weeks this Saturday!!",
            "post_id": "6759822",
            "timestamp": "1300876099",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "All-Well I didn't tell anyone I was TWW'ing but I was and it was BFN this morning.  Two weeks ago I was having really bad pains so I took an OPK and it looked as positive as it could be so we BD'ed and then I waited.  I forgot how aweful the TWW was and this morning I tested and BFN.  I really did expect it.  I haven't had any symptoms at all.  I was just hopeful that I would o on my own.  Doesn't look like it.  :(  When I go back for my yearly Pap in May I think I am going to ask about getting Clomid again.  I want my Shelby to have a sister...or brother.Guesito- I posted on your page but congrats again!  Beautiful baby.Luvkalyn- I hope you are well and I am sure you are soooo excited about a boy!  I know I would be!Krichar- I am so happy for you too.  Things seem to be going ok and I hope that the glucose test turns out to be just fine!  Y9ou so deserve an easy pregnancy!",
            "post_id": "6763320",
            "timestamp": "1300969343",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "sbumblebeeo- I am sorry this wasn't your time...maybe next cycle :) Didn't clomid help you with Shelby? Maybe that is the magic ingredient you need!!AFM- Completed my 2 hour glucose test and I haven't heard back yet. I am pretty sure if i was diabetic they would phone ASAP as i took the test a week ago. So I guess i am in the clear for that..woo hoo!! So far blood pressure is good too, pretty much perfect although one day it was high and one day it was low! Time keeps ticking away, 24 weeks tomorrow!!! Nursery is pretty much done...just a few touch ups to do! I will post pics as soon as more mom's to be in my group start their nurseries...lol!!! i don't want anyone stealing my ideas..he he he!!!",
            "post_id": "6763777",
            "timestamp": "1300980186",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "I haven't been on in a while. Yay for all of the BFPs!  Annabelle and I are doing well and adjusting to this craziness that we call life. She'll be 6 weeks on Monday... so hard to believe that much time has passed already. Annabelle is growing quickly and making up for her initial small size. She's holding her head up really well, very alert, rolling on her side but not quite to tummy yet, and she loves loves LOVES her daddy  :-)",
            "post_id": "6765188",
            "timestamp": "1301010185",
            "user_id": "user_1345697",
            "user_link": "/personal_pages/user/1345697",
            "votes": "0"
        },
        {
            "answer": "Yay for not having the ges diabetes.  24 Weeks already!  That is so exciting.  You are do at the exact same time as my best friend.  Her cervix is shrinking though already.... :(  Looks like bedrest is in her future.  I'm looking for pics of the nursery too  :)  As for clomid.  I had to use it all three times I got pregnant.  I guess I just had hoped after I had a baby it might help my body figure out what it is supposed to do but since I've only had one period since my daughter was born almost one year ago I guess not.  We'll be talking to the doctor about it in May!Take care and rest up!",
            "post_id": "6766232",
            "timestamp": "1301052987",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "sbumblebeeo- I hope that you don't even have to wait until May! Hope you get your sticky BFP soon!krichar- 24 weeks! That's awesome.We will be 17 weeks Sunday!",
            "post_id": "6767919",
            "timestamp": "1301089321",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Hi al! :) I've been checking in, just not posting much.Sbumblebeeo- I'm so excited you're trying again!!! :) I'm sorry it was negative today! That's great you got a positive opk though! That's definately a good thing! You know, my cycles were irregular after having Addy too. My very first AF after stopping nursing her, I got pregnant but as you know m/c'd but what's crazy is I didn't ovulate until CD 42! I had a regular AF after my m/c, and then we decided to start trying again. I started taking fertility blend for women, which regulates your cycles and I took it for one month, and I ovulated on CD 24, which was a huge improvement! And ta-dah... we got pregnant with our baby boy! :) We know clomid definately does the trick for you, but the fertility blend is all natural. Maybe you could look into it! :)Krichar- Hoping that no news is good news on your test! :) Wow girl, you're good! You have his nursery done already??!! I've just now started buying stuff for little Sean! I can't wait to see pics!! :)trh- Aww! Annabelle sounds like she's just doing perfect!!! :)Rachjas- Yay, almost 17 weeks!! Congrats!! :)Not much new going on here. We have our next u/s next Friday at 9am, and it'll be an hour long so I can't wait! :) I feel little Sean move all the time and I love it! He's doing wonderful! :) Addy was sick last week, but thankfully she's doing much better!!! It's no fun seeing your baby sick! :( She's getting so big and doing so much, she's such a blast! Hope everyone has a wonderful weekend!! :)",
            "post_id": "6768113",
            "timestamp": "1301094081",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Yamiliany just turned 2 wks yesterday shes doing great, had 2 episodes of projectile vomiting nose and everything but doing great!!",
            "post_id": "6778259",
            "timestamp": "1301417160",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "After an ordeal with the doppler; the midwife gave us a quick ultrasound. If you read my blog, I talk about it more.The Baby is doing great! They also drew blood for the next set of genetice testing.My next appointment is 4.20.11 at 2:00pm for our anatomy scan. At this point we can find out gender if we decided to do so. At 2:15pm the same day we are scheduled four our 20 week check-up. We have decided to take off work that day to celebrate!guesito - 2 weeks already!!!",
            "post_id": "6782640",
            "timestamp": "1301524584",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Time seems to be flyin for everyone!! That's good it means my time is too even if doesn't feel like it!Rach- so do you think you will find out the sex? I am so not good with surprises somi had to know!! I can't believe you are almost 1/2 way there!Guesito- she is already 2 weeks...!!!! Crazy!!! How is she doing? How are you doing? Everyone healing ok? How is dealing with a baby again... Just curios as you and I are living parallel lives... Lol!! Both of us have older kids from other relationships, we are the same age and both went through many fertility treatments! Crazy isn't it!!AFM- 25 weeks this Friday... Still can't believe I have made it this far! I haven't heard back from the doctor about my 2 hour diabetes test and that was 2 weeks ago so I am assuming I am fine. I do have an appointment tomorrow so I will ask. That reminds me I should make a list of questions as I never ask any and then remember on my way home...lol!!",
            "post_id": "6782674",
            "timestamp": "1301525393",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Hello all,baby had appmt today she already weighs 6lbs 8 onz =) from5 lbs15 onz@ birth   2 weeks ago. im very pleased with her weight gain,Krichar- no sleep for me but not complaining my older kids are so helpful and in love with her so im sure you will have a great help too.",
            "post_id": "6783343",
            "timestamp": "1301540355",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Guesito- Aww... 2 weeks old! :) She's sounds like she's doing just wonderful!! :)Krichar- Yay, almost 25 weeks! :) I'm the same way, I have my list already started for my apmt tomorrow! lol!Rachjas- So glad the baby is doing great, and how awesome you're anatomy scan is almost here! :) I have a feeling it's a girl, don't know why! ;)AFM: 20 weeks today! :) Little Sean is SO active, I feel him all the time and I just love it! :) We have our anatomy scan tomorrow, which will be about 45 min long so I can't wait to see him! Adalynn is doing great too! She's finally over being sick completely, thankfully it didn't last long. We're moving this weekend and have absolutely nothing packed! Yikes!!! I have to be at work at 2 so I'm going to go do some packing!",
            "post_id": "6784819",
            "timestamp": "1301587353",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Appointment went great... I wrote a journal about all of it if you all want to read it! I have been upgraded to appointments every 3 weeks instead of every 4!!",
            "post_id": "6786703",
            "timestamp": "1301628861",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "25 weeks today.. Woo hoo!!",
            "post_id": "6788998",
            "timestamp": "1301699804",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "it is so quiet on here...How is everyone doing? anything new to report or is it quiet because there is nothing new...lol!!!",
            "post_id": "6799278",
            "timestamp": "1302029736",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "luvkayln- How did your 20 week appt go?krichar- 25 weeks! That's great that you have appt closer together!AFM- My 20 week appt was moved from the 20th to the 19th! Hey, it's one day earlier! I will have my anatomy scan and regular check-up that day. I think that we have decided to find out gender! We are taking that day off of work. We should be hearing our court date any day now for Baby C!",
            "post_id": "6800324",
            "timestamp": "1302052582",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "krichar: BFP!!!! 25wks!!!!Luvkayln: BFP!!! 21wks!!! Having a BOY!mlward3: BFP!!! 16wks!!rachjas: BFP!!! 18wks!!!ad_06: BFP!!! 15wks!!?cminamyer:Bfromthed:jmh: Awaiting thyroid results...? Hopefully back in the game soon!!!Sammy J:Nino7:Keyan:Candie: Great to hear from you!! Needs advice and stories from anyone who's had medicated cycles. Please share :-)Waiting for an update:HannahpyarBabyMaddprincessJamNikinaTaking a BreakLinamrspace*****************************************************************************************************Hi ladies :-) I've been checking in on everyone, just not posting much. I actually have been active in the Endometriois forum b/c of everything I've had to deal with. Just yesterday I actually became the Community Leader there :-)How is everyone feeling/doing? It seems like everyone's pregnancies are going by so fast!!Krichar: I'll check out your journal ASAP!!Things are going pretty good here. I'm still a bit sore from the hyster and all. I got my surgery report back - endo on the diaphragm, some of the ligaments, sigmoid colon. Intestinal adhesions..oy, glad it's over that's for sure! I did go back to work, but easing myself into it since my job is pretty physical. Both kids are doing great although I think they are starting to get cabin fever! One day it's 65 here and the next it's snowing and 35 :/ Hoping the weather breaks soon!!I hope I have everyone right on here, it's been pretty quiet on this thread lately. Where's everyone at?",
            "post_id": "6800396",
            "timestamp": "1302054333",
            "user_id": "user_478429",
            "user_link": "/personal_pages/user/478429",
            "votes": "0"
        },
        {
            "answer": "Krichar: I tried to view the journal but it won't let me, I tried to leave a note and it said you weren't accepting notes at this time, so I sent a friend request. I thought I had frienships on here with everyone on this thread but I guess not!!",
            "post_id": "6800412",
            "timestamp": "1302054676",
            "user_id": "user_478429",
            "user_link": "/personal_pages/user/478429",
            "votes": "0"
        },
        {
            "answer": "Sorry... I accepted you!!! Their privacy on here is a little weak, Did you know that if you google your nickname it comes up with all your info you post!!! I shut things down to keep it a little more private!",
            "post_id": "6800428",
            "timestamp": "1302055193",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "*Gasps* I didn't know that!!! I thought I had my stuff set to private? I'll have to go back through, but yes I just did the google!! Everything came up in the search recommendations!!",
            "post_id": "6800451",
            "timestamp": "1302055775",
            "user_id": "user_478429",
            "user_link": "/personal_pages/user/478429",
            "votes": "0"
        },
        {
            "answer": "I KNOW!!! I deleted my section \"about myself\" set my notes to private and deleted my location. That way it isn't that \"open\" And now i try to not be so specific in the public forums...I try to complain in my journals and put private stuff there because that is still private!!",
            "post_id": "6800470",
            "timestamp": "1302056256",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "We have a court date! Baby C's finalization is 4.20!",
            "post_id": "6805795",
            "timestamp": "1302208635",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Yay congrats!!!! You must be soooo excited!! Finally!!Afm- I entered the \"bump of the month\" contest.. *wink, wink* lol!!!",
            "post_id": "6806063",
            "timestamp": "1302214237",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "yes I will be 15 weeks this saturday!! April 9th!!How is everyone?",
            "post_id": "6808042",
            "timestamp": "1302279434",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "hello ladies...congrats to all the preggo status! let's see if can catch up...just letting you all know I had my first, and hopefully the only one, iui done today.",
            "post_id": "6809112",
            "timestamp": "1302305476",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "DD is in hopital, was wheezy yesterday and rapid/labored breathing. Stayed overnight she is okay but pulse ox drops to 80's when she sleeps. She' on O2, Albuterol and steroids. Probable staying tonight too :/ Possible bronchiolitis.  All prayers are welcomed and appreciated.",
            "post_id": "6815163",
            "timestamp": "1302533284",
            "user_id": "user_478429",
            "user_link": "/personal_pages/user/478429",
            "votes": "0"
        },
        {
            "answer": "I am sorry your little princess is sick, hopefully she gest better soon.",
            "post_id": "6815288",
            "timestamp": "1302535516",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Keyan- Hi!!! We've missed you lady! :) So yayy, you had an iui done! How exciting!!!! We need details...! How many follies did you have? Did they put you on progesterone? I'm so excited for you, my fingers crossed that this is definately your last iui you'll have to have and you get your BFP in the next couple weeks! :)Dnikki- So sorry to hear about your little one! It's always hard when they're sick, especially when they're this young and your so limited on what you can give them. :( Hope she gets better soon!Krichar- Yay girl, you are moving right along! :) Not too much longer to go! Are you ready to share those nursery pics yet? Hehe! :)Rachjas- Oh awesome, that's so exciting you finally got your date! The 20th will be here before you know it! How are you feeling?ad_06- Happy 15 weeks! Are you finding out what you're having?AFM: Sorry I've been mia! We moved last week and this house finally looks like home! :) We had my 20 week apmt, and baby looks great! He's still a HE, lol! :) He was so cute, moving all over and kept showing off his like winky, haha!! The tech kept saying how proud he was of it, lol! We are set to be induced on August 12th, which will be 39 weeks (only b/c it'll be easier if it's set to get Addy taken care of since my mom will have her while we're in the hospital and she's so busy at work in August). Addy came at 37.5 weeks, so he may decide to come early too, but at least I know he'll be here by the 12th! :) I've been doing lots of shopping for him, getting more and more into \"boy mode!\" It's hard to transition after having a girl, :)! But I get more and more excited every day! I can't wait till he's here, our family will be complete! :) Well, hope everyone's been doing good!! TTYL!! :)",
            "post_id": "6819836",
            "timestamp": "1302656346",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Just checking to see how DD is doing? I hope she is better and on her way to recovery!!",
            "post_id": "6819837",
            "timestamp": "1302656364",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "dnikki0928,Am sorry to about your baby. children get sick and its really hard because they are too little to say what wrong or what's hurt. Hope she will be better soon.Please note that am 16 week pregnant so you can fix my status in the list :)Keyan, I am so glad you did an IUI.. my prayer for you to work. I pray to see your post with BFP sooooon  :)miracles always happen, just we need to keep our faith in God. He always there for everyone.",
            "post_id": "6820534",
            "timestamp": "1302682531",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "krichar: BFP!!!! 26wks!!!!Luvkayln: BFP!!! 22wks!!! Having a BOY!mlward3: BFP!!! 17wks!!rachjas: BFP!!! 19wks!!!ad_06: BFP!!! 16wks!!Nino: BFP!!! 16wks!!Keyan: 5DPIUI!!!cminamyer:Bfromthed:jmh: Awaiting thyroid results...? Hopefully back in the game soon!!!Sammy J:Candie: Great to hear from you!! Needs advice and stories from anyone who's had medicated cycles. Please share :-)Waiting for an update:HannahpyarBabyMaddprincessJamNikinaTaking a BreakLinamrspace*****************************************************************************************************Thanks ladies :-) Peyton is doing much better and she can probably go home today. Monday night we thought she was doing better, but when she got into a deep sleep her O2 stats dropped into the low 80's again and she required oxygen all night. At her 12a.m albuterol treatment early Tuesday morning I noticed she sounded like everything was breaking up and she had a productive cough. She was on no oxygen all day yesterday (even naps!!) and while napping kept it at 94%. They did 4hr checks on her last night instead of constant monitoring and she was in the high 90's each time which is great! So, hopefully we'll see the docs in a few hours and we'll be on our way home :-) Thanks for all your thought and prayers :-)",
            "post_id": "6820630",
            "timestamp": "1302688215",
            "user_id": "user_478429",
            "user_link": "/personal_pages/user/478429",
            "votes": "0"
        },
        {
            "answer": "dnikki: Hopefully today you go home, I am glad she's doing better.Luvkayln: ;-) Thanks! Congrats on your little boy!! there is so much to catch up on! ...well I had between 6-8 follies between 16-20 the day before IUI, the RE gave me the trigger shot that day (novarel) and the next day about 29 hrs later we did IUI, 34 mill sperm and although he did ck on my follies that day,  I didn't really pay attention, was to nervous, uncomfortable and sore....to stimulate I did femara and menopur injections, after IUI I did just one pill of antibiotic and then 2 days later started progesterone suppositories, estradiol pills and a prenatal vitamin....it's my first IUI and we went all the way with meds!! the only negative I can say is that Femara made me have brown spotting and my lining was at 6.5 the day before IUI.NiNo: Congratulations!!!, and thank you!",
            "post_id": "6820833",
            "timestamp": "1302698347",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Hello allKrichar, dnikki & keyan left you guys notes :)hope everyone is doing good love the bfp list is growing so quick Keyan hope to see you there soon.Afm- doing great baby is  she has gained 3 lbs since birth shes at 8lbs already she will be 1 month old tomm yey!!! im so happy spending lots of time with her, her belly button just fell off yesterday took forever, shes very tiny her nb  clothes are starting to fit :) Im feeling great c section pain all gone.  ok TTYL xoxoxo",
            "post_id": "6822575",
            "timestamp": "1302734236",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Oh forgot to mention i miss seeing my name on the list :)",
            "post_id": "6822578",
            "timestamp": "1302734284",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Guesito- I am so happy Yamiliany and yourself are doing great!! I soooo can't wait... I can't believe she is already a month already, time sure flies!! It is still shocking to see my name on the top of the list, I still don't believe it!dnikki- I am so happy to hear the Peyton is doing better...it is so hard when they are sick especially in the hospital. The worst i have ever had to deal with is really bad croup...I can't imagine bronchitis!!Luvkayln- How are you doing? I can't believe how fast time is flying for you...like I said before it still feels like it is dragging for me, but i have to remember for every week that flies for you is another week for me!!Rach- How are you doing as well? Did you find out if your team pink or blue yet? I guess I will ahve to go check your blog to see!!sbumlebeeo- How is ttc going? You have your appointment soon? still going to get clomid?AFM- I will 27 weeks tomorrow with my little man! We have decided on the name Tristan Blair. We love the name Tristan and Blair is DH's middle name. I can already tell he looks like DH...I took a pic of DH's side profile while he was sleeping and compared it to our 19 week u/s side profile and YUP...it's his...LOL!!! It is so amazing you can see the resemblance so soon!! We have our 3D/4D u/s on the 23...I am so excited!!!",
            "post_id": "6824526",
            "timestamp": "1302795817",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "I haven't logged in for a couple of weeks until now.  I must have known you were thinking of me!  THANKS!  I haven't scheduled my appointment yet.  I did order Fertility Blend that luvkayln told me about today though.  I think I am going to try that for the next month and see what the doctor says about it and if I should get a script for Clomid.  DH says he wants to wait for now.  We have been arguing a lot lately.  It's just dumb stuff like how he doesn't help out more.  If I just keep my mouth shut and do it all myself he'll get on board again.  I guess I can if that means Shelby gets a sibling.Thanks for mentioning about our journals.  I went in and changed my list to friends only on everything.  I can't believe you can google your user id.  That is CRAZY.How are things with you?  I haven't seen a post for awhile.  I do see you are next on the list.  That is awesome and I am still sooooo very happy.  Take care and rest up!",
            "post_id": "6824737",
            "timestamp": "1302801166",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "dnikki- I am so sorry ur lil one was sick! How is she now?sbumblebeeo- I am sure that things will pan out. I hope that Fertility Blend does the trick!guesito- She is getting so big!keyan- It's nice to see you back!AFM- Our gender scan is Tuesday at 11am est, but we will not be revealing gender until Friday! Baby C's finalization is Wednesday at 2pm est. We hosting a party next Friday in order to celebrate both occasions. We will be revealing the gender then!",
            "post_id": "6828689",
            "timestamp": "1302910106",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "rachjas-  you can tell your online friends early...  :)  Good luck at your scan.Anyone have an opinion on the name Cross for a boy?????  DH suggested it and I said NO WAY but it's kinda growing on me and it is so different.  He has a son Colton and we have Shelby.  Colton and Cross sound good but Shelby and Cross?  I dunnno....",
            "post_id": "6829033",
            "timestamp": "1302918919",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Yes we will be finding out! I have me scan scheduled for May 10th! I am super excited!!! I can't wait ;)Everything here has been pretty good, this pregnancy is way different than with Conner. I've had trouble losing weight this time around....I lost 8.5 lbs, but have gained 2 of them back! Heck I think with DS I probably gained 15lbs by now...lol I'm pretty exhausted all the time, but taking care of a 9 month old and being pregnant isn't that easy, but I wouldn't change it for the world!Conner will be 9 months on the 17th! I just can't believe how the time flies!!! He's a big boy weighing 21lbs!!! He already has 8 teeth!!!! They sure do grow fast!!",
            "post_id": "6829221",
            "timestamp": "1302923828",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "ad_06- May 10th will here really soon!sbum- I like the name! It's different!AFM- Tomorrow is the big day! I will post how the appt goes ASAP, but gender will have to wait until Friday evening or Saturday morning. Baby C's finalization is Wednesday! It's going to be a GREAT week!",
            "post_id": "6836675",
            "timestamp": "1303164201",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Keyan,You having 6 to 8 follies size between 16-20 is very good. Don't worry about your endo thickness much (probably by the time you did your iui it was above 6.5 because it increases everyday).You know that I was very concerned about my endo, and when I got preganant I think it was about or little less than 8.As I always say Keep your faith in God.My prayers to you, I hope we hear very good news very soon,dnikki0928, thank you for updating my status.Good luck to all,Nino",
            "post_id": "6838009",
            "timestamp": "1303212629",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "thanks for your support and sweet words, I really needed to hear that since I've startes to loose hope because, other than on and off af type of cramps, I don't feel nothing else, no sore bbs or anyhting :< thank you! ...do yoy know if your having boy or girl?rachjas- good luck today, and congrats about the adoption finalization, a year later we are still waiting for the \"call\" to go meet our adopted baby, next month we need to update our paper work.dnikki- hey you! how's the princess doing?",
            "post_id": "6838258",
            "timestamp": "1303219055",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "keyan- I hope that your call comes SOON!AFM- U/S went great! Healthy baby! Finalization tmw",
            "post_id": "6840463",
            "timestamp": "1303266612",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "I am so happy for you!! I left a note on your page! I can't wait to hear which team you are on!! Take lots of pictures tomorrow!",
            "post_id": "6840481",
            "timestamp": "1303266938",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Finalization went great! We are now a FOREVER FAMILY!I will do a blog post soon!krichar- Thanks so much for thinking of us!",
            "post_id": "6843230",
            "timestamp": "1303348627",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "YAY!!! I am so happy for you guys...what a great week!!AFM- 28 weeks...WOO HOO 3rd trimester here I am !!! So excited to get this far. Everything is going good so far. Blood pressure is good, no diabetes, measuring right on target and only gained 2lbs in 3 weeks (so far 4lbs since i was 17 weeks). They will send me for another u/s after my next appointment and I have graduated to appointments every 2 weeks. We have our 3D/4D u/s this saturday...I can't wait to see hi little face. Nurse also said she couldn't feel his little head so he is most likely head down...which makes sense i feel something in my ribs all the time, LOL!!!!!!",
            "post_id": "6845850",
            "timestamp": "1303426936",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Just a quick note to say I FINALLY added my nursery photos!!",
            "post_id": "6848408",
            "timestamp": "1303505904",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "hi...bfn on hpt, tomorrow i'm suppose to go in for beta, probably if no af by then, i will go.rachjas-congrats on your for ever family, :-D  have fun today at the celebration party!",
            "post_id": "6848641",
            "timestamp": "1303511414",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "It's a girl!",
            "post_id": "6851010",
            "timestamp": "1303605844",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Yay!  It's a girl!  That is awesome news.  Congrats!  Girls are awesome.  XOXXOLuvkayln- How are you and baby feeling?Krichar- Checking out the pics right now!  Excited.So how about the name Garrett Lee???  I am still trying to convince DH that another baby is a good idea.  He is so worried about everything.  Our house is too small, we need to make more money, blah blah blah.  He told me to get a script for clomid and we'll see what happens without BDing on the hour mark and temping and OPK's.  If I can agree to that he'll agree to get the meds.  MEN!  Don't they understand how nerve wracking this TTC crap is?  Oh well...Hoppy Easter everyone!",
            "post_id": "6851192",
            "timestamp": "1303610955",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Also posted my 3D u/s pics...Rach- Congrats!!! Another girl, so exciting!!!",
            "post_id": "6851285",
            "timestamp": "1303613364",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Rachjas- Another girl yey!!! they will be great sisters!! congratulationsKeyan- :(  dnt give up stay pos and strong.",
            "post_id": "6854638",
            "timestamp": "1303747850",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "I used to like the name but then I met a kid with it who is kind of a jerk... I am like that, if I meet someone along the way of life who has a name I always relate their personality to that name! Sorry... :(",
            "post_id": "6854674",
            "timestamp": "1303748598",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Thanks for the kind wordssbum- I like the name!",
            "post_id": "6855781",
            "timestamp": "1303774389",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Keyan,As I always say, never lose hope! you will get pregnant at sometime.I was very dispirit, and you may remember my notes. But things work and now I always pray to have a healthy baby.Last time we did the u/s the baby was facing down and bending the knees, so we couldn’t tell if it’s a boy or a girl. At first I wish it’s a girl, but now I say I love the baby whether it is a boy or a girl.  I have an u/s on May 10th, I hope to know, because we need to buy things for the baby. Its really hard to find a unisex things, everything either for a boy or a girl (few things that can be for both).rachjas0623: congrates on your baby girl :)krichar: Me too. I agree with you with your statement \"meet someone along the way of life who has a name I always relate their personality to that name!\"",
            "post_id": "6856603",
            "timestamp": "1303802816",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "I'm the say way but since i don't know any and it's not on the top 100 list (one of my requirments)  I am leaning towards it.  Lee is my middle name and my fathers so that is going to be regardless of the first name.I am still trying to convince DH that it's a good idea to try again this summer.  He is fighting me but tells me go ahead and ask the doctor for a script of Clomid.  Does that make ANY sense?  I've gotten pregnant on it THREE times what does he think is going to happen?  I would really like a May baby so we'll see if he is on board by August  LOL",
            "post_id": "6857306",
            "timestamp": "1303830351",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Hi, ladies! I know it's been too long & wow! So much has happened... Congrats to Guesito & trh! Congrats also to Krichar, Luvkayln, rachjas, ad_06 & Nino!!! =] It's so exciting to see so many on the BFP list. I'm still in contact with a handful of you via text & Facebook, it's just hard for me to log on here with my phone. It's not quite as easy as Facebook for some reason.Ricky & Ava are 14 months old & doing awesome! They are a lot of work, but so much fun =] They grow so darn fast & their personalities are just too cute! Ava is a spitfire, but such a sweetie. She's always on the move &  loves to dance! Ricky is always happy & loves to smile at himself in the mirror ;) He says hi & bye, but with a southern accent! (We're in California) One of their teachers at daycare actually asked if either of us was from the south :) Anyway, they get along great & are usually very happy little one's :)Luvkayln: I can't believe you're so far along!!! Addy will be an awesome big sis! =]Rachjas: Huge Congrats on your finalization process & that Baby C will soon be a big sis! It's just such great news =]Ad_06: You & Rachjas are so similar, close in your pregnancy with babies about the same age! May 10 is so soon =] Looking forward to reading your update...Krichar: I had gestational diabetes with insulin shots, so hopefully you are in the clear; but if not, let me know. Geez, it's hard to believe that was so long ago... Do you have names in mind?Sbumblebeeo: I'm excited for you TTC again :) And I love names with meaning, like Lee :) Garrett is very masculine, yet cute. If someone knows a \"bad\" Garrett that changes the feeling of the name for them, Thryll just have to meet yours & change the feelings back ;-) Good luck!!! Shelby is adorable!Keyan: You know I'm always cheering for you guys! I'm praying for you, my friend =]",
            "post_id": "6861318",
            "timestamp": "1303935772",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Oops! And Congrats to mlward =]!",
            "post_id": "6861324",
            "timestamp": "1303935891",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Just dropping in to say 29 weeks today!! Woo Hoo!!!",
            "post_id": "6866027",
            "timestamp": "1304080524",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "hello ladies I have been gone for a while but Im  back check out my journal \"why I have been MIA\" it will explain it all...Had iui #9 done on Thursday though",
            "post_id": "6868699",
            "timestamp": "1304173018",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "adding to watch list",
            "post_id": "6868703",
            "timestamp": "1304173045",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "mommyin10- It's so great to hear from you! 14 months already! Thats amazing!",
            "post_id": "6869996",
            "timestamp": "1304217146",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "I finally updated my pics :)krichar:  Happy 29 Weeks!!! =]rachjas:  Thanks!  It's so good to see how wonderfully everything is working out for you :)bfromthed:  Best wishes to you & dh!  I will be thinking of you & praying your iui is a success :)",
            "post_id": "6870197",
            "timestamp": "1304223727",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "all: progesterone came in at 23.9 had it drawn 1 day early due to work schedule and re said that is fine so now the wait really begins. Not feeling anything at this point no sore bb's or anything but praying that all is well.",
            "post_id": "6876172",
            "timestamp": "1304439216",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "bromthed- Great progesterone numbers!",
            "post_id": "6877530",
            "timestamp": "1304470474",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "re called and had me have my progesterone redrwan it made me nervous cause yesterday it ws 23.9 which  know is good and today it is 32.8 so thats realy good. I was scheduled to have it drawn originally on today but thought due to my schedule I would not have time to do it. But I am 6dpiui and having no symptoms at all...just like this over all tightness in my stomach as if I have worked out or something. Not in the lowe abdomen but above the belly button as if I did 100 sit ups...I do get a few pains on the left (where I have no tube) nothing on the right (where I have a tube and the follie was 22 mm the day of trigger) not sure whats going on in there but I pray this works.",
            "post_id": "6879345",
            "timestamp": "1304527340",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "I go away for a while and come back to lots of catching up. Congrats on all of the BFPs and soon to be mommies!  Annabelle and I are doing well. I can hardly believe she's ELEVEN weeks. Seriously... where does the time go?  Much love and prayers to all of you!",
            "post_id": "6880923",
            "timestamp": "1304563753",
            "user_id": "user_1345697",
            "user_link": "/personal_pages/user/1345697",
            "votes": "0"
        },
        {
            "answer": "all: no symptoms 9dpiui all af signs. Lots of chills cold hands, feet, nose and if you know my history those all all bfn signs for me.",
            "post_id": "6887498",
            "timestamp": "1304777318",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "I am sorry... But you never know! That is how I still am to this day. Crampy and cold!",
            "post_id": "6888624",
            "timestamp": "1304815950",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Praying for good news, even though you're thinking otherwise... You really never know... When is your next doc appt? Hang in there! :)",
            "post_id": "6891932",
            "timestamp": "1304946057",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "awaiting af lots of cramps and temps are down trying to figure out what to do next. I know prayer changes thing...and God will NEVER steer me wrong at least I have a few weeks before iui is due to decide.suppose to have beta on Friday",
            "post_id": "6895407",
            "timestamp": "1305043041",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "So we had our u/s on the 10th to find out the sex.....well the tech is saying a girl because she couldn't see anything, but she wasn't 100%!!! I am going with that....a Girl it shall be...lol",
            "post_id": "6902272",
            "timestamp": "1305239467",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "Congrats on a baby girl!!",
            "post_id": "6902752",
            "timestamp": "1305251995",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "ad_06- Congrats!",
            "post_id": "6908348",
            "timestamp": "1305474916",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Just got home.They measured my fundal height for the first time. I measure right on at 24 weeks. Her HR was right around 150bpm. They told me about my 1 hr glucose test that will be at my next appointment (28 weeks). I also scheduled my 4d u/s for 30 weeks. We thought that would be a good time (1/2 way bw our 20 week scan and the end of pregnancy).All in all, it was uneventful!",
            "post_id": "6911977",
            "timestamp": "1305594464",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "ad_06- Congrats!! Girls are a blast! :)Rachjas- I have to do my glucose at my next apmt too. (Next monday) Will be 27.5 wks. Then we start going every 2 weeks, crazy how time is flying! Do you guys have any  names picked out?bfromthed- I read your journal, and I'm just so sorry! :(  Do you think you will try again with iui this month?AFM: Nothing new here. Getting big though! :) Addy's learning lots of new words! Her newest ones are \"mine\" and \"corn\" lol. She's a blast!! She's such a little girl now! We're going to our first baseball  game this weekend as a family, should be a blast!! I have my next apmt on Monday, and we'll do my glucose and rhogam shot then. Then I start going every 2 weeks until 36 weeks, then of course every week. The plan is still to be induced on August 12th, which will be 39 weeks. Addy came at 37.5 weeks, so we'll see if little Sean hangs in longer. :)",
            "post_id": "6913376",
            "timestamp": "1305646930",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "hey hun glad to know things are going well for you. I am debating I have taking the Clomid at least if I decide to I will be prepared its just all getting too depressing as Im trying to figure out even if my marriage will be able to survive this.",
            "post_id": "6914368",
            "timestamp": "1305669822",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Hello ladies...going in on the 24th for follie check and see where I am I still have not decided if I will go through with the iui plan cause things are still so shaky with dh (he has been gone 3 months today) We have been communicating a little better lately but nothing has changed as far as \"the situation\" just praying God gives me the answers not what my heart want cause I know he wont steer me wrong",
            "post_id": "6918582",
            "timestamp": "1305806024",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "This thread has been so QUIET lately...wow!!!Well I am 32w3d with a very chunky little boy. I had a sizing u/s on May 11 (30w5d) and the guesstimated he weighed 4.2 lbs already. The measurements said his head was in the 95th percentile, His belly was in the 85th percentile but his legs were in the 55th percentle. So he has little legs but he comes by it honestly. I am only 5'7\" and dh is 5\"10 but has a short inseam...LOL!!! So excited to meet him but scared to push his fat head out, hahahaha!!!",
            "post_id": "6930269",
            "timestamp": "1306201072",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Hey hun Im still here glad to know things are progressing so well! I have a appt with re tomorrow for bloodwork and follie check still not sure if we agree on iui this month as our communication has slowed down alot this week always some drama",
            "post_id": "6930277",
            "timestamp": "1306201299",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "I am sorry you are going through this...  hope you find some peace soon in all of this. Only you two know what will work for you guys, But i do pray your dream of being a mommy comes soon!!",
            "post_id": "6930369",
            "timestamp": "1306204008",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Don't feel depress with what you are suffering now. Instead be positive and be stress free. that will make you feel better.",
            "post_id": "6930708",
            "timestamp": "1306217716",
            "user_id": "user_1693171",
            "user_link": "/personal_pages/user/1693171",
            "votes": "0"
        },
        {
            "answer": "went to re's office this morning and as my luck would be all the larger follies 19 and 20mm are on the left side where I have no tube and the 12 and 16mm or on the right waiting on them to call not sure if I should go ahead with the iui if the larger follies are on the left or should I? I need advice. Due to my marital situation this may be the last month I ttc but I will always be here to support you ladies. I have been going through this 10 years now.",
            "post_id": "6931607",
            "timestamp": "1306248954",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Sorry  I have been MIAI have been soooo busy omg, well Yamiliany is now 2 months & 10 days. She is 12lbs, got her 1st shots and ears pierced. She has started to sleep all night and is up at 9am. I thank god everyday and still can't believe shes here.... We are in love! POsted new pics chk them out!Bfrom- Left you a note yesterday. :(Krich- Cant believe you are so close omg hes going to be huge!! think Yamiliany was like 2lbs at the gestational age.. Wow!Luvk- How are you feeling?Momm- How are those precious ones doing?Rach- How is the belly coming along? How is Baby B doing? You must be soooo excited! Kind of my situation, dont know if you remember but I adopted my grandbaby @ 3 days old and shes now 20 months and does great with Yamiliany... I feel so blessed and so will you with 2 lil girlls.. Congrats againOk ladies have a blessed week got to go (((((((Hugs))))))",
            "post_id": "6931778",
            "timestamp": "1306252377",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "luvkayln- No names yet! We have decided not to tell anyone until she is here anyway!bromfred- I am sorry for you stress! Maybe a break from TTC would do you both some good. TTC can be VERY stressful!krichar- You are getting closer and closer! I am sure you will be just fine with delivery ;)",
            "post_id": "6933101",
            "timestamp": "1306283382",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "guesito- Yes, I remember you story! It's truly an amazing! We both are blessed!",
            "post_id": "6933103",
            "timestamp": "1306283437",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Ba ha ha I read your post and start laughing really hard out loud at my desk.  The guys around me are like \"what got into her\"  I'm sure by the time you are ready to push your bundle of joy out he'll even out a little bit.  Shelby went from 90% to 55% from one visit to the next.  Don't worry it's going to be just fine!!!   XOXObfromthed- You must be one strong woman to be still TTC with all that is going on.  I hope and pray it all works out well for you!!!rachjas- Shhhh you can tell US what name you have picked.  We won't tell anyone you actually know... LOLI've been checking in more lately.  I have been taking the Fertility Blend for about a month now.  I do NOT follow the directions of 3 times a day but instead once a day.  I am hoping that it just helps to give me a cycle once a month or so.  So far I have had two in a row.  I was going to use my next PAP test appt to talk to the doctor about TTC again but the stupid receptionist gave me a hard time.  DH and I are filing bankruptcy and it is final June 3rd.  After that we will be in better standing to have another baby than ever before.  I think after that court date stress levels will go down drastically and we will be able to seriously start with the Clomid again.  I am so exhausted I don't know how to handle another baby but I want Shelby to have a sibling full time!I'm thinking about starting a new thread.  This one has been going on for so long... does anyone object?XOXO",
            "post_id": "6934312",
            "timestamp": "1306331913",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Oh i sure hope so....but I am not holding my breath!! My son who is now 11 weighed in at 8lbs 2oz and sadly i still smoked then :(  My family makes big babies! I was the smallest of 3 and i weighed 9lbs 2ozs...hahahahaha!!! I have always been meausring big so they wanted to make sure it was baby and not diabetes or too much fluid, but nope...it's a chunky monkey!!! Just look at my profile pic, That was done at 28 weeks!!! both u/s techs (28 week 3d and 30 week sizing) couldn't stop talking about how chubby his cheeks are and how they have never seen that before! I think i am in trouble...LOL!!As for the new thread, have at it!! I don't mind at all!!",
            "post_id": "6934415",
            "timestamp": "1306334646",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "My first IVF has been cancelled yesterday as i am not responding well to the meds. even on 600 UI gonal F everyday; i didnt respond. my AMH is low. FSH slightly elevated. and will start next cycle in august. i know this must have happened to many women and is very common in infertility process. just taking time for me to digest and to move on.",
            "post_id": "6934884",
            "timestamp": "1306344445",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "I make the hairpieces have a store, and the clothes mainly at Jc penney, Dillards, macys",
            "post_id": "6934901",
            "timestamp": "1306344777",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "progesterone came in at 28.0 today did not do Ovidril this month or IUI did take Clomid thinking me and dh could get along long enough to cover that but we didnt...I had o pain Friday(slight) Saturday(hard) and Sunday(hard) all on left Friday no tube there both on Saturday and Sunday did not bd (2x's) until Tuesday so not looking for anything this month just keeping you posted...also dh and I are going to counseling on the 20th to see if we can even salvage our marriage.Baby Dust and Sticky Vibes to all!God Bless,Beatrice",
            "post_id": "6956468",
            "timestamp": "1307047665",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "It has been really quiet on here!! I guess everyone is busy :) Well...where do i begin??? I am 34w4d today and hanging in there! I have weekly OB appointments and u/s till the end now as I have the early stages of preeclampsia :( I am on BP meds now and they seem to be working a little bit! I have gone into L&D 2x now...boo :(At my appointment last week i asked how far past my due date my OB would let me go and she said she probably won't even let me get to my due date. She then told me that her office was moving the first week of july but i should have my baby by then. I think she is just hoping i get to 37 weeks and then she will induce me which means baby should be here in approximately 2.5 weeks!!! I am so excited to meet him. I just want him to be healthy!!",
            "post_id": "6968552",
            "timestamp": "1307460226",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "hey hun Im still here nothing going on in my world but we all should stick around to support one another! Time is flying  take it easy and keep me posted. God Bless!",
            "post_id": "6969746",
            "timestamp": "1307487491",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Thanks so much!! How are you doing? How is the counselling going?",
            "post_id": "6970049",
            "timestamp": "1307495378",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "I went alone on Thursday now they want to see him alone then us together. I guess that will happen in the next few weeks communication is getting better between us two I guess I have to figure out if I can trust him again. But my familky is having a gathering this weekened and next so that will keep me pretty happy and occupied....af is due in about a week by then I guess I will have some type of game plan in place...time is winding down for you momma!",
            "post_id": "6971675",
            "timestamp": "1307547118",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Wow gil 34 weeks already!!! Woo time did fly. I had yamiliany at exactly 36 weeks, I remember being at 34 weeks just praying for time to fly to finally meet her.. You must be sooo excited Congrats!!!Bfrom- Been in your situation and I can totally relate, Every time You post I get flash backs of my heartbreaks with my hubby. I wish you the best outcome and Like I said before you guys still love each other its never a bad idea to give him another chance as long as he really tries and mends all the damage he has caused. @ 1st I thought givingmy hubby a 2nd chance was the worst decision but at the long run I dont regret ir a bit, I think it was the best decision and we where able to heal and be happy. Also let me tell you something, Yamiliany has brought us a lot closer and have changed our marriage completely... S o the decision to  still TTC is also a good idea if you guys are willing to work it out.  Wish you the best!!!  ((((Hugs)))) Your day will get here ;)",
            "post_id": "6972074",
            "timestamp": "1307555012",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "krichar- I hope that the pre-clamp stays under control. He will be here before you know it!",
            "post_id": "6976136",
            "timestamp": "1307668765",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "So, I gave in an called my OB office today. For the last couple of days I have been getting headaches, night sweats, etc.... Then, today I woke up with AF cramps at 7am. I called around 2pm because they hadn't stopped even when I drank more than I am used to and laid on my left side. The Dr. wanted to see me. We live 35 minutes away. It took us a bit to get there.It's all my fault... I'm not drinking enough fluids. Right now, liquids make me soooo nauseous! I guess I need up my zofran dosage again. My urine, BP, weight checked out just fine. Baby Girl heartbeat sounded great and she is moving like crazy.She did an internal check to make sure. All is high and firm...... good news!",
            "post_id": "6976140",
            "timestamp": "1307668806",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Thanks s omuch for the encouragement. The next counseling appt is the 20th. We have been seperately this will be the first one together I will keep you posted. Its just hard and I want to be able to trust him just right now I cant. It will be 4 months next Saturday so we will see :-)",
            "post_id": "6977141",
            "timestamp": "1307709900",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "rachjas0623-  Fluids were hard for me to keep down too.  I'm sure by now you have tried everything but the only thing that worked for me was fresh lemon and a straw.  I had to drink from a straw.  Crazy but it was a lot better than drinking from the IV tube when they but me in the hospital.  It was miserable.  So Bottoms UP!  :)krichar-  I hope you are taking it easy so you can keep that BP undercontrol!  I can't wait to see pics of the litle one but let's hold off awhile yet!  XOXO",
            "post_id": "6983644",
            "timestamp": "1307966212",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Hey everyone!! I am now 35w4d...BP is still wacky, it goes way up and it goes down :( I am still on my meds but they don't seem to really help. I have an antenatal nurse who comes to my house everyday to monitor me and baby. She works with my OB and is an extension of the hospital, So it just like being in the hospital but at home...best of both worlds!! After spending the past 4 days in and out of the hospital i don't sleep well there and it is better for me to be home!I have to get BW tomorrow, then on thursday I have my weekly u/s and OB appointment right after so I should know what the doctor has in mind! I am not leaving with some answers this time!!",
            "post_id": "6988197",
            "timestamp": "1308101310",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Fertility Blend seems like a bust so far.  CD 41 and nothing.  No AF or BFP symptoms at all.  3 times a day seemed so excessive but maybe that is what I needed.  Oh well.  I'm moving on and going to go back on the Clomid after summer.",
            "post_id": "6993097",
            "timestamp": "1308251636",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "krichar- I saw your updates! Thoughts coming your way!AFM- My 28 week check up went well. Waiting on the results of our 1 hr test!",
            "post_id": "6998483",
            "timestamp": "1308415444",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Hey all! :) Everything is going great on my end! Almost 32 weeks already, wow!! Time is just flying!Krichar- Sorry about the preeclampsia! :( Its sounds like you are being well taken care of though at your dr's office, and the baby will be here before you know it! We had addy at 37w, 3d and she was perfect! So your little man will be nice and ready by 37 weeks! :) I bet you're getting so excited!! You're almost done! :)Rachjas- I've been having cramping on and off too, more like braxton hicks contractions though I would say. I always get those near the end... Has the cramping subsided a little for you now that you realize what the problem was? I would definately get back on the meds if fluids are making you nauseated, especially with this heat, you need as many fluids as you can get! :) How did your results come back for your 1 hr test?Sbumblebeeo- I would say you need to up the dose on the fertility blend, or since you and hubby are gonna really start trying soon, just wait for the clomid since you know that for sure works on you! :) Any new news? Has AF shown, or better yet, a positive?? :)bfromthed- My prayers are always with you! I hope you and dh can work things out, and I'm so excited to hear that you have both agreed to give counsiling a try!! Best wishes to you both!!",
            "post_id": "7002408",
            "timestamp": "1308571327",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Krichar- Congratulations on your adorable baby boy, he is just gorgeous!!! God is sooo good!!!!",
            "post_id": "7005834",
            "timestamp": "1308671593",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Leighanne:Jaedyn Michael Born on 2/10/09  Now is 18months 21lbs and 31 inches longVortex: On 4/20/2009, Sahana was born! (Check out her pics!!!)Joyce: 5/28/09 Daniel Joseph was born, 8lbs, 8oz and 19 3/4 inches long.Jessie: 6/11/09 Zachary Kaden arrived at 5:43am. 7 lbs, 12 oz and 20.5 inches longArmyprincess: 7/24/09, Jeremy Michael was born 9lbs, 3 ozs & 20 inchesStacey: 8/12/09, Jake Harrison was born a healthy 6lbs! Check out his handsome pics!Arlotheslug:  Home loving her little girl!!!  See her beautiful pics! :)Kaylee_Frye: Hayden Elizabeth was born 9/12/09; 6lb 12 oz and 19.5 inches!Luvkayln: Adalynn Noel was born healthy & beautiful on 12/7/09! 6 pounds, 15 ounces!!!  Check out her beautiful pics!Dnikkki: Welcome Peyton Therese!!! Born 2/2/10 at 9:47 p.m. 6 pounds, 6 ounces & 19 inches long!Mommyin10: Richard Clay, III & Ava Kathleen were born 2/18/10! He was 4 lbs, 5oz, born at 12:15 a.m. She weighed 3lbs, 14oz, born at 12:16 a.m.Sbumblebeeo: Shelby Rachel arrived on April 1st, 7 pounds, 1 ounce, 20 inches long! :)Help4baby:  Twin boys were born on April 30 6 lb 5oz & 7 lb 4ozkmcarino:  Ryan Joseph was born Sunday, 6/20/10 at 2:33 pm.  He's a healthy 7 lbs, 02 ounces and 20 1/2 inches long =)ad_06:  Welcome, Conner Jamison! Born 7/17 at 5:13 pm, 8 lbs, 2 oz, 19 1/2 inches long :)Rachjas: Baby girl was born 7/16!  Congrats, Mommy!  Update with details :-)trh: Annabelle Grace was born at 8:05 a.m. on February 14th. 5lbs 12oz and is 19inches Congrats Mommy!!!Guesito: Yamiliany was born 3/14  at 9:06 a.m - 5lbs 15oz!! Check out her beautiful pic!!Krichar-  Tristan was born 6/20 @ 11pm  6lbs 6onz, 19 inches, Healthy gorgeous lil boy!********************************************************************************************************Luvkayln: BFP!!! 32wks!!! Having a BOY!mlward3: BFP!!! 13wks!!rachjas: BFP!!! 28wks!!!ad_06: BFP!!! EDD Oct. 2nd!!!cminamyer: 5DPOBfromthed:jmh: Awaiting thyroid results...? Hopefully back in the game soon!!!Sammy J:Nino7:Keyan:Candie: Great to hear from you!! Needs advice and stories from anyone who's had medicated cycles. Please share :-)Waiting for an update:HannahpyarBabyMaddprincessJamNikinaTaking a BreakLinamrspace*****************************************************************************************************Let's welcome our newest edition to the medhelp Family Tristan Blair, born Yesterday 6/20 around 11pm 6LBS 6ONZ, 19 INCHES, Happy, healthy little boy!!  Congratulations KRICHAR!!!",
            "post_id": "7005858",
            "timestamp": "1308672116",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Krichar- Congrats on your baby boy!! Yayyy!!! :)",
            "post_id": "7007409",
            "timestamp": "1308708443",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Luvkayln- I passed! I got a 112 when they wanted it under 130. I was sooo happy. My thyroid also came back in check from my 28 week check. I have never stopped  my zofran, but I have definately had to increased the amount I am taking again! I am trying to drink more fluids. I found out a couple of days after I went in to the office from the cramping that I had a UTI, so I went on a round of antibiotics. When I went in for my 28 week check up... I asked about it since I had never had one before. They also told me I tested + for Strep B in my urine which is the same thing they will test me for around week 36. So, most likely I will need to get antibiotics during delivery. I also tested + for ecoli!!! agh! but, if I wasn't pregnant they said they would have even treated me..my number for the was barely over the 'limit.'luvkayln- 32 weeks!!! Are you being induced this time? When?Krichar- Congrats! I saw the pics! ADORABLE!AFM- I am 30 weeks today! We have our elective 3/4d u/s this Wednesday!",
            "post_id": "7020369",
            "timestamp": "1309141554",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Rachjas- That's great you passed your test, but uugh about the uti and the ecoli! :( There's always bad with the good it seems! But at least you found out and can get it treated! I tested + for strep B too when I was pregnant with Addy and had to get antibiotics when I was in labor. So yes, the plan for us is to be induced at 39w, 1d (Aug 12th). The only reason being is to try to \"plan\" it a little because of Addy. She came at 37w,3d so we'll see if little Sean makes it that far. In a way, I'm kind of hoping he comes sooner just so I can be suprised and see what it feels like to actually do the whole \"I think i'm in labor!\" thing. :) I was induced with both babies, so it'd be cool to be suprised this time. :) But it's all up to him! lol. Happy 30 weeks to you! We're almost near the end, it's crazy!! It's just gone by so quick, sometimes I feel like it's unreal that I'll have another baby soon! Addy's starting to somewhat understand I think. We'll point at my belly and say \"baby\", but she's obsessed with babies. Earlier today at the store though she pointed at her daddy's belly and said \"baby\", lol, so maybe we're just confusing her! Ha! :)AFM: Will be 33 weeks on Thurs, and if little Sean waits till our induction, he'll be here in just 6 weeks! :) We have another appointment next Thursday, going every 2 weeks now. Starting July 21st we'll start going every week till he comes! Gettin' close!!! :)",
            "post_id": "7023179",
            "timestamp": "1309225354",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Well I got my BFP today :-) SOOOOO happy and a little surprised. They way my cycle's have been I didn't think it was going to happen without some major help, but here we are.  The only two maybe three things I have noticed as symptoms were major fatigue...this is a big one for me had it will both of my daughters...cm around the time AF was due and also having to pee a lot...but I thought this was due to my increased coffee drinking, which I now have to stop, lol.Hope everyone is well SSBD to all!!!",
            "post_id": "7026288",
            "timestamp": "1309316561",
            "user_id": "user_581359",
            "user_link": "/personal_pages/user/581359",
            "votes": "0"
        },
        {
            "answer": "Thanks everyone for all the congrats...Finally had a chance to upload some pics including my maternity photos (just got them on saturday and went to hospital on sunday....lol!!!) It is weird to fina;;y see my name on the baby list and not just the BFP or TTC list! What an amazing feeling to have him home, I can't believe it!! I will write a \"birth story\" and catch up on everyone soon. As soon as i have a chance to catch my breath (we have only been home for 48 hrs now)",
            "post_id": "7026398",
            "timestamp": "1309320152",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Anyone interested in Gorgeous headbands, Beanie hats, tutu dresses For Newborns & Older visit my page @ FB, find me under Yamiliany Solis. Everything for your princess!!",
            "post_id": "7028401",
            "timestamp": "1309384127",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "hey ladies,dh and I are now seperated so until I find someone to ttc with I will be here for the support of you all... No pitty party for me between you guys and God I will be fine :-) Lots of baby dust and sticky vibes to you all!",
            "post_id": "7036000",
            "timestamp": "1309628794",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "bfromthed- I am so sorry",
            "post_id": "7055233",
            "timestamp": "1310321266",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Wow, been pretty slow on here! Life's busy tho! :)bfromthed- I'm so sorry. I can't even imagine everything you're feeling! You are a good woman, God is with you!! You will get everything you deserve!! :)rachas- Happy 32 weeks! :)AFM: I had my 34 week appointment last Thursday, and actually measured 35 weeks! :) I go back next Thursday and they will start checking me to see if I'm dilated. I've been having a lot of pressure the past week, and I think he's moved down so hopefully not too much longer! Addy was born at 37 weeks, so maybe little sean will make his debut early too! My goal this week is to get everything washed and ready for the baby. I've been slacking on that this time, but i'm telling you guys, time is flying by and now I'm exhausted after working 40+ hrs and being a full time mommy and wife! :) Life is great, and I'm so thankful for everything I have!!",
            "post_id": "7056135",
            "timestamp": "1310348722",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "It is quiet on here! I keep checking in but I am too tired to think and write something... hahaha!! I FINALLY posted my birth story, I didn't realize how long it was, lol!! Even thigh I haven't posted in some time I am always checking up on you all!",
            "post_id": "7060162",
            "timestamp": "1310481867",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "luvkayln- I hope that you are able to get everything organized soon. He will be here before you know it!",
            "post_id": "7083280",
            "timestamp": "1311208287",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Rachjas- We finally have everything ready for him! :) How are you feeling??Well, I totally forgot to update last week! I ended up going to my dr's office last wednesday b/c I had been having cramping all night long and it wouldn't go away! They brought me in and checked to see if I was dilated (this was at 35 weeks) and it turns out I was dilated to a 1 already, which was awesome! I'm still pregnant, so wasn't in labor! All week since then I've been having constant pressure and cramping/lower back pain which is something i never experienced constantly with addy. In fact, I hardly ever felt it! This time is just completely different. :) We go back in the morning for my 36 week check up to see if i've made any more progress, which I'm crossing my fingers that I have! :)Hope everyone is doing good!!",
            "post_id": "7083463",
            "timestamp": "1311211858",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln- Ohh my! I hope that you have made more progress!AFM- Baby C just turned 1! Now, it's in baby prep mode. We are getting close to being ready. I am doing well. I still have to take zofran each day, but it's worth it. We have our 34 week check-up next Wednesday.",
            "post_id": "7088009",
            "timestamp": "1311348049",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Hey ladies,I dont know if anyone can help me here!I did u/s 2D last week (was 29 weeks), and baby looks scary :sss his mouth looks big and stick out further than his nose (jetted out like Simpsons).. is that normal?",
            "post_id": "7088598",
            "timestamp": "1311361411",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "Nino- those u/s are never a way to tell what your baby looks like. Remember it is sound waves being bounced so if your baby swallows or moves during the picture it can depict a profile that looks wrong. No worries on that!! I am sure baby is as beautiful as you have imagined!!AFM- Tristan is now 1 month old :( and weighing over 10'lbs. I am exhausted as you can all imagine. I will try to update later when I have more time! I hope all is well with everyone, I do check in often but like I said have little time to comment!",
            "post_id": "7089604",
            "timestamp": "1311389983",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Update: We had our 36 week check up last Thursday. Baby measured 38 weeks, so they had me do an ulstrasound to see if there was too much fluid, to check on his kidneys, etc to make sure he's developing ok. Turns out he literally measures 38 weeks! He weighs 7lb, 12 oz already!! BIG BOY!! :) My dr was concerned that he would be too big for me, and the 2 possible worst scenerios could be either his head would come out but his shoulders would be too big so they would have to break one to get him out, or his head would be too big to come down the birth canal and they would have to do an emergency c-section, and obviously i don't want ANY of those options! So next Wednesday we go in for an amnio to see if his lungs are ready, and if he passes we're getting induced that day! I've gotten 2 rounds of steroids the past 2 days to help mature his lungs, so we will see! :) I'm super excited and so ready to meet our baby boy!!!",
            "post_id": "7092048",
            "timestamp": "1311483479",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "krichar, Thank you for your kind words :)",
            "post_id": "7092307",
            "timestamp": "1311504279",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "luvkayln- BIG BOY! I am hopeful that his lungs are ready to go. I can't wait for updates and pics!Baby C had her 1 year check-up today. She is in the 50% for height at 29\" tall and in the 70% for weight at 22lbs10oz.... she also got three shots :/She is totally off of the bottle and is only drinking whole milk now!We have our 34 week check-up tmw. It should be a pretty boring appointment.",
            "post_id": "7098569",
            "timestamp": "1311699990",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "hey ladies just checing in congrats to the new mommys and the bfp's and baby dust and sticky vibes to all of us trying to get to our dreams.afm: things have been quiet my husband wants to try counseling now that he sees the grass is not that green on the other side. We will see...I will keep you posted..I am not giving up!!!!",
            "post_id": "7104546",
            "timestamp": "1311873668",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Bfromthed- I'm glad your husband is coming around! I truely hope you guys can work things out, I just can't imagine how you feel right now! But keep up that awesome attitude you always have! :) Good things will come your way!!!AFM: We had our baby boy last Wednesday! :) Baby Sean was born 7/27/11 at 6 pm! He weighed 7lb, 15 oz and was 21 in long. He's SO cute, I just love him so much!! Addy is doing awesome as his big sister! She's already very protective of him, LOVES to hold him & kiss him! It's the cutest thing ever! :) He's a great baby, and a big eater! Breastfeeding is going much better this time around, probably b/c I know what to expect since I've been thru it before. I will get pics up soon, I do have some on FB as I know a few of us are friends on there! :) Hope everyone has a great day!!!",
            "post_id": "7122676",
            "timestamp": "1312473113",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "CONGRATS!!! I can't wait to see pics and that is a great day! That is my brother and God childrens birthday!! I am so excited for you...",
            "post_id": "7124426",
            "timestamp": "1312514519",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "luvkayln: YAYYY congrats I am so happy for you!afm hubby came by last night we spent hours talking and have an appt with a counselor in 2 weeks. He says its not that he does not want to come back but he wants to make sure that he will never hurt me like that agin...I told him that's an excuse. We did bd...this morning though ;-) I guess whatever it takes to get my little one but no meds this month. I had a + opk yesterday hopefully something will catch.Baby Dust and stick vibes and congrats to the bfp's and the new mommy's!God is good we will get there!Beatrice",
            "post_id": "7125428",
            "timestamp": "1312557115",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "luvkayln- Congrats!",
            "post_id": "7127895",
            "timestamp": "1312635446",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "hi! just dropping in to share my good new, dh and I became parents 6 weeks ago, it was literally short notice, got a call on a thursday afternoon and the next day he came home with us, he is 2 y/o...btw, if you don't remeber it was a year ago we decided to adopt, and just now we were match!! we are extremelly happy, us 3 + 2 happy dogs! :-]",
            "post_id": "7129232",
            "timestamp": "1312678875",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "keyan- OMG! We need more details! I am sooo happy for you!",
            "post_id": "7134120",
            "timestamp": "1312854814",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "YAY!  I am so super excited for you!!!  I can't wait to see pictures of your new son!  What is his name?  What does he look like?  I want details!  I'm bouncing in my seat!!!!  LOLXOXO",
            "post_id": "7135204",
            "timestamp": "1312895536",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Oh yeah... I forgot.  I am starting Clomid tomrrow!  We're going to give it a try and see if we can't have another baby.  Hoping for a baby boy this time but healthy is most important.  Wish me luck...",
            "post_id": "7135217",
            "timestamp": "1312895806",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Yes, we are extremely happy! it was a real shock for us, our life changed in less than 24 hours, no time to prepare...but, 6 weeks later we are getting used to! we didn't have anything, nothing!! in our case (every adoption is different) I got the call, they didn't say much, just that it was in the range we asked for (girl or boy 0-2), so we couldn't shop all the way...we met the next day with about 6 people, social workers, supervisors, lawyer before metting him...to go over the process, we declined to meet thru video or photo, we wanted to be in \"real life\"... and then he came in walking a little shy, they sat him on dh's lap and I was crying touching his hair his legs and just staring at him! then we played a little and when it was time to leave, I asked him for his hand to go with me and he gave me his hand and walked out to the car, he didn't cry that night or the next morning, but he did at the pediatrician (he had a cough and no meds)...it has been an amazing experience, I re-live that momment every day in my mind, when he walked in to the room. He is very happy and so are we! I can't post photos or personal info in public, but if you send me your email via message here, I can share with you some pics. I am white, Dh is in between, you can say, light dark (we are mix here), our son is white like me! We have our court date on the 22nd of this month!",
            "post_id": "7135859",
            "timestamp": "1312911536",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "***@****  I can't wait to see him and just his first name is ok by me!  I am so happy for you I nearly cried!!!!  YAY!",
            "post_id": "7136248",
            "timestamp": "1312919346",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "It stared out my email address!  I'll send it in a private message.",
            "post_id": "7138050",
            "timestamp": "1312979307",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Congratulations Keyan. Am really happy for you, your husband and for the child, who is so lucky to have you as his mom. You really made me cry. God bless you all.",
            "post_id": "7141042",
            "timestamp": "1313058371",
            "user_id": "user_1119441",
            "user_link": "/personal_pages/user/1119441",
            "votes": "0"
        },
        {
            "answer": "keyan-r e l s p a r k l e s at y a h o o *******",
            "post_id": "7144208",
            "timestamp": "1313155448",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Congrats to you and dh!",
            "post_id": "7147106",
            "timestamp": "1313243948",
            "user_id": "user_342693",
            "user_link": "/personal_pages/user/342693",
            "votes": "0"
        },
        {
            "answer": "Wow I  need to catch up....Keyan- Your post made me cry CONGRATULATIONS!luvkln- congratulations on your lil man wippiii!!bfrom- Hello sweetie hope all gets better :)AFM- Yamiliany just turned 5 months yesterday she turns and is starting to try to sit up... Just posted pics of her, Shes had a fever for 2 days now dr says shes got croup :( But will get better....",
            "post_id": "7153254",
            "timestamp": "1313447961",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Keyan-BRENDAL28 AT AOL",
            "post_id": "7153261",
            "timestamp": "1313448069",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Hey everyone!! So our computer is pretty much fried and we need to get a new one, occasionally I can get on but i usually have to use my phone which makes it hard to catch up on everyone. I finally got on today and posted some new pics of Tristan under his page. They are from 6 weeks old (he is 8w3d today) and is now weighing in at 12lbs14ozs :)",
            "post_id": "7161857",
            "timestamp": "1313686916",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Almost time to test.  TWW is looooooong.  I am so busy that it's gone fast this time.  We only BD'ed once and I have NO symptoms at all so I am thinking a PFN is in my future but there's always next month, right?I hope everyone has a safe holiday weekend.XOXO",
            "post_id": "7206119",
            "timestamp": "1314989101",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Where is everyone?I guess we are all busy with summer, lol!!Sbumblebeeo- any news?? I have been checking in to see :)Afm-So we had Tristan's two month appointment today. Even though he's 11 weeks and he's weighing in at 14 lbs. 5 oz. yikes and on top of it he has to go see a birthmark specialist because he has a birthmark under his right eye and it's grown bigger and it's too close to his eye, so we have to look into removing it. He also has umbilical hernia and if that doesn't heal by the time he is 2 or gets worse we have to go see a surgeon. Other than that he is all good and we don't have to go to the doctor again until he is six months instead of the normal four months because he's doing so well in fact the doctor didn't even believe that I was nursing him exclusively and was shocked to hear that there is no formula at all involved and then he started joking and asking if I was taking steroids or feeding my baby steroids, lol!! His exact words were \" you have milk to make Olympic champions...hahaha!!",
            "post_id": "7222845",
            "timestamp": "1315513682",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Hey ladies! Just checking in to let everyone know I today is my last day of clomid. We are now trying again after 2 years of \"fun\". Thyroid results came back normal so just trying to proceed on with out stressing another miscarraige.",
            "post_id": "7226126",
            "timestamp": "1315609680",
            "user_id": "user_546831",
            "user_link": "/personal_pages/user/546831",
            "votes": "0"
        },
        {
            "answer": "Teegan Michaela Lee H~~~~ - born 9.7.11, weighing 6lbs10.5oz measuring 19.75inches",
            "post_id": "7230264",
            "timestamp": "1315758833",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "AF showed.  I'm already CD12 now and finished the second round of Clomid on CD 9.  According to the doctor we should start BD'ing again today and every other day until CD 20.  BTW Sept 8th was my 30th birthday.  If I don't get pregnant within the next 6 months I'm giving up.  We have used NO form of BC since my Shelby was born.",
            "post_id": "7245860",
            "timestamp": "1316194643",
            "user_id": "user_291233",
            "user_link": "/personal_pages/user/291233",
            "votes": "0"
        },
        {
            "answer": "Life has been sooo busy, it has been forever since I have been on here!Melisah Caraline \"Cara\" was born 9.22.11 @ 5:59am via c section. She weighed 6 lbs 9 ozs and was 19 in long!Conner will be 15 months! He is such a great big brother to Cara.... he loves her to pieces!Good luck to everyone!",
            "post_id": "7320033",
            "timestamp": "1318521931",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "Hello ladies, Hope everyone is doing well, lots of catching up to do... my pwd was lost tried reseting it a few so had no choice to open another account...Yamiliany is now 7 months staring to crawl cute as can be..... posted pics nice to be here again xoxoxox",
            "post_id": "7361539",
            "timestamp": "1319855504",
            "user_id": "user_1859613",
            "user_link": "/personal_pages/user/1859613",
            "votes": "0"
        },
        {
            "answer": "Welcome back!! I wondered where you were :)",
            "post_id": "7362371",
            "timestamp": "1319901253",
            "user_id": "user_982214",
            "user_link": "/personal_pages/user/982214",
            "votes": "0"
        },
        {
            "answer": "Thanks sweetheart your baby is so adorable!! God bless!",
            "post_id": "7371870",
            "timestamp": "1320253630",
            "user_id": "user_1859613",
            "user_link": "/personal_pages/user/1859613",
            "votes": "0"
        }
    ],
    "post_id": "6746070",
    "question": "A strong woman works out every day to keep her body in shape…But a woman of strength builds relationships to keep her soul in shape.A strong woman isn't afraid of anything…But a woman of strength shows courage in the midst of fear.A strong woman won't let anyone get the better of her…But a woman of strength gives the best of herself to everyone.A strong woman makes mistakes and avoids the same in the future…A woman of strength realizes life's mistakes can also be unexpected blessings and capitalizes on them.A strong woman wears a look of confidence on her face…But a woman of strength wears grace.A strong woman has faith that she is strong enough for the journey…But a woman of strength has faith that it is in the journey that she will become strong.*************************************************************************************************************************************Leighanne:Jaedyn Michael Born on 2/10/09  Now is 18months 21lbs and 31 inches longVortex: On 4/20/2009, Sahana was born! (Check out her pics!!!)Joyce: 5/28/09 Daniel Joseph was born, 8lbs, 8oz and 19 3/4 inches long.Jessie: 6/11/09 Zachary Kaden arrived at 5:43am. 7 lbs, 12 oz and 20.5 inches longArmyprincess: 7/24/09, Jeremy Michael was born 9lbs, 3 ozs & 20 inchesStacey: 8/12/09, Jake Harrison was born a healthy 6lbs! Check out his handsome pics!Arlotheslug:  Home loving her little girl!!!  See her beautiful pics! :)Kaylee_Frye: Hayden Elizabeth was born 9/12/09; 6lb 12 oz and 19.5 inches!Luvkayln: Adalynn Noel was born healthy & beautiful on 12/7/09! 6 pounds, 15 ounces!!!  Check out her beautiful pics!Dnikkki: Welcome Peyton Therese!!! Born 2/2/10 at 9:47 p.m. 6 pounds, 6 ounces & 19 inches long!Mommyin10: Richard Clay, III & Ava Kathleen were born 2/18/10! He was 4 lbs, 5oz, born at 12:15 a.m. She weighed 3lbs, 14oz, born at 12:16 a.m.Sbumblebeeo: Shelby Rachel arrived on April 1st, 7 pounds, 1 ounce, 20 inches long! :)Help4baby:  Twin boys were born on April 30 6 lb 5oz & 7 lb 4ozkmcarino:  Ryan Joseph was born Sunday, 6/20/10 at 2:33 pm.  He's a healthy 7 lbs, 02 ounces and 20 1/2 inches long =)ad_06:  Welcome, Conner Jamison! Born 7/17 at 5:13 pm, 8 lbs, 2 oz, 19 1/2 inches long :)Rachjas: Baby girl was born 7/16!  Congrats, Mommy!  Update with details :-)trh: Annabelle Grace was born at 8:05 a.m. on February 14th. 5lbs 12oz and is 19inches Congrats Mommy!!!Guesito: Yamiliany was born 3/12  at 9:06 a.m - 5lbs 15oz!! Check out her beautiful pic!!**************************************************************************************************************************************************************************************************************************************************************************krichar: BFP!!!! 22wks!!!!Luvkayln: BFP!!! 18wks!!! Having a BOY!mlward3: BFP!!! 13wks!!rachjas: BFP!!! 15wks!!!ad_06: BFP!!! EDD Oct. 2nd!!!cminamyer: 5DPOBfromthed:jmh: Awaiting thyroid results...? Hopefully back in the game soon!!!Sammy J:Nino7:Keyan:Candie: Great to hear from you!! Needs advice and stories from anyone who's had medicated cycles. Please share :-)Waiting for an update:HannahpyarBabyMaddprincessJamNikinaTaking a BreakLinamrspace*****************************************************************************************************cminamyer: Welcome!!! How are you feeling?Ad: How are you doing??Rachjas: How are things going on your end? How are you feeling?Guesito: Thank you for updating the thread and a HUGE CONGRATULATIONS!!! She is beautiful!!! Enjoy every minute of it!Luvkayln: How are you feeling? How's Addy doing?trh: I know you're busy, but how are things your way?Krichar: How are you? Have you found out if you're having a boy/girl? I may have missed it somewhere :/ I think I was guessing a girl for you ;-)Wow, redoing the thread again....I remember when I joined you gals there were about 4 on the new mommy list :-) Boy has it grown!!! Congrats to all you mommies and all you ladies with BFP's!!!  I'm just recouping at home - I got home this past Monday finally :-) I missed the kids like crazy but I slept half the time I was away. I'm feeling pretty good actually. Just sore and I have to remember to take it easy and no bending or lifting (which is hard having a 13month old...). I have a post op check on the 25th with my doctor here...I hope all of you are doing well and I'm sorry I've been away, I'm busy or busy sleeping lol!! I do check in frequently, just haven't posted - I hope all of you are doing well!!!Hugs, Love and SSBD to all :-)",
    "timestamp": "1300455116",
    "title": "Calling All Woman of Strength!!! New Thread 3-18-11",
    "user_id": "user_478429",
    "user_link": "/personal_pages/user/478429"
}