{
    "answers": [
        {
            "answer": "hi all just a quick note to say hi to everyone new, i will have to go back and check the old thread to see whats been happeningIm leaving for australia on dec 30th with my son and my dh will stay in chicago. so if im not pregnant now i will have to wait till i caome back in april. Maybe this will be a good break for me to let my body get back to normal and see my own doctor back home who i love :)I still havent had a +opk not sure what is up with my body but ive been so down and that why i havent been on for awhile.Ive been having abit of cramps on my left side ive heard it could be im ovulating but who knows.Ill come back on tomorrow have a great night everyone :)",
            "post_id": "3727538",
            "timestamp": "1228271966",
            "user_id": "user_632443",
            "user_link": "/personal_pages/user/632443",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,  I was looking for a thread like this-- we have a similar one in the m/c forum & it's wonderful.  If there's room for one more my details are: a BFN today after a Femara/IUI cycle.  RE said we could get more aggressive with the meds next cycle.  I wouldn't mind your insights re: injectables so I can make an informed decision when I go in on CD2.  I think this was my 30th BFN & it's getting a little annoying!Congrats to all the BFPs!  You're a sign of hope.Mommyin09, thanks for pulling all this together-- wow!",
            "post_id": "3727652",
            "timestamp": "1228273733",
            "user_id": "user_685595",
            "user_link": "/personal_pages/user/685595",
            "votes": "0"
        },
        {
            "answer": "Mommyin09- Thanks for starting a new thread! Our last one was getting a little long!! :)Yogachick- Welcome!! I'm sorry about your bfn today! I know how much harder it gets each month to get that -ve! I did clomid for 5 cycles, 3 with iui, all bfn. We took this cycle off b/c I had a cyst on my left ovary, but were still able to try naturally and am currently 6 dpo. When/if af shows, I'll start my first cycle of Follistim, and I am sooo excited! I always produced multiple eggs with clomid, just never got pregnant. I've read so may +ve stories about Follistim, so I'm really hoping it works in the first couple of cycles on it! I would definately say if you want to be more aggressive about ttc, which i'm sure you are :), definately move on to the injections! I could kick myself in the butt for waiting this long to start them! Good luck in whatever decision you make! :)naf- I'm sorry you've  been feeling down! :(  Hopefully you will get a +ve opk soon, and that will build your spirits up! :) I hope you do get your bfp this cycle, but if not, it may be a good break to have a few stress free cycles before actively trying again!Guesito- I sent you a message, but congrats on seeing your little one today! :) I know it put your anxiety at ease! Now just enjoy being pregnant!!!I have to check our old thread, because I think I missed out on some stuff... Be right back! ;)",
            "post_id": "3727808",
            "timestamp": "1228276264",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Ok, let's see if I can remember all this...  :)wishandaprayer- Yes, I'm 6 dpo already, if you can believe it! My ovulation definately snuck up on me this time! I ovulated on CD 9! I'm still in shock over that one! :) I'm not really feeling anything, my bbs were super sore yesterday, and I had a back ache from hell yesterday, but nothing really bad today! I'm not worried about this cycle though, I'm anxious for next cycle so I can start my injections!!!! :) How are you?Hannah- Isn't it funny how you can be so busy and then you realize you're already in the 2 ww! I swear that's exactly how it went for me this cycle! Thank goodness I temp every morning, because I definately wouldn't of thought I would ovulate so early, and we caught it too, so that was good! :) Hopefully your 2ww flies by, and you get great news in 2 weeks! :)jmh- I'm so sorry you got bad news today! :( Just keep your chin up, and hopefully next time your follies will cooperate and be mature on your right  side! :) It's all a race when it comes to them maturing, so you just never know which side will win! I know how hard that must be for you! :( Just look forward to next cycle, ok? (( Hugs))Shysana- Sorry to hear you're not feeling well! It seems like a lot of people aren't feeling well these days! I think the flu bug just skipped right over me, thank goodness! :) Hope you start to feel better soon!Candie- Wow, you're already CD 11! You know what that means! O is coming soon!! Start testing with those opk's girl! :)ad_06- Our insurance always said they'd only pay for the first visit to our RE, and that we had to cover the rest of the costs. And that's exactly how it went, for the first few months, and then all of a sudden they started paying for my u/s and my visits!? Hey, I'm not argueing! :) Maybe you'll luck out, and that'll happen for you too! :)Keyan- Sending lots of +ve karma your way that af stays away!! I've been peaking at your chart the past few days! :) Staying very hopeful for you!!Ok, i'm tired now! :) Going to bed, I've had a long day! See y'all in the morning! :)",
            "post_id": "3727888",
            "timestamp": "1228277530",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "mrs space.... i know exactly how you feel as far as the names go.  we have not officially found out but are pretty sure it is gonna be a girl.  and i want to name her after my mother which is Carolyn(as a middle name) and he wants to name after his adopted step sister/or foster step sister or something like that...Lauren (yuck, i HATE that name) we are not married yet so technically i dont have to have his input at all...lol but it would be nice if we could just AGREE....every name i pick out...he has to change, i suggested Brigette, he said how about something softer....wtf.  I suggested my mothers name he suggested Suzanne (my mom's middle name is Sue) i have 3 children and they are Caitlin(14) Travis(11) and Hunter(6)....so i am a little experienced in picking out names.  I just hope that he will just give a little cause i can be very stubborn when i want to be...lol",
            "post_id": "3727982",
            "timestamp": "1228278966",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "joyce-  I love my DH very much and i appologize for how terrible my post probably sounded.  It was just nice to vent for a few minutes.  I'm sure you will figure out a name together soon.  My DH and I have awhile to come up with a name!  Still no BFP for us :(Well I need to get to bed.... see you all tomorrow",
            "post_id": "3728311",
            "timestamp": "1228287511",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mrspace24 - I know what you mean about the love had relationship with the military.  Well I wish you luck ttc.  I know it's hard, hopefuly something will happen and things will work out for you and DH and you'll get your BFP soon.Good luck to all of you women SSBD!",
            "post_id": "3728331",
            "timestamp": "1228288367",
            "user_id": "user_581359",
            "user_link": "/personal_pages/user/581359",
            "votes": "0"
        },
        {
            "answer": "hello ladies- popping in to say hello.thank you mommyin09 for the new thread.  we have so many new wonderful ladies that have joined us that the last thread filled up fast the past 3 days.well update- my annual audit at the program i run was yesterday and i kicked butt.  so all the hard work and all the time i spent neglecting you ladies paid off.  So from this point i will be able to keep up more and write more individual notes like i was able to a month ago.  i will finally have my life back without working around the clock.well i have my 28 weeks check up today.  i am going to ask the doctor how much she thinks the baby weighs because they have never told me that.  then i have my fun 3d/4d ultrasound this saturday in which he needs to cooperate because if any of you remember, the little bugger would not open his legs the first time around at the 1st 3d ultrasound for gender determination.well i hope you all have a good day and i will be checking back in later today.luvkalyn- yeah 7dpo O already.  keeping my fingers crossed.  it seems like your cycle has gone by so fast this time.",
            "post_id": "3728751",
            "timestamp": "1228309496",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeks (doc appt today! u/s 12/6)vortex: BFP - 19 weeksJoyce: BFP - 13 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 8 weeksArmyprincess: BFP - 6? weeksGuesito:  BFP 6 weeksmamatina:  CD2Stacey:  C7 (Retrieval 12/9)kmcarino:  CD8Mommyin09:  CD11Candie:  CD12Hoping4_2: CD13ad_06: CD17Hannah1505:  CD17jmh2005:  CD17wishandaprayer: CD20naf38:  CD22arlotheslug:  CD24rachjas:  5dpoSexykeme78: 6dpopyar:  7dpiuiluvkayln: 7dpoShysana: 8dpoLinaG:  11dpoKeyan:  13dpotracy4751: 15dpt************************************************It's probably not a great idea to say you hate a particular name since we don't even know everyone's first names or baby name preferences... just a suggestion.Leighanne:  Best wishes today!  That'll be great to find out Jaedyn's weight :)mrspace:  We all vent sometimes.  Don't worry about it :)  I think we all probably have our fav names picked out; but like you, I'm still waiting for my BFP.  First things first :)Yogachick:  Welcome! :)  I'm sorry about the bfn!  You're right, it never gets any easier, but one day we'll see that BFP!!!  Good luck with the injections.  Let me know if you want to be added to our list.naf:  That's great that you'll get to see your regular doc again!  Wow, that's a long time to be away, though.  Will dh visit often?  I'm sure you're anxious to get home, but we will miss you :)  Take care !!!",
            "post_id": "3728956",
            "timestamp": "1228314355",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Well small update.  We're on day 2 of clomid.  Things are going great with DH and I.  On a bad note, my mom had a pretty bad accident last night.  She's a concert pianist and a music teacher.  Well while working the concession stand, there was a steam explosion (small). But she has very very bad burns covering 100% of her hands.  I wrote more about it in my journal.But please, if you don't mind, keep her in your prayers. She's in a world of pain and I hate it.  She's my momma and I hate that I can't make her feel better.",
            "post_id": "3729009",
            "timestamp": "1228315410",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "I am so sorry about your mom! I will def keep her in my thoughts and prayers!",
            "post_id": "3729022",
            "timestamp": "1228315682",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "Oh, my goodness!  Your poor mom!  I'm so sorry, but so thankful that she's okay.  My hands are my livelihood as well, so I can relate.  She'll be in my prayers.",
            "post_id": "3729137",
            "timestamp": "1228318101",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "luv kayln you laways reply to me im so grateful yeah i hope it flys toi carnt belive im about to say this but im starting to relaxits been a tough yeah and im sick of being down im not saying i wont be down because i will but i feel good at the moment so i just hope things work i am going to have a nice crimbo with my gorge dh!mommyin09 thankyou i love the new job i think im 1dpo now so be 2dpo tomz thanks for ur support xx",
            "post_id": "3729171",
            "timestamp": "1228318674",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "WOW! we are soo many, it is hard to keep up!!Mommyin09: Hoping you get a +OPK Friday night or Saturday morning, got that right? Thanks for keeping updated the thread. And THANKS for keeping the thread name...WOMAN OF STRENGTH, I love it! :o)Luvkayln: thanks for cking in on me...;o) last night I was thinking that my temp today was going to be high just to bug me, and if you saw it today, you will see it is...I will be happy if I get AF on time or around the time (cz I am not sure I Oed, and I am afraid I will not get AF for the wrong reasons), but like we always do here, I am hoping for a BFP. How are you feeling? you are already 1/2 way!! Sore BBS are a great sign, are you taking meds that can have this effect?MrSpace: I am so sorry about your mom...For sure I will say a prayer for her!Leighanne: Congrats on the audit report! I know how that feels :o)Candie: keep up the BDing!Well I am CD29 today, don't think I will have AF today, maybe tomorrow. I am really on the waiting game these days!",
            "post_id": "3729265",
            "timestamp": "1228320071",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Guesito - I'm so glad the u/s went well and you got to see your little one in the making!  :)  Hope this allows you to relax a bit and enjoy your journey.mrspace - Oh my goodness!  I am so sorry about your mom.  I will keep her in my prayers and i hope she makes a quick and full recovery.  I know what you mean about this site and this thread.  I have learned so much since stumbling upon it and I am so thankful.  I hope the new year brings lots of blessings for us all!hannah - Yes, sometimes it's good to take a break from tracking your cycle and just try to get back to enjoying the BD and relaxing.  I hope it helps!mommyin09 - That's funny you should ask about the OPK's.  I was just thinking about that and realized I forgot to bring some to work with me.  I expect to O on Sun or Mon, so I'm super excited to have the weekend to BD.  :)luvkayln - I know, I can't believe I get to start gearing up for O again!  Looks like you're about 1/2 way through your tww.  I'm really hoping your body will cooperate this time!yogachick - Welcome!  I can't really give any advice on injectibles, I've only tried Clomid and Femara.  I can say though that I completely understand where you're coming from.  We've been ttc for 2 1/2 years, but I have short cycles, so this is actually cycle #38 for us.  Way too many disappointments.  :(naf38 - So sorry you were feeling down.  It happens to us all.  Sorry that your body is misbehaving, but hopefully the break and your old doctor will get you back on track.  Take care.leighanne - Congrats on your audit!  I'm actually an auditor, so I can relate although I'm usually on the other side of things.  People always cringe when they hear that dreaded word, but I'm a nice auditor, I promise!  :)  Good luck at the doctor's today.  That is so exciting that you are having a 3d ultrasound.  I hope the little one cooperates this time!Stacey - Hope the injections are going OK.  Less than a week until your retrieval.  Yay!",
            "post_id": "3729273",
            "timestamp": "1228320142",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Keyan - Hey, it looks like we were posting at the same time!  I can understand why you are \"hoping\" for AF, but we'll definitely keep praying that it stays away for the right reasons!  DH was working on the house last night, so he was way too tired for BD, but now we can relax and enjoy the weekend!  ;)",
            "post_id": "3729287",
            "timestamp": "1228320326",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "First of all, thank you to everyone for the well wishes for my mom.leighanne- Congrats on your audit!  I just started my new job in adminitration for an investment firm about 3 months ago.  About half way through my second week of work we got audited!!!  Needless to say I failed MISERABLY.  My financial advisor is new and the office was new.  So I was barely through my training, let alone organizing the office and getting the filing done.  Ha ha. But it's over now, which is great.  I know how stressful audit times can be.yogachick- I'm so sorry for all your bfn's!!  I know they must be very frustrating.  My DH and I are excited for this month, to see if our first round of clomid worked!  I don't know much about the treatment you are going through but I offer you all my thoughts, prayers, and support!  I'll be keeping my fingers crossed for you!guesito- I'm so happy that you got to see your little one!!!  It's an amazing thing.  Congrats!hannah- I can't blame you for wanting to take a break.  This is the first month that my DH and I have done all the tracking (temp, etc) and I'm already frustrated with it.  There's so much to remember and so much to do!  Enjoy the holiday's.  It'll happen for you.  And who knows, maybe this is what you need.  Just to stop thinking about it all for a little bit.  And then it'll happen!  You never know!  I'll be keeping my fingers crossed for you!!",
            "post_id": "3729345",
            "timestamp": "1228321311",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Candie: You're so cute! I can't imagine you'd be anything but a nice auditer! :) Thats great you might O this weekend! That's what I'm hoping for, too!!!Keyan: I'm glad you're happy with the name! I think it's so fitting for us all :) Yes, you're right, a +opk Friday, please!!! You & luvkayln are in the same boat, hoping for a BFP, but looking ahead, so okay if AF shows. Either way, my fingers are X'd for you both!Stacey: Just a short time to go.  I'm really excited for you! :)Hannah: That's probably what your body needs, is to relax & \"forget\" about ttc.  Now, we'll have to stop reminding you! ;) Sorry, but what's a \"crimbo\" with your gorge dh!? I get the gorgeous part :)Arlotheslug: I'm thinking of you ;)",
            "post_id": "3729737",
            "timestamp": "1228326947",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Candie  I hope so to im thinking of you....Mrspace  nearlly 14month we have been trying iim hoping this method works i feel the most relaxed now but i have bee charting for a yr and it stresses me out way to much but i will be back jan stressed proberly lolMommyin09  crimbo is christmas im going to focus on chritmas with my beautiful fiancei cannot wait glad i have learned to relaxed but it gets harder every day xxthinking of you all xx",
            "post_id": "3729957",
            "timestamp": "1228329955",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Hello my friends!I had my u/s yesterday and everything looks ok and retrival is scheduled for Dec 9.  I counted 19 follies...so there are a few more than last time.  I have another u/s tomorrow to see if I need to change any of my injection dosages.  So far no bad side effects or anything.  My ovaries are a little tender but that is it!  The week is flying by.  I'm very busy at work and am so glad the I am just taking all of next week off!  My sister is still grieving for her horse (Patsy) and it will take her a while to get over it. My MIL is fighting the Pneumonia and it looks like the new antibiotics are helping..thankfully!Guesito - Congrats on the u/s!  Very exciting.  I was sure you would have multiples :)Mommyin09 - Yes, just a week away. And you are getting close too!  How exciting that you could O this weekend and do your iui.Mrspace - So sorry about your mother!  That is terrible.  I really hope that she does not have any permanent damage especially since she is a pianist!Hannah - Enjoy some relaxation - good for the mind and body!Luvkayln - Glad you are not stressing about this cycle.  You never know!  Hopefully you won't need injections.Candie - Wow time is flying!  Perfect timing for you to O towards the end of the weekend!Arlotheslug - Thinking of you.  I read one of your posts where you felt so guilty about your Arlo and not noticing.  Animals are so stoic and a lot of times we would never know they were sick.  Please don't feel guilty.  You did everything you could.Welcome to all the other new ladies.  I can't keep up! :)Stacey",
            "post_id": "3730072",
            "timestamp": "1228331438",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Just a qwik update 8dpo and still sick witht this cold.  I finally took some meds an thy actually are helpin feel alot better then yesterday with no meds.   Am keepin busy tryin not to thinks to much abt testing but will prob test on Sunday wich wld be 12dpo hoping for BFP.Mommyin09  Hope u feel better.  And wishing you luck on you IUIGuesito ~ Congrats!To all the ladies wishing you all the best!!!!",
            "post_id": "3730252",
            "timestamp": "1228333660",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "Stacey:  19 follies!!!  That's wonderful :)  I'll look forward to hearing your update tomorrow!  Yes, I'm so glad to be off next week, too & hopefully we will do iui this weekend!Shysana:  Thanks :)  I still have a cold, but I'm feeling better!  Take care of yourself!luvkayln:  I just checked out your pictures & they are very touching & beautiful ;)  I know how much thought you put into everything & you did a great job, mommy!",
            "post_id": "3731511",
            "timestamp": "1228353818",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Hi ladies! I uploaded some new pics of Kayln's tree! :)mrspace- I sent you a note, but I am sooo sorry to hear about your poor mom! I can imagine that you're hurting for her, and feel helpless because there's nothing you can do right now to help her! :(  I will definately keep her in my prayers!Shysana- I'm glad you finally are starting to feel better! Your meds won't affect the baby if you are pregnant. I was sooo sick when I was pregnant, and took medicine constantly not knowing I was pregnant! The first 3 months are the most important, but those little ones stay tough! Good luck to you! Don't get discouraged if your test on Sunday is -ve, because it will still be early, but it is a good start date to test! :)Keyan- You're welcome! I'm always checking on my friends! :) I'm so glad af still hasn't shown for you! That's a great sign that your temps are still up too!!! Yes, i'm half way through, and i'm just really hoping af shows on time! I refuse to take provera again to induce a period! My body didn't start getting all messed up until I started taking those stupid pills! If af still hasn't shown 14 dpo and I'm not pregnant, OH WELL! :) It'll come when it comes, and then I can start injections! Yay! :) No, I'm not taking any meds, or progesterone, no hcg shot, notta! This was a total med free cycle! My bbs got sore last cycle around 8 dpo, this time 3 dpo. It's normal for me, but I like your enthusiasm and hope it is from a bfp! :)Stacey- Wow! That's so cool you made 2 more follies! It's those unexpected suprises that we love so much! :) That's sooo awesome your retrieval is coming so soon! I hope the rest of this week flies by, and you can enjoy your whole next week off! Well, of course you'll be resting, but you still won't be at work! :) Getting excited!!!!! :)Hannah- You're welcome sweetie! That's what we're here for , complete support for each other! :) I'm glad you feel so happy today! I know ttc can make you so anxious and frustrated, but we have to believe that God has his reasons for making us wait, and when we do get pregnant, we'll have him to thank! :) Keep up the positive attitude! :)Candie- Thanks, you and me both! :) No more provera though, I don't want my next cycle all messed up! I'm sick of abnormal cycles! I hope you do that +ve opk close to the weekend right along with Mommyin09! Then you'll both have all weekend to relax... NOT! ;)Mommyin09- Thanks for doing a great job of keeping our list updated everyday! We don't thank you enough! :) And I completely agree with your comment! I don't think it's a good idea to say that either! We're all here to support each other, not make anyone upset or hurt anyone's feelings! Hope you had a good day at work! :)",
            "post_id": "3731549",
            "timestamp": "1228354242",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Mommyin09- Thank you so much! I try to do a good job, and make Kayln's area cute! :) This is the only way I can take care of her right now, until we're together again! :) Thanks for calling me a mommy, that touched my heart!",
            "post_id": "3731704",
            "timestamp": "1228356346",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Oh, you're so welcome, my friend :)  I know you are doing everything you can to care for your little angel, while she watches over you & keeps you strong!  I'm inspired by your strength & I can't wait till Kayln has a little brother or sister!!!",
            "post_id": "3731947",
            "timestamp": "1228359806",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "You know what, I saw this ornament last Friday at the mall at the little stands they have set up throughout, and it was pink and said \" Big Sister\" ! I wanted to buy it for Kayln, for when she is a big sister, but I didn't want to jinx myself!!! At least I have the idea for when it does happen though! :)",
            "post_id": "3731996",
            "timestamp": "1228360525",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "That's a great idea & it's funny you said that 'cause I would be afraid I'd jinx myself, too! :)",
            "post_id": "3732041",
            "timestamp": "1228361182",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Mommyin09: Hey! keeping evrything cross so that you can do IUI and for it to work!Luvkayln: sore BBS are a great sign,  we are on the same boat, just hoping we get AF on time so that we can move foward w/ our plans, but I know we both would love to celebrate a BFP this cycle! I wasn't able (internet went down last night) to tell you, but on the photo that shows all the little girls, I was looking at it imagining all of them running all around and playing together as little angels! like our friend mommyin09 said, you are a great MOMMY!Stacey: Congrats on 19 follies!! Before you know it, you will be celebrating a BFP, times goes by really quickly! Hope MIL recuperates very soon.Candie: HEY! Me and DH worked as an auditors too, he still does, I am doing more of administration now. sooo I can imagine you counting all the $ spend on HPT and OPK, huh?!? LOL (I do). I hope you and dh are more relax now so you can't begin the journey of the 2ww. ;o)Arlotheslug: I am thinking about you, hope you feel better soon.....As of me No AF yet, no cramps, no sore bbs, but do feel the pressure I usually feel right before AF, so I guess just another day of waiting. I did do a test on Tuesday, BFN, so I don't think I will test again unless AF is really late.",
            "post_id": "3733086",
            "timestamp": "1228399073",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeks (doc appt today! u/s 12/6)vortex: BFP - 20 weeksJoyce: BFP - 13 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 6 weeksmamatina:  CD3Stacey:  CD8 (u/s today; Retrieval 12/9)kmcarino:  CD9Mommyin09:  CD12Candie:  CD13Hoping4_2: CD14ad_06: CD18jmh2005:  CD18wishandaprayer: CD21naf38:  CD23arlotheslug:  CD25Hannah1505:  2dporachjas:  6dpoSexykeme78: 7dpopyar:  8dpiuiluvkayln: 8dpo (Happy B-day!)Shysana: 9dpoLinaG:  12dpoKeyan:  14dpotracy4751: 16dpt************************************************Luvkayln:  Happy Birthday, my friend !!! :-)Keyan:  I'm keeping my fingers X'd for you !!! ;-)Stacey:  Good luck at your u/s today!Candie:  Did you remember your opks today? :)  Still negative here.Arlotheslug:  Always thinking of you!!!So, dh & I decided to cancel our consultation with our RE re: ivf.  It's scheduled for next Friday & we just figured it's too early.  It kind of snuck up on us!  We want to get more info re: the cost before we meet with the doc again.  So, we'll reschedule for late Jan/early Feb.  In the meantime, dh has suggested that we try iui a few times to see if it works for us :)",
            "post_id": "3733298",
            "timestamp": "1228402450",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "luvkayln- Thanks for the well wishes for my mom.  I haven't seen your pictures yet but I'm headed there next! I promise!  I'm getting angry at myself.  I keep saying that I'm going to post more pictures when I get home from work but I keep forgetting to actually do it.  I crochet all the time and I have lots of baby blankets.  So I thought I'd post some pictures on here!  I will be keeping my fingers crossed for you that it'll happen this month for you.  You are a wonderful mother and it'll happen for you.  I just know it!mommyin09- You do amazing and I can't thank you enough for keeping this thread going.  It has been so much help for me.  My DH can even tell!  He says that I'm less stressed and less moody.  Probably because I have a place to vent and talk about what's going on.  Just curious, how can I be put on the list in here?  I'm on CD 6 right now.  Day 3 of clomid.  Woo hoo for me ha ha.Stacey- Congrats on 19 follies!  That's great.  I will be keeping my fingers crossed for you!  That BFP is just around the corner for you!Hannah- I know what you mean about the charting stressing you out.  I get frustrated and it's only my first month of charting!  We have been trying for 4 months now and I can't believe how fast the time has passed. It seems that when you are TTC the time just flies.  Some days I wish it'd slow down just a little.Now an update from me! Well my mom is doing okay.  She is VERY lucky and doesn't need any skin grafts for her burns.  They are all 1st degree and 2nd degree which is good.  She's still in a lot of pain, but it's a good thing.  They think there may have been minimal nerve damage but they won't be able to really tell til it heals more.  Nothing too big.  She will be able to play piano just like before, it'll just take time.  She's taking a few days off work to rest.  She said she's been crying so much from the pain that she feels terrible now.  You know when you sob so hard it causes those terrible headaches?  She's had that on top of the pain in her hands.  So she is going to just rest and relax for the next few days and then she'll go back to work on Monday or Tuesday depending on how she feels.  I feel soooo much better now that I got to see her and saw that she really is okay.",
            "post_id": "3733301",
            "timestamp": "1228402494",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "HI I just wanted to give a quick update I saw the baby's heartbeat on 12/2 and I have my next dr's app on Jan 7. I hope everyone has a great day.....Lots of baby dust to everyone ttc and the pg girls I hope you are having a very happy and healthy pg....",
            "post_id": "3733339",
            "timestamp": "1228403076",
            "user_id": "user_623156",
            "user_link": "/personal_pages/user/623156",
            "votes": "0"
        },
        {
            "answer": "mommyin09 - I just have to commend you on being able to keep up with everyone on the thread.  You're the best!  :)  I think that's a great idea to give the IUI a few tries before moving onto IVF.  Just a little bit of assistance could be exactly what your body needs.  Yes, I did remember my OPK's today.  Looks like we should be in the 2ww together.luvkayln - What a cute idea about the ornament.  I know what you mean, there have been so many times I've seen cute baby things and wanted to buy them, but I didn't want to \"jinx\" myself either.  I know God doesn't work that way, but I'm still afraid to!Keyan - LOL, you are too funny!  How did you guess we count every dollar we spend?  :)  To make matters worse, my DH is a banker, so he works with numbers and money everyday too.  We're quite the budgeting pair!  :)Stacey - Wow, that's great news about your follies.  So happy to hear that everything is going according to schedule for you!  Thank goodness you're not having too many side effects.  That's so nice that you get to take the whole week of your retrieval off.  I'm so excited for you!mrspace - I'm glad to hear that your mom is going to be OK.  I know what you mean, I really think time has been flying by so fast ever since we started ttc.  Probably because we're always counting days and looking ahead to future cycles.  Hopefully we'll all find ways to slow it down and enjoy life too.armyprincess - Congrats on hearing the h/b.  How exciting!",
            "post_id": "3733419",
            "timestamp": "1228404624",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Mommyin09, Candie, Stacey, Keyan & mrspace- Thank you for my happy birthday notes! You all are so sweet! :)Mommyin09- I think that's great you're putting ivf on the back burner, and giving the iui's a chance! That's cool your dh is going right along with it, and opted for this route! :) It is definately a much cheaper route to take, and you still have more options if for some reason you need them, which you know we're all hoping you don't! ;)mrspace- I'm sooo glad to hear your mom is doing ok! What a relief! Thank you for looking at my pictures! I know it's really hard for you all to see them too! :( And thank you so much for calling me a wonderful mommy! ((Hugs)) That's just so sweet of you to say! That's so cute you crochet! I tried to learn a few years back, and could do the first row, but could never figure out how to continue to a second row! No one tried to teach me though, I just learned from a book! I think I would have learned it better if someone was acutally showing me! :) I hope you do remember to upload some pics of your baby blankets you've made! You'll be using them before you know it! ;)Keyan- I haven't peeked at your O tracker yet, but i'm glad to hear your temps are still up and you have no signs of af showing yet!! I really hope this is it for you girl! That's so sweet of you to imagine all the baby girls running around playing together! Everytime we visit her and are getting ready to leave, we tell her we love her, and then we say good-bye to all the girls and tell them to play nice together! :) My aunt lives in California, and she wrote Kayln a birthday poem, and it's along the extent that all the babies in Heaven are all playing together, and they were just waiting for kayln! Even her headstone, which we're not putting out there until after spring b/c I don't want it to sink in the ground b/c of the weather making the ground soft, says \"Playing in God's Garden\"! I thought that was so cute! Thank you for calling me a great mommy! You all don't know how much that means to me!",
            "post_id": "3733576",
            "timestamp": "1228407416",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Hi everyone :-)Sorry I can't write and respond to U I feel a little bit tired and sleepy cos I'm today CD 1. I'm OK just tired, don't worry.Just wanted to tell U all that I'm thinking about U! Take care, God bless, I'll write back soon!Hugs, kisses and smiles :-)Lina",
            "post_id": "3733681",
            "timestamp": "1228408887",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "Thank you for the note! :) I'm having a good birthday already, since all you wonderful ladies keep telling me happy birthday! :) I'm sorry to hear af showed!",
            "post_id": "3733713",
            "timestamp": "1228409264",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Keyan- I am definately keeping my fingers crossed for you.  I'm hoping that I'll get online next week or so to see your status saying \"BFP!\" .luvkayln- I was only speaking the truth.  Your are a wonderful mother.  While it's hard to look at pictures like yours, I love that they are there. The love you have for Kayln speaks volumes through your photos and your tributes to her.  None of my babies ever made it that far but I think of them every day.  My crocheting is my \"chi\".  It's how I relax and I love it!  I've been crocheting for about 5 years now.  I have a bunch of stuff at home and I have a HUGE supply of yarn.  My DH gets mad because everytime we go to Walmart I'm picking up more yarn and I still have tons at home. So I'm trying to get through a bunch of it without buying more (unless it's absolutely necessary to finish a project).  I'm working on a yellow baby blanket right now that has hearts all over it and says \"Bundle of Love\".  I'm loving it already and I just started it yesterday.  Crocheting is pretty easy if you have someone there teaching you the basics.  And once you know the basics it's easy to learn the hard stuff.  Although... I still don't know a lot of the hard stuff.  I'm pretty content with my knowledge.  I try new projects a lot though.  The one I'm working on right now is a new pattern. I will be sure to post pictures tonight. I left myself a sticky note on my laptop!  So hopefully I'll remember. Ha ha.AF seems to be lightening up again but the cramps are still really bad today, so hopefully it'll stop here in another day or two.  Some people have told me that clomid can make you O later than normal.  But we're watching it.  If I O normally, I should O around the end of next week.",
            "post_id": "3733770",
            "timestamp": "1228409965",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Thanks for your comments on keeping the thread updated :) I really appreciate it!Mrspace: I'm so glad to hear your mom will be okay! I can imagine your relief :) I'm so glad the thread is making you feel less stressed! It's so helpful to have a positive outlet for our emotions & these ladies are the greatest!!! That's so cool that you crochet! Id live to learn. I have a friend who knits. Maybe I'll ask her for a lesson or two.  It sounds like fun! I will add you to our list tomorrow :)luvkayln: I'm happy to hear you're having a good day! :-) I'm excited that dh suggested we try iui a few times (although, I hope it works the 1st time!) If not, we'll be ready for ivf both emotionally (& financially!) in March. I love the wording on Kayln's headstone :)Candie: Yay, it's fun having a buddy! :)Armyprincess: Congrats on hearing the heart beat! :)Lina: I'm sorry about AF! :( Grlim te!",
            "post_id": "3734934",
            "timestamp": "1228426221",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "hey how are we allim enjoying my tww fora change i got other things on my mindand i actually feel like relaxing because its gonna comethe best things come to those who waitxxxx",
            "post_id": "3735286",
            "timestamp": "1228431364",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "wow thats a great attitude to have you are so right about goods things coming to those who waitmommyin09 can i just say its great the way you keep the list etc up to date in case i havent already said it Thank you",
            "post_id": "3735323",
            "timestamp": "1228431980",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Hi my friends = Zdravo moje drugarice :-)I'm great, even AF is here, I'm positive, happy and excited Christmas is coming soon, I have wonderful memories!!! I need to clean the house, set the Christmas tree and I'll make pictures and show them to all of U:-)LuvKayln - I'm very happy for U. Thanks for support! :-) I sow your pictures, I'm spechlees ;(( they are very beautiful and very alive! and want to tell U that U are veryvery human person and I'm very happy that I have a chance to know a person like U!!! God bless both of U. Hugs!Mamushko - Grlim i ja tebe drugarice moja :-) I'm for IUI moja drugarice 2. Go for it! How are U feeling though, did your cold went away? God Bless U both!!!Mrspace - I'm glad that you mammy is feeling better. Please be near her. HugsArmyprincess: Happy for your angel tick-tack! :-))) God Bless both of U!!!Take care, be happy, embrace?? you tummy from me :-)(I don't know the word in English, I found one word embrace in dictionary but I don't know is the right word - I want to tell U to go slowly with your hand up and down through your tummy) I hope U have understand me? :)Stacey- Congrats on 19 follies!  That's SUPER. I will be keeping my fingers crossed for you!  HugsKeyan - I hope and I wish U BFP! :-) My AF never lattes :(, so I think that U are in the right direction!!! Baby dust 2 U!Arlotheslug:  I'm thinking of you! God Bless U:-)To all of U lots of baby dust and good luck to the pg girls, and i hope that all of us will be future mothers in 2009!!! YEEAAAAAA  :-))))Have a nice and beautiful day and evening my friends!Good night, it's a sleepy time for me:-))",
            "post_id": "3735396",
            "timestamp": "1228433311",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "pyar  im sick of being down it will happen i no it i feel it and when i see my baby it will make everything worth it our bfps will agree i hopebet at some point they wanted to give up and look at them now our inspertions if they can do it we all canand good luck to everyone xx",
            "post_id": "3735411",
            "timestamp": "1228433673",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "luvkayln~ Thanks for letting me know abt the meds. Its the one thing tht I was very worried abt. BTW  Happy Birthday!!!!!!Mrspace~ Sorry to hear abt your mom but I am glad she is doing better.Keyan~  Wishing u a BFP and then some SSBDarmyprincess~ Congrats!!mommyin09~   Wishing u lots Baby Dust and luck on IUIAs for me i am 9do still sick with the cold but doing alot better.  I been keepin busy somehow lol and driving DH nuts lol.    I dnt hv much cramping like i was before but i hv been a bit nauceous and i not sure if its cause i am sick or wishing on my part.  Guess we will find out soon enoughHave a great night ladies!,",
            "post_id": "3736029",
            "timestamp": "1228444172",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "DH has his SA today!  I am going to meet up with him afterwards for dinner and xmas shopping.  We will have the results late Monday or Tuesday.  FF has put me at 5dpo instead of 7 dpo.  What do you all think? Honestly, I don't know.  I have been crampy this entire cycle. I wonder is that from the clomid?Metformin? Af should be here bw 12-11 and 12-13 either way.",
            "post_id": "3737018",
            "timestamp": "1228475051",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Mommyin09: Praying that you get a +OPK today!!! and that Tomorrow is Your DAY!!!Luvkayln: Kayln's gravestone is going to look great, and what it says, is so sweet!! Everything you've done look precious...Stacey: Just a few more days!!! How exciting!!Candie: LOL...me and dh are the same..counting every $!! but I got to say that I am the one keeping our budget!! Have a great O weekend!!MrSpace: That's good news about your mom!  and Thank you! You made me think... \"me on the list w/ a BFP\"... I know is what we all want, but sometimes we forget that this CAN really happen.LinaG : Sorry about the ugly red witch showing up!! I think my witch is playing a trick on me! Me and Dh are working on the house getting it ready for Christmas too, still haven't put on the tree yet, but the BIG clean is done!Shysana: Thank you! I am glad you are getting better. Do you plan to test soon?As of me THE SAME AS YESTERDAY.....No AF yet, no cramps, no sore bbs, but do feel the pressure I usually feel right before AF, Another day of waiting. maybe she is just going to be a little late, I am working on not getting my hopes up.",
            "post_id": "3737047",
            "timestamp": "1228475990",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "I hope dh SA goes well!! FF has me one day ahead in DPO than what my chart here says...all the info is the same, so I have no clue as to why they are different. Good luck w/ the christmas shopping!",
            "post_id": "3737061",
            "timestamp": "1228476375",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "sorry i was MIA yesterday internet went out and didnt come back on til after 9 last night.  all is going well here, will be 14 weeks tomorrow, went to allergist yesterday he put me on a differant inhaler for my asthma. and is going to do allergy skin tests after baby is born.  i dont THINK i have allergies but i guess you never know.  i am always sooo tired, i think i am still trying to get my sleep schedule back to normal after that VERY long day of driving last week. 2 weeks from today kids get out of school for christmas break. dang where did this year go? seems like they were just starting the school year yesterday and here it is christmas time already...i am soooo NOT ready for christmas, although i am in more of a christmas mood this year than i have been since my mum passed 4 yrs ago. maybe it is because of my kids being older, or maybe because of the pregnancy, idk but am kinda glad about it.",
            "post_id": "3737075",
            "timestamp": "1228477206",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "hey ladies- sorry i was MIA yesterday.  i took the day off of work, finally a well deserved day off and the fiance and i did lots of errands and even picked out our X-mas tree.well my 28 week appt went very well.  i passed my gestational diabetes test, so that is a relief.  i do have to watch what i eat though because i gained 6 lbs in 2 weeks.  so we went gorcery shopping yesterday and picked up lots of healthy foods.  now i just have to stick with it.  i even broke down and got frozen yogurt because i still need somehting close to ice cream so i dont jump out a window.",
            "post_id": "3737120",
            "timestamp": "1228479452",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "HI ladies i hope you are all doing well sorry for those who have had a bad time of late stay positive you're in my prayers as for me well i'm 9dpiui and nothing i don't feel anything not a twinge cramp etc so i don't know i only usually get af symptoms a day before my last two iui i had various cramps sore bbs etc so i'm hoping the lack of anything at all is a good sign i'm dying to test but i think its way to early i think i'll try to leave it another week if af doesn't show do you think thats a good idea",
            "post_id": "3737269",
            "timestamp": "1228483907",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Just wanted to say hi to everyone. Sorry I haven't posted in a few days, things have been hectic with work and getting ready for the holidays. Hope everyone is doing well.",
            "post_id": "3737288",
            "timestamp": "1228484337",
            "user_id": "user_546831",
            "user_link": "/personal_pages/user/546831",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeks (doc appt today! u/s 12/6)vortex: BFP - 20 weeksJoyce: BFP - 13 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 6 weeksmamatina:  CD4Mrspace24: CD7Stacey:  CD9 (Retrieval 12/9)kmcarino:  CD10Mommyin09:  CD13Candie:  CD14Hoping4_2: CD15ad_06: CD19jmh2005:  CD19wishandaprayer: CD22naf38:  CD24arlotheslug:  CD26Hannah1505:  3dporachjas:  7dpoSexykeme78: 8dpopyar:  9dpiuiluvkayln: 9dpoShysana: 10dpoLinaG:  13dpoKeyan:  15dpotracy4751: 17dpt************************************************Lina: In your message to armyprincess, I think the word you're looking for is to \"rub\" her belly :)  \"Embrace\" is like \"hug\".  You're so cute & your English is great, drugarice moja!  Thanks for the lessons :)  My cold is getting better. It should be gone when we're off work next week & hopefully dh doesn't catch it!  Still waiting for my +opk...Keyan:  I hope she's not playing tricks on you & that you get that BFP!  Your comment was so true 'cause although we are all hoping to be on that list, it is hard to imagine sometimes!  I hope to see you there very soon, my friend :)  Still no +opk, but maybe tonight...jmh2005:  Good to hear from you :)  Hopefully things slow down a bit at work. Enjoy your weekend!pyar:  Thanks :)  Let's hope your lack of symptoms is a good sign!  I think that's a good idea to wait another week (but I know I couldn't wait that long!)  Good luck!!!rachjas:  Good luck to dh today & enjoy shopping and dinner! :)leighanne:  That's awesome that your appt went well & you don't have gestational diabetes!  Great news!!! :)Shysana:  Feel better!  At least it's Friday.  You can relax more this weekend :)Stacey:  Yay, the last day of work for us both!  I'm SO happy to have next week off & I can't wait to hear how your transfer goes!  I'll be thinking of you!!! :)Luvkayln:  I hope you had a wonderful day yesterday!!! :)Candie:  Have you gotten a + yet?  I'm still waiting...",
            "post_id": "3737451",
            "timestamp": "1228487799",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "mommyin09- Thanks for putting me on the list! I feel so special now! Ha ha.  I agree with Keyan!  I hope you get that +OPK and that tomorrow is the day!  I'll be keeping my fingers crossed for you.  You've been so much help to me, and I can't tell you how much I appreciate it.  And that also goes to everyone else on this thread.  Thanks so much.luvkayln-I can't wait to see Kayln's gravestone.  It already looks amazing.  You inspire me girl.  You have so much strength and so much love.  Kudos.  I just know that God has something very special in store for you.  That's the way I look at it. What happened is terrible, without a doubt.  But He has bigger things planned for you.  It'll be amazing, I just know.  I'm keeping my fingers crossed for you, hun.Keyan- I agree with mommyin09!  I hope that this is it for you!!!  I'll be keeping my fingers crossed for a BFP!!  How exciting!Shysana-I am hoping that you're not sick, but that you're pg instead!  That would be wonderful.  My fingers are crossed for you and my thoughts are with you.  Thanks for the well wishes for my mom, also!The bad luck just keeps on comin'.....We had a break in last night at our house.  It was about 2am and we heard a loud crack.  It scared the **** out of me but DH said it was nothing.  A few minutes later I heard movement downstairs (our bedrooms are upstairs).  I'm a very light sleeper.  He didn't believe me but then got quiet and really listened.  Then he heard it too.  I was so scared.  But DH went downstairs and the kid ran.  It was some high school punk pulling a \"prank\".  More like just plain breaking the law if you ask me. DH ran after him (in the 4 inches of snow, wearing only boxers and no shoes or socks or anything) and of course caught him.  DH is a Marine..lol the kid had no chance.  DH got him on the ground and at about that time I caught up with them.  I had thrown my robe and snowboots on and ran after them, calling the police.  To be quite honest I was a little scared that DH would really hurt him.  He did a little.  The kid tried to fight him and DH pushed his head down on the concrete, so the kid has some scratches on his face.  The police came and took care of everything though.  The stupid kid took cookies. COOKIES!  Idiot.  I had baked snickerdoodle cookies last night and left them on the table.  He broke in to do damage but all he got to was the shower.  He knocked the showerhead/pipe off.  I should also mention that he came in with a metal bat.  But left it when he ran away from DH.  So we have no working shower and I feel gross this morning.  DHhas people coming to fix it this morning so hopefully I'll get to take a shower on my lunch break.Sorry that was such a long story.  It was a crazy night!  Ha ha.Other than that, I'm doing pretty well.  AF has tapered a little. It's more, medium now.  So that's good.  Still lots of bad cramps. I'm hoping that it ends soon.  I should O sometime around next weekend.",
            "post_id": "3737574",
            "timestamp": "1228489824",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Sorry I just got my computer back!!!Anyhow.. My next u/s is scheduled for 12/9 this Tuesday. Im hoping to see a little hearbeat. Im still a bit nervous.... I don't think the lady that did my U/S was qualified....Can't wait until Tuesay when a Dr. does it and tells me exactly whats in there.Im so furious with my Re...They are soooo nasty! They  have the rudest nurses ever! No one even congratulated me and my nurse coordinator walked by me like she didnt even know me. They had the nerve to charge $330.00 for the 1st U/S and $220.00 for the office visit...They even charged me $105 for each BETA ($210)They claim the $12,000 I paid them was just to get me pregnant and nothing elese is covered. Im soooo furious!! I requested my records and are now seeing another clinic for my next u/s on Tuesday! Im grateful they help me concieve but I feel they are taking advantage... My nurse has been nasty since day one.... Im done with those people! to make the matter worse they wanted all the money then and there if not they wheren't going to see me....",
            "post_id": "3737870",
            "timestamp": "1228494366",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Mrspace: Wow, what a night you had! I cant believe he took your snickerdoodles! I love those :) Luckily it was just a stupid kid & you're okay! I would be scared **** less!!! (excuse me) Take care! :)Guesito: Sorry youre having trouble with your RE's staff. I'm shocked they wouldn't even congratulate you! :( Good luck with the new doc.",
            "post_id": "3738161",
            "timestamp": "1228498879",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Guesito- OMG! You can tell they really love their job... NOT! I'm glad  you found somewhere else to go for your next u/s!mrspace- Thank you! You are so sweet, I'm speechless! :) You just know exactly what to say to make me feel better! I can't believe your house got broke into last night! That would be so scary! At least it was only a punk kid, and not someone trying to do intentional harm to you guys! It's a little funny though that he broke in and took cookies! Wow, you must be a GREAT cook! haha! :) That's awesome your dh caught him! That'll teach him to mess with you all! :) Still thinking about your mom! I hope she's starting to feel better!Keyan- That's great af still hasn't shown!! Holding out lots of hope for you! :)Mommyin09- Thanks, I did have a great day yesterday! Dh brought me flowers at work! It was really sweet! :)So, yesterday my bb's were freaking literally killing me! I felt like I had just got a boob job done! That was probably the worst they've felt throughout all my 2ww's! They just feel different this time around. It's more my nipples and the top and to the side near my armpits where they are super sore! Not looking into anything, just keeping you all updated! :)",
            "post_id": "3738201",
            "timestamp": "1228499529",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Morning AllMrspace all i can say Damm your cookies must be good!!!!ALl kidding aside I am sorry to hear abt the breakin but an glad you and DH are safe.Guesito  Sorry to hear abt the **** tht office is putting you thru hope the new office treats u alot better.I am 10dpo an want to test today but think it maybe to early any ideas?   If not then i will test on Sunday.   My cold is slowly going away but the i still feel bloated when i eat anyone have hd this before?   The good news is my sis is also tryin for a baby but she hd to have clomid and a HCG trigger done yesterday so she will be in the TWW  soon.  We hdnt really talked abt kids till yesterday whn i told her i was gonna plan to test so now i hv a buddy!!!!!   It feels like whn we were kids again either her or I wld go thru the same an share lol.",
            "post_id": "3738237",
            "timestamp": "1228500056",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "Sorry it was delayed.. Should arrive no later than Tuesday usps. Good luck!",
            "post_id": "3738573",
            "timestamp": "1228505889",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "The funny thing is.... I'm a terrible baker!  My cookies are not very good. I mean they aren't bad, but they aren't great.  I'm a great cook, just can't bake to save my life.  Oh well.  I just got back from my lunch break and the crew was fixing the shower!  Yay! I'm so excited.  I know this is gross, but oh well.  See, winter makes my hair a little frizzy and it has a lot of static.  So before I go to bed at night I put this deep conditioner in my hair.  Then I shower in the morning and my hair isn't so frizzy all day.  Well...I didn't get to shower.  So my hair looks like I haven't washed it in weeks.  It's so gross.  I feel so bad here at work today.  I would have gone over to my MIL's house to shower but I was so tired (only got like an hour of sleep), I didn't think about it.Oh well.guesito- I'm so sorry to hear that the staff treated you so terribly.  It's a wonderful thing, conceiving and they should congratulate you and treat you with respect.  It's rediculous how some places get so greedy. They don't care that they just made someone's dream come true, they just want the money.  That's how they sounded (if you ask me).  I really hope that your appointment with your new RE goes much better!  You deserve the best.  I can't wait to read your next update!  Congrats again.luvkayln-I am going to try my hardest to get those pics up tonight. I'm almost done with the blanket I'm working on now.  I got to pick up a TON of yarn on my break today.  When the kid ran from DH he knocked over the huge rubbermaid tub that I keep all my yarn in. So it looks like hobby lobby exploded in my living room.  Ha ha.  Oh well. It's almost all cleaned up now.  I have so much house work to do this weekend but I've been so tired. I just don't want to do it.  I hate housework.  So much.  Oh well.",
            "post_id": "3738778",
            "timestamp": "1228508506",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "luvkayln - I know we hate to read too much into things, but I hope that's a good sign for you!  I hope you had a great birthday.mommyin09 - I can't wait to hear +OPK news from you!Keyan - I hope AF is not playing games and is staying away for a good reason!  Come on BFP!  Hope your decorating went well, I love decorating for Christmas!mrspace - Oh dear, I am so sorry about the break in.  I can't imagine how scary that must have been.  It gives me chills just hearing about it.  I'm glad that DH was able to catch that punk!  I absolutely LOVE snickerdoodles.  I always make them for Christmas, so now you've really made me hungry for them!  Hope your mom is doing OK and that you and DH can relax this weekend.Rachjas - Hope DH gets great results.  Enjoy your Christmas shopping.  That's our plan for tomorrow.  I'm excited!LinaG - So sorry about AF.  Hopefully this cycle will be better.  I think you're doing a great job with the English too!leighanne - I'm so happy to hear that you're appointment went well.Have a good weekend everyone!",
            "post_id": "3738989",
            "timestamp": "1228511351",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Mamushko thanks for the word \"rub\" I have heard about it yes that is correct word, but in this stupid e-dictionaries that I use it's hard to find the word that I know but I can't remember in the moment when I write. When U know to many languages it's hard to express in the right way:-(.Drugarice moja thank you for all the data's that you update for all of us daily, and want to tell u that I'm CD 2.I'm thinking should we try this month by our self naturally without contacting my Doc.? If this month nothing happens to look for advice from him in January?!?I'm a little disappointed today I got my urine results & I have Escherichia Coli again after 1 year being clean and without this ******* bacteria, I hate it very much!!! The good side is that the values are  50.000- this are the smallest value in my history usually I had 1.000000 and I didn't have choice I needed to take antibiotics, but I really don't want to drink antibiotics anymore. I was on antibiotics when I did HSG before 1 month because my sedimentation was high, and I really want my body to be healthy and clean from antibiotics because I want to be clan when I start BD and want 1 healthy baby angel !!! I still need to contact urologist about this :((I wish U + OPK ASAP!!! and wish U and your DH this Christmas to have a present from God:-)",
            "post_id": "3738997",
            "timestamp": "1228511540",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "Guesito- Thank you! :) You're just so sweet! Thanks for the comment on Kayln's tree! I can't wait till you see your little one's h/b! That was the best day of my life when I found out I was pregnant with Kayln, and then that same day got to see her h/b! It's precious! :)Candie- Yeah, they were super sore yesterday, not bad today though! It was just really, really bad yesterday! I'm glad that's over with! :) My temps went back down today, so who knows what's going on with my crazy body!! Thanks, I did have a wonderful birthday yesterday! It made it even more special getting all my birthday notes from all the girls on here! :) I hope you and dh have a great time shopping tomorrow! We only have my parents and my brother left! I'm going to get Sean something little to open, because the bird was his early Christmas present, just like the computer was mine! :) But I still feel like he should have something to open from me! Drive safe tomorrow!!mrspace- LOL I laughed so hard when I read your post! :) Can't bake, and hobby lobby exploded in your house!! haha! I have hobby lobby written all over my house, I love that store! That's where I got all Kayln's decorations for her tree, and I got her tree there! I love it b/c everything is always on sale, and they always have the cutest stuff! :) Can't wait to see your baby blankets you've been making! I bet they are so cute! :)Shysana- That's great you have a buddy to ttc with now! :) It's great when other people that are close to you are going through it too, and you'll be able to support each other! :) Don't be discouraged if you do decide to test early and get a -ve. I just don't test, so that's how I keep myself from getting discouraged! :)Stacey- Only 4 more days  to go!!!! Woo hoo!!!!!!!!!!! :)",
            "post_id": "3739214",
            "timestamp": "1228515045",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "mrspace24- wow i can not beleive that a punk kid broke in.  To his defense, i would steal the snickerdoodle cookies too.  in my pregnant state, i would smell those yummy cookies from down the street and be inclined to break in.  NO just kidding but those cookies are yummy.  hopefully the little moron learned his lesson and your husband must have scared the cr*p out of him.Guesito- that is horrible.  what insurance do you have>?  I have blue cross and all of my RE appointments were covered, even my HSG test as well as each ultrasound and beta test.  I was even tolf if i needed IUI blue cross would cover a certain amount of them, luckily there was not need for it, i got pregnant naturally but it would have been covered if not.  I am sorry the nurses were beasts.  They are supposed to be very positive in that setting.  I would send them a nasty letter letting them know what you think of their services and tell them you are reporting them and giving them bad reports in all places.luvkalyn- oh i hated having sore BB's.  i do not wish them upon anyone, sorry they were hurting you.shysana- 10 days PO is early for some but others get BFP then.  I got mine at 9dpo.  it all depends on what you want to do.  if you want to buy a multi pack of tests go for it, buy if you are the type to get discouraged if it says negative, then try to wait til at least sunday if not monday.  good luck.candie and mommyin09- thank you for the congrats on my good appt.  my big 3d/4d ultrasound is tomorrow. i am excited and nervous all at once. i just hope the little guy cooperates.",
            "post_id": "3739847",
            "timestamp": "1228526163",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "Leighanne:  Will you find out tomorrow Jaedyn's weight?  (Did I spell his name right?)  Sorry if I didn't.  I remember you were hoping to find out his weight, but I can't remember if it's tomorrow's appt or yesterday's.  Best wishes tomorrow!!!luvkayln:  Oh, I hope your sore bbs are a good sign :)  I know, you & I have both been warned not to get our hopes up, but I hope you're leading the way for good things for both of us, since I always seem to follow you!  What a sweet dh! ;-)shysana:  You cracked me up saying those most have been good cookies!!!  I was thinking the same thing! :-)  Did you decide to test today?  That's great that you & your sis can support each other!mrspace:  Oh, I can totally imagine how you felt today!  And to be at work... I hope you get to shower soon & your house is all back in order!   Like Candie, now I want to bake snickerdoodles!  Yum :-)LinaG:  Thanks for the nice words :)  I hope to get my +opk this weekend!  So far, still negative...  I will update you on our list tomorrow, Drugarice moja.  Any time you're unsure about a word or phrase, just ask.  I'm sure we'd all be happy to help!  I'm so sorry to hear about the e.coli!  Be sure to call your doc a.s.a.p. & take care of yourself!!!Keyan:  Amiga mia, my fingers are X'd that AF stays away!  I hope it's a grrreat weekend for you & dh ;)Candie:  Still negative here.  How about you?  Remember my pattern of my +opk alternating each month, where I get my + on cd13, then cd15, then cd13, etc.?  Well, last cycle I got it on cd13, so I was thinking I'd get it on cd15, which is Sunday.  Because I'm not on meds, I wasn't sure if the pattern would hold., but we'll see!  Have fun shopping!Rachjas:  When do you expect dh's results?  Hope you had a good day! :)",
            "post_id": "3739949",
            "timestamp": "1228527917",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Lots to write this time!luvkayln- I GOT THE PICS PUT UP!!!!!!  Finally.  Ha ha. I'm working on taking some more pictures tonight and getting more put up.  But at least people can see a little of what I do.  I hope ya like them!  And, not trying to be a jerk here but.... any and all are for sale!  Ha ha. I have waaaaayyyyy too many.  And I love making them.mommyin09- My baking is NOT great, but they weren't bad.  DH and I had a few before we went to bed.  They were fresh out of the oven and still warm.  Love it!!  But now they are all in the snow about a block away, where my DH caught the kid. I am SURE that he learned his lesson. I know this is terrible to say, but the kid got so scared he peed his pants.  DH is a little intimidating with his big ol' biceps and using his \"Marine Voice\".  Ha ha.  But there was very little damage to the house over all.  A few things knocked over and the shower.  Which, by the way, is already fixed!  That was the best shower of my life, I swear.  Ha ha. I felt so gross all day.  Anyway, the crochet pics are up, take a look if you'd like.leighanne143- Honey, if I lived anywhere close to you, I'd bake you cookies right now!!!  Tonight I'm craving m&m cookies ha ha.  Yes, I said cravings, no I'm not pg.  Lol. Not yet!candie- I was really scared at first.  But we called the cops right away (DH didn't know if the guy was armed so I called before he even got downstairs) and took care of everything.  We are planning to do some relaxing this weekend.  Gotta save up for next weekend!  I should O sometime next weekend. Woo hoo.  This weekend he's going on a shopping trip without me to buy me lots of pretty things lol. I have no idea what he's getting me.Well I'm going to continue with my housework but I'll be on and off of here most of the evening probably.  Boredom.  Gotta love it.",
            "post_id": "3739994",
            "timestamp": "1228528676",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mommyin09- i asked the doctor on wed and she said its hard to guess his weight this early and any woman that says their doctor told them the weight is not accurate.  i will find out tomorrow how much bigger he has grown.  You spelt his name right, its jaedyn.  hopefully i will get some good pics tomorrow to post.mrspace- OH m and m cookies sound great too.  i am easily influenced by others during this pregnancy.  its funny because i found my favorite drink at panera while pregnant from listening to the woman in front of me when i was like 12 weeks along.",
            "post_id": "3740264",
            "timestamp": "1228532860",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "GuesitoWOW, I can't believe they had the nerrve to act that way! That's insane! I'm glad you arer going to a different DR.Luvkaylnhmmmm...... I know when I was PG it was more in my nipples to. But I do not want to give any false hope here.",
            "post_id": "3740292",
            "timestamp": "1228533515",
            "user_id": "user_353148",
            "user_link": "/personal_pages/user/353148",
            "votes": "0"
        },
        {
            "answer": "leighanne-OOO I love Panera but DH hates it. He's a simple turkey and cheese kind of guy and Panera is a little too \"fancy\" for him.  lol. I love it though.  What's your favorite drink?  I love their iced chai tea!  It's fabulous!",
            "post_id": "3740346",
            "timestamp": "1228534496",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mrspace- because of the woman standing in front of me at the beginning of my pregnancy jounrey, i order a half of cup of lemondae and then i fill the other half wtih the fresh brewed iced tea.  i add a litlr sugar and some fresh lemons, it is so yummy.  although i also love their hot cocoa.  my fiance will go there with me but he always orders turkey and cheese and comlains about it.  he does like the soup though so i always make his order a u pick 2.",
            "post_id": "3741117",
            "timestamp": "1228563903",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "mrspace24 - omg i can not believe that kid broke in and stole COOKIES...in a way it is funny and horrible at the same time.  i am glad the shower got fixed and that nothing was too terribly destroyed.  hope your mum is feeling lots better soonmommyin09 - i am 14 weeks today....6 more weeks until i can feel at ease...i lost the two between 16 and 20 weeks and so 20 weeks is my marker that all should be well.  that should also be around the time that i get my 20 week u/s....i am excited about that.  i wish my doc did u/s more often.the hernia doesnt seem to be pooching out too badly right now although it was really bad when my uterus first started growing...this will be my last baby...i will get my tubes tied and such when they do the c-section.luvkayln - not to get your hopes up too much, but my bbs are still extremely sore (at 14 weeks...have heard it should stop soon) but they have hurt pretty bad from the very beginning...hopefully it is a very good sign for you...when is af due?let's see what symptoms do i still have.....sore bbs (really bad some days) extreme fatique(tired all the time, and that trip downstate last week, REALLY messed me up)always hungry, weight fluxuating (about 3-5 lbs), headaches (mild almost daily-but although i have a bottle of tylenol on hand i try not to take anything other than my prenates)not too many cravings, but lots of foods that usually smell good smell HORRIBLE now. the nausea has subsided though, the things i could not eat or drink in the beginning i can eat and drink now.... i have had to go from 3-4 times a day to brushing my teeth 1 maybe 2 times because it always sends me into a fit of dry heaves.  YUCK......so needless to say i do NOT look forward to brushing my teeth....lolYUMMMM snickerdoodles sound good, but i have NO IDEA how to make them....lol....you can send me a receipe if anyone has one...lol",
            "post_id": "3741363",
            "timestamp": "1228573210",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "Joyce- Snickerdoodles are EASY.  They are just sugar cookies rolled in cinnamon and sugar.  Half the time (because I get lazy sometimes) I just make the boxed cookies mixes and roll them in the mixture.  Ha ha. But they are good.I didn't end up making anything last night.  I was too tired!  I'm going to be so much more tired tonight.  My DH's company christmas party is tonight.  It lasts from 6pm to 2am.  Ugh!  But we have to stay.  These are some of the things they're giving away:a motorcycle (new)a 52\" flat screen tv (and entertainment center)a home surround sound systema living room set up (couch, loveseat, coffee tables, and end-table)And that's just some of it.  Just for showing up you get 50$ each in city bucks (these paper dollars that can be used at any business in town, like cash).So it's worth going.  I am on my last day of clomid today!!!  I'm hoping that we O soon!!  Granted I know that I'm only CD 8 right now, so I have a little ways to go.  AF seems to be getting a little better.  The cramps are still bad, but they aren't as frequent.  Before, it was like I'd have these terrible stabbing pains, then a dull throbbing for the rest of the time until I'd have another stabbing pain.   Neverending!  Now it's just the occasional pain.  And it's lightening up a little more. So hopefully it'll stop soon!  It's already been 8 days!",
            "post_id": "3741459",
            "timestamp": "1228575836",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Good morning friends!  Happy Saturday!!What a busy week!  My RE called yesterday and asked me to go back to the clinic this morning.  It turns out my follies are growing fast so they moved the retrieval up to Monday!  I have 20 follies and they think they will all be mature enough to retrive.  I'm a bit nervous but happy to get it over with a day earlier!  So my transfer should be on Thursday.  I'm getting excited!!Mommyin09 - You are doing an awesome job keeping track of everyone.  Thanks so much!  Come on +opk!!!Luvkayln - I hope your sore bbs are a good sign too!  Since you don't normally have them, it should be!  I'm glad you had a wonderful birthday.  I can't believe you are 9dpo already!!  I had to look again to make sure it was not a mistake!Candie - No +opk for you yet??  Wow!  That is a longer cycle for you isn't it?  Hope for good news!  You, mommyin09 and myself are very close.Mrspace - Those must be some good cookies!!  I don't think I have ever had snickerdoodles but I am tempted to try them.  I better get some extra security if I bring them home though :)Guesito - Sorry you had a bad experience! I hope you have a better experience at a different clinic and I look forward to hearing your update with a heartbeat!  Question: Did your retrieval hurt?? I'm a bit nervous!Arlotheslug - Still thinking of you friend.  Hope you are doing ok.Well..I have to run because Honey is nudging me to go for her big Saturday walk!  Bossy girl. :)  I'll try to check in later!SSBD!!!!Stacey",
            "post_id": "3741619",
            "timestamp": "1228579821",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Its not painful at all.... You are put to sleep so you won't feel anything. Only minor discomfort (Like a bad period) when you wake up. Not too bad..",
            "post_id": "3741896",
            "timestamp": "1228585021",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Stacey- I just sent you a message, but that's so awesome that your retrieval is Monday and your transfer is on Thursday!!! Wow! It seems like we were all waiting so long for you to be at this point, and now it's here and it feels like it just snuck up on us! :) Have a good time walking your bossy girl! ;) I'm not sure if these sore bb's are a sign for me or not. My temps are acting crazy! They say if you are preg than your temps are higher than normal, well, mine are lower than normal!? Af should arrive in about 4 days! And not to shock you even more, but i'm 10 dpo, not 9! :) So, if my cycle decides to cooperate this time around, I should only have a 14 lp, either way, NO more provera for me! :)",
            "post_id": "3741958",
            "timestamp": "1228586061",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeks (u/s today!)vortex: BFP - 20 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 6 weeks (u/s 12/9)LinaG:  CD3mamatina:  CD5Mrspace24: CD8Stacey:  CD10 (Retrieval Monday! Transfer 12/11)kmcarino:  CD11Mommyin09:  CD14Candie:  CD15Hoping4_2: CD16ad_06: CD20jmh2005:  CD20wishandaprayer: CD23naf38:  CD25arlotheslug:  CD27Hannah1505:  4dporachjas:  8dpoSexykeme78: 9dpopyar:  10dpiuiluvkayln: 10dpoShysana: 11dpoKeyan:  16dpotracy4751: 18dpt************************************************Stacey:  I'm so excited for you!  Just a few days to go :)  Your comment about the extra security cracked me up !  If you've never had snickerdoodles, definitely try them.  They've been my fav since I was a kid ;)Leighanne:  Best wishes today!!!  I can't believe you're getting so close! :)mrspace:  Your pics are great!  I talked to my friend who crochets & she's gonna teach me :)  Have fun at the party & good luck!!!My opk's still negative, so will try again tonight, but I'm betting I'll get my +opk tomorrow, cd15, still following my pattern :)  Have a great day!!!",
            "post_id": "3741983",
            "timestamp": "1228586659",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "well i tested today and got a BFN so i am a lil bummed just gonna wait an see if i get my period on the 9th   ;(",
            "post_id": "3742000",
            "timestamp": "1228586928",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "Mommyin09- Keep up that bd pattern, and hopefully you're +ve opk will be tomorrow!! :) Your temp did a little jump this morning, but I'm sure you tested yesterday morning and night, so you didn't miss your surge! Can't wait to see how your temps are tomorrow, and if that opk gives you a big smile! :)Shysana- It may be early sweetie! You're only one day ahead of me, and I would not even think about testing right now, not that i'm going to anyways, but if I were, I know it's early! Are you temping? That's a good way to kind of see if you should test or not. If your temps are still up, it could be a good sign. If they're down, af will probably show. Stay strong, if your not preg this cycle, just keep trying and it'll happen!",
            "post_id": "3742020",
            "timestamp": "1228587318",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Shysana:  I agree with luvkayln.  Don't get discouraged!  It is still early :)luvkayln: Yeah, my temp jumped up, but I am testing opk's a.m. & p.m., so I haven't missed my surge!  I'll test again tonight & let you know :)",
            "post_id": "3742309",
            "timestamp": "1228593889",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "I figured you were testing twice a day! :) That'd be cool if you got your +ve tonight, but hopefully at least by tomorrow! If you do get it tomorrow, you'll be able to do iui, right?",
            "post_id": "3742388",
            "timestamp": "1228595565",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "mrsspace-- I'm so sorry about your mom, I hope she's getting better.  Thanks for the support too.  We've only done 1 round on Clomid & 1 on Femara so RE may suggest higher doses before needles-- we'll see.  I think my patience is just running thin ; )luvkaylin, thanks a bunch for the follistim recco, I'm on CD1 today & meet with the RE tomorrow morning so we'll be sure to talk about that option!Stacey-- lots of good wishes for your retrieval!Lina, I'm 2 days behind you on CD1 & was also thinking about skipping the Dr this month -- I recently changed my mind only b/c the timing for an IUI works well with my vacation schedule... since we can't find a dog sitter, I'm vacationing at home.  I've read that some antibiotics clear the body pretty quickly so maybe you can take the antibiotics & have them out of your system before implantation???Ladies, there are a lot of you to get to know & I'm looking forward to it... thanks for your thoughts so far on injectables -- I'd love any other suggestions you have.  I've only gotten 1 follie on low doses of clomid & femara so I think I have a lot of options still but, as usual for me, I'm looking for the quickest solution!DH is cookin' so I'm signing off to go supervise...",
            "post_id": "3742965",
            "timestamp": "1228607107",
            "user_id": "user_685595",
            "user_link": "/personal_pages/user/685595",
            "votes": "0"
        },
        {
            "answer": "Hi guys started spotting yesterday so expect full flow soon so i'm out this month feel rubish don't know where to go from here this was my 3rd  good luck and god bless",
            "post_id": "3742987",
            "timestamp": "1228607651",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Well ladies I have been away for a few days. My niece had her baby on the 4th. She was 3 weeks early. She weighed  6 lbs 10 oz and was 19 inches long. She is a beauty! So that is why I haven't been on here. Besides work, going to see them and everything else I haven't had time.So for me: I am on CD 20, don't know when I O? The last week my BBs have gotten sore, more sore now then ever. I have had heartburn the past 3 - 4 days. It comes and goes. I have been really emotional, and just plan out bitchy!! I am hoping for a BFP this cycle, but if not I hope it's soon :)Hope everyone is doing well!",
            "post_id": "3743534",
            "timestamp": "1228618251",
            "user_id": "user_255732",
            "user_link": "/personal_pages/user/255732",
            "votes": "0"
        },
        {
            "answer": "Hey!quick update: No AF yet, BFN this morning, I guess the AF's trick is on me this cycle.",
            "post_id": "3744377",
            "timestamp": "1228652813",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "hi ladies,i went for my 4d ultrasound last night and it was great because jaedyn cooperated.  he already looks just like me.  he has my cheeks, my nose, my chin.  My fiance was so mad, sitting there pouting saying he looks nothing like me.  tyring to explain that when the baby is born he will change his appearance all the time for the first year to him was like talking to a wall.but check out the pics and tell me what you think.  dont mind his private area one, i just did not realize that unborn babies testicles could be that big.  i was amazed and scared all at once.Leigh",
            "post_id": "3744393",
            "timestamp": "1228653448",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "Leigh, lol you made me laugh with the testicle comment....just wait til he is born, all newborn babies genitals swell up and sometimes there is a discharge from either genitals (usually w/girls) and/or breasts....totally normal so dont worry about it.  but the swelling is caused from hormones and will go down a few days to a week (i would say probably before the cord falls off) after birth.pictures are awesome by the way.",
            "post_id": "3744411",
            "timestamp": "1228654043",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "so im headed back for another u/s this Tuesday 12/9 to see a H/B. Im so nervous even though everything is ok! You know how it is we never stop worrying until we hold our babies in our arms.! I'm beggining to show a little which is weird because I didn't show until my 4th month for my kids. My hubby rubbed my belly this morning and said I can see it! I almost balled!! I woke up happy and hopeful!!! Happy Sunday!!!",
            "post_id": "3744564",
            "timestamp": "1228659291",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "joyce- thank you.  glad i could make you laugh.  i have 162 pics from my ultrasound.  the tech gave me all of the pics she took on a disk so those are just a couple.  i have a little brief video that i am going to have to up load and give you ladies the link to plus i have my big video.",
            "post_id": "3744596",
            "timestamp": "1228660228",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "hey girls im 5dpo woohooo my fiance was 21 yesterday had a brill party was soo much fun.i just needed to no somthing as this has never happened before when i am going to the toilet for a wee when i finish i am gettin a funny sensation like i need to wee more and a lil strain any ideas i spoke to a nurse she sed it dnt sound like an infectioni feel so ill today really sick x",
            "post_id": "3744928",
            "timestamp": "1228668678",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeksvortex: BFP - 20 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 6 weeks (u/s 12/9)LinaG:  CD4mamatina:  CD6Mrspace24: CD9Stacey:  CD11 (Retrieval tomorrow! Transfer 12/11)kmcarino:  CD12Mommyin09:  CD15Candie:  CD16Hoping4_2: CD17ad_06: CD21jmh2005:  CD21wishandaprayer: CD24naf38:  CD26arlotheslug:  CD28Hannah1505:  5dporachjas:  9dpoSexykeme78: 10dpopyar:  11dpiuiluvkayln: 11dpoShysana: 12dpoKeyan:  17dpotracy4751: 19dpt************************************************Good afternoon!  Sorry for the late update.  My internet was down since yesterday, but thank God it's up & running again! :)Luvkayln:  I got a negative opk last night & this morning.  So, I'll test again tonight; and if it's positive, we'll do iui tomorrow.  If not, looks like we're on our own this cycle 'cause we're heading out of town on Tuesday morning.  It's okay either way :)  We'll see what happens!yogachick:  Do you want me to add you to our list?Ad_06:  Congrats on your new niece! :)  It's great to hear that she's big & healthy!  What's her name?pyar:  Sorry you feel AF is coming!  Hang in there.Keyan:  Sorry about the bfn! :(  If AF does show, I'm glad you have a plan in place.  You'll get your lap scheduled & move forward, a step closer to your BFP! :)  Take care!Hannah:  I can't answer your question, but Happy Birthday to your fiance! :)leighanne:  I'll have to check out your photos!  How exciting that you got so many & that he cooperated :)Guesito:  Good luck on Tuesday!Stacey:  I'm sure your retrieval will go smoothly & I'm so glad it was moved to Monday.  Now I'll get an update from you before we go out of town! I'll be thinking of you!!! :)",
            "post_id": "3745602",
            "timestamp": "1228681814",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Hello ladies! :)I'm sooo exhausted, but wanted to check in and see what's new! My temps are way down today, I think af may be trying to show! It'll be weird, b/c I'm only 11 dpo and have never started before 14 dpo, but will take it now if it's coming so I can start my injections! I only got 4 hours of sleep last night after working a loonnngg day at work yesterday, and waking up and going straight to work today. Do you think maybe that's why my temps were so low today? I'm pretty sure I have read somewhere that as long as you sleep for 3 hours, you can take your temp and it should be accurate as long as you take it at the same time like normal?! I'm not sure, maybe i'll do some research! :) I did start cramping yesterday while I was getting ready for work, and it's been worse today, well, this morning anyways. I haven't had them since about 9 am today. Anyway.....Mommyin09- I'm suprised you still haven't gotten your +ve opk! I guess the every other month trend ( CD 13 or 15) is broken! :( Your temps did drop today, so hopefully in the next couple days you'll get it! That'd be cool if you were still able to do iui, but if not, you know the routine! ;) I hope you and dh have a great anniversary, and a great mini-vaca!! :)Stacey- Tomorrow's the big day! Hope everything goes well, and I can't wait till your transfer on Thursday! :) It'll be exciting to hear how many embryos they transfer! Be sure and keep us posted on how you're doing over the next few days!!! I'll be praying for a successful ivf for you, my friend! :)yogachick- So excited that you're starting your Follistim tonight!! :) I can't wait to start mine! Hopefully we'll be close enough in our cycles if af will hurry up and show for me! It'd be great to go through our first round of injections together! :)Keyan- I know seeing that -ve is hard, but at least af still hasn't shown! That's an awesome sign!!! Good luck! :)Guesito- We'll be anxious to see how everything goes on Tuesday! You are exactly right, the nervousness will always be there during a pregnancy for anyone who has lost a baby, or even for those who haven't! It's all in God's hands, all we can do is put our trust in Him! :)Pyar- Sorry about your spotting, but until it's a full flow, don't get discouraged! Even if af shows, there's always more options! Stay strong! :)Candie- Have you gotten your +ve opk yet? I'll be shocked if you haven't! You always ovulate so quick in your cycles! Maybe we're switching spots here! :)Hope everyone had a great weekend, and to those of you who are off next week             ( Mommyin09 & Stacey :), enjoy it!",
            "post_id": "3745767",
            "timestamp": "1228685325",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Hi all. Hope i am welcome to join. Iam 12 DPO and had 2 BFNs already, I am hoping to get my progestrone results by wednesday from my doctor, the hospital would not tell me last week..:o( I am going to re test on tuesday 14 DPO (if i cant find the test earlier lol) my partner has hid it from me...haha...xx",
            "post_id": "3745769",
            "timestamp": "1228685445",
            "user_id": "user_679002",
            "user_link": "/personal_pages/user/679002",
            "votes": "0"
        },
        {
            "answer": "Welcome!The support system in this room is amazing! We are so delighted you can join us! I have met the best human beings, understanding, caring, beautiful lovely ladies here. Im sure you will too. Again Welcome!!!",
            "post_id": "3746130",
            "timestamp": "1228692200",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Just woke up from a lovely nap! :)Babymomma- Welcome to our thread! :) That's funny that you have been cut off from testing! LOL I'm sorry you've been getting  bfn's, but hopefully it's just too early! Are you on any meds or are you doing a med-free cycle? Either way, good luck! If you tell Mommyin09, she will happily add you to our list. It's a fun, easy way to know where we are all at in our cycles!",
            "post_id": "3746954",
            "timestamp": "1228708111",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Hey, I got my +opk tonight!  Luvkayln, my alternating schedule is holding true! :)  Looks like iui tomorrow morning & then we'll leave for our mini vacation on Tuesday.  The timing couldn't be better!  Wish me luck :)Stacey:  Hopefully tomorrow is a great day for us both :)  I'll be thinking of you !Babymama:  Hey there :)  I'm glad you decided to join us :)  Let me know if you want to be added to our list.  So, have you searched the whole house!?  I say, good for dh!!!  (although it would drive me crazy!)  I hope you get your results tomorrow.  I'm so surprised that they're making you wait so long.  When will you test again?  Best of luck to you!",
            "post_id": "3746994",
            "timestamp": "1228709042",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Mommyin09- GGOOOODD LUUUCCKKK!!!!! :) I'm SO happy for you! You are right, the timing couldn't be more perfect!!! I have an awesome feeling for you this month! I just know something great is about to happen for you!!! ;)",
            "post_id": "3747047",
            "timestamp": "1228710072",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "well 12dpo and have done 2 HPT and both were BFN all thy symptoms i was having before are gone :( .   I dnt think i will be getting a BFP this month so i am just going to wait for AF to come.Wish all other ladies a BFP this month!!!! SSBD!",
            "post_id": "3747292",
            "timestamp": "1228716736",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "hi all, thankyou for warm welcome :o)luvkayln - Yeah i am on clomid CD 2 - CD 6 my first round this month.mommyin09 - i would love to be added to list please. Yes its driving me mad he has hid the test from me :o( I have looked everywhere - i asked him last night where they were and he has took them to work - there in his office draw....lol.. i will be testing again tomorrow...i am still waiting on my progestrone results :o(",
            "post_id": "3747641",
            "timestamp": "1228734194",
            "user_id": "user_679002",
            "user_link": "/personal_pages/user/679002",
            "votes": "0"
        },
        {
            "answer": "Good Morning Ladies!Mommyin09: CONGRATS on the +opk...I love the smiley face!!! It is Perfect timing!!Luvkayln: did AF show?!?! I know what you mean...if is not this month, well then lets move on to the next! Hopefully she won't show for the right reason... a BFP!!Stacey: I hope everything goes well today!! Good luck!!Shysana: sorry about BFN, until AF is here it is not over!!BabyMamma: Welcome! That's so funny about dh hiding your tests! and then AT WORK..LOL!!! Too funny!! Good luck on your test tomorrow!Candie: How was your O weekend?!?!Well about me, nothing new...just waiting, maybe today AF will show, I had AF type of cramps this morning when I woke up, but nothing now....",
            "post_id": "3747696",
            "timestamp": "1228737392",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Good morning!Just a quick hello before I go off to the retrieval in 20 minutes.  Thanks for all of your thoughts and well wishes!  I'll check in later when the drugs wear off. :)Guesito - thanks for the reassurance.  I'm just excited to get it over with!!Mommyin09 - How exciting!  All the best with your IUI!!!  I'll be thinking of you too!Luvkayln - I saw your temps dropped but don't lose hope yet my friend.  Lot's of reasons and if your sleep pattern has been off it could definitely affect your temps.SSBD to all!Stacey",
            "post_id": "3747780",
            "timestamp": "1228741162",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "update....AF is finally here!!! It is strange for me to say this..but I am happy she did show, I was scared to have to take meds to induce it, now I can move on to my LAP on January...YAY!!! :o)",
            "post_id": "3747846",
            "timestamp": "1228742726",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Stacey & Mommyin09- I'm thinking of both of you today!!! :)Stacey- Thanks, but I definately think af is trying to show. My temps are still way down today, plus I woke up with cramps that felt like they were all in my lower back! Af should be here Wednesday, that will be 14 dpo. I thought yesterday's temp did have something to do with me getting hardly any sleep, but last night I slept for 8 hours and my temps are just as low as yesterday. Oh, well! I'm just waiting for it to show now, so we can move on to these injections! :) Check in later, when you feel normal again! :)Mommyin09- I'm so excited for your iui today! What time were you going in to do it? I can't wait to hear how everything goes, and what you think of it all! Isn't it funny that you, Stacey and I are all doing something new this month that gives us all hope! :) I sure hope it pays off this time! :) Good luck, and i'll be waiting for you to check in!!Keyan- I see af still hasn't shown for you! I've been cramping this morning too, and have been on and off since Saturday night. I wish she'd just show up already! I'm positive i'm not preg, my temps absolutely s u c k this month! You still have hope. Your temps are still up, and af still isn't here! Good luck!! :)Yogachick- Good luck with your first shot of Follistim tonight! I'm so jealous!! ;) Let me know how it goes!Babymomma- Good luck with your test tomorrow! I hope you get a wonderful suprise! :)mrspace- How are you doing? I hope af will end soon for you! When is your next u/s appointment to check your follies?Shysana- Keep your chin up! It'll happen one of these tries! :)Does anyone know what is going on with Tracy? Anyone see her results posted anywhere???",
            "post_id": "3747874",
            "timestamp": "1228743312",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Keyan- Ok, don't think i'm an idiot! :) I was still typing in my post when you were posting yours! I know how you feel! I'll be so happy when af finally shows so I can move on! And i'm so with you, no period inducing meds for me this cycle, no matter what! I know that's what's been messing up my cycles lately! So, what's the protocol for you this next round?",
            "post_id": "3747896",
            "timestamp": "1228743819",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "You are in my thoughts and prayers wish both a big fat BFP!!!! Stay positive and don't let the 2www drive you crazy.. Stay busy and think yourself as pregnant!!!",
            "post_id": "3747912",
            "timestamp": "1228744181",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Good mroning everyone!  Well, I think I am 3dpo today.  When I started my OPK's on Thursday, I had a faint line that I expected would get darker, but I've tried everyday since and nothing.  My temps went up on Sat and have stayed up, so I 'm thinking Thursday's faint line was maybe the end of my surge?  I guess I O'd early for some reason.  Good thing we started the BD early!  :)mommyin09 - Yay for the +OPK!  I am so happy that everything worked out and that you get to have your IUI today.  What perfect timing that will be with you being off this week.  I really think the stars are aligning for you!  :)luvkayln - I think your sleep pattern could definitely be the reason your temps were a llittle strange.  I'm sorry you are having cramps now too, but hopefully everything will be OK.  If not, at least you have the injectibles to look forward to.  I know you'll be getting that BFP soon one way or another!Keyan - Thanks for the note.  Like I said above, good thing we started \"practicing\" early!  I just wish I could figure my cycle out one of these times!  I'm so sorry about AF, but I know you were expecting it.  I guess the silver lining is that you won't have to take meds to bring it on.  I hope your lap next month gives you some answers.  I think that's going to be my fate one of these days too.Stacey - Wow, I am so very happy that everything is going so smoothly for you this cycle!  I'm sure the IVF process can be pretty uncertain and scary, but it looks like your body is doing wonderfully!  Good luck with the retrieval today.  I'm sure Honey will love it if you get to lounge around with her this week!  Nittany is the same way, he loves his walks!  Although, our windchills have been in the single digits, so he's been a little depressed that we haven't gone for long ones the past few days.BabyMamma - Welcome!  Hope you get good news this week!ShySana - So sorry about your BFN's.  Hopefully it's still a little early to test and you'll be OK.Guesito - What a cute little story about DH rubbing your belly.  I'm so jealous!  :)  I hope all goes well at your u/s tomorrow.leighanne - I looked at your pictures and they are amazing!  What a cool thing to have.mrspace - I checked out your pictures as well and everything that you made is so beautiful!  You are quite talented, I wouldn't even know where to begin with something like that.  I also noticed the pics of your puppies and they are adorable!  They look like they are spoiled just like ours.  :)pyar - Did AF show?  I am so sorry.",
            "post_id": "3748089",
            "timestamp": "1228747598",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Hey everyone!  Sorry for not keeping up this weekend.  It was quite a weekend.   But I'll get to that in a minute.  First things first.Mommyin09-Congrats on the +OPK!!  That's exciting.  That's my big worry this month.  I haven't O since before my wedding (3 months ago) at a minimum. I didn't take OPKs before then so I'm not sure about before then. We finished up the clomid on Saturday so I'm hoping it'll work!  We'll have to wait and see!guesito- I am so excited to see how your u/s goes tomorrow!  I know it'll be amazing hearing your little one's heartbeat.  It's a beautiful thing!  Way to go, momma!keyan- Congrats on AF showing. I know how you feel about that.  I was on progesterone to induce mine this cycle and I was so glad when it actually started!  One step in the right direction, right?  I hope you had a great weekend!stacey- Good luck with the retrieval!  I have no idea what all that entails, but good luck! Ha ha.  I'm not very educated when it comes to the TTC scene.  I know some about what I'm going through, but I'm learning just by reading about all of you.  You have all my thoughts and wishes!  Keeping my fingers crossed for you, sweetie.candie- Thanks for the sweet comments about my photos.  I love crocheting.  The middle of the blanket that I'm working on is turning out to be MUCH harder than I anticipated.  The blanket is worked in two parts and I have the outside done.  The inside is kicking my butt!  Our puppies are our babies lol.  Although they're not really puppies anymore ha ha!  I still can't believe how big Max is getting!luvkayln- Hey girl!!! Sorry I wasn't around much this weekend!  I am almost positive that AF has finally ended. It got really light last night and today it's just barely spotting.  I'm still having some cramps but oh well.  At least I'm not bleeding as much!  As far as I'm aware...we're not having u/s to check my follies.  Not sure why.  Our dr just said to do the charting and so on.  I'm just nervous that I won't ovulate at all.  I've had all  -OPKs so far, but I'm also only on CD10.  So, I'm still watching to see what happens.  I'm definately keeping my fingers crossed.Okay now for my update:Af has finally started to stop.  I think it's done now lol.  Just barely spotting today.  As I told luvkayln, I'm not having u/s to check the follies.  We're not doing IUI or anything so I didn't even know we were supposed to.  We're just charting and taking the meds this time.  It's kind of nice not to have to take any pills now lol.  I'm enjoying it while I can.  Oh.. well I'm still taking my prenatals, but that's different lol.  I love that my temps are starting to regulate. It's been in a nice little pattern the last few days.  I'm hoping that's a good sign.DH has been SO amazing lately.  Last night he STARTED a big conversation about TTC.  He usually doesn't like to talk about it a whole lot because he doesn't understand it all.  But last night he was so interested in it all!  He kept asking me what we needed to do now, when I should O, when we're supposed to BD, and what happens after that.  He was so great and supportive. He's so excited.  He emailed me a bunch of pictures while he was at work. Pictures of baby rooms that he liked.  He said that he can't wait til we buy a house (after January) and start to work on the baby room.  He said it's the first room he wants to do lol. He's adorable.We had DH's christmas party on Saturday. It was okay.  We got 75 dollars in \"city bucks\" to use anywhere in town.  Not to shabby. Unfortunately my MIL sat next to me the whole night playing the \"I'm the worlds best MIL\" game. Her and I DO NOT get along.  I tried for 7 years to make her like me, and NOTHING worked. She kicked me out of her home several times and it has just been a nightmare. She accused me of lying about my m/cs, saying that I had abortions because I didn't know who the father was.  It has been terrible.  But luckily, DH has stood by me the whole time. The last time, he walked out on his family.  He told his mom that she had been given a choice to either accept me as a daughter or lose her only son.  And because she kicked me out, she'd made her choice.  We didn't speak to them for over 6 months before she finally came and appologized.  It's just been one thing after another with her. But at this point, now that we're married, she's played semi-nice.  She still tells me that we need to wait to have a baby so that WHEN (not if) her son decides to divorce me, there won't be children involved.  But I just ignore her. I could care less at this point.  I'm married to him, we love each other, and we WILL have a baby.  That's all that matters.Sorry for my little venting session there.Other than that everything is going well.  My momma is doing great and has started to heal quite well.As of right now, that's all I know!  Ha ha.  Have a great day everyone!",
            "post_id": "3748220",
            "timestamp": "1228749961",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Well looks like it was just AF symptoms :o(  just showed up :o(lets hope i can do it this cycle x",
            "post_id": "3748324",
            "timestamp": "1228751722",
            "user_id": "user_679002",
            "user_link": "/personal_pages/user/679002",
            "votes": "0"
        },
        {
            "answer": "babymamma- Sorry AF showed up.  Stay positive though!!!  I just finished my first round of clomid so I'm not too far off from you!  I'll be keeping my fingers crossed for you!",
            "post_id": "3748378",
            "timestamp": "1228752786",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mrspace- Wow! Your mil sounds like a GREAT person! ( Did you catch my sarcasm!? :) I can't believe she would say any of that to you! I'm glad you are a bigger person than her, and can just look over it all! You are right, you WILL have her son's baby, and you will be together and have a happy family! That shocks me that she would say you were lying about your m/c's and you had abortions b/c you didn't know who the father was!!! Who the hell is she to say anything like that! M/c's are hard enough, you don't need someone, especially your mil, saying you lied about them! WTF!!!? I'm glad af is finally lightening up for you! That had me a little concerned! I'm sure it's the transition from not ovulating for a few months, then starting af and taking something to induce ovulation that's got your body acting like it is. Don't worry about your -ve opk's. You are still very early in your cycle. I usually ovulated on CD 16 or 18 with clomid, but everyone is different. You may ovulate sooner or later than that. Just keep testing b/c you don't want to miss it! :) Besides, your temps will tell you for sure when you ovulated! I'll be more than happy to help with that when the time comes! :) I'm not sure though, why your doc is doing u/s while you're on clomid?! Mommyin09 never did iui with clomid either, just timed intercourse, but she always had an u/s to show how many follies she had. I would ask your doc why they aren't monitering you?! Your dh is so cute!! :) I LOVE that he's so interested in ttc, and is anxious to get the baby's room ready! That's so sweet he's emailing you pics of baby rooms that he likes! Awww... what a sweetie! :) I'm glad your mom is feeling better! Hopefully she'll be feeling like herself again in time for the holidays!Babymomma- I'm sorry af showed! :( You CAN do another cycle! Stay strong, we're all here to support you! :) I'm 12 dpo today, and feel af coming too! I'm not upset, just ready for it to be here so I can keep going!Candie- I was wondering if you O'd yet! :) Glad to hear you're 3 dpo already!! I bet you did catch the end of your surge, especially if you saw a light line on Thursday, and nothing since! Plus,  your temps went up on Saturday and have stayed up! I peaked at your chart, I totally agree that you are 3 dpo! :) Looks like you and Mommyin09 are once again very close in the 2ww! I hope this is it for both of you, just in time for Christmas!!! Good luck sweetie!!Mommyin09- I'm PATIENTLY waiting to see how it went!! :) Ok, not so patiently waiting! I'm anxious, and sooo excited for you!! :) I'll be checking in throughout the day to see your update!! :)",
            "post_id": "3748427",
            "timestamp": "1228753677",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "hey all how are you i still dont feel good im 6dpo and when i go to the loo i feel a pulling sensation and its uncomftable it is not an infection as my water is very pale so i dont noim taking baby safe pain killers any wayhope every one is ok x",
            "post_id": "3748533",
            "timestamp": "1228755406",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "luvkayln-  Hey girl!  Yeah, my MIL is a piece of work. But oh well.  She is my DH's mom so I play nice.  At least as nice as I can.  I'm not one to be walked all over so I have stood up to her on several occasions.  Though, DH ususally does it before I even have a chance to. He's so great.  We were discussing baby names again today because no he's decided that we're having triplet boys.  Ha!  I don't even know if I'll ovulate, let alone get pregnant, let alone get pregnant with 3!  Ha ha.  He's so funny.  But he's sweet.  Life is actually going really well for the two of us.  We're getting along great.  That baby blanket is kicking my butt at the moment so I started a new one.  I will come back to the first one later tonight. I kept messing up and needed to work on something else for a bit.",
            "post_id": "3749143",
            "timestamp": "1228764300",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mrspace - I know, our puppy isn't a \"puppy\" anymore either.  He just turned 9 in October and he's starting to get so gray, but he still acts like a puppy and he's such a sweetheart, so that's all that matters.  I am so sorry about your MIL.  You're right though, you have your husband's love and support, so that's all that matters.  I used to have problems with DH's mother too.  We started dating in high school, so I think she figured it wouldn't last.  Once she realized I was there to stay, she would always pick fights with both of us, she'd call DH at college and cry all the time, it was brutal.  She finally apologized shortly before we got married, and it took a while for us to trust her (she still does play games occasionally), but it is a lot better.  Hopefully it will get better for you too.  As far as the Clomid, I didn't O until cd16, so you should be OK.  Are you just seeing an OBGYN and not a specialist?  I know my OBGYN didn't schedule any monitoring for me either, so I eventually called in and talked to a nurse and they let me come in for an u/s on one of my Clomid cycles to make sure it was actually working.  I hope it works for you!  :)Hannah - Sorry you are still not feeling well.  Have you been able to see a doctor?Luvkayln - You are too sweet.  :)  Thanks for looking at my chart.  I'm glad you agree with me.  I O'd on the same day the last 3 cycles, so of course just when I thought I had it figured out, it does something crazy!  I pray we all get Christmas miracles!BabyMamma - I am so sorry about AF.  Hang in there.  I know the disappointment all too well, but it will be OK.  Take care.mommyin09 &Stacey - My thoughts and prayers are with you both today!  I'm with luvkayln - I'm dying to hear how it went.  :)",
            "post_id": "3749181",
            "timestamp": "1228764822",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "candie- Thanks so much for the message!  My MIL did appologize and it is getting better. But like you said, I don't trust her yet.  I am seeing my OBGYN not a specialist at this time.  My obgyn said that a specialist wasn't necessary yet.  My next appt is on the 22nd to go over my charts and do a blood test.  Granted, I doubt we'll find anything out that soon.  But when I go in I'll be sure to ask her about the monitoring.My boss left the office already today and wants me to stay and answer phones until 5.  Well...without him here... I can't really do anything.  I have nothing to file, clean, nothing!  So I'm sitting here bored for 3 more hours. Woo hoo!",
            "post_id": "3749250",
            "timestamp": "1228765668",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Thanks Candie429  Hopefully soon we both will get BFP.So I am just waiting to see when AF will show since I hd to use provera last time to get AF.   Funny thing is i still have a touch of naucesness and heartburn but no real appettite.  Any ideas anyone?",
            "post_id": "3749401",
            "timestamp": "1228768203",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "candie i feel terrible cannot go tothe docs at the moment i have not got one i am waiting for them to contact me.Thats why i woundered if any one could help mei have a pushing feeling on my bladder and when i go to the toilet it feels like i need o keep going and it dosent hurt but it feels like a pulling feeling so uncomftableim really worried x",
            "post_id": "3749727",
            "timestamp": "1228772241",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Hi everyone yep i'm defo out this month af reared her ugly head i've got a review appt on monday so i'll know more then about what our options are from here good luck to everyone i'm praying for you all",
            "post_id": "3749960",
            "timestamp": "1228775409",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 20 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 7 weeks (u/s tomorrow!)Keyan:  CD1Babymama:  CD1Pyar:  CD1LinaG:  CD5mamatina:  CD7Mrspace24: CD10Stacey:  CD12 (Retrieval today! Transfer 12/11)kmcarino:  CD13Mommyin09:  CD16 (iui today!)Hoping4_2: CD18ad_06: CD22jmh2005:  CD22wishandaprayer: CD25naf38:  CD27arlotheslug:  CD29Candie:  3dpo!Hannah1505:  6dporachjas:  10dpoSexykeme78: 11dpoluvkayln: 12dpoShysana: 13dpotracy4751: 20dpt************************************************Sorry for the late update!  Thanks for all your well wishes :)  The iui went well!!! They increased my progesterone to twice/day & my next appt is 12/21 for a blood test!  Thinking positive thoughts...pyar, babymama:  I'm so sorry about AF! :(Keyan:  I'm sorry about AF, but I know you're okay! :)  When will you call your ob/gyn?  I'm excited for you to move ahead with the lap & get your New Year's BFP! Hang in there :)Candie:  Congrats on jumping to 3dpo! :-)  I didn't realize about your mil!  How could anyone not like you!?mrspace:  I'm sorry about your mil!  That really s u c k s !!!  I'm glad dh supports you & you two sound like a great couple :)Hannah:  Feel better!Shysana:  I hope you're still just too early!  Keeping my fingers X'd :)Stacey:  I can't wait to hear your update!  I hope all's well :)",
            "post_id": "3750024",
            "timestamp": "1228776419",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Hello allI'm very tired today and I'll be very short.Mamushko - I'm very happy for U, I'm preparing to go to sleep, but I wanted to check my mail and to see is there any new info in here and I find you:-) Yea happy that U are all right, so take your time, relax and God bless the new fruit of your love:-))talk 2 U tomorrow.Stacey- Good luck with the retrieval! You have all my thoughts and wishes!  Keeping my fingers crossed for you, sweetie.To all wish U beautiful and happy day, baby dust and God Bless U all.Good night from me,Lina",
            "post_id": "3750134",
            "timestamp": "1228778479",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies!I survived!  It wasn't so bad actually.  Guesito - you were right, I barely felt anything.  Thank goodness for the really good drugs they gave me.  I was out for the most part.  They retrieved 16 eggs...not sure what happened to the other 4.  But I will find out tomorrow how many fertilized so fingers crossed. I am scheduled to go on Thursday to transfer 2 embryos.  I feel ok..just some mild cramping.  Honey and I napped for almost 5 hours this afternoon!Mommyin09 - So glad it went well!  How were dh's counts?  Did he have lots of swimmers??  So excited for you.  Just relax this week.  We will need to try and keep each other sane over this tww!!Luvkayln - I am also very excited for you to try injections!  Trying new things gives that renewed hope you know?  Have they told you what your dose will be?  They started me on 100IUs per day for my first IUI and I produced a lot of eggs!!  They should monitor you pretty closely since this is your first cycle.  I'm sure it will boost your ttc chances into a nice BFP. I'm excited for you!Candie - Glad you got your +OPK!  A lot of us are in the 2ww!  Yippee! I think our puppies will always be puppies no matter how old they are.  We have to take Honey for walks no matter how cold because of her diet :)  She would also be very depressed if we didn't!  Lucky for me DH will be doing almost all of the walking this week!  3 times a day!Mrspace - Wow...that is awful about your MIL.  I just can't imagine.  Your dh sounds very sweet and stong.  Not everyone could stand up to their mother that way.  We are pretty lucky that dh and my parents pretty much stay out of our lives except for occasions etc.  I think our relationships are better that way :)  Good luck to you this cycle!Hannah - You should definitley go to the doc.  It could be an infection and sounds like one to me.  Good luck.Guesito - Good luck tomorrow!!  I look forward to hearing about the heartbeat!!Pyar - Sorry about af but glad you are moving onto a new cycle!Keyan - Glad you are moving onto your LAP!  It is strange to feel happy about af but I have been in that situation many times!  Once you know she is going to show, the worst part is waiting.Shyshana - Good luck.  If af hasn't shown there is still lots of hope!  Are you testing again soon?Well...back to bed for me!  Let's get some Christmas BFPs!!Stacey",
            "post_id": "3750218",
            "timestamp": "1228779951",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "I'm so happy to hear that your retrieval was a success!  16 eggs, that's great!  I'll keep my fingers X'd for tomorrow.  I probably wont' get to read your update since we're heading out of town, but I will be thinking of you!  Best wishes on Thurs, too.  I honestly can't remember what they told me about dh's count.  It was 30-something & motility was 54%, I believe.  They said it was good, so that's all I was looking for!  The rest is pretty foreign to me! :)  Take care!!!",
            "post_id": "3750469",
            "timestamp": "1228783814",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Stacey- I'm so glad to hear everything went well today!  16 eggs is still a lot lady! ;) I can't wait to hear how many get fertilized! That's so exciting! This makes me want to do ivf, but i'm good with the injections! Less expensive, at least! :) Thursday's going to be the day, the day you will concieve your baby ( or babies) ! :) Get ready to be a mommy, my friend!!!!!! :)Mommyin09- That's so exciting your iui went well today!! I know you are just thrilled, and have new hope! Stacey's right, you and her will have to keep each other sane for the next 2 weeks!! I'll help as much as possible! ;) You, Stacey and Candie need to all get your BFP's together! You all are entering your 2ww so close together, it's gonna be exciting when we get some more bfp's in a couple weeks! I'm sad you all are in the 2ww together, and i'm not! :(  Good luck to all of you!!!!mrspace- I was at hobby lobby today and I couldn't help but think of you b/c this lady in the check out lane beside me had a butt load of yarn in her cart!!! :) It brought a big smile to my face, b/c I was thinking about when you said that kid knocked over all your yarn, and it looked like hobby lobby exploded in your living room! LOL That still makes me laugh! :)Gueito- Sending lots of good luck your way for your u/s tomorrow!! :)Hannah- I agree with Stacey. You need to at least get it checked out! Something does sound a little off about it! Hope you start to feel better soon!",
            "post_id": "3750525",
            "timestamp": "1228784567",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Mommyin09 - Have a wonderful getaway!  Relax and enjoy some time away!  Those swimmers sound good!  I never used to pay attention until dh would ask questions when we got the results back.  He was always proud because the RE would always say to him  \"Another great job! ...We can always count on you!\" :)  REs must take a course in boosting the male's egos! So funny.Luvkayln - I'm sorry you are not in the 2ww with us...but you willl be soon enough!!!  IVF is definitely more expensive :(  But you won't need to do IVF.  You have been pregnant on your own and you probably just need a little boost that the injections will give you!  I hope you are right about Thursday :)Ok..back to bed really now.  Every time dh leaves the house I sneak downstairs to do a few things. I don't know how I am going to spend both Thursday and Friday in bed!I'll check in tomorrow!Stacey",
            "post_id": "3750583",
            "timestamp": "1228785417",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Mommyin09- Yes, the count and motility sound perfect!! :) It's funny, b/c I totally pay attention the the count! And dh gets all happy when it's a high number! Men, I swear! :) Stacey's right, I think the RE's do take a male ego boosting class! LOL! I hope you have an awesome getaway! You deserve it! And I promise, I'll keep our list updated for you!! :)Stacey- Thanks, I hope you're right! :) I know, I couldn't do it either- stay in bed for 2 days! But I would, and you will, for the sake of your embryo's! :) And, by the way, I AM right about Thursday! :) I feel it!!!",
            "post_id": "3750705",
            "timestamp": "1228787224",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Hi everyone well i'm cd4 now and tryng to look forward and leave the why me attitude behind me now thank you all for your best wishes i just wanted to ask does anyone have any words of advice for my up coming review my clinic were reluctant to do iui in the first place they kept going on about donor egg but i really want to exhaust every route with my own eggs i really don't know if they will go down the ivf route because originally they said i wasn't a candiate because of my low ovarian reserve on my 3 iui i have produced an average of 3 follicle does anyone know would this be enough for ivf or am i clutching at straws now also i have always been on a short protocaol what does this mean and how does it differ from a long protocol sorry so many questions but i just want to try and arm myself with enough info before i meet with my doc so i can push for hopefully something that will give me the best chance i always feel i don't know enough",
            "post_id": "3751772",
            "timestamp": "1228815599",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Good Morning ladies!Mommyin09: WoooHOO!! Have a great time!!!Stacey: WooHOO for you too!! Before Thursday you can sneak down all you want! but after, it is a no NO!! ;o) It will be worth IT!!Candie: Congrats on 4dpo!!! Our cycles makes us doubt everything, huh?!?! About your LAP, hopefully you won't need it, but I just have a good feeling about it, I really BELEIVE is what I need...I've been thinking about it for the past 2 years, and finally I decided to do it, MY regular OBGYN, says I shouldn't do it, this is one thing that was keeping me from doing it and when I said to him that I was already 30 and that we already were pretty sure I have endometriosis, and that we needed to ck everything inside, place my ovaries were the belong and \"clean\" , that's when he said that he would refer me and now I am own my way...I am not saying it will be my Miracle treatment, but I sure hope soooo, and if not, atleast I know I tried!Luvkayln: Thanks for your support! ..You made me laugh on the note for me! I hope you get your BFP and if not that AF doesn't make you wait on the injections!Pyar: Sorry about AF...can't help much on your questions, the good thing is that one good egg and one good swimmer is all you need to conceive your baby....I guess since IVF is so expensive you would want to have many eggs so that your possibilities of good embryos to transfer are higher. I am sure other girls here will be able to help you out!MrSpace: MILs can be !@#$% sometimes!! LOL....I had an early M/C back in MAY and before that dh, me and my MIL had a good comunication and especially DH and her had a great relationship, well she found out that we had a m/c, her words of comfort were,  \"so you can make a gril pregnant\" (not necessarily me) and dh just looked at her....imagine him all sad because of what happend and this is what his mom says to him, nothing about I am sorry for you loss or anything, like if she didn't appreciate that she lost a grandbaby....after this incident, me and her are about the same, but I feel bad for DH cause he lost the support of his mom, I mean, I told him to talk to her about it, and he said to me that it wasn't worth it, that she wouldn't be able to REALLY understand why it was so upsetting to us what she said, that she would just feel bad cause he would tell her and not because she understood.As of me, well I have to call my GYN's office to see when I can come in...I beleive after AF is over, so probably next week!.... I got my blood work yesterday and everything TO ME, looks like is fine, let's hope the doc thinks the same!",
            "post_id": "3751987",
            "timestamp": "1228826811",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 20 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 7 weeks (u/s today!)Keyan:  CD2Babymama:  CD2Pyar:  CD4LinaG:  CD6mamatina:  CD8Mrspace24: CD11Stacey:  CD13 ( Transfer 12/11!)kmcarino:  CD14Hoping4_2: CD19ad_06: CD23jmh2005:  CD23wishandaprayer: CD26naf38:  CD28arlotheslug:  CD230Mommyin09-1dpiui!Candie:  4dpo!Hannah1505:  7dporachjas:  11dpoSexykeme78: 12dpoluvkayln: 13dpoShysana: 14dpotracy4751: 21dpt************************************************Good morning ladies! I'm taking care of our list for Mommyin09 while she's away for a few days! :)Keyan- Thanks! :) I'm patiently waiting for af to come! It's due tomorrow, but i'm ready to get the show on the road!Pyar- I'm so sorry af showed! :(  I'm with Keyan, I'm not sure if I can help either! You said you produced 3 follicles for your iui's? What meds did they have you on? They can always increase whatever injections they give you for ivf, so that you do produce more follicles. I'm sorry, I'm not much help! I hope it all works out for you!Stacey- Oops, I totally forgot to tell you what dose they're putting me on :) My RE said 75-100 iu per day for 7-10 days, depending on how well I respond to the meds. I'll know for sure on CD 3 when I go for my u/s to make sure that cyst is gone from this cycle. The nurse thinks 75 iu to start out with. They're the ones that do everything anyways, so I'm going with her opinion!! :)Guesito- Hoping you see a strong h/b today!! Update us asap! :)Shysana- I hope af stays away for you! :)",
            "post_id": "3752034",
            "timestamp": "1228828513",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Good morning everyone!mommyin09 - I am so happy that your IUI went so well.  Now you can relax and enjoy your anniversary trip with DH.  Have fun!  We'll miss you.luvkayln - I like your positive thinking and I too hope that we see lots of BFP's in time for Christmas.  Looks like Stacey and mommyin09 have great chances!  Thanks for keeping the list updated for us.  :)Stacey - Wow, 16 eggs!  I don't know much about IVF, but that sounds wonderful.  Hope you are doing well and enjoying your time with Honey.  Good luck with the transfer on Thursday.  I love luvkayln's message to you saying that Thursday is the day you'll become a mommy.  She always puts things so perfectly - and I agree!  :)  I have to admit, I'm very jealous that your parents keep their opinions to themselves.  Mine are quite the opposite!  DH and I have always been close with them and we're able to do a lot of things together and have fun, which is good, but they have an opinion about everything and they're not afraid to share it!  It's been really bad since we bought the new house and my dad has been helping DH work on it.  It just feels like a constant struggle with us always having to stay on our toes and assert ourselves to make sure that he doesn't just start doing what he wants!  Ugh!  We love them, and we appreciate that we have parents who will do anything to help us, but we need to get some boundaries!  Sorry, didn't mean to go on like that.  Thanks for listening.  :)Keyan - I know what you mean, i've mentioned the lap to my OBGYN before too and she feels it is pointless.  My HSG looked good, so I agree with her there that obviously nothing major is wrong, but I still have a lot of endo symptoms and that's always been in the back of my mind.  I'm really excited for you that you get to try it and I'm sure it will help.  Like you said, it's definitely worth a try.  That is so terrible about your MIL.  I can't believe how insensitive people can be.  So far, we've kept our ttc from our families, but we're really dreading the day when we have to tell them.  I'm sure it's been tough on your DH to lose his mom's support like that.  Hopefully she'll soon realize that she needs to step up and be there for you both.myspace - I'm glad that things are getting better with your MIL, but I know it's hard to trust again when you've been so hurt.  I think most OBGYN's don't do the intense monitoring that a specialist will, but if yours is meeting with you to look at your charts and do bloodwork, then that's great!  If it would make you feel better, you could always ask about having an u/s, but if your charts look good and you're getting +OPK's, then you should be OK.ShySana - I'm glad that AF is still staying away!  Those symptoms could be good things.  Fingers crossed!  :)Hannah - I had a lot of bladder problems in the past and it sounds like you could definitely have an infection.  They can make you feel awful.  You should definitely see a doctor because you don't want to let it go untreated.  In the meantime, try to drink a lot of fluids and even some cranberry juice if you can.  Take care.pyar - So sorry about AF.  I know how it feels.  It's OK, you're allowed to feel sorry for yourself sometimes.  I guess all we can do is pick ourselves back up and try to stay positive.  I'm not sure if I have any advice to give, but I'm sure the others will.  I would definitely want to exhaust all of my options first before moving into the donor world.  I hope your doctor has some answers for you.  ((hugs))",
            "post_id": "3752404",
            "timestamp": "1228835383",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Good morning everyone!luvkayln- Yes Hobby Lobby is my favorite store. And every time I go there, DH gets mad because I have a shopping cart FULL of yarn and stuff.  It's great though.  I am slowing the crocheting down though because I'm starting to get busy.  I work 40 hrs a week plus I have an online store (cafepress).  My store isn't doing so hot right now (thank you, economy) so I'm putting a lot of time and effort into that right now. I'll pick up the blankets later this week probably.  I agree with Keyan, I hope that AF doesn't show and instead, you get a BFP for Christmas!  That would be wonderful!  Lord knows you deserve it girlie!Mommyin09- Once again, you amaze me with how well you keep up with everyone!  It's amazing having someone like you who really takes an interest.  And that goes to everyone else as well...thanks for being so supportive of everyone. It's a beautiful thing!Guesito- I can't wait to hear how the u/s went today!  You are one blessed momma!Candie- Yes, MIL's can be terrible.  Mine sure can!  Honestly, I think mine is bi-polar. She loves me one day, and hates me the next.  And I know it's a terrible thing to say but I just don't care in the slightest anymore. I don't care if she's happy or anything. It's not worth it.  I spent years worrying and fretting and stressing over her.  No more.  I have other things to worry about!  And I'm trying really hard to live a more \"stress-free\" kind of life.  It's difficult since I'm such a huge worry-wart but oh well. I'm doing my best to stay positive and stree-free.As for me, I'm doing pretty well this morning.  I don't feel good at all, but I'm happy.  Not sure why. lol.   I had a terrible headache last night.  I think I'm trying to catch a head cold.  I had a slight fever of 99.8 last night and then my temp this morning was down to 96.0!  I don't get it.  I should also explain that I have a low normal temp.  My normal temp runs around 96.7-97.0 .   Anyway.  DH was amazing ONCE AGAIN!  We were laying in bed trying to sleep and I was crying because my head hurt so bad. So he rolled over to me and rubbed my head/neck and ran his fingers through my hair for at least an hour, til I fell asleep finally.  He's amazing.  I'm the luckiest woman alive.AF has officially stopped!  Happy Dance Time!  But I'm still having a lot of pain in my lower back and hips.  I don't know why.  My appetite is MAJORLY decreased also. Which probably isn't a bad thing since I need to lose like 50lbs!  Not really.  The doctor said that I should lose 15-20lbs to be healthier.  Nothing too major. I just hate my weight right now.  2 years ago I weighed 135lbs.  Now I'm at 215lbs.  It *****.  But I carry it well (the doctor didn't even believe the scale at first).  And I'm working on it.  I'm eating healthier and trying to exercise more. Having very little energy definately doesn't help.Anyway, I hope everyone is doing great today!",
            "post_id": "3752495",
            "timestamp": "1228836851",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Hey Girls! I hope yall don't mind if i join in! luvkayln was telling me what a great support group yall are!  We just went to the dr for the first time in two months (after a two month break after the 2nd mc ugh!) and AF should be here tomorrow, and we'll continue with follistim and IUI's, and hopefuly be blessed to get pregnant again, and hopefully STAY pregnant too!  we will be getting all our genetic and clotting testing done next week! yikes! GOOD LUCK to all of you and I'm praying for everyone a great 2009, with lots of babies being born healthy!!!",
            "post_id": "3752605",
            "timestamp": "1228838573",
            "user_id": "user_374593",
            "user_link": "/personal_pages/user/374593",
            "votes": "0"
        },
        {
            "answer": "thanks for your advice,i have spoke to the nurse its not an infection its cystites they think! i have mediceneshe also said some pl get it when they just get pregnant and when i collected my medicene the chemist had it thats how she found out she was preg soooooo.....but im not getting my hopes upi wish u all baby dust x",
            "post_id": "3753402",
            "timestamp": "1228849833",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Will you change me to 9dpo. Also, thanks for the advice on figuring out my dpo!! I have no symptoms at all!! Will go for blood work MondayAllWhat are typical symptoms you get from prog suppositories besides keeping your AF away?",
            "post_id": "3753430",
            "timestamp": "1228850188",
            "user_id": "user_671994",
            "user_link": "/personal_pages/user/671994",
            "votes": "0"
        },
        {
            "answer": "bny807 - Welcome friend!  Luvkayln is right, this thread is wonderful and everyone is very caring and supportive.  I'm so happy to hear you are back in the game again!  Like I've told you before, I hope all of your testing goes well, but if not, then I hope they can find a solution for you so that you never have to go through that pain again.  Good luck this cycle!  I hope your prediction for 2009 comes true for us all!  :)",
            "post_id": "3753520",
            "timestamp": "1228851627",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Thanks so much Candie!   We were starting this cycle at first being told that we wouldnt' be able to do the testing this cycle, but turns out the timing is working out with the holidays etc afterall.. so i'm SOO relieved we can not only start up again, but get the testing again! of course we are going out of town on thursday, so i have to travel with my meds again.. and hope the hotels have refrigerators!   How are you?",
            "post_id": "3753533",
            "timestamp": "1228851873",
            "user_id": "user_374593",
            "user_link": "/personal_pages/user/374593",
            "votes": "0"
        },
        {
            "answer": "Just came back from my ob gyn \"Dr saw FLUTTER H/B !  Im so happy!! Thank you jesus! Im only 6 weeks today. Follow up U/S on Friday to confirm flutter H/B",
            "post_id": "3753634",
            "timestamp": "1228853293",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "DH's SA results... Count =51 million, they want it greater than 20.  Motility =65%, they want it greater than 50%.... then something about normal form? they just said his was \"little on the lower side.\" What does this mean?",
            "post_id": "3753641",
            "timestamp": "1228853360",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Well day 14 and AF  is due today and the last time I tested was yesterday and was BFN.  I hv no cramps like I use to get before AF all I have is heartburn and very sleepy am gonna try an wait till Fri to test have work party tht day so shld keep my mind occupied.  Or I may call my OBGYN an see if they will do a blood test.   I am hoping an praying we get BFP!",
            "post_id": "3753695",
            "timestamp": "1228854017",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "Hi Friends!Well I had a quiet day today.  Still feeling a little crampy and bloated from the retrieval yesterday.  My RE always calls my home number so I was waiting for an update on our 16 eggs all day, and then I checked my cell phone and of course I had a message.  It said that out of the 8 eggs retreived, 6 had fertilized....huh???  What happened to the other 8 eggs??  So I called back and left a message and have not heard back.  I think the problem is we had 1/2 our eggs being fertilized through ICSI (inject a sperm into egg) and the other 1/2 \"naturally\".  So I only got half the report!  Either way we definitely have 6 fertilized eggs and they are doing well! :)Luvkayln - Thanks for taking over for Mommyin09!  I think the nurse is right.  If you can start at 75ius they can always increase the dosage mid way. I think it is better to increase your dose vs decrease mid way.  75 was my perfect dosage - 100 was too much and 50 was too little :)  Did af show yet??Candie - Wow you are in a predicament with your parents.  It's great for them to help but at the same time, when does the helping start to be them taking control?  It's a sensitive relationship.  I debate it with some of my friends who have parents who help them out with everything - finances, babysitting, renovations etc.  I think the parents almost feel it is their right to have more of a say because they are contributing so much.  Dh and I get no help from any of our parents.  Sometimes I think, it would be great to have my dad help us with our house, or have my mom come over to cook :)  I guess a balance is the perfect place and it is hard to get there.Mrspace - Sorry you are not feeling well but glad af is over!  Good luck with the weight loss!  It sounds like you are making progress and it will also help you get that nice BFP!!  If I cooked half of the yummy treats you bake I would be 500lbs!!bny807 - Welcome!  So sorry about the m/cs :(  Were both pregnancies from IUI?  It's great that the scheduling works out and you can get started this cycle!  And Luvkayln was right, the ladies here are wonderful!  Not sure how I would be handling this journey without them!Guesito - Yippee!  That is awesome news!  Good luck with your next u/s!!  I'm sure it will reconfirm everything!Shyshana - This could be your bfp!  I think waiting until Friday is a good idea...if you have the control not to test :)  A blood test would definitely be the most accurate.  Good luck!!",
            "post_id": "3754263",
            "timestamp": "1228861273",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "luvkayln- You are a gem for taking over for mommyin09 while she's away.  Kudos for you.  I have half an hour of work left today and it's dragging. I've finished all of my work and even did this weekends cleaning!  But the boss man wants me to stay here for the half hour so I'm stuck here. Woo hoo.  I hope you're having a great day!stacey- Congrats on the 6 eggs being fertilized!  Hopefully you'll hear back about the other half soon!  I've got my fingers crossed for you!  I am doing my best with the weight loss, though it's slow coming.  If I could just take off the tummy weight I'd be happy.  So...more sit ups it is!! Dh has to work the rest of the week, which means lots of late nights for me.  He works until almost midnight every night.  I hate it.  Oh well.  The money is good.Again, I hope that everyone had a really great day!",
            "post_id": "3754333",
            "timestamp": "1228862146",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Stacey- Wow! Congrats on the 6 eggs getting fertilized, that's so exciting!! Just think, right now you have 6 little versions of you & dh forming! :) Well, af hasn't shown for me yet! Granted, it's not due till tomorrow! LOL I'm just so ready to start, so I can get on with my next cycle! I wake up feeling like af is definately coming, that's happened the past 3 days. Plus my temps have been down real low the past 3 days.  Hopefully it makes it's appearane tomorrow! I need an af cheer! :) That's cool 75 iu's was the perfect dose for you too! I'm sure that's what they'll go with. He said he's starting me out really low, because he thinks i'll respond very well to the meds. Let's hope he's right! :) How many days did you stim for? He said anywhere from 7-10 days... I'm glad you are feeling better from your retrieval! I'm sooo excited for Thursday! I just can't tell you enough! :)Guesito- I sent you a message, but congrats again on seeing the h/b!! :) I can't wait till your next u/s!bny807- Hey lady! :) Glad you found us!!! Mommyin09 is on vacation, so i'm helping her out for a few days while she's away and keeping the list caught up. I'll add you tomorrow! :) Praying af shows for both of us tomorrow!!!!mrspace- Good luck on the weight loss! What a crappy time to start trying to lose weight! I always eat so much around the holiday's! :) But you are a determined, smart women! I know you can do it! :) Sorry you have to be stuck at work! I left about an hour ago, and now am just waiting for dh to get home... tick,tock... :) I hope you start to feel better soon!wishandaprayer- Yes, I will definately change your status tomorrow! :) You're welcome for helping you figure it all out! That's what friends are for! ;)Candie- Have you thought about going back on meds for a while? What about trying injections next cycle if you don't get your +ve this time around. It's just a thought. I know you feel better being off the meds, I do too. But i'm anxious, and ready for these injections. I've read so many success stories with them, I just hope that will be me soon! :) Bny807 and I would love another follistim buddy! :)hannah- Have you seen a doctor yet? Are you starting to feel any better! I hope so!!!rachjas- Your dh's SA sounds normal. It's normal for men to have some abnormal sperm. My dh had a SA done before we even got pregnant with Kayln, and his was like 85% normal, 15% abnormal or dead. If they're saying his is a little on the lower side, they're probably just saying his sperm forms are  just below the average \"normal\" results. I wouldn't worry about it. His motility is good, and as long as he's got some normal formed sperm that are rapidly moving, that's all you need to get pregnant! :)Mommyin09- I miss you already! :)",
            "post_id": "3754464",
            "timestamp": "1228863916",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "sorry to bore you all but just heard it prob not cystitus its doing my head in now last thing i need is worry i just dont no im going out my mind x",
            "post_id": "3754469",
            "timestamp": "1228863945",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Luvkayln: You are doing an awesome Job!!! I know mommyin09 will be proud! ;o)....I hope AF stays away for the right reasons....but I know you are looking foward for the injectibles!Candie: I also had a \"clean\" HSG test, the truth is that in my case, my OBGYN could have done an \"exploratory\" LAP and of course this would have been of no help, so he told me the \"truth\" (after 2 years) and said that it was POINTLESS FOR HIM TO DO IT, that if I want to have a LAP to help me w/ fertility, to go to another doc that has the expertise, to intervine, not only explore, we are expecting endo problems and there is a suspicion that my Ovaries aren't in the right place do to the endo.....Please don't think I am trying to push you in to it, I am just sharing my story.....I did get a BFP on my own, although it didn't work out, but I did. But still, when I insisted on the LAP and he said the \"thruth\" I felt kind of cheated, I thought he didn't want to do it, cause he really thought it was pointless, I guess we will find out soon!Byn807: Welcome! I hope you get a sticky BFP soon!!Stacey: CONGRATS on the 6 embryos! Can't wait for your update tomorrow! Remember to stay in bed!! ;o) I hope you get the info about the other 8 eggs.Shysana: Hope you get that BFP!! AF Stay away!Mommyin09: I hope you are having a great day! Happy Anniversay!! :o)",
            "post_id": "3756418",
            "timestamp": "1228912497",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 20 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 9 weeksArmyprincess: BFP - 7 weeksGuesito:  BFP 7 weeks (saw h/b! Next appt Friday!)Bny807- af due today!Keyan:  CD3Babymama:  CD3Pyar:  CD5LinaG:  CD7mamatina:  CD9Mrspace24: CD12Stacey:  CD14 ( Transfer tomorrow! Woo hoo! )kmcarino:  CD15Hoping4_2: CD20ad_06: CD24jmh2005:  CD24naf38:  CD29arlotheslug:  CD31Mommyin09-1-2 dpo?Candie:  5dpo!Hannah1505:  8dpowishandaprayer- 10dporachjas:  12dpoSexykeme78: 13dpoluvkayln: 14dpoShysana: 15dpotracy4751: 22dpt************************************************Keyan- Thanks! ;) I like being able to help Mommyin09 out! I know she appreciates it! :) I know you all, and of course me, would rather see a bfp instead of af show for me this cycle. But i'm not pregnant, so come on af! Let's get this over with! Injectables are calling my name! :)Stacey- Good luck tomorrow!! I can't wait!!!!Shysana- Has af showed yet???! I hope not! Good luck! :)I'll check in later girls. Gotta get ready for work! :)",
            "post_id": "3756516",
            "timestamp": "1228915228",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "bny - I am so happy for you that the timing is working out for you this cycle.  Have a safe trip, good luck with the injections, and I hope you are blessed with another BFP soon!!Guesito - Congrats on hearing the heartbeat.  You must be so relieved.  Good luck with the u/s on Friday.  I'm sure you can't wait to see your little one.Rachjas - What that sounds like to me is that your DH's morphology % was on the low side.  My DH's morphology wasn't off the charts either, but like luvkayln said, as long as his count is OK and he's got a good motility %, then you should be just fine.  There are still millions of healthy sperm there and it only takes one, right?  :)Shysana - Hopefully AF is still staying away and that BFN soon turns into a BFP!  :)Stacey - I think you're right, they must have only given you a report on half of the eggs.  Either way though, if 6 are doing well, than that's great!  I hope all goes well for you tomorrow.  Thanks for your thoughts on my parents.  That means a lot to me.  My mom has been great, it's really just my dad.  I think you're right, he is contributing, so he feels he should have a say.  It just really hurts our feelings because he says he wants to help, but then he'll make comments about being tired and having his own stuff to do.  Plus, we heard through the grapevine that he told one of our friends that it was his kitchen too because he's done so much work on it.  That really hurt DH since he's done a lot of work too.  It just seems like our relationship with them may never be the same and it's really sad.  I've tried to say as much as I can to stick up for us, but I feel like I have to be careful because my dad really holds grudges and I'm honestly afraid that he may stop speaking to us.  Sorry, again, I'm just very upset about all this.luvkayln - Well, if you are convinced that AF is on her way, then I'm with you and I hope she shows up soon so that you can move onto the injectibles.  Thanks for your advice on the meds.  I have been taking the FertilAid and wanted to give that a chance for a few months, but we have talked about going back to Femara after the new year.  It's certainly worth not feeling good if it gets us our BFP!Keyan - I can understand why you felt cheated.  I would have felt the same way.  You have to trust that your doctor is doing what is best for you, and then to find out that maybe he wasn't.  I'm glad that you've moved onto a specialist.  That's where I'm at too.  The more I've thought about it, I certainly wouldn't let my doctor do a lap since that's not her expertise.  We have a lot of insurance hoops to jump through, and we'd have to travel 2 hours to the nearest RE, so the plan is to get to that point by next summer if we need to.  Like I told luvkayln, I think we're going to give the Femara another try first.  Plus, I just started Fish Oil supplements about 2 months ago.  Have you heard about them being a natural rememdy for endo by reducing the inflammation associated with it and making your uterus more implantation-friendly?Have a good day everyone!  :)",
            "post_id": "3756890",
            "timestamp": "1228922564",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "sitting here waiting for maternal support to show up....was suppose to have been here at 10am...then called last night and rescheduled for between 11-11:30 she probably wont show up til after 12....ugh i hate it when professional people cant keep the appointments they make...drives me up the walli HATE hormones....just so you are all aware of that fact...they are making me feel awful, and they are making me hate dh....everything from the way he walks and talks to the way he thinks and acts like he knows everything....ugh i do love him and i really dont like feeling this way, but if he asks why i am irritated one more time i am liable to let him have it and it wont be pretty....lolanyhow there is my vent for the day...lmao",
            "post_id": "3757205",
            "timestamp": "1228927531",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "Well Ladies 15dpo and still no AF, but none of the symptoms i was having before tht I was hoping were pregnancy symptoms are gone also.  I have not bought any HPT tests am gonna wait till Fri to buy one and test and if BFN then i am going to call my Dr and hv a blood test done.   The only good thing tht has happened is DH finally found a job its a temp job but its a job so tht has me in a great mood,    Hope an wish all the ladies in tww  BFP!!!!",
            "post_id": "3757345",
            "timestamp": "1228929253",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        },
        {
            "answer": "Hi Friends,Well I spoke to a nurse this morning and they clarified that yes, they only reported on half of the 16 eggs.  So out of the 8 eggs that had the ICSI process, 6 fertilized.  Out of the other 8 eggs that were \"natural\", 3 fertilized.  So in total we have 9.  That sounds ok to me!  We only need 2 for tomorrow (transfer) and will freeze the remaining 7.  So strange that we have 9 potential children sitting in a lab!  I told dh that we are going to need a bigger house :)Luvkayln - When I was on the injections, I would normally take them from day 3 to day 11 or 12.  Then I would do an HCG shot, and then IUI on the following 2 days.  Are you doing IUIs?  Once your eggs reach 20-22mm they will probably have you do the HCG shot.  That is what they did for me.  If AF is going to show for you I wish she would show already so that you can get on with it!!!Candie - Don't apologize.  Parent relationships can be so tricky.  Your dad sounds like he is doing something my parents would do!!!  They offer to do something and then they complain about how it is such a hardship on them.  My mother was very good at this when my sister and I were growing up.  For some reason she would like us to feel guilty whenever she did something nice for us.  \"I paid for you to go to school, and had no money for myself....\"  That kind of thing.  I am just going to try and NOT be like that for my children!!!  The only thing that kind of worked for me was to not buy into it.  If my mom says stuff like that I try to ignore her (and then vent with my sister afterwards!).  It's not easy to do though because it can be very hurtful.Mommyin09 - You are missed!!!  Hope you are having a wonderful getaway!",
            "post_id": "3757402",
            "timestamp": "1228930319",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Im so happy for you! Sounds great! Whay aren't you transfering 3? I did 3 and only 1 implamted. My nurse said it was a great idea to do 3... Better chance.. Just a suggestion",
            "post_id": "3757604",
            "timestamp": "1228933390",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Stacey- I agree with Guesito. Why don't you do 3? It does give you a better chance! :) I think it's cute you told dh you need a bigger house! :) It is awesome to think that you have 9 little you and dh's forming in a lab right now! We'll probably take the shots as long as you did, or close to it. RE says 7-10 days. We're definately doing hcg and iui with it. If we're going to do it, we're gonna do it right! :) Good luck tomorrow sweetie!!Candie- I'm so sorry about your parents! Like Stacey said, try not to buy into it. Maybe they don't realize how hurtful they're being to you and dh. I couldn't imagine being so scared to say something to them and you being worried that they won't come around anymore!  That must be so hard! :( I totally forgot about you taking the fertilaid! I'm glad you and dh have given it some thought for doing the meds in the new year, if you need it that is! :)  You can always do femara and injections together, and that will greatly increase your chances too! Just a thought. I hope you don't need any of it though, and get your BFP before the new year! :)Shysana- That sounds like a great plan! :) I hope you get a good suprise on Friday! Good luck!bny807- Has af showed yet??? Still mia here... I've been cramping all day, and I keep running to the bathroom every hour b/c I feel like it's here, but noooo! I'm sure it will be here soon for both of us!Thanks for all the af cheers girls! I hope she hears you!! :)",
            "post_id": "3757958",
            "timestamp": "1228938266",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Stacey-I say go for 3!! Good luck to youShysana-I hope you get the BFP Friday. I am so hopeful for youGuesito-great news on your little flutter!Luvkayln-you may have yourself a new job!! Thanks for posting for usNo news here for me-just waiting to get started on next injectible cycle. I am 10dpo and have had 3 BFN so far-once each day since Monday. Get blood work done Friday-and still using suppos progest-yuck!",
            "post_id": "3758244",
            "timestamp": "1228942797",
            "user_id": "user_671994",
            "user_link": "/personal_pages/user/671994",
            "votes": "0"
        },
        {
            "answer": "Hi girls ~ I'm on a hiatis for a cycle while TTC, due to my RE's office being on break for the Christmas/New Year season.  I didn't make the break-off so instead of changing my cycle to IUI (another after 12++..??..don't think I'll waste the $$).  So I decided yesterday @US/BW appt to just take a break and then start again on day 2 of my next cycle.  Tra was booted off again for a long time and since they weren't taking new adds for a couple of weeks, I was interested in the site and the support you girls offer eachother.  Tra's Beta came back negative.  She will be starting another cycle. Might as well drop Tra off since the site is blocking her completely.HOPING for a BFP for all.",
            "post_id": "3758285",
            "timestamp": "1228943599",
            "user_id": "user_707576",
            "user_link": "/personal_pages/user/707576",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies!  We are going to stick with 2 mainly because we really really don't want 3 babies. We could handle 2...but 3 would be too much!  I know it is unlikely that they will all implant, but the possibility is there.  My RE suggested 2 also since we don't have any known issues...basically unexplained infertility.  We could have an issue with fertilization but not implantation you know?  If this does not work then we can discuss transferring 3 the next time. Thanks though! :)Luvkayln - Your plan sounds awesome!  Your chances will increase a lot with everything!Wishandprayer - Good luck!  You are testing early so try not to get discouraged.  The blood test will tell the real story!Shyshana - Good plan to test on Friday!",
            "post_id": "3758421",
            "timestamp": "1228945506",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Hello my friends,LuvKayln - Thanks for keeping the list updated for us. You are doing an awesome Job! I'm a proud of U and I know mommyin09 will be proud too! God Bless U with a babyGuesito - Congratulations on hearing the heartbeat. You must be so relieved... Now U should be positive and happy u are blessed!!! Good luck with the u/s on Friday.Rachjas - Your DH has enough sperm to fertilize at least 1 egg. Don't worry at all, when my DH took semen results I thought that there isn't a chance for us only 25% of 100% sperms were OK, so we were crushed, we were crying and feeling that we will not have a fruit of our love! Next day we transfered them in millions there were 15 or 20 million from 25% and our Doc. said to not worry at all because U need only 1 sperm to fertilize 1 egg:-)Shysana - Hopefully AF is still staying away from U, Wish U +BF from my heart  :) God Bless U with a babyStacey - I'm so hapy for UUUUUUUUUUUUU:-) God bless U!! Definitely U will need bigger house. I like your sentence a lot \"So strange that we have 9 potential children sitting in a lab!\" :-)Joyce dear please do something that U really want to do, during the time that U are waiting maternal support. I don't know why are U needing them for, is that any procedure in your country? God bless, take care, be positive u are prego!!!Keyan- when did U do your HSG? U know that 6 months after the HSG chances to get pregnant are very big! God Bless U with a baby!Candy - take care of your self! God Bless U with a babyI'm doing fine. I'm happy Christmas is coming, yesterday started cleaning the house, we will have a lot of guests this year. About TTC this month we decided to try without any help from Doc, (like measuring the follicles as i did previously) and we will see what will happen. Maybe IUI will be our next step in year 2009!I have question - Do any of U take any medicine like vitamin E, multivitamins and minerals, folic acid and aspirin before planning to became pregnant?I'm going to watch movie on TV, I'm home alone, my DH is at work third shift this week and going to sleep soon.Have a good day and evening everyone!  :)",
            "post_id": "3758516",
            "timestamp": "1228946870",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "hey girls i hope you are all oki was taken to hospital tonight with ll the pain i have been having i started bleeding really badim not due for ages so they took me to hospitali just wanna no whats wron im so downthey gave me pain killers im sick of the nhs!!!xxxxbaby dustxxxxx",
            "post_id": "3758601",
            "timestamp": "1228948835",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Hey everyone!I feel like I haven't been on here in forever and it's only been a day.  Wow, I'm pathetic.  I stayed home sick today. I had a terrible headache last night and I've been having some intense pain in my sides.  Well, down by my hips on both sides.  Real sharp pains. At first I thought it could be appendicitis but it's on both sides and its pretty low down by my hip bones.  So I stayed home to sleep and try to feel better.I talked to my momma and she said it could be ovulation pain if I have two follicles.  Who knows!  I should ovulate soon, I think.  My temps have been REALLY low for the last two day.  Check them out on my tracker...seriously, I could use some help deciphering what it all means.  We are just very ready to O and then find out!  My dr appt is on the 22nd.  I doubt we'll find anything out then, but I'll be watching!!  Hard to belive that the 2ww could be happening to me here soon!! We'll see.",
            "post_id": "3758932",
            "timestamp": "1228954308",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "mrspace- What you're feeling is definately your follies maturing! Each month, your ovaries \"race\" each other to make an egg. What your feeling is them trying to mature, and the clomid really puts your ovaries into overdrive so they are working extra hard to produce 1+ mature follies! So your mom is right, and it sounds like you're getting ready to ovulate very soon! I'll check out your chart now! :)",
            "post_id": "3759255",
            "timestamp": "1228959672",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Ok, so i'm a pro at interpeting everyone else's chart, just not my own! :) At least not this cycle anyways! I thought af was due today for me, you'd think it would be if I ovulated on CD 9, and today is 14 dpo. Will you all please look at my chart and tell me if you think I really ovulated on CD 9? I feel like I did, I mean I didn't have any O pain after that, but my tems s u c k this month! FF also said I ovulated on CD 9, UNTIL i put in my temps from yesterday and today. Now it's saying I haven't ovulated yet! Last cycle, I ovulated on CD 11 for sure b/c an u/s proved it. And I ended up having a 21 day LP which I always have a 14 day LP on clomid, just not last month or obviously this one! And i'm convinced it's got something to do with the provera the past 2 cycles to jump start a period that's been messing up my cycles. What do you all think? Should I not consider af  due yet since it didn't come until 21 dpo last cycle? Don't think i'm pregnant, b/c i'm not! To top things off, I've been cramping and been feeling like af is going to show at any minute for the past few days, really ever since my temps dropped 4 days ago, and still no af! Where is it?!",
            "post_id": "3759600",
            "timestamp": "1228965742",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Ok sorry, but I just thought of something... What if the \"ovulation pain\" i felt on CD 9 wasn't really me ovulating, but was my cyst bursting?! And I really haven't ovulated yet, and am either  not going to b/c of the cyst or am going to really late? I mean, the only thing really making me think that is b/c my temps never drop this far in advance before my period. They always drop the day of my period... So, what if they're dropping down lower these past few days b/c i'm getting ready to ovulate? Ok, now i'm just stressed and this was supposed to be my stress free cycle! LOL I know i'm just more anxious about it, b/c i have this follistim just begging me to use it! Wouldn't that s u c k if I thought I was at the end of my 2ww and really haven't even begun it! How ironic would that be!Now watch me start my period tomorrow.... hehe! :) Ok, i'm done talking about me now! How is everyone else doing? :)",
            "post_id": "3759631",
            "timestamp": "1228966223",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln- Hey girl. If I knew ANYTHING about reading charts and such... I would help you!  But as it is, I know nothing lol.  I am hoping that it's not AF for you and that you get a BFP instead!  That would be amazing!!!  I'm hoping that I O here soon. I am really hating the back pain.  I'm already anxious for the 2ww!  And I'm not even there yet.  Wow, I'm pathetic.",
            "post_id": "3759896",
            "timestamp": "1228970582",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Hey everyone...I just wanted to drop in and say that I am doing okay.  My inital HCG bloodwork after the D and C dropped from 400,00 to 10, 000 and this past week it dropped again to 4,000.  I go back tomorrow and hopefully it will have dropped again.  It's funny how you spend all this time wanting your HCG to rise and now all I want is it to go back to 0....very ironic.  Everyday is hard for me and I have trouble sleeping and getting out of bed in the morning, but as the forum says...we are woman of strength and we sure are to endure all that we endure.  we just have to keep going to get our dream.",
            "post_id": "3760091",
            "timestamp": "1228975584",
            "user_id": "user_507564",
            "user_link": "/personal_pages/user/507564",
            "votes": "0"
        },
        {
            "answer": "Michelleinhawaii :  I hope tomorrow you receive the news you are waiting for. I told Mommyin09 how aproprieate and true is the name of our thread, and as you said we keep on going becuase we have faith that it will happen for us, the in between is what shakes us a little, but just to know that all will be worth it, makes us our strength grow everyday!MrSapace:  I hope your back pain goes away and that you O soon!Luvkayln:   How are you feeling today?! can't wait for your update...what you say about your O makes sense, just keep up the BDing and you will be ok....I know you would prefer to move on, but who knows, a late O might work and give you a Christmas present!Hannah:   how are you feeling? Did the bleeding stop?! you are quite early in the 2ww, could it be because of implantation...what about the infection? Hope you feel better soon.Stacey: I am thinking and praying those little beans stick and you get your christmas present! As of today you are pregnant, think pregnant all the time and stay in bed! ;o)LinaG:  Thank you! you are very sweet! God bless you w/ a baby too! My HSG was 2 years ago....but I know many get their BFP right after a LAP too, so I am hoping to be one of them in January!Wishandprayer:  You are still early! Hope you get good news tomorrow! Good luck!Candie:  Thank you for the Oil Supplements...I will ck them out (I didn't know!!). How are you feeling, you are almost 1/2 the way! Ohh by the way, the doc that will perform my LAP is a GYN, he is a regular OBGYN, just doesn't practice obstetricts, I think he does high risk pregnancy for the first trimester, and he specializes in pelvic surgery and endometriosis, I know an RE has the expertise too, but my insurance covers this GYN and not my RE.Mommyin09:   Can't wait to hear news from you!!Arlotheslug:  Hope you feel better soon! I miss you!",
            "post_id": "3760537",
            "timestamp": "1229005817",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 21 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 10 weeksArmyprincess: BFP - 8 weeksGuesito:  BFP 7 weeks (saw h/b! Next appt Friday!)Bny807- waiting on af!Keyan:  CD4Babymama:  CD4Pyar:  CD6LinaG:  CD8mamatina:  CD10Mrspace24: CD13Stacey:  CD15 ( Transfer today! Woo hoo! )kmcarino:  CD16Hoping4_2: CD21ad_06: CD25jmh2005:  CD25naf38:  CD30arlotheslug:  CD32Mommyin09-3 dpiuiCandie:  6dpo!Hannah1505:  9dpowishandaprayer- 11dporachjas:  13dpoSexykeme78: 143dpoluvkayln: 15dpoShysana: 16dpo************************************************Stacey- Best wishes for your transfer today!! This is it sweetie! I honestly feel it! :)Michelle- That's great your numbers are going down so quickly!!! I know this is all so hard for you, but I know you will be blessed again in the  new year! ((Hugs))mrspace- It's so funny, b/c anyone else that needs help with their charts, i'm their gal! :) I know i'm not preg, took a test last night and it was -ve. Not upset, just want af to get here already! How are you? I hope you are feeling better today and are able to go back to work!",
            "post_id": "3760558",
            "timestamp": "1229006613",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln- I agree with Keyan!  Hopefully it'll all work in your favor and you'll get a BFP for Christmas.  I know that's what we all want.  You deserve one, sweetie!  My fingers are crossed for you!  My temp spiked today, but I think it's from being sick.  But who knows.  I'll take my OPK this afternoon, so we'll see.michelle- I am so sorry for your loss.  I know that times like this can be very very hard and the strength can be hard to find.  But stay strong, honey.  Because it will get better.  I've lost 5 now, and I understand.  You are a strong woman and you'll get through this.  We're all here for you!stacey- *****super sticky ultra baby dust****** All for you hun!  I've got my fingers crossed and I can't wait to read your next update!!!mommyin09- While luvkayln is doing an AMAZING job while you're away, you are surely missed!  I can't wait to hear from you again!  And my fingers are crossed for you!!Good morning!!!  Well, I'm back at work. Yay.  Still feeling pretty crappy, but oh well.  It's that time of year.  Bad headcolds and flus.  I had a temp spike this morning but I'm trying really hard NOT to get my hopes up.  I have been feeling so sick that I think it might be a slight fever.  And it wasn't a big jump at all.  But we'll see.  I'll be taking my OPK on my lunch break so who knows.My momma is doing great!  The bandages are off and she is healing really well.  The doctors said that she still needs no skin grafts and that the blisters are almost gone and healed.  There is still a lot of red/pink all over her hands and there will be for quite a while.  But she's doing great and that makes me happy!DH should be hearing about his new job any day now, which is really exciting.  It's a huge pay raise so we are excited about it.  He and I are doing very well.  We're both ready for me to O. I think he just wants a full week of BD.  Ha ha, men.  He's been doing great though.Well I hope everyone is having a great day so far!",
            "post_id": "3760580",
            "timestamp": "1229007171",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "Good morning everyone!luvkayln - I responded to your post, but like I said, I'm really not sure.  Honestly, with your temps being so low, it doesn't seem like you did O.  Ugh, I know, this was supposed to be your cycle to take a break from all the stress!  Why do our bodies have to play games with us.  It's exhausting sometimes.  Don't you wish we could all go back to the carefree days we once knew.  :)Stacey - Good luck today!  I can't wait to hear how it goes.  I can understand your thoughts on transferring 2.  I think I would do the same thing.  Like you said, you may not have an implantation issue, so they all could end up implanting.  You need to do what you and DH are comfortable with.  Take care.  Oh, and thanks for listening to my vents and for your advice.  I hope it gets better soon.  I hate seeing DH so upset.Shysana - Congrats to DH on his job!  That's great news.  Hope you get more good news soon!  :)LinaG - Thanks so much for your good wishes.  I'm excited for Christmas too.  That's great that you're taking a break to relax, sometimes that will help get your BFP!  When I told my doctor I was starting ttc, she put me on prenatal vitamins.  You could always get a multivitamin in the drugstore just to be sure you're getting adequate folic acid, etc.Hannah - Hope you feel better.  Take care.Mrspace - Hope you are feeling better too.  I agree with luvkayln, Clomid can make your ovaries work overtime and they can feel painful and swollen.  Let's hope that means you'll be O'ing soon!Michelle - I am so sorry for what you are having to endure.  I know, isn't it ironic that you want for so long to see your HCG rise and now you're wanting the opposite.  Actually, my co-worker went in for her 12 week u/s a few weeks ago (she got pregnant by accident, so wasn't being monitored like we all are).  She wasn't having any problems at all, so she went in expecting good news and found out that she had a molar pregnancy also.  Se's been having the bloodwork every week too and it's really been hard on her.  I've been thinking of you often and I hope that you have a good Christmas and that 2009 brings with it much hope and many new blessings for you.  Keep in touch and take care.  My prayers are with you.",
            "post_id": "3760583",
            "timestamp": "1229007212",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Ok, i'm hella confused! I just went to the bathroom b/c I felt like af just showed. I'm cramping and it felt really wet down south. But when I checked, I had a TON of stretchy ewcm! I usually do cramp around my ovulation, but never for a week straight! Do you all think i'm getting ready to O now? WTF!? I'm CD 24 today, and my cycle before last when I was off the meds, I ovulated on CD 23, so maybe I am getting ready to O? What a way to get so excited b/c I thought af was going to be here any minute, and now it looks like i'm just getting ready to O!! Dang, and Sean's on crutches right now! Looks like i'll be doing all the work tonight! LOL",
            "post_id": "3760729",
            "timestamp": "1229010229",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Do you have an OPK? This is really exciting-get busy!!",
            "post_id": "3760764",
            "timestamp": "1229010920",
            "user_id": "user_671994",
            "user_link": "/personal_pages/user/671994",
            "votes": "0"
        },
        {
            "answer": "Keyan - bny actually informed me of taking Fish Oil (Omega 3) for endo.  I've googled it many times and read lots of good things about it.  The way I figure, it certainly can't hurt, so it's worth a shot.  That's great that you found a GYN that specializes in endo.  I really pray he can help you.  You are so right about this thread, the name is pefect.  I think we've all been shaken to the core at times, but we always come back stronger and more determined to be parents!  Life just feels so incomplete without children, for so many reasons, but especially at this time of year.luvkayln - OMG, are you kidding me!  I'm not sure what to say.  I know you were all prepared ot move onto the injections, but I think it's great that this cycle could still work out for you.  You must be right, maybe the cyst messed things up at first, but now it looks like your body is back on track.  Yay!  I hope Sean's OK, I didn't realize he was on crutches.  I'm sure he won't mind if you do all the work.  LOL. You are too funny.  This just goes to show there is always hope!!!  :)",
            "post_id": "3760779",
            "timestamp": "1229011234",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "wishandaprayer- No, I don't have an opk! :(  I'm at work... I just don't know what to think right now! I guess I can assume I haven't ovulated, and am getting ready to. Yesterday, I had watery/very slippery cm, but I just ignored it and today I have very stretchy ewcm but cramps too! I guess we'll see what my temps do, but I'll just treat myself as if I'm getting ready to O and will get on board to the bd train! :)",
            "post_id": "3760781",
            "timestamp": "1229011305",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Candie- I know, i'm shocked too! Hopefully it's not my body trying to mess with me again and I really am getting ready to O! I thought for sure that my cyst had really messed things up for me, but it looks like you may be right and that there is hope! :) I just called Sean and told him to get ready for me! hehe! :) I had to explain everything to him, you know how men are, they just don't get it sometimes! :) I think it honestly does make sense that I felt \"O\" pain on CD 9, then my temps jumped up b/c my body probably thought my cyst rupturing was me ovulating. Then my temps went down b/c maybe it realized it was just my cyst, and am now gearing up to O now. I did feel a little bit of O pain on my left side last night, along with watery/slippery cm, but I just thought it was nothing. Until just now, when I checked and there was a ton of ewcm! :) Oh, what we go through every month, I swear!! :)",
            "post_id": "3760827",
            "timestamp": "1229011889",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln- You crack me up, hun! I'm so sorry that Sean is one crutches!  What happened?  I think it DEFINATELY seems like you're going to O!  I have very slippery wet cm today, so I think I might O tomorrow actually. Could be today though!  Who knows!  Have fun with the BD-ing!  Ha ha!  That's great.  And sorry you have to do all the work lol.  You just made my day with that.  Thanks!So, my appetite has been super crazy all week.  I'm not really hungry at all, except for Chinese food.  And guess what...the ONE chinese place in town...has mysteriously closed and no one knows why.  It doesn't say they're out of business, just says closed when they should be open.  I'm so mad.  Now I'm craving sweets.  I think I will make mint chip cookies tonight!  Yum!   DH was super happy with me last night.  Since I stayed home all day, I cooked a decent supper.  I made baked chicken breasts with homemade mashed potatoes and homemade gravy.  It was pretty darn good if I do say so myself.",
            "post_id": "3760852",
            "timestamp": "1229012325",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "no its ver heavy bleedin still bleeding now makes me light headed cannot belive they have not done nothingi think its cd2 for memy af is everywere glad its early and not late thoughhad to have day of work today think im going to christams shoping tonight xxxhow is everyone x",
            "post_id": "3760889",
            "timestamp": "1229013000",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "mrspace- Well, about 6 years ago, Sean got into a very very bad wreck and his best friend died. Sean was driving, and they were drunk! :( Sean spent 3 almost 4 years in prison for it, going in when he was only 17! We were best friends when this all happened! Sean broke his ribs, broke his left leg and now has a steel rod holding his bone together in his leg, with 3 screws keeping it in place. Sean has really been through a lot, and it's very hard for him. He feels like he's literally cursed, with losing Zach and then our babies! :( He's on crutches now, because everytime winter comes around, his hip/leg starts really messing with him. It's like he has arthritus, he just can't handle it! He went to the doctor yesterday because he was literally crying he couldn't walk. So he finally went to the doctor and they did x-rays and found lots of bruising and one of the screws is bent! She put him on crutches until monday, and is supposed to come back monday. He's got pain meds now, and he's already starting to feel better. He's just been staying off of it, and using his crutches when we do go out, taking hot baths and using the heating pad. He's really not a bad person, you guys so please don't think that! :( He was young when all this happened, and he's had a hard lesson to learn! :(",
            "post_id": "3760963",
            "timestamp": "1229014635",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln - You are right, it sure sounds like you are about to O now instead!  Especially with the O pain and the EWCM.  You better get busy girl!  :)  Oh hon, I am so sorry about everything that Sean has been through.  I had no idea.  Not only does he have the physical pain, but also that emotional pain that he has to carry for the rest of his life.  I certainly don't think he's a bad person.  Actually, a group of DH's friends would go out drinking all the time and we would always worry about them.  A few years ago, one of them left a party and decided to drive drunk in icy weather.  He crossed the center line, killing a young mother and severely injuring her passenger.  He too had to serve time.  Plus, he was a school teacher, so they took his teaching license away.  He is the sweetest guy and would never have intentionally hurt anyone, he just had a problem and it took something like that to snap him out of it.  He now gives talks to groups about what happened to him to try to help others and he can't talk about it without breaking down.  You're right, it is a very hard lesson to learn.",
            "post_id": "3761530",
            "timestamp": "1229023563",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "luvkayln- Well I took my OPK.  Big negative.  Maybe tomorrow.  Who knows.  I don't think badly of your DH at all!  Everyone makes mistakes and I'm sorry for the physical and emotional pain he carries with him.  My DH doesn't drink or smoke and never has.  He chose that because he's seen the pain it can cause.  I will be praying for his peace of mind and that his body will heal.  Situations like that are so hard.  You'd better keep me updated on whether or not you O.  Sounds like we're almost on the same page, you and I.  Crazy!  Wouldn't it be amazing if we O'd the same day and ended up with BFP's together!!!  I'll be keeping my fingers crossed for you, sweetie.",
            "post_id": "3761775",
            "timestamp": "1229027684",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "LuvKayln - Oh my dear, I am very sorry about everything that your DH Sean has been through. I'm also sorry that he has pain in his leg and also that he have emotional pain that he has to carry for the rest of his life as Candie said.I don't think also that he's a bad person at all.  I feel very sad though about him. God bless him and U together. I'm happy that he found U and I wish U both a very happy and long life together with many babies around U 2.:-)My DH also drinks but usually control him self, when he is driving or when we are together, I drive always but I also likes red vine too. One week ago he went out with our best men, but that day our best man came and pick him up, so my DH came home with red eyes, he was sleepy, I have never seen him in that way before, I asked him is he drunk he said no of course, \"no one who is drunk will admit that is drunk\" he didn't even kiss me when he went to bad ??? (first time since we are together, I hope last :-), so next day he didn't know how he came back home?!? he phoned our best man to ask about it, so best man said that he used a cap - taxi?!?! I was very upset b/e this gets to happen when he goes out with our best man, his best friend, father of 2 children (3 and 1 years old)?!?! So you're right, it is a very hard lesson to learn. Wish U all the best, take care of your selfs and your future. Baby dust 2 U!  :)Candie - you are more than welcome my friend! Thanks for the advice. I'm drinking vitamins and folic acid too, but I wanted to know does everyone else in TTC is doing that. Have a blessed day!Stacey - Good luck today!  I can't wait to hear news from U tomorrow, in my time. Take care, God bless UShysana - Congrats to DH on his job!  I'm happy for him!  I hope you get more good news soon!!  Baby dust 2 U :)Hannah - I hope you are feeling better. Relax and think positively! All the best 2 U.Mrspace - Don't lose faith! Relax and wait. Wish U big fat +BF soon!!:-) I'm very happy for U mammy also, and I wish her quick recovery!Guestito - wish to hear beautiful news from u tomorrow! Take care mammy in 2009:-)Michelle - My prayers are with you. God Bless UKeyan - Thinking of U. God bless U 2!Mamushko - nedostajesh mi moja drugarice:-)Arlotheslug - My prayers are with U 2. God bless UI'm thinking that I'm going to catch a cold, I feel tired all day, my body hurts especially my legs and don't know why, maybe b/c the weather is very cold down here!But I did my English cookies 2 hours ago and I'm happy for that, and now I'm going to sleep.Have a nice day and evening all of U. Sweet dreams to all of U!",
            "post_id": "3762404",
            "timestamp": "1229038367",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "Candie, mrspace, LinaG- You girls are wonderful! :) I knew you all would be supportive! Well, we bd tonight, woo hoo! :) We went out to dinner, went and got dog food and bird food, came home and I couldn't find Sean! So I went to the bedroom, b/c I thought maybe he was on the compter, but he was on the bed \"waiting\" for me!!! LOL I about died laughing!! :) He just had a big grin on his face, laying there butt naked! :) Tmi, I know! :) But it was too funny, I just had to share! I didn't buy any opk's while we were at the store, I just figure I'll watch my temps and just bd everyday until I ovulate. And hopefully I will ovulate! Fingers X'd!Mommyin09- I'm so glad you'll be back tomorrow! :) We've all missed you! When you post our updated list tomorrow, will you change me to CD 25? Can you believe that about my ovulation? Crazy, huh?! But remember, I even asked you last week what you thought about it, if I ovulated or not. It's been a doubt in the back of my since my temps went down...Oh, and by the way, I changed my \"2 dpo\" temps, because that was the day after Thanksgiving, and I got up at 4 am to go shopping. Well, my temp at 4 am was 97.2, the day before was 97.9 and the day after was 98.0. So I thought my temp was just messed up b/c I got up so early, and I read that your temp rises .2 every hour. So I just changed to 97.6 ( I know that's wrong, but I just figured that b/c of the day before and the day after, ya know?) Anyway, I put the actual temp in for that day on my tracker today, and guess what! It now shows that I haven't ovulated yet! Suprise, suprise!! At least now I know, although it's been in the back of my head for a while... We'll see what my temps do in the next few days!mrspace- Yes, that would be totally awesome if we started our 2ww together, and got our BFP's together!! Let's just pray this round works for us, and if not, we both have more meds to look forward to! Keep testing with those opk's! I hope you get a +ve soon!! :)",
            "post_id": "3763081",
            "timestamp": "1229049300",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "luvkayln-  That's soo funny that he was \"waiting for you\".   I love it!  My DH, Richard, tried something like that last weekend. He had gone Christmas shopping for me.  When I got home he told me to go upstairs and to look on the bed.  There was a \"present\" for me.  Then he told me that I'd have to use whatever the present was.  Ha ha.  He'd bought lingerie for me.  He's such a nerd. I love it though.  I took another OPK tonight, just in case, but it was also negative.  We'll see about tomorrow.  Who knows!  I hope we're in the tww together and that we both get BFP's together!  It would be awesome!",
            "post_id": "3763268",
            "timestamp": "1229052744",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "luvkayln - You bet we'll be supportive - that's what friends are for!  :)  That is too funny about Sean.  How would we ever get through this journey without them around to make us laugh!  Looks like you'll have a fun weekend.  Hopefully you'll O soon!  I'm excited for the weekend.  I work in a small department with only 5 of us ladies and we are all going out tomorrow for Christmas and taking our spouses, so it should be a lot of fun.  Then on Sunday, Scott is going Christmas shopping for me, so I'm taking my mom shopping and we're going to go out to eat too.  She's been having a rough time lately because my grandma's in a nursing home and my mom had been trying to hang onto her house (since that's where she grew up), but she couldn't afford to keep paying to heat it, so we had to sell it.  Plus, like I've alluded to before, my dad has been difficult towards her lately as well, so it will be good to get her out for the day.mrspace - That was so nice of your DH.  Mine is so cute, always too embarassed to go into a store and buy me stuff like that, so we're always looking through the Victoria's Secret catalogues together and doing the online shopping thing.  I hope you get your OPK soon!LinaG - Hope your aches and pains were just from the cold and you're not getting sick!  Everyone here at work has been passing all kinds of illnesses around and I keep praying I don't catch it too!  That time of year I guess.Shysana -  I hope AF is staying away.Are you still going for a blood test today?  If so, good luck!Stacey - Hope everything went well yesterday and you are resting comfortably.mommyin09 - luvkayln has certainly been doing a good job keeping up with us all, but we've missed you!  :)  I hope you and DH had an awesome vacation together.As for me, I think I'm 7dpo today and my temp was 98.64!  It has NEVER been that high!  I hope it means something good is happening.  Please, Dear God, let it be true.",
            "post_id": "3764256",
            "timestamp": "1229092164",
            "user_id": "user_398038",
            "user_link": "/personal_pages/user/398038",
            "votes": "0"
        },
        {
            "answer": "Candie:  Hey! your temps sounds good...we'll pray it is cause of christmas BFP!! Good luck shopping!Mommyin09: Welcome Back!Luvkayln: You are too funny! Have fun BDing! ......How great is it, that just when you thought you were out, you find out you still have a shot for a Christmas present! Come on BFP!!Stacey: I hope you are doing great...can't wait to see your update!As of me, well I will go in for an U/S today and I think we will discuss my lab work and set a date for the LAP.....I hope!! We have a busy weekend, Painting, getting ready for christmas!To all: Enjoy your weekend...I hope on Monday we are all celebrating many BFPs!",
            "post_id": "3764403",
            "timestamp": "1229094504",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Hey everyone!Well my temp came back down a little today. Yesterday it spiked to 97.0.  Which was a decent sized spike.  Then today it was back down to 96.4.   I have a very low normal body temp.  So I don't know.  Not sure I'll ovulate today. I want to but I doubt it.  With my temp being down like that.  But I was also told that sometimes you O later than normal when you're on clomid.  So we'll see.  I think we'll be okay with the BD patter that DH and I have had lately.  You'll have to go check it out on my tracker.   I think it's funny.Other than that, today I'm feeling really bloated and still having a lot of lower back cramping.  But other than that I'm doing great.  See, I've been on and off of anti-depressants since I was 12 years old.  My dad started sexually abusing me when I was 11 and it continued to about 2 years ago, when I turned 20 and finally moved out.  It's been a long hard road so far.  Since we're TTC I can't be on my anti-depressants.  It's a bad time for me to be off of them because I'm finally cutting my dad out of my life.  It sounds like it would be easy...but it's not.  I spent years trying to make him happy and to make him love me, even through the abuse.  It's a very hard habit to break.  To this day I still mentally degrade myself on an almost daily basis.  Just because it's what he would do.  And that voice is stuck in my head.  But with DH's help, I'm overcoming it and learning that I'm a good person and that I'm beautiful.  Well, I can't really call myself beautiful yet, but I'm getting there.  But anyway, I've been off of the anti-depressants for 6 months now and the last few days...I haven't needed them!  I have felt really good.  It sounds like no big deal but it's huge for me.  I feel like I'm at least taking steps in the right direction. Now I just have to stay strong and not deviate from my path.  It's hard. My dad calls me almost every day and leaves me messages about getting together for Christmas and so on.   It's hard not to call him back.  I still feel like I'm 11 when I talk to him.  Like, if I just do what he wants, maybe he'll love me just a little. But I have to snap out of it.  I'm not 11. I'm 22.  A grown woman.Plus, DH and I made the decision to cut him out now because once there are children involved, everything seems to get \"messier\".  Plus... I could never never never let him be around my children.  The thought just makes me sick to my stomach.So, happy dance for me, that I'm feeling good without medication.  And please, if you don't mind, just keep me in your thoughts with this.Thanks all.Sorry I wrote a book, but I needed to get that off my chest!",
            "post_id": "3764423",
            "timestamp": "1229094998",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "OMG! I am so sorry!!! YOU ARE a beautifull young woman!  I am happy you are doing better w/ out the meds....Try to concentrate your thoughts in YOU, dh and your goals and plans of a life together....Please keep yourself away from him......change your numbers or do something, but stay away, he needs to stop. ...............I know you already know this, and maybe you have heard it many times, and although I really don't know you....BUT I AM REALLY SURE there is nothing you could have done different, you were a child and it is not your fault..........Don't worry if he loves of you or not, you don't need that type of love, he is sick......Concentrate your efforts on loving back the ones who truely love you! My thoughts and prayers are w/ you.... HUGS",
            "post_id": "3764548",
            "timestamp": "1229097247",
            "user_id": "user_102073",
            "user_link": "/personal_pages/user/102073",
            "votes": "0"
        },
        {
            "answer": "Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 21 weeksJoyce: BFP - 14 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 10 weeksArmyprincess: BFP - 8 weeksGuesito:  BFP 7 weeks (saw h/b! Next appt today!)Bny807- waiting on af!Keyan:  CD5Babymama:  CD5Pyar:  CD7LinaG:  CD9mamatina:  CD11Mrspace24: CD14kmcarino:  CD17Hoping4_2: CD22luvkayln:  CD25ad_06: CD26jmh2005:  CD26naf38:  CD31arlotheslug:  CD33Stacey:  1dpt!Mommyin09: 4dpiuiCandie:  7dpoHannah1505:  10dpowishandaprayer- 12dporachjas:  14dpoSexykeme78: 15dpoShysana: 17dpo************************************************Good morning, ladies :)  I'm back from a wonderful few days away & I can't believe how much I have to catch up on!!!  I apologize if I've missed anyone!!!luvkayln:  Thanks for an awesome job updating our thread! :)  I'm sorry your cycle is not quite what you expected, but like Keyan said, now you've got a shot at a Christmas bfp! :)  How could any of us think Sean is a bad person when he's loved by someone like you!?  What he's been through is so sad & it's a really difficult way for a kid to grow up fast!  That is too cute that he was \"waiting for you\"!  I love that :)mrspace:  Congrats to you for being off your meds & doing so well!  I'm so, so sorry for all you've been through with your dad! :(  There's really no way most of us can fully understand, but I'm proud of you for taking the steps to regain your self-confidence, to value yourself & to live the life you deserve to live!  I'm also so happy for you that you have a loving, supportive husband!  Take care & you will be in my prayers :-)Keyan:  Good luck with the u/s!  I hope you can get your lap scheduled a.s.a.p.!!!michelle:  Good luck today :)  I hope you see the numbers you're hoping for !!!Hannah:  I hope you're feeling okay!Shysana:  Have you tested again?  I'm getting excited for you :)Stacey:  I'm so happy for you!!!  How do you feel after the transfer?  I loved your comment about getting a bigger house :)  When do you go back to the doc?Candie:  How are you doing in your tww?  Stacey, you & I are so close this cycle!LinaG:  Ha ha !  I'll have to wake up a bit before I can read your message to me! :) I hope you're not getting sick.  Feel better !  Did you see a doctor about your e.coli?Thanks to all for the nice notes & anniversary wishes!!!  We had a great time & now I'm getting ready for work.  Luckily today is our Christmas party, from 11-2, so it should be an easy day!!!  Talk to you all laer! :)",
            "post_id": "3764560",
            "timestamp": "1229097378",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "I'M SOOOOO FRUSTRATED!!!!  Just got back from my new OBGYN. Ok here's my story...1st u/s on 12/2 Saw Sac at my old( RE)2nd U/s on 12/9  with my new ob gyn Thinkd he saw a flutter not sure. Wants me to return in 3 days to confirm3rd U/S today 12/12 He's more confident he sees a flutter, also pointed spinal beginning to form..Also noticed growth from 3 days ago....Dr.curious Still wants me to come back next Friday 12/19 for another u/s he says im measuring abour a week behind! He said congratulations but.....come back next week to confirm ughhhhhhhhh!!!!I never cancelled my appt for this Tuesday with my old RE so I think im going to go to that appt to get clarification on whats goin on. I think my new obgyn is confused about my dates due to being in vitro. He's scaring me though!  My point is... IS EVERYTHING OK OR NOT????",
            "post_id": "3764606",
            "timestamp": "1229098123",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies!!!Just a quick note to update you all.  Thank you SO much for all of your notes and prayers.  It means so much.  Thank you thank you!The transfer went well.  They picked the 2 \"best\" embryos and they were both 8 cells.  We even got a picture of them :)  I'm feeling much better than I felt after the reteival!  I'm just getting a bit bored because I have been in bed for most of the week...but it is all worth it.  So, I'm hoping and praying and praying and hoping that at least one will stick.  Come on little guys!!  My RE's clinic closes over the holidays but I am due to go for a beta test on Dec 24 (Merry Christmas??).  I will absolutely be doing an hpt before that..probaby around the 20th/21st.Luvkayln - I'm going to check out your chart but I hope you are not having an annovulatory cycle!!!  They can be very confusing, up and down.  Either way bd just to be sure!  I am also so very sorry to hear about Sean.  That is just terrible.  He was so young and we have probably all done stupid things...we just don't have to pay for them for the rest of our lives.  I really want you to get your bfp soon!  Come on O or af or whatver!!!Mrspace - How awful.  So sorry.  You are a very strong woman and sound like you have wonderful support from your dh.Candie - Those temps are great!  I really hope they stay up and you get your Christmas bfp!!!  There is a second rise in temps when you get a bfp so hopefully that was it!Mommyin09 - Hope you had a wonderful time away!  We miss you!Well...back to bed for me!  Thanks again for all your support ladies.  I will check in tomorrow!!SSBDStacey",
            "post_id": "3764649",
            "timestamp": "1229098917",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "mrspace- I'm sooo sorry for all you have been through! But like the other girls said, you are a very strong, beautiful woman! No one deserves what you went through, and you are an amazing person to walk away from that! I'm glad you are feeling better lately, and don't need your anti-depressants! Yay! I took them for a few months after having Kayln, and just when they finally started working, I stopped taking them. You're right, can't take them while ttc! I started to not depend on them, and just concentrated on the love and support I got from everyone around me, just like you have with your dh and us!! :) We love you, and are very, very proud of you!!! ((Hugs)) I hope that +ve opk gets here soon for you! I still have ewcm today, and my temps are still down, so I probably will ovulate soon. By the way, your temps are low the day you ovulate, and then spike the day after indicating that you definately ovulated the day before. So your temps being down today is not a bad thing, you may be ovulating today! :)Stacey- That's great your transfer went well, and they picked the best 2! Yay!!! I love that you got pics of them! I just know this is it for you, and your test is on the 24th! Are you kidding me!? You're going to have the best Christmas EVER!!!! :)Mommyin09- I'm so glad you're back!! We missed you! :)Candie- That's awesome your temps are high today at 7 dpo! I sure hope this is it for you sweetie! :) I'll check out your chart in a minute!Guesito- I'm sorry your new doc is a quack and is mixing up your dates! I'm sure everything is just fine with the baby, and he just is confused because you did invitro! I know it's hard not to worry. I say definately go to your appointment you never cancelled with your old RE, he knows what's going on and knows your dates and everything. I'll be thinking of you, and just have faith! I hope your fears are tossed away after Tuesday! I know it'll be a long weekend for you now, maybe try to call them and see if you can get in earlier?? Tell them your concerns, and i'm sure they'll understand!",
            "post_id": "3764759",
            "timestamp": "1229101236",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "mommyin09- We missed you!  And we're so glad you have you back.  I'm glad everything is going so well for you.  My fingers are defiantely crossed.luvkayln- Thanks for the kind words.  It is something I struggle with every single day.  But I'm doing really well.  I really hope that I'm ovulating today.  I forgot to take my OPK on my lunch break so I'm making DH bring it to me at work.  Ha ha.   It's important though! I'm still having some cramping.  My cm is still really watery, so I don't know.  We will just have to see. My next appointment is on the 22nd, so hopefully we'll have some answers soon.  I know we won't find out if we're pg at the appointment, it'll be too early.  But maybe she can help me interpurret (wow sp) my charts.  I hope you O soon hun!  My fingers are crossed for you.guesito- I'm sorry that your new doctor is confused, and confusing you in the process.  I hope that the weekend goes by quickly so that you can go in and get more answers next week!keyan- thank you so much for your kind words.  I know that when I saw \"sexually abused\" everyone tends to assume rape.  I wasn't raped by my father.  I'll make that point clear.  But you're right.  He's a sick man.  And I know that it doesn't make sense for me to want to make him happy after all this time, but like I said...old habits die hard. It's very difficult for me.  DH has been so amazing.  We had a major break through just after our wedding (in Sept).  I was able to sleep with the bedroom door open.  DH even baked me cookies the next day to celebrate!  Ha ha.  It was great.  But it'll all be okay.  I know it will.  I'm taking the steps that I need to now.candie- That's awesome that your temps are up.  Sounds like a good sign to me.  I will be keeping my fingers crossed for you!!Again, thanks to everyone for the kind words.",
            "post_id": "3765078",
            "timestamp": "1229105900",
            "user_id": "user_688022",
            "user_link": "/personal_pages/user/688022",
            "votes": "0"
        },
        {
            "answer": "CD 2.  U/S tmw to figure out the plan for this cycle.",
            "post_id": "3765447",
            "timestamp": "1229112642",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "Wow to many news, from were to start, OK I'll start from the end....:)mrspace24 - I feel very sorry for what U have received from the people that have brought U in this life, about emotional and physical pain in your early life and I'm very very happy that that has ended, THANK U LORD! I'm sorry that I need to tell U this and I hope U will understand me: I hate your \"father\" and he is sick definitely, so stay away from him, he doesn't deserve you at all, even if he is your \"father\" but not the right one. I'm sorry sweetie. Two years for now U are free, and U are with your soul mate the person that really love and take care of U. I can tell that U are very brave, lovely, positive, beautiful soul and person. God bless U, baby dust 2 both of U! Hugs from my heart!LuvKayln - BD 2 U 2 no matter that your BBT is low. Just relax and hit the road:-)Stacey - I'm very happy for U, relax, stay in bad watch movies, read a book... Camon gays bind strongly in there ....:-)Guesito- I'm sorry that your new doctor is confused, so he makes U confused 2. Can U go in some other clinic and get another Doc, or visit your previous one b/c he knows U and your history more ??? Calm a little bit, be positive, don't make such pressure on your self, don't allow them to influence at U. God bless U!Mamushko - welcome back, I'm happy that U and your DH had a great time, U deserve that for sure. From my previous post for U: I miss U my friend= nedostajesh mi drugarice moja. Wish U BFP this month!:-)I have not been to the Doc. for E.coli, b/c I think that the results are negative, I feel and I know that I don't have problems with my bladder as I have before.  So next week I'll take my urine for testing again, and see the values of e.coli if I have e.coli. Maybe my immune system is down again so I'll to do also blood checking.Kayan - Hope that your wishes will came true. Good luck!Candie - Dear I'll pray for U and wish you to receive a present from God soon and of course of BFP for Christmas! :-) Good luck and happy shopping! Today I'm feeling very good, so I hope the cold has pass me. Thank U for your thoughts.To all: Enjoy your weekend...I hope this holly month will bring us all many many BFPs! :)",
            "post_id": "3765625",
            "timestamp": "1229115473",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "GUEISTO- the ultrasound machinesd at the RE's office are more advanced than at the OB office usually.  I would go to the RE and have them do an ulttrasound to confirm your dating accurately.  Will your insruance freak out?  i do not see why as you have a certain amount of RE appointments paid for anyways.Hey ladies- sorry i have been MIA.  i have been coming home and studying for a big substance abuse counselor license exam that i took today.  I had to drive 2 hours in the pouring rain to the city that was all over the news, Worcester for having so muich ice that it weighed down the trees and so many trees fell into the roads because of it.  I think i did ok on the exam though.  whether i passed or not, it is over now and i can breath and focus on preparing for my little guy now.",
            "post_id": "3765673",
            "timestamp": "1229116447",
            "user_id": "user_342988",
            "user_link": "/personal_pages/user/342988",
            "votes": "0"
        },
        {
            "answer": "Wow before I go to sleep and I'll do that soon after write this...This day wasn't so nice for me I don't know why, I was happy all day, I even did a good think today for my neighbor who ask me to take him to the hospital so I did and I waited for him to finish and bring him back:) I was very happy that I helped him, I love helping people that is my mission in this world. But today I cut my right hand 4 times, the last time was 5 minutes ago and it was very bad and hurts me a lot, I just put the dishes in dish machine and cut my forth finger so dip.:( So I'm scared to touch anything anymore and my DH who is in third shift at work said to me don't touch anything just go to sleep :) So I will.Take care all of U, good night from me :)",
            "post_id": "3765960",
            "timestamp": "1229122064",
            "user_id": "user_672662",
            "user_link": "/personal_pages/user/672662",
            "votes": "0"
        },
        {
            "answer": "can not write much am on my way to bed....i am volunteering at the social service office tomorrow (we call is DHS) they are dividing donated gifts to the kids in need, so i am gonna help choose gifts for some of the local kids, hmmm wonder if i will have to wrap them too...i dont know but i just wanted to help this holiday and didnt know what else i could do...lol",
            "post_id": "3766427",
            "timestamp": "1229131974",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "oh by the waymommyin09---update tomorrow 15 weeks....lolmy appt is Tuesday, hopefully all is going well.....i feel a little better, hormones still making me feel crazy but i guess i will get over that eventually.i had a dream last night that i went to the bathroom and started spotting, woke up with a massive headache....maybe it was the headache coming through...lol",
            "post_id": "3766435",
            "timestamp": "1229132101",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "I had to cancel my appoingtment yesterday...the eather was really bad here and the roads were all flooded, so I re-schduled for tomorrow.  That means I have to wait all weekend to get the results since my RE's office is closed on Sunday's.That S U C K S!! At least my doctor gave me sleeping pills, so at least I stopped losing sleep over all of this.  I am still testing positive on the ovulation strips...I guess that means my levels didn't drop to 0 this week. Maybe next week?Joyce ~ I think the high levels of HCG make you have crazy dreams...I am still having them almost every night.  Although my dreams have shifted focus from baby to Christmas.  Last night I had a dream I went to a flea market and I was looking all over for a green Hawaiian quilted tree skirt?!?!?  I never found one...I woke up bummed, LOL",
            "post_id": "3767295",
            "timestamp": "1229158844",
            "user_id": "user_507564",
            "user_link": "/personal_pages/user/507564",
            "votes": "0"
        },
        {
            "answer": "Michelle- I'm sorry you have to wait till Monday to find out your results. :(  Your levels really are dropping pretty quickly. Quicker than what they said they would drop, so I bet they'll be down to 0 by next week, or at the latest the week after. Stay strong, I know how hard this is ((Hugs)) After I had Kayln, I did nothing but take sleeping pills, but not b/c I couldn't sleep, but b/c I didn't want to be awake. Your dream about the tree skirt is adorable! I'm sorry you never found one! :) I know you just want these levels to drop to 0 so you can start healing emotionally/physically and start trying again in a few months. The new year will bring you another baby, I just know it! :)So, Kayln's birthday is wednesday, I can't believe it's already here! :(  A lady that I work with that was always buying Kayln things when I was pregnant gave me her birthday present yesterday! It's an angel leaning on this ball, and it's a solar light. So during the night, her wings and the ball light up. She said it's her angel to look over her at night! :(  I just thought that was sooooo sweet of her to do that! We're all meeting at the cemetary on Wednesday at 3:00 to say a prayer and to wish her a happy birthday. Sean's aunt wrote her a really sweet poem, so I'm going to print it out and laminate it so it can stay out there with her too. It'll be a sad day, but I'm greatful that the whole family will be there to celebrate her birthday with us! I know i'll talk to you all before wednesday, but if you can just remember to keep her in your thoughts I would really appreciate it! :)Well, my temps are still down this morning but I still have ewcm today when I wiped so O must be coming soon! I keep saying/hoping that anyways!! :) I've got my meds just waiting for me, and watch i'll end up pregnant this time and not even need these meds! Wishful thinking!! :) At least I know a few girls here that would be willing to take it off my hands! :)",
            "post_id": "3767596",
            "timestamp": "1229177351",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "I'm sorry af showed! :( Good luck at your u/s today! I hope whatever plan you chose to do this cycle ends in a BFP for you!",
            "post_id": "3767608",
            "timestamp": "1229177675",
            "user_id": "user_449498",
            "user_link": "/personal_pages/user/449498",
            "votes": "0"
        },
        {
            "answer": "Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 29 weeks !!!vortex: BFP - 21 weeksJoyce: BFP - 15 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 10 weeksArmyprincess: BFP - 8 weeksGuesito:  BFP 7 weeks (saw h/b! Next appt today!)Bny807- waiting on af!rachjas:  CD3 (u/s today)Keyan:  CD6Babymama:  CD6Pyar:  CD8LinaG:  CD10mamatina:  CD12Mrspace24: CD15kmcarino:  CD18Hoping4_2: CD23luvkayln:  CD26ad_06: CD27jmh2005:  CD27naf38:  CD32arlotheslug:  CD34Stacey:  2dptMommyin09: 5dpiuiCandie:  8dpoHannah1505:  11dpowishandaprayer- 13dpoSexykeme78: 16dpoShysana: 18dpo************************************************Rachjas:  Sorry about AF! :(  That's good you have your u/s today, so you can start focusing on this cycle & move forward.  Let us know what the plan is! :)Stacey:  I'm so happy to hear that your transfer went well & you have two little embryos growing inside you!  That's so exciting that your beta is Christmas Eve!  Mine is 12/21, but like you, I'm sure I'll test before that !!!  Take care :)Michelle:  Best wishes for your appt today!  That is a bummer that you have to wait till Monday for your results, but it looks like your #s should be down by Christmas :)Lina:  Be careful!  I hope your hand is okay!!!Leighanne:  Good luck on your exam :) Now, stay off the icy roads!!!luvkayln:  I'm sure Wed. will be very difficult for you, but like you said, it's wonderful that your whole family will be there with you & the solar angel sounds amazing!  What a beautiful idea!!! :)Keyan:  I'm gonna go check your message now.  I hope your u/s went well!  :)Arlotheslug:  I'm always thinking of you & hoping you're doing well.  It would be so nice to hear from you when you're ready.  Take care !!!",
            "post_id": "3767898",
            "timestamp": "1229187816",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Guesito:  I just realized I didn't update you on our list.  I'm sorry you're not getting the answers you're looking for with your doc appts!  That's good you didn't cancel Tuesday's appt.  I hope it puts your mind at ease.",
            "post_id": "3767908",
            "timestamp": "1229188046",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "hey all i feel a bit better now thankyou we decided we are gonna pay private for a doctor next year england huh so complicated but it will get the job done sooo heres to a nice chritmas and hers to all us ladys getting bfps in 2009!!!!",
            "post_id": "3767974",
            "timestamp": "1229189656",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Michelle:  (Offer support & prayers!!!)Arlotheslug (Taking a break.  We're thinking of you!!!)kmcarino:  (On Vacation)Leighanne: BFP - 29 weeks !!!vortex: BFP - 21 weeksJoyce: BFP - 15 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 10 weeksArmyprincess: BFP - 8 weeksGuesito:  BFP 7 weeks (u/s 12/16)Bny807- waiting on af!Sexykeme78: CD3?Hanna1505: CD3?rachjas:  CD4Keyan:  CD7Babymama:  CD7Pyar:  CD9LinaG:  CD11mamatina:  CD13Mrspace24: CD16Hoping4_2: CD24luvkayln:  CD27ad_06: CD28jmh2005:  CD28naf38: CD33Stacey:  3dptMommyin09: 6dpiuiCandie:  9dpowishandaprayer- 14dpoShysana: 19dpo************************************************Sexykeme & Hannah:  I noticed that AF showed! :(  I'm sorry to you both.  I guess I missed quite a bit while I was away.  I put you both in as CD3, but I'm not sure if that's accurate.  Hang in their, girls!!!rachjas:  How'd your u/s go yesterday & what's your game plan? :)Shysana:  Have you tested again?!?  Keeping my fingers crossed! :)mrspace:  I remember just before I went away, you mentioned that you run a website called Cafe Press.  Is it yours or do you manage it?  I thought it was pretty cool 'cause I've actually been on that site! :)Well, our thread is getting pretty long & takes a while to open up, so I'm gonna start a new one either tonight or tomorrow morning.  Keep an eye out for it & have a great Sunday!!! :)",
            "post_id": "3770490",
            "timestamp": "1229276331",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Posted sonogram pics.. check them out and give your opinion about baby growth.",
            "post_id": "3770839",
            "timestamp": "1229283997",
            "user_id": "user_574521",
            "user_link": "/personal_pages/user/574521",
            "votes": "0"
        },
        {
            "answer": "im cd 5 now mommyin09",
            "post_id": "3771144",
            "timestamp": "1229290703",
            "user_id": "user_494640",
            "user_link": "/personal_pages/user/494640",
            "votes": "0"
        },
        {
            "answer": "Good afternoon ladies.I hope everyone is having a great weekend.  I have been very lazy which is good :)  My sister came to visit yesterday and we had a really nice time.  I haven't seen her since her horse passed away so it was nice to support each othere with everything we are going through.  I have been living in my PJs and having a lot of naps!  So hopefully this will help my little guys stick.  I feel the same as I have for most of the week - bloated with sore bbs.  I am also on progesterone and estrogen which are probably causing some of this.Mommyin09 - Glad to have you back and glad you had a nice little trip with dh.  I think it is so important to celebrate occasions like that!  How are you feeling?  Can you believe you are almost half way through the tww??Luvkayln - I will definitely be thinking of you and Kayln on Wednesday.  I know it will be a sad day for you and dh :( and it is so wonderful that your family will be there to celebrate the date and support you.  The angel sounds precious.Guesito - Congrats again.  The pics look great.  That little guy/gal is definitely growing!  I'm sure your appt this week will reassure you that everything is just fine.Candie - Praying for you friend!  I really hope that you get your bfp this week!!Arlotheslug - Still thinking of and missing you!  Come back when you are ready.Shyshana - What's the news??  Bfp??Keyan - I hope your u/s went well!!Well enjoy the rest of your Sunday friends and hope that we see some more bfps this week!Stacey",
            "post_id": "3771149",
            "timestamp": "1229290764",
            "user_id": "user_473246",
            "user_link": "/personal_pages/user/473246",
            "votes": "0"
        },
        {
            "answer": "Today is rough for me.  2 yrs ago I lost my Mom.  I have tried to stay busy.Yesterday wasn't better.  RE and I decided that today is CD 3 because Thursday I thought I started, but then stopped.  So, tmw.(MON) I will be CD 4.  Since I started seeing my RE I have had a cyst on my right.  It hasn't gotten any bigger nor smaller.  Yesterday, that cyst or whatever it may be was on the right along with another.  On the left I had a huge cyst (over 60).  We were amazed... when I went in on CD 15 & 17 nothing was even on the left.  Where could that have come from?  The last 2 cycles (the ones I have been with my RE) I have O'd from my blocked side.  This cycle, I cannot take clomid of course.  I am very disappointed.  This would have been a great cycle to be more aggressive since I have a full 2 weeks off of school.  Now, I started BC.  I have pre-op on 12/29 and a LAP. on 12/30.  She said she normally would wait a couple of more months, but since I have this time off of work now would be a good time to go in a see what is going on.   So, what have your experiences been with Lap?  She said that we could start TTC again the next cycle?  I have heard that after this surgery and after getting of BC you can be more fertile. True? I am so lost....",
            "post_id": "3771406",
            "timestamp": "1229297765",
            "user_id": "user_465737",
            "user_link": "/personal_pages/user/465737",
            "votes": "0"
        },
        {
            "answer": "SOrry I havent been around but have been busy all weekend long with the company XMas party and other parties an events soooooo this is the first time I have had a chance to sit and breath .   So real qwik No AF and no BFP spk with my OBGYN on fri and she wanted to wait an see if AF showed up during the weekend since i have  had cramps but as yet nothing soo I am gonna call on monday again for an apt and to have blood test done so tht i can ask to have my period started again with provera an maybe a higher dose of clomid to increase chances.  So lets see what happends.",
            "post_id": "3771518",
            "timestamp": "1229302554",
            "user_id": "user_644605",
            "user_link": "/personal_pages/user/644605",
            "votes": "0"
        }
    ],
    "post_id": "3727400",
    "question": "A Strong Woman VS. A Woman Of StrengthA strong woman works out everyday to keep her body in shape…But a woman of strength builds relationships to keep her soul in shape.A strong woman isn't afraid of anything…But a woman of strength shows courage in the midst of fear.A strong woman won't let anyone get the better of her…But a woman of strength gives the best of herself to everyone.A strong woman makes mistakes and avoids the same in the future…A woman of strength realiizes life's mistakes can also be unexpected blessings and capitalizes on them.A strong woman wears a look of confidence on her face…But a woman of strength wears grace.A strong woman has faith that she is strong enough for the journey…But a woman of strength has faith that it is in the journey that she will become strong.Author Unknown************************************************Michelle:  (Offer support & prayers!!!)Leighanne: BFP - 28 weeks (u/s 12/6)vortex: BFP - 19 weeks (u/s,12/2)Joyce: BFP - 13 weeks (doc appt 12/16)icierain: BFPJessie:  BFP 8 weeksArmyprincess: BFP - 6? weeksGuesito:  BFP 6 weeks (u/s Today!!!)Stacey:  C6 (Retrieval 12/9)kmcarino:  CD7Mommyin09:  CD10Candie:  CD11Hoping4_2: CD12ad_06: CD16Hannah1505:  CD16jmh2005:  CD16 (u/s today!)wishandaprayer: CD19naf38:  CD21arlotheslug:  CD23mamatina:  CD27rachjas:  4dpoSexykeme78: 5dpopyar:  6dpiuiluvkayln: 6dpoShysana: 7dpoLinaG:  10dpo (u/s of kidneys today)Keyan:  12dpotracy4751: 14dpt (beta yesterday)************************************************jmh2005:  Oh, I'm so sorry!  I know how disappointing it is when things don't work out right.  Hopefully the Femara will help get this straight.  Hang in there!!!ad_06:  I'm sorry for all you've gone through!  I'm sure it will be difficult to have to pay for your RE up front, so best wishes to you this month :)Shysana:  Feel better!  I've had a cold since last week & I'm getting closer to O.  It doesn't make it easy to be \"in the mood\" ;-)  Take care!Guesito:  Great news!  I'm so happy for you & dh !!! :) I'm sure you're ecstatic to have seen the sac :)Mamatina:  Good for you!  I'm so glad your body's getting back on track.  It's been a long road for you!Candie:  Are you using opks yet?Hannah:  Congrats on the new job :)",
    "timestamp": "1228270166",
    "title": "Calling all Women of Strength...",
    "user_id": "user_299260",
    "user_link": "/personal_pages/user/299260"
}