{
    "answers": [
        {
            "answer": "I have this same problem.  I've had it for over a year and have every test 3 time and even had reflux (fundo) surgery.  Nothing has helped.  I read some other entries on MedHelp from 2004 and 2006 from people who have the same thing.  I'm wondering if they were helped or if anyone has been treated for this. I am going to the cleveland clinic in a month, but a month seems like a year and not being able to breathe is driving me crazy!!Please email at ***@****  (my girlfriends address).  Please Help.",
            "post_id": "3260381",
            "timestamp": "1218321721",
            "user_id": "user_583911",
            "user_link": "/personal_pages/user/583911",
            "votes": "0"
        },
        {
            "answer": "I have exactly the same symptoms.  I am 44 years old and have been dealing with this on and off for at least 10 years...it seems to occur more often as I get older.  I went to the doctor and was told it was GERD and then was given acid reflux medication.  The doctors also seem to dismiss my symptoms because I am overall very heathy.  I did have a problem with hives about 2 years ago and as weird as it seems it almost feels like I have some type of inflamation (like hives) in my lungs that makes it impossible to breath deeply.  It will suddenly disappear then return again.  I have tried cutting out alcohol, artificial sweetners, all allergy medication, diet soda, etc....and I can't get a direct link to anything that I'm injesting.  I plan on purchasing a air purifier to see if that helps....have you tried that?",
            "post_id": "3347180",
            "timestamp": "1220192925",
            "user_id": "user_605955",
            "user_link": "/personal_pages/user/605955",
            "votes": "0"
        },
        {
            "answer": "hi everyone...i have been unable to breath satisfyingly(if thats a word) for about 15 years now. I have been though just about every lung/cardio test out there.  I was diagnosed with mitral valve prolapse and was told that my shortness of breathe had nothing to with this diagnosis but have read that some people do experience shortness of breathe, so ruling out mitral valve prolaspe(MVP) might be something you want to try. I would discribe my shortness of breathe as trying to suck in air and being stopped half way and being full when it is at its worst..  Its with me everyday and some days its worse.  It seems to get worse a week or so before my menstrual cycle.  I quit smoking at the on set of this symptom, i too have tried different to relief this feeling. I hope this may be helpful to some of you...also if you find a way to relief this feeling of breathlessness, please let me know.",
            "post_id": "3349736",
            "timestamp": "1220248142",
            "user_id": "user_606537",
            "user_link": "/personal_pages/user/606537",
            "votes": "0"
        },
        {
            "answer": "Hello all, I just turned 33 last month and am suffering from the same problem. I dont know where it came from, I wasnt nor had I been sick when it started..  For me it seems to come and go with out warning and when its happening I find that I become very light headed from trying to constantly take in a deep breath, its driving me crazy and the Dr's cant seem to find anything wrong. Im going in for more testing next week, I will post my findings, if any..",
            "post_id": "3355645",
            "timestamp": "1220387241",
            "user_id": "user_608002",
            "user_link": "/personal_pages/user/608002",
            "votes": "0"
        },
        {
            "answer": "My problems started ten years ago at age 30 when I suddenly felt myself getting out of breath while playing basketball. It seemed that any intense physical exertion would bring on feelings of breathlessness and it began to effect my play and my life psychologically. I became afraid of running and walking up more than one flight of stairs. Also, the fact that it came out of nowhere really freaked me out and I started having anxiety about diseases I might have and avoided most physical activity.I went to my doctor and was diagnosed with having GERD and given Prevacid. I tried this and then tried Nexium and my acid reflux and coughing at night disappeared but the medicine did nothing to help my shortness of breath. I was then diagnosed as having exercise induced asthma and given an inhaler. It didn't work. I was then sent to a pulmonologist and run through a series of breathing tests and even an echogram of my chest and x-ray of my lungs. They found nothing and prescribed a different inhaler which didn't show any sign of helping even while I was taking the tests. For some reason they gave it to me anyway and I went away frustrated. Next I was sent to the cardiologist and he ran me through an EKG, stress test on the treadmill, echocardiogram before and afterexertion. All results came back as negative with an excellent ejection fraction. They did find some PVCs but said they were nothing to worry about. I went away feeling better about my heart but still had the episodes of shortness of breath.After all of this, I finally decided to take control of the situation myself. I began an intense cardio workout program and lost weight. I changed my diet and did everything I could think of to become more healthy. At first I struggled with the conditioning and my own anxiety of losing my breath. The shortness of breath over the years had almost developed into a phobia of hard exercise. I hyperventilated many times in the beginning but after a few weeks I felt stronger and better. After a few months I was able to play basketball again and run like I used to without getting too winded. I had to rebuild my confidence as well as my fitness but everything seemed to be going OK. The only problem was that I still occasionally got the sensation of shortness of breath even though I was well conditioned and frequently became light headed as well. I became frustrated one day and did a work out even while feeling short of breath and seemed to feel better once I got moving. This got me wondering so I went to the pulmonologist while having another shortness of breath attack and my blood oxygen levels tested. They came back normal even though I felt like I wasn't getting enough air.Today, three years later, I'm even more confused than ever. I'm left wondering if I am really short of breath or is anxiety causing me to feel that way? I also wonder if the skipped beats of my heart (PVCs) have anything to do with the breathlessness sensations. I feel better than I did before beginning my conditioning but I still don't feel like I could just up and run at full speed without grabbing my knees. I also don't feel like I've solved the problem completely - only masked it by getting in better shape. If anyone has any answers, please pass them along. I've read many posts and the common thread seems to be that the problem begins in most around the age of 30. What's up with that I wonder?",
            "post_id": "3355894",
            "timestamp": "1220390653",
            "user_id": "user_607287",
            "user_link": "/personal_pages/user/607287",
            "votes": "0"
        },
        {
            "answer": "I'm 23 and have been having the same problem for years.  I can be sitting calmly studying (not stressing) and suddenly can't breathe, or running and just can't get enough air.  It's not the out-of-shape gasping, it's that no matter how deeply or often I take a breath my lungs just won't take enough oxygen out of it.  If it happens on the treadmill I check my heart rate and it's relatively normal. If anyone sees a doctor who does anything other than prescribe an inhaler (which also does nothing but give me a wet cough) please let me know what they said!",
            "post_id": "3410029",
            "timestamp": "1221529657",
            "user_id": "user_621317",
            "user_link": "/personal_pages/user/621317",
            "votes": "0"
        },
        {
            "answer": "I have recently been having the same problem. My doc thinks they are panic attacks. But it seems to last all day long. Good luck everyone!",
            "post_id": "3419222",
            "timestamp": "1221708289",
            "user_id": "user_623603",
            "user_link": "/personal_pages/user/623603",
            "votes": "0"
        },
        {
            "answer": "Do doctors ever answer the questions asked?",
            "post_id": "3426306",
            "timestamp": "1221855716",
            "user_id": "user_625283",
            "user_link": "/personal_pages/user/625283",
            "votes": "0"
        },
        {
            "answer": "I am 26. I have just recently been dealing with the same problem. The problem started during allergy season, which for me is late April - early May.I thought at first that it was due to a sinus infection. I am going to try and take some antibiotics because the heavy breathing started after I had a bacterial infection in my nose. I am interested to see if antibiotics will work.I have also been taking an allergy medication called Chlorpheniramine. I have noticed that this particular over-the-counter medication works the best for me and is better than any other allergy medicines I have used. It really helps relieve the symptoms associated with having trouble breathing. If I take one in the morning, about 7:00am or 8:00am, I am usually good (no problems with heavy breathing) until 4:00pm or 5:00pm in the afternoon. At this time, the heavy breathing starts and it seems to continue, until I take another Chlorpheniramine. I usually take 2 Chorpheniramine a day. I know this might sound like a lot of medication for some, but it is not that much.As for panic attacks, I have been known to experience these too. I am sure that a panic attack, associated with worrying obsessively about not being able to get a hearty breath of air, doesn't help make it easier to breathe.Here is some information on Chlorpheniramine (If you want it. I am not a doctor or a pharmacist, so please don't take my word on it. I know it has worked for me and after you read more about it, one day it might work for you. I hope this helps.):Chlorpheniramine relieves red, itchy, watery eyes; sneezing; itchy nose or throat; and runny nose caused by allergies, hay fever, and the common cold in adults and children over age 2. Chlorpheniramine should not be given to children younger than 2 years old because it may cause serious or life-threatening side effects in young children. Chlorpheniramine should not be given to children older than 2 years old but younger than 6 years old unless prescribed by a doctor. Chlorpheniramine tablets, capsules, chewable tablets and liquid should be used carefully in children who are 6-11 years old; the extended-release tablets and extended-release capsules should not be given to children in this age group unless prescribed by a doctor. Chlorpheniramine will only relieve the symptoms of cold or allergies but will not treat the cause of the symptoms or speed recovery. Chlorpheniramine is in a class of medications called antihistamines. It works by blocking the action of histamine, a substance in the body that causes allergic symptoms.",
            "post_id": "3428501",
            "timestamp": "1221904117",
            "user_id": "user_625863",
            "user_link": "/personal_pages/user/625863",
            "votes": "0"
        },
        {
            "answer": "I've started having this problem.  I cant seem to get enough air to really fill my lungs.  I am yawning constantly to try to get a full breath, it feels good to yawn really big, and the feeling of not enough air comes right back.  Sometimes its better than others.  I think I am making the problem worse by concentrating on it also.  Its very uncomfortable.I recently lost weight, I exercise rigorously 6 days a week.  I do have hypertension, and hypothyroid, but both are controlled by medication.",
            "post_id": "3459238",
            "timestamp": "1222532235",
            "user_id": "user_633180",
            "user_link": "/personal_pages/user/633180",
            "votes": "0"
        },
        {
            "answer": "I wish someone had an idea of what it might be. I am 27 and I do the same things you all do to try and cope with it. It is pretty bad during allergy season, but I really don't think that's all it could be. My doctor at one point said it's because I'm focusing on it, and it's partially habit. Along with yawning to get a good, deep breath, I've also noticed a tend to burp a lot more as of late as well. Even when I drink, the way I swallow seems to be different from how it used to be.I hope we all get an answer soon.",
            "post_id": "3507610",
            "timestamp": "1223516676",
            "user_id": "user_645210",
            "user_link": "/personal_pages/user/645210",
            "votes": "0"
        },
        {
            "answer": "Some thoughts... not answers.Look into sleep apnea.Excess weight on stomach compresses lungs.Do you spend a lot of time in a recliner ?Alcohol use ?Eating too late in the pm ?Personal experience : If I suddenly try to run for a bus (I'm 66) or up  a few stairs I can get seriously out of breath, dragging air in as if I'm about to die.My GP recenly set me up to have a stress test ( on a sloped treadmill) but after describing to the  the above (bus & stairs) the stress folks aid that a stress test would not be suitable as they needed me to get up a good 'head of steam' in order to get useful data from my heart under stress and they recommended a pulmenary ( lung) test.Before the appointment came around I was at a local alternative café's music fest and ended up, after a few beers, jumping up and down in the front row of the crowded café right in front of the band, dancing my merry heart out, just like the 'old days'.The next day, somewhat worn out from my fun night, I suddenly realised \"Hell..there can't be much wrong with my lungs if I could do that !\" as I recall sucking in air pretty powerfully without much problem as I boogied, and I concluded that \"It must be 'cos I'm so out of shape and overweight (210 lbs).NB: I WAS dancing upright and not leaning over as I would be when going up stairs or hurrying to catch the bus.So I've cancelled the test for now and will be working on losing weight and exercizing.I'm fairly sure that I do have pretty serious sleep apnea* too where breathing stops many times during the night. My pillow is a mess from drooling  I toss and turn a lot too. I suffer from anxiety too.I also drink quite a bit of wine in the evening which is not good and disturbs my sleep. I also think I spend too much time in my recliner.Dylan (***@****)*I was tested 7 years ago with 'inconclusive' results as I had , unfortunately, gotten hyped up at my daughter's championship ice hockey game that evening and could not sleep for the test. I've had to postpone retesting this year as there is a $400 copay I cannot afford right now.",
            "post_id": "3545015",
            "timestamp": "1224331868",
            "user_id": "user_654713",
            "user_link": "/personal_pages/user/654713",
            "votes": "0"
        },
        {
            "answer": "I am having the same problem and i am very frustrated. I am now beginning to wonder if it is allergies.Im 26. i have been an athlete my whole life through college and am still very active in sports and running, not overweight, weight is not around my mid section, etc. Here are my symptoms:earlier this summer i was having difficulty breathing...only occured at night though. i couldnt lay down. i would have to sleep propped up on 2 or three pillows. I felt like there was something squeezing my neck and throat. I went away to the mountains...i slept next to a window and caught a pretty bad cold...lost my voice, coughing a lot.After the cold went away, i began to have even more difficulty breathing. i am training for a 1/2 marathon and noticed it during my work out---which was new, so this is when i decided to get it checked out. so i went to see my doctor who referred me to a cardiologist who referred me to a pulmonologist.i had echo done on my heart--normalchest xray--normalblood tests--normal(still waiting for the results of the allergy test though)so like the other post said...i feel better about my heart, and my health but i still cant breathe.Pulmonary function tests where the doctor said \"it could be asthma, very mild though\" he prescribed singulair and an albuterol inhaler for before i run. sometimes taking the inhaler can make me lightheaded. so i dont like using it.the inhaler and singular definitely helped with the tightness i was feeling in my lower neck and upper chest, but not with the breathing!and some days its better than others. and i actually do feel a little better after i do some mild cardio...but who wants to work out when they cant breathe???!!!! But it honestly is better on days i work out than on days i dont.oh, also a did experience a bit of heartburn...and i think i had a panic attack (which was self induced i believe cuz i was so worried about not breathing) which led me to go to urgent care one time. the doctor gave me some stuff for heartburn and acid relux and so then i thought i had GERD...which can also induce asthma...so i dealt with that and now my heartburn is gone...but breathing is still not normal.could be VCD? but i hear that VCD usually happens mostly in the morning...im am a singer and i can sing fine in the morning. my vocal coach hasnt noticed any changes in my voice...but she did notice me clearing my throat a lot which led her to suspect allergies.so i am going to wait for the allergy test results...and pray that its allergies and some sort of antihistamine will clear it up.I am suppose to go for a follow up doctor's appointment next week and will post again with the doctors findings.oh yea...im suppose to get a CT scan of my chest and throat, just waiting for the insurance to approve that.",
            "post_id": "3570242",
            "timestamp": "1224855120",
            "user_id": "user_661011",
            "user_link": "/personal_pages/user/661011",
            "votes": "0"
        },
        {
            "answer": "I know how you all feel. I had this problem, and no, the doctors don't know what it is, because if it's not in their text books they can't figure it out, but I did. This may not be everybody's cause, but it is worth checking into.Do you guys consume any form of aspartame, sucralose, etc, you know the low sugar diet drinks and many processed foods with MSG?This was my problem; I discovered that aspartame is a toxin, and it wreaks havoc on people. It is converted to formaldehyde once it breaks down in the body. Formaldehyde by the way is the substance used to embalm dead people.If you have anything that contains any of these artificial sweetners, eliminate them immediately; and yes, your neighbor, or best friend may have been drinking them for years without this problem, but not to worry, their symptoms of a different nature will creep up on them, there are a slew of symptoms that have been reported to the Fda regarding this toxin. And please don't tell me that it was 'approved' by the FDA. The FDA is not to be trusted with your health.The first step is to immediately stop using these products and then do some sort of toxin cleanse.Don't waste your time going to the doctor on this one, they have no clue.Most of our illnesses come from a poor diet and fixing that fixes most of them.Do yourself a favor and eat toxin free.Best of luck to you all.If you want to talk about this further, email me at ***@****",
            "post_id": "3685289",
            "timestamp": "1227255992",
            "user_id": "user_689702",
            "user_link": "/personal_pages/user/689702",
            "votes": "0"
        },
        {
            "answer": "hi im only 16 and im having these poblems and it's driving me crazy iv'e been expieriencing these symptoms for 2 years now and i have no idea what to do ive gotten so many tests done and the doctors all say im fine, honestly this kind of scares me. i am a healthy weight and im very active. so i dont think that its because im unhealthy. i can just sit here and its like i cant take in enough air and ill have to brace myself to take a deep breath or like do a really big yawn. i have no idea whats wrong and latley its been getting worse espcecially at night it takes forever to fall asleep. i really dont want to put up with this forever i really wanna know what is wrong",
            "post_id": "4005166",
            "timestamp": "1235010159",
            "user_id": "user_769930",
            "user_link": "/personal_pages/user/769930",
            "votes": "0"
        },
        {
            "answer": "I had this very same problem.  For no apparent reason I had these bouts of not being able to take a deep breath.  My troubles with breathing went from occasional, to... constant.  My answer for why this was happening came when I saw a chiropractor.  I knew that back muscles are an issue when experiencing some types of breathing problems, so, long story short... I went to a chiropractor for a consult and was told that certain spots, if misaligned, may result in trouble breathing.  There is actually an area, if misaligned, that will cause breathing problems during exercise that may present symptoms similar to exercise induced asthma.   I had nothing to lose, so I started with treatment.  An X-ray, and weekly (x3 to start with) \"adjustments\".  Within 2 adjustments I had noticed I could breath \"normally\".  No kidding.I had visited forums like this one a TON of times, trying to figure out WHY I couldn't take a deep breath.  It was so unnerving to me.  It had me antsy and frustrated... I just started my treatments/(adjustments) a couple of weeks ago and I'm so relieved that I'm touring the boards I sought help on to spread the word about how I found an answer to my problem.  Maybe it can help others.  I had visited my physician about this problem a couple of times, but never once was this angle approached.Anyway, I hope this helps someone.About me - I'm a mid 30's female.  Pretty healthy.  Normal height and weight for my age.  Active... no health problems, really...",
            "post_id": "4054323",
            "timestamp": "1236179997",
            "user_id": "user_783246",
            "user_link": "/personal_pages/user/783246",
            "votes": "0"
        },
        {
            "answer": "I am going to try cutting out the toxins and a chiropractic adjustment to see if it helps.  I'm tired of living like this too.  Good luck to everyone above.  Hope you get this issue resolved soon.  It is a very frustrating feeling to have.",
            "post_id": "4069975",
            "timestamp": "1236545225",
            "user_id": "user_787460",
            "user_link": "/personal_pages/user/787460",
            "votes": "0"
        },
        {
            "answer": "Okay, had to go somewhere looking for an answer.  also have the deep breath problem, now for about a month, last fall for about 6 weeks.  It went away and now is back.  I am 52, female, slim,  very healthy, runner, swimmer, healthy foods, occassional red wine, plenty of sleep, good blood work, low blood pressure, etc, picture of health.  Have been this way forever.  Went to Dr. in fall, they said I was healthy and would not even order a stress test.  Same symptoms as others describe, can't get air all the way  into lungs without straining or yawning.  Now is constant, whether sitting at desk or running 5 miles.   Kind of thinking allergy related, but not sure how to test?  Don't take any medications and don't really want to just start allergy meds if that isn't it.   And I have never been allergic to anything before. Very maddening at this point.Anybody have this problem associated with allergies?",
            "post_id": "4408833",
            "timestamp": "1241038537",
            "user_id": "user_888631",
            "user_link": "/personal_pages/user/888631",
            "votes": "0"
        },
        {
            "answer": "Do any of you people suffering form this constantly hold your stomach in because of a belly/gut?  I am thinking this could be an issue.",
            "post_id": "4423308",
            "timestamp": "1241399956",
            "user_id": "user_893067",
            "user_link": "/personal_pages/user/893067",
            "votes": "0"
        },
        {
            "answer": "Im 23 years old and I've been having this same problem as most of you for at least 10 years. I've been to the doctor many years ago and was diagnosed with a mild form of asthma related to allergies (although I do not have allergies). I was given an albuterol (sp?) inhaler and singular (perscription allergy/asthma meds). They didn't seem to help any.I also have anxiety problems and panic attacks which don't help with the breathing. So its hard for me to determine whether the \"not being able to get a deep breath\" is from a medical condition or anxiety.I just went to the doctor yesterday and they tested to see if I had asthma or not... it turned up to be very mild so they weren't sure if this is what was causing the problem. I also have Mitro Valve Prolapse (heart murmmer). My doctor said this could be a symptom of this and if it is it could cause problems in the future (so if any of you guys also have this I would get it checked out by getting an ECHO test done) I am getting this test done next week. My doctor said if it isn't this then it may just be anxiety. If anyone finds anything out let me know please!",
            "post_id": "4438226",
            "timestamp": "1241722930",
            "user_id": "user_897595",
            "user_link": "/personal_pages/user/897595",
            "votes": "0"
        },
        {
            "answer": "I am 27 years old. This, as you name it 'condition', is making my life hell for over 4 years now. First time it happened, I was still jogging every night. It just stroke me one day and it destroyed my whole summer. I was suffering a lot those days, grasping for the air, dreaming for that one, deep precious breath that will change everything. And then I saw so many doctors. And it turned out - NOTHING. I am realizing now that this comes suddenly but it usually has long history behind (anxiety is not always the case,you may be under some sort of psycho-physical pressure). In my case it starts with mental extortion (my studies for example)... In the first stage of the 'condition' I usually go through panic attacks which are the worst of all, then I slowly develop serious breathing problems. For example this spring it started with two weeks panic attacks, I would be always almost fainting, really scary. But with the time I understood that nothing will happen to me and panic episodes vanished. But breathing issue remained to bother me and it developed other, even more disturbing health problems. Trying to cope with my breathing, I started to swallow air which caused reflux (my eating is horror now, I am burping all the time). Sometimes I even feel that my lungs are so run out and irritated....that they can not fight with this anymore. So heavy and tired...And just one month ago everything was perfectly fine.",
            "post_id": "4458945",
            "timestamp": "1242253031",
            "user_id": "user_904195",
            "user_link": "/personal_pages/user/904195",
            "votes": "0"
        },
        {
            "answer": "Xanax, chiropractor, vitamins, large doses of vitamins, prayer, patience and faith.I pray for us allGeoffrey",
            "post_id": "4458985",
            "timestamp": "1242254009",
            "user_id": "user_797615",
            "user_link": "/personal_pages/user/797615",
            "votes": "0"
        },
        {
            "answer": "Yes, patience and belief is crucial...",
            "post_id": "4459025",
            "timestamp": "1242254886",
            "user_id": "user_904195",
            "user_link": "/personal_pages/user/904195",
            "votes": "0"
        },
        {
            "answer": "I've been recently feeling like  i have trouble breathing, im only19 years old. I have to yawn every couple of seconds to make sure im not going to stop breathing. I'm also haveing trouble eating, when i eat something or drink something i get this pressure in my chest like i cant burp and its so painful it feels like i cant breath. I've been diagnosed with anxiety im on Xanax and two kinds of medication for that, but none of it seems to help my breathing. I dont understand where this came from i was doing great with the whole anxiety thing and then all of the sudden I have been trouble getting a deep breath.I'm not haveing the panic attacks anymore just this uncomfortable breathing. I'm finding it very hard to do my normal routine, i stopped exercising and smoking because i think i might die if i do either. Please if anyone else is haveing these type of symptoms let me know thank youAshley",
            "post_id": "4480521",
            "timestamp": "1242786891",
            "user_id": "user_910962",
            "user_link": "/personal_pages/user/910962",
            "votes": "0"
        },
        {
            "answer": "46 yrs old - very healthy - slim build - hard worker - raised with good value system.  I'm sitting here at work trying to sit straighter or taller or forward... something that would allow me to get that full breath with a deep yawn... when I decided to run a search on \"can't get a deep breath\".  I was directed to this site.  Amazing.  I wouldn't have believed it myself... but... as I started to read each and every post on this site - I was smiling to myself and even laughing out loud sometimes!  As I got to the last post - I realized I had been breathing normal throughout the entire \"read\".  I truly believe anxiety is the cause of my breathing problem - even when I don't feel like I am anxious.  I look at what is happening in my life... and even though I'm dealing with everything just fine.  I think my body is telling me that it isn't designed to multi-task quite so much!  My post is to \"Thank\" all of you for sharing.  Because just knowing I'm not the only one dealing with this - truly has helped me.  Thank you.  Renee",
            "post_id": "4482915",
            "timestamp": "1242845731",
            "user_id": "user_911692",
            "user_link": "/personal_pages/user/911692",
            "votes": "0"
        },
        {
            "answer": "Ahhhh...To read these comments makes me feel like I am not losing my mind!  I had a sudden onset on feeling as if I could not catch my breath 6 weeks ago.  I ended up at uregent care and was treated for a flare up of asthma that I have not had problems with since I was a kid, and I am now 36.  I went to the Dr. and after Prednisone tapers, Zithromax,  and Levaquin and more steroids and inhalers, I am off the meds (which, now I believe that I felt worse on them than before I started them) and still having episodes of feeling as though I cannot get my breath which in turn make it worse because then anxiety kicks in!  I have been racking my brain to figure out what in the world brought all of this on.  I am 36 and a slim build.  I was always and athlete and very active but have not worked out much after having 3 childre in 4.5 years.  Anyway, I did recall having some back issues that seemed to have resolved, however the times that I was in discomfort were not long before all of this started.  I recently looked online and viewed chiropratic sites.  Anyway I decided to schedule an eval at an alternative healing chiropractor to see if this might help.  I am praying it does!  I also believe that panic is significantly related to diet and a lack of certain nutrients in my case, such as magnesium.  Oh well, I'm keeping my fingers crossed and praying for all of you.  I just want to enjoy life again!Prayers to all!Rita",
            "post_id": "4624076",
            "timestamp": "1246674821",
            "user_id": "user_957449",
            "user_link": "/personal_pages/user/957449",
            "votes": "0"
        },
        {
            "answer": "I hope this might help someone.  I have been suffering from similar symptoms for about 10 months.  I always felt like I had to yawn and couldn't get a satisfying breath.  My neck, back, & chest were always sore.  After tons of research and trying different things, I found something called \"Chronic Hyperventilation Syndrome\".  I didn't feel like I was hyperventilating, but when I looked up the symptoms, it was like a check list of everything I had been feeling.  There is a book called \"Self Help for Hyperventilation Syndrome\" written by Dinah Bradley.  I picked one up on Amazon for about $12.  She gives breathing excercises that retrain your body to breath from your diaphram.  I was totally shocked that within 1 week of doing the excercises my yawning was gone.  It has been 2 months now and no more frequent yawning.  I am still dealing with the tension in my neck & upper back, but she also recommends doing relaxation techniques to get rid of that.  I wish I could have found this information months earlier.  I hope this helps someone!",
            "post_id": "4634902",
            "timestamp": "1246997640",
            "user_id": "user_960839",
            "user_link": "/personal_pages/user/960839",
            "votes": "0"
        },
        {
            "answer": "hi. I SUGGEST u to go for a blood serology  and check ASO TITER and ESR. Myself also  find difficult to breath. my aso level is high. get  back to me the result",
            "post_id": "4671251",
            "timestamp": "1247897806",
            "user_id": "user_971863",
            "user_link": "/personal_pages/user/971863",
            "votes": "0"
        },
        {
            "answer": "Hi all.  I'm a 41 year old male and have had this problem since my early teens and like many of you, large chunks of my life have been made a misery with it affecting my social and even my sex life (who feels amarous when you can't even breathe?).  All the usual doctor visits and everything fine.  The only reason I am posting today is to give you all what I found to be a very helpful exercise which I think will give you some relief from the worst phase of the cycle.  I was driving from Dover to my home in North East England the other day going through 'worst phase' and found I had nothing better to do than look at the remaining miles on my sat nav.  So I started telling myself 'I will not take a deep breath for fifteen miles'.  Often I couldn't wait but either way after fifteen miles I would take the deep breath then breathe out slowly through pursed lips.  As the miles wore on I started increasing the allowed miles. I realised after a couple of hours that whilst I was now struggling not taking a deep breath for 30 miles the original fifteen mile target was easy to reach in otherwords I had partially regulated my breathing manually and when I got home I realised I was in the more easy to live with latter cycle of the problem.  I am now approaching normal breathing phase a good few days earlier than I normally would.  I hope this helps some of you but it sure does prove that if I can change the cycle manually then we can beat this thing or at least take control of it even if this particular method doesn't work for everyone.  Best wishes and easy breathing to you all.",
            "post_id": "4705460",
            "timestamp": "1248772528",
            "user_id": "user_984253",
            "user_link": "/personal_pages/user/984253",
            "votes": "0"
        },
        {
            "answer": "Hello!Like others have mentioned before, it is a relief to know that i'm not the only one with these symptoms. Although it is distressing to see that nobody has recieved \"real\" help from doctors, and if they have, decided not to post it.I suffer from shortness of breath, yawning, and mild anxiety with shortness of breath.-26 years old, great health, nothing wrong with me physically.-Non-smoker, although occasionaly weed ( 1-2 times a month )-I do deal with the public, high stress situations, large crowds (being a drummer) and I do worry about things excessively, although usually to myself.-I work night shifts, alternating to weekend days :^(-I also work at a computer frequently too.My BEST advice:Is to speak with yourself, calm down and control your breathing attacks, remember that your not alone with this affliction and that you are getting more than enough air into your lungs.Slow your breathing down, relax and try meditation (NOT medication), backrubs, chiropractor, acupuncture, diet, vitamins, go on a vacation, become more physically active, laugh, enjoy life and finally DRINK MORE WATER, dehydration can cause many different things to your body.I hope this helped, and REMEMBER....You are most definetly NOT alone in this. You will be ok.Take care.",
            "post_id": "4717966",
            "timestamp": "1249035231",
            "user_id": "user_988125",
            "user_link": "/personal_pages/user/988125",
            "votes": "0"
        },
        {
            "answer": "I suffered with the sames problems as you all discribed, i could never get a full breath, yawning all the time, lightheadedness, it was constant for 7 years. i was sure there was something wrong with me but in the end i realised it was anxiety. After trying several meds it finially went. Although im still suffer anxiety i dont get short of breath anymore.I think we become aware of our breathing which can make things worse. I used to find that deep breathing made it worse. I take small slow breaths making sure you breath out fully and hold it there for a while. The easiest thing to do is to ignore your breathing then you wont feel the need to take deep breaths.This might not apply to everyone, but for me it was anxiety.",
            "post_id": "4718108",
            "timestamp": "1249041252",
            "user_id": "user_988139",
            "user_link": "/personal_pages/user/988139",
            "votes": "0"
        },
        {
            "answer": "I was having this problem for about two weeks. I felt a constant need to take a deep breath or yawn, but wasn't able to get one in most of the time. After reading through these forums I decided to try taking a multivitamin, since certain vitamin deficiencies can lead to shortness of breath.IT WORKED!I took my first vitamin yesterday morning, and that afternoon my need to constantly take a deep breath or yawn disappeared. I would advise everyone to at least give this a try, though it may take more than a day to disappear for some people. I can't believe I rushed to the doctor for EKGs and chest X-rays when all I really needed was some vitamins.",
            "post_id": "4731843",
            "timestamp": "1249401775",
            "user_id": "user_983508",
            "user_link": "/personal_pages/user/983508",
            "votes": "0"
        },
        {
            "answer": "I was dealing with this for years, and it was pure torture! All the same symptoms you all are describing. I could never get a deep breath, whether  I was just sitting in class or working out. I would constantly be yawning or hunching over trying to get a good breath, but it rarely worked. I was prescribed x-rays, blood tests, pulmonary tests, and they all showed nothing. I've been on albuterol, prednisone, advair, and many other meds. No relief. I was getting so fed up with this annoying problem.But....About three weeks ago, I stopped drinking 'sugar free' things such as diet pop and sugar free flavored coffee. Anything containing aspartame. For about the past two weeks, I have been breathing FINE. No problems whatsoever. All the symptoms I was feeling before have disappeared. I sincerely believe it was the aspartame causing my breathing problems. I've been drinking diet soda since I was little, about one can a day. I also work at a coffee shop, and whenever I had a drink, I would use the sugar free flavors.It feels so good to finally be able to breathe. I would definitely recommend cutting anything containing aspartame out of your diet. That stuff is pure poison..",
            "post_id": "4765112",
            "timestamp": "1250189635",
            "user_id": "user_1003469",
            "user_link": "/personal_pages/user/1003469",
            "votes": "0"
        },
        {
            "answer": "I have this problem too, and I have found minor relief using something I also use for my pollen allergies - budesonide inhaler. It's a cortisol-like steroid, and this problem might also be related to the adrenal gland.I will try multivitamins, although I do take these once every 2-3 days I still sometimes suffer from mild SOB/yawning. Oh wow I also get a lot of aspartame, I bet it's dangerous!! I'm not a fan of the sugar either though, I guess I will try replacing more of my drinking with water.",
            "post_id": "4765833",
            "timestamp": "1250200037",
            "user_id": "user_995519",
            "user_link": "/personal_pages/user/995519",
            "votes": "0"
        },
        {
            "answer": "Hooray for not being alone! I'm 17, healthy weight albeit a little shorter than most, and i've been dealing with this for 3-5 years.  I don't work out probably as much as i should, but exercise really doesn't have any effect on my symptoms. Same as everyone else, it feels like I can't breathe enough unless i yawn or spend a significant amount of time trying to draw air into my lungs. this is also accompanied by heavy nasal symptoms for me, my nose is always stuffed and clogged. I've been to several doctors, who tested me for allergies and then after a negative result tried three times to give me allergy prescriptions, which naturally did nothing. My ENT told me I was imagining it (not going back to him). I don't drink anything that might have aspartame in it, but I might try the natural foods things. I play the oboe every day so it's not like my lungs aren't getting the exercise either (not much time to breathe with the oboe :) it's similar to the breathing exercises described above one could say) I don't know what's going on, and I haven't heard anything helpful from anyone, but if anyone hears anything I'd certainly like to know!",
            "post_id": "4848440",
            "timestamp": "1252383563",
            "user_id": "user_1031691",
            "user_link": "/personal_pages/user/1031691",
            "votes": "0"
        },
        {
            "answer": "I am SOO GLAD I am not the only one dealing with this problem.  I am 22 years old, college student, normal weight (doctor thinks I could gain a few pounds, I disagree), about 5'2, could exercise more but I do get some and I am a panicker.  I do think the anxiety makes this problem worse but I think its in its own cateogry.  I have researched this and everything I can find relates it to \"overbreathing' or hyperventilating.  I really do not think this is the problem.  I have noticed that when I focus and take a deap breath and breathe out through my mouth I feel better but it comes back.Ok so as for the above answers to this problem:Vitamins - I take one everyday and it helps with anxiety actually but no luck on the breathingChiropractor - will definately try this out seeing as I have constant neck and back pain as it isAspartame - will cut this out of my diet and see if it helpsYoga - this is a new one I am adding....I have heard it is great for people with anxiety and that it will teach you how to breath all over again so yet again will post on this as wellHopefullly one or all of these will help and I can get over this but I am definately glad I am not the only one dealing with this it is a good feeling knowing you are not the odd man out....I will pray for everyone else and I hope I helped someone!!",
            "post_id": "4879019",
            "timestamp": "1253146662",
            "user_id": "user_1042225",
            "user_link": "/personal_pages/user/1042225",
            "votes": "0"
        },
        {
            "answer": "Hello Ladies,I was surprised to find this post, because me too I have had this SOB problem for years - too many years to count (I am 40).In my case, it can be caused by several things:- chemical, detergent, perfumes smells -  big time- nitrites in food (so no ham or hot dog for me)- no reason, though I now suspect that it's internal fatigue in my body that causes the SOB when I do nothingI tried many things, chiropractor included, to no avail. The ONLY medication that helps me are corticosteroids, but this is a poison, I once gained 30 lbs with a 2 weeks burst of steroids. To be taken only as a last resort.BUT in my opinion, the problem is hormone related. Namely thyroid and adrenal glands. I now know that I have hypothyroidism and am finally being treated for that. This is a very slow process, but after increasing my Armour Thyroid dosage, I started to have very good days last July with no SOB. Still far from being out of the woods because now Armour Thyroid cannot be found anymore, big shortage in the country, but I finally was prescribed a similar medication and hopefully we'll keep increasing my dose. We'll see if that really helps.Adrenal glands: my lab results are not perfect and I am currently looking for a doctor that will help me with that and agrees to try some medications targeting the adrenals.",
            "post_id": "4879440",
            "timestamp": "1253155414",
            "user_id": "user_803938",
            "user_link": "/personal_pages/user/803938",
            "votes": "0"
        },
        {
            "answer": "I have had this for years too. I do have low iron quite frequently. The doctor said this is connected.",
            "post_id": "4888532",
            "timestamp": "1253402672",
            "user_id": "user_1045543",
            "user_link": "/personal_pages/user/1045543",
            "votes": "0"
        },
        {
            "answer": "I'm in the same boat and I've been told it's everything from post-nasal drip to depression...ugh. I've taken all sorts of pills over the years because they've told me it's asthma,anxiety,panic attacks,etc. I quit using \"fake sugar\" years ago,I see chiropractors on a regular basis,etc.The only thing that has ever helped to a degree was the chiropractor.I'm tired of having to yawn to breathe and tired of feeling like I've just spent the last 24 hours crying...that's how mine kind of feels...my chest feels like it's been heaving from crying and when I yawn it's good for a few seconds.This *****.",
            "post_id": "4941040",
            "timestamp": "1254690841",
            "user_id": "user_209987",
            "user_link": "/personal_pages/user/209987",
            "votes": "0"
        },
        {
            "answer": "I am 28 years old, and have been smoking since I was 14. I have tried to quit smoking so many times, but then I get depressed or stressed out and  end up having a ciggarette. I think smoking is disgusting and i hate it. I feel like a very weak person for not being able to quit smoking so much earlier. But now I have been having trouble breathing and it is scaring me. For the past few weeks, I have constantly been taking deep breaths with the feeling of not getting enough oxygen. It feels like I am suffocating. It is keeping me up at night with the feeling of not being able to breathe. I smoke less than a pack every 2 days, but as I mentioned before I have been smoking for a long time now. I am wondering if anyone has any advice, I am so scared to go the doctor and be diagnosed with copd or some irreversible lung disease. I am trying despretely to quit smoking, and have succeeded in cutting back to just 3 ciggerettes a day. But does anyone have any suggestions of what this could be if I were lucky enough for this not being related to my smoking? Why are ciggerettes not banned? I will never understand why the most deadly and addictive drug there is is stiil legal. When I was 14 the advertisements for ciggarettes were not banned yet, and it was the cool thing to do. I wish I could go back in time and never of picked up that first cigg. My mom smoked then so it was easy to start that young. But besides COPD, ASTMA, or there any other possibilities that could be causing my feeling of suffocating at night, deep constant inspirations with the feeling of never getting enough oxygen? My worst fear is being diagnosed with copd at 28. And the worst part is knowing that I have done it to myself.",
            "post_id": "4959998",
            "timestamp": "1255136765",
            "user_id": "user_1068566",
            "user_link": "/personal_pages/user/1068566",
            "votes": "0"
        },
        {
            "answer": "My daughter has this problem and I did as well as a young child.  I had many tests when I showed symptoms and everything was normal.  I basically had to live with it.  Now, I rarely have the issue, but as I said, my daughter who just turned six is experiencing it.  Now that I see her struggling to get a deep breath it breaks my heart.  I plan on taking her to the doctor, but would like to suggest some direction for him, as I did all the asthma tests (as many have) all to come up normal.  Are GERD and anxiety good places to start?  Ugh, this is so frustrating, isn't it??",
            "post_id": "4971291",
            "timestamp": "1255459546",
            "user_id": "user_1072413",
            "user_link": "/personal_pages/user/1072413",
            "votes": "0"
        },
        {
            "answer": "I just started having this problem and feeling tired... saw doctor and he is ordering a sleep test. Sleep apnea (although more prevalent in overweight people can occur in any age group even if not overweight) is suspected and I will let you know. But there is more interest in sleep apnea because they are finding that if left untreated, it can lead to very serious problems down the road. So if you are snoring... if people are complaining, don't ignore it. Be checked out.",
            "post_id": "4999928",
            "timestamp": "1256177980",
            "user_id": "user_1081930",
            "user_link": "/personal_pages/user/1081930",
            "votes": "0"
        },
        {
            "answer": "I am coming to the conclusion that the shortness of breath issue has something to do with the Pancreas, GERD, or the liver... aka Bile or Cholesterol. I am more inclined to think it is the Pancreas and glycogen ... then GERD. These seem to be the two main culprits that would just induce or have sustained breathing challenges! PLEASE test/check these two areas comprehensively. Doctors are incompetent... we know significantly more than they do... they just know how to write prescriptions because some kid walked in the door and sold him or her on writing toxins to facilitate an early exit from this universe. Go figure!!!  Get a Fasting Blood sugar done... check it out... completely. Go over that Pancreas with a fine tooth comb. Make sure it is NOT Insulin Resistance Related. Stay away from diary products unless you go to a farm and get it all raw. Do NOT eat or consume anything pasteurized... it is POISON!!! Do NOT! You MUST safeguard your health. These doctors are not interested in doing it for us... they are too busy keeping the pharmaceutical companies in business.CHANGE your diet! Unfortunately, diet changes will STOP the breathing problems too. STAY away from anything that will turn into simple sugars... especially fructose.Yes, you can eat eggs, and bacon, and ham... however, I recommend turkey. Do NOT cook with Olive Oil it is unstable. Use peanut oil or coconut oil they can withstand heat and not produce radicals as Olive Oil does. Yes, you can eat butter... however I recommend Ghee. NO NOT all cholesterol is bad. The body requires Cholesterol too. Cholesterol problems are due to too much sugar... NOT fat. Those dumb morons for doctors keep telling us it is fat... no it's NOT it is SUGAR those IDIOTS! Carbs... keep your Carbs low, low, low, and I mean low. For example only eat brown rice.. do NOT dear touch white rice. Whole grain pasta a hand-full. Do NOT eat white regular pasta. Do NOT, oh my God! Eat flax bread... or a very dark pumpernickel... very little of this stuff. Yes, eat organic peanut butter it is okay. Count your calories ladies and gentleman. STOP eating sugar... STOP it cold. NO, not even in fruits unless it is muscadine grapes or blueberries. If you must have some sugar use green leaf stevia. Fruits are NOT good either. I know I use to eat them like there is no tomorrow... however, they loaded with useless sugar...yes they are. The damage it does on the body is not worth the few moments of pleasure. If you MUST eat fruit... only eat those local to the area... as those will help you in the metabolizing.  Sugar will kill you faster than fats will ... believe me. However, fats in moderation... just do NOT go anywhere near sugar. Sugar would kill you faster than a cigarette and we all know how our surgeon general warns against smoking but those bastards are NOT stopping the obesity caused by SUGAR in our country!Fruits included. Sugar, is sugar is sugar!!! I know I love chocolate cake... and dark chocolate... but it will induce a breathing challenge because the Pancreas will not allow it. NO, I am not Diabetic... thank God... however, my body is not willing to take on anymore toxins... SUGAR being the GREATEST destroyer of all time. Remember breathing requires energy... and if the lung is not getting enough energy source their will be challenges to breath! I'm not a doctor but I am able to deduce what could be happening! Just try it out guys and let me know. If any of you would like to visit my Website... let me know. No, it doesn't cost anything... it's like this Website however, I preach the gospel of living a LONG healthy life... in and effort to put the FDA and the pharmaceutical industry out of business. Those people do not care about a single life in this country or they would insist on natural products to stop cancer, diabetes, breathing issues, cholesterol challenges induced by too much sugar, prostate issues or human growth hormone and so on.",
            "post_id": "5004217",
            "timestamp": "1256271866",
            "user_id": "user_1083227",
            "user_link": "/personal_pages/user/1083227",
            "votes": "0"
        },
        {
            "answer": "I am 34 years old, and have been having breathing problem for 6 years.  When it first started it really scared me, but when I went to doctors and they told me I was fine, I had to calm down and tell myself, \"Ok, I'm alive, this *****, but whatever it is isn't killing me.\"  I am lucky enough to have fantastic insurance, and have been on a 6 year crusade to figure out what this is.  I have seen specialists in every field, and have been tested for everything under the sun without ANY success.  Honestly, I have had every breathing test imaginable (several times), ultrasounds of my heart, and every organ in my abdominal, CT's and MRI's of brain and spinal chord, allergy testing, a visit with 2 different ear nose and throat specialists to check for vocal chord disfunction, chiropractor visits, massages, and adustments with a D.O., sleep study, not to mention trying meditation, yoga, Alexander technique, etc.  I was even referred to Cleveland Clinic to which I had to drive 700 miles, and he said, \"Go home, stop wasting all of this insurance money, you're healthy.\"  Needless to say, I cried the entire 700 miles home.  Just about every doctor has mentioned that my problem is anxiety.  But, I've done all of the things (yoga, etc.) that would make me feel better for such a problem, and haven't had a problem with it in the past.  After 6 years of this shortness of breath, constant yawning, and tightness in my upper torso, I'm learning to COPE, but that is all due to me, not doctors.  And, if I've REALLY just banked on the idea that I'm going to have this forever (which I have) then that means my anxiety (if I ever had that) about it should be gone.  Which, in my opinion, means it was NEVER anxiety to begin with, if my breathing problem is still there but my worry about it is gone.There really is something wrong.  And, our numbers have to count for something.  We should each print off this thread and show our different doctors how many people have this problem, and that we aren't crazy, healthy, extremely rare (as this thread should prove,) or making things up to get drugs or attention.I wish you all the best of luck.  And, just remember, it ISN'T killing you.  So, try to stay calm.",
            "post_id": "5061736",
            "timestamp": "1257795836",
            "user_id": "user_1102175",
            "user_link": "/personal_pages/user/1102175",
            "votes": "0"
        },
        {
            "answer": "heyI'm 18, and going to recruit in about a week from now.I've had this problem since I begun going to high school. it used to come and go but now it just stays! it's so frostrating since there's absolutely nothing I can do to make it go away.knowing that so many people have this does comfort me but I do hope that a solution would be found to this problem soon. I can't go on living like this anymore..",
            "post_id": "5101882",
            "timestamp": "1258770504",
            "user_id": "user_1115297",
            "user_link": "/personal_pages/user/1115297",
            "votes": "0"
        },
        {
            "answer": "I have so much trouble with this too. I am 15, a healthy weight and excercise everyday, I can get a proper breath every 15 or so breaths, I have difficulty getting to sleep some nights and often feel dizzy.Reading these comments I think it might be dehydration or vitamin deficiency and even just slouching, but its really helped to know its not just me.",
            "post_id": "5107304",
            "timestamp": "1258938535",
            "user_id": "user_1117009",
            "user_link": "/personal_pages/user/1117009",
            "votes": "0"
        },
        {
            "answer": "I have had this problem since I was about 9 years old. At first my doctor diagnosed me with asthma and gave me an inhaler.I was also experiencing panic attacks as I feared that if I did not monitor my own breath, I would stop breathing and die. This is when my parents sent me to see a therapist. Therapist saw this problem as purely psychological and diagnosed me with anxiety and OCD. My doctor then put me on an SSRI, and my breathing problem disappeared.I am now 21 and no longer taking SSRIs, and the problem has returned. It is especially bad when I am in a quiet public setting and I don't want the people around me to notice my heavy breathing or constant yawning. It is my feeling that the more I think about it, the more anxiety is produced, and the problem is exacerbated.I recently talked to my current therapist about the issue, and she mentioned that often times people with depression have difficulty breathing and tend to sigh a lot. This makes sense to me.I just started taking Adderall for ADHD symptoms and I think it has perpetuated the breathing problem. It is known to increase anxiety and heart rate, both of which are related to shortness of breath.Not sure what I'm going to do about this... maybe go off the Adderall and start taking an SSRI again...I wish my parents had never started me on the antidepressants; I feel like using them all through my youth has caused my body to be inadequate at producing serotonin and so I'm pretty much dependent on drugs for the rest of my life.",
            "post_id": "5107399",
            "timestamp": "1258940532",
            "user_id": "user_1117040",
            "user_link": "/personal_pages/user/1117040",
            "votes": "0"
        },
        {
            "answer": "I have had this happen to me about 10 times, when I sudenly can't breathe in. What I do is DON'T PANIC! I try to remain calm, and little by little I can start to inhale. I don't think this is caused by alergies, I beleive it is stress. I don't know how to prevent these attacks, but at least I know how to control them. It never happens when  I am sleeping, so I guess it is Some kind of (panic attac).Just remember you are not alone! I just had  one of these 15 minutes ago, that's why I posted. Good luck to all, and HAPPY THANK'S GIVING.",
            "post_id": "5114694",
            "timestamp": "1259115552",
            "user_id": "user_1119199",
            "user_link": "/personal_pages/user/1119199",
            "votes": "0"
        },
        {
            "answer": "I am 35 and I have had trouble getting a full deep breath. I don't feel like it is a life threating thing because about every 30-40 breaths I can get a deep breath. It is not anxiety because I have had panic attacks several years ago and it is not the same thing.  I have recently went to my Dr. and she put me on Nexium for Acid reflux.  I have taken it now for 2 1/2 weeks and it hasn't done anything for my breathing. I have had an X-ray that was normal and a predinsone shot that didn't do much of anything. I have an appointment with a pulmonoligist in a few days.  I hope and pray he will have some answers.",
            "post_id": "5117048",
            "timestamp": "1259180169",
            "user_id": "user_1119905",
            "user_link": "/personal_pages/user/1119905",
            "votes": "0"
        },
        {
            "answer": "What an amazing discussion!  I too have had these symptoms my whole life (I'm a 44 year old female, good health, slim, non-smoker, do not use artificial sweeteners, moderate alcohol drinker, coffee drinker).  It's been particularly bad again lately and I was beginning to wonder if it was panic attacks, although I've never had them before.  These posts are giving me a lot to think about.A few of observations that I have not seen mentioned:1) 11 years ago, a doctor suggested I go off birth control pills.  That immediately helped.2) During both of my pregnancies, I had no breathing problems of this sort.3) One doctor indicated it was because of - I think I'm remembering this right - \"hyper-elasticity of the mesoderm layer\", i.e., my connective tissue is very loose, and that extends to the muscles around my lungs(?)  BTW - my heart and lungs, like many others above, also tested textbook perfect.Because of #1 and #2 above, I've always wondered if there was some sort of hormonal connection.Finally, I have lately tended to wake up in a panic in the middle of the night thinking that I'm dying - I'm pretty sure it's because this breathing problem is happening in my sleep.  Yes, I'm stressed lately, but this also happened on summer vacation when I was definitely NOT stressed.Would love to hear of any similar experiences.Good luck, everyone!",
            "post_id": "5118194",
            "timestamp": "1259205977",
            "user_id": "user_1120194",
            "user_link": "/personal_pages/user/1120194",
            "votes": "0"
        },
        {
            "answer": "hi ppli'm a 25yr old male with the same problem.i can't breathe properly when it's really cold(winter time) and also i noticed when i drink alcohol.i do smoke occasionally(trying to quit now).i've been to the doctor several times and i took x-ray of my chest.i can't breathe through my nose so i went to see a specialist and he told me i have chronic rhinitis.he gave me a nose spray which didn't help.so i went back and he gave me a steroid nose spray.that one is helping me a little bit right now but when i drink alcohol it comes.and also sometimes i get a panic attack.i've been dealing with this problem for 3 yrs.i've had some heart issues(irregular heartbeat) but right now that's under control.like the other ppl said i have to yawn sometimes to get a full breathe.it's so damn annoying not being able to breathe.and even night time sometimes i can't sleep and the next day i'm very tired at work.i've had times that when i was driving and i got dizzy and i had to pull over in case I knock out.(cuz i couldn't breathe).i'm pretty sure that there is something wrong with my nose but i have to see some other specialist to find out.oh and also my nose is always so dry and it would bleed sometimes.but like i said..winter time is the worst! especially if u live in Canada.",
            "post_id": "5120829",
            "timestamp": "1259303641",
            "user_id": "user_1121000",
            "user_link": "/personal_pages/user/1121000",
            "votes": "0"
        },
        {
            "answer": "ive just read your post and you have described everything i have been feeling for the last 5 years or more. recently i went to the hospital for a chest x-ray and it showed some thickening on one of my lung and the consultant has told me too ignore it as im only 21. i dont know what to do. what have you done to help you?",
            "post_id": "5122056",
            "timestamp": "1259351061",
            "user_id": "user_1120618",
            "user_link": "/personal_pages/user/1120618",
            "votes": "0"
        },
        {
            "answer": "I'm 51 year old male, I exercise daily I don't consume alcohol and have never smoked. I also have the exact symptoms (3 years now). I'm starting to think it is some kind of an involuntary motor symptom, like an automatic reflex that isn't kicking in. Not real sure how to explain. Does anyone know of any disease that affects motor skills. Maybe Muscular Distrophy or something like this?The yawning seems to trigger the deep breathing that should occur naturally. My chest seems so tight that taking a deep breath is such a struggle. I have had xrays, heart evaluations and I take all types of suppliments. I do have sleep apnea and do sleep with a cpap, I still have this problem. I have not tried the chiropractor yet.",
            "post_id": "5183670",
            "timestamp": "1261070296",
            "user_id": "user_1141900",
            "user_link": "/personal_pages/user/1141900",
            "votes": "0"
        },
        {
            "answer": "I think we should really petition this disease to the head of the medical association so they can start putting some money and research on this undiagnosed disease.Me too I have this SOB for a little while (almost a year) and is getting much worse in a very short period of time. I'm starting to think if it is muscle problem that causes our lungs to compress and not expand fully. It can also be worsen by stress of course and by other environmental illnesses.Most importantly, one thing in common for most patients having this symptom are the diagnoses of GERD. I too was diagnosed with GERD and this is when the symptoms got progressively worse each night. Before I had GERD, my symptoms would kick in seldomly and would only last for several minutes and then its gone for months. However, after a night of overnight drinking red wine/white wine, late night meals right before bed, the symptoms of SOB and muscle pain recurs and being very consistent.I'm really starting to think if it's something the doctors are not telling us and are hiding from us to only make us feel better. Like it's not something that can be treated (nervous system failure) so they just tell us it's stress and we are the only one with the responsibility to control it. Any thoughts on this guys as I'd been reading alot of similar symptoms from patients on this forum and none really got a cure for it. This should be the center of attention for the medical associations worldwide and something must be done.",
            "post_id": "5187016",
            "timestamp": "1261164254",
            "user_id": "user_1142544",
            "user_link": "/personal_pages/user/1142544",
            "votes": "0"
        },
        {
            "answer": "I have the same symptoms with SOB as the original poster. Mine also started 9-10 yrs ago. I can clearly remember it was August 2000.  I am 27 years old now. I was 17 when it started.I was sitting down on the floor watching TV and all of a sudden I felt the need to take a deep breath but couldn't. It was the most dreadful feeling in the world. I ran outside to get some fresh air and eventually I was able to get that deep breath after struggling for a while. After that night, the feeling didn't leave me for about 3 years. It was constant. It was also accompanied by heart palpitations and sweats and a general feeling of exhaustion.  I never went to a doctor about it because I was convinced (and still am, even more so) that I have a heart condition. More specifically faulty heart valve which has caused full blown heart failure by now. That is my self-diagnosis and I am almost 100% certain that I am right.But maybe I should talk about life circumstances that preceded this shortness of breath sensation/constant need to take deep breath/most of the time unsuccessfully thing.So the same Summer of 2000 I was going through a really bad time in my life. I had some serious problems at school, I was failing a lot of classes because of mental depression and severe social anxiety. Teachers were calling my house and my parents were harassing me because of it. I had a mini nervous breakdown and then a month after the stressful breakdown came down with this lump in throat sensation which was almost as miserable as my SOB.  I couldn't swallow any food, the lump was constantly there, except when I went to sleep, it  then disappeared only to reappear in the morning. I was starving because i couldn't eat anything, I was also gagging all the time and felt pretty sick. So after lots of misery my parents took me to the ER where they found absolutely nothing. Next morning I started experiencing tightness in my chest, so I went to my family doctor who found nothing but gave me antibiotics just in case it's something. The antib's didn't help, but eventually the lump started disappearing, so did the tightness in the chest, but I was very traumatized by the whole ordeal. The stress and lack of food had worn me out. And when you think things couldn't get any worse, life had another plan for my unfortunate self , and that's how my SOB started.After 3 years of horrible SOB, it sort of went away for 5 years. Then it came back for a couple of months. And then it went away for a few months. It's a vicious cycle and now it's back with a vengeance. It even wakes me up at night. And it never used to do that. I think it's because of advancing heart failure. I can't go to a doctor because I fear the worst. I suffer from a severe form of generalized anxiety disorder. I know some of you are going to say \"Oh well it must be your anxiety\". Well, it's NOT anxiety. I've had severe anxiety all my life, and this is not part of it. It certainly makes my anxiety worse, because I can't breathe. I should mention my other symptoms which confirm my diagnosis of heart failure: Severe fatigue, lightheaded when walking around or doing any physical activity, no exercise tolerance, tightness and heaviness in the chest which makes it harder to breathe, horrible heart palpitations, skipping heart beat and racing heart beat which can last for hours, low blood pressure, cold feet, digestive problems such as diarrhea, and lots of gas and bloating.I don't want to go see a doctor about it, because like I said, I know something is wrong and I am almost 100% certain of my heart failure diagnosis. And I know heart failure can't be cured, so this is probably going to kill me soon. I am a ticking time bomb. So people, look into heart failure as the cause of this. Heart failure is harder to diagnose so you really have to be persistent with your doctors.Good luck everyone.",
            "post_id": "5224082",
            "timestamp": "1262381142",
            "user_id": "user_1156249",
            "user_link": "/personal_pages/user/1156249",
            "votes": "0"
        },
        {
            "answer": "Just to add to the long list above, my daughter is 10 years old and has complained of not being able to get a good, satisfying breath for probably 5 years now.  To be frank, I have really dismissed her up until now.  Firstly because she is young and otherwise healthy.  Secondly, when I did just mention it to our physician and he asked a few questions and listened to her chest, HE said she was just fine...Now I am finally starting to hear her, and after reading the above posts I feel very frustrated.  She is begging for me to take her to the doctor so she can get better, and yet I feel if I do take her it will be in vain???",
            "post_id": "5273224",
            "timestamp": "1263616732",
            "user_id": "user_1175093",
            "user_link": "/personal_pages/user/1175093",
            "votes": "0"
        },
        {
            "answer": "My son had this same problem of not being able to get deep breaths for years.  He, too, was diagnosed with Sports Induced Asthma when he was in 8th grade and was given an albuterol inhaler, which helped a little but not a lot.  The problem gradually got worse as he got older.  In high school he was put on Singular, which helped a little but not a lot.  In college, he really struggled to get deep breaths, especially when playing football - but even when he was in class and not doing anything physical.  The doctor put him on Advair along with the Singular and albuterol inhaler.  It still did not help much.  At times he was told he might have anxiety, which he did not - and he told them he was totally relaxed - he just could not breathe.They finally did a pulmonary function test and found that he wasn't getting air in the small airway passages of his lungs like he should, but it didn't show full blown asthma.  He was sent to a cardiologist, who said his heart was strong and nothing wrong there.  He was sent to an allergist, who said he was allergic to dustmites, but what he really thought was the problem that he was not on the proper medication for his issue.  His problem was more similiar to COPD even though he is young and has never smoked rather than typical asthma.The allergist took my son off Advair and put him on Foradil and Avesco along with the Singular.  I cannot believe it - but he is finally feeling better and can breathe pretty much normal after struggling with this for 8 years!!!  No more calls from him complaining that he can't breathe!Don't give up if you struggle with this.  There is hope.",
            "post_id": "5273876",
            "timestamp": "1263647300",
            "user_id": "user_1175392",
            "user_link": "/personal_pages/user/1175392",
            "votes": "0"
        },
        {
            "answer": "Hi. 8 Weeks ago found trouble getting deep breath. Had ct scan, pulmonary function tests etc,.. nothing found. Specialist gave me all clear but symptoms still here. have woken up with numb fingers last few nights also but no snoring so sleep apnea ruled out.  Feel like there is restricion to breathing but fev1 at 95% and volumes at 101% of expected. Good to hear so many people have similar symptoms and living life... feel so depressed with this and it is annoying my wife and kid. I am going to get back exercising, lose some weight and take more vitamins and eat better food. That seems to be the general consensus here... will let you know if this works !!",
            "post_id": "5274026",
            "timestamp": "1263651487",
            "user_id": "user_1133528",
            "user_link": "/personal_pages/user/1133528",
            "votes": "0"
        },
        {
            "answer": "After reading all the posts, please let me help everyone.What a majority of you have HYPERVENTILATION SYNDROME!Do a google search on that phrase and you will see it is exactly related to your symptoms. I have had this for years, and I too thougt it was the end of the world.The feeling of not being able to get a full breath is caused by you taking in too much oxygen and your body is trying to tell you not to breath as deep. The cause of it is you are breathing out too fast and not allowing your body to take enough carbon dioxide.This disorder (Hyperventilation Syndrome) will lead to a anxiety attack, and an axiety attack will lead to hypervenitilation syndrome.QUICK FIX: GET A BROWN PAPER BAG AND BREATHE INTO ITFrom now on, only try to breath through your nose (I know it's hard, but the feeling of freaking out WILL PASS, and it will clear your nose)Here are some links:http://reviveyourlife.com/inspiration-and-wellness/do-you-suffer-from-hyperventilation-syndrome/http://firstaid.about.com/od/shortnessofbreat1/qt/06_HVSsymptom.htmhttp://www.depression-guide.com/hyperventilation-syndrome.htmI used Buteyko breathing technique to deal with this for years, if you go to the doctor they will do all types of test on you and they will not find it.YOU WILL BE OKAY, PLEASE LOOK UP WHAT I HAVE MENTIONED ABOVE.If you need anymore info, you can email me at ***@****Good luck",
            "post_id": "5283246",
            "timestamp": "1263901285",
            "user_id": "user_1179025",
            "user_link": "/personal_pages/user/1179025",
            "votes": "0"
        },
        {
            "answer": "Hi i alway have problem when breathing it hurt me so much i want u to help me am not that fat my weight is 60 but i get problem when am breathing",
            "post_id": "5292812",
            "timestamp": "1264110301",
            "user_id": "user_1182460",
            "user_link": "/personal_pages/user/1182460",
            "votes": "0"
        },
        {
            "answer": "I have the same problem for 10 years. It started one day and I live with this. Sometimes it feels better, sometime worse.  I do not think it is anxiety. These symptoms are real, they are tiring.  Social life life is definetly affected from lack of reserve and low energy.  My potential and performance are affected.Seems like there are quite a few of us with the same problem.  It has not been described in the medical literature, if nobody can diagnose this.  As a matter of fact, one pulmonologist admitted to me he had the same symptoms for 10 years and could not explain it either.In my case I feel sometimes better with sugars and more calores, fats, meats.  Staying on healthy diet free of fats and meat did not help me a bit.  Felt mortal on it.  Sometimes I get this normal feeling of taking deep breath back, I can exercise, but I always perform less then my very fit  peers or even people older then me 2 decades.",
            "post_id": "5292966",
            "timestamp": "1264112775",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "I've had trouble breathing since August 15th, 2009, I know the day it happened, just don't know why.  I've been to two different lung docs, a speech therapist (for Vocal Chord Dysfunction), an ENT for GERD, and my internist too many times.  I do go to a gastroenterologist next week.My breathing trouble is not being able to get a deep breath in and yes that yawn sure helps WHEN it comes.  I was diagnosed with Asthma and given Flovent, found no relief so went off of it and went in for tests again and had great breathing tests.  I'm not overweight, my BMI is great, I take GOOD QUALITY vitamins.After a bunch of research I have found A LOT of reasons for shortness of breath and most of you have probably Googled for them already but here's a list of things you should Google for you if you haven't and see if your symptoms go with each one (I've ruled out all of these):1. Vocal Chord Dysfunction2. Asthma3. Hyperventilation Syndrome4. Diaphragm restriction (get myofascial release therapy - this has helped me the most!!)5. GERD6. Hiatal Hernia (this one hasn't been ruled out for me, but I think it's my last hope)7. Anxiety (this usually just fuels the breathing trouble)Here's some tips:1. To strengthen your diaphragm blow up a latex balloon a few times daily2. Google for vitamins that reduce inflammation and there are A LOT3. IF you suspect hiatal hernia you can take two fingers at the base of your sternum and push gently but with some pressure towards your belly button (no need to go all the way too it)4. Lay on your side and do deep square breathing: breathe in for 4, hold it for 4, breath out for 4, relax for 4 (I can ALWAYS get a deep breath after doing this for a few minutes)Wish I could offer more, but that's all I remember at this time.Good luck to all of you!",
            "post_id": "5356084",
            "timestamp": "1265671385",
            "user_id": "user_1204775",
            "user_link": "/personal_pages/user/1204775",
            "votes": "0"
        },
        {
            "answer": "Thank you MMC70 for your recommendation, I have to try that myofascial release therapy, though I think it is all cardiac on microvascular level...I have to admit, having this problem for 7 years, I felt quite good eating meats and milk products (of coarse salads and fruits) to the point of feeling completely normal, though there was no induranse on exercises..    My problem that I had to face 2 months ago was eye dryiness, so severe that I got \"blood shot eyes\", I could not keep my eyes open, because of a lots of pain.  I've read 3 books on dry eyes, visited 3 ophthalmologist, and googled the internet.  All prescribed eye drops did not much, just made my eyes feel even worse.  I could not work like that.  Books recommended healthy diet and flax seed oil. I was afraid to get off meats and cheese, that I would get that breathing problem back.  I am on a bean diet now, with a lots of all kind vegetables.  Fruits and berries I am excluding now, since they rise blood sugar and that can cause diabetus and contribute to my dry eyes.  Well, my eyes got much better, whites are white, feels normal.  My breathing got definetly noticable, definetly a lots of symptoms and chest dyscomfort.  Initially though I felt quite good, could exercise more then usual, got more active, could last longer, then on meats.  Probably I overdid it..  Before that, I got stomach upset (may be from tomatoes), missed 2 meals with beans, ate cheese.. - it hit me afterwards. I could not even yawn to take a breath.  It tired me out a lot .  Can not and afraid to do anything forceful or intense now.  I started taking supplement CoQ.That breathing dyscomfort  might be some kind of vasospasm or microcirculation problem in the heart.  My EF was in 40s on Echo, 7 years ago, way down from normal >55%.  I will continue to eat healthy and not miss any meals.Someone wrote it is hypoglycemia symptom.. Hypoglycemia comes from insulin resistance, malfunctioning pancreas.  Usually prediabetic or diabetic state.  Cells starve for energy, glucose circulates, damages vessels, but can not get inside the cells.  It contributes, may be starts bad circulation.  Then there can be bad circulation in pancreas if it started failing.  May be it is all from cholesterol..I am trying to do everything cholesterol free.  They say if disease develops it is too late.Still have to do it healthy to slow down the progress.Angiogram might be fine and tests negative because it is on microvascular level.They write something about microvascular angina, but there is not much information on microcirculation anywhere.",
            "post_id": "5362670",
            "timestamp": "1265827263",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "They describe this as hyperventilation syndrom on other sites.  Where is this coming from?  Cholesterol probably plugs little vessels and organs start dysfunctioning.I probabably have to be strictly vegetarian and avoid sugars to run away from cholesterol..",
            "post_id": "5363983",
            "timestamp": "1265851019",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "hello,i have been suffering from this for most of my life, i am 20 years old. I try to get my breath in all day and it is so tiring, i cannot yawn ecause it just doesnt go either. when i do get a breath in it is so great! I do not drink or smoke.I went to the chiropractior and found out that i have started to develop shermans in my upper spine, which is when your uppen spine starts to hunch. you cannot see it from the out side but the x rays sure show it. the reason why i have not been able to get my breath in for so long is because my spine is trying to hunch, it puts all your ribs together and they eventually dont like to expand. i have been going to the chiropractor about 3 times a week and i havent had that problem for ages!maybe a trip to the chiropractor, or if your dont like chiropractors maybe a phisio :)hope this helps :)",
            "post_id": "5367212",
            "timestamp": "1265932036",
            "user_id": "user_1209094",
            "user_link": "/personal_pages/user/1209094",
            "votes": "0"
        },
        {
            "answer": "I am having this same exact problem. My 12 yr old daughter gets it as well. Her Dr has given her an Albuterol inhaler, but said its all in her head. We both have tried the inhaler, but it NEVER works! I don't believe it is asthma related. I wish I knew the answer and how to feel better..I hate waking up, having to sit up and constantly try to yawn..ANd when I finally CAN yawn, I still feel unsatisfied, so its never-ending!I can't believe out of ALL THESE POSTS-there is not ONE definite Dr diagnosis!! I hope a Dr reads these and makes it his life mission to see what the heck causes this!!!!This also goes to show how LITTLE Dr's take us serious! they dismiss our concerns, as anxiety, asthma, or panic attack..\"No Mr Dr-the PANIC ATTACK starts AFTER I can't breathe!!! \"",
            "post_id": "5370799",
            "timestamp": "1266028488",
            "user_id": "user_1210483",
            "user_link": "/personal_pages/user/1210483",
            "votes": "0"
        },
        {
            "answer": "I'm 14 this year and i'm having the same problem too. D=",
            "post_id": "5392166",
            "timestamp": "1266605552",
            "user_id": "user_1218237",
            "user_link": "/personal_pages/user/1218237",
            "votes": "0"
        },
        {
            "answer": "Same problem. On and off since I was a kid. You can't believe how irritating and frustrating it is (I guess you can, but whatever). I need to see a doctor about this, it's bugging me like crazy.",
            "post_id": "5392876",
            "timestamp": "1266618136",
            "user_id": "user_1218415",
            "user_link": "/personal_pages/user/1218415",
            "votes": "0"
        },
        {
            "answer": "look forB U T E Y K O     B R E A T H I N G     T E C H N I Q U Ein internet !!!!",
            "post_id": "5394091",
            "timestamp": "1266648592",
            "user_id": "user_1218820",
            "user_link": "/personal_pages/user/1218820",
            "votes": "0"
        },
        {
            "answer": "I know exactly what everyone is talking about here! I have had this problem for years and I'm 18 years old. Just 3 years ago it started to get worse and my parents really started to notice. It doesn't to seem to be as bad in the mornings but as the day progesses it gets worse and by the end of the day before i go to bed is living HELL! I at starving for a satisfy breath by that time. I'm already tired and then i have to struggle to get a breath, now that is SOOO VERYY FRUSTERATING. Everytime i fail to get a good satisfying breath it makes me so mad that i just end up breakingn down and crying, which only makes things worse because they say to calm down to take deep breathes, well you can't do that when you can't get a good deep breath! I have been to my hometown clinic numerous times just to have him refer me to other specialists. I've been to a pulmanary specialists who ran a number of tests that all came back normal. I have 2 different inhalers, alburteral and symbicort. Neither of them work. They have said i have anxiety, stress, and even may think its acid reflux, which i dont think it is that. The last time i went to the doctor the specialist told me it was a \"teenage girl thing\" really?! that mad me more mad.",
            "post_id": "5403184",
            "timestamp": "1266902648",
            "user_id": "user_1222088",
            "user_link": "/personal_pages/user/1222088",
            "votes": "0"
        },
        {
            "answer": "oh and i've also been to physical therapy doing different excersises that also didn't work",
            "post_id": "5403188",
            "timestamp": "1266902733",
            "user_id": "user_1222088",
            "user_link": "/personal_pages/user/1222088",
            "votes": "0"
        },
        {
            "answer": "The Yog Pranayam (breathing exercises) will  help you relax and also help with the breathing difficulties.You will notice benefits in days.Initially do kapalbhati and anulom vilom, and then when your breathing improves, do all the the pranayams in order, as described. Come back to report your progress, so others can benefit.Build up your timing gradually. If you feel tired or dizzy, stop and resume after 1 minute.Bhastrika - Take a long deep breath into the lungs(chest not tummy) via the nose and then completely breathe out through the nose. Duration upto 5 minutes.For 30 seconds, while doing bhastrika, also raise both your hands above your shoulders when breathing in and then bring your hands down quickly(like a weight lifting movement) when breathing out.Kapalbhati -(Do it before eating) Push air forcefully out through the nose about once per second. Stomach will itself go in(contract in). The breathing in(through the nose) will happen automatically. Establish a rhythm and hold your head steady. Not for pregnant women. Seriously ill people do it gently.Age over 15 years -do this for 20 to 30  minutes twice a day.Age under 15 years -do this for 5 to 10  minutes twice a day.Anulom Vilom –Close your right nostril with thumb and deep breath-in through left nostrilthen – close left nostril with two fingers and breath-out through right nostrilthen -keeping the left nostril closed  deep breath-in through right nostrilthen - close your right nostril with thumb and breath-out through left nostril.This is one cycle of anulom vilom.Age over 15 years -Repeat this cycle for 20 to 30  minutes twice a day.Age under 15 years -Repeat this cycle for 5 to 10  minutes twice a day.You can do this before breakfast/lunch/dinner or before bedtime or in bed.Remember to take deep long breaths into the lungs.You can do this while sitting on floor or chair or lying in bed.Bhramri Pranayam -Close eyes. Close ears with thumb, index finger on forehead, and rest three fingers on base of nose touching eyes. Breathe in through nose. And now breathe out through nose while humming like a bee.Duration : 5 to 12  timesOnce you are better, continue the pranayam once a day.Be patient, as the benefits will show up gradually.Only by doing you will benefitand feel good because you are helping your body.Those who say I have tried everything....will be amazed at the result of doing pranayam.",
            "post_id": "5403559",
            "timestamp": "1266917992",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "http://sports.yahoo.com/olympics/vancouver/blog/fourth_place_medal/post/Why-does-Apolo-Anton-Ohno-yawn-before-this-races?urn=oly,221091",
            "post_id": "5404765",
            "timestamp": "1266946830",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "Since so many of you have this problem, and I myself had it, it's really quite simple. There is no cure, you just have to learn to not dwell on the symptoms, and it will eventually go away. If you keep stressing on it and getting too caught up on the symptoms, they will increase, and you will be harming yourself. That's why some of you have this case on and off. You get over it, then it comes back, but why? I'll explain.There's something called psychosomatization. That is the process when stress and psychological factors take their toll on the body, causing very real, tangible physical effects. This very thing which we are all suffering, is sadly mere psychological strain causing our body to suffer from this really (really) annoying thing. My doctor completely agreed, and boy was that doctor frikkin' smart. It's all just anxiety, maybe with some hypersensitivity here and there or other minute difficulties. He gave me histamine blockers, local corticosteroid nasal spray, and some magnesium supplement I think. It's working wonders. It's not completely gone, but it's almost there. Please don't forget the psychological aspect to this issue. Just do what I told you. Live your life, forget the symptoms, and all will be fine and dandy.Hope this was of any help to you guys. Feel better, and take care.",
            "post_id": "5414395",
            "timestamp": "1267145289",
            "user_id": "user_1218415",
            "user_link": "/personal_pages/user/1218415",
            "votes": "0"
        },
        {
            "answer": "I liked very much recommendation from hava.  I am doing some exercises for three days now, feel soooo much more energy.  Today I can take deeper breaths then yesterday.  I am doing kapalbhati a lot.  It is easiest for me, found it very energysing.  Feel \"high \" from it:).  Love it.  Taking deep breath afterwards happens naturally and much biger.  Today it almost feels normal.  There is so much joy with this.  I get this \"normal\" feeling like I had 7 years ago, satisfaction ..strength from this.Thank you very much hava, all my blessing with you.  I feel up my day with these exercises and I feel so much better.  I have to study yoga..I also did diet modifications last 3 weeks, minimal carbs(only whole grains), beans, almost no meat, minimal fish, nonfat yogurt, low fat milk(small amount), a lots of celery, coliflower, vegetables, no fruits to avoid sugars, minimal potatos  So, that is my sharing..for nowI'll write later, when I get more experience with pranayama",
            "post_id": "5415168",
            "timestamp": "1267162118",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "Last week I went to the doctor and it was the same routine with the same tests. He had once said before that he thought it was anxiety, stress, depression, but i ignored it because i felt non of those. But he prescribed me a generic version of ZOLOFT and i've been taking it for almost a week and can tell a HUGE difference. I would have never thought it was anxiety but i think it is because it doesn't really come out its just the small things in the back of my mind that i am worrying about. so maybe you should try to take an antidepresent its worth a shot",
            "post_id": "5423397",
            "timestamp": "1267410837",
            "user_id": "user_1222088",
            "user_link": "/personal_pages/user/1222088",
            "votes": "0"
        },
        {
            "answer": "I'm 17 and have been having this problem for a while i don't no what it it or how to get rid of it i just feel like i can't breath and its really frustrating anyone knows anything that can help it would be greatly appreciated!",
            "post_id": "5426925",
            "timestamp": "1267492804",
            "user_id": "user_1230263",
            "user_link": "/personal_pages/user/1230263",
            "votes": "0"
        },
        {
            "answer": "for 2 months I have had a hard time breathing, i am 43 and an ex-smoker I cannot catch my breath all the time and it has gotten worse...i have to yawn or sneeze to feel the weight come off my chest, if i try to many times to catch my breath my sternum will start to hurt..the strange part is that I walk all day at work  up and down stairs carry up to 50 pounds...I feel as though i am getting air but it is just labored, I forgot to mention that i am 6,3 and 280 pounds (20 stone) (put on 40 from quiting smoking) I was 300 pounds but lost 20...but i didnt have problems breathing when i was 300.  there was one night where my breathing was perfect...caught every breath and it was noticeable and after reading about stress and anxiety i am beginning to wonder if that is what is wrong...but the fact that my chest feels heavy concerns me.",
            "post_id": "5449586",
            "timestamp": "1268096372",
            "user_id": "user_1238685",
            "user_link": "/personal_pages/user/1238685",
            "votes": "0"
        },
        {
            "answer": "I am a 27 year old female who has difficulty with breathing.  I don't smoke, I'm normal weight, I exercise, eat healthy, etc.  For years I have been having difficulty breathing, but has recently gotten worse in the last 2 years.  I feel like I am constantly struggling to get out a breath out, I find myself taking large yawns to finally get one satisfying breath and then it starts again.  It cycles and sometimes I don't feel it at all, but then all of a sudden it comes back again.  The only REAL relief I have is when I lay flat on my back.I have been to a cardiologist, pulminary dr, internist, etc. and there are no answers...everyone tells me it is probably just anxiety.  I have explained that it happens for no reason and has no real triggers.The only thing I can think of is that my back is constantly sore and tight.  I have a long commute and I sit at my desk a lot, I am wondering if that has anything to do with it.  I work in a school and I notices that during the summer my breathing was better.When I read some of these posts I feel like I am not alone in these breathing issues...it is hard to explain to most people as it sounds very concerning.Does anyone else have any ideas??",
            "post_id": "5449724",
            "timestamp": "1268100012",
            "user_id": "user_1238743",
            "user_link": "/personal_pages/user/1238743",
            "votes": "0"
        },
        {
            "answer": "How to improve your breathing:Look at my earlier post Feb 23 ,2010 and follow the breathing exercises and you will notice better breathing in days, as naaa10 as already benefited.",
            "post_id": "5450651",
            "timestamp": "1268129401",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "yes, Pranayama yoga breathing..I find it not that easy, still see big improvement already now, compare when I started.  Bought a book on pranayama yoga.  There is one exercise where they say to take full chest breath in one second.  I can not do that, usually for me to take a deep breath takes more then 3 seconds.I am learning also vegeterian way and perfecting my diet.  I've lost some weight with this, even if I am not a big build to begin with.  The  most part I like is that people started looking at me more and their faces look at me friendly now, they talk to me more and I talk more to people,  they say complements.  I feel way more energy then before.  I feel like I can work and take care of my son.  When I want to take a deep breath now, I can ..",
            "post_id": "5453610",
            "timestamp": "1268191655",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "I can say well done naaa10. You are experiencing the side benefits of pranayam.The brain feels happy with all the extra oxygen and your self confidence is showing and people have started to notice.Re-read and print the pranayam I have described and follow it. You have a lot more to experience, but do it everyday for life.Deep breathing in, should be for 2.5 to 3 seconds.For kapalbhati it is breathing out once a second.(Just one quick stroke).Your feedback is very useful.The next benefit you may notice is, you can eat less and still have lots of energy, as the digestive system becomes more efficient.",
            "post_id": "5454181",
            "timestamp": "1268212767",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I'm 50 years old and have had this problem for my entire adult life.  I've seen a couple of doctors about it, but have never had any tests beyond listening to my lungs with a stethescope.  My theory is that it is connected to hormones.  I seem to experience the worst symptoms around the time I ovulate.  Some months are worse than others -- this month I had it during ovulation, menstruation, and now ovulation again.  It's usually accompanied by nagging achiness and stiffness in my upper back -- just inside the shoulder blade area.  I mentioned this to my ob/byn, who thought it could have something to do with blood being released into my abdomen during ovulation.  During my first pregnancy, I experienced almost no symptoms, which further supported my hormone theory.",
            "post_id": "5479818",
            "timestamp": "1268870899",
            "user_id": "user_1249292",
            "user_link": "/personal_pages/user/1249292",
            "votes": "0"
        },
        {
            "answer": "I'm so glad I'm not alone in this. I'm 19 years old and I've had this problem for 3 years now maybe longer, at first it was manageable but now it's just unbearable. I'm an athlete so you can understand how horrible it is. 5 minutes pass on the court and then I have to stop just to catch my breath, and every time I get yelled at, my coach keeps saying that I'm out of shape and need to exercise more, I try to explain to that I'm not physically tired I simply cannot breathe but no one listens. This almost never happens to me when I'm not doing a physical activity however I've had a few episodes where I just couldn't breathe I was literally choking, suddenly my throat closes up and no air is going in, and then out of no where it opens and I can breathe again. I should probably say that I've passed out like 3 times in the past 2 years, the back of my head, just above my neck, feels like it's on fire and then I pass out. Like everyone mentioned above, I have to yawn just to take in a full breath, when trying to do it without yawning it hurts like hell, it feels like my chest is too small to contain the expansion of my lungs when attempting to take a full breath so it feels like my chest is being crushed, and my back in the middle left side (actually a tiny bit higher that the middle) feels like someone is stabbing and twisting the dagger. This pain is constant when taking large breaths, although now I only seem to notice it when I remember even having it. I've never been to a doctor about this, I'm saving some money to try and get an X-Ray for my chest, but after reading what everyone said I don't think an X-Ray is gonna help with anything. If anyone has a way of fixing this, PLEASE help",
            "post_id": "5482771",
            "timestamp": "1268944908",
            "user_id": "user_1250301",
            "user_link": "/personal_pages/user/1250301",
            "votes": "0"
        },
        {
            "answer": "Look at my post of Feb 23rd 2010 and follow the relaxation techniques I have described.It will definitely help you.Come back to report your progress.",
            "post_id": "5482950",
            "timestamp": "1268947655",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Hi. This may sound like a summary of the thread so far but anyway:I'm 22, male, great physical condition, exercise regularly, avoid junk food and artificial sweets, drink plenty of water. Have done all test under the earth regarding lungs, heart, Gerd, thyroid, etc. All results came perfect, but i can't take a normal deep breath.This has been going on for more than five years. Now looking back, I didn't even know I was having breathing problems, I was nervous and couldn't keep a conversation, i tried to battle the feeling of unrest with exercising alot.Then i went to an  ¨alternative medicine¨ test, where they measure the frequencies of your organs and tissues, bioresonance or something like that.Without telling them I had breathing problems, they told me the computer showed I had the Epstein-Barr virus settle in my lung tissue causing changes. I already suspected something along those lines, as i survived 2 pneumonias at ages 15 and 17, but i didn't know there were consequences - pleural adhesions (where the lung lining sticks to rib lining and causes limited mobility of chest wall)My question to you is, does any of you have pleural adhesions as a result of pneumonia/Epstein Barr virus? Can you treat them? I am certain I have them, and i can even stretch them until they break, but it's painful. Any advice, thoughts, comments? God bless.",
            "post_id": "5491435",
            "timestamp": "1269197994",
            "user_id": "user_1253264",
            "user_link": "/personal_pages/user/1253264",
            "votes": "0"
        },
        {
            "answer": "Has anyone thought about airborne allergies, like having a pet bird?  About a month ago I adopted a parakeet and about 2 weeks ago I've steadily started to have a very hard time taking deep breaths.  I was looking online to get ideas to why I was having this problem and came across this site. I had a parrot while I was in high school and had the same problem breathing but I never made the connection til just now.  Could there be a correlation?  I don't have any other allergy symptoms and I'm a healthy 37 year old.  I just thought I should see what people thought about this.",
            "post_id": "5491751",
            "timestamp": "1269206154",
            "user_id": "user_1253493",
            "user_link": "/personal_pages/user/1253493",
            "votes": "0"
        },
        {
            "answer": "I had the same conditionbut I went to Cleveland Clinic after being diagnoses at Ohio State University with fibrosising mediastnititis stenosis . This is a rare disease but if you were exposed to chicken or bats you might wants to ask for a high resolution CT scan and a cardiac MRI which will detect it . Thanks felicia",
            "post_id": "5492183",
            "timestamp": "1269217183",
            "user_id": "user_1215819",
            "user_link": "/personal_pages/user/1215819",
            "votes": "0"
        },
        {
            "answer": "I am 32 and I am in perfectly good shape, I do not smoke or drink.  I exercise 6 days a week and I eat healthy.  I have noticed I am having a hard time getting a deep breath, I need to inhale really deeply and then do an easy exhale a few times before I feel fine.  It is becoming a problem, especially during my spin classes, I feel as if I am working even harder because of not being able to breathe properly.I also give blood regularly and I had a few nurses tell me I have an irregular heart beat, it will stop and then start.  Does anyone know if this could cause any of my symptons?",
            "post_id": "5563569",
            "timestamp": "1271092940",
            "user_id": "user_1277693",
            "user_link": "/personal_pages/user/1277693",
            "votes": "0"
        },
        {
            "answer": "See my post of Feb 23, 2010 and do the kapalbhati to get over the breathing problem and get back to normal. You can also do the other exercises suggested. Come back to report your progress.",
            "post_id": "5565993",
            "timestamp": "1271146605",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,Surprised to see so many other people have the same problem. I developed this breathing problem about a year ago. It comes and goes, usually in spurts that can last for days or weeks, and then disappears for a while. Feel like I need to take a deep breath - when I do, the feeling goes away for a couple minutes, only to return - pattern repeats. I'm 45, generally very healthy. Saw a doctor, who gave me an inhaler, which sometimes helps and other times does nothing. I have no cough or phlegm or fevers. Chest XRay normal. It does not affect my exercise tolerance. But here's the interesting thing - the only thing that I've ever noticed that consistently helps this feeling is alchohol. After I have a couple drinks, the feeling disappears COMPLETELY!!! I have noticed this on multiple occasions - in fact, I don't think there's ever been an instance when alcohol did not fix it. Sure enough, when my buzz wears off, the feeling comes back. I'm curious - has anyone else ever noticed this??? I guess this would fit in with the \"anxiety\" hypothesis . . .",
            "post_id": "5569679",
            "timestamp": "1271214054",
            "user_id": "user_1279599",
            "user_link": "/personal_pages/user/1279599",
            "votes": "0"
        },
        {
            "answer": "hey everyone, its great to know that im not alone, im a 21 male, 145 pounds and on paper- as healthy as can be. all of a sudden one day over a year ago i noticed that i was trying to yawn to get a deep breath every few minutes. since then my life has been miserable with constantly feeling that im not able to take in a single satisfying breath. when i go for a deep breath, it stops short. took every test in the world, with every Dr and they all tell me im fine. however the worst is going to sleep, i can never fall asleep because i feel the sensation of holding my breath while im breathing- if that makes any sense. i do think i have GERD i think there is def a link there and i do think there might be a link to my spine hunching over and seeing a chiropracter and i DEFINITELY think it links to vitamins and the hormone cortisol. i think you should get a blood test taken in the morning between 8 and 10 am to see your cortisol levels- if theyre too high or too low. good luck to everyone, hang in there",
            "post_id": "5573806",
            "timestamp": "1271307173",
            "user_id": "user_1280844",
            "user_link": "/personal_pages/user/1280844",
            "votes": "0"
        },
        {
            "answer": "I feel less alone after reading all your stories, thanks!Mine started around seventeen, one day after some crazy skateboarding, I freaked out not being able to catch a deep breath, thought I was going to die, I started sweating, panicking... went to see several doctors etc nothing wrong with me, anxiety asthma blablabla same as many of you went through. The anxiety pills or the inhaler did nothing (not even any placebo effect). for me the only thing that helped was yawning. always trying to yawn.I'm now 36 and have had my fair share of episodes. here is what I have learned:The symptoms seem to come and go, when they comes they last from 2 to 6 weeks although it's hard to say because you NEVER notice the day they go and a month later you think \"when did I start breathing normally again\". Between episodes can be anything from 2 months to 2 years.I've tried very hard to figure out what triggers an episode and the only advice I have is:AVOID CAFFEINE like the plague, that means tea too! even a can of coke can bring on the symtoms. (PRO-TIP: drink rooibos!!!)AVOID SMOKING TOBACCO, it can be fine sometimes but others it can trigger the symptoms, so I avoid.SMOKE MARIJUANA (even mixed with tobacco) this makes me feel like I'm in perma-yawn-breathing mode, the tension around the neck shoulders disappears, the chest weight is gone, my shoulders drop and every breath feels normal. I feel like my body belongs to me again. this is the miracle cure. as long as I smoke good quality marijuana every day I cannot have the symptoms. it's like a shield. this does not mean that if I don't smoke I will have the symptoms.It sounds very counter-intuitive to recommend smoking marijuana, but for all those who have tried everything, well it might work for you... for me it has been nothing less than life saving. It treats the symptoms and prevents the onset.If this condition is in any way related to anxiety (and it seems so), then how ironic is it that pretty much anywhere on this planet, I must also deal with the extra anxiety due to the risk of getting caught and punished for possession of my anti-anxiety medicine !!!",
            "post_id": "5588758",
            "timestamp": "1271695218",
            "user_id": "user_1285454",
            "user_link": "/personal_pages/user/1285454",
            "votes": "0"
        },
        {
            "answer": "just to let everyone know my uncle about a year ago was having the same problems. he was in good shape but would have shortness of breath.  he went to the doc and they said the gerd and then the next time they said he had asthma...to make a long story short about 6 months ago he passed out at work was rushed to the emergency room. He had a heart attack and ended up having to get a quadruple bypass heart surgery.  So dont listen to the doctors make sure you get you heart thoroughly checked.  I have been having the same problem and i am going to the cardiologist in a couple weeks.",
            "post_id": "5588764",
            "timestamp": "1271695376",
            "user_id": "user_1285457",
            "user_link": "/personal_pages/user/1285457",
            "votes": "0"
        },
        {
            "answer": "I am having the same problem as everyone too . but i am only 17 and have been having this problem for about a year now . its annoying me . because i get dizzy, my body goes all tingly and then my sight starts to blur . it happened when i was driving once, and i had to pull over . i dont know whats wrong ? and its really getting on my nerves !!!",
            "post_id": "5590536",
            "timestamp": "1271723487",
            "user_id": "user_1285958",
            "user_link": "/personal_pages/user/1285958",
            "votes": "0"
        },
        {
            "answer": "My experience: LPR LARYNX ACID REFLUX, AND R.A.D. REACTIVE AIRWAY DISEASEI have had this shortness of breath come over me while trying toread a menu to my husband! I am in good shape too.. I have askedseveral doctors, ear nose and throat, pulmanonligist, cardiologist..all say the same thing.. It i s LPR or my laynx acid reflux.They said I also have non allergic and Allergic sinusitus, so whetherit is spring or not, Im going to be sensitive to things in the air, even justmild pollution.. I was also diagnosed with adult onset asthma twentyfive years ago.. guess what? wrong! no wonder the inhalers didnt workand I tossed them.. Now, further tests, and more knowledge on the doctors part conclude I have RAD.. Reactive Airway Disease..Apprantely your lungs can be breathing just fine, and they pick up somesmall pollutant or  become hyper reactive to some tiny particle and trigger either shorness of breath or what feels like a small asthma attack.. but all the doctors said when it was just shortness of breath, it was LPR, larynx reflux.I dont understand that, its hard to take a deep breath, but I have had every test you can have, and thats what THEIR conclusions were.I have been on Kapidex for six months, the doctor said it would takea year for my larynx to heal, I couldnt believe it, so far she has been right,its better, but not quite there yet.. good luck everyone!",
            "post_id": "5593875",
            "timestamp": "1271794234",
            "user_id": "user_1286934",
            "user_link": "/personal_pages/user/1286934",
            "votes": "0"
        },
        {
            "answer": "For me, I've had this feeling of not being able to get a good breath off and on for 10 years.  I finally do belive that it is due to stress.  It only gets worse when you think about it, then you kind of panic, and it just gets worse.  It is very frustating, but I am certain that it is stress-induced.",
            "post_id": "5597358",
            "timestamp": "1271869299",
            "user_id": "user_1287955",
            "user_link": "/personal_pages/user/1287955",
            "votes": "0"
        },
        {
            "answer": "Hi -I am a 26 year old, relatively healthy woman. I don't smoke (have smoked in the past, but nothing intense). I eat okay (my boyfriend is a chef, so there are 'cheat nights', haha). I run, walk, swim, etc.I have gained a little weight (5 - 10 lbs) over the past few years, but nothing dramatic.I started having this deep breath problem in November of 09. It happened daily, and lasted all day.I was in the ER bc I thought I was having a heart attack.I was put on Xanax and sent home.A month later, no change.Went back in the ER bc this time my chest felt tight.They diagnosed me with Reactive Airway Disease, said I must've breathed something in, and sent me home w/ 2 inhalers.Stopped the Xanax. Tried to inhalers.A month later, no better.Went to a pulmonologist, had every breathing test under the sun.Bloodwork, etc.Stopped my birth control, bc apparently Yaz can trigger your brain to think it needs to breathe faster, and you end up hyperventilating, according to the pulmo.A month later, no better.Finally went to the chiropractor who x rayed my whole body and found that my spine is twisted like a corkscrew, right between my lungs, and is pulling my rib cage with it, so in turn it is squeezing my right lung and putting pressure on my diaphragm.Had a few adjustments, and felt IMMEDIATE relief.I know a lot of people don't believe in chiros, and I was one of them, and I'm not here to promote them, but I am just telling you I had immediate relief.I started going three times a week and get certain adjustments. Also found out I had 4 herniated discs that I didn't know about.. just chalked my back pain up to too much yard work.I now go three times a week and CAN BREATHE.And just to show how well it worked.. I missed my first day on Monday, so I went Saturday, Sunday, Monday, Tuesday and all day Wednesday without an adjustment, and since yesterday I have been having the issue back again.Last time I will miss an appt.Have your backs checked!!",
            "post_id": "5627541",
            "timestamp": "1272567520",
            "user_id": "user_1297046",
            "user_link": "/personal_pages/user/1297046",
            "votes": "0"
        },
        {
            "answer": "Most likely hyperventilation. Does sleeping by covering your face with quilt for 10 mins calm you down?It's not as easy to treat as the doctors would like to think it is.And it's not psychological - anxiety related as they'd like to think it is (though it might have been first caused by stress/anxiety).And it won't be relieved by exercise if you had it for long enough.Infact it can be triggered by exercise. After exercise you hyperventilate and then you'll hurt your chest, and tire the muscles so bad that the respiratory muscles can stay sore/tired for hours or days.Food can trigger it too (or lack of food), and sugar crash will definitely trigger it.Breathing exercises won't help much if you're overweight. But try. Requires 1 hour daily practice for months, and if you do it wrong will hurt you rather than help.Meditations do help some, but not unless you're going to put about 2 hours every day into it.Chiros - if you're lucky to find a good one, at least they can assess the spine which is good.And don't do the f***in yogic pranayama unless you want your breathing to be messed up even more. It exists there for other reasons, not anxiety.Action plan1. Lose weight if you're overweight for proper diaphragmatic movement.2. Avoid sugars and large meals, go low carbs.3. Daily Meditation make Breathing exercises  easier.4. Breathing exercises (http://www.physiohypervent.org)4 is the most important of all. See these people in person if possible.I'm not a doc. Eliminate a few rare but possible causes - hypersensitivity pneumonitis(allergic alviolitis) and pulmonary hypertension.How do I know? Exact same condition still seeking answers....Perhaps the breathing exercises are the only thing that have helped me ever. As does eating some carbs. But now I know for sure its hyperventilation (although that could too have organic causes). I was misdiagnosed by dozens of doctors.",
            "post_id": "5629718",
            "timestamp": "1272614367",
            "user_id": "user_893287",
            "user_link": "/personal_pages/user/893287",
            "votes": "0"
        },
        {
            "answer": "Dear Hava, thank you again for your recommendations with pranayama.  I wonder how you started and where you are now wth your achievements..",
            "post_id": "5631033",
            "timestamp": "1272649105",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "Is good to know that you are feeling the benefits of pranayam. You are one of my achievements among several others. I learned all pranayam from Swami Ramdev  in 2005, feeling very very healthy and I teach others.",
            "post_id": "5636575",
            "timestamp": "1272819109",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Answer to your problems, or at least something you might want to get checked out. The most common lung and breathing problem in 4 letters:COPD.It's life-long and life-threatening if not found early, so go get checked today!!! It is not curable but manageable.",
            "post_id": "5640080",
            "timestamp": "1272904907",
            "user_id": "user_1301533",
            "user_link": "/personal_pages/user/1301533",
            "votes": "0"
        },
        {
            "answer": "I didn't see this mentioned, but I've had the same problem recently, but have narrowed it down to this:  I swim 2-3 times a week for exercise and the pool I swim in (health club) uses an excessive amount of chlorine.  I've read that recent studies have linked chlorine from swimming pools and breathing issues.  I just swam this morning and I'm having the \"can't get a full breath\" issue now.  I guarantee that it will be gone in a day or two if I avoid the pool.",
            "post_id": "5640234",
            "timestamp": "1272907113",
            "user_id": "user_1301591",
            "user_link": "/personal_pages/user/1301591",
            "votes": "0"
        },
        {
            "answer": "I have the same problem. It really is nice to know that other people have this problem...not that I want others to have this problem, I just thought that I was going crazy.I always feel like I cannot get a good breath.Or that there is a heavy pressure on my chest, mostly the left side.I am only 21 years old and I do not understand.If anybody can offer any help, besides the breatheing exercises because those only make me think more about my lack of oxygen, then I would greatly appreciate it.Thank you!",
            "post_id": "5649494",
            "timestamp": "1273095807",
            "user_id": "user_1304482",
            "user_link": "/personal_pages/user/1304482",
            "votes": "0"
        },
        {
            "answer": "I just thought I would add to the list since so many were willing to share.  I am a 40 year old male in relatively good health, work out several times a week and eat well.  I take all the supplements you're supposed to take and see a chiropractor when I need to.  My problem started about 5 to 6 years ago.  I remember now noticing that on rare occasions back then I would have to think about taking one deep breath and then I would take it and feel fine.  I remember thinking at the time how horrible it would be if this were something that happened all the time.  Then, about a year or so after that started happening, it hit me like a ton of bricks.  I started noticing the feeling far far more often.  Now, it is with me almost all the time.  Sometimes, thinking about relaxing and breathing properly will help.  Other times, it won't.  I do notice after a meal that the problem escalates for a while.  I have tried different diets, thinking maybe the problem was an allergic reaction to wheat or gluten, dairy or refined carbs, but even when I avoid all those things, it still becomes more pronounced after meals.  I have had a physical, blood tests and breathing tests done.  I do wear a mouthpiece for sleep apnea, but I notice no difference whether I wear it or not.  The only other explanations I've been given are reflux (GERD) and anxiety.  I just try to not think about it.  That is my best method for dealing with it.  It can get pretty bad after meals and trying to get to sleep at night, since it can be on your mind so much.  Thanks to all for sharing.",
            "post_id": "5669861",
            "timestamp": "1273608973",
            "user_id": "user_1310600",
            "user_link": "/personal_pages/user/1310600",
            "votes": "0"
        },
        {
            "answer": "hey guys...i have the same problem..and i can't believe that all of you are experiencing it really!!!! i feel better now after reading you're messages guys...my doc thought that i was som kinda crazy...while trying to explaine my case to him...and i was really sad thinking that i'm going to die or somthin...yawning evry single day....it happend to me last year for 4 or 5 monthes and come back again to bother me...while i'l getting married this july...it's really scairy....thank's for all oof you...hope u'll get better sooner...",
            "post_id": "5670006",
            "timestamp": "1273611373",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "The body needs extra oxygen after eating. Your involuntary breathing system is not working well and so the lack of oxygen. Do the voluntary breathing techniques I have described in my Feb 23 ,2010 post and you will start to feel the benefit in weeks.Give it a try and post your feedback so others can benefit.Do anulom vilom in bed when you cannot sleep.",
            "post_id": "5670022",
            "timestamp": "1273611742",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "i really wanna thank you for u'r tips...it was really helpful...but i still can't feel like i'm breathing normal....i'm taking deep breaths all the times and yawning toooo much...i get confused and can't keep my focusing on my breathing coz i can't breath well",
            "post_id": "5674450",
            "timestamp": "1273704439",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "You have started to benefit and gradually(long term) you will be better. Try to to do kapalbhati for 5 minutes or more to get rid of carbon dioxide and get oxygen in.Keep doing the pranayam.",
            "post_id": "5675802",
            "timestamp": "1273737170",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "okay!!! i'll try to do that!!!!and i wanna ask you an other  question..when i'm busy on doing somthing....studying or working...this breathing problem seems to go away.....when sleeping too.....why?? i'm sitting right now writting and can't catch a normal breath...and i'm wondering if it will last for ever....or just for a short period....and thank's again really!!!",
            "post_id": "5678077",
            "timestamp": "1273782865",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "It seems for certain activities, your involuntary breathing is not normal.Try to do the breathing techniques(pranayam) twice a day to retrain the body to breathe more. The problem will will go away longer term. The brain needs a lot of oxygen.",
            "post_id": "5679917",
            "timestamp": "1273829112",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "this sounds similar to my experience with allergies, though my reaction is less intense. i have a respiratory reaction to dairy, and to airborne allergens including fur, dander, feathers, pollen, dust, and mold. my reaction includes sinus congestion and post-nasal drip, which gets into my lungs and makes my breathing feel restricted.reducing airborne allergens in my home (forget carpet and use machine-washable area rugs only, air purifier, change into clean indoor clothes in hallway or laundry room, bathe furry pets weekly and vacuum often with a hepa filter vacuum, damp mop every few days or at least once a week, launder all curtains, rugs, and linens extra-often, practice vigilance against mold including in plants, ban chemicals from the home and use vinegar and baking soda to clean) and sticking to a dairy-free and whole foods diet helps my symptoms.sticking to a simple selection of foods and rotating foods for a week at a time helped me identify which foods make me feel healthiest. whole grain brown rice seems to be less allergenic than other grains, for example, and salmon, chicken, and lettuce seem uneventful...and whereas eggs and beans cause a small amount of congestion and dairy causes a lot, garlic, onions, chilis and apples help alleviate congestion in the long run for me. also, staying hydrated helps.many people have mold in their homes without knowing it. it may be in the structure of the home. worth looking into, especially if you have other symptoms that match.something else to look at is the toxic load we are carrying. because toxins can contribute to allergies and illness in countless ways, one good step for those of us experiencing mysterious health symptoms might be to reduce exposure to mercury, which is often prevalent in our environment and is a huge toxin that is downplayed by the government--probably because they have no idea where to start with it, it's everywhere as waste and pollution and is still used all over the place in our daily lives and in industry.worst, mercury seems to reduce our bodies' ability to detoxify, leading to a buildup of both mercury and other metals and toxins. common sources of mercury that come to mind include amalgam fillings, tuna and certain other fishes, broken mercury thermometers and vapors from the floor where they broke, and unfortunately all flourescent lightbulbs (intact but especially broken, tho the different kinds are made with different forms of mercury, with different effects.)this is why many scholars and doctors believe (kenneth bock for one) that mercury is a culprit in cancer, hypothyroid, and many diseases that are caused by other toxins that mercury allows to accumulate in our bodies--like autoimmune and life-threatening allergy among others.so stop eating tuna, get those amalgam fillings replaced with the \"porcelain\" ones, and take the mercury thermometers and lightbulbs to the toxic waste dump! i hope it helps your body heal.(btw unfortunately incandescent bulbs are being phased out soon by the federal government to save energy, but nothing's been done yet about the mercury in flourescent bulbs, much less getting people to dispose of them properly...)",
            "post_id": "5681276",
            "timestamp": "1273858556",
            "user_id": "user_1313873",
            "user_link": "/personal_pages/user/1313873",
            "votes": "0"
        },
        {
            "answer": "you're comment  freaked me out really!!!!about you're uncle sotry...i mean about the heart issue....cause somtimes i feel like i'm having a heart attack...also feel dizzy and almost pass out.......well!!! hope u tell me about what improvement you did..since you mentioned that you hade the same issue...and u were about to see a cardiologist abt that!!!! soo plz help me..with some informations...",
            "post_id": "5684385",
            "timestamp": "1273944305",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "I have never in my whole life suffered from breathing difficulties, asthma nothing up until about 8 weeks ago. Now I suffer from almost all of the symptoms everyone has mentioned.I'm 27, generally healthy - no health issue's, occasionally drink- every 6months or so, and have been a smoker on and off since teen years up until about 2 weeks ago. Although since stopping smoking and half hoping these this sypmtoms would go away.. they havent :(My Sypmtoms:- Shortness of breathe/feeling of suffication- I feel like my lungs have shrunk as im not able to breathe in as much as I used to be able to, but feel my lungs are full and so couldnt take anymore in even tho it was only a little breath [ANNOYING]- Although I get this throughout most the day I tend to get more whilst driving or sat down. I'm constantly messing adjusting my car seat getting the feelin I cant breathe and that my ribs are squashing my disphram somewhere...extreme i no.. but its terrible.- I have to keep really stretching my body straight but it doesnt really help.- Evenings and nighttimes are the worst while im up, but then as soon as I go to bed it kind of goes, ive never had a problem with it in bed or been woken by it.- Feeling of something stuck in my throat/top of chest when I swallow [all the time] like flem or ball... but nothing comes up- I cant seem to cough!!! and when I really force one out its sound pathetic! and nothing at all comes up off my chest.- My voice has in the last few weeks gone weak aswell. I feel I cannot shout! When i shout my son in for his tea as I have always done, I just cant get to the high tone Ive always got too... 1 because my voice feels to weak and again pathetic & 2 because by the time I have called half his name im out og breathe anyway- Strange thing is I went to kent for a few days and it kind of disappeared!! I say disappeared because it was like I'd forgot all about it then soon as I returned home....to manchester [2minutes ftrom the city centre] bam! struggled again...it was bak.- Doctor said it was mild astma and gave me an inhalor which does absolutely nothing for me whatsoever.I'm getting abit worried now tho, as I was kind of hoping it was due to the smoking finally taking it toll on me... but by sounds of it from people who have never smoked -- and it not shifting or feeling any better since I have quit im not so sure",
            "post_id": "5685457",
            "timestamp": "1273968121",
            "user_id": "user_1314971",
            "user_link": "/personal_pages/user/1314971",
            "votes": "0"
        },
        {
            "answer": "lol, excuse the spelling... it typed it quickly determined to post before falling asleep relying on the spell check at the end to do the work for me lol... and forgot !",
            "post_id": "5685514",
            "timestamp": "1273969788",
            "user_id": "user_1314971",
            "user_link": "/personal_pages/user/1314971",
            "votes": "0"
        },
        {
            "answer": "lol, excuse the spelling... it typed it quickly determined to post before falling asleep relying on the spell check at the end to do the work for me lol... and forgot !",
            "post_id": "5685747",
            "timestamp": "1273976370",
            "user_id": "user_1314971",
            "user_link": "/personal_pages/user/1314971",
            "votes": "0"
        },
        {
            "answer": "You will be able to get over this breathing issue. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the breathing problem and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested. Come back to report your progress.",
            "post_id": "5686473",
            "timestamp": "1274005812",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I've had the same thing as you and everyone else by the looks of it. Mine started about 3 years ago whilst on a training course for my current job. There was a fitness part that we had to pass in order to get the job.. Everything was going fine up until i got really out of breath....i thought i was going to die because i just couldn't take a deep breath...started to panic....hey presto...one mighty panic attack....fantastic! :(I have irregular heart beats although nothing was picked up when i got the monitor..typical.I feel scared to exercise now just in case it starts it off again...although i have just bought myself a bike so i can ride to work...not sure if that was such a good idea but i've read a few breathing techniques here so i'll give them a go while i'm riding.I'm determined to beat this anxiety that's for sure as it can be the most frightening thing ever and i feel for each and every one of you.I cut out caffeine over a year ago now and although i still get the odd episode it's nowhere near what it used to be, you just have to keep telling yourself....IT'S IN YOUR HEAD, IT'S NOT REAL!  All i need to do now is cut out the smoking :SGood luck to all of you :)",
            "post_id": "5687527",
            "timestamp": "1274032819",
            "user_id": "user_1315579",
            "user_link": "/personal_pages/user/1315579",
            "votes": "0"
        },
        {
            "answer": "Heyy.. it was such a releif to see other people get this too. Its unbearable, i feel like i just want to burst out in tears. I am 21 years old, a light smoker, eat pretty healthy but I have had it for 1 year now. The last week has got so bad. Im sitting here with the problem now and I have had it 10 minutes before i read this thread and still have it now after finishing it 30 minutes later!I went to the doctors yesterday. He told me after doing all the checks like many of you have mentioned it is just anxiety.. and I am having attacks. But these so called 'attacks' are happening all day now. Its so tiring. I just want a satisfying breath. Anyway, he wouldnt give me any anxiety tablets as he said I am too young and I just need to run it out of me. Im not being funny but I have never heard such c**p.I am constantly yawning trying to get that deep breath but i can only get it on every 30-40 breaths.Just read that multi vitamins have cleared it for 1 person so I just ordered the best of the best - will keep you updated.I am also going to ask the doctor to give me xanax and still no hope then go to the chiropractor like many of you have suggested... although I get no back pain.My sister suffers from this too - but it panicks her much more than me and she has an actual attack.God.. I wish the doctors could see this thread and invest some money to finding the cause for all of us.As I'm sure you all are.. I'm tired of not being able to breathe - its exhausting :(I hope that you all get better soon.",
            "post_id": "5689674",
            "timestamp": "1274095055",
            "user_id": "user_1316321",
            "user_link": "/personal_pages/user/1316321",
            "votes": "0"
        },
        {
            "answer": "i just don't understand why this NOT BEING ABLE TO BREATH!!!!!! can go away easily during the day when we are busy on doing somthing or not focusing on it!!!!! and it comes back when we're thinking of it.....i just wanna ask you guys if caffeine has a bad influence on this breathing issue!!!! the thing is i'm toooo scaired of it...seeing that lost of you had it for years.....i'm having it for one year so far.....i went 4or5 times to the ER for nothing..like WIBBLEWOBBLE said above me such a C**P...the doctors mad it wors for me...saying that i'm just wasting time while i'm young and blah...blah blah....anyway...can any1 plz help me with that...telling me what shoud i do...what shoud i avoid???....",
            "post_id": "5691527",
            "timestamp": "1274127740",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "It is scarey.  I take so many meds.  I call my psych yesterday and told him I am still getting panic attacks with my new meds which I have been on for months.  Everytime I get scared when I try to take a deep breath and can't, I start thinking I will never catch my breath again even though, way back in my mind, I know it is not true.  I wouldn't mind panic attacks that much if I didn't feel like I wasn't getting enough air.Karen59 and annoyed",
            "post_id": "5694352",
            "timestamp": "1274195581",
            "user_id": "user_956150",
            "user_link": "/personal_pages/user/956150",
            "votes": "0"
        },
        {
            "answer": "I'm a 63 year old overweight male with a very bad heart and diabetes.  I started having this breathing problem about a week ago.  Of course, my first thoughts were heart related.  A visit to my cardiologist and regular doctor along with chest xrays, echocardiogram and numerous blood tests revealed no physical reason for this problem and it was suggested I was having panic/anxiety attacks.  To show how real it was to me, in the past week I have only slept about 1 to 2 hours per night and I have lost 22 pounds (not really a bad thing but the loss is too fast).  I started doing all sorts of yard chores and my mind forgot the breathing problem so I pretty well convinced myself it was more a mental rather than a physical problem.  I started searching the internet and found this forum and was amazed at how many other folks were experiencing the same problem.  I searched further and found the SOLUTION!!!!   It is an almost instant cure - the reason we couldn't take a deep breath is because we were forgetting to exhale and trying to breathe thru our chests rather than from out bellies (diaphragm).  I am providing a link here to the site and the Dr who explains it and how to learn to breathe to get a full breath - it works almost instantly.Here is the link:  http://www.anxietycoach.com/breathingexercise.htmlI hope this helps and explains what is really happening so that you can get over this God awful feeling.  Please take the time to read this and post back here the results.",
            "post_id": "5696711",
            "timestamp": "1274232067",
            "user_id": "user_1318310",
            "user_link": "/personal_pages/user/1318310",
            "votes": "0"
        },
        {
            "answer": "Hello everyone,I am a 23 year old medical student in my second year. I am diabetic, smoker for 13 years (cigarettes, and shisha or hooka) on social and stress occasions, overweight (BMI = 29), and physically unfit. I went back to smoking 3 month ago after a long time quit (6 months) and smoke 12 packs on a period of 2 months. Of course, cough was constant with a lot of phlegm. 3 weeks ago I stopped, and so did the cough, but exams were approaching and this new problem of short breath appears with constant attempts to yawn. The panic is on the rise and I go in a vicious cycle of cough and tried an inhaler. What is more is that my brother has these attacks for 14 years, so I really freak out as I am a very dramatic person (drama king as some of my friends describe me). I started researching these 'symptoms' and found this website. After reading a lot of the comments, I felt really funny. I discovered that those were nothing more than anxiety attacks (first time this happens this way). What adds more to the equation is my psychological situation. I am living alone in a forign country, almost no friends, fear of approaching people (appearing in the form of ignoring everyone because of which I ended being misunderstood and somewhat considered to be an ******* with many enemies), struggling with intermittent depression (constant thoughts of hurting myself as attempts to get attention), a background of child abuse (sexually and psychologically [neglect]).The only reason of mentioning such very personal details, which might not appear to be relevant, is that this may help someone else figure out if this is just psychology display or a real physical problem.I turely am thankful for everyone for sharing their story, it is only because of this I was able to 'cure' myself.Hope the best for all of you,A.K.",
            "post_id": "5705172",
            "timestamp": "1274404413",
            "user_id": "user_1320736",
            "user_link": "/personal_pages/user/1320736",
            "votes": "0"
        },
        {
            "answer": "I forgot to mention something: the more you think about it and concern yourself with it, the more it exacerbates (if it is psychological). From the instant I read about this on this website and realized it was mind tricks, my sympsons were gone..",
            "post_id": "5705254",
            "timestamp": "1274405757",
            "user_id": "user_1320736",
            "user_link": "/personal_pages/user/1320736",
            "votes": "0"
        },
        {
            "answer": "see a cardiologist and insist that they test for pfo (patent foramen ovale). if one is not readily apparent through ECG, ask for ECG with dye/contrast and use abdominals to perform valsalva movement. interested to see how many of you may have one. may be the answer. in the meantime, i've found it is easily controlled by focusing on breathing from the diaphragm instead of from the chest. let your stomach inflate with inhalation and deflate when exhaling. will feel weird at first but allows you take the deep breath whenever you really need it. let me know about the pfo.",
            "post_id": "5717296",
            "timestamp": "1274731764",
            "user_id": "user_1324305",
            "user_link": "/personal_pages/user/1324305",
            "votes": "0"
        },
        {
            "answer": "i'm just wondering if this breathing problem has somthing to do with ulcer...i mean i had troubles with my stomech 2years ago...and this breathing problem gets worse every time i start vomiting..it just happend to me yesterday..and i felt like diying really...i ate somthing heavy at night..so i felt dizzy and then the BREATHING PROBLEM starts again...i thought that it has gone away for a couple of days..but here it comes again...PLLLZZZZZ can you just help me out ....i really start to get depressed...and i can't keep away my focusing on it..",
            "post_id": "5727801",
            "timestamp": "1274975378",
            "user_id": "user_1310641",
            "user_link": "/personal_pages/user/1310641",
            "votes": "0"
        },
        {
            "answer": "I have had this symtom.I ever blood test,ecg,pft it normal.Until I was EMG exam.Result conclusion call myopathic feature.However I don t know this result relate with difficult to take a full breath or not.I would like every one try to EMG exam.If someone have emg result like me it may be able to conclusion or scope cause of this symptom\" Thank",
            "post_id": "5743471",
            "timestamp": "1275402364",
            "user_id": "user_1310262",
            "user_link": "/personal_pages/user/1310262",
            "votes": "0"
        },
        {
            "answer": "I am convinced, doctors have no idea what it is and people rely too much on their opinion.  I know one pulmonologist (lung doctor) who has the same problem and can not get rid of it.  He says that sometimes it gets better but never goes away.  I had many tests when it started (no helpful information), but no EMG.  Lets say it came abnormal and they labeled me with myopathy.  That would only made me feel worse, myopathy can progress.  Very uncomfortable test and it would not cure anybody.I see it as a complex problem in origin, that includes disbalance in nutrition, deficiency of some sort to begin with and complete unfitness, deconditioning.  Probably one thing leading to another.  Anxiety follows all of that.Of course I do not know much, but briefly just sharing:The keys to cure might be to have your GI tract (including liver!), really healthy and be able to absorb all nutrients and gradually get fit.  The body can cure itself.  But it does not happen overnight, it is a way, process.. This is whats happening with me now.One of the things that agree with me is food combining theory with the idea of putting your stomach and intestines in optimal conditions to absorb everything nutritios and work efficiently without making the liver toxic. It is available on the web and in books.  Meat works very well for breathing but has to be eaten correctly.  Carbohydrates do not help much, I eat them only for a pleasure and taste.  Vegetables help.  Main destination -balance and exerciseThere is something to do with body PH state.  I understood through it how pranayama breathing works, exercise, exhalation works and we feel better.  But I do not take any supplements, many of them can cause liver disfunction and toxicity and can get your health down the  spiral.It helps me also to have somebody very fit and healthy around as a role model.  Or admire other people fitness and abilities and have it as a destination to go.",
            "post_id": "5779674",
            "timestamp": "1276213771",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "Hi everyone.  Like most of you I am having the same issue.  I've had to go do my own research to try and help myself.  A questions you might want to ask yourself to aid you in your search...do you have a hard time breathing after you have a meal or eat food?  My inability to get a full breathe, I have now noticed, seems to more active after ingesting foods, but can last for a day.  I am starting to suspect that I have a sensitivity to sulfites. If you are still looking for an answer you may want to try to avoid foods and meds that have them.  Wines, grapes, potatoes are just naming a few.  It is a preservative and can be difficult to eliminate, but I dont seem to have as much of a problem when I eliminate sulfites..",
            "post_id": "5780165",
            "timestamp": "1276222002",
            "user_id": "user_1343251",
            "user_link": "/personal_pages/user/1343251",
            "votes": "0"
        },
        {
            "answer": "Naaa10 , You have started to feel and understand your body through pranayam.For others who want to benefit:You will be able to get over this breathing issue. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the breathing problem and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested.",
            "post_id": "5780891",
            "timestamp": "1276243652",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Dear All, Thank you all for writting. I am having a hard time \"Breathing,\" but I am on oxygen 24 hours a day because I was in the ER for what they said was a cold. \"But\" I landed up back in the hospital for double pneumonia. Ever since that, I was having a hard time breathing. I am under a lot of stress but I don't think that is causing it. It hurts so much. I am very uncomfortable.Could it be from the heat? I am calling the doctor because I really am scared. Thanks again.",
            "post_id": "5789353",
            "timestamp": "1276455396",
            "user_id": "user_1345809",
            "user_link": "/personal_pages/user/1345809",
            "votes": "0"
        },
        {
            "answer": "im 19.. and i have the same problem.. im young so idk what it could be.. im getten tested for asma im sry im bad at spelling but i get all the symtoms of asma when i run or do w.e u no the chest buriung tighing cant breath thing.. but im always struggleing to take a deep breath.. and itll last for up to like an hr.. it happen whenever i eat.. i also have tourette syndrom .. not vocal just moter tics..but this one tic i have its a stumic tic and i do my tice 247 but the one when im have the breathing problem and im doen my stumic tic it makes even harder to breath cuz when i do it i like hold my breath and do it so it dosent really make the issue ne better lol  but last night ..it was really bad  deff worst yet..iwas in my friends pool idk if theweather had to do nething with it.. but it was rainy muggy and a lil cool and we went in the pool.so i mean i likethe cold . so it started to happpen again and it justr led to like not wezzing but like more of a faster oast breahing cuz the deep breath wasent coming out.. and then i started to get a lil wozzy  and then it subsighted and its happen right now but not as bad at last night...but neway.. its been happing more and  more latey like everyday it will happen at least once if not more!.. and u no im young im 30 even 30s stil condidered young but u get what i mean im still a child in a sence...so if ne one could tell me what is going on! lol my mom dosetn really wanna listen shes in a bad mood have the time so i dont even bother talken to her aboutt his stuff....and i get like embarssed when this happenes and im around ppl so i dont really say whats wrong.. or y im acting different all of a sudden even if they ask 10 times.. so can u just let me no if u think it could me ashma im geten cheecked for it soo who noes.. or maybe its my anxity but im not really worrying about nething at that moment and itll still happen so.. just please helpp!! ahha thankss in edvance",
            "post_id": "5791775",
            "timestamp": "1276515487",
            "user_id": "user_1346557",
            "user_link": "/personal_pages/user/1346557",
            "votes": "0"
        },
        {
            "answer": "I thought I was the only person with this problem. The way we all describe it is the same \"can't get a satisfying breath\". When I was younger and worked in a mall situation, I was diagnoses with environmental asthma. When out of that situation, asthma symptoms went away, but I am still very sensitive to certain smells, chemicals, etc. Years later I developed this breathing issue. I was working a very stressful job, had all tests done, was told nothing was wrong with me. I worked for a newspaper at the time. I truly believe I was allergic to the ink. Once away from that situation, my symptoms have gone away, although, when I read the newspaper, it does make me cough. My breathing was so bad, I had gone to the ER several times. Check at your jobs/homes, to see if there is something you ae coming in contact with that you are very sensitive to or allergic to. I truly believe this is an allergic reaction to an irritant. The harder to breathe, the more nervous you get, and the worse it gets, exercise, etc. can make worse as well. It truly does affect your quality of life.",
            "post_id": "5792255",
            "timestamp": "1276524683",
            "user_id": "user_1346692",
            "user_link": "/personal_pages/user/1346692",
            "votes": "0"
        },
        {
            "answer": "Hi, I am 23 and I have had this problem for about 15 years on and off, but the last few months it has been unbeareble. Same thing, I am gasping for breath and have to turn it into a yawn before I eventually get a satisfying breath. One other problem I do have is bad breath, I am obsessed with having clean teeth for this problem, brushing, flossing and using mouthwash every day. I have asked my dentist and he said my teeth are one ofthe cleanest he has ever seen so my bad breath is not down to hygiene. I have been the doctor and he seemed to think my breathing and bad breath problem may be connected. He tried giving me tablets for reflux but no change to either. I have googled various bad breath and breathing related illness's but they include regurgitating and heartburn but I don't get either. I am worried there is an underlying problem that the doctor is unable to find...! Does anyone else who has posted about breathing difficulty also get bad breath as I am still trying to figure out if the two are related...",
            "post_id": "5798028",
            "timestamp": "1276635976",
            "user_id": "user_1348393",
            "user_link": "/personal_pages/user/1348393",
            "votes": "0"
        },
        {
            "answer": "You will be able to get over this breathing issue. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the breathing problem and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested.",
            "post_id": "5799793",
            "timestamp": "1276675746",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I love kapalbhati the most, it is my favorite.  I use it a lot during exercises, work outs.  It does give energy.  Forceful exhales, then breathing in happens nicely.  I noticed I can get satisfying breath in even during running now.  People hear it when I am jogging and turn around, but my speed and indurance got better, so I do it only this way now always.  Then I learned to breath only through the nose, in and out.  I've read in pranayama book that breathing through the mouth causes lungs hyperinflation and this is what I had on the chest X ray.  It does help.The most satisfying breaths in I get after something like squats 100 times at once.  I am breathing very deep breaths in then.  I should be doing more just pranyama without exercises probably, but with exercises I am getting it too (seems like).  Probably because I can make more forceful exhales?  I am still trying to figure this out.",
            "post_id": "5812132",
            "timestamp": "1276932264",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "You are discovering your body and feeling the benefits of pranayam by experimenting.You can see a video on youtube, look for 'Baba Ramdev - Pranayam (English)'You will see the other pranayam you can do and also see how kapabhati is done.Your feedback is helping so many people around the world.",
            "post_id": "5818716",
            "timestamp": "1277109753",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I've read many times already that breathing problems might be related to health issues with GI tract.  If there is perfect digestion, then there should be no problems.  I trully believe that in some of our cases there are nutrients absorbtion issues.  Bad breath in particular,  (I 've seen somewhere described) relate to digestion problems and poor absorbtion.  Goes well together with breating problems.I might have indigestion as well but with different symptoms.  I am working on this and see some improvements.  But I can't say I am completely through this successfully to advise anything.",
            "post_id": "5830298",
            "timestamp": "1277330953",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "Probably going to kill myself if I have to live like this another year.",
            "post_id": "5832023",
            "timestamp": "1277367965",
            "user_id": "user_1358149",
            "user_link": "/personal_pages/user/1358149",
            "votes": "0"
        },
        {
            "answer": "I am 22 and I also have suffered with the same shortness of breath for most of my life (from early teens) i have recently beed diagnosed with anxiety but nothing to help with it and no advice either. Previously I have seen physios and chiropractors for an ongoing back problem who have mentioned my breathing maybe related to my back...one even suggested that the nerve at the top of my spine which contorls breathing maybe getting tangled. I have had more back and neck troubles since seeing a chiropractor so I would not reccommend personally. Even when I am at my most relaxed I still have severe difficulty breathing deep breaths so am not sure how connected the anxiety is to the loss of breath. I also have low iron and have tried all the multivitamins and iron tablets but they make no difference. I have had an inhaler as a young child but have been tested since for asthmer but have not had it. I had a heart murmour as a child but apparently that is no connections either. Someone has suggested anti-histamines to me for possible allergies but can't say I have tried it and looking on here not sure it is worth it, besides i dont want to be taking tablets forever. I really hope someone on here eventually has an answer because this is such an uncomfortable condition and sometimes quite embarrasing to explain to people why you are yawning all the time(especially at work!)...its making me pretty miserable. Help someone please!!!!",
            "post_id": "5837223",
            "timestamp": "1277478047",
            "user_id": "user_1359597",
            "user_link": "/personal_pages/user/1359597",
            "votes": "0"
        },
        {
            "answer": "You will be able to get over this anxiety and breathing issue naturally. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the shortness of breath and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested. Anulom vilom will relax you once you can do it for more than 20 minutes.Start today and come back with feedback so others can benefit.",
            "post_id": "5841187",
            "timestamp": "1277573441",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I have the same symptoms as most of you do on and off for several years.  I found something which helps me.  I sit in a sturdy armchair with my elbows on the arms of the chair and raise my body up--like I'm trying to touch my head to the ceiling while pressing my shoulders into the chair back---lo and behold, it lets me take a deep breath every time!!!  After a few times, I breathe normally for awhile.  I was wondering if this could be caused by something as simple as bad posture?  Anyway, try this and I hope it helps!!!",
            "post_id": "5845504",
            "timestamp": "1277687370",
            "user_id": "user_1362017",
            "user_link": "/personal_pages/user/1362017",
            "votes": "0"
        },
        {
            "answer": "Hi everyone , i'm 28 years old and i'm having the same problems , i can't take a deep breath , i was told it was anxiety but all the meds for that made me worse and kicked the crap out of me, i have gotten countless ekg's , chest x rays , blood work , head CT , Chest CT and everything is normal , my dr has given up on me and so has everyone else , the second they see Anxiety in my file they are done with me , and i know that not what it is , after stopping all the meds they had me on i started to feel a little better each day until i played softball and ever since then it has been really bad again",
            "post_id": "5845970",
            "timestamp": "1277698878",
            "user_id": "user_1362174",
            "user_link": "/personal_pages/user/1362174",
            "votes": "0"
        },
        {
            "answer": "Thank you I will give this a try!",
            "post_id": "5847190",
            "timestamp": "1277736670",
            "user_id": "user_1359597",
            "user_link": "/personal_pages/user/1359597",
            "votes": "0"
        },
        {
            "answer": "I've had exactly the same symptoms throughout my entire life (I'm 31 now) but they don't come very often, once every few years. Recently I had another one of such attacks and was desperate. I went to doctors but they seem a bit perplexed. I found this site and it is very helpful. First I was very discouraged, since there does not seem to be a cure. But here is what I've done:1) I took  vitamins right away.2) I do couple of sessions of chi-machine everyday (http://www.energywellnessproducts.com/chimachine.htm).  I seem to notice some acute pain in my spinal cord when I did it first couple of times, but now it's gone3) I try to breath only through my nose as recommended by one of the fellow-sufferer.You won't believe it but the very next day the symptoms disappeared, and this is my second day of being normal! I am so happy. I do not know exactly what is helping but tend to believe that it might be some problem with my spine since i had some issues as a child.",
            "post_id": "5854586",
            "timestamp": "1277895151",
            "user_id": "user_1364869",
            "user_link": "/personal_pages/user/1364869",
            "votes": "0"
        },
        {
            "answer": "I'm having the same problem...but I found out it's caused from a medication I've been taking. I've noticed that it's something that progressively got worse over time and looked up my daily medication side effects on a hunch...voila- The problem is a condition called metobolic acidosis. It's too much acidity in my blood and it causes a buildup of carbon dioxide, which inhibits oxygen from being absorbed. This causes the breathlessness and need for more oxygen...It also causes some chest pain and tightness. Mine won't go away until the medication is completely out of my bloodstream. I have to taper slowely, unfortunately, so that means that I have to take bicarbonate treatments several times a day and fill up on electrolyte drinks (no caffeine, alcohol, or anything that can dehydrate). It tends to get worse during the day because that's when you are active and need more oxygen for your body to function.This condition isn't necessarily caused by medication either...there can be underlying medical conditions that cause it  that have no other symptoms. It only takes a simple blood test to diagnose this, and if left untreated for long periods of time it can cause irrepairable kidney damage...If you're anemic then it's much worse (that's why I'm glad I got diagnosed when I did!)Another tell tale sign that will tell you this could be the problem is if you have flank pain. Whether it's occasional or constant. This doesn't always happen for people, but it's a definate clue to the problem if that is happening.Just an F.Y.I. and something to look into. :)",
            "post_id": "5867108",
            "timestamp": "1278173585",
            "user_id": "user_1368325",
            "user_link": "/personal_pages/user/1368325",
            "votes": "0"
        },
        {
            "answer": "i'm having the same problem... i just can't seem to breathe normally, it doesn't matter wht i'm doing, it's just constant... i'm trying to yawn everytime to catch my breath... dunno what's wrong with me... it's just freakin me out completely, especially as i'm otherwise normal and not suffering from any problem as such.",
            "post_id": "5873945",
            "timestamp": "1278355786",
            "user_id": "user_1370262",
            "user_link": "/personal_pages/user/1370262",
            "votes": "0"
        },
        {
            "answer": "You will be able to get over this breathing issue naturally. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the shortness of breath and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested. Anulom vilom will relax you once you can do it for more than 20 minutes.Start today and come back with feedback so others can benefit.",
            "post_id": "5876169",
            "timestamp": "1278401026",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I am 19 i am guessing this is more common to active people as i have the same problem. I was going to the beach one morning with some friends an as soon as i got out of the car i started getting really bad headacs an my chest was hurting i was really dizzy an light headed feeling as i can pass out any second. i thought i was having a heartattack. I made my friend rush me home were my mom took me to my doctor he told me it was all anxiet related. i took abunch of test an explained my symptoms to all of the doctors that were treating me. Every doctor came back with the same result anxiety an distress related. About 1 month and a week later today i feel much better with out any anxiety attack recently but i still fear not to go far away from my house as this can occur at anytime so i stay with in a distance to my house. I am still a little nervus because i am not able to take a deep breath at will as i will concentrate on it an i think this might make it worst. Some days are definitly better then others as some days all my breathes are short an on other day  only a few of my breathes are short. I am nervus that i wont be able to catch my breath one day. Yawning does make it a lot easier to breath. I think if everybody that has this problem can not focus on it when they are having trouble breathing an just breath because we are just getting nervus of not taking that deep breath all though the short breaths are doing the trick just as well but it takes more then one breath to get the job done.",
            "post_id": "5883044",
            "timestamp": "1278531839",
            "user_id": "user_1372789",
            "user_link": "/personal_pages/user/1372789",
            "votes": "0"
        },
        {
            "answer": "just wanted to make a quick comment. i to had this cant get a breath problem and from what i discovered any time a take anything with a diuretic in it [some prescription diet pills also contain diuretics] the trying to get a deep breath or not getting enough air feeling would start up. apparently when i get dehydrated it causes this feeling to start. so now when i get dehydrated i take potassium and dring lots of water and this seems to take care of it. like the rest of us on here im not prescribing this as a treatment for everyone on here however we could all probably stand to drink more water. ive heard most of us are dehydrated and dont even know it or it comes with symptoms we dont associate with dehydration. hope this helps someone, have a good day!",
            "post_id": "5884621",
            "timestamp": "1278558863",
            "user_id": "user_1373214",
            "user_link": "/personal_pages/user/1373214",
            "votes": "0"
        },
        {
            "answer": "I'm 20 years old and about a month or two ago i sufferred a really nasty panic attack. it was the first one i ever had. It left me in the same condition. Shortness of breathe yawning all day for no reason trying to get a deep enough breathe its really aggravating. However I also no have crazy dry mouth. I have to chew gum all day to keep it moist. I understand the psychological part of it bt it still worries me. Any one having the same issue??",
            "post_id": "5948019",
            "timestamp": "1279932000",
            "user_id": "user_1390841",
            "user_link": "/personal_pages/user/1390841",
            "votes": "0"
        },
        {
            "answer": "WOW!I am 20 years old, and have had this problem since I was 10 or so. For the longest time I thought I was alone in my symptoms - doctors were all puzzled by my needing to \"yawn\" to get a good breath, and the inhalers they prescribed to me did nothing. They all suggested needing to yawn to get a satisfying breath sounded odd, and I have never ever ever gotten any actual diagnosis for my illness.Up until this point, I had assumed I was alone in this, but this is extremely encouraging to see that there are many many many others who suffer from the same symptoms!! I just wish there could be some kind of firm diagnosis or preferably a means of treatment... Right now it seems all over the board and to be purely speculative...",
            "post_id": "5980753",
            "timestamp": "1280738237",
            "user_id": "user_1400358",
            "user_link": "/personal_pages/user/1400358",
            "votes": "0"
        },
        {
            "answer": "hi everyone i have also had the same symptoms this happen to me when i had and anxiety attack and had to be put in the hosiptal i feel like i just cant take a deep breath and the more i think about it it gets worse i take anxiety pill this sometimes help i also get bad cheast pains that come and go and the doctors say that am a hyperchondreiac and that is what causes it  but i think that is bull **** can anyone help me email me josephmc_08***@****",
            "post_id": "5980786",
            "timestamp": "1280739200",
            "user_id": "user_1400367",
            "user_link": "/personal_pages/user/1400367",
            "votes": "0"
        },
        {
            "answer": "Try this to ease the breathing problem.Kapalbhati -(Do it before eating) Push air forcefully out through the nose about once per second. Stomach will itself go in(contract in). The breathing in(through the nose) will happen automatically. Establish a rhythm and do for 20 to 180 times.After this you will be able to breathe normally.There is another technique, anulom volom to help with the anxiety.",
            "post_id": "5980810",
            "timestamp": "1280740035",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I,m a 53 Y/O male suffering through what you all are talking about. In Oct. of 2009 I pulled into the parking lot at work and could not take a deep breath, the next thing I knew I was sitting on the ground in the rain gasping for air. A coworker called a ambulance and I was taken to the ER. After three days in CCU and a multitude of tests all I was told was I had a pulled muscle in my chest and had a reaction to cold medicine. The not being able to take a full deep breath went on from time to time but never stayed long enough to pay much attention. That is until about two weeks ago, I had no cold symptoms of any kind or any other medical complaint I was aware of.Now I find it impossible to take in a deep breath or yawn, I've seen the doctor three times in the last week but all they tell me is I'm having an anxiety attack, which is just what they told me a year ago. One thing that has helped me get in a deep breath is to take in a half a breath through my nose and finish it through my mouth,  sometimes it works and offers a little relief.I,m on my way to Dr. appoint. # 4 tomorrow and hoping for the best. The best way I can explain it to them is to say the feeling is like being under water and trying to breath through a cocktail straw.I am a bike rider and my rides seem to make me feel better.I have checked into this from the scientific to the bizarre, one of the officers I work with told me about an article he read about the Chem Trail Consperisy and an area in Southern California that had a over 300% increase in respiratory complaints in less then six months. I don't know about all that but  I do know that this is effecting my life in a most negative way. I can,t believe that with this many people suffering through this, that no one is looking at this from a medical stand point and saying there needs to be some kind of research. I hope something happens for all our sakes. Best wishes and God bless all of you suffering with this and I Pray hope is near.",
            "post_id": "5996516",
            "timestamp": "1281068245",
            "user_id": "user_1404668",
            "user_link": "/personal_pages/user/1404668",
            "votes": "0"
        },
        {
            "answer": "I'm a 41 yr old female who has been experiencing this problem for over 20 yrs, I chalked it up to smoking, so I quit. Well, it still happens!!  My heart and lungs appear to be healthy so the \"Practicing\" ER Doc blamed the SOB on Anxiety. How can I be anxious when I'm laying on a soft sandy beach in Hawai'i..........? It feels as though I'm taking a normal breath yet @ the same time, it feels like nothing is going in. The sensation comes and goes for NO reason. Sadley, it has just become a part of my life, and no, breathing exercises DONT HELP. Thank you to all who posted, it really made me feel like I'm not alone. I may follow up on some of the possible causes. The only advise I can give is, when it starts try to keep your mind on something else. I know it's hard and sometimes impossible. Maybe I've become sooo used to not being able to breath, it's just second nature, sad huh? Blessings",
            "post_id": "5996555",
            "timestamp": "1281069515",
            "user_id": "user_1404720",
            "user_link": "/personal_pages/user/1404720",
            "votes": "0"
        },
        {
            "answer": "Strange you mention the Chem trail theory, I too live in SoCal and have so my entire life. I've heard of the Chem trail tails, and in all honesty, it would not surprise me! The Government does control everything, including our food and drugs. InterestingI have noticed some posters on here from the UK so maybe it's something in the air, allergies can cause alot of problems.",
            "post_id": "5996607",
            "timestamp": "1281070688",
            "user_id": "user_1404720",
            "user_link": "/personal_pages/user/1404720",
            "votes": "0"
        },
        {
            "answer": "I didn't think as many people had this same problem, wow.My name is Kim, I've just turned 19 and have had this problem for a very long while, and when I try to explain it to people they never seem to know what I'm talking about as they have never really experienced it! I've been told by a few people, however, that this can be associated with stress - I would find this a perfectly acceptable reason but, I'm not stressed at all, I'm very happy with my job and enjoy it thoroughly and I have no other reasons to be stressed at all. I also find that the yawning technique works quite well (well, when it does actually work) but I shouldn't have to yawn every time I need to inhale deeply, every time I need to take a deep breath, I find that I have to stretch mu upper body in order to make sure that there is no restriction to my airways that could be cause by the way I'm sitting/standing etc (strange I know!). I get the urge to breathe in deeply a lot more now too and it's very frustrating that I can't do so!If anyone knows anything that can possibly help with this I'd appreciate if you could get back to me. I've tried breathing exercises and relaxation techniques but none of this seems to help.I know how everyone feels and I hope that you aren't suffering too much; it's an absolutely horrendous thing and is one of the most frustrating things I've experienced!",
            "post_id": "6007027",
            "timestamp": "1281358430",
            "user_id": "user_1407822",
            "user_link": "/personal_pages/user/1407822",
            "votes": "0"
        },
        {
            "answer": "Have you done kapalbhati?",
            "post_id": "6007680",
            "timestamp": "1281371283",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I think we should all list our ages & anything we can think of that could possibly be related to this & see what things in common are found.  I've noticed almost everyone who posts witht his problem seems to be a pretty frequent exerciser, (as I am).  So, let's list some things & see what we come up with:  These are things about me that could relate to this yawning problem.53 years old--going through menopause--Yawning started after menopause.Have had frequent sleep problems since menopause & chronically take over the counter sleep medications (almost every night).Sit at a computer all day (have had this job for years).Exercise about 5 days a week.Take yoga--several months ago did a twist pose & seemed to twist too far & got terrible pain around ribs & started gasping for breath.  Eased up the same night--yawning did not start until a month or so later.Was in a car accident in my 20's & fractured 3 of my ribs.Do not smoke, do not drink, but have smoked pot over the years since I was about 13 (but not a heavy smoker).I have sinus problems & get migraines (that seem to be related to sinus).  Take migraine medication (only when I get a migraine which is maybe 3 or 4 times a year).I sit in an office where an employee near me wears heavy perfume, and I've been breathing this for a couple of years.  I have extreme sensitivity to perfumes & strong smells.  When I smell perfume, I get an instant feeling of not being able to breathe & often go into migraines as well.I had tests done by my doctor who said I did not have asthma, but did find that air seemed to trapped in my lungs and was not being expelled the way it should.  However, he did not know why & I have not yet been to see a pulmonary doctor.My yawning doesn't seem related to anxiety to me, but it did begin not long after I had been through a death in my family (that involved several months of driving back & forth to a hospital two hours a way every weekend) and then another death of a friend by drowning that was unexpected & horrible.  So, I don't know if I developed anxiety during that time that hasn't stopped or what.I am not overweight, but I do have a little extra weight in my stomach & I have always had a very small waist (and I assume ribcage).  I wonder sometimes if the stomach pressing on the lungs can cause this.",
            "post_id": "6008020",
            "timestamp": "1281376311",
            "user_id": "user_1408111",
            "user_link": "/personal_pages/user/1408111",
            "votes": "0"
        },
        {
            "answer": "Thank you all for your posts! I had no idea how many other people were suffering with the same issues I've been experiencing. I'm 39 years old now, but when I was 32 I started experiencing the feeling that I couldn't get a deep breath. Night time was absolutely the worst although it would happen during the day too. I would just be busy doing normal things and I would become really aware of my breathing and need to yawn constantly. I have never had trouble sleeping in my life except when these episodes would occur. I would dread going to bed and trying to fall asleep which is completely abnormal for me. No matter what i tried, deep breathing techniques, excersizing, etc. it just always felt like I wasn't getting enough oxygen and i would get light headed and feel like I was going to pass out although I never did and my heart would race or feel heavy and irregular when it was beating. I had this for about 9 months and I went to the Dr. once during that time and he told me it was anxiety. As many of you have stated, I didn't have anxiety or stress in my life at the time, but when the symptoms appeared, they definitely brought on anxiety. I did have back pain during this time and I was fasting at points so dehydration and misalignment in my spine could have been factors. After 9 months I was healed of this and until 6 weeks ago I didn't have any of these symptoms  again. What brought it on again, I have no idea. I do have some stress at work right now and I have some upper back pain/stiffness. I probably am not drinking enough water and I may be lacking in some vitamins. I am going to continue to pray, make an appointment with a chiropractor, drink more water and take a vitamin supplement and I'll let you know what happens. Blessings to you all and may God's peace be with you!!",
            "post_id": "6011114",
            "timestamp": "1281445963",
            "user_id": "user_1408973",
            "user_link": "/personal_pages/user/1408973",
            "votes": "0"
        },
        {
            "answer": "Hello everybody,I HAVE SOMETHING MIGHT HELP YOU ALL!! YOU SHOULD TRY IT & LET US KNOW.I'm Saudi Male, Over-weight, 30 years old, smoking Shisha once a day and living in Saudi Arabia. Same symptoms (No satisfied breathing unless with Yawing or waiting couple of minutes, with little pains or continues little pressure on the chest sometimes). I was following your posts here in weekly basis & then found something improved my case & hope it will help so.It was started with me since 4 months (April 2010) suddenly without any previous diseases like Asthma, Allergy, Anxiety,…etc.Like everybody here, its start was very terrifying & scaring. So, in first time, I have visited ER to check & after X-Ray & Blood test, they said you have nothing. Then, I have decided to do FULL Checkup including (ECG, Spirometer & Lungs Size Tests) & all results showed I’m OK with only deficiency in Calcium & Vitamin D plus Cholesterol was little bit high. Doctor prescribed only supplemental Vitamin D & Calcium (1200 mg daily) but I didn’t take the medicine daily in the beginning & he said you don’t have something inside the chest and might be in chest wall & anxiety without any more advice.I did many searches in the internet & have decided to stop taking Supplemental Nutrition (Multi-Vitamin) Products since I found in searches that they may cause tension in respiratory muscles. But unfortunately, no improving was noticed!. Then, I have found in some searches that deficiency in Calcium might cause the tension in all muscles!!Since ONE Month, I have decided to try taking the prescribed medicine to supply my body with Calcium & Vitamin D, NOW I felt the difference!!!My case is improved & I can say the pressure specially is disappeared but shortness is still there but significantly less than before.MY ADVICE IS:If you are free from Asthma, I think the reason of our symptoms is the tension in respiratory muscles due to deficiency in Calcium & Vitamin D, which is a conclusion I have reached by myself not by doctors. So, please do full checkup plus check your Calcium & Vitamin D, then, try to watch yourselves & let us know.MY NEXT TWO STEPS ARE:1- I will try my best to lost weight & see if it works or not.2- I will focus on chest exercises to stretch chest muscles more as recommended by an Orthopedic.Frankly speaking, I’m so disappointed from concerned doctors since they didn’t take it more seriously in analyzing our symptoms.I will translate my experience to Arabic Language in next post because unfortunately I didn’t find any Arabic website covering such symptoms!!Looking forward to hearing from you.Wish you healthy & satisfied life,Nasser",
            "post_id": "6012598",
            "timestamp": "1281469584",
            "user_id": "user_1409255",
            "user_link": "/personal_pages/user/1409255",
            "votes": "0"
        },
        {
            "answer": "أعزائي القراء .. و رمضان مبارك على جميع المسلمين ،،أنا رجل سعودي عمري 30 سنة لدي زيادة في الوزن وأدخن المعسل مرة كل يوم ، أشكو مثل الكثير هنا من عدم إكتمال التنفس العميق منذ 4 شهور بدون أي مشاكل مرضية سابقة (ربو أو حساسية صدر) وكنت مضطراً للتثاؤب أو الإنتظار لدقائق للإحساس بنفس عميق مع ضغط بسيط مزعج في وسط الصدر أو ألم بسيط مستمر في جدار الصدر.في البداية راجعت غرفة الطوارىء وقالوا أني سليم ثم عملت فحص شامل للجسم تضمّن إختبار التنفس وحجم الرئتين وتخطيط القلب) وجميع الفحوصات تشير أني سليم 100 % ماعدا نقص في الكالسيوم وفيتامين (د) وارتفاع قليل في الكلويسترول ، وقال لي الطبيب أن الصدر من الداخل سليم وقد يكون السبب قلق وتوتر فقط أو جدار الصدر. ثم وصف لي حبوب (1200 مجم) كالسيوم وفيتامين د يومياً ولكني لم أحرص على تناولها بإنتظام.كنت استخدم منتجات أرمال (الفيتامينات المتعددة) ثم بعد بحث طوييييل في الإنترنت وجدت للأسف كثرة الفيتامينات التي تزيد عن حاجة الجسم قد تؤدي إلى تشنج العضلات (وعلى فكرة عندنا في المواقع العربية فقر شديد بالمعلومات الطبية التي دفعتني للبحث في المواقع الإنجليزية) ثم وجدت أيضاً أن نقص الكالسيوم في الجسم قد يؤدي إلى تشنج العضلات وليس فقط تأثيره على العظام !!بعدها قررت الإنتظام على علاج الطبيب ولاحظت بعد شهر واحد تحسن واضح وخصوصاً الضغط على الصدر اختفى ولكن عدم اكتمال النفس العميق كان يجي و يروح بين فترة وفترة.لذلك انا حبيت أشارككم تجربتي لعلها تفيد شخص مصاب مثلي تعب من عدم تشخيص الأطباء لحالته وتعب أكثر في البحث بالمواقع العربية.خطتي القادمة خطوتين:1- محاولة تخفيف وزني إلى الوزن الطبيعي ومراقبة مايحدث و سوف أخبركم بكل جديد2- محاولة التركيز في التمارين الرياضية على شد عضلات الصدر حسب توصية إستشاري عظام.أرجو منكم تجربة مانصحتكم به ثم مشاركتنا هنا بما استجد معكم لكي تعم الفائدة.بصراحة الأطباء خيبوا ظننا فيهم بعدم أخذهم هذه الأعراض على محمل الجد!!أمنياتي الصادقة للجميع بوافر الصحة والعافية ،،ناصـر",
            "post_id": "6012625",
            "timestamp": "1281469998",
            "user_id": "user_1409255",
            "user_link": "/personal_pages/user/1409255",
            "votes": "0"
        },
        {
            "answer": "I am so relieved so many people have the same problem!I am the same story as most people - young, very fit and healthy, and find sometimes when i exercise i just can't breathe in enough air to fill my lungs. it makes it hard to do a session not because of fitness, but because i can't breathe properly. Nasser made some interesting points but i think it's very unlikely i would be calcium or vitamin d deficient. sometimes i wonder if it is related to when i am tired, but i think that might be just because the 'cure' is to yawn!any solution would be much appreciated!!!",
            "post_id": "6014558",
            "timestamp": "1281505736",
            "user_id": "user_1409886",
            "user_link": "/personal_pages/user/1409886",
            "votes": "0"
        },
        {
            "answer": "Do this before you start your exercise and at the end.Try this to ease the breathing problem.Kapalbhati -(Do it before eating) Push air forcefully out through the nose about once per second. Stomach will itself go in(contract in). The breathing in(through the nose) will happen automatically. Establish a rhythm and do for 20 to 180 times.After this you will be able to breathe normally.",
            "post_id": "6014840",
            "timestamp": "1281519351",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I'm an 18 year old active Canadian male who has never smoked. My BMI is 17, so yes, I am extremely skinny. I too have this eact same problem for the last ten years of my life. My mom keeps telling me that its anxiety but I know that it's not anxiety because there's nothing I'm anxiuos or stressed about. I'm glad to know that there are people out there who share this same problem, and that this is not just happening to me.It seems like wherever I go, whoever I'm with, and whatever the time of day it is, I can never get a deep breathe from my chest. Instead, I seem to be panting through my nose- never through my chest- which causes me to become very light headed and forgetful of things. I yawn about twice a minute when I get bored, but its an obnoxoius yawn- not out of tiredness, but out of needing to inhale enough oxygen.I don't know how I'll ever be able to function again as a \"normal\" human being. The problem haunts me 24/7, just not in my sleep, and it appears to be getting worse every day. I can barely have a half- decent conversation even with the ones I love most, nevermind co-workers or schoolmates.This problem has literally consumed my life.Let's try this: Everyone, fill out this little poll I made, just so we can have some general information about who is most susceptible to having this problem. I'll go first.Age:  18Sex:  MBMI: 16.9Smoker: NeverActive: YesStarted having 'breathe' probelms at age: 10What the doctors said: AnxietyTraumatic experiecne: NoFrequency: Always, no exceptionsDescribe 'it': light headedness, dizziness, fear of not breathing, sweatingLost friends because of it: YesDo feel 'angry' all the time: YesHas it 'consumed' your life: YesThanks alot, everyone. I hope the problem stops. We can only be our selves and pray for the very best.Harlan",
            "post_id": "6067107",
            "timestamp": "1282742536",
            "user_id": "user_1424891",
            "user_link": "/personal_pages/user/1424891",
            "votes": "0"
        },
        {
            "answer": "You will be able to get over this  breathing issue naturally. See my post of Feb 23, 2010 and do the kapalbhati and anulom vilom to get over the shortness of breath and get back to normal. Kapalbhati will expel some of the stale air sitting in the lungs.You can also do the other exercises suggested. Anulom vilom will relax you once you can do it for more than 20 minutes.Start today and come back with feedback so others can benefit.Do 5 to 20 strokes of kapalbhati now, and send your feedback.",
            "post_id": "6070561",
            "timestamp": "1282811781",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Hey everyone. I'm a 16, soon to be 17 year old suffering from the same thing. Its a relief to hear that I'm not alone and that apparently everyone's doing fine.I think after reading all of this I have come up with the cause and at least a solution (hopefully.)I constantly suffer from anxiety attacks, attacks where I feel trapped and like I might die at any moment and things of that nature. My mind is always thinking on what is, or will, or has gone wrong. Worst case scenarios. I often pray for many things to not go wrong that I simply create in my own little mind. I cannot ever seem to relax, nor can I seem to \"let go\" of my problems, even if they are fabricated in my mind.Lately I've been unable to get good breaths and it caused me to feel more trapped and panic even more. After reading this I think our breathing problems are mostly mind set, which I had thought of before. However, when one panics, one breathes through their chest, and feel short of breath, thus requiring a yawn or deep breath to try and get air. If you calm and focus on breathing with your diaphragm however, I think it helps.Lately I have also been drinking Rockstars and coffee and various other caffinated beverages. These seem to heighten my anxiety when I'm not doing things, and thus cause the attacks more frequently.This of course can not be found by doctors for it is a mind born illness. I do not know how to calm these attacks yet, but I need to try to learn soon. I do not wish to live like this any longer.Best of luck to us all and hope that God helps us.Oh, and I'm skinny and fairly good athletically. Even today I ran around for quite some time without being out of breath which made me wonder about this breathing thing. Glad I saw this site. Thanks guys, hope I helped.",
            "post_id": "6083580",
            "timestamp": "1283133542",
            "user_id": "user_1429565",
            "user_link": "/personal_pages/user/1429565",
            "votes": "0"
        },
        {
            "answer": "hello,omg i am in the same boat as you all! i feel like i just cant get a deep anough breath, im only 24 years old, im a tiny bit over weight now due to i have just had a baby, however i have been dealing with this since i was probably about 15 years old, and i have always been a perfect build until now. So omg what is it!! i dont have asthma, never have!",
            "post_id": "6097085",
            "timestamp": "1283428806",
            "user_id": "user_1433312",
            "user_link": "/personal_pages/user/1433312",
            "votes": "0"
        },
        {
            "answer": "I AM GOING TO FIND A CURE ..BELIEVE IT .ILL BE BACK WHEN I DO ...DETERMINED!",
            "post_id": "6146411",
            "timestamp": "1284612387",
            "user_id": "user_1447460",
            "user_link": "/personal_pages/user/1447460",
            "votes": "0"
        },
        {
            "answer": "I have had a same problem .I found website about da costa syndrome.http://users.sa.chariot.net.au/~posture/DaCosta%27sSyndrome.html",
            "post_id": "6167691",
            "timestamp": "1285120287",
            "user_id": "user_1310262",
            "user_link": "/personal_pages/user/1310262",
            "votes": "0"
        },
        {
            "answer": "Hi,I am a 17 year old male, and I have been having these symptoms for about 3 months now, and they have gotten progressively worse. I do not smoke or drink, nor have I. It started with mild discomfort, and in the last couple of days, has become exponentially worse. Even as I am typing this, I find it more comfortable to breathe in once, as deep as possible, wait 2-3 minutes, then do it again than to breathe \"normally.\" There is a tightness in my back, between the shoulders and I can not get a \"full\" or \"satisfying breath. They have me on a ton of pills and some inhalers, but nothing is working. I have done many breathing tests, and come up with nothing except my lung function is low. At first they found an infection, which they treated successfully, but the symptoms persisted. Then they believed to to be silent reflux mixed with an inflammation of my vocal chords... They have been treating that for a few weeks, to no avail. Yesterday, I went to my allergist, and did yet another breathing test and treatment. They told me my lung function was low, so they were going to give me an Albuterol breathing treatment, and preceded to do so, only to be confused by the fact that my lung function decreased by 42% from the original. Is there anything anyone can do to help? I'm just afraid its gonna get so bad that one of these days I'm either going to wake up in the hospital or not wake up at all, it's deteriorating so quickly anymore...",
            "post_id": "6171460",
            "timestamp": "1285203602",
            "user_id": "user_1454127",
            "user_link": "/personal_pages/user/1454127",
            "votes": "0"
        },
        {
            "answer": "You can do something yourself. Follow this carefully and restore your health. Do not give up, as it works gradually.The Yog Pranayam (breathing exercises) will  help you relax and also help with the breathing difficulties.You will notice benefits in days.Initially do kapalbhati 20 times and anulom vilom for 2 minutes, several times a day. When your breathing improves, do all the the pranayams in order, as described.Come back to report your progress, so others can benefit.Build up your timing gradually. If you feel tired or dizzy, stop and resume after 1 minute.Bhastrika - Take a long deep breath into the lungs(chest not tummy) via the nose and then completely breathe out through the nose. Duration upto 5 minutes.For one minute, keep your fists, with the thumb pointing up, on your legs,above the knee, while doing bhastrika.Repeat this with the fists pointing down and thumb resting on the legs.Kapalbhati -(Do it before eating) Push air forcefully out through the nose about once per second. Stomach will itself go in(contract in). The breathing in(through the nose) will happen automatically. Establish a rhythm and hold your head steady. Not for pregnant women. Seriously ill people do it gently.Age over 15 years -do this for 20 to 30  minutes twice a day.Age under 15 years -do this for 5 to 10  minutes twice a day.Anulom Vilom –Close your right nostril with thumb and deep breath-in through left nostrilthen – close left nostril with two fingers and breath-out through right nostrilthen -keeping the left nostril closed  deep breath-in through right nostrilthen - close your right nostril with thumb and breath-out through left nostril.This is one cycle of anulom vilom.Age over 15 years -Repeat this cycle for 20 to 30  minutes twice a day.Age under 15 years -Repeat this cycle for 5 to 10  minutes twice a day.You can do this before breakfast/lunch/dinner or before bedtime or in bed.Remember to take deep long breaths into the lungs.You can do this while sitting on floor or chair or lying in bed.Bhramri Pranayam -Close eyes. Close ears with thumb, index finger on forehead, and rest three fingers on base of nose touching eyes. Breathe in through nose. And now breathe out through nose while humming like a bee.Duration : 5 to 12  timesOnce you are better, continue the pranayam once a day.Be patient, as the benefits will show up gradually.Only by doing you will benefitand feel good because you are helping your body.Those who say I have tried everything....will be amazed at the result of doing pranayam.",
            "post_id": "6172506",
            "timestamp": "1285235254",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I have had this all my life and am 61.  When I get it, I start using Afrin for a few days and make myself breath through my nose.  I also make myself NOT dwell on it.  After a while, I forget about it and it goes away for years. I started it again a few days ago and thought I might be having a heart attack and then remembered what to do.  GET YOUR MIND OFF IT!",
            "post_id": "6173138",
            "timestamp": "1285254668",
            "user_id": "user_1454675",
            "user_link": "/personal_pages/user/1454675",
            "votes": "0"
        },
        {
            "answer": "I have had this problem off and on-- what a relief to see I'm not alone.  The last time I had it, I found relief from my massage therapist (who is especially skilled and a good diagnostician).  He figured out that my diaphragm muscles were very tight.  After he had loosened them up, I was fine!I'm experiencing the problem again now (over the last few days)-- I think it's time to make another appointment with this guy. And I will also practice the breathing exercise posted above.Thanks, everbody!!",
            "post_id": "6179816",
            "timestamp": "1285402170",
            "user_id": "user_1456368",
            "user_link": "/personal_pages/user/1456368",
            "votes": "0"
        },
        {
            "answer": "Start doing the pranayam, to relax your diaphragm muscles and you will not need the appointment.",
            "post_id": "6180231",
            "timestamp": "1285420833",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Hello sheilaspurgeon,PLEASE PLEASE PLEASE...Explain more about loosening your diaphragm muscles & what was done by your massage therapist.I asked two massage therapists & they said we don't know special massage for diaphragm muscles!!Appreciate your help in advance.To give everybody an update about my case since last post 10 Aug 2010:after loosing some weight (6Kg) & having less fat in the food, I felt a little improvement & I will keep loosing & see.",
            "post_id": "6182691",
            "timestamp": "1285495080",
            "user_id": "user_1409255",
            "user_link": "/personal_pages/user/1409255",
            "votes": "0"
        },
        {
            "answer": "Add me to this list- must be half the human population. Im a 57 year old guy, same annoying problem. Doctors don't know Jack **** (nothing personal, Jack) ! It's obviously complicated but it seems to be connected to the diaphragm and being able to relax- which ain't so easy in this insane world. With me, it gets worse when i don't exercise and eat. I tried a breathing excercise we do in yoga called pranyam and it seems to help relax the diaphram, as long as you take your mind off it for a minute or so. Here is how to do the exercise. Sit up in a comfortable position with your spine straight. You can be on the floor or in a chair. Start exhaling in short punchy breaths, about 2 exhales per second about 50 to seventy times. Don't worry about the inhale, it will come automatically. Practice this as often as you like, it's non-addictive with absolutely no side effects. If nothing else, you will feel better because of all that wonderful oxygen getting to your lovely brain. Meditation is also a great way to de-stress and give you some self awareness which is a whole lot better than vegging out in front of the TV. One more antidote you might try is laughing hysterically at some sill thing for 5 minutes. Easier said than done for us mature and responsible adults- maybe that's really our problem!",
            "post_id": "6200130",
            "timestamp": "1285886310",
            "user_id": "user_1461862",
            "user_link": "/personal_pages/user/1461862",
            "votes": "0"
        },
        {
            "answer": "Just sharing  what happened to me regarding this..I've had this breathing problem for about 7 years. I am 38y.o.   I've been on antibiotics a lot through my life for different reasons.  My breathing got so worse about 6 months ago, at the time I found I had a tapeworm.   After a course of a/b my breathing got even worse.  Then I had teeth work done, again a doze of a/bs.  The way I looked could be described as \"failure to thrive\".  It took me a while to realize I had malabsorbtion.  I started taking probiotic complex with Acidophillus 2 months ago.  Also garlic pill twice a day, I do abdominal exercises for at least 30 min every day, do pranayama (love it), + trying to have a balanced diet with proper food combining and it is coming back to normal.  Amazingly my malabsorbtion symptoms disappearing, I look much better, definetly more lively and happy and breathing is so much better, I would describe it as coming back to normal, effortless.  Even when I do jogging now I do not have to put much force on exhales, as before - it happens naturally.  I can stand long hours without food and not getting the feeling like I am not getting enough breath..Somebody wrote on holistic sites that lung problems might be related to problems with GI truct. In my case it was probably true.   I might still have some gastritis.  Probiotic made a big differense for me.   It did not happen in one day though. It felt like there was small recovery every day, slow, steady and accumulating.",
            "post_id": "6221289",
            "timestamp": "1286417367",
            "user_id": "user_1182506",
            "user_link": "/personal_pages/user/1182506",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing the same thing for the last couple of years. Personaly I really think it is allergy related, as it gets so much worse at certain times of year. It also gets alot worse after drinking wine (which I am slightly allergic to). I am pretty sure its nothing to worry about",
            "post_id": "6355361",
            "timestamp": "1289766078",
            "user_id": "user_1506708",
            "user_link": "/personal_pages/user/1506708",
            "votes": "0"
        },
        {
            "answer": "I'm 16 this year. Up until now, I've only had moments of being unable to breathe satisfyingly occasionallly and increasingly, but I started havinging the problem nearly 24-7.My parents dismiss it completely and it's probebly because both sides of my family have/had asthma, allergies to msg, severe stress, heart conditions, severe allergies to pollen, weight issues, we have animals, and there's black mold in the bathroom. Also, I get extremely stressed out when I have to be in public (I'm still in school), I had a reduction mammoplasty, and I've been dehidrated recently.But all my symptoms are exactly the same! I haven't had problems with my heart skipping beats recently, but when I can't breathe, I get almost the same cold, stressed, sick feeling as if it was a skipped beat, only  less powerful and constant. I think that's what causes for me to get heartburn.",
            "post_id": "6371224",
            "timestamp": "1290124239",
            "user_id": "user_1511186",
            "user_link": "/personal_pages/user/1511186",
            "votes": "0"
        },
        {
            "answer": "SO GLAD that im not the only one with this! I'm 19 years old, 160 pounds, and i was in Europe for the summer where i noticed that i was having trouble getting air into my lungs, and the only possible way to get air into my lungs was either yawn (which never always worked) or just get lucky on a breathe. I think it started because i went to alot of clubs and was exposed to alot of cigarette smoke! I thought this condition was allergy related. This really irritated me because i started getting scared, when i came back to LA i went to my doctor and he said i was fine after doing a peak-flow meter test on me. I later went and saw an allergy specialist and he said there was swelling in my nose, although i found no real connection between the two, but later told me to go see a Pulmonologist. I will go see one and let you all know my status, (FINGERS CROSSED)",
            "post_id": "6381594",
            "timestamp": "1290414775",
            "user_id": "user_1514146",
            "user_link": "/personal_pages/user/1514146",
            "votes": "0"
        },
        {
            "answer": "It is called hyperventilation syndrome!!! Most doctors do not know about this. If you want to rid yourself of this you must read this now. Do it! it will change your life!Do you constantly feel tired, worn-out, blurry-eyed, and fatigued? Does it seem that you are always anxious, panicky, and in a bad mood? Do you find it difficult to catch your breath even when you aren’t engaged in any type of physical activity? Do you worry that you have a serious disease that no one can diagnose? Have you spent countless hoursvisiting doctors who have no answers for your strange and mysterious symptoms? Have you lost your sense of excitement and vigor in life?If you answered “Yes, that’s me!” to most of these questions, I want you to know that there is hope. Unsure if life will ever be the same, many who continually experience these feelings launch a desperate search for answers as to why these “unexplainable”symptoms are plaguing them. I was one of those people, and I’m glad to tell you that the energetic life you once knew can – and will – return. Regaining your health and happiness is much easier than you think! As you well know, breathing is an essential function of life. Without the continualexchange of air through our lungs, life will cease in a matter of minutes. Any way you look at it, breathing is the most important function performed by the complex and intricate mass of cells, neurons, and tissues we call our bodies. One fact which many fail to realize is that not all breathing is the same. Sure, the general concept of air exchange holds true, but the efficiency and mechanics by whichthe breath occurs is of paramount importance. Efficient, well-balanced, and controlled breathing is synonymous with healthy breathing. Healthy breathing provides life, energy, and a calming sense of peace to the otherwise hectic lives we lead. I’ve had to learn about healthy breathing the hard way – by experiencing the detrimental and frustrating health effects of inefficient, unbalanced, and unhealthy breathing. After a prolonged period of sub-optimal breathing, an autonomous breathing pattern is formed which becomes difficult to correct without the proper know-how. This chronicbreathing imbalance is known as Hyperventilation Syndrome (HVS) – a condition that can wreak havoc on your physical and emotional well-being. HVS is a common affliction suffered by many, but one that often goes unrecognized and untreated. One group of researchers has referred to HVS as “the silent epidemic” while others have suggested that nearly 20% of the population suffers from this condition. Some studies have even suggested that overbreathing and chronic hyperventilation lead to nearly 40% of all physical and emotional symptoms for which patients visit their doctors. As a former HVS sufferer, I believe it! The information contained in this book is meant to help you recover from this affliction and regain your sense of self. In a relatively short period of time, you will find yourself well on the road to recovery and should begin to see moderate results almost immediately.When it comes to curing Hyperventilation Syndrome, knowledge is power. Once you understand HVS, the symptoms that it creates, and what you can do to overcome its grasp, you can banish it forever. My life and good health are proof of this fact!Get the entire eBook at this site. IT WILL CHANGE YOUR LIFE!!!God bless!!!http://www.hyperventilation-syndrome.com/",
            "post_id": "6398893",
            "timestamp": "1290918840",
            "user_id": "user_1480511",
            "user_link": "/personal_pages/user/1480511",
            "votes": "0"
        },
        {
            "answer": "As in title, anyone read this book?Please would you recommended this e-book?Thanks",
            "post_id": "6399381",
            "timestamp": "1290944037",
            "user_id": "user_1519195",
            "user_link": "/personal_pages/user/1519195",
            "votes": "0"
        },
        {
            "answer": "I just had a though that maybe it has something to do with whether or not we used our abdomin for breathing a lot? I know I only learned last year that it's important to do so, so maybe the muscles or tisues are weak and can get stretched out or irritated? Also, I read that cayenne pepper is extrememly healthy and can help blood circulation and lungs work better (among other things) so hopefully that might help. (I advise you look it up before you try it and maybe ask a doctor)",
            "post_id": "6415112",
            "timestamp": "1291331796",
            "user_id": "user_1511186",
            "user_link": "/personal_pages/user/1511186",
            "votes": "0"
        },
        {
            "answer": "I have been dealing with shortness of breath, or what I call an inability to get a full, deep, satisfying breath. Its like I breath in, and it stops halfway and won't circulate all the way through. I too constantly yawn in order to get a satisfying breath, but too much yawning builds up pressure in my head and also makes my chest and back muscles feel very constricted. I have been going on 8-9 years of this with no answers either. I have been diagnosed with asthma, but nothing they give me for it helps. I try to argue that it isn't asthma but the doctors won't listen. I quit taking inhalers and started studying natural remedies. I took an herb called Lobelia for a few years with great results, but it slowly started to not be helping as much. I am now pretty convinced its a magnesium deficiency. I ordered magnesium chloride oil online as magnesium is best absorbed through the skin. I also take oral magnesium which should be taken with calcium so it can absorb. I have had great results when I remember to use the oil daily and not just at the onset of the difficult breathing. Hope this helps!",
            "post_id": "6417432",
            "timestamp": "1291394157",
            "user_id": "user_1524315",
            "user_link": "/personal_pages/user/1524315",
            "votes": "0"
        },
        {
            "answer": "To the person that had the information on hyperventilation syndrome, (KXA1971)  thank you.  I did some research and I really think that's what most of us are suffering from.  Look into it everyone because I think it will provide you the help you need.",
            "post_id": "6428907",
            "timestamp": "1291729373",
            "user_id": "user_1527552",
            "user_link": "/personal_pages/user/1527552",
            "votes": "0"
        },
        {
            "answer": "I am a 47 year old male and have been having this problem for about 5 years now.  I am very relieved to find out there are many others out there experiencing the same problem.  My doctor keeps telling me it is anxiety and I was actually beginning to think I was having mental issues.  My problem is that it impacts my ability to exercise because as soon as I start exercising, I get very lightheaded and feel like I am going to pass out and have to stop.Any suggestions or ideas on how I can get past this problem?",
            "post_id": "6433596",
            "timestamp": "1291839690",
            "user_id": "user_1528948",
            "user_link": "/personal_pages/user/1528948",
            "votes": "0"
        },
        {
            "answer": "The pranayam described in my post of Sept 23, 2010 will help you with the breathing problem. Let me know how you feel after 21 days, and your feedback will help others.",
            "post_id": "6435670",
            "timestamp": "1291893217",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "I am going to post more about this later, but after my husband read this thread, we wen't looking through our cabinets, as we thought it was a reaction to oil based paint, but in fact it is polysorbate 80.  I cannot believe it.  I have traced back to the situations where I was having a lot of difficulties, and it is in the QFC whipping cream that I use in my coffee, every morning and through out the day.  After some prayer last night, the Lord dropped it into our laps!  AMEN!  I already feel so much better.  We are going to write an article about this.  My symptoms were exactly the same as the original poster.  I was sufficating!!  It turns out a lot of her symptoms, and mine are reactions to the polysorbate 80.  These people who lace our food with chemicals, should be brought to justice.  The worst part of this whole thing is not knowing the cause.  LOOK INTO your food cabinet, and research all the chemicals and see if that is the problem.",
            "post_id": "6452279",
            "timestamp": "1292352631",
            "user_id": "user_1534193",
            "user_link": "/personal_pages/user/1534193",
            "votes": "0"
        },
        {
            "answer": "Try magnesium!!!! I have also been suffering from the inability to get a deep breath, with the constant need to yawn for 8-9 years now. Doctors kept saying it was asthma, even when none of the inhalers worked. I got sick of it and started doing my own research. I found that magnesium deficiency can cause all kinds of problems, including the feeling of not being able to get a deep breath, with the feeling of needing to yawn. I have been taking a magnesium supplement for awhile now, along with calcium, as you need calcium for the magnesium to absorb. Anyway, when I take these regularly, I rarely notice a problem breathing. However, if I run out, and don't take them for awhile, the symptoms come right back. It sounds like so many of us are suffering from the same thing, with no answers, and I feel like magnesium deficiency is very likely the cause!",
            "post_id": "6464352",
            "timestamp": "1292679517",
            "user_id": "user_1524315",
            "user_link": "/personal_pages/user/1524315",
            "votes": "0"
        },
        {
            "answer": "Thank you all so much for your posts.  I am a 27 year old female, very healthy, slim, non smoker, red wine drinker :)I started with the same symptoms as the original poster on a flight to Europe three months ago.  I fly a lot for work have for the past 5 years. I always experience nervousness, but this was the first time for the breathing issue.  While on the plane after the shortness of breath started, I had really bad heartburn.This issue continued through my entire visit to europe and upon returning to the states, I saw my GP. He said that causes of SOB in girls my age is usually associated with Acid Reflux.  I took Prilosec and it got better for a week or so and then went away.  So I thought, \"yay - its just acid reflux!\"But now its back and I returned to the Prilosec with no relief this time, and its worse.  So I'm searching through the internet looking for answers.I am concerned that the yogi breathing exercises seem to increase oxygen intake, while chronic hyperventilation seems to be caused by an excess amount of oxygen (to carbon dioxide ratio) - so they wouldn't necessary be a good combination in my mind.I am intrigued by the possibility of magnesium and Calcium as suggested above, so I think I'll definitely try that - since it's something I can try immediately. I might also throw some meditation or HVS breathing treatments in there - I found these from Dr Weil which sound like the are aimed at this issue.http://www.drweil.com/drw/u/ART00521/three-breathing-exercises.htmlI do think I'll suggest some of the other possible culprits to my GP (COPD, Heart Issues, Anxiety, etc) but I haven't explored this as much as some others, so I'll stay with the dr appt for now.I am just very happy to hear that I'm not crazy. My boss even told me that its 'nothing - just allergies' so I think everyone things I'm embellishing the severity of the symptoms, but they're very real.Good Luck Everyone - As more and more people start crossing other things off their lists and trying new things, please keep us updated!!!",
            "post_id": "6477002",
            "timestamp": "1293054331",
            "user_id": "user_1541319",
            "user_link": "/personal_pages/user/1541319",
            "votes": "0"
        },
        {
            "answer": "thank you all extremely for sharing your testimonies.i have been suffering with every last symptom you all have stated for more than two years. the need to yawn excessively to get a deep breath, the heaviness in my chest and stomach, excessive burping, issues with swallowing, difficulty sleeping, clogged nostrils, and soreness in back, neck and shoulders. ive had the anxiety/panic attacks too. i have had it all.  i am 39 years old, i am obese but i am losing weight. i have changed my diet several times, believing the problem was food induced. i started taking allergy medication, Clariten, thinking it was allergy induced. as one of the lady's said, exercise seems to help me as well. i always feel better afterward, but the SOB returns.  ive tried everything i could think of.in one post a gentleman spoke of resisting the urge to take a deep breath when the sensation comes. i had tried that before and it worked. i noticed that if i wasnt thinking about it i wouldnt have the sensation to breath deeply, but as soon as i thought on it the sensation would follow within minutes. anxiety certainly exasperated the situation. i also believe stress is a  major contributor.i recently began a process of re-training my metabolism. this is a very detailed process having to do with re-balancing hormones within my body so they may began to work properly and to their full potential for maxium metabolic health. in the few days that i have been eating this new metabolism building diet, i have noticed a huge change in the SOB. ive hardly had any episodes, even when i think about it im not triggered to take a breath. another gentlemen spoke of taking magnesium. this diet requires me to eat magnesium enriched (if that's correct) foods, as well as several other minerals and vitamins.personally, i believe the condition is a caused by a combination of everything mentioned in this thread, especially hyperventilation syndrome, allergies, and poor diet. the information about aspartame was very alarming and important. please take note to removing it from your diet if you use it.i would like to thank all of you for sharing your story. it moved me, and i was happy to know it brought many of you comfort to know you dont suffer alone. to you who shared and suggested remedies, bless you for caring enough to do so.to Ms. Greb(sp), i pray you special comfort and peace. sounds like youve had a rough go at it.a blessing of peace, prosperity, and healing to you all!",
            "post_id": "6481824",
            "timestamp": "1293219285",
            "user_id": "user_1542628",
            "user_link": "/personal_pages/user/1542628",
            "votes": "0"
        },
        {
            "answer": "I am new to this site but, like others, a bit worn out from not getting answers from specialists etc.My problems started approx. 18months ago following a bacterial infection in my ears which also moved to my lungs.Ever since I have been slowly getting worse and now notice everyday I have problems with my breathing, heaviness in my chest, chest pains, sometimes coughing and tiredness. Asthma meds dont help at all.I have had so many tests, in June 2010 I was told by a Respiratory specialist that I have the very rare condition known as Pulmonary Hypertension which if you look it up on the internet, the prognosis is not great!Anyway, after a second opinion my new specialists (Cardiologist and Respiratory) are still undecided as to what is actually wrong with me and so I have more tests plus re-tests to be done.I used to be able to run up to 11 kilometres but over the past 12 months (due to inability to exercise the same) have gained around 15 kgs (not sure what that is in lbs?).  I actually first started to notice it during exercise which now makes me quite unwell hours after exercise.Anyway, I realise non of this helps anyone but everyday for me is difficult mainly due to the worry of how I am feeling.  It is very scary, especially when I was originally told I had a terminal condition.One thing that I often think about is, approx 3 years ago I had a Mireena (IUD) inserted but removed in August 2010 because I thought this was the problem.  I still think it may have contributed to how I am feeling now.Please let me know your thoughts. Not sure where others are from, I live in Australia.",
            "post_id": "6520510",
            "timestamp": "1294374517",
            "user_id": "user_1554937",
            "user_link": "/personal_pages/user/1554937",
            "votes": "0"
        },
        {
            "answer": "its so good to read this.about 7 yrs ago i suddenly felt like i could not breath properly i was crying and panacking really bad,then it dissapeared the nxt day then about a year or so later it came bak and did not disappear the nxt day  so  i went to the doctors freaking out once again thinking i was going to pass out.i have had ultrasounds on my stomach,blood tests,stress tests asthma tests,heart ultrasound,i have even been to the emergency room, but they said my colour in my face was good,blood pressure good and plenty of oxygen in my body.i was put on avanza anti depressents and xanax, but stopped taking the xanax.i have had times throughout the 6 yrs where its would be managable then all of a sudden it would be unbearable.its usually the worst at night.i think i have become too aware of my breathing.for 6 yrs i have always had this breathing thing i have forgotton what it feels like to not be aware of my breathing.i am 23 yrs old now and i need some help and tips.i have noticed that i tend to breath mostly through and out my mouth.its not like im gasping for air,i just feel like i cant breath properly.up until a couple of months ago it was settling a bit and did not bother me so i started running,went on a diet and started to stop my antidepressents slowly with the doctors help,a couple of days into that it returned one nite really bad again.all tests are fine.im an ex smoker and i rarely drink.sick of that pannicky feeling and just want to be normal again.",
            "post_id": "6537262",
            "timestamp": "1294811155",
            "user_id": "user_1560171",
            "user_link": "/personal_pages/user/1560171",
            "votes": "0"
        },
        {
            "answer": "The pranayam described in my post of Sept 23, 2010 will help you with the breathing problem. Do it everyday, and let me know at some point, how you benefited.",
            "post_id": "6537792",
            "timestamp": "1294837455",
            "user_id": "user_180749",
            "user_link": "/personal_pages/user/180749",
            "votes": "0"
        },
        {
            "answer": "Hi, new to this site, but what a relief to read your stories. I have been working out for 3 months doing cardio and weights. I was being treated with antibiotics because I have a sinus infection, so laid low for a few days. Today I went back to work out with my trainer  doing super sets but not much weight, lots of reps. After the first set I noticed I was breathing really hard, normal, but having difficulty bouncing back and breathing was becoming difficult. During the second set I felt a slight pressure in my chest and suddenly it felt like someone had knocked the wind out of me and I could only get shallow breaths. I haven't had this happen before (I was diagnosed with adult onset asthma but rarely need the inhaler). I used my inhaler for the first time in a long time, had to lay down and then leave the gym. When I got home I was so tired I just fell asleep for an hour and when I woke up I felt better but still have this tightness in my chest. I wonder if it is from those heavy duty antibiotics they gave me for the sinusitis or was it just the weight lifting causing blood pressure to drop. any clues would be helpful. thanks",
            "post_id": "6545805",
            "timestamp": "1295027695",
            "user_id": "user_1562928",
            "user_link": "/personal_pages/user/1562928",
            "votes": "0"
        },
        {
            "answer": "Today i went and saw a psychologist and he explained so much to me about anxiety and panic attacks.he also gave me some breathing techniques to use.which i am doing and im noticing a difference already.pranayem is pretty much the gist of it breathing through your nose and out through your mouth.but not too fast.we have all become so conscious of our breathing we need to learn to breathe normally again.have faith everyone as now i do see a light at the end of the tunnel it may take a while but with the right help i can get this under control.dont sit bak and wait for the doctors. go and get the right help.or try the things that hava has suggested.Its all about our Breathing rythyms!!!",
            "post_id": "6557041",
            "timestamp": "1295346266",
            "user_id": "user_1560171",
            "user_link": "/personal_pages/user/1560171",
            "votes": "0"
        },
        {
            "answer": "Symptoms of Magnesium Deficiency?What are some of the symptoms of magnesium deficiency? They are outlined beautifully in a recent article by Dr. Sidney Baker. Magnesium deficiency can affect virtually every organ system of the body. With regard to skeletal muscle, one may experience twitches, cramps, muscle tension, muscle soreness, including back aches, neck pain, tension headaches and jaw joint (or TMJ) dysfunction. Also, one may experience chest tightness or a peculiar sensation that he can't take a deep breath. Sometimes a person may sigh a lot.",
            "post_id": "6574491",
            "timestamp": "1295802088",
            "user_id": "user_1572338",
            "user_link": "/personal_pages/user/1572338",
            "votes": "0"
        },
        {
            "answer": "Iv had this condition for 8 months and have probably seen more docs it that time then many will ever.  I have been tested for anything and everything that migth provide an answer.  was told it was anxiety beleived it..for a while then became angry at thoses who said it.   Like many of you i have acid reflux.  also bloating, fatigue, headaches, and sinus issues since it all began, which was after drinking caffeine (typical)But what i think many of us are suffering from a condition known as mvp syndrome(look it up for more info).  Some have been diagnosed with mvp others may have gone undetected or just not been tested but its not the mitral valve prolapse itself that cuases the unability to tkae a deep breath, chest pain, anxiety and so on.  The conditons been around for over a 100 years and although previously it was beleived to be due to a chemical balance change in the brain. Recent studies are linking it to magnesium(frequent in fibromylagie sufferers) and Zinc(chronic fatigue and depression) deficientcy. the syndrome is  in many ways similar to connective tissue dieseases and involve defective collagen or a reduction of  hyaluronic acid. but there are many supplments that can help.I hope this is a startSam",
            "post_id": "6601809",
            "timestamp": "1296509391",
            "user_id": "user_1581375",
            "user_link": "/personal_pages/user/1581375",
            "votes": "0"
        }
    ],
    "post_id": "3248253",
    "question": "Hi - I've been having difficulty breathing for at least the last 9-10 years...and it's a daily thing.  I am 31 years old, am healthy (exercise almost daily, eat healthily, am not overweight, do not smoke, and only drink socially), and yet I always feel like my breathing is extremely laboured.  I constantly yawn to try to catch a satisfying breath.  There are some periods throughout the day where it's not laboured and I feel as if I breathe normally, but then it creeps up on me and I have to start yawning again.  My nose feels very clogged all the time and my chest, stomach, and back muscles feel very constricted when breathing.  It's especially noticeable when I am working out...especially running and lifting weights.  I have to stop every once in a while just to yawn (frustrating) to stop from getting dizzy.  It's also noticeable as I am trying to go to sleep and/or when I've had a glass or 2 of wine.  I was \"diagnosed\" with exercise-induced asthma 9-10 years ago, but I think this was a mis-diagnosis as the inhalers never work (I've tried all sorts) and they usually end up making me feel worse.  After using the inhaler I always end up coughing up fluid and my breathing sounds gurgle-ly  (so I don't take them any more unless I feel I really need to...note that I have never had a full blown asthma attack).  I'm worried that it could be something else (was exposed to TB as a teenager, but took the \"horse pills\" for 6 months and was told I was fine), but none of my doctors will really listen to me.  They see that I am slim and active, and they dismiss me - I live in the UK (free socialised healthcare - so not a lot of time to spend with patients).  Has anyone else experienced this?  I see lots of threads on here with the same topic, but they all have to do with taking medications, being overweight, being a current/past smoker, being depressed/having anxiety, etc.  Please help - I'm tired of living like this.  I'm worried that I could be living with something undiagnosed that could rear it's ugly head one day.",
    "timestamp": "1218054713",
    "title": "Can't get a deep breath / Difficulty Breathing",
    "user_id": "user_582223",
    "user_link": "/personal_pages/user/582223"
}