{
    "answers": [
        {
            "answer": "Yup me too so you're not alone!!!! I hate the waiting part. AF is due on Friday. I swear it'll be the longest week ever!!!So this will be your 3rd? This will be my first child if the pregnancy takes.  I just recently had a MC so this was our first time TTC since that. I'm anxious, excited, scared, all of it at the same time. Aarrgghh!!!Just a question - I'm still trying to figure out what a lot of the acronymns mean....what's dpo? Day's past/post ovulation?Happe Baby dust to you :)",
            "post_id": "1985941",
            "timestamp": "1192471273",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I'm so glad it's not just me!  Actually I tested yesterday but it was a bfn (big fat negative).  I knew it would be but I couldn't help myself!!  I'm testing again on Thurs...IF I can hold out that long.  I swear if I had a $1 for every negative test I've had..LOLYes this would be my 3rd.  I got pregnant last year while on the pill (shock!) but sadly MC at about 7 weeks.  Got pregnant again right away (twins) and lost them at 8 weeks.  I started temping right after the last one and realized that my luteal phase was short so am on progesterone beginning on cd14.  Hopefully that'll fix the problem.Yep, dpo (days past ovulation)  It took me 4EVER to figure all of them out.Baby dust to you too!!!",
            "post_id": "1985993",
            "timestamp": "1192471788",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Keep me posted on your results!I think I'm going to pick up one of those early HPT tonight and try it out tomorrow morning - you know, give myself the best possible chance of getting a positive!!It's funny...even buying the tests makes me really nervous. I've actually gone to the store in the past and left again without it, becaue I just couldn't bring myself to go to the cash register!!! I know, I'm a moron ;)Why does a short luteal phase make a difference? I remember reading about the luteal phase but I can't remember many details.....",
            "post_id": "1986087",
            "timestamp": "1192472726",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "It's crazy how long it seems when you waiting to test.  I remember waiting and I test 7days before af was due and got my BFP.  I took a test every other day for about 10days because I couldn't belive it.  I just had my baby boy in June.  If it doesn't happen this time have faith you will get there good luck",
            "post_id": "1986231",
            "timestamp": "1192475015",
            "user_id": "user_142722",
            "user_link": "/personal_pages/user/142722",
            "votes": "0"
        },
        {
            "answer": "Hillarious!  It's not like you were buying condoms!!  HA HA!  I buy the Answer early results test.  They're made by the same people who make the First Response but they're way cheaper.A short luteal phase can mean that my body isn't producing enough progesterone, which is what is needed to support a pregnancy before the placenta kicks in.  You can tell from temping how long your luteal phase is.  I've learned so much since my last MC, just searching the web and temping.  My dr was impressed at how much I knew about my body.",
            "post_id": "1986236",
            "timestamp": "1192475086",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Wow!  You did get an early BFP!  Lucky!!!",
            "post_id": "1986238",
            "timestamp": "1192475133",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Good luck to everyone, I know how difficult it is to wait! I had to buy many pregnancy tests over the past year. I get weird looks and comments everytime I go pay for them!  I am 24yrs. old, but I look like I am not a day over 14, lol.  And my husband is significantly older than I am, so when I start showing (I am almost 12wks) we will be getting A LOT more looks when we walk hand in hand!",
            "post_id": "1986323",
            "timestamp": "1192476609",
            "user_id": "user_224208",
            "user_link": "/personal_pages/user/224208",
            "votes": "0"
        },
        {
            "answer": "I think that's part of why I hate buying them. I am actually 29, but people tell me I look 19, sometimes even younger. Maybe I think people are going to give me funny looks...but really it's none of their business, right!Anyway, I picked up a First Reponse last night, but it was negative when I tested :( (last night - I couldn't wait until this morning - acutally my husband couldn't wait!!)I'm really hoping that it's just too early - although AF is due on Friday.  It says on the package that there is like a 63% success rate that far in advance, which really isn't much more than 50/50.Anyway, I'm just prayng and praying and praying that AF doesn't come in a few days.",
            "post_id": "1988538",
            "timestamp": "1192540040",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well I broke down and took another test today...still negative.  ****!  I know it's too early but if I have a test in the house, I'm not happy until I've taken it.  So this was the last test in the cabinet and I flatly refuse to go buy any more until Thurs...lol.  I'm obsessed!",
            "post_id": "1988635",
            "timestamp": "1192541926",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Ha ha! I have another in the cabinet....I'm just going to try and hold out for another day or so. (by then AF will almost be due anyway!!)Something I HAVE noticed though. I have a headcold, sore throat and a slight fever. The EXACT same thing happend the first time I got pregnant, about the same time (before I knew I was).Coincidence? Have you ever heard anything like that before?",
            "post_id": "1988641",
            "timestamp": "1192542095",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Very interesting!  I'm not sure if it has anything to do w/ it but it would get me excited if it were symptoms like the last time.Since we're comparing symptoms, the past 3 months I've had spotting for about 7 days prior to AF and this month I'm not spotting!!!  Gosh I hope this is our month!  Why is it that if you're on vacation for a week, the time flies but the TWW will never end!??  This is torture!!!",
            "post_id": "1989111",
            "timestamp": "1192549489",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I am also waiting to test.  I had 6 embryos transferred on October 14.  The doctor says they were all very good quality (2s and 3s).  The other 8 are still in the lab and those that survive will be cryopreserved.  We are praying for good, solid attachment to my uterine wall.  I go for a blood test on Oct. 26th.  Please keep us in your prayers.  This is our 3rd attempt.On another note, I am still experiencing pain/discomfort from the retrieval.  There were many follicles and 21 eggs were retrieved.  I was told that the more follicles, the more chance of pain.  However, that was on Thursday, Oct 11th.  My stomach feels like it is filled with a a bunch of air and my bladder is very tender.  I also get nauseated after eating.  Has anyone experienced this?One more thing - I have to go out of town on Tuesday and will fly.  Are there any concerns with flying before testing?",
            "post_id": "1989169",
            "timestamp": "1192550331",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I am also waiting to test. On sept 14 i had an implanon took out of my arm...after i spotted for 3 days a dark brown discharge maybe it was supposed to be my period. my husband and i have only been ttc for 1 month. i made my husband go buy me a test, he got the ept, i took it at 10:00 one night but it was negative. I think i still am that was 5 days ago. My period was due on Oct 12. I  have pain and discomfort in my lower abdomen and always feel like im gonna start my pd but i dont....any help? To abrahan$sarah i will pray for you wish the best of luck...i too get nausea after i eat and my bladder is so sensative i wake up all night having to urinate.",
            "post_id": "1989450",
            "timestamp": "1192554163",
            "user_id": "user_295954",
            "user_link": "/personal_pages/user/295954",
            "votes": "0"
        },
        {
            "answer": "Wow, good luck abraham&sarah. Unfortunately I have never been though a retrieval so I can't comment on that part. However, I don't you don't need to be concerned about flying. It shouldn't affect your testing :)CLeigh, you could very well be pregnant - nausea, frequent urination, and sometimes slight cramping CAN all be symptoms. It might have just been too early for the test you took to read anything. Since you're currently 4 days late, have you tried another test? If you don't start your period in a few days and your HPT are still coming out negative, the best thing is to go to the doctor - they'll send you for blood tests. If it isn't the result you had hoped, don't worry. It's only your first try and if often takes a few attempts :)momof3 - I hope this is our month too!!!Good luck everyone!!!",
            "post_id": "1989635",
            "timestamp": "1192556413",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Isn't is just amazing how advanced technology and medicine are??  I wish you the very best of luck and keep us posted!",
            "post_id": "1989862",
            "timestamp": "1192559232",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Hey momof3, did you test again this morning, or are you holding out?Good luck!",
            "post_id": "1992539",
            "timestamp": "1192627343",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "So I took another HPT this morning....only one day before AF due....still negative.This sucks...I'm pretty disappointed. I'm still holding out that it's just too early, but I think that might be optimistic. This might just not be my month :(",
            "post_id": "1996559",
            "timestamp": "1192710154",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I broke down this morning and tested again (I swear I need an intervention!) and it's still negative, but I'm only 10dpo so I'm still crossing my fingers (and my eyes, legs and toes) that it's too early.  The last time I was pregnant I got a bfp at 10dpo but I was carrying twins.  I'm still not spotting and my temp is up.  I think I'm going to be heartbroken if I see AF this month b/c I've gotten myself so excited.  Usually I'm like, eh..oh well...I just really have that nagging, back of the brain, feeling that I am pregnant.You keep holding out until you see AF and I'll be praying for your BFP!",
            "post_id": "1996997",
            "timestamp": "1192717578",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Just thought I may brighten this talk for you, I test a day before with a hpt and was negative, I also had my blood drawn 2 days before my period was due and that was negative. I day late and I got a postive hpt. So keep holding hope!",
            "post_id": "1997088",
            "timestamp": "1192719167",
            "user_id": "user_210400",
            "user_link": "/personal_pages/user/210400",
            "votes": "0"
        },
        {
            "answer": "Well I hope that's the case for me. I will definitely hold out hope until AF arrives (or doesn't if I'm lucky!) I just know I\"ll be so disappointed if it doesn't happen this month. I'm having these strange cramps today - at first I thought they were a sign AF was coming, but now I'm not so sure, cause they're a little different, and more towards my left side. Oh I\"m so anxious I'm reading into everything!!!",
            "post_id": "1997725",
            "timestamp": "1192728304",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "amberd5191-what a wonderful surprise!  Makes me more hopeful than ever.Lil Pig-I'm analyzing all my twinges and cramps too!  This waiting STINKS!  LOL",
            "post_id": "1997815",
            "timestamp": "1192729617",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Overanalyzing for sure!!!I'm sitting here, supposed to be working BTW, and all I can think about it the twinge in my side!!!!I'm going INSANE, LOL!!! :)",
            "post_id": "1997864",
            "timestamp": "1192730225",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I am scheduled for a blood test on Oct 26.  This is a long wait.  I'm trying to view it as a wait for my pregnancy to be confirmed.  I just believe that I am pregnant.  I have cramping, including towards my right side, sorta under my rib.  And, I also have flutters and pelvic discomfort.  I feel fatigue and tired.  I am really gassy and bloated too - TMI.  I read that all these symptoms could be from the Prometrium.  All except the flutters.  The flutters was explained as one of the signs of pregnancy as the burrowing process takes place.  Anyone else have flutters?",
            "post_id": "1998018",
            "timestamp": "1192731909",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I don't think I've had flutters. I haven't had much of anything to be honest, until the cramping today.But I haven't had my usual PMS symptoms either, which I find strange.I think I'm just reading too much into EVERYTHING!",
            "post_id": "1998095",
            "timestamp": "1192732842",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I'm supposed to be working too but who can work when they think they're pregnant!??  Glad my boss is leaving early..hehe...so I can stalk this site and every other pregnancy site out there.I haven't heard of having flutters but heck, anything is possible.  I'm on Prometrium too and the only side effect I have is very tender bb's every month, but I've read there are some side effects just like the ones you're having.",
            "post_id": "1998203",
            "timestamp": "1192734175",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "My days at work seem to be going by so slowly when it is usually the opposite.   Arrrrggghhhh!",
            "post_id": "1998434",
            "timestamp": "1192736821",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I bet they are since you have to wait until the 26th!  Good grief!  I'd be bald by then!!!  I'm going batty just trying to wait until Sat.  I wish they made an \"instant\" test that would work right after bd-ing!  lol",
            "post_id": "1998587",
            "timestamp": "1192738734",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Well, it looks like this isn't my month :(AF has arrived, like clockwork!. I am SOOO disappointed. I just don't understand. We did everything right, or so I thought. It worked the first time, why not now? And I thought you were supposed be more fertile after a MC? I am so PO'ed right now.It's funny, cause I'm still saying to myself, maybe it's just spotting, and it's not really AF (cause it is just light spotting as of right now) - but that would just be too good to be true.Oh well.....looks we'll be trying again in a little while. My husband is going away on a business trip, but he arranged his schedule to make sure he was home in time for the fertile days. He did it just in case we didn't get pregnant this month. Good thing he had the sense to do that!I hope the rest of you have better luck :)",
            "post_id": "2000758",
            "timestamp": "1192791694",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Aww, I'm sooo sorry this wasn't your month.  It's heartwrenching, frusterating, disappointing, aggravating, sadening (shall I go on??) all at the same time.  I wish I had answers as to why it works for some and not for others.  However, I'm still in the game as no sign of AF yet but have had some crampiness but not normal AF cramps, so I'm testing tomorrow.  Can you believe I got up this morning and did not test and there was a test in the cabinet!??!  I'm amazed!  LOL  I'll keep you posted and you keep your head up and I'll be praying that next month is YOUR month!",
            "post_id": "2001016",
            "timestamp": "1192799306",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Thanks!I hope this month works out for you better than it did for me :)Keep us posted on what happens over the next few days!",
            "post_id": "2001020",
            "timestamp": "1192799409",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I'm sooooooooooooooooo sorry your results weren't different.  It is difficult to understand why and the pain is so great. I'm praying for your comfort and healing.  I'm believing with you that you will conceive, bare and deliver a healthy wholesome baby the next time.  It sounds like you have a great support in your husband, so I'm sure that helps some.",
            "post_id": "2009883",
            "timestamp": "1193050936",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Thanks for your kind words!It is a little frustrating, but I believe it will happen soon. I bought an OPK this weekend to help us out a little and increase our chances this next cycle, so I\"m crossing my fingers.How are you holding in with your waiting?? Only a few more days to go. Good luck!!",
            "post_id": "2010108",
            "timestamp": "1193058778",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I am doing well.  The waiting is very undesirable but I'm not anxious.  I am reading the bible as much as possible to make sure I'm constantly thinking and speaking God's truth instead of fearing what I'm experiencing.  I'm also reading a book called Prayers & Promises for Supernatural Childbirth by Jackie Mize.  It is helping me to stay positive and to keep my thinking on track.  Thank you for your well wishes and I believe the best is yet to come for you.",
            "post_id": "2010141",
            "timestamp": "1193059685",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Well, I'm out and it sucks!  AF reared her ugly head this morning.  I think if I have a good cry I'll feel better but it's hard to do while at work.  I'm having blood work done on Wed morning testing my FSH levels to see what quality/quantity eggs I'm producing since I'm 36.  Hopefully everything is normal on my end and I'll just have to keep practicing.",
            "post_id": "2010240",
            "timestamp": "1193061756",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "This was supposed to be for you!I am doing well.  The waiting is very undesirable but I'm not anxious.  I am reading the bible as much as possible to make sure I'm constantly thinking and speaking God's truth instead of fearing what I'm experiencing.  I'm also reading a book called Prayers & Promises for Supernatural Childbirth by Jackie Mize.  It is helping me to stay positive and to keep my thinking on track.  Thank you for your well wishes and I believe the best is yet to come for you.",
            "post_id": "2010271",
            "timestamp": "1193062367",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear the bad news.  Keep us posted on the FSH levels.",
            "post_id": "2010276",
            "timestamp": "1193062498",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I feel your pain!!! It sucks, but on the bright side, you can have fun TTC again. (That's the way my husband looks at it :) ) I've never had my FSH levels tested....should I? I'm 29.Hopefully abraham&sarah will break this trend and have better news in a few days. I'm crossing fingers for you!!!!",
            "post_id": "2010806",
            "timestamp": "1193070210",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well not as much fun as it used to be unfortunately.  I seem to be the only one w/ a working libido!  (LOL but not really)  I wouldn't be too concerned about your FSH levels yet.  My dr is checking me b/c of my age and the fact that you could look at me wrong before and I'd get pregnant...now it's been like 7 months and nothing.  We want to make sure I'm not peri-menopausal since I've had tons of spotting for the past couple of months.  I think we got that straight though b/c my dr put me on a powerful antibiotic to treat me for PID (not sure if I actually had PID but it was just to cover the bases).  After the antibiotic I had no spotting so maybe I did have PID.  Anyhoo, I'll let you know what the tests say.  Hopefully all my little eggs are normal and there are lots of them.I know you'll find some inner peace with all of your reading.  I try to remember that God has a plan for me, with or without, another baby.  Please let us know what the blood tests show!  I know you're so excited!",
            "post_id": "2011102",
            "timestamp": "1193074400",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I am really grateful for you guys.  You are certainly a blessing to me in this process.  I just feel better talking about it and knowing someone else can actually feel what I feel.  While my husband is the greatest, talking with other women somehow gives peace of mind because we can relate on a different level.  It means a lot to have others cheering me on too.  I haven't shared with my family and friends that I'm even going through this process, let alone for the 3rd time, because I don't want comments or even questions, if you know what I mean.  I don't know if that's perceived as selfish or not but it is very sensitive for me.  Thank you so much for being there.",
            "post_id": "2011277",
            "timestamp": "1193077052",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I kept poking in to this post to see some BFP posts... and I am bummed out for you guys!  Last year at this time I was TTC...  I started TTC in August and in Jan I got pregnant.... wow, what a long 5 months!  then in feb I lost that baby...  it was crushed...  finally in May I got pg again and I am 26 weeks...  I guess I feel so much for you guys because just a year ago I was in your shoes... so I hope my post brings some hope to you that it will happen, and even though it didn't happen exactly as I wanted it, it is happening, and I know it will for you all too...  you are in my prayers and thoughts!  Good luck!  I really do wish you all the best of luck and I am so sorry to hear about your AF's... :(  I was really bummed out for you guys!  Hang in there and try to remember to have fun...  I just wanted you guys to know that I was thinking about you all!  baby dust!",
            "post_id": "2011703",
            "timestamp": "1193082513",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "I am also waiting to test. Sorry about all the neg tests, it is so heartwrenching only seeing one line come up. I swear my heart breaks every time i see it... yet I continue to put myself through it. I am going to have to start budgeting for tests. AF is a day late, test neg. Suppose too early. When I hear some people get positives days and days before period is due, it is quite disheartening but I am sure we will all have our BFPs soon!!",
            "post_id": "2011864",
            "timestamp": "1193084561",
            "user_id": "user_309156",
            "user_link": "/personal_pages/user/309156",
            "votes": "0"
        },
        {
            "answer": "M2B, there are also lots of stories out there with false negatives.....so hope for that :)Baby dust to you also!Tatorbug, wow that is quite the story. Sounds like things are going great for you now. Your story is definitely encouraging - after all that struggle you finally have a  baby on the way!Good luck and enjoy the ride :)Will keep everyone posted on any BFP's in the future. I'm getting ready for another roller coaster ride of waiting and hoping over the next few weeks! Like abraham&sarah said, it's great to have people that you can talk to to who understand!",
            "post_id": "2013949",
            "timestamp": "1193137044",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Ok now I'm totally obsessing!!! I've bought a slew of OPK and HPT for this upcoming attempt,  and it's all I can think about. I'm looking up everything I can on TTC, even though it's all the same and I've read it over and over again. I can't even concentrate on my work - it's getting a bit ridiculous. And it's only CD5 - only 23 more to go!! *groan*",
            "post_id": "2014116",
            "timestamp": "1193142853",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "You're so funny!  Sounds like \"we\" need an intervention!  LOL  I think if I read that standing on your head after bd-ing worked, I would!  Do you have any kids now?",
            "post_id": "2015759",
            "timestamp": "1193168731",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I obsessed about it too and both months this year that I got pregnant was when I couldn;t take it any more and decided to give it a break...  just a thought!  sometimes all the stress of it can make your cycle screwy...  IF and only IF it doesn't work this month, but I think it will!!  but IF is doesn't, next month try to NOT TTC... I know it sounds weird...  in Jan when I got pregnant it was new years eve,  the last think on my mind was TTC...  I just wanted to have some fun that night!  :)  Then again in May, our city hosted the AIA (american institute of architects) convention and I had been so busy with events that my DH and I didn't see each other much that week...  I actually didn't even think I was ovulating because it should have been about a week later (because my cycles were long the first few months after the m/c)...   we just did the deed to have some fun since we hadn't seen much of each other that week...  and low and behold I am now 26 weeks along!! :)It is not easy to not think about it ALL the time, trust me...  I know...  but try to just relax and have fun with it too...  the months I stress the most I didn't have much luck!!How long have you been TTC?",
            "post_id": "2015894",
            "timestamp": "1193170280",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "Nope I don't have any kids yet. This will be my first, whenever it happens.My hubby and I went on long awaited trip to Australia and New Zealand last April, and we had decided to TTC after that. It was kind of like our last big hurrah. We got pregnant the first time we actually tried to time it and everything, but that unfortunately ended in a MC at 12 weeks, which was mid-late August.I was told to wait at least one cycle before TTC again, which we did, but it was agonizing, plus the cycle was about a week longer. So as soon as AF arrived, we tried that month, but it didn't work. So here I am again, on my second cycle since the MC. So really we've only tried once since the MC so it hasn't been that long at all.The worst part about it was that I have 3 friends and we were all due within a few days or weeks of one another. Now they're all getting big and round and I feel left out. (luckily 2 of the 3 live in different provinces so it makes it a LITTLE easier).Anyway, I haven't given up hope yet, although some days I feel like it and wonder is it really worth this roller coaster ride. The other days I get really excited and think, ok this is going to be the month!!Maybe giving it a break will work for me too....but I'll wait until the cycle after this one to try that! ha ha!!!",
            "post_id": "2018478",
            "timestamp": "1193227426",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I'm sure you'll get your bfp soon!  I got pregnant the 2nd cycle after my first MC, so be patient (yeah, right!) and it'll happen.  The hardest part for me was seeing people who found out they were pregnant about the same time I did and they ended up delivering healthy babies as where I had none.  I have faith that our time is coming!  So for now, let's keep the OPK and HPT companies in busines!!",
            "post_id": "2018734",
            "timestamp": "1193232304",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "you are too funny!  I was pregnant the 3rd cycle after the m/c...  I had a d&c on Feb 14th and concieved on May 7th...  so hopefully you will get pregnant soon...  I was frustrated because the first 2 cycles after my period were longer then normal, so I kept missing it!  This will be your month!!  :)",
            "post_id": "2019150",
            "timestamp": "1193238551",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "You know what's really funny? My husband is on a business trip right now, and I told him he had to arrange his flight schedule so that he wouldn't miss my fertile days next week. He did too, God love him :)",
            "post_id": "2019499",
            "timestamp": "1193243054",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Now, that's true love!What time do you go for your test on Friday?  I'm off tomorrow, so if I don't hear from you before, GOOD LUCK!!!!",
            "post_id": "2019946",
            "timestamp": "1193248155",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "6:30 a.m.  Then, I'll be in a training session all day at work.  Do you really think I'll be able to concentrate?  Not a chance :-0",
            "post_id": "2020221",
            "timestamp": "1193251188",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Definitely not! The next 36+ hours are going to seem so long, I bet!But hopefully you'll get a BFP :)",
            "post_id": "2020239",
            "timestamp": "1193251474",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Since joining this forum, I feel that I really have friends who understand and are genuinely pushing for my success.  Now, I not only want success for my husband and I, but I want success so others will also be encouraged and hopeful.  Thanks to you and all.",
            "post_id": "2023411",
            "timestamp": "1193317066",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Good luck tomorrow! We'll be anxiously awaiting your results :)",
            "post_id": "2024668",
            "timestamp": "1193334947",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "YIPPEE!  I got my FSH and estridiol tests back....All very NORMAL!  WooHOO!!  Guess my eggs aren't boiled after all...LOL!  I really hate it for my husband now....I should get him some Wheaties!Abraham&Sarah.....Well????  It's 9:30 here (EST) and can't wait to hear the results!!!!",
            "post_id": "2028098",
            "timestamp": "1193405943",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I'm waiting, already 13dpo.  Looks bad.",
            "post_id": "2028554",
            "timestamp": "1193412537",
            "user_id": "user_86288",
            "user_link": "/personal_pages/user/86288",
            "votes": "0"
        },
        {
            "answer": "I KNOW!!! I've been checking this post since about 8am (NDST - 6:30 EDST) on Friday!abraham&sarah, we're anxiously waiting for some word......I have a good feeling about it all, so hopefully my instincts are right :)momof32b, I think my husband totally understands what your's must be feeling ;) Congrats on the FSH levels, BTW!!",
            "post_id": "2032244",
            "timestamp": "1193485452",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Why does it look bad?? 13 dpo, must be getting close to AF time by now....Good luck!",
            "post_id": "2032245",
            "timestamp": "1193485500",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "14dpo, BFN.  BD before and on the day of ovulation.  My 4th month already.  What went wrong with my system since I gave birth?  My first time TTC was so easy.  First shot hit the jackpot.  Waiting for AF.",
            "post_id": "2032513",
            "timestamp": "1193495467",
            "user_id": "user_86288",
            "user_link": "/personal_pages/user/86288",
            "votes": "0"
        },
        {
            "answer": "I'm going to send out a personal message just to her to see if she'll respond.  I'm worried now b/c it's Mon and still no word from her.Sorry you're getting a BFN.  My first 2 kids were a wham, bam, thank you ma'am as well.  I've been trying since March and still nothing.  I obsess about it too!  Maybe we should relax...but it's hard to do!  Good luck!",
            "post_id": "2038490",
            "timestamp": "1193664121",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Hello there.  Sorry for the delay in informing of the results.  I'm not usually on email over the weekend.  It's a BFN.  Got AF this morning.  I'm devastated!  Been crying all weekend long.",
            "post_id": "2039037",
            "timestamp": "1193673201",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Oh, dear!  I'm sooooo sorry!  My heart goes out to you!!",
            "post_id": "2039420",
            "timestamp": "1193679424",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Much thanks momof32b.",
            "post_id": "2039751",
            "timestamp": "1193683138",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I read that someone said you are supposed to be more fertile after MC.. is that only if you have had a D&C?My fiance and I got pregnant the first time we tried- one week after telling our families, I miscaried.It's six weeks later and no period. I have read that since I did not have a D&C and miscarried naturally so early in the pregnancy that while recommended, it wasn't necessary to wait until after the first period post MC.  We have had sex 3-4 times since the miscarriage and I thought I would get my period by now. My breasts are alittle tender and I feel bloated.. all PMS symptoms but also all symptoms I had 7-8 weeks ago when I was pregnant. I took 3 tests- all negative. I feel like I am losing my mind.  My fiance and I both have 1 eleven year old daughter each from previous marriages and 7 years ago I gave a baby up for adoption because I could not take care of two children on my own and I did not want to have an aboortion .... Now I feel like I am incompetent and unworthy- like I can't or don't deserve to have another kid.... I know I have no right to say this after only one miscarriage and some of you have had several and maybe never had one successful pregnancy... if I offend you I'm sorry I'm just an emotional wreck and I feel like I am apologizing to everyone... my fiance - his family.....I just wish I knew.. the waiting game...   the anticipation... the absolute fear.  Even if we are successful every week will be scary ... I used to think all  I have to do is get to the 12th week and I see so many people lose the pregnancy even then--- So for right now I am taking prenatals, no caffiene, trying to maintain a good diet and I wish I could fast forward to the day that I either get my period or a BFP so that I can figure out where to go from there.....So back to where I started.... is it true that you can be more fertile after a MC?BTW  some of you amaze me with how strong and positive you are.....if you can't spread the baby dust maybe you can help me there too.",
            "post_id": "2039909",
            "timestamp": "1193685302",
            "user_id": "user_317050",
            "user_link": "/personal_pages/user/317050",
            "votes": "0"
        },
        {
            "answer": "I am soooooo sorry about your results! I am crushed - truly disappointed for you. My heart sank when I read your post. I don't know how else to describe it. I swear I feel about as disappointed as if it had happened to me! I guess that's becuase we're been following each other's progress so closely. Well.....I guess we're all back to square one again, and next month will be more of the same.Either way, we'll all get through this :) Maybe it's because I haven't been crushed enough yet (God help me!), but I am still full of hope for all of us!!!(BTW,  I think POAS has become my new obsession - first HPT a few weeks ago, now OPK, then it'll be back to HPT. Good Lord!!)",
            "post_id": "2039991",
            "timestamp": "1193686472",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Aww, thank you for your heartfelt expressions.  I can't believe it.  I was so sure it was going to work this time.  I can relate when you say maybe you haven't been crushed enough yet.  I feel like I can't do it again. However, I am talking with my doctor about transferring my 3 cryopreserved embryos.  My cycle started today, so I would go for an ultrasound and blood work on November 9th. If everything looks good with the lining, they can do the transfer around the 10th or so.  This is all predicated upon me coming up with $4,000 for the procedure.  I have exhausted health insurance since none of the 3 IVF attempts were successful.  So we will see what happens.My husband has already been talking about donor eggs.  I guess I would consider that last resort.  I have some insecurities with it though.Anyway, that's funny about the POAS.  Thanks for the laugh.  I needed that.",
            "post_id": "2040150",
            "timestamp": "1193688332",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "It's amazing what we'll do to have a baby, huh? I haven't yet had to go through what you have, and I hope I never do, but I certainly would do what I could if I had to. I think I can understand the donor egg issues as well.  It's not a decision to be taken lightly, but I think you can only do what is right for you :) You'll get there!!",
            "post_id": "2044164",
            "timestamp": "1193768980",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I went through the same thing, natural mc early in preg., like i was only a couple weeks didnt even know i was preg. until i was in pain and bleeding, and im wondering the same thing. so your not alone.",
            "post_id": "2045755",
            "timestamp": "1193795204",
            "user_id": "user_314418",
            "user_link": "/personal_pages/user/314418",
            "votes": "0"
        },
        {
            "answer": "I have also heard that you're more fertile after a mc...not sure how true it is, as it doesn't appear to be the case for me. In fact I'm starting to wondering if I'm even ovulating anymore!!Last month was the frist time we TTC after the MC, and we did everything right (which worked the first time) but it wasn't our month. Now we're on our second attempt. I'm trying to track CM, using OPK, and so far nothing. In fact everything seems to be saying that so far I'm showing no signs of fertility this month. I'm hoping that maybe it's just early (on day 13 of cycle), but shouldn't I be seeing something by now?? In the past I've always been an early ovulator (like day 10-12), but since the mc I feel like things have changed. And I don't know if I'm being paranoid or not, but I just have a feeling that something is not right, know what I mean?? Maybe I'm just freaking out.",
            "post_id": "2046882",
            "timestamp": "1193828905",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I was just thinking about you this morning and wondering if you were gearing up for your hubby's return.  I'm am trying to plan my weekend around my husbands pool tournament...which means I'll probably have to be up and waiting on him when he gets home in the weee hours of the night.  Oh well!  I guess I'll just have to nap!!  LOL  Anyhoo, since we're on the topic of fertility and miscarriage, I had my first miscarriage in Oct 06, had one period and got pregnant again right after that!  It too, sadly ended in miscarriage.  I've been trying ever since that MC and nothing, so I don't know if there's any truth in the \"more fertile after MC\" myth or not since I've been on both ends of the spectrum.  Now, you mentioned that you don't know if you've O'd yet or not....have you ever thought about temping???  It's an awesome tool!  I always thought I O'd on cd13 or 14 but it turns out it's usually the cd15 or 16.  It will also help you learn about your luteal phase as well as IF you are O-ing or not.  It's an inexpensive way to learn alot about your body.  Fertilityfriend.com is very informative.  Good luck this month!",
            "post_id": "2047136",
            "timestamp": "1193836774",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I have thought about temping actually. I ordered a thermometer along with my HPT and OPK, but I was a little late placing the order. I am hoping it's here today, although it's a little late for temping this month.But if nothing happens this month, I'll be sure to start using it right away for the next attempt.I tried another OPK today, but still nothing. That's why I say I think I'm not O-ing - not yet anyway - but it's day 14!!! Maybe I'm also cd 15 or 16. Does that mean my luteal phase won't be long enough? I suppose, cause that'd give me about a 12-13 day luteal phase. Oh my.....all this new information I'm learning about!!! Oh how my mother would laugh about all the things we track and do these days, when they never had any of it \"in her day\" as she calls it :)",
            "post_id": "2051996",
            "timestamp": "1193936264",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Hi I am new here.  To make a long story short.  I had a healthy baby boy in Nov. 03 no problems at all!  Since than I had a miscarriage at 6-7 weeks (blighted ovum) Jan 07.  Than 2 earlt miscarriages in Aug. 07 & Sept. 07.  My doctor put me on 200mg of progesterone oral supplements because she was concerned I got pregnant 2 months in a row but can't maintain it.  She thinks my progesterone maybe low.  I am going to be 36 next Month. I am about 12-13DPO now and this after noon I got a a super faint light line with first response this afternoon. This morning when I got up something smelled different, I am not sure what it was but different. And I had some brownish with a tinge on light pink..(could this be implantation??)   on the TP when I wiped. I read on the interenet that when there is implantation bleeding that is from the end of implantation so could of happened a day or 2 ago. So is there any hope for me yet?  I have to test Saturday morning because my OB wants me to take the progesterone for 14 nights & test.  I have been taking it since 3DPO.  Any thoughts??To:",
            "post_id": "2053199",
            "timestamp": "1193954636",
            "user_id": "user_247769",
            "user_link": "/personal_pages/user/247769",
            "votes": "0"
        },
        {
            "answer": "Hmmm that's interesting. I don't really know much about progesterone supplements or if it affects HPT results, but usually if you get a positive HPT, no matter how faint it is, it means you are pregnant. So maybe there is hope for you!!I don't know if would be implantation bleeding at 12-13dpo, but I have heard of it happening this late, right around the time of your expected period.Good luck!!",
            "post_id": "2054975",
            "timestamp": "1194003811",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I feel your pain on this one.  I'm 36 and have had 2 m/c back to back.  Dr. put me on progesterone beginning at cd14 but it has never caused me to have a BFP...so maybe you are pregnant!!!  When I begin spotting before AF, I also get a strange odor but I think it's just blood I smell.  My nose is pretty sensitive.  It's possible that it is implantation bleeding b/c I had it w/ one of my pregnancies about the same time frame.  So for now, keep taking the progesterone and test on Sat and let me know!!  Baby Dust!!!!!!!",
            "post_id": "2055264",
            "timestamp": "1194009671",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "LOL!  I remember being really small and seeing my mom's thermometer beside her bed w/ a chart, so temping has been around a really long time.  Any luck w/ the OPK today??  I'm only on cd12 but had some watery cm yesterday so I took an OPK just for grins....it was positive!!  It's really early for me but I took advantage of the situation (and my husband) so we will see.  Here I go again getting ready to ride this crazy TWW train!!!",
            "post_id": "2055281",
            "timestamp": "1194009898",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "nope, no luck with the OPK today either. I don't know if it just doesn't work for me or I haven't O'd yet.I have been checking my CP and CM as well, but there's no EWCM yet, but today my CP was a lot higher...so that's a good sign I guess. Since looking at fertilityfriend.com, I think I'm actually only now on CD13. I was counting the first 2 days as well, which were only spotting. That's been happening a lot since the MC.",
            "post_id": "2056201",
            "timestamp": "1194024292",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Oh, I see!  I've noticed that I spot before AF too, since the M/C.  I think they really take a toll on your body.  Maybe O is on the way if your days are off.  Is hubby still going to be home for your fertile time??",
            "post_id": "2056274",
            "timestamp": "1194025211",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Well, I think I may have gotten a positive on the OPK today. I say \"I think\" because up to now, the second line has either been non-existent or just barely there. But today the line was pretty much as dark as the test line,but not darker. I still think that's a good sign, and I considered that a positive. If I go by the later date, I'm only CD14 today, which would seem like things are right on track. So we're very hopeful for this month!!  And yes, hubby got home last Saturday night so we've been BD-ing every other day since then. Yay! And thanks for the fertilityfriend link - it's been quite helpful!! Looking back now, I think last month we were just off on which CD it was, and I'm hoping that's why nothing happened. I feel much more positive this time.So I will be joining you for the TWW again!!  Good luck to you :) Maybe THIS will be our month.",
            "post_id": "2060699",
            "timestamp": "1194138808",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Yeah!  I'm glad your finally seeing something on your OPK!!  Woohoo!  Maybe this will be our month!  Good luck and keep me posted.  I'm sure we'll both be \"basket cases\" in about a week wanting to test, don't you think?",
            "post_id": "2065521",
            "timestamp": "1194277981",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "For sure!!",
            "post_id": "2065757",
            "timestamp": "1194281242",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Okay...let's get back on the TWW train!  I'm 3dpo and already have my hopes up again!!  Let's see if I can hold out until next Friday to test....hmmm...not likely!  LOL",
            "post_id": "2069830",
            "timestamp": "1194361478",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "If I got a +ve OPK test on Saturday and I ASSUME I O'd on Sunday, then I'm what, 2 DPO? Or do I actually count Sunday and say I'm 3 DPO.....I'm so green at all this!!!Anyway, I used to always get a pain in my side that I always associated with ovulation, since it's always been right around that time, and I did get a pain on Sunday....it was intense too (not just in my head!!), and in my left side. So I'm hoping it was O and not just gas! LOL!",
            "post_id": "2070601",
            "timestamp": "1194372780",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well...it depends.  A + OPK doesn't necessarily mean you o'd on Sun..it could have actually been Sat.  I have gotten - OPK's and only a + OPK on the day of O before...this month was different.  I'd say w/ your pain that you probably O'd on Sun so you're 2DPO.  I know I talk about this ALL the time but b/c I temp, I can tell the exact day I O, which is sooo nice.  You know what though??  Ever since I've been temping I haven't gotten pregnant...LOL!  Before when I was like \"eh\" ,I'd get pregnant easily.  Go figure.  Sounds like we're going to be testing around the same time (or WAY before!!) this month.  Hmmm...wonder if I have any in the cabinet.....LOL!!!I always wonder if the pains I feel around that time are gas or constipation too....maybe both..hehe.",
            "post_id": "2070886",
            "timestamp": "1194376499",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Oh my here we go again! I've had mild cramping in my lower abdomen the last 2 days......probably just gas (ha ha) but of course I'm reading into EVERYTHING again!!!",
            "post_id": "2074109",
            "timestamp": "1194447601",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "No symptoms here yet.  I just keep thinking that next Friday is soooooo far away!  I'll never make it.  I feel the urge to buy tests now!!!  Ugh!",
            "post_id": "2074779",
            "timestamp": "1194456247",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "hello ladies. i have been reading all of your comments and it amazes me how supportive you guys are. so i want like to join the ladies needing blessing talk. well here is my story. on 10/09 i found out i was expecting not thinking i was cuz i was taking birth control. well the next day i went got my blood work and my progestrone level was low at an 8. so i was put on pills to help my levels go up. well when i went to the dr 10/22 i was 5 weeks and that day i started spotting on 10/21 late that night. i was schedule for an u/s on 11/05. well on nov 01 i m/c. i passed everything naturally but what was strange was i had mild cramps and light bleeding. so on 11/05 i went to the dr and they comfired i did have a m/c. which i already knew cuz on 11/01 i passed my baby which look like it stop growing at 5 weeks. (my poor baby.) anyway. i stop bleeding that next day 11/02. when leaving the dr he sent me to go do blood work to check my levels to see if they were at 0 yet. well the dr called the next day and said they were at 0 and i could start trying again in about 3 months and to keep taking my vitamins. well screw that. me and my boo did the due yesterday morning. i don't know if i'm ovulating or not. i just want to have another baby b/c i also heard you r more fertile after a m/c. well i know they say wait after your first cylce to see when you conceive and when your due date is but i'm not worried about that. i just want to have a baby again. i have a 4 year old and that pregnancy went great even considering i broke my knee and had to have surgery at 3 months. it was excellent. i figure i just want to get pregnant again and have a healthy baby and we can wait to get an u/s and it will tell me when i due. but now i see i'm not crazy. there are other people who want a baby just as bad as me probably a little more. that's y i'm so glad i found this link. well good luck to everyone. skies the limit. but know one thing, all this we are going through we are going to get a big bleesing. some will have twins and triplets. i'm telling yall don't give up the victory will be ours. good luck and everyone is in my prayers and i hope im n yalls.",
            "post_id": "2075229",
            "timestamp": "1194461203",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Mind if I jump on the waiting train with you guys?  I just started trying to conceive in September.  I stopped my birth contol the 2nd day of September.  Right now my cycles are running 40 days.  I think because of just getting off of birth control. I have been trying to figure out if I am or have ovulated.  According to my Fertility Friend this is my week to ovulate but I don't know how reliable it will be until I get back on my pre-birthcontrol schedule.  Anyway, We have bd'ed every two days or every other day since the Oct. 20th.  So needless to say, I (I think hubby is too) ready for a bd break...LOL!  I believe my TWW period is starting the end of this week.For the last 3 days I have has slight (very mild) discomfort in my lower right side....",
            "post_id": "2075402",
            "timestamp": "1194463148",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "I don't blame you for not wanting to wait 3 months.  All dr's are different.  Mine said to wait one cycle and then start trying again.  Easier said than done b/c you get the baby taste in your mouth and want one soooo bad, that'll you waiting is almost unbearable.  Best of luck to you and keep us posted!If you're using Fertility Friend you're probably charting your temps??  If so you should be able to tell exactly when you have ovulated.  I'd say grab a pack of OPK's and get to peeing if you think this is your week to O!  LOL  Your hubby can take a break when you're in your 6 week recovery period AFTER you deliver!! HA HA!",
            "post_id": "2075792",
            "timestamp": "1194467743",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "yeah thanks for the support. but i have a question. i did go to fertility friend site today. i'm a little green to the charting and temp so please help me. i thought you have sex around 14 days after ya period and see if you hit the jackpot. that's what i did with my last two pregnancies and it seemed to work. my other question is how do i know when i will ovulate since i jus had a m/c? i figured me and my man will just get it on every chance we get until i either get pregnant again or see when af comes and start from there. but i'm not trying to see af. i trying to dodge her for 9 months and hope i have a bless beautiful baby. i kinda think i got pregnant so fast cause i just had a surgery to remove a cyst off each of my ovaries. i had that in august and got pregnant in september. but the dr said everything else was fine for me to have a baby. i also think something to do with the surgery or me taking birth control pills and being pregnant maybe had something to do with me having a m/c.but all i know is i want a baby and i'm going to work hard to get it and don't stop til i suceed. good luck to you. you will get that baby. i know you will. i have faith for all of us here.in due time we will have our babies!!!!!!!!!!!!!!!!!!",
            "post_id": "2077279",
            "timestamp": "1194489021",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Momof32b - You are hilarious! Thanks for the humor in the midst of our struggle.Unbornandworried - Welcome to the support group.  These folks have been a great support system to me and we are all pushing and praying for you!!",
            "post_id": "2078385",
            "timestamp": "1194529245",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Glad to see your still here!  Are you feeling okay since this last AF??  What did you guys decide about trying the IVF again?  I have a friend who donated her eggs to one of her friends and it worked perfect for her.  What are your concerns w/ egg donation?",
            "post_id": "2078588",
            "timestamp": "1194532244",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "It's hard to tell when you'll O after a M/C.  If your HCG levels were at 0 then you can just about guarantee that you'll O right around your usual time.  It took me 6 weeks to get my HCG levels to 0 after my last MC..probably b/c it was twins.  Once I saw a neg HPT, I started charting my temps.  I don't always 0 on day 14.  Mine ranges from 13-18 so I've been really relying on OPK's lately, esp since my hubby is lacking in the libido department.  I don't want to miss an opportunity!  If you don't mind me asking..how old are you?  I'm 36 and the dr told me it may take me longer now b/c of my age.  My advice...if you see AF this month, buy a BBT and read everything you can on fertility friend and keep BDing like a mad woman!  LOL!",
            "post_id": "2078642",
            "timestamp": "1194533023",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Wow, welcome to all you newbies!! I'm excited (doesn't take much with me BTW!)Now where to start on all those comments.....Unborn,  well after my MC in August, my first cycle wasn't until 5 weeks later, and my doc had told us to wait one cycle. We did, we tried, it didn't work, so now we're on attempt #2 and currently on the TWW. LIke momof3 said, you definitely might want to try OPK and temping. It will surely help you pinpoint when you O. It most likely won't always be on day 14. I've also noticed that my O date changed since my MC - it's now a little later.Mandy, you might want to try some OPK to help narrow down when you ovulate. After I stopped BC in March earlier this year, it took me 5 weeks for AF to arrive, but went back to 4 weeks after that. As soon as it did, I got pregnant.abraham&sarah - welcome back. Glad you're still here :) How is everything?momof32b - yes I know what you mean!!! Next Friday will seem like an eternity!! Ugh!Good luck everyone!BTW, my hubby is also ready for a break after this go around! I mis-read my AF date, so we started the BD on CD8 and went every other day or so until the CD15, with a few double ups. If it doesn't work this month, he says he wants to take a breather! I never thought I'd hear him say that. I like the idea of him taking a break in the 6 weeks after a baby arrives though....until then I'll milk him for all he's worth! LOL!",
            "post_id": "2078798",
            "timestamp": "1194535155",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Do we really have to wait until next Friday to start HPT? Ugh...I might try a little earlier......although I have none left right now, and since we all know how much I LOVE buying them, it might keep me away from testing too early. Now if only the mail-order I made would come, I'd be all set!!",
            "post_id": "2078810",
            "timestamp": "1194535288",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I say Friday b/c that's what my chart says on Fertility Friend.  Do you really think I can hold out that long??  Uh...NO!  I'll be 10dpo on Tues and that's probably the first date I'll test but I keep trying to talk to the internal POAS addict and telling her that she's wasting money testing before Friday.  If I had one in the cabinet, I swear I would have peed on it this morning!! LOL!  Tell me about you buying them in the mail??  Costs, etc?Keep milking the hubby!  I'll live vicariously thru you!",
            "post_id": "2079031",
            "timestamp": "1194538689",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I'm doing fine.  My heart really hurts but I am just fine.We have an appointment tomorrow for sono and blood.  If everything checks out ok, we will have the 3 frozen embryos transferred.  Not sure when the transfer will be, but the nurse said at O.  I'm not good with counting O (I usually know by the dull pain in my side), but she said half way through my cycle. So, if I have a 26 day cycle, then transfer would presumably be on day 13 right?  If that is true, then transfer would be somewhere this weekend, I guess.I'm sort of concerned about the blood work.  My cycle was really strange this time.  1 heavy day, 1 normal day, and then it tapered off.  Then, 4 days later, I had bleeding again for a few hours and then spotting for a couple of days after that.  My cycles are usually very predictable so this is concerning me.Anyway, whatever will be, will be.With respect to egg donation, I'm concerned that I might feel the baby isn't really mine.  May be silly. I don't know.  I just really want a baby that is fully mine and my husbands.  After every effort for that is exhausted, I will definitely consider donor eggs.",
            "post_id": "2079051",
            "timestamp": "1194538925",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I ordered the tests from www.early-pregnancy-tests.comIt's way cheaper than buying them from a drugstore, like less than $2 a test (for the most expensive type). However, it's been over 2 weeks and I still haven't gotten them, so I'm not sure what's up with that. I have a feeling it might be a Customs issue - I ordered them from the US but I live in Canada (I couldn't find a similar Canadian website), and I think with all this US dollar business, there might be a lot of American shopping going through customs. Oh well.Anyway, a friend of mine also gave me another website - www.accuratepregnancytests.com. She ordered a lot from there and said it took no time at all, even to Canada.",
            "post_id": "2079443",
            "timestamp": "1194544980",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "My heart hurts for you.I thought maybe that was your reasoning for the apprehension of using donor eggs.  I can completely relate!  You want the baby to have your features as well as your husbands.  I think that if you decide to go that route that once you felt the baby move inside you and carried it for 9 months,  it would be \"yours\" whether it were a baby or a puppy...LOL!  It's an amazing feeling.  That being said, I hope this transfer is successful.Lil Pig-that's an awesome price!  Are they the super sensitive types??  My luck?  I'll order some and get a BFP and have 20 left!  LOL!  Like washing the car and then it rains...hehe",
            "post_id": "2079735",
            "timestamp": "1194548777",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "i am 23 still young. i think i m/c b/c i was on birth control pills and was taking them until the day i found out i was pregnant. thank yall so much for the advice. i'm going to wait to see when af comes then i am going to buy me opk and try from there. i love talking to yall. well i went to the fertility friend site but it's hard to give them any info cause my lmp was 09/14 and i was pregnant after and i have not  has af since. so please tell me what is temping and how does that work. yeah at first i was a little upset with god but i knew that was only the devil. when the devil sees you have fear that is when he will try to mess with you. but what you have to do on your part is keep ya faith and god and know he will not hurt you. god wants you to come to him crying or whenever you have doubt. i feel that i am handling my m/c well cuz i went to god and ask him to prepare my heart for what is about to come. my dr was so amaze at how well i toke the news when it was told to me. i left with my head up high and told them this pregnancy may not have worked but i will be back soon to have my healthy baby in due time. really don't rely on opk use but don't put your trust in them. put that trust in god and leave everything in his hands. i believe you will get pregnant when you least expect it. i have a cousin who was trying to get pregnant for almost 5 years. she tried everything pills going to the dr and all. and one day she was like guess it's not meant for me to have kids. it must not be god's will. will do you know she got pregnant in in 08/06 and deliver a healthy baby girl in 05/07. i'm telling you prayer changes and you have to have faith. talk to god his listening and knows what you are going through but you have mean it cause god knows you heart. momof32b your day is coming and you will have that baby and when you told remeber to thank him. i'm praying for you more than me. god bless and keep me posted and stay in touch.",
            "post_id": "2079942",
            "timestamp": "1194551003",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "thanks for welcoming me. you and your family are also in my prayers. keep tring don't give up give it to god. he waiting for you to come to him. thy shall ask and thy shall recieve if it's his will.",
            "post_id": "2079970",
            "timestamp": "1194551371",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Yeah, I think they're the sensitive types...they rate them better than even some of the early tests I think (20 HCG maybe??) Not sure. It's kind of like my sister in law's thought on raining - she always takes her raincoat so that she won't need it ;) If you have 20 OPK, maybe it'll be your lucky month :)abraham&sarah - I was going to say something very similar to momof32b. If you carry a baby for 9 months, I'm sure you will feel without a doubt that it is yours :) I haven't been through it yet, but 3 months was enough for me to get attached, so I can't imagine what it's like after 9 months!BUT, since you still have this transfer to go through before anything else, a big fat GOOD LUCK to you. I really hope it works this time :)",
            "post_id": "2079975",
            "timestamp": "1194551427",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "thanks you also for your support. how do you temp. and i am going to go to the website you went to to buy tests. did they tell you what cause you to m/c. how old are you just wondering. and did you have a d&c or natrual m/c. god bless and good luck to also. we are going to have healthy babies soon. in jesus name i pray amen.",
            "post_id": "2080002",
            "timestamp": "1194551767",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Thank you for your prayers.  I have 2 healthy children now and have put most of this in God's hands, however I think me using opks and charting my temps are tools that I can't ignore.  God put the information in front of me to use.  Not having another baby will not break my heart but having another miscarriage will.I was on b/c up until I found out I was pregnant and m/c the first time too.  I've always wondered if that had something to do w/ it.Taking your BBT will give you a picture of your cycle.  Your temps usually stay lower before O, then rise and remain risen until AF starts to appear.  If you see AF, do a search on BBT and read as much info on Fertility Friend or tcoyf.com.  Tons of info!",
            "post_id": "2082805",
            "timestamp": "1194618463",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I'll start checking on these online/mail tests.  Sounds like a bargain....IF you can get them..lol",
            "post_id": "2082821",
            "timestamp": "1194618809",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "thanks for the info. what does BBT stand for. you know i green to all of this. and yes leave everything in god's hands. i wasn't saying not to use the opk just don't put all your trust in them. i'm going to buy me some. i also think my m/c had alot to do with me still taking my b/c and not knowing.i went to fertility friend and when i put in my lmp it's saying my period should have came on today. but i guess cause of the m/c my body is off track. some i'm waiting for af to come and start from there. by the way do you know about how long af should come after a m/c? what's the normal range. since the m/c i have been having a white discharge. is that normal? it doesn't stink or anything. i just wondering what could it be? thanks and good luck on ttc. please keep me posted. i love hearing happy endings. god bless.",
            "post_id": "2084855",
            "timestamp": "1194661480",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "They had no idea what caused me to MC, and that early stage it's hard to find out. In most cases they don't know for sure, but they say it is most likely caused by chromosomal obnormalities. I MC at 12 weeks, although the US revealed that the baby had actually stopped growning at 6 weeks, so it was a missed MC. I was given 3 choices - a D&C, to wait to see if it happened naturally, or a prescription, called misoprostol. I took the misoprostol because it's less invasive but faster than if I has just waited. It took me 5 weeks after that for AF to come, so yes, you're cycle is probably off because of that as well. It's hard I know, but be patient!!! That's what I keep telling myself.BBT stands for Basal Body Temperature. It's a way to track when you've ovulated. Basically you have to take your temperature (get a thermometer especially for that) every morning at the same time. It has to be your resting temperature, so before you get out of bed or anything. You'll get a peak in your temperature AFTER you've ovulated. It'll help you understand your cycle. BUT you might want to use OPK as well, since they'll give you an indication BEFORE you ovulate, so you can time the BD better :) Then the BBT will let you know when you've finished ovulation, and you can just wait.momof32b told me about a great site which has lots of good information on how to do all this, and you can input your info and it helps you track and tells you when your best chances are to conceive etc. It's called fertilityfriend.comGood luck!!",
            "post_id": "2088387",
            "timestamp": "1194796616",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "thanks for all the info. i went to that site but it was hard for them to give me the exact time when i should ovulate cuz of the m/c. so i guess i have to wait til af comes then put in my info. if my levels are 0 now could it be possible to get pregnant now or do i have to wait til af comes. i have read different forums where woman said they have gotten pregnant right after a m/c. one said she did the same week and the other was 2 weeks later. i was just wondering to see if you heard of that. thanks alot again. and good luck!!!!!!!!!!!!",
            "post_id": "2089063",
            "timestamp": "1194811677",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Not to ignore your previous posts and questions but I got a very faint BFP this morning!!  OMG!  I'm in SHOCK!!!!!  (okay...breathe....lol)",
            "post_id": "2095363",
            "timestamp": "1194963837",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "If you're levels have gone back to 0, it means that you can probably get pregnant before AF comes, but it'll be hard to know for sure when you're most fertile. You could do the BD every second day from now until AF is due (approximately) to cover all bases!! ha ha!!I have heard of people getting pregnant right away after a mc. We decided to wait one cycle, just because our doc recommended it - to give the uterus a chance to heal. That being said, we didn't get pregnant after the first cycle even though we tried.Lots of people take a long time for their body to get back to normal and get pregnant again after a mc. If you're ready to start TTC again, there's no real harm in doing so as far as I can tell. Good luck!",
            "post_id": "2096247",
            "timestamp": "1194975890",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "You mean you've been testing already!!!!! LOL!!That's great that you got a BFP.....cause even faint means it's real, right??? Woo hoo!!!!I was holding out on the testing, and I hadn't even bought any. But a friend at work who's currently due in January just brought me in all her leftover OPK and HPT. I know I'm going to have to resist the urge to test tomorrow morning :)OMG I'm so happy for you!!! At least someone on this post finally got a BFP :)Keep us posted, cause I'm sure you'll test more than once more before the week is out and AF is due! ha ha!!!",
            "post_id": "2096274",
            "timestamp": "1194976108",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I'd say there is a definite chance that you could get pregnant before AF.  I've read lots of posts in the past year where people got pregnant right away but then there's me that had to wait 8 months.  It'll happen!",
            "post_id": "2096723",
            "timestamp": "1194980889",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Yeah, I tested yesterday too w/ a BFN.  I told you I'm an ADDICT!  LOL!!  Of course I had a 2 pack and the other test was calling my name this morning so I was like \"What the heck\".  I brought it w/ me to work and I keep looking at it and giggling.  Already called my dr too to find out if they want to see me early b/c of my history.  I just can't believe it!",
            "post_id": "2096745",
            "timestamp": "1194981079",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "i'm so happy for you. i believe you are pregnant cause i'm claiming it. good luck and plese keep us posted.well starting yesterday my breast have really been hurting and tingly. what do yall think. is it af bout to come or what. i don't want to take a test and get my hopes up and it be a BFN. so i'm going to just wait. but i know my levels are at 0. but i just kinda wonder what can be going on. me and my dh only had sex one time since the m/c 2 weeks ago. so i doubt i'm pregnant but just wondering do any one have any advice?",
            "post_id": "2099555",
            "timestamp": "1195018051",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "I actually resisted the urge to test this morning!!! I may try tomorrow morning though :) So you got a BFP yesterday, but a BNF the day before? What DPO are you? I think we're about the same, aren't we.unborn, I'd say that if you got pregnant after just having sex once, and having no idea what your cycle is doing post MC, you're one luckly lady!!!! My advice?? Just keep having lots of sex (LOL!!) until AF comes (or doesn't!) If it doesn't after a several weeks, take a pregnancy test :)Good luck!",
            "post_id": "2100285",
            "timestamp": "1195047766",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Thanks!  I'm THRILLED!!  And shocked at the same time.  I got up this morning about 3:15 and took another test...still positive!  I just can't believe it.  My first symptom was sore tingly bbs!!! AND we only had sex once around O!!!  It could be your time too!!I'm 11dpo today.  When I tested on Monday (BFN) I could actually see like a shadow of a positive line when I looked at it in the sunlight but I thought my eyes were playing tricks on me.  I've stared at so many negative tests that I've made myself see lines..spots...stars!!  LOL  Okay...close your eyes and imagine you're at a football game and the crowd starts to chant...TEST....TEST....TEST...TEST....TEST.....  I'll be anxiously awating your results!!!",
            "post_id": "2100437",
            "timestamp": "1195050026",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "i am so happy for you. so are sore breast the only symptoms you have? i'm so excited for you.please keep me posted and in your prayers. good luck. i hope i am preggo too. i hope me, you, and lil pig are lucky ones this month. has anyone heard from abraham&sarah. i was wondering how she has been doing.lil pig how are you besides waiting to get that BFP. well i hope i am lucky enough to get preggo so soon. but my breast just staring hurting out of no where. they hurt to much to be pms. so i was wondering what it can be. i hope it means preggo. so when will you start testing? good luck and god bless",
            "post_id": "2100646",
            "timestamp": "1195053065",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Other than being REALLY dragged out this week for no apparent reason, and tingly bbs every now and then, I haven't had any other symptoms. Actually now that I think about it, I've been really hungry with a burning sensation in my tummy every morning for the past week as well. And it keeps coming back throughout the day and I keep having to eat little snacks to make it go away. I was like that all through my last pregnancy, but not until about 8 weeks. (funny cause the baby stopped growing at abou 6 weeks, but I stayed \"pregnant\" until 12 weeks, with ongoing and ever increasing symptoms. )So maybe I do have some symptoms, but I just keep telling myself that I'm reading into things, and it's nothing because I don't want to get my hopes up. Last month I did that, and I only got disappointed. So we'll see. I'm gonna test tomorrow morning.The test I got from the girl at work though, are the dip tests, so it's a little more work....",
            "post_id": "2100697",
            "timestamp": "1195053681",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Nope, no word from her.  I hope she's okay.  So far bb's are the only symptom but they're making me crazy!  I breastfed both my kids and it feels like my milk is letting down...that strange tinly sensation....and it's only going to get worse but I LOVE IT!  LOL!I know all about getting your hopes up too...month after month.  Man!  I don't want to wait until tomorrow!  Don't you have anything there you can pee in??  A drink can...??  Something??  LOL!",
            "post_id": "2101936",
            "timestamp": "1195067320",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Thanks for your encouragement.  I have faith that God is ABLE to do exceedingly, abundantly above all that we could ask or think.  I know it is the will of God for us to be fruitful and multiply.  I am waiting (even though the wait is painful) to see how He miraculously works this out for us and all those in this support system.  I have asked, I have cried out, I have believed, I have prayed.  I will not give up.  Most importantly, if God doesn't allow it to come to pass, I still trust Him.  Thank you so much for your prayers.",
            "post_id": "2102451",
            "timestamp": "1195072965",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Hey there.  I'm sure you are right about me feeling the baby is mine once I feel him/her inside of me.  Honestly, part of my concern was that I want him/her to look like me and my husband (vanity!!!).  Also, I don't want to feel like an outsider - that my husband and the children have something that I'm not really apart of.  Don't get me wrong, he would never do or say anything that would cause me to feel that way. It was my own insecurity.At this stage, I'll accept whatever God allows.  It takes a lot of energy to be depressed and worried.  I'm casting all of my cares on God and accepting whatever He has for us at this point.My estradiol level wasn't high enough to do the transfer with this cycle. And, my doctor's office shuts down the last two weeks of December.  So if 12 days into the next cycle doesn't come before they shut down, we'll be looking at doing the transfer next year.  We'll see what happens.",
            "post_id": "2102534",
            "timestamp": "1195073593",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "I just read further down the conversation chain and saw the message that you got BFPs!!!!!!!  I am screaming with joy!!!!!!!!!  Praise the Lord!!!  What a joy.  I am so happy for you.",
            "post_id": "2102602",
            "timestamp": "1195074318",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "BFN!!!! Phooey. I did the test yesterday evening. Now I'm bummed. I'm hoping it's just too early. Last night I had cramps, like AF cramps, but not. Maybe it was implantation, cause that can happen usually around 7-10 days past conception, and I would probably be about 10 days if it happened. And since you can't get a +ve test before implantation (no hcg yet), maybe that's the reason???See I'm just grasping at straws here now....I want to badly to believe I am pregnant.I mean between the fatigue, and the morning nausea, and the extreme irritability, it's just like the last time I was pregnant. I mean yesterday evening my husband was tesaing me, in a loving sort of way, and I almost ate his head off, and about 5 seconds after that I almost broke into tears. Although it could just be PMS too, I guess, but it's not usually this bad.   I'm still praying though!!!!",
            "post_id": "2105140",
            "timestamp": "1195128099",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Thank you so much!  I'm estatic!  I haven't told DH yet b/c I'm waiting for the right time.  He's been under the weather and in a foul mood.  You guys are about the only ones I've shared w/ except for my best friend/HPT inspector!I had cramps w/ my last pregnancy like I was going to see AF but she never showed.  10dpo is still very early and my test was so faaaiinnntt that I wasn't even sure if I was seeing what I was seeing.  Fingers, legs and eyes are still crossed for you!",
            "post_id": "2105938",
            "timestamp": "1195142785",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Thanks Dear!  On a selfish note, I really needed to hear your good news - it gives us all hope and strength to keep trying.  I'm really glad for you and your husband.",
            "post_id": "2106179",
            "timestamp": "1195146188",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Phooey is right!!!!!  I know you are bummed.  I am too for you.  Don't give up my sister.  It's going to happen.",
            "post_id": "2106189",
            "timestamp": "1195146290",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies. I still have everything crossed as well.I just have a gut feeling that I am pregnant, so I hope it's not just becuase I want so badly to be!!!But if I'm not, boy do I have a bad case of PMS. LOL!",
            "post_id": "2106384",
            "timestamp": "1195148923",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "i am so happy for you. your prayer was answered. god bless and i hope everything turns out great. now you can eat lots of food on thanksgiving and not have to worry about gaining weight.LOL!!!!",
            "post_id": "2106490",
            "timestamp": "1195150178",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Thanks guys.  I really, really appreciate all your encouragement and congrats.  I anxiously await all your BFP's!!!",
            "post_id": "2107181",
            "timestamp": "1195159952",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I'm sorry I haven't been able to get on.  For days I kept getting \"This site is temporarily unavailable\" so I quit trying to get in until tonight.!!!!How exciting for you momof32b!!!  Very cool!!!!I have been getting the test fever myself.  I am going to hold off until at least Saturday, even then it might be kind of early.  The only sign I have been having is a light off and on cramping/discomfort in my lower right side, and slight tenderness of my bbs.  This started yesterday.I have my fingers and toes crossed for the rest of us.... Let's order up a big fat helping of baby dust!!!",
            "post_id": "2108767",
            "timestamp": "1195181851",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "baby dust and good luck and god bless!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "2108939",
            "timestamp": "1195184996",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "I had an IUI done 7 days ago.  Not sure if I'm pregnant yet,still waiting to test in 7 days.  I had an orgasm last night with my husband and it was different than my regular orgasm feeling.  I felt some spasm feeling though my vagina to the uterus.  Could this mean that I'm pregnant?  Is that why I felt something in my uterus during an orgasm?  Or is it too early to have this feeling?",
            "post_id": "2109319",
            "timestamp": "1195193986",
            "user_id": "user_335215",
            "user_link": "/personal_pages/user/335215",
            "votes": "0"
        },
        {
            "answer": "Took another test this morning - still a BFN :(I'm still hoping that it's just not picking it up yet, but my hope is starting to dwindle for this month....bummer!momof32b, we'll all just have to live through you for a little while! Ha ha!",
            "post_id": "2109695",
            "timestamp": "1195214691",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "hang in their. your day is coming. it might be your time next month. but we will all get there soon. i have faith.momof32b- what's the lastest? have you been to the dr yet to see what your levels are? well keep us on the latest which i know you will. good luck and baby dust to all!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "2110176",
            "timestamp": "1195224451",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Oh! Almost forgot.I got my mail package yesterday (finally!) with all my HPT and OPK and a BBT thermometer. So, I started temping this morning. As soon as my alarm went off at 6:15 I did my first reading. It seemed kinda high to me (98.61). I thought most women are about 97 - 97.5 prior to ovulation, but with a rise after ovulation, but then dropping again. Since I'm on CD27, shouldn't mine be dropping again? Could this be a sign that I might be pregnant if my temp is still high? Or maybe it's just a wonky temp. (I know it's just one day so far right?) Maybe I\"ll wait to see what tomorrow shows....not looking forward to purposely waking up at 6:15 on a Saturday morning!!! LOL!",
            "post_id": "2110866",
            "timestamp": "1195234097",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Mandy 0079-WELCOME!  As you can read, we're all a little nutty here...LOL.  I can't wait to hear your results from testing on Sat.  Hope it's a BFP!!!!Lil Pig...I'm so sorry it's a BFN (for now).  I know how discouraging it is.  Just hang on for now.  Now..for your temp question.  Everybody is a little different.  Prior to O mine are usually 97.4-97.9 and after O from 98.1-98.6.  Now that I'm pregnant they've been 98.7-98.9 (dead give away that I was pregnant).  I can't say that yours are falling or maintaining or high b/c we have no temp history.  Just write it down or chart it on fertilityfriend.com and let's see.  IF your temp continues to stay high you've got a good chance that you are preg and test again in a couple of days (IF you can hold out).  Temping has been a wonderful tool for me.  I'm so used to doing it that most of the time I fall back asleep w/ the thermometer in my mouth..lol.  For me it doesn't have to be the same time of day to temp b/c my temp doesn't change much if I wake up an hour later than normal.  Just play w/ it and see what you get.  I can help you if you need me to.Unborn&worried-My first dr appt is Dec 12 @ 8:15 w/ an U/S.  She's not doing any bloodwork on me or anything and I'm kinda glad.  I like living in Ignorant Bliss right now.  I'm taking my progesterone and prenatals and just hanging in there.  I'm supposed to call if I see anything abnormal and pray that I don't.  It's weird too b/c I \"know\" I'm pregnant but just can't believe it!  The shock hasn't worn off yet.  Now I'm just trying to figure out how to tell DH.  Last year I told him on Christmas Eve when he unwrapped a baby outfit...this year, I don't know.  Any suggestions?",
            "post_id": "2110966",
            "timestamp": "1195235404",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "i think you should tell him on thanksgiving. see a person like me would have been told him cause i can't hold sugar water. that's just me. or play some kind of game with him and tell him. or you could wait (if you can) until after your dr's app and tell him on christmas or have him go to the dr with you and find out there. one more take a hpt and put it in a box with a card and tell him that way.",
            "post_id": "2111376",
            "timestamp": "1195245841",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "I had thought about telling him right before I went to the dr or just making him go w/ me and not telling him why.  I think he'll probably ask me where AF is pretty soon b/c it's time.  Thanks for the suggestions.  I'm just not sure.  I know I'm telling my mom on Christmas.  I got her a new purse and I'm going to put an HPT in there...lol.  We're not telling the kids until Christmas b/c it has broken our hearts having to tell them that we've lost 2 pregnancies.  It's too confusing for them.  So how are the bb's??  Still sore and tingly?",
            "post_id": "2111542",
            "timestamp": "1195247984",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "OMG!  I am like you unborn... I couldn't hold that kind of news in!!!  Your are a strong woman momof32b :)  My hubby would know just because I won't be able to look at him with out smiling...LOLLil Pig- Hang in there!  It is still possible :)  I have everything crossed for you :)New sign today.  It could be a sign of AF or preggo.  I had tiny spot of brownish pink on my underwear this afternoon and a slight smear on the tissue paper.  Nothing since...  I had one spot with both of my boys so I am going to go with the positive approach.  If I were to guess I am 9 dpo, but I am not completely sure, it just seems right according to the signs I have been tracking since Septemeber.  I really need to start taking my temps if this is not my month.I am really scared to take a test tomorrow.  Especially if what I had today could be implantation I wouldn't get a BFP anyway so I will probably wait on the testing...  I need to go pick up an early response test... The one I have probably won't pick anything up this early.I tested so much last month that I resorted to the cheaper brands after spending over $60 just on hpts, and I have one cheapy left.... :)",
            "post_id": "2112790",
            "timestamp": "1195269929",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "yeah that's sounds good to bring him to the dr with you and i agree wait on telling the kids. how many and how old. i'm soooooooooooo happy for you. god does hear our prayer more like cry. yeah my bb's are still sore. it's not as bad as the last pregnancy and they hurt a little more than pms. so i playing the waiting game. me and my dh and sex wed. so it's been twice since the m/c. i hope i am blessed. but i don't really have any other symtoms. o yes one more. i have been tired alot today. but i don't know if it is cuz i'm coming down with a bad cold tho. just remember keep me in your prayers and you know you are in mine. god bless and baby dust to all who read!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "2113079",
            "timestamp": "1195277159",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "yeah i can't hold that kind of news. well keep us on the update when you test and if af comes. i wish you the best and you are also in my prayers.",
            "post_id": "2113087",
            "timestamp": "1195277337",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Thank you so much unborn :)  I will hold you in my prayers too!I am worried that AF is coming.  I am not cramping or anything, but when I go to the bathroom and wipe, I see a very slight/light pinkish-brown tint to the paper.  :(  I will wait a few days if there is no AF, then I will test.  I don't want to waist one...",
            "post_id": "2114245",
            "timestamp": "1195320726",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Mandy0079, hopefully it is just implantation bleeding!!I'm still waiting too - got another BFN this morning. I've got to stop testing and just wait to see if AF comes. Tomorrow or Monday is when I'm expecting.On a more positive note, since Wednesday (10 dpo) my CP has risen again, and is now very high. It did go down low a few days after my suspected O day, but it's gone back up...shouldn't it stay low if AF is coming? Also, my temp was still up pretty high again today, momof32b. It was 98.5. Not sure what any of this means, but I think this whole TTC business is making me have OCD!!! LOL!!",
            "post_id": "2115384",
            "timestamp": "1195346123",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "That is pretty exciting!  I have read that the CP will rise when pregnancy takes place.  It happens at different times for different women.  Some women will notice it to rise right before AF should take place and others notice it to rise well after pregnancy has been confirmed.   So that could be a good sign.  Do you usually track your CP?  If you do, and normally it doesn't rise again before AF then that is a VERY good sign...please keep us posted!!!Since I am not currently taking my temp I haven't really learned much about that yet.For me, I am hoping it is implantation.  I just don't know though.  I still have the slight discomfort on my lower right side.  I have had a few little spots on my panties since I wrote last earlier this afternoon, and this evening when I went to the bathroom there wasn't really anything on the tissue.  Part of me wants to get excited but the other part of me feels like AF will show up.  I guess because with my two prior pregnancies I had one little spot for implantation and that was it.  I have had off and on spotting since yesterday.  Also my CP was low today....  Since I didn't check with my prior pregnancies, I have no clue when my CP went high when I got preggers.",
            "post_id": "2115855",
            "timestamp": "1195356227",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "I really need to go to bed, but I am a little more excited now.  I have been up searching the web on implantation bleeding.  I figure if I am around 10 dpo now, it would make sense that this could be IB.  Since I had IB with prior pregnancies I didn't consider that I would have anything that looked different.  From what I have read it is very possible to have IB for 2 days and that not every pregnancy would have the same symptoms.  SO, I have pumped myself up a little bit more now.  I have decided on a test date if AF doesn't show.  I am going to test on Tuesday- that would put me about 12 or 13 dpo, or do you think that is too early?  Tuesday would land me right on the day before I believe I should start....",
            "post_id": "2116224",
            "timestamp": "1195367636",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "well ihope you are preggo and you get that bfp. what does cp mean? i'm a little green to some of this. well keep us updated and god bless and lots of baby dust.lil pig and momo- how are you ladies? just saying hello and best of luck.",
            "post_id": "2119399",
            "timestamp": "1195455139",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "CP= Cervix Position :)I am hoping I am too... I just don't know.  I thought for sure yesterday late afternoon I was going to start AF, it certainly seemed like it.  The spotting was starting to go from a tinting on the tissue to a little thicker consistency and the cramps were getting stronger.  Then a few hours later it was back to the way it was before.  In fact I am not spotting/cramping at all now (this morning) but I know that can change in a blink of an eye.  BTW, I cheated yesterday afternoon when we got home from church, I bought a couple early response tests- aaaannnnndddd it was a BFN.  I wasn't surprised though... If what I am having is implantation, yesterday would be too early to test anyway.I just hope that if I am preggers, then the IB goes away so I can test tomorrow.What about you unborn, any signs still?",
            "post_id": "2120204",
            "timestamp": "1195481798",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Hey guys!  I'm not on the computer any on the weekend sorry!  All is well.  I took another test on Sat w/ a much darker BFP so I could actually show hubby the results.  I got up in the middle of the night when he was up and put the test beside his drink.  He was like \"what's this thing\" and then was shocked and happy!  We're both very cautious at this stage in the game b/c of the prior m/c's, so we're not talking about it much until my dr appt Dec 12.Kids are 10 & 6 and knew about the prior pregnancies.  It was difficult for them too and too much for them to really understand.  They're going to be thrilled though!  We're telling them on Christmas.I have OCD w/ this stuff too!  I analyze and over analyze everthing and search every website out there.  Temp being up is still a good sign but don't know jack about cp.  I never did that before.",
            "post_id": "2120689",
            "timestamp": "1195488068",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "mandy-well good. my bb's are sore on and. when i woke up they are a little more sore, and i'm having light cramps off and on too. i thought yesterday af was coming but nothing yet. so far that's good. but it also has only been almost 3 weeks since the m/c and they said af usually comes 4-6 weeks after if it comes. but in my case i hope it doesn't me and dh have did the due a couple of times since the m/c. i hope we are bless. i went to church yesterday and said prayers for all of us. well good luck and baby dust.momo- that's great!!!!! i hope you enjoy thanksgiving and eat all the turkey you can eat. god bless. god is so awesome all the time. baby dust",
            "post_id": "2120983",
            "timestamp": "1195492251",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Hey ladies....started spotting yesterday with mild cramping, and it looks like today AF is pretty much here. Bummer. It's funny cause my temp dropped way down on Sunday morning and again today. Still not sure why my CP moved back up so high. But I've only started tracking it this month, so maybe that's what it always does!!It's weird though....I really didn't have much fertile CM during the last cycle....it seems more fertile now with AF here.....could that be? It doesn't match with my OPK.....but then again, you can have a positive OPK and no ovulate right? Can an infection make your CM not very fertile? Maybe that's what happened.Too many questions, I know! Sorry. I'm just looking for answers, anything, as to why it didn't work this time. At least now I am temping so I should be able to tell if I O this month. AND I'm going to try taking Robitussin to thin out what CM I do have. I\"m just willing to try anything at this point!!! Anyone know how early I should start taking that?Everything just seems to have changed so much since my MC. It's like it's someone elses body.The GOOD thing about all this (look for the silver lining, right?).....my predicted fertile days will be right around DH's birthday - he's happy to hear that :) LOL!Good luck Mandy and unborn on getting your BFP!!momof32b - looking forward to hearing how your kids react at Christmas :)",
            "post_id": "2121291",
            "timestamp": "1195496272",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Momof32b- I bet hubby was really excited!  I am really happy for you and your family!  Christmas will be a great time to tell the kiddos...unborn- Looks like you and I are in the same boat... Although no cramps or spotting for me today and it is around noon here... I hope that means something good!  I am praying for all of us too, safe healthy pregnancy for Momof32b and for the rest of us to get BFP soon!Lil Pig-  I'm so sorry to hear :( ~~~ I have decided to do a few thing differently next month if I don't get a BFP this month.  I am going to order some of that pre-seed.  To help with CM.  There seems to be some really positive out comes with those who have used it.My CM doesn't seem to be in abundance.  Yet I read somewhere while surfing the web that it is not always a bad thing if you don't have a lot of CM.  It could mean that it is all staying in the cervix where it is needed.  I am also going to start taking my temps as well and look into drinking some green tea.  I hear you need an acquired taste for it....so we shall see.",
            "post_id": "2121392",
            "timestamp": "1195497678",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "I find Green Tea really bitter, even with a lot of sugar, so I can see what you mean by an acquired taste.....on that note though, what does green tea do with regards to getting pregnant?",
            "post_id": "2121639",
            "timestamp": "1195501136",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well, there is a lot of controversy out there on the Green Tea subject.  I hear that there are supplements abstracted from Green Tea put into fertility treatments, and then you hear that Green Tea has other things in it that could counter act getting pregnant.  So you really just have to read all the pros and cons to decide for yourself.What made me decide to try it is I was reading some \"Trying to Conceive\" blogs out there and quite a few of the women who were having trouble conceiving started drinking decaf green tea (1 cup a day) and doing the Robitussin thing and were getting preggo.  For most it was the first month of starting these new habits.  I can't do the Robitussin thing...yuck!  I rather choke down the green tea and use pre-seed.  LOL  Have you looked into using pre-seed?",
            "post_id": "2121705",
            "timestamp": "1195502106",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "I'd never even heard of pre-seed until you mentioned it, so I looked it up. Sounds like it might be worth a try, but unfortunately if I ordered it, by the time it got here, it's be too late for this month. But I'd have it for next if I needed. I suppose even if I didn't \"need\" it, I'd probably use it anyway.I was also looking at the Fertile-CM supplment. Have you read much about that? I'm willing to anything and everything at this point. LOL! It sounds nicer than the Robitussin. I totally gag on cough meds but I'm going to do it anyway...hold my nose and chase it with apple juice or something, LOL!.....I was hoping I could get it in pill form, but no such luck. I think Mucinex (which is the same thing) in pill form, but I can't find it here. Maybe it's only in the US??? I dunno.Anyway I'm off for today...it's 5:01pm where I am :)",
            "post_id": "2121845",
            "timestamp": "1195504324",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Hey that Fertile-CM supplement seems interesting too!  There a few extra benefits to using it from what I read as well   *wink wink*Let's see... if I take the Fertile-CM supplement and add a pinch of pre-seed ------- heck! those little guys will be sliding into home base as if they were sliding on ice....LOL!  No need for them to search for it...they'll smack right into it!    heheheStill no more spotting or cramping this afternoon....  I am still holding out hope...  My doctor called me back a little bit ago (I spoke to the medical assistant this morning).  He told me that it could be implantation... just to hold out for a few days and re-test.  He said it is pointless to test any time before my AF is due, because if it is BFN then I will just retest and retest.  So here I go again moving my test date.  I will test on Wedneday 1st thing in the a.m, that's when AF is due.His famous last words to me were....  \"If you are pregnant then you are pregnant, if you are not, you're not.  It is what it is...don't try to guess - just try to be patient.\"  (in his loving tone)  I guess he gets a lot of those calls.  I have never called him before about this, but I could tell he had it all ready as if he has said this a 100 times before..>LOL",
            "post_id": "2122125",
            "timestamp": "1195508450",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "You're hilarious! Sliding into home base...too funny! LOL!Well you only have another day until you will test and hopefullly get your BFP - I will cross my fingers for you!!",
            "post_id": "2124397",
            "timestamp": "1195559921",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I cheated this morning. I was going to wait until Wednesday, but it was my hubby's fault.  He said, just take the cheapy test tomorrow morning.  Save the more expensive one for Wednesday.  So being the good wife I am, I wanted to make my DH happy. (like he has to twist my arm anyway)SO...  I got a VERY light BFP this morning!  I already called him and told him over the phone.  I can't keep anything a secret!  He would of asked me anyway.  I am going to retest this afternoon just to be sure.",
            "post_id": "2124681",
            "timestamp": "1195567486",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Congrats on your BFP!!!",
            "post_id": "2124823",
            "timestamp": "1195569787",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Okay first off...Mandy0079....OMG!!!  Can I get an hallelujah!!!!!  Faint or dark...it's a BFP!!!  Keep me posted on this!!!Lil Pig-I'm sorry you're seeing AF :-(  I know all too well how hard it is to see her after you feel in your heart that you won't.  Sounds like you're keeping a positive attitude and planning for this month.  Just a note on CM.  Sometimes I didn't have any fertile cm and I'm not sure why.  This month I saw fertile CM way before I expected it and BD'd as soon as I saw it...and it worked.  I've read the whole robitussin thing too and was going to try that soon.  I think you have to take it like 4 times a day to see any benefit??  I think I would gag if I had to take it that often but hey...if it works, do it!",
            "post_id": "2124942",
            "timestamp": "1195571272",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Mandy - Congrats on your BFP!!!  That's so wonderful!!Lil Pig - I'm sorrry that AF visited.  Wish we could just tell her to visit someone else that wants her company.  Stay encouraged by sister.Momof32b - I'm excited that things are still going in the desirable direction for you and DH.  I can imagine the overwhelming joy you must feel.  And just think - you'll see your baby's little face in a matter of months!!!!Unborn- - I'm praying for you.  Just remember, it is God's will for us to be fruitful and multiply.  Speak His Word back to Him in faith.",
            "post_id": "2125192",
            "timestamp": "1195574695",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Thank you so much!  It's so hard to believe.  Mainly because its a cheapy test and the lines are soooo faint.  I can't wait to retest and put my mind at ease.",
            "post_id": "2125311",
            "timestamp": "1195576328",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Mandy - It is going to work out for you.  I believe it.Everyone - Have a happy Thanksgiving Day with your families.  While the baby dust hasn't fallen on some of us, we still have much to be thankful for.  Just that we are alive and have the ability to TTC is a blessing.  I'm grateful for DH, other family members, and for all of you!!!  Thank you for being a support and an encouragement to me.  I am blessed to have connection with each of you.  Enjoy your day.",
            "post_id": "2125680",
            "timestamp": "1195582282",
            "user_id": "user_262180",
            "user_link": "/personal_pages/user/262180",
            "votes": "0"
        },
        {
            "answer": "Even though it's not Thanksgiving for me, (we had ours back in early October) I can still be thankful for the support of everyone on here! It helps to talk to people who truly understand :)Have a good Thanksgiving to everyone who is celebrating!!",
            "post_id": "2125740",
            "timestamp": "1195583071",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well i have being coming here reading up on you guys and Mandy0079 I'm so happy for you. Anyway i can't wait to take HPT i have being trying for so long and nothing so this month i did things different i got myself some geritol complete and Folic acid and i also did self insemination and all that so wish me luck as i'm dying for a child.",
            "post_id": "2126181",
            "timestamp": "1195589002",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Thanks abraham&sarah and suzettee!    Just as you Lil Pig, I am thankful for you and all the rest of you women here that have been so supportive...  Plus one super sweet gentleman who has been keeping up with us and PM'ed me a congratulations.I am trying to stay hopeful.  I should of waited until after taking my 2nd test before telling everyone that I have a BFP.  I took another one this afternoon and it was BFN....  It was really heart breaking since I was sooo pumped up.  Since I have read about the difference in the hormone - morning vs. afternoon- I went to the store and bought a digital test. WeeelllllI bought two of them...LOL  It will tell me pregnant or not pregnant.  No dark lines, faint lines, skinny lines, fat lines...it will just tell me.When will you be able to test suzettee and unborn?    Good Luck to you both!  I have everything crossed!Any new updates on how you’re coming along momof32b? Are you feeling ok?  Has the fatigue set in yet?Lil Pig and abraham&sarah, I am going to be praying you.  I have a good feeling about you both.  I just know it's gonna happen.  Before I had any glimmer of excitement/hope today, I was thinking to myself.  God has a day and time in mind for my baby.  He does for yours as well.  It might not be our time frame but on His, and usually that is the best timing!",
            "post_id": "2127688",
            "timestamp": "1195610415",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "thanks for the prayers and good luck to everyone. i don't know when i will test. but look mandy i'm having some of the same symptoms you are. slight tenderness in the boob's, mild cramping,bloated and the other day i started having this thick white discharge after me and my sweetheart had sex. any advice on what it could be? after sex i started bleeding very light and only when i wiped it was a light light pink. then i started this discharge. i know it's not a yeast infection cause i'm not itching or burning and it does not have a smell to it. i'm always feeling wet and when it's in my panties it tends to have a brown tint to it. sorry to be so detailed but i'm just wondering what it is. if af does not come after the 1st, i'm going to test. so like in one more week in a half. i don't want to get my hopes up and nothing happens. so i'm going to at least wait to see if the witch af comes. which i pray to god she doesn't. good luck to everyone. please pray foe me and i'm always doing the same. happy thanksgiving to all?yeah momo how are you doing since you got that bfp. you go girl. i'm be in that number which you in no time. alot of us are. best wishes hun.",
            "post_id": "2127812",
            "timestamp": "1195612761",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "hhhmmm... I know brown tinting is usually older blood.  The spotting I have had is brownish or pinkish.  I had a couple more spots tonight (tinting the tissue) which is really bugging me since I had that BFN this afternoon.  I know that false positives are not very common, and I will be so upset if that is what I had this morning.  I have that BFP test I took this morning sitting here on my desk and I keep looking at it like a fairy is going to jump out of it and talk to me.Spotting after sex isn't too uncommon, I think everyone does it every once and awhile.  Now that I think of it, it is more common in preggo women because more blood circulates to the cervix during pregnancy which causes spotting after sex.  I just read about that tonight.  As far as the CM, I'm not really sure hun... It could be perfectly normal.  I would do some google searches on that and see if someone else out there mentions something similar.  I do that  A LOT...lol",
            "post_id": "2128137",
            "timestamp": "1195618690",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Look at this forum posted on 11/20:The Maternal & Child ForumTitle: need adviceby: amandaislostSounds sorta like the discharge you were asking about....",
            "post_id": "2128151",
            "timestamp": "1195619015",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Well have you no faith just relax and take it easy i believe that you BFP is correct so wait some more days and then test again i'm also praying for you so don't be discourage well AF is not due until dec 3. so i have a long waiting.",
            "post_id": "2129293",
            "timestamp": "1195655898",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Okay...I'm rolling!  Mandy0079 you let me know if you see that fairy jump outta your test!!!  LOL!!  I still get in the cabinet and look at my BFP's b/c I'm just so shocked that I'm actually pregnant!!  How many dpo are you again??Lil Pig, sounds like your temp plumeting means that AF is on it's way....and I'm soo sorry!  I'm blowing some baby dust off my hand at you.I'm feeling fine but the other night I couldn't hold my head up.  I was in a coma on the couch before 9:30.  With my other pregnancies I was sick to my stomach in the evening instead of the true \"morning\" sickness and that seems to be setting in.  Just kinda queasy from 5-7 pm.  BB's are tender but not unbearable.  I'm trying to eat better and keep thinking that by the end of next week my baby will have a heartbeat!  It's so amazing!  I thank God everyday!",
            "post_id": "2129321",
            "timestamp": "1195656528",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "How cool momof32b!  As sorry I feel for you, I can't wait to be in your position.  LOL  It's the greatest sickness in the world!I took my test this morning and BFN :(  I have cried all morning.  I would of handled a BFN a lot better if I didn't see that BFP.  I'm temped to call the company that made the test and let them hear how much this has devastated me.The test I used this morning is known to be the most reliable so I am going with those results.  Thank God I only told a few people other than you ladies.  It is heart breaking to have to go back and tell them differently.  I have taken many hpts in the past and this is the first time I have ever had a \"false positive\".  I have learned a lesson though.  Wait until the second test results before opening mouth...LOLI know that God has a day and time for my baby.  So I'll pick up the pieces and move on :)Thank you so much ladies for all of your support and for going with me on this roller coaster ride...",
            "post_id": "2129744",
            "timestamp": "1195662824",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Wow, I haven't been on here yet today, but look at all those posts!!Mandy0079, sorry to hear about the change in the BFP to a BFN - could it be possible that it was just a very early \"chemical pregnancy\" that didn't really come to fruition? I don't know much about those things, but it's a thought.Momof32b....heartbeat already? Boy time flies :) All the best for everything going well this time :)Gotta jet, but I'll be back later. Momof32b, I have some more questions about temping.....",
            "post_id": "2129862",
            "timestamp": "1195664770",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "You're so sweet!  If no AF appears I will retest in a few days.  My hubby called this mid morning and said he is still holding on to hope too.  To day is the day my AF is due so if it doesn't come by Saturday, I will retest...Deep down I am scared to test any more this month.  I feel so heavy inside...hard to explain.",
            "post_id": "2130297",
            "timestamp": "1195670843",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Oh dear!  I'm so sorry to hear this.  I can put myself in your shoes and feel your pain and frusteration.  It will happen, I just know it!Lil Pig...Yep heartbeat starts at the end of week 5!  I'll be more than happy to answer your q's on temping but I probably won't be on the computer any this weekend.  I'll answer them as soon as possible.",
            "post_id": "2130305",
            "timestamp": "1195670949",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "Thanks Lil Pig and momof32b.  I am going to go with there is still hope until AF shows...right?    No need to throw in the towel until you have a towel to throw....**Mandy's eyes squinting as she looks towards the bright side**",
            "post_id": "2130378",
            "timestamp": "1195671784",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "You've got a very valid point.  How many dpo are you again?",
            "post_id": "2130529",
            "timestamp": "1195673807",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "I believe I am 13 to 14 dpo.  If AF comes then I am going to start taking my temps and charting those along with my CM and CP better.   My cycles are around 40 days since I quit taking birth control.  That's the hard part for me, I have soooo long that I have to wait before I have a fertility window.  Not to mention we start bd'ing early just in case my cycles decide to start to become more regular so we are at it for almost 3 weeks. (from CD 8 all the way through the time that I show I should ovulate till around CD 28) We usually bd every other day or the latest 2 days apart in that 3 week period.  I think I ovulate around CD 26 but we go to 28 to be sure.Since I haven't pin pointed when I ovulate exactly my fertility calendar shows everything as CD.",
            "post_id": "2130596",
            "timestamp": "1195674854",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Boy you do have long cycles.  Mine were 25-26.  I think you'll get a lot of benefit from charting your temps.  It will allow you to see patterns in your cycles as well as let you know exactly when to start using OPK's 'cause them bad boys are EXPENSIVE!",
            "post_id": "2130975",
            "timestamp": "1195681160",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        },
        {
            "answer": "well i think this is not my month either. i think af is coming soon. i have this white this discharge. so not being nasty but i stuck my fingers in me and there was light pink blood. still hope but feel like i'm getting af cramps also. but until i see af then i'll know for sure. i hope not. could it be ib? i never had it before with any other of my pregnancies so i don't know much about it. but my cramps are not that bad as af cramps. so still keep me in your prayers and i will do the same. HAPPY THANKSGIVING TO ALL!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "2131861",
            "timestamp": "1195697514",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "I guess my temping questions is realy just this - how reliable are they if you're a poor sleeper?For instance on Monday night I slept pretty restlessly and the woke fully at about 5:30am - I took my temp just in case. It was 97.13. My alarm goes off at 6:15 (that's when I had planned to do all my temping). I slept well from 5:30 until my alarm went off. I took temp again and it was 97.47. Now, which should I use?Similary the following night I woke up at 5:45am, and hadn't slept TOO badly up to that point. My temp was 97.27. Checked again at 6:45 before I got out of bed and it was 97.54.Now this morning I slept pretty well right until my alarm went off at 6:15, and my temp was 97.61 (I did feel really warm this morning.)See, my temps are all over the place. I know it says you should get a good 3 hours of sleep before temping, but good sleep for me is hard to come by. So should I take my temp when I wake up after sleeping restlessly, or take it after the one good hour (almost) I usually get between 5:30 adn 6:15???Too much info I know, but just wondering what your opinion is. THX!",
            "post_id": "2133214",
            "timestamp": "1195740745",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well i'm getting really frustrated and anxious at the same time AF is not due until 3 Dec. and i can't wait to take a HPT after so many years of TTC why do i think it going to happen this month? well i don't know but the wait is long so i'm just hanging on.",
            "post_id": "2133246",
            "timestamp": "1195742127",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "How long have you been TTC? Have you seen a specialist?",
            "post_id": "2133295",
            "timestamp": "1195744275",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "well not really my BF when to one and is count was low but this month we took Geritol complete and i'm schedule to do a HSG but this month i did some self insemination since and when i did i heard some bubbling sound from inside weird right, anyway i thought that maybe that sound means that the tubes are open well maying a baby so badly make you think crazy stuff lol.",
            "post_id": "2133317",
            "timestamp": "1195745154",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Hi what how are you today? is Af here as yet well we are both going through the same thing i'm TTC for so many years and then for the first time i missed my period that was in october and i'm telling you that i was overwhelm i thought well its going to happen but that was shattered in November and then that make me want a child even more badly cause i never thought that i would ever miss AF for a month so this month i did thing different i got my self some Geritol complete along with folic acid and i bought a OPK and i got a positive for two days and then i did some insemination so sis. i'm here waiting to see if there is some baby dust for me so pray for me as i do the same for you.",
            "post_id": "2133474",
            "timestamp": "1195748945",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Hi how are you well i'm so excited for you i hope one day i will be able to feel that joy that you are feeling.",
            "post_id": "2133491",
            "timestamp": "1195749289",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,i hope you dont mind if i join you here?First of all i want to say CONGRATS to all of you who got BFP.I have been talking to unbornandworried for a while now and we are both going through the same thing. I had a miscarriage on the 20th of Oct,jus a few hrs after i found out i was pregnant.I had a natural m/c and it lasted only a week.my levels did go back down to '0', but now am feeling pregnancy symptoms again.For the past 2weeks or so ave been having mild abdominal cramps,high temperature,nausea,tingly breasts.Last wednesday wen i go toilet i saw light pink blood on the tissue which only lasted about 2hrs,then saturday i could swear af was coming because i had period like cramps but i only spotted brown for about 2hrs again,the same thing also happen to me monday and yesterday but yesterday i had alot of brown spotting.At one point on tuesday my breasts were hurting that much i had to remove my bra.I feel fine one day and the other day i get symptoms.Today is the 25days since i finished miscarrying.Can anyone give me their opinion please?I already done a test but it was a BFN,it might have been too early even if i was preg.Am thinking of going to the doc next week if af doesnt arrive by then but in the mean time i would love to get ur opinions.Thank you and goodluck to all of us who are waiting to test,hope we all get a BFP.God bless us all.",
            "post_id": "2133611",
            "timestamp": "1195752644",
            "user_id": "user_308587",
            "user_link": "/personal_pages/user/308587",
            "votes": "0"
        },
        {
            "answer": "Hi Tammy  Good to see you here :)  I just finished up writing to you in the other thread..LOL  These ladies here are so wonderful and supportive.  They have been a huge blessing... You will want to add this thread to your watch list...  :)Suzettee - I have got you on my prayer list.  I made one to be sure I didn't leave any of us out :) I know Dec 3 seems so far away right now... the TTW makes me nutty.  Especially when I my cycle is so long, it seems like forever just to get to the TTW part.unborn -  I feel like I have been on the edge of AF for almost a week now. In fact it has been 5 days now that I have had light spotting.  I am not giving up until she knocks on my door...so you don't either ok?   Tonight my spotting was heavier (meaning I seen a few drops on my panties) and I was crapping for about an hour, but then it went away again.Hubby and I bd'ed tonight so I could kick start AF if that is the case.  If AF doesn't show then I will take it as a good sign.  Bd'ing around the time of AF usually puts her into action.  If she doesn't show, then hubby suggests we retest on Saturday....  I never thought the day would come where I would want to start my period on purpose. I figure if she is going to come, then the sooner the better.  If she isn't then I will be on cloud 9.",
            "post_id": "2134661",
            "timestamp": "1195790482",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "How does a person do \"self insemination\"? I've never heard of that before.",
            "post_id": "2135297",
            "timestamp": "1195819189",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "Well i read it on the internet you can use a syringe to collect the sperm and then gentle insert it into the vagina so i went a head and did it i guess it will bring the sperm alittle closer to the fallopian tubes.",
            "post_id": "2135539",
            "timestamp": "1195828647",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Hi well its just spotting and as you say you will take it as a good sign. Have you ever had this experience with the spotting before?",
            "post_id": "2135544",
            "timestamp": "1195828818",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "well i thought af was coming but she has not came yet. thank god. but i still have alot of white and kinda brown discharge. i don't know what's going on. me and tammy are going through the same thing right now. i just hope it means i preggo. but i really thought af was coming cause i had light pink bleeding and af cramps. but within a hour it all stopped. one day my bb's are okay. but yesterday and today they are tender. i really hope none of us gets a visit from af for 9 months. i have toke a test cause i'm thinking it might be to early. so i want to wait and see if she does not come then i will test. any advice ladies on what you think? i know my levels went to 0 right away and i have did the bd 3 times since my m/c. well good luck to all and god bless!!!!!!!!!!!",
            "post_id": "2136193",
            "timestamp": "1195843017",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "No AF :)  I am getting excited again.  Not one sign of her today!No, suzettee I have never experienced spotting like this before.  Never, even when  I was pregnant before so that is why I can't figure out exactly what the heck is going on.I wanted to give in this morning and test again, but I am going to hold out till tomorrow....  if I don't figure something out soon I may have to get committed because I am becoming crazy with all of this back and forth on my emotions.  LOL!",
            "post_id": "2136291",
            "timestamp": "1195845572",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Hi well just wait until tommorow as you said as for me i have one and a half week left to go i won't be able to see your reult until Monday but i'm praying that you will have some good new for us.",
            "post_id": "2136375",
            "timestamp": "1195847447",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "I sure hope time goes by quickly for you.  Try to keep yourself busy so you don't think too much about it.  We need a TTC remote control that comes equip with a fast forward button!!!!",
            "post_id": "2137284",
            "timestamp": "1195868813",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "BFN...  On day 44 since my last visit from AF.  Still having spotting off and on.  Going to have to make a doctor appointment and find out what the heck is going on.Although I started taking my temp this morning...",
            "post_id": "2141327",
            "timestamp": "1196004839",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "sorry to hear the bad news. but keep your head up there is always next month.",
            "post_id": "2141569",
            "timestamp": "1196011058",
            "user_id": "user_319032",
            "user_link": "/personal_pages/user/319032",
            "votes": "0"
        },
        {
            "answer": "Thanks unborn :)  I am trying not to let the BFN get to me, the thing that is getting to me is what the heck happened to AF?  My cycles prior to birthcontrol were not 28 days on the dot, but at least they were consistant enough to be with in 33 days or so...  I have never had cycles like this.Any suggestions ladies?  Do you think I need my hormones checked?  I quit taking birthcontrol on September 1st, I have had one visit from AF since then...  I thought my cycles were 40 days out, but now I'm going on 45 days tomorrow...",
            "post_id": "2143168",
            "timestamp": "1196045108",
            "user_id": "user_293374",
            "user_link": "/personal_pages/user/293374",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear the bad news well the same thing happened to me, on September 18 AF shows up then nothing until November 3 i when through alot since that was the first time i missed a period i bought HPT all of then came back BFN so i when to the doctor did the test still BFN he sent me to do a pelvic endovaginal ultrasound on the November 2 and then Af shows up on November 3 could you believe that, all that money so take it easy.",
            "post_id": "2144495",
            "timestamp": "1196086752",
            "user_id": "user_320192",
            "user_link": "/personal_pages/user/320192",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies...sorry to hear about all these BFN's :(Mandy0079 I'm not sure what's going on with your cycle. I think you're right about going to see the doc.Me, I'm on CD8 and temping...so right now, nothing new to report from me!!Had a weekend full of baby showers though, one which was for a very close friend who is due 2 days before my original due date (before I MC). Tell me that wasn't rough. Ugh. I just PRAY that I'm preggo again by the time she has her baby - if not I'm going to be a mess!!! I'm really hoping for a Christmas present....wouldn't that be nice:)  But we've got to start the BD-ing  first!!! LOL",
            "post_id": "2145849",
            "timestamp": "1196104809",
            "user_id": "user_258821",
            "user_link": "/personal_pages/user/258821",
            "votes": "0"
        },
        {
            "answer": "I had a good friend of mine have a baby shower in Feb...  it turned out that it was the first weekend that I thought I started my miscarriage... my second m/c, so I knew what was going on-  we tried for 5 months to get pregnant with that baby...  so I skipped her shower...  she didn't talk to me for months...  some people just can't understand if they haven't been there... so I think it is awesome that you made it to her shower-  I would have been able to go later once we got through the miscarriage,  but I understand how difficult it must have been for you! I wish you best of luck this month!!!!",
            "post_id": "2146112",
            "timestamp": "1196108353",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "Hey!  I've been off for the long Thanksgiving weekend, so sorry for not posting.  I wouldn't be too worried about your waking time.  If it were me, I'd use my first temp...unless I was able to fall back asleep right away, then take it when your alarm goes off.  I know that if I wake up later my temp will be a small amount higher but not enough to effect the overall picture.  You're looking for patterns at this point.  Do you see a dip prior to O?  Does your cm correspond w/ the days prior to O?  For now, just temp and let's look at your chart after one cycle.  It took me about 3 months to get the hang of it.I'm feeling kinda yucky today.  I'm officially 5 weeks (seems so much longer since I found out so early) and from what I remember about my other pregnancies, 5 weeks usually marks the beginning of my \"blah\" period.  I just hope it's not too bad this time.",
            "post_id": "2146244",
            "timestamp": "1196110080",
            "user_id": "user_180483",
            "user_link": "/personal_pages/user/180483",
            "votes": "0"
        }
    ],
    "post_id": "1985862",
    "question": "Anybody out there waiting to test?  I'm 7dpo and just praying for a positive!  I need some company, so I won't feel like it's just me.",
    "timestamp": "1192470184",
    "title": "Can't wait to take an hpt!",
    "user_id": "user_180483",
    "user_link": "/personal_pages/user/180483"
}