{
    "answers": [
        {
            "answer": "Hi,Never had this problem but I know that some people do have it.The only thing that I can suggest it to get your own blood presure machine for home and then start taking it occasionally. If you take it regularly then I would imagine that you will get used to it and then it won;t become a big deal when the nurses take it. You will also see then that BP goes up and down all of the time and it is perfectly normal.The only thing that I would say though is do not do this if you know for a fact that you will become obsessed with taking your BP all of the time and then stressing over the reading. You know that your readings are high but I would imagine that this is through stress. You obviously work yourself up for sometime before the actual event.The only way I have gotten over any of my fears are to face them head on and just keep on with it no matter how awful it is.Good Luck",
            "post_id": "3532854",
            "timestamp": "1224078130",
            "user_id": "user_468452",
            "user_link": "/personal_pages/user/468452",
            "votes": "0"
        },
        {
            "answer": "I have panic disorder, along with a lot of other stuff, and I have a couple behavioral tips that I have been taught when I get in a situation I don't like.First, remember that you can always tear that cuff off when they crank it up so tight!  It's velcro, and easy to undo.  It sometimes helps panic to know you have an \"escape\" plan, even though you may never do it.Second, deep breathing is very helpful in the midst of panicky feelings.  And a reality check, by asking yourself, \"Is this the worst thing that can happen to me today?\" and also by looking around the room and seeing the nurse and recognizing everything in there and reminding yourself that you're just visiting the doctor as usual.",
            "post_id": "3532969",
            "timestamp": "1224079936",
            "user_id": "user_13274",
            "user_link": "/personal_pages/user/13274",
            "votes": "0"
        },
        {
            "answer": "read my post armyboy/man in transition into adulthood community, i hava 17 1/2 year old who has the same problem only with pulse  He almost couldnt get into the army because of it, a doctor anwser my post you may find it interesting. Also learning some relaxation techinques would be helpful.When my son was hooked up to the pulse ox (they didnt want to do his manually) his pulse ( heart rate ) went up 15 beats or so every time a pretty nurse walked into the room LOL, cognitive therapy is likely going to be called for, but read my post just for kicks,",
            "post_id": "3533412",
            "timestamp": "1224087025",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "i thought i was the only one with this fear.. it's a relieve to know i'm not alone.. the one thing that i try to do is when i'm at the drug store and see the machine I freak out, but i sit down and take my blood pressure like 15 times.. it's always high at first but then it goes down.. It maked me feel better because i'm the only one that can see it...trust me i know what it feels like.. when i was pregnant it was a nightmare...just know you are not alone...",
            "post_id": "3533570",
            "timestamp": "1224089483",
            "user_id": "user_537497",
            "user_link": "/personal_pages/user/537497",
            "votes": "0"
        },
        {
            "answer": "Thanks so much to all of you who are responding...it really does help me ☺",
            "post_id": "3533728",
            "timestamp": "1224091918",
            "user_id": "user_446896",
            "user_link": "/personal_pages/user/446896",
            "votes": "0"
        },
        {
            "answer": "hi firstly your reading of 127/92 isnt massivly high and its bound to go up if your nervous, the only thing with getting a home blood pressure machine is you can get obsessed but maybe if you got one and limited yourself to using it maybe once every 2 weeks would be a good idea also the readings can be in accurate so if you got a high reading at home it could make u freak out!!! i used to hate having my BP done i was terrified of it being high so i bought my own machine and it rules my life",
            "post_id": "3536645",
            "timestamp": "1224157538",
            "user_id": "user_447939",
            "user_link": "/personal_pages/user/447939",
            "votes": "0"
        },
        {
            "answer": "Thanks for your response and I do realize that it may be a problem if I get my own machine.  Ihave been checking my HR at home with my workout monitor and I seem to be doing that all the time now...even though I know the numbers are OK :(",
            "post_id": "3537027",
            "timestamp": "1224167067",
            "user_id": "user_446896",
            "user_link": "/personal_pages/user/446896",
            "votes": "0"
        },
        {
            "answer": "All I have to say is that the whole thing stinks.  I have suffered from anxiety since childhood and it has progressively gotten worse.  I never had a problem with high blood pressure until I used one of the grocery store BP machines, about 2 years ago, and the reading was a little high (142/89).  I can reason that it was because I had been running around with a toddler and was in a rush, but that was the beginning of the end.  I started obsessing, I went to my Dr. that same day and was having a panick attack.  When they took my BP it was 152/90 and once I relaxed it dropped to 120/80.  They sent me to a cardioligist because by HR was so high and the EKG was abnormal.  I went to the cardiologist the next day, my BP was 110/70 and the stress test was normal.Unfortunately, ever since I have not been able to relax about having my BP taken at the Dr.'s office.  It is always high, a couple of months ago it was 140/90.  I brought a BP machine and the readings are usually high because I'm anxious about the process and then they drop to normal (average 115/75).  Recently, my anxiety has been worse and, in turn, my readings are higher.   Now, I 'm anxious about the HOME BP machine and obssessed about my BP.I am trying Transcendal Meditation (TM), there's a lot of research that supports its effectiveness on anxiety and high blood pressure.  I think that I'm going to need to take an SSRI (like Zoloft) as well.I welcome any other suggestions....",
            "post_id": "3538852",
            "timestamp": "1224192685",
            "user_id": "user_653180",
            "user_link": "/personal_pages/user/653180",
            "votes": "0"
        },
        {
            "answer": "I thought that I was the only one with this----I know that my pressure goes up because of anxiety- can't get an accurate reading because of this. I feel like running away even when I see someone else taking their pressure at the drug store... I think part of it is fear over  the cuff tightening ---feeling trapped or not in control... I bought a monitor for home at the suggestion of the clinic nurse- but just hate having it at my house- too scared to go near the thing. Readings are always high...how can we get over this ???How can the doctors treat us for high blood pressure( if we even have it?) if we can't get an accurate reading????I think one of the best things to do is get really healthy- eat low sodium foods etc.This seems to give a sense of power over this area.",
            "post_id": "3539967",
            "timestamp": "1224210782",
            "user_id": "user_626040",
            "user_link": "/personal_pages/user/626040",
            "votes": "0"
        },
        {
            "answer": "Hi Autumn! I see you are still having issues with your BP. I know we discussed ways for you to get over this fear, but either they didn't work, or you didn't try them.Working on a surgical unit in a hospital, I assume most of you can imagine the number of BPs and HRs I take in the course of my shift. Literally hundreds! And I take them on many people who have the same fear as you. In a way, it's not really a fair analogy because folks who are in the hospital are generally in pain, on heavy duty drugs and are afraid. Their blood pressures reflect all of those. Which is why we repeat it through out the day. I had one patient, a young woman in her late 30's who was petrified of having her BP taken because it was always high. DUH! Fear=HBP. One day, as an experiment, I walked in to take her BP and could see her tense up immediatley. This gal, by the way, was NOT on any medication, had NOT had surgery, was NOT in pain and was going home in a few hours after having gotten some VERY good news about her \"condition.\" I took her BP and it WAS high. But I knew she was stressed about the procedure. When she asked me what it was, I told her the lead had come lose from the machine and it hadn't been able to read her BP. So while I pretended to fuss with the machine, I asked if her daughter was going to be a princess, AGAIN, for Halloween, which got us to laughing and talking about all the silly things WE had dressed up as kids, and what we'd go out as now all these years later and That really got us to howling and it was then that I pushed the button, but she was still laughing so hard she didn't realize I was taking her BP until, as they say, it was \"too late!\" Her BP was the lowest she had ever seen it. When I started to take the cuff off, she said \"NO! Do it again!\" I told her it was unlikely the numbers would be that low again as she was now going to focus on her fear, but she insisted, so I did. Her BP was a smidge LOWER than last time.I'm not trying to say I'm some sort of magician, I'm not. SHE was the one who had the epiphany that day! It became clear to her what her fear was doing. Before she left the hospital that day, she had me take he BP 6 more times! The numbers varied by only a few points, which is normal. Was she \"cured?\" Who knows. I haven't seen her since but I have a feeling she learned that day what fear can do.Kind of a long story to emphasize that by focusing on fear, you will always present with higher numbers. And one other thing, by sitting at one of those drug store BP machines and taking your BP 15 times in rapid succession is NOT a good thing to do! That cuff squeezes pretty tight and after 2 or 3 times, your blood vessels are saying \"well, this doesn't feel so real good, so we obviously need to pump HARDER when we get squished!\" Guess what happens by the time you've done that to them 10 times? And you should always relax for at least 10 minutes before taking your BP at one of those places since more than likely you've been running around like a chicken with no head doing errands and you plop down in the chair, relieved to be off your feet, out of breath, you shove your arm in the cuff and push the button.......and guess what? Next time, pick up one of the magazines they usually have laying about, stick your arm in the cuff but do not push the button! Spend at least a good 5-10 minutes reading a \"fun\" article, do NOT read the \"10 Warning Signs of Impending Death From High Blood Pressure!\" Read about some horribly expensive spa that none of us will EVER be able to afford and just let your mind drift.............forget the hustle and bustle going on around you, forget all the things you still have left to get done.....take a good deep breath and push the on button but continue to read, do anything but stare at the numbers! When the machine is done, it will beep, you won't miss what your reading was. But I promise you, you'll be surprised.I know I've gone over how to deal with a home monitor and not get yourself totally obsessed with that, so I won't repeat myself. If you want to talk about that again, please PM me and I'll be happy to walk you through it as many times as you need!You can do this. It's mind over matter.Keep me updated!PeaceGreenlydia",
            "post_id": "3542894",
            "timestamp": "1224276756",
            "user_id": "user_370181",
            "user_link": "/personal_pages/user/370181",
            "votes": "0"
        },
        {
            "answer": "You guys all have to remember high BP doesn't mean you're going to have a heart-attack necassarily.  High LDL and high triglycerides probably have more to do with it.  And all people are built different, my whole family on both sides have pretty high BP and my great grandpa just turned 91 (and he's a decently sized guy), and is still going strong and still gets in an hour of walking a day.  My mom had a check-up and her BP was 150/90, but she isn't overweight (lots of muscle), but since her cholestrol was so good the doc (she in fact has low LDL and High HDL) he didn't see the need to put her on medication.I'd worry more about if you have kidney disfunction if you have High BP IMO, maybe get your creatine checked.",
            "post_id": "3587464",
            "timestamp": "1225234511",
            "user_id": "user_577156",
            "user_link": "/personal_pages/user/577156",
            "votes": "0"
        },
        {
            "answer": "hi.  I loved your response on taking BP and the associated anxiety.  I can relate to everything you said.  I would like to add one thing and see what you think of this.  I have thought about the fear of taking my BP or having it taken alot.  I really came to the conclusion that mine is a form of performance anxiety.  My fear is the comments and reactions of the taker.  I have one nurse who I feel totally relaxed with and she gets me 120/70.  Any suggestions on how to handle my fear of reaction?  I usually go in and tell them it's going to be high so knock yourself out.  But I feel intimidated and fearful that their going to judge me and make these condescending comments, etc.  Strange, but I feel blessed I have identified my problem, just looking for any suggestions on how to deal with the medical people I come in contact with to take charge and beat them to the punch if you will.Thanksmy email is ***@**** if you wish, but any comment on here is great.",
            "post_id": "3820821",
            "timestamp": "1230683517",
            "user_id": "user_722423",
            "user_link": "/personal_pages/user/722423",
            "votes": "0"
        },
        {
            "answer": "Two issues. As regards blood pressure that is a specific health issue I am not familar with so I can't offer specific advice. Post in the forum for that. Of course if your anxiety disorder speeds up your blood pressure then that's another issue but both need to get under control. But I never found blood pressure machines unnerving. Many things that were unnerving I got used to such as weekly bloodtests from Clozaril (which I was on years ago). After a while they were just a fact of life and I would get them once a week and head off to work. As for blood pressure I have a blood pressure machine. I was on Atenolol for a while (to control e.p.s., when I was on conventional antipsychotics) then Clonidine (to control dystonic spasms) and now Tenex (same purpose although both serve as mood stabilizers, as well). More importantly, taking my blood pressure is standard and as well I take Zofran (for tardive dyskinesia, although it has somewhat of a mood stabilizing effect) as well since both drop blood pressure, when titrating the medications at first it went way low and I did have to call my neurologist and psychiatrist asap. But the machine itself is harmless.As for being concerned about blood pressure that's important but I noticed after I had a minor disagreement with someone my pulse went way up so controlling anxiety will help and stress is good for no one. Its important to remember people with anxiety disorder do blow worries out of proportion. That's true. But unless someone is experiencing psychosis as I did before recovery then the worries are not entirely unrealistic. We can't hide from them but we must understand them factually. Then they don't seem frightening to begin with. If you don't have a blood pressure disorder reading books on it will just scare you but if you do need to monitor for blood pressure then just consider it something to balance out and what are the proper numbers. The more its approached logically the less time you'll have for anxiety and that may help overall with life's issues if it could be extended to other matters.",
            "post_id": "3821943",
            "timestamp": "1230710819",
            "user_id": "user_585414",
            "user_link": "/personal_pages/user/585414",
            "votes": "0"
        },
        {
            "answer": "I know this thread is kind of old, but I had to respond.  I have had a fear of having my BP taken ever since I was 16, and I am now 29.  I had a very unpleasant experience with my pediatrician in 1996.  My BP was a little up for my age, probably because I was scared of going to the doctor in the first place, and he gave me an embarrassing lecture about my weight in front of my mother.  I was crying when I left the office, and felt humiliated.  Ever since then, I have DREADED having my BP taken.  I think it really did something to me psychologically, as if having a high BP is something to be ashamed of, and I fear the judgmental health professionals out there.  It's ridiculous to say it out loud, but I fear the cuff and the entire process.  I took a CNA course in college, and the day we practiced taking BPs, I actually left early so that I wouldn't have to be anyone's guinea pig.Because of my fear, I often avoid the doctor (and even the dentist, since they often take BP there too) even when I need to go.  I have no problem with shots or having my blood drawn, or even any kind of pain; but the thing I fear is the BP cuff or machine.  I mean, it is a terror for me.I know that it is something I need to learn to accept.  I am 29 years old, and I am not getting any younger, and high BP does run in my family.  I am also overweight, though I have lost 25 pounds in the last couple of years.  I still have a good way to go, though, before I am at the correct weight for my height and age.  I can't keep avoiding the doctor when I need one, but I am just so afraid of having a high BP reading and getting another lecture.  I am even afraid of taking it at the store on a public machine.  I fear what I will see.  What if it's high?  Then, I'll know it's high AND I'll be afraid to go to the doctor because he/she will see it, AND I'll be afraid of what could happen to me because it's high.  It's a vicious, ridiculous cycle.  Just typing all of this makes me feel so silly, but it is a true and deep fear for me.  One of my biggest, right up there with flying.Anyway, I am surprised to see that there are others out there with this same fear.  I always thought I was alone in fearing having my BP taken.  It does help to know that other people suffer from this fear.  Thank you, greenlydia, for your suggestions and for your story about the patient you helped.  Maybe soon I can try a public BP machine and try some relaxation techniques beforehand so that I can get through it.  If I could learn to get used to it and not feel like a panic attack comes on when I even SEE a cuff, I could get myself back on track and going to get checkups regularly.",
            "post_id": "4731681",
            "timestamp": "1249398787",
            "user_id": "user_992534",
            "user_link": "/personal_pages/user/992534",
            "votes": "0"
        },
        {
            "answer": "It may be a bit late to post my comment now but I really felt relieved as soon as I found you! I thought I was the only one in the world having this fear and felt stupid and ashamed to speak about it.It's become a nightmare. I find myself thinking about it and how to get over it or trying to take it by myself as if I had to prove that I'm brave and strong.It all became when I had my BP taken by doctors in an ambulance.I was waiting for a coach to take me to the airport where I had to catch a flight back home. My nose started bleeding. I never had that problem before. I felt a bit shocked and worried. What if I missed my plane home? What do I do now? I'm alone, I don't know anybody. I saw an ambulance and asked the operators for some ice. They decided to take my BP to stay on the safe side. I sat inside teh ambulance and when they started the procedure my train of thoughts took the control. I felt I was about to panic and just for a moment I thought \" What if it's high? I'm gonna be stuck here, they'll send me to the hospital and I'll never be able to go back home. My parents will be informed and will be so worried and we'll have to come to the hospital.\" I saw myself lying in a bed, desperate, alone in a hospital, being scared by the sad and worried faces of the doctors looking at me as if I was hopeless. The pressure that day was just a bit higher than normal because I felt my pulse accelerating. I felt the need to justify it and felt a bit hurt by their comments and even ashamed.Since then I've been totally, literally petrified everytime I see the BP monitor machine. I've been tempted to buy it myself several times but as I tried once and felt a need of escaping I just abandoned the thought.I  'm sorry for those of you who have my problem but at the same time I feel relieved! It's not a crazy and unreasonable thing  as I thought!Thanks all!",
            "post_id": "4880667",
            "timestamp": "1253196418",
            "user_id": "user_1042831",
            "user_link": "/personal_pages/user/1042831",
            "votes": "0"
        },
        {
            "answer": "I appreciate all these posts are old, however have found comfort in this site. I too suffer with this problem. I have a history of panic attacks. However happy to say after many sessions I am pretty much panic free. Apart form medical procedures (I can live with this). Whilst on holiday I had a weird bite/blister and had to go to hospital just to get it looked at. Well I got myself in a right old state. Had a full on panic attac! Sily really got into the docs he said it was fine, cleaned it up, gave me some anti’s and that was it! (felt silly for getting in a big tizz, but that’s me and part of who I am). Well during this process they too my BP! I didn’t even think about it being high even though my hb was about 160! I had the shakes, was hyperventilating and had palpitations. The doc just said hmmm that’s quite high then said but your stressed and didn’t appear overly concerned.As I left the docs I had a print out of my experience and there it was 168/99 said hypertension risk! At that point I should have just processed why! But no not me. I thought “what if I have BP problems” even though I had looked on the internet and see that when we panic we release adrenalin which increases the pulse and makes our BP go up all logical. Well I decided to forget about it and was logical until this point my BP had always been fine and I didn’t want to get a phobia about it!Then I fell pregnant. I was over the moon and still am… however suddenly when reading through my antenatal notes realised that at each visit they take urine and you guessed it BP!!!!!!!!!!!!!!!!! I could literally here the theme from psycho ringing through my head. How will I cope, what will I do, I won’t be able to keep calm. Coupled with the fact I know any doc wont be happy if its high, even if I look stressed! As this is one of the main indicators for preeclampsia. I felt desperate.So I thought lets be positive, armed myself with self help books, breathing exercises, whale music. Attended the 12 week scan all went well. Then had my appointment I got in a right panic nearly 9 out of 10. was flushed, had palps, sweating. Took BP, said it would be high and it WAS 160/100!!!! Eeek doc looked abit alarmed. I explained my situ. They didn’t seem to understand. They said I didn’t look stressed ( I have learnt to hide it, plus I don’t fear panics anymore and I knew what was causing this one). He quiet rightly needed to be satisfied he did it again down to 140/90 better! Still I wasn’t relaxed.. Kept messing with cuffs. Well he let me out eventually but still looked slightly uneasy. Which meant I thought he thinks I have high BP when I should have thought he is doing his job, I am pregnant so he has to cover all bases.So I brought a home BP monitor! And now I am obsessed with it. The 1st reading still always high usually 146/75! Usually top figure that is high. Then always goes down to 120 over 70! After a few mins. Its like the first reading is my fear then I calm from there.Yesterday I did yoga was totally chilled but the BP cuff on heart rate shot instantly form 75 beats to 138! And BP was 150 /76 then I relaxed, breathed and it went down consistently to 125 – 130! So I know it always goes down! If I had high BP it wouldn’t always go down it would remain at the same figure. I do really believe deep deep down that I am fine and do not have any BP problems. However I can’t understand at all why I can’t control that first reading.In all other area’s of my life my anxiety has disappeared. Maybe its just my way of putting some control into my pregnancy!All I do know is I have 8 more appointments (yes I have counted and I cant keep doing this to me or baby). At my 16 weeks appointment the midwife was great, it was 136/86 she said I am totally fine with it, not worried at all. Thought it would be higher.I know all the logic, I understand all the logic. I just cant stop that immediate reaction when the cuff goes on. Its helped just to write all this down!Any advice welcomex",
            "post_id": "5131912",
            "timestamp": "1259661802",
            "user_id": "user_1124759",
            "user_link": "/personal_pages/user/1124759",
            "votes": "0"
        },
        {
            "answer": "I too suffer from this...I see that some of the posts are years old but just wanted to comment and like the comfort of knowing I am not alone with this.  Everytime someones says BP, I see a BP machine or whatever, I freak out.  My BP gets so high in my DR office (I HATE going there because I know they are going to take me BP).  My DR has mentioned that she worries with BP that high during an anxiety attack you could have a stroke.  So she put me on a low dose of BP meds and anxiety meds.  But, even with those (they make me feel less anxious in general) I still freak out with the BP machine and it goes up...ugh, so sick and tired of it...it's been like this for awhile now and I just feel helpless...if anyone has any tips, please let me know...",
            "post_id": "5265803",
            "timestamp": "1263437925",
            "user_id": "user_1172342",
            "user_link": "/personal_pages/user/1172342",
            "votes": "0"
        },
        {
            "answer": "I cannot believe, but am so relieved, that I am NOT the ONLY person this affects!!!!  I get so nervous about going to the Dr that my blood pressure shoots through the moon.  When I see someone else getting theirs taken, I get sick to my stomach.  My Dr. does not believe me.  I take my BP at home (takes quite a few tries because of, yes, I feel like I'm gonna fail a \"test\") but I eventually get a normal reading.  She increases my BP meds then I don't function at all.  I end up cutting the dose in half!  A lot of the problem IS knowing the nurse is going to make some comment.  Also, I asked the nurse when I went to the Dr. last week why they don't follow the guidelines and let you sit still and relax for 5 minutes before they take your BP and she said they can't!  I suppose time is the reason.  Anyway, makes me feel somewhat better just knowing I'm not losing my mind.  I think I'll print these and take them to the next visit!",
            "post_id": "5471821",
            "timestamp": "1268684202",
            "user_id": "user_1246537",
            "user_link": "/personal_pages/user/1246537",
            "votes": "0"
        },
        {
            "answer": "thanks so much for sharing everyone, I was starting to think I had completely gone off the deep end with my BP phobia!! I was NEVER been afraid of having my BP taken until a year ago a silly nurse told me my reading of 120/80 was HIGH for my age (I didn't know anything about what a normal reading was at that point... of course that WASN'T even high) and now every single time I get it taken it's like 140/95 and my heart is racing at 150 bpm. When I take it at home a few times in a row, I can get it as low as 115/70, I just cannot for the life of me stop the panic attacks from happening whenever I go to the doctor and have it taken by someone else. Like others have said it is about 50% a fear of comments from the nurses or the doctor, or fear they will tell me I need medication. I seriously think about all the times I will have to have my BP taken in the future and proceed to freak out about them months in advance... it's as bad or worse than the needle phobia I used to have as a kid. Now if only we could collectively come up with a way to get over this...",
            "post_id": "5568667",
            "timestamp": "1271197157",
            "user_id": "user_1279351",
            "user_link": "/personal_pages/user/1279351",
            "votes": "0"
        },
        {
            "answer": "I feel like laughing to know that I'm not alone in this irrational fear. Next time I'm in a dr's office, I'll think of all of you, feeling the same way and take strength from the fact that it's not just me! I'm having a minor outpatient surgery next week and have to see a cardiologist tomorrow because, you guessed it, my heart rate was about 120 while getting my pre-op evaluation. I've had this problem since I was little--first it was just about doctor's offices, and the past 10 years, it's focused solely on the blood pressure machine. Fear of a high reading, which makes the reading high. It's a vicious cycle.My phobia is the result of behavioral conditioning, I'm certain. For most of my childhood, I had  many emergency room visits for asthma and acquaint medical settings with needle sticks, an adrenalin rush, pain, discomfort and a lot of negativity. It's very hard to overcome this. Someday I hope to pursue behavioral conditioning therapy for this and remedy it.Here are the things which have helped me.1. Get a good doctor. It makes a big difference to see the same provider at each visit. You can develop a rapport and your freakout won't come as a shock to them.2. Monitor your own bp/heart rate at home. I use a battery-operated wrist cuff, which I feel is my 'friend' while those giant old-fashioned doctor's office monitors are just plain evil. I keep a record of my readings and go over them with my doctor at visits so that she can get a better assessment of how my bp meds are working. I spent several years on a high dose of heart meds that I didn't really need, because of seeing a provider who was dismissive of my history/phobia. A good doctor will listen and try to help make things easier for you.3. Long slow exhalations while they are squeezing the cuff will help lower your reading and relax you. Keep your \"out breath\" longer than your \"in breath.\"4. I ALWAYS tell the nurse/dr. that it's going to be high, that I'm nervous and try to make a joke out of it. Smiling and laughing help decrease anxiety.5. have them take your BP again at the end of your visit. The first one is usually the worst one. Once that's over, it's tends to go down.6. I also have a general anxiety disorder, for which I'm now taking 10 mg of Prozac, and it has changed my life. My fears are manageable. I still get nervous, but I can anticipate and detach from the feelings, rather than drowning in them. I am still anxious but I can get through my appts., rather than running out of the office (yep, it's true), crying, or hiding in a stairwell because I couldn't face the ordeal of a simple BP reading.7. You can plan to give yourself a little reward after your visit.  It's nice to have something to look forward to. A special dessert, or manicure or new CD, half an hour of bookstore browsing, whatever you like.8. If you have a partner who will go with you, it helps to have a loved one nearby holding your hand. When I was pregnant, the midwives would always take my husband's blood pressure too, and it helped cut the tension.Hope my tips help!",
            "post_id": "5797489",
            "timestamp": "1276628033",
            "user_id": "user_1348223",
            "user_link": "/personal_pages/user/1348223",
            "votes": "0"
        },
        {
            "answer": "I can't believe others have this problem. I'm sitting here crying. I never had high blood pressure but when I had a 4 month old baby at home, I became pregnant again and was pretty freaked out about it. The nurse at my OB/GYN went to take my blood pressure and I began throwing my arm in the air. She managed to come up with a 190/90 or so and that stayed on my records and each doctor I saw would bring it up. I was so silly, I never mentioned that I was moving my arm to get away from it when she did it - it just did something to me and now I'm deathly afraid of getting it done. It's all so silly and I don't even know why I'm afraid. My mom worked for a doctor when I was a child and whispered about patient's problems and I would ask her about it, she would say \"you don't need to worry abou this until your an adult\" - then I became an adult and all these things are unresolved.I also dealt with anxiety, I've conquered most of it through my relationship with God but this is the last unconquered problem. I'm almost 65 and I stay far away from doctors just because of this - this is so wrong!!!I also went through a few semisters of nursing school and I picked up how to do BP's really quick but I freaked when they practiced on me. I really want to get over this!!!",
            "post_id": "5853687",
            "timestamp": "1277865382",
            "user_id": "user_1364526",
            "user_link": "/personal_pages/user/1364526",
            "votes": "0"
        },
        {
            "answer": "it is so comforting to have others experience the exact same thing you do and guess what I am a nurse.  unlike many i dont have problems w/home monitoring myself or a close nurse friend. but bar the door katie outside of that circle!!  absolute 100% once that cuff goes on the readings go from 112/60 at home to spike to 150/100 or higher.  and how about this, went for a minor surgical procedure and it got cancelled. my mistake, should have gone to hospital instead of surgi center because they were so inexperienced, it was \"new\" facility and from the first step in the place I could tell they were disorganized and the electronic BP readings were so high. they even gave me meds IV to bring it down but ended up not getting procedure. Guess what as you all well know even if you have no medical training- as soon as i was home, that stuff was dropping my BP so fast and my own MD was mad because he said you could have gone into shock with it dropping too low. he changed my med and have not had any trouble since so definitely a better med has helped even better numbers at home. so you know now its a real problem as I see that I cannot even relax enough in the Dr's office being older to get it back down.  My own MD is great always takes the home readings and puts them in my records and it helps to have him validate that i am not alone and he has many pts like this.  I have survived breast cancer, mastectomy, life tragedies and yet who would think one velcro laden BP cuff would induce such painc. like many, as a child at 4yrs of age was wheeled away down a hall for a hernia repair surgery screaming for my mother, i am 52 so those of you old enough with your own children can relate to how different it has been for the last 25 yrs.  the trauma is still there relived in this one aspect.  I have thought of hypnotherapy but sounds like that is not effective.  I have tried breathing and relaxation but it is a runaway locomotive when the situation arises.  and think how many times i have had to be in situations to have mine taken as a nurse.  So you are not alone and i think i will follow everyone's advice and just say up front.  most of you dont know maybe that your MD's office is staffed with medtechs and may not have the knowledge base of hemdynamics or BP \"white cuff\" anxiety to be aware to be sensitive.  I know those off hand comments... just relax!!!! what an oxymoron when you are in that situation.  Good luck to all and remember, there are those of us in nursing who are understanding of this.  I have taken care of my health, with good cardio exercise and healthy eating, never a smoker and good cholesterol results.  be kind to yourselves!",
            "post_id": "5933720",
            "timestamp": "1279646073",
            "user_id": "user_1386924",
            "user_link": "/personal_pages/user/1386924",
            "votes": "0"
        },
        {
            "answer": "I cannot believe other people feel this way but it helps me too.  I really freak out when the automated thing starts blowing up -- in fact, my BP is often LOWER at my doctor's office because they have the hand pump.  I once took my BP at a store and freaked out halfway through that the thing wasn't going to stop inflating... my reading was like 190/100.  I think I'm going to try taking my BP every day and see if I can get used to the buzzing.I have had high readings at the doctor off and on, and now I'm addressing it -- my doctor is taking me off of my BC and I'm addressing my alcohol issue (I drink a little too much -- not like a fifth a day or anything but 2-5 drinks every day).",
            "post_id": "5961769",
            "timestamp": "1280267492",
            "user_id": "user_1394862",
            "user_link": "/personal_pages/user/1394862",
            "votes": "0"
        },
        {
            "answer": "Thank you everyone for your experiences.  I also fear the blood pressure machine because I hate the way it tightens on my arm.  i recently bought a writ cuff and was amazed at how comfortable it felt.  I can still feel myself get anxious as I take it, but the readings are much lower that with the regular machine.  I know it's a mind over matter issue but I still can't control the fear.",
            "post_id": "6085485",
            "timestamp": "1283184558",
            "user_id": "user_1430099",
            "user_link": "/personal_pages/user/1430099",
            "votes": "0"
        },
        {
            "answer": "I had one bad experience when I was 19 and ever since then I have a \"phobia\" of having my BP taken!! :(I was at the family planning clinic stopping in to pick up BCP and they do a routine blood pressure check before dispensing your pills.  Well, it was a pretty packed clinic, it was morning, I was on my way to work, drinking coffee and I just had a smoke.  The CNA took my BP and COMPLETELY FREAKED out!!  It was something like 154/82.  She was like- \"Are you Okay??  Because your blood pressure is WAY too high for your age!!  I need to go get the head nurse.  You could die of a stroke right now!\"REALLY!!??  I mean COME ON!!  Was she for real??!!  All of a sudden four people come into the room I was in.  The head nurse wasn't available at that moment, so another CNA took it, and she freaked out also!  I explained to them that I just had a smoke and finished some coffee.  She was like \"Still, that doesn't matter, you're too young, your blood pressure is WAY too high,\"  At this point I had 4 nurses in my room!!!  They were not going to let me leave!  In fact they were deciding to call 911!!  I was just going to get up and walk out by this point!!  A couple of them rush out to get the head nurse.  By now my BP was through the roof.  NOW I'm actually FEELING the effects of the high blood pressure- tingling / light-headed OR it could have just been anxieties at this point!?Finally the head nurse shows up takes my BP, still high OF COURSE but at least she handles it better.  She is concerned, but she advises me to go to my family doctor to have it monitored and she sends me on my way pills in hand.I NEVER went back to that screwed up place.  But, ever since that incident when I have to get my blood pressure taken- that image plays over in my mind of all the nurses coming in and freaking out about my BP!!That whole situation by those nurses was just unprofessional and shameful!!  They should have known better than to be complete freaked out imbecils!",
            "post_id": "6184474",
            "timestamp": "1285542431",
            "user_id": "user_1457613",
            "user_link": "/personal_pages/user/1457613",
            "votes": "0"
        },
        {
            "answer": "I thought I was the only one with this ridiculous problem! I am 31 and I finally admitted to my husband that this is the ONLY reason I am afraid to go to the doctor. I am not afraid of blood draws, etc. Actually I am a nurse practitioner myself and work in an ICU taking care of critically ill patients. I have been afraid ever since my pre-nursing school physical exam when I was 19. I had never worried about BP before. They had an all day \"admission\" full physical, blood draws, vaccinations, etc., one person right after another in line. The LAST thing they did was check my blood pressure after all of that poking and prodding all day, and it was a foreign male medical assistant who would not make eye contact. He took the pressure, frowned, shook his head in disgust, pumped it up again, frowned, pumped it up again, several times! I finally said enough! What are you doing? He acted like it was none of my business and mumbled under his breath. He wouldn't tell me what was going on. I became terrified. The nurse came in and took it and it was high, 140/90, but she explained that we would retest it when I came back to get my TB test checked in 48 hours. Well, guess what I obsessed over for the next 48 hours. When I came to get the TB test checked, I thought for sure they wouldn't remember, but then I saw a yellow sticky note on the chart \"Recheck BP! High!\" and I panicked, started shaking. It was 126/80 and she said that was perfectly normal. But I was ruined. Another time I went to the doctor and she kept yelling at me: calm down! calm down! she said there was no reason to be nervous. This made it worse and worse. She decided that I needed to get my thyroid checked b/c of high heart rate and BP.I do have generalized anxiety disorder but this is my only \"focal\" fear. Everything else is just general anxiety. I feel like the first step in everything is to check a BP. Every time you go to the doctor it's the first thing, it's at health fairs. I went to a spa in Arizona and guess what the first thing they wanted to do on check-in? BP!!! I refused. They looked at me like I was crazy. I worked at a nursing home in college and bumped my head very mildly. Guess what the nurse wanted to do? That's right, a BP!!I have a cuff at home and just the other day, started putting it on my arm and walking around for a while with it, at the advice of my therapist. I was even able to pump the cuff up a few times, just to 60. But it's a start. I cannot let this consume my life anymore! I want to have a baby and cannot imagine all of the BP's that will be taken and will terrorize me!Thanks to everyone for sharing your stories, everyone's is different but we all share the same problem and it makes me feel better :-)",
            "post_id": "6336011",
            "timestamp": "1289270022",
            "user_id": "user_1501027",
            "user_link": "/personal_pages/user/1501027",
            "votes": "0"
        },
        {
            "answer": "i have this problem to and have had it for about a year now it started when i went to donate and i had just had a smoke my blood pressure was fine but my pulse was 102 they said it was two points to high and tht i should start checking it. the nxt time i tried to donate it was 117 i wasnt nervouse the firast time but was a little nervous the second time . after tht everytime they would put tht cuff on me i would freak out about wht the reading was goin to be. my pulse over the months everytime it was checked just kept increasing and then my blood pressure started goin up to. my pulse now when it gets checked hits the 150's bc im so scared of a reading and my bp when its checked is usually 150 /92 somewhere around tht. i am 9 weeks pregnant and terrified everytime i have to go to the doctors everytime they put tht cuff on me i freak out. I now have a phobia of goin to hospitals and doctors which all started from a visit to the hospital about a year ago when my fear of my pulse first started and i told the nurse tht everytime he checks it its goin to be high and he told me tht a heart tht beats like tht wont last a whole life time. im tryin to get over my fears its really hard tho im so scared about being in the hospital for those couple of days when my baby is born idk my fear gets so intense around medical people i just wish i could control it ! any suggestions?",
            "post_id": "6342464",
            "timestamp": "1289420672",
            "user_id": "user_1502857",
            "user_link": "/personal_pages/user/1502857",
            "votes": "0"
        },
        {
            "answer": "Isn't it crazy how powerful the mind is? I'm a 32 year old male, and this fear started for me about two years ago when I was a paid volunteer for a study of a new drug. All the participants were lined up for our bloodpressure, which we had done every four hours or so, and I just remember the anticipation of what mine was going to be compared to everyone else's really sent my pulse soaring along with my blood pressure. I don't have a fear of the machine itself; it is a fear of having no control over it-- I become convinced that I'm going to fail it, which in turn causes me to fail it. My heart will go soaring sometimes over 150 bpm, and systolic can vary from 132-155 or so. This irrational fear is only in a clinical setting or any setting where someone else is looking at my numbers. I'm in nursing school now, and one day a fellow student tested the cuffs on me to listen for the sounds of Koritkoff, and my heart went racing again. If I'm at home or using one of those machines at Wal-Mart, I register 118/75 to 130/75 or so.I just had a prenursing school physical and registered 146/76-- again high due to my phobia. The phobia is embarassing enough; try being a male with such a phobia. You are seen as a wuss.",
            "post_id": "6375427",
            "timestamp": "1290231758",
            "user_id": "user_1512314",
            "user_link": "/personal_pages/user/1512314",
            "votes": "0"
        },
        {
            "answer": "So i'm not the only one with this Phobia!!!!!! Hi i'm a 26 yr old normal weight healthy young woman....but i have a high blood pressure phobia...read the thread u posted on just wondering how things were going for you?!?! i do have anxiety it's mainly over my healthy (have had the anxiety part for yrs) but recently have developed white coat syndrome....to briefly explain my \"white coat syndrome\"....i went to the docs for my physical my 2 sons (ages 6 and 3 ) were goofing off getting into stuff while they put the cuff on to take my BP...so i'm tellin them stop worrying that they will get into something so my reading was like 142/82 or something....she took again it went down but said don't worry it was prob just my distraction over my boys...well easier said then done now everytime i go to the docs i freak myself up so bad about having a high reading that of course my reading is high and my pulse will be high....they recommended i get a cuff for at home at home my readings will be as low as like 96/64 pulse 58 or something but now i've worked myself up so much and have become almost obsessive about taking my BP at home that it has given me flat out panic over my BP reading that i had to take the cuff to my parent's b/c i was obsessively worrying about it/taking it ( i know i sound crazy but just being honest ) i'm happy to see i'm not the only young adult out here with this it's almost embarassing to explain to the nurse every time i go in now i serious DREAD going to the docs...and now when i do go for example my last BP reading there sky rocketed to 161/67<----diastolic was ok there b/c i was deep breathing....but still i can't shake this fear, and it's really worrying me it seems as though i think about my BP almost every other hour like oh \"could doing this effect my BP reading\" etc",
            "post_id": "6458663",
            "timestamp": "1292517862",
            "user_id": "user_1478650",
            "user_link": "/personal_pages/user/1478650",
            "votes": "0"
        },
        {
            "answer": "hi - I've been struggling with this very issue for about 2 years.  I've had some success using common methods to work on fear and panic generically.This as worked for me -I look at the machine while taking my BP -  breath and speak out loud \" I accept the fear of this machine.  \" I accept panic\" \"my panic will pass\"   \" no one ever died from a BP machine\" \" I don't have high BP - \" I have panic of the machine\"When I first started taking my BP it was 165 over 105.  I  had not been to the doctor in 20 years so I jumped to the conclusion (as did the doctor) I had high BP and was a risk for a heart attack.  I began taking BP meds went and went on a diet.  2 years later, I'm 40lbs lighter and non longer on any meds.  Appears to be a success story - sorry to say it's not.  I take my blood pressure ever morning and every evening 3 times in a row 2 minutes apart.  The first reading is always the highest.  the next two drop every time to normal or very good ranges.  While I still have panic I fully know  the first one is high and I know they will go down each time I hit the button.  - and they do.  The mind is the most powerful unit in our body.  I'm not a medical professional.  Accepting my fear and panic of the  BP machine - doctors - heath and all the panic issues in my life has helped me become functional to the degree of living a day to day life in only moderate fear rather than raging fear.My Doctor gave me two perscriptions for panic1) accept it - let it happen - it will pass2) excersise - do not allow your body or mind to become stale.best wishes",
            "post_id": "6487553",
            "timestamp": "1293495032",
            "user_id": "user_1544632",
            "user_link": "/personal_pages/user/1544632",
            "votes": "0"
        },
        {
            "answer": "I've searched for this problem many times and just now found THIS discussion!  I can soooooo relate!  I decided that I'm not going to allow my doctor's office to take my BP because all they are doing is enforcing a conditioned response!  I take my BP at home all the time and it can be very low (98/66) in the mornings and on weekends when I'm not stressed.  I just print my spreadsheet and take my readings with me.Ironically, right now I'm stressed about something else medical that I'm worrying about and it was high but I'm going to take it again after writing this.BradMM",
            "post_id": "6504843",
            "timestamp": "1294018363",
            "user_id": "user_1550072",
            "user_link": "/personal_pages/user/1550072",
            "votes": "0"
        },
        {
            "answer": "I'm 34 and have a an anxiety / phobia issue of having my bloodpressure taken...had it for years actually.  Whenever someone took by BP then I would beome very anxious and then have a high BP result (sometimes 120/80, but more commonly 135/95 with excursions up to 150/95).Sometimes I'll be at home, and my mind will start wondering how high my bp is...so I dig out my home bp kit and test it.  If I'm mentally stable...its 115/75.  If I totally freakin out, it's 30 points higher.  If it's high, then I'll test it, then test it, then test it again until it's normal.  Strange, isn't it.I finally decided to have a physical done, and I had massive precipatory anxiety leading up to the appointment.  Thoughts of doom and gloom escalated up to my physical, which was late Sept 2010.  My blood work came back perfect, but my BP tested high @ 135/95.Deep down, I know I don't have a high blood pressure issue.  However, I do have an anxiety issue whenever I think about or take my blood pressure.My plan is to start meditating with deep breathing to help me relax.  The thing about meditation / deep breathing, is that it can take up to 10,000 hours to master the practice, I know it won't work right away, but I know with continued practice every day, it will get better at it.Eventually once I master this art, I should be able to go into the doctor's office and bring myself into a peaceful state of mind.Hope all can beat this anxiety, because there are more important things in this world to think about.",
            "post_id": "6529733",
            "timestamp": "1294631137",
            "user_id": "user_1557820",
            "user_link": "/personal_pages/user/1557820",
            "votes": "0"
        },
        {
            "answer": "Thanks for your advice and all the posts as it's reassuring to know you are not on your own with this, as I too have the same problem and tend avoid the situation until I psyche myself up. I also have never liked shots or blood pulls but just have to go through the barrier with it (even though my BP probably won't be in a good state at the time, so i'd never have the two done at the same time). It is the result of the BP that used to freak me out more (and still does to some extent like others have said its like a pass or fail test and you are being judged and it makes be panic) and having no control once it starts up. I have had CBT and that has really helped but that is all I have had. I have a home monitor now which I normally keep out of sight and rarely use, however if I use it I need to psyche myself and feel calm enough to take the reading. With your advice I took a few readings today, at the top end 161/80 and a few more slightly less down to 148/ 74, then watched photos on of our family camping holidays and relaxed more and 12 minutes later it was down to 131/78 where my pulse seem to settle to normal. So this  good for me as my target BP is 130/x. In the surgery I have been up to 190+ / x but 157/x being my best reading in there, so if I could get 140/x in the surgery I would be happy with that, small steps at a time I guess. Also I keep fit regularly and am normal weight and eat well and watch my sodium / salt intake. I am on 2 x BP meds as well and have been for the past 1  1/2 years of which this combination is all helping as this does run in my family without doubt, for me accepting it is a big part of it.",
            "post_id": "6594204",
            "timestamp": "1296301426",
            "user_id": "user_1578823",
            "user_link": "/personal_pages/user/1578823",
            "votes": "0"
        },
        {
            "answer": "Has anyone had any success using a mild tranquilizer for their blood pressure spikes like clorazepate?  I take my BP at home and it averages 125/80 p. 74  If I go to the doctor's office, I feel the panic flowing through me and it averages 180/115  and I am threatened and get the eye rolling treatment.  With an automated cuff, I get even higher readings.  Went to see the endodontist today and he refused to do the root canal because his automated cuff gave readings averaging 220/125 p. 126  I don't understand what is going on with my body.  Am I having panic attacks?  My heart races and my face gets flushed and I feel trapped and afraid.  It's like a surge of adrenaline.  I feel it dropping on the way home and get a normal reading at home although it takes a while for my heart rate to drop.  Is there anyone else out there going through this?  If I take blood pressure meds I have fainting spells and fall down and terrible leg cramps, because my BP must drop too low in a non-threatening environment.  I need some surgery, but can never pass the BP machine test.",
            "post_id": "6856339",
            "timestamp": "1303790060",
            "user_id": "user_401065",
            "user_link": "/personal_pages/user/401065",
            "votes": "0"
        },
        {
            "answer": "It is so comforting to see that other people have this problem as well.  I have suffered from fear of having my blood pressure taken for two years now.  Ever since some nurse made a snide comment about my blood pressure reading being a little high (140/80), I have been in total fear of my readings ever since.  It is not the machine or cuff itself, but rather my fear of it being high.  I get so worked up about my blood pressure being taken at the Dr.'s office, that I sometimes feel like I'm going to have a panic attack in the waiting room.  My doctor recognizes that I am very nervous, but his staff is very unsympathetic, and appear to not believe me.  One time my blood pressure got up to 165/102!  I am 30 years old, not overweight, I quit smoking 3 years ago, and I exercise regularly.I'm not sure how to control this reaction to getting my blood pressure taken, but I wish I had the answer, because I am aware at how silly it seems to other people....but I can't help it",
            "post_id": "6932317",
            "timestamp": "1306263460",
            "user_id": "user_1693597",
            "user_link": "/personal_pages/user/1693597",
            "votes": "0"
        },
        {
            "answer": "I thought I was the only person in the world with this awful phobia.  It's been probably 20 years ago I was with my mom in a drugstore waiting for her prescription to be filled.  I passed the time by using the blood pressure machine.  I got up to walk away when it was finished not even paying attention to the 160/102 reading, which I'm sure was inaccurate since the machine squeezed my arm so tight.  Never even gave it a thought until my mother went over and looked at the reading and said \"oh that's high!\".  Oh my gosh it was like an electric current passed through my body, suddenly I \"KNEW\" what was wrong with me all this time!!!  (I'd been having general anxiety and panic attacks for several years before that).  So the seed was planted in my head.  Sure enough after that every time I went to the doctor my BP reading was high because I got myself so worked up about it.  Before that I had always had low BP readings my whole life.I made an appointment in 1995 with the gyno that my mother uses. (I wanted to discuss having a baby after I got married at age 38).  I guess the fear was really strong that day because my BP reading was something ridiculous like 170/120!  I was feeling extremely anxious when it was taken.  (I probably shouldn't have used my mother's gyno since she put that seed in my head in the first place)!  The nurse started saying \"It can't be THAT high....but it IS!!!\" and she literally ran out the door to get the doctor.  He actually ran in and said \"Well I've never lost a patient before but you might be the first one.\"  Of course that terrified me and I could feel the adrenaline rushing through me like a freight train.  He took my blood pressure and it apparently was even higher.  He kept taking it over and over and I was getting more and more horrified and felt like my head was going to explode.  He called in about 3 nurses and took it again and they started going \"Whew!!\".  I tried to explain to him that I had a phobia of having my BP taken but he just wouldn't listen to me.  He started saying that I could have a stroke, heart attack or go into convulsions.  Of course by this time I was beside myself with terror and embarrassment.  He came at me with that cuff again and one of the nurses said he should leave me alone before I got into trouble for real, especially if it was only anxiety and that he was making it worse.  I refused to let him take it again.  He made me go to the emergency room (I had to drive myself there in that messed up condition).  When I got there they took it and it was through the roof.  I could barely function I was so scared.  So then they sent me to the waiting room and it was an hour before they called my name.  When I got back there a kind nurse told me that the doctor who said all those things should have his butt kicked.  She said that if they'd thought something was really wrong with me they'd have taken me back when I first got to the emergency room.  I guess it's needless to say I never got pregnant because there was no way I could handle all the BP monitoring because of this stupid phobia.So needless to say, now I have a SEVERE phobia of having my BP taken and it causes me to avoid going to the doctor at all costs pretty much.  I finally went to see a very kind doctor a little over a year ago for my female exam.  It had been almost 7 years since I'd had one.  I'd gone to him the 7 years before and my BP was through the roof but he didn't seem to freak out at all, he said he knew I was just nervous.  But it still took me 7 years to go back because it's just so traumitizing to have my BP taken even though I KNOW he won't freak out about it.  This last time I told him that I take my BP at home and it's in the normal range and I didn't let them take it.  Like a lot of you even when I take it myself it starts off high but after I calm down it's usually in the range of low 100's over 70 something.That horrible day in 1995 absolutely ruined me as far as ever being able to have a normal reading at the doctors office.  It amazes me how my mind can affect my body like that.I'm sure I need professional help but even talking to anyone about it makes me so uncomfortable and I can feel my chest tighten up and I get this feeling like a freight train is running through my veins.  I know I need to grow up, face it and get over it but there are no words to describe how fearful I am.  I do feel a little better after typing this.",
            "post_id": "7152863",
            "timestamp": "1313438393",
            "user_id": "user_1763869",
            "user_link": "/personal_pages/user/1763869",
            "votes": "0"
        },
        {
            "answer": "Ugh to the previous poster, I am so sorry that this phobia has affected you so much.  I know EXACTLY how  you feel, I lost out on ten good child bearing years because of my phobia.  However, I decided that I would NOT let fear win over me and I am pregnant with my fifth child at the age of 42!I hope you are doing well, I just wanted to tell you to never give up and don't let this horrible phobia control you.  I know the feeling all too well.",
            "post_id": "7169627",
            "timestamp": "1313946599",
            "user_id": "user_1770025",
            "user_link": "/personal_pages/user/1770025",
            "votes": "0"
        },
        {
            "answer": "OMG ....IM TOTALLY WITH YOU HERE!!! Im having the same prob and have my yearly coming up and im completely freaked about it bc I thought if i bought one for home i could keep a log of my readings to give to my doc to prove im normal...then, well bought it, got it home...freaked having it anywhere around...forget on me...it went back the next day bc the readings were so high...like 195/100 to 260/110...i mean wow! then the thing quit working right after so....i dont know if it was right or not but the highest i had ever had before was 200/100 and that was a bad doc visit..anyhow i find myself wanting/needing to escape anything medical...but i know i need to be able to have a doc,see a doc atleast once a year..So good to know im not alone in this...my normal was 128/70 before this phobia...but since i cant get a true reading..",
            "post_id": "7254612",
            "timestamp": "1316493563",
            "user_id": "user_1810799",
            "user_link": "/personal_pages/user/1810799",
            "votes": "0"
        },
        {
            "answer": "Hi, I can't tell you all how relieve I am to find out others have the same problem as I do.  My first experience with having my blood pressure taken that ruin me was when I was in my 20's.  I went to the Women's Clinic and the nurse took my blood pressure and she was like it's a little high.  It was 130/80.  She was like I have to see what the Dr says about this.  The Dr. didn't say anything but the nurse left me with that fear of having high blood pressure.  I really think they should be more careful what they say around patients especially if you don't know for sure.  I became so afraid of having high blood pressure until I would freak out every time I got ready to have my blood pressure taken. Like someone said from a previous post FEAR=High Blood Pressure.Last year I started bleeding/mucus with every bowel movement and of course that freak me out.  I went to the Dr. and my blood pressure was high (168/90).  I was scared because I thought I had colon cancer and was a total wreck in that office.  Scared to death!  They sent me to the Gastro Dr. and my BP was high there too (154/85).  The Gastro Dr telling me you could have a stroke and your kidney's shut down.  Do you have someone who will take care of you if your body shuts down?  What? Come to find out I have ulcerative proctitis.  So, I had to keep going to the Gastro Dr.  All I got from her was horror stories about my heart may get enlarge and oh your poor arteries.  I did go back to Family Dr. and they put me on meds, but my BP is still the same when I visit the Dr. office especially high at the Gastro.  I guess she thinks if I scare her she will do right.  Now, I dread going to the Dr.'s office with a passion.  I get comments from the nurse and the Gastro Dr.  I have to go because I don't want my ulcerative proctitis to spread.",
            "post_id": "7311263",
            "timestamp": "1318281264",
            "user_id": "user_1563853",
            "user_link": "/personal_pages/user/1563853",
            "votes": "0"
        },
        {
            "answer": "Wow, so I'm not the only one. For me, it doesn't matter if I'm in the doctors office or at home, the thought of it being high and that freaking cuff cutting off circulation to my arm are enough to drive it up no matter where I am. I go from feeling perfectly fine and relaxed to oh sh*t, and thus I get a heart rate elevated an extra 30 to 40 bpm and bp readings ranging from 130s-140s/80. I'm 24 now, but I can remember being a little younger (teens) and not knowing or caring what blood pressure readings were even for, and of course readings were always low. Now that I know what high blood pressure does and had that one instance where a nurse freaked me out over it being high, constant fear of having i taken has set in. Had recent bloodwork done and everything came back perfect.  If only I could conquer this stupid fear... Good luck people. God bless.",
            "post_id": "7356079",
            "timestamp": "1319678809",
            "user_id": "user_1855693",
            "user_link": "/personal_pages/user/1855693",
            "votes": "0"
        },
        {
            "answer": "Wow...this.seems.all to familiar to me.I have this problem everytime I go to a Dr/er and they always freak out and rush me in...even if I'm not even there for panic attack...I honestly thought I was the only one wth this problem but it actually makes me feel better to know that I'm not alone out there :)",
            "post_id": "7360810",
            "timestamp": "1319834413",
            "user_id": "user_1859120",
            "user_link": "/personal_pages/user/1859120",
            "votes": "0"
        },
        {
            "answer": "Wow this is so me. I have been on mess for over 10 years. My bp is controlled. I take it at home and it's 116/68. I go to the doctors and it jumps to 159/92. Then they freak out. I tell them about my phobia and they say that to high for a phobia. Then they spend all the time talking about bp and not what I went for. I have to go in 3 days. Ugh freakin already.",
            "post_id": "7363760",
            "timestamp": "1319959197",
            "user_id": "user_1862178",
            "user_link": "/personal_pages/user/1862178",
            "votes": "0"
        },
        {
            "answer": "It is so great to see that I'm not the only one that feels this way. WOW. The thought of taking mine at home gets my heart racing. I will tell you one thing that did help me out this morning when I took it. The first one I took was high because I wanted it to be great and the pressure on myself was crazy. The first one was like 160/88. So I layed down, did some deap breathing exercises for about 5 minute of maybe a little more. Then I got up and did this.................played with my dog!!!! Yes I rubbed my cocker spaniels ears with the hand that wasn't being used. The reading came down to 135/83. So I guess the trick for all of us, is to find a way to distract ourselves from what is going on. I am like another person here who said they stressed over their readings almost every hour. I run, I work out. I eat right and all, but I do have that dang anxiety thing. We will get through it. We will win!!!!",
            "post_id": "7376002",
            "timestamp": "1320366720",
            "user_id": "user_1874050",
            "user_link": "/personal_pages/user/1874050",
            "votes": "0"
        },
        {
            "answer": "Oh man, yes me too, I feel bad and have bad anxiety most of the time I am on edge! and my heart skips beats sometimes due to nerves! I am at my wits end! It all started to with a visit to my mums former wrkplace (hospital hypertension clinic!!!!!) got mine checked there, it all led to me finding out I gt PCOS, buut hs left me uncontrollably shaken and bad panic attacks when I have to get BP checked, just gt a home wrist BP monitr and tryed to take it but may heart rate shot up and I pulled the thing off my wrist half way through it pumping up! I am waiting to get CBT therapy but would love a quick fix pill! Have been taking heral quiet life pills but not having the desired effect!",
            "post_id": "7408362",
            "timestamp": "1321276031",
            "user_id": "user_1894514",
            "user_link": "/personal_pages/user/1894514",
            "votes": "0"
        },
        {
            "answer": "I have this phobia too. And so does a good friend of mine. I think doctors need to be more compassionte to this. You don't tell someone-Oh my goodness your pressure is high and you could have a stroke right now! Oh course its going to make it worse! I know of a lady that was put on blood pressure meds because her pressure was up one time! But then again she wanted the meds.I have a machine at home,and use it every so often. My doc said to do this,and to show him the readings after a week of taking it. I did and the readings were fine. But he did caution me about taking it to much.He said you don't want to get obcessed with it.I must admit,I have taken it up to 10 times a day though. So much that my arm has hurt from it.lol It's crazy I know.",
            "post_id": "7408449",
            "timestamp": "1321278363",
            "user_id": "user_1880256",
            "user_link": "/personal_pages/user/1880256",
            "votes": "0"
        },
        {
            "answer": "Hi I'd like to write something below that will hopefully help all of you",
            "post_id": "7438662",
            "timestamp": "1322104730",
            "user_id": "user_1911526",
            "user_link": "/personal_pages/user/1911526",
            "votes": "0"
        },
        {
            "answer": "My name is Joe and I'm a 23 year old from ny. In April I went to see my doc bc I have mild asthma and needed a refill. When I saw him everything was fine and then he told me I had a little high cholesterol. it was 214 but to me it was a death sentence. You see I've always been worried about my body. I guess you could call me a hypochondriact. Anyway about 2 years ago my doc told me I had hayfever. While I was sick I felt a weird thing in my chest that I've never felt before. I ended up in the er with my mother to find out I had BENIGN PVCs. But it sucked to feel them. Anyway I've always eaten as healthy as anyone can bc I'm obsessed with staying on this earth as long as possible. I love myself as a person and have a great faith for the man upstairs. So back to the cholesterol, yeah I find out I had high cholesterol and during the process I freaked put. Then took my blood pressure and it was 120/80 which was normal. And I freaked over that! bc my pressure was usually 109/70. So for days I'd take my bp constantly then it went up to 150/100. I was doomed. Any way I ate even more healthy just hoping my cholesterol would drop. I came in 5 months later and it dropped 40 points! I was estatic yet now my mind was on my bpressure. I went to my heart doc and he said it was 128/78. It was good enough as I went back to my reg doc and he said 130/75. Now I feel when ppl hear it's 130 or over that your doomed. So a couple weeks ago I injured one of my ribs. No big deal so I went to the doc. The nurse who I trust came in and knows i didn't like my bp taken so she asked me and I told her u know what? U can do it go ahead just don't tell me. Everything was great doc came in and said everything normal. So as I left my eyes happened to glance in the wrong direction and boom! There it was 140/82. I saw my number that I feared. So that day I found my mother told me I was going to Vegas bc my gma wasn't doing well. Ive also feared flying since having PVCs bc I didnt want to get them on a plane from altitude etc. But I went and when I was there for the worst most horrific terror of a week I've ever had in my life, I ended up alive. I slept a whole 8 hours in 5 days and had panic attacks about 10 times each day that lasted for hours. I think when tour in a panic attack like that your afraid you won't come out so u go in deeper and deeper into the dark cold place. Your trapped and there's no way out. So I came back home with my pupils dilated to crisps. I was so terrified that started keeping my eyes open seeing how long it would take me to blink. I kept them open for 23 minutes straight. Then blinked on my own bc I felt it should be normal to blink LOL. (no really not funny at all tho.) but yeah so yesterday I meet up at Perkins with two of  my best friends. It's funny how fate works out. So my friend Joe tells me hey Joe ( yeah were both named Joe), I went to the doc today and thought of u while getting my bp taken. He sed it was 137/77. He was laughing asking if it was normal. And my other friend who is 25 and had a heart transplant at 7 was laughing also. So my friend goes hey how about we solve this once and forall. We went to cvs to get our blood pressure taken. My friend mike with the transplant goes first. It's 181/116. He doesn't care. To him hes here on borrowed time. Now my other friend Joe goes and it's 138/91. Were all nervous lol. I go it's 142/91. I didn't really care at this point bc I said if my friend are like this too then well die together lol. My friend decides let's take it ONE MORE TIME. Best thing that ever happened in my entire life. my friend with heart trans goes. Its 160/106. For him thats normal ppl. Mind you he's had that heart for 18 years. My friend joe goes. It's 135/83. I go.... This whole 2011 of terror could it finally be nearing an end? Will I be my loving caring self again? Would it ever go back to 109/70? All these times that I was relaxed and saying if they only but the bp cuff on me now it would be low! But then my heart raced thinking about it bc maybe it was high? But I go again. BOOM! 120/75. Its all over folks And the Yankees (my favorite baseball team) wins it in the bottom of the 9th. I slept last night btw. For 15 hours straight. You see the mind plays tricks on you and YES when your anxious your bp WILL indeed rise. All the sufferers out there know that I love you and care for you. It will be ok. YOU will be OK. Bc I used to think even was I was relaxed it was high. But it wasn't. And it isn't for you either I promise. Bc the more anxious you are the more it goes up but it WILL come back down. But how do you know? If you can't take it without feeling anxious? Here my story. And know that you don't have high blood pressure, that you will be alright, and know that there's a guy in ny somewhere that has a couple of knucklehead friends, but helped him overcome this terror of bp machines. It comes down if you let it. Trust me, trust my story, and most importantly, trust your body. This world is made to lice in peace not terror. -Joe",
            "post_id": "7438754",
            "timestamp": "1322107410",
            "user_id": "user_1911526",
            "user_link": "/personal_pages/user/1911526",
            "votes": "0"
        },
        {
            "answer": "Had to comment, though this thread is old. I am a mental health therapist so I understand how powerful the mind is, and my experience with bp readings is a perfect example of that. I am a middle aged woman, and all of my life had normal bp, aside from a couple of somewhat elevated diastolic (lower number) readings in my 20s when I was very stressed. Didn't give it much thought and had a wonderful old family doctor who never made me feel like there was anything wrong with me when he took my bp. Sadly, he passed away several years ago and I had to find a new doctor. I went to him for the first time quite worried because I had been dizzy for several months (turned out just benign positional vertigo, which I recovered from with exercises). Plus, I expect at middle age and hitting menopause, I WAS experiencing some small elevation in bp. But when he looked at chart and saw reading of 148/70 something, he asked if my bp was always so high. I told him no, I was just nervous. But the next visit I was worried about it for the first time and it increased systolic (top number) by about 10 pts. So he put me on bp med. You guessed it. Every time after that it increased until I was getting readings of 188/70s. He was a doctor with a very poor bedside manner and insisted it could only increase about 10-20 pts from anxiety. General anxiety, yes, I tend to agree. But when someone is having a panic reaction to the machine, it can zoom. And the proof is in these posts. I got a machine at home and started taking it. Like so many of you have noted, it is often high on first reading, then goes way down on second and down further on third, to a good number. Unless something has caused a higher than normal first reading, I can have months of even pretty good readings on first reading. I switched doctors and have one who completely understands white coat hypertension. He takes my pressure again after I have been in office about 15 minutes and it goes way down - last time by 40 pts. And he has tested my machine from home for accuracy. So he believes that it is only panic causing initial very high pressure (been as high as 200/120 there). I still hate having it taken at his office though, when I first get there and the nurse takes it. And sometimes I get in a state about taking it at home. But it helps to remind yourself that blood pressure rises during exertion too, often extremely high, and this is normal. And believe that it is just an \"in your head\" situation. As much as the mind can cause you trouble, it also has the same power to do you good. Taking it regularly at home, maybe once or twice a week, keeps you \"used to\" it without being obsessed by it. I also think the medical profession in general is woefully ignorant in regard to white coat hypertension. Additionally, medical professionals should be taught how to talk to patients and remember their Hippocratic Oath, \"First, do no harm.\" It is shameful when people we turn to for help cause further harm instead. That doctor who told one of the writers above he might lose a patient should have been severely disciplined. Good luck to you all. I feel your pain!",
            "post_id": "7444188",
            "timestamp": "1322319991",
            "user_id": "user_1914722",
            "user_link": "/personal_pages/user/1914722",
            "votes": "0"
        },
        {
            "answer": "A couple of thoughts as one who also suffers from white coat hypertension. I normally have to take a copy of my tracker from here when I visit my doctor so he can see how  my numbers are at home. First off, taking multiple readings is never a good idea, but if you are going to do it, you need to wait at least 5 mins between readings to let your arteries recover. Second readings will always be understated if taken too soon.Also, you anyone else reading this thread, here's a great read on white coat hypertension;http://www.blood-pressure-monitoring.org/white-coat-hypertension.htm",
            "post_id": "7444516",
            "timestamp": "1322328062",
            "user_id": "user_159619",
            "user_link": "/personal_pages/user/159619",
            "votes": "0"
        },
        {
            "answer": "HI, I just read your comment about anxiety and blood pressure readings.  I can't get an accurate reading either.  Reading were REALLY high using a digital cuff at the dentist.  since then, i had a reading with a proper sphygmomanometer and the reading was normal.  Unfortunately, I can not even think of going to see a doctor/dentist now because of my fear.  I am now 9 weeks pregnant and HAVE to go to the doctor for my first prenatal visit.  Any suggestions/words of wisdom for me?",
            "post_id": "7557269",
            "timestamp": "1325745859",
            "user_id": "user_1969793",
            "user_link": "/personal_pages/user/1969793",
            "votes": "0"
        },
        {
            "answer": "i have same problem and my Doctor diagnosed i have White coat hypertension, so read about it.",
            "post_id": "7562354",
            "timestamp": "1325874271",
            "user_id": "user_1972120",
            "user_link": "/personal_pages/user/1972120",
            "votes": "0"
        },
        {
            "answer": "This post is SOOOOOOOOO old, I would really like to see it gone. Well, not \"gone\" as in \"gone for good,\" but a tad more current. If either of you would like to start a new post, that would be GREAT! We could get a whole new group of people who are actually still contributing members and deal with this issue anew.I'm not going to add anything to this post because 99% of the people who contributed are long gone from MH.I'd like us to bring this topic, which is still VERY relevant to so many people, into the new age. Want to help me?Repost as a brand new question.Thanks and welcome to the future!PeaceGreenlydia",
            "post_id": "7563777",
            "timestamp": "1325905261",
            "user_id": "user_370181",
            "user_link": "/personal_pages/user/370181",
            "votes": "0"
        },
        {
            "answer": "How do we get the new post started",
            "post_id": "7570702",
            "timestamp": "1326108065",
            "user_id": "user_1977166",
            "user_link": "/personal_pages/user/1977166",
            "votes": "0"
        },
        {
            "answer": "It is such a relief to know I am not the only one. Your story is identicle to mine and it really stresses me out. Dr. vistits are torture. I take it at home and its high then I calm down and its normal. I feel I will never be free of this. The nurses and doctors all make me feel worse when the numbers are high. I don't know what to do!",
            "post_id": "7583772",
            "timestamp": "1326416491",
            "user_id": "user_1983357",
            "user_link": "/personal_pages/user/1983357",
            "votes": "0"
        },
        {
            "answer": "I have the same problem. Matter of fact, I went to the doctors today and my blood pressure was like 155/90 which WAS ACTUALLY GREAT! compared to 180/110 like normal at the doctors.  Never fails, as soon as I get home, down to 117/76.  This is really making me upset. I dont know what to do.  I'm taking magnesium and calcium to see if this helps.  On top of that....im 9 months pregnant.  And my doc told me some awful things about me and baby.  This doesn't help.  I feel so bad about this.",
            "post_id": "7584344",
            "timestamp": "1326428464",
            "user_id": "user_1983597",
            "user_link": "/personal_pages/user/1983597",
            "votes": "0"
        },
        {
            "answer": "I am so sorry. I want to have another baby but Im scared of taking my pressure so often. At least you are 9 months. Did the doctor try to put you on high blood pressure medicine? The good news is that it goes down once you are calm.",
            "post_id": "7585590",
            "timestamp": "1326470966",
            "user_id": "user_1983357",
            "user_link": "/personal_pages/user/1983357",
            "votes": "0"
        },
        {
            "answer": "I definitely have White Coat Syndrome now. I've had bad experiences with doctors my whole life and now when I go its elevated. A couple of years ago I was working out like a fiend and watching my calories and then went to the doc. They weighed me and I was 10lbs heavier than I thought! My scale at home was broken. I was devastated and I saw white spots and felt my whole face heat up. The assistant walked me back and sat me down and took my blood pressure and it was 157/90. That day the doctor prescribed me blood pressure medication at 20mg of Lisinopril. I went home and took the medication and then felt extremely light headed. I stopped taking it switched doctors and went in for a visit where my blood pressure was 119/76. So basically the moral is how can a doctor diagnose you with High Blood Pressure off of one reading? Safety would say that you should at least check the pressure twice during a visit and NEVER after weighing someone.",
            "post_id": "7590579",
            "timestamp": "1326618205",
            "user_id": "user_1986558",
            "user_link": "/personal_pages/user/1986558",
            "votes": "0"
        },
        {
            "answer": "I have  a phobia of blood pressure measuremments of any kind my story told herehttp://youtu.be/jTYk0GOrvHc",
            "post_id": "7616811",
            "timestamp": "1327356107",
            "user_id": "user_1999463",
            "user_link": "/personal_pages/user/1999463",
            "votes": "0"
        },
        {
            "answer": "I am in the same situation as you..the difference is I'm only 5 months pregnant.Every visit to the doctor for a check up stress me which make my blood pressure high. I don't know how to relax and don't know what to do. This is my third pregnancy and to be the first baby. I really cannot control it.",
            "post_id": "7624952",
            "timestamp": "1327564368",
            "user_id": "user_2003117",
            "user_link": "/personal_pages/user/2003117",
            "votes": "0"
        },
        {
            "answer": "I also have high BP at doctor's office.  It started after my father passed away from a heart infection (endocarditis.)  I did try something today that helped in home measurements.  I started watching a comedy and after about 10 minutes, I measured my BP and sure enough it was down from 156/90 to 110/70.  I would switch doctors to one who is aware of panic disorders.  Also, there is a great book by Dr. David Burns called \"When Panic Attacks\" which has helped me a great deal.  I also thought that next time I go to see the doctor I'll take in a CD that is positive and funny and listen to that while they are taking my blood pressure.  Worth a try.",
            "post_id": "7649118",
            "timestamp": "1328243870",
            "user_id": "user_2015089",
            "user_link": "/personal_pages/user/2015089",
            "votes": "0"
        },
        {
            "answer": "i just want to say that i am 27 and deal with high b.p. and more when im pregnant...i understand what you say about becoming crazy about using your home b.p. cuff...i swear i check my b.p 40 times a day...i know its not good to do but i just get so scared. i am on b.p meds,but just dont know how to get away from the fear of having it high. i swear i make it higher by thinking about it alllll day....what should i do???? i dont know anymore..i take medicine and it probably would regulate it better if i could just chill out!....",
            "post_id": "7743039",
            "timestamp": "1330989889",
            "user_id": "user_2064028",
            "user_link": "/personal_pages/user/2064028",
            "votes": "0"
        },
        {
            "answer": "Great advice!~",
            "post_id": "7826796",
            "timestamp": "1333415572",
            "user_id": "user_2099677",
            "user_link": "/personal_pages/user/2099677",
            "votes": "0"
        },
        {
            "answer": "omg!  i am feeling this exact same way!  i am in terror of the whole blood pressure thing..i have my first prenatal appiontment on monday and i am totally freaking out! everythin that you described in this is how i am feeling..i just wish i could calm down and not be so scared...i had an ultrasound done last week and my bp was 156/107!  i was freaking!   and it wouldnt go down because the nurse was makeing it worse..i hope that this doc will understand my problem and not try n scare me...thanks for ur story..lets me know im not alone :)",
            "post_id": "7858854",
            "timestamp": "1334346620",
            "user_id": "user_2112951",
            "user_link": "/personal_pages/user/2112951",
            "votes": "0"
        },
        {
            "answer": "i am 9 weeks preggo now too..have an appointment on monday the 16th and im am in terror..can you let me know how yours went?  thanks so much.",
            "post_id": "7858879",
            "timestamp": "1334347086",
            "user_id": "user_2112951",
            "user_link": "/personal_pages/user/2112951",
            "votes": "0"
        },
        {
            "answer": "I am 21 weeks pregnant with my 3rd baby and dealing with this blood pressure issue too.  Ugh.  It's so frustrating.  No matter how much I TRY to relax and talk myself down, it's still high in the office.  I never had this issue with the previous two pregnancies.  I, too, check my blood pressure way too many times a day.  It's sad (but it was a little funny) that my 21 month old daughter found my blood pressure cuff and put it on her arm.  I feel like I'm going to pass this anxiety down to my kids which I SO don't want to do. And I'm already on 50mg of Zoloft (which I already feel guilty for, being pregnant and all) so I don't understand why my thoughts and feelings are so out of control in the doctor's office.",
            "post_id": "7870419",
            "timestamp": "1334693581",
            "user_id": "user_2117875",
            "user_link": "/personal_pages/user/2117875",
            "votes": "0"
        },
        {
            "answer": "Well, I could start like everyone else and say \" praise the lord I'm not also alone\"My story is so similar to everyone else's.  Mine all kicked off in 2010, when I was 33 weeks pregnant, went for my routine midwife appointment, from there I was rushed to hospital and my little fella was delivered early, pre-eclampsia, but unlike most pre-elacmptic women my bp would not regulate at all once the baby was born, dispite atenolol, beta blockers, you name it they where giving it me, my prem baby was in special baby care, I was hooked up to a bed on an arterial line so they could get more accurate readings, but to be honest the damage was already done at that point, I was sleep deprived as they were doing 15 min obs on me for 48 hours!! I was in a vicious circle and I was desperate to leave, but they couldn't let me leave with reading like I was getting, 10 days later I told them i was going to discharge myself as without seeming ungrateful they were making me worse, thankfully the cardiologist completely agreed with me, telling them to stop monitoring me. So after a very emotional time for some time after, and a few visits to cardiologist they took me off everything, but the fear is there and I cannot shake it off. We wanted another child but I'm scared and there is no way I'm going through that again.So here we are I have been great, not thinking about it just getting on, until they tell me in work I have to go for a full routine medical...........yep you guessed it, decided to use my wrist bp and it was a fairly okay reading, so I was happy!!! Really happy!!.......i took it the next day it was crap 109/160 with pulse rate of 117!! Anxiety is In full swing I can feel my chest tightening, I want to think just reading these blogs will help, but it's not that easy, my partner cannot believe I have checked my bp, when I was instructed to throw the bloody machine away by my cardiologist!But Im prepared to try anything, I hate not being in control of this.....so I've booked my appointment at the gp's, if it's tablets then fine, cognitive therapy fine, what's not fine is me ignoring the problem I NO this much.Wish everyone luck",
            "post_id": "7880783",
            "timestamp": "1334960497",
            "user_id": "user_2121893",
            "user_link": "/personal_pages/user/2121893",
            "votes": "0"
        },
        {
            "answer": "OMG, thought I was the only one! Actually, this has been going on for 5 yrs. now, and even when I try to take my reading at home, I freak out!  So I don't really know if I even have HBP.  I also suffer from severe anxiety and panic attacks and two weeks ago, my eye doctor (yes, eye doctor!) took my BP and wanted me to go to the ER!  I had to explain to him that I suffer from white coat syndrome, even if it's just a check up for something good!  Ever since then, I have been having very bad anxiety obsessing over what the eye doctor told me and have taken Xanax every day, which I hadn't taken for years!",
            "post_id": "7924561",
            "timestamp": "1336158336",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I am also glad I am not alone, I use to never be scared about my blood pressure, but sine I have had my daughter my anxiety has ruled my life. I am scared of everything!! I have never had high blood pressure in my life, and now everytime I get it taken it is high, and I am pretty sure its because I am anxious, I also put a instant heart rate monitor on my phone because I am afraid my heart will stop or go to fast!! it is miserable!! But anywho, if I know I am around a blood pressure machine , I want to take it, and like when they take my blood pressure I always have to ask what it is, is it high, knowing the answer because, I know that I am sitting there anxiously waiting, and I have been reading books about anxiety, and I am like whats the worse that could happen, they will have to put me on blood pressure medicine,but that isnt good enough, I just think well im 26 thats young to have blood pressure problems, and then I start to think that I might die at a young age, basically its a never ending circle!! I also get worried about taken medicine, because I am also afraid that can kill me!! I HATE ANXIETY!",
            "post_id": "7924693",
            "timestamp": "1336160857",
            "user_id": "user_2141832",
            "user_link": "/personal_pages/user/2141832",
            "votes": "0"
        },
        {
            "answer": "It really sux when anxiety reaches high levels...at that point, I cannot even function and can't think of anything but my symptoms at the moment.  This constant obsessing over HBP is driving me nuts and I can't get into my pdoc for another 2 wks. but they assured me if I ran out of meds, they would refill them.  I am taking more Xanax than I ever have, even though the dosage is small....just 0.25mg. but have to take 2 or 3 at a time to control the anxiety.  I really need to have it upped so I don't have to take as many.I refuse to go to any doctor now because I'm terrified of the BP readings.  I am reading Claire Weeke's books over and over and over again, trying to convince myself it is just anxiety and I'm not going to have a heart attack.",
            "post_id": "7926652",
            "timestamp": "1336229954",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "Thank you for such a helpful comment.",
            "post_id": "7927184",
            "timestamp": "1336246806",
            "user_id": "user_2144147",
            "user_link": "/personal_pages/user/2144147",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone ! i'm so happy to know that i'm not the only one who suffers much from bp anxiety.My BP phobia has strated  2 years ago, i had a high reading and googled it 140/100.I bought my  own bp kit at home.At first i got panicked until  i prayed for it.I used to having  a normal reading at home 115/70 but not in hospitals/clinic.Still struggling for hospitals/clinic.So i'll pray for it again.I'll get back on you when i totally overcome this fear..God will make a way!!! Nothing to worry..We surrender all our fears and weakness to him!!!!",
            "post_id": "7950765",
            "timestamp": "1336987778",
            "user_id": "user_2163342",
            "user_link": "/personal_pages/user/2163342",
            "votes": "0"
        },
        {
            "answer": "Hi all, just wanted to comment so the discussion doesn't die down.  Well, it's been almost 6 wks, since that horrible visit to my eye dr. who wanted me to go straight to the ER because my readind was so high.  Once I told him I suffered from a severe phobia about having my BP taken, he kinda calmed down and said that during college, a school nurse gave him a physical and his was higher than mine was, and he was only in his 20s!Nevertheless, the seed was planted and now I cannot even monitor my BP at home.  Stashed it away in the closet and cannot bear to even look at it.  Have a dr. appt. coming up the end of June and already stressing over it and it's a month away!Still having lots of anxiety issues over this.  It really *****!",
            "post_id": "7994731",
            "timestamp": "1338221768",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,I am 44 years old and have been on treatment for hypertension for 4 years now. Last year I had an extra tablet added when my bp started to rise consistently again, at the time I was going through a period of unavoidable stress due to life changes. I am now on 2 tablets daily.Up until a couple of months ago I was able to check my bp regularly myself at home using a home monitor. Unfortunatly I started to suffer panic attacks then due to personal issues that I've been dealing long term with, I then got myself in a vicious circle- I started to expect my bp would be up due to the increased anxiety and so bingo it would shoot up. I then had to stop using my home monitor as it was only serving then to increase my anxiety. I now have to visit my nurse or gp if I want a reading as even tho I still get anxious having it taken there, it's nothing compared to the anxiety I experience while taking it myself! Weird I know, as most people are the other way around...normally my bp can be between 120/70-130/80 depending on how I am feeling at the time & when the doc takes it....A month ago I had to go to A&E, turns out I had compression on a nerve in my back which caused severe weakness in my legs. I was nervous of course having my bp checked and it was 160/90. On my examination they were were worried I was having a stroke so brought me into resuss, WELL you can all imagine the fear then!! My bp readings shot through the roof! I was getting readings of 190/110, I was terrified and found it very hard to calm myself internally.Once they established I wasn't having a stroke they got me out of there asap as they knew the anxiety was just pushing my bp up.I was kept in hospital for a week for tests and any time the nurses came near me with the electronic bp machine it would go through the roof, as soon as that cuff went on my arm & the machine was switched on bang, my heart would take off! They had to use the manual bp reader and then it would come down.Basically where I am today in all this is that I worry incessantly about my bp. I have been assured by my Cardiologist that I am fine and that I am on excellent coverage with the meds I am taking.I find I am 'minding' myself a lot lately tho...'Oh I can't do that or I can't do this, it might put my bp up'. I don't smoke & stick to the recommended units of alcohol weekly. I eat healthy & try t exercise by walking, altho I could do better in that area.I am obsessed now though about my bp and can't stop worrying. If I get a headache I worry that it's bad. Last night I had an iffy tummy and woozy head and worried that it was my bp and that something bad would happen.I'm frustrated with myself for being like this as I'm usually a positive & practical person.Doc gave me 0.25 xanax for the anxiety probs but I'm thinking now of going on Prozac for the panic & worry as I am worried the anxiety will do harm if it continues.Good to know I am not alone in this on reading all your posts, and best of luck to everyone in getting the anxiety sorted and the bp fear diminished <3",
            "post_id": "8000569",
            "timestamp": "1338376562",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Wow you sound just like me!  I don't know why this particular doctor scared the crap out of me, but the seed was planted and now I am terrified of anyone taking my BP.  I worry too, that every ache and pain is somehow related to my BP.  Anxiety and panic symptoms are the same as high blood pressure symptoms, which further adds to the stress.My pdoc did tell me it was my panic disorder and NOT highBP, that is causing my symptoms....racing heart, trembling, jelly legs, iron band around my head, etc. etc....she said if it was truly my high BP, I would've stroked out by now.....LOL!  Besides, when I take my Xanax, the symptoms subside within a half hour.But do I believe this?  No!  The \"what ifs\" start up, and it becomes a vicious cycle.....",
            "post_id": "8001033",
            "timestamp": "1338386844",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I hear ye! I guess it takes time... but it's SO hard, and I understand exactly where you're coming from. I know with me I've had a bad few years with stress anyway & an ongoing situation that hasn't reached a solution so my doc reckons this fear is just a symptom of the stress I've been enduring & my mindset as a result of it...Oh and the band around the head thing, I'd no idea that was another symptom so that's good to know as I get that & worry over that too....It's scary to be in fear so much isn't it? I want to know every day what my bp reading is and if I could get it takin with the manual bp monitor every day I would! Even that in itself is not right! That's coz I can't take it at home myself with the electronic one anymore so it's like I've lost my safety blanket....obsessed or what!",
            "post_id": "8007550",
            "timestamp": "1338550082",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "My son had a doc's appt. yesterday and merely looking at him and the BP monitor was enough to almost send me running out of the room!  When I work out, I can't even measure my heart rate on the cardio machines b/c I am terrified.How do we get over this?  I've got a doc appt. coming up the end of this month and I am panicking already....shaking just trying to type this!",
            "post_id": "8007833",
            "timestamp": "1338558140",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I wish I had the answer....I was saying to my own son last night that if only I could use my mind 'For' me instead of 'Against' me in this situation, it would be wonderful!I've been going for CBT - Cognitive Behavioural Therapy...to help me retrain my mind in how I think with all this stuff. The therapist is very good but to be honest it's bringing up a lot of stuff that I know I have to deal with but it's making me more panicky so I've stopped going for now.I see my doc on tuesday & I am going to mention starting a course of either Prozac or something else along those lines because I really feel I need something at the moment that will help me take the edge off all this anxiety. I take Xanax if & when I need it but it doesn't work the same way  physiologically or by staying in the system.....",
            "post_id": "8010259",
            "timestamp": "1338625811",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "kkkkk",
            "post_id": "8014333",
            "timestamp": "1338757119",
            "user_id": "user_2202657",
            "user_link": "/personal_pages/user/2202657",
            "votes": "0"
        },
        {
            "answer": "I'm sorry about the last post (kkk).  I just joined this group, and not sure how to post a post.Anyway, several months ago I was seriously injured on the ski slope. The first aid tech took my BP !!!!!!.  So high they took me to the ER.  They stablized me, but ever since then, I'm petrified of the cuff, even at home.I'm on BP meds, but like with everyone else, I don't know which of the 10 consecutive readings is real. SSRIs, and anti-anxiety meds don't seem to help much because I'm so terrified when I take my BP.Anyway, I'm trying to find a good CBT guy, but I live in the backwoods of Maine, and the only guy I can find, also treats cows, horses, and chickens.So... I'm glad to find you guys, and feel better that I,m not alone.",
            "post_id": "8014382",
            "timestamp": "1338758213",
            "user_id": "user_2202657",
            "user_link": "/personal_pages/user/2202657",
            "votes": "0"
        },
        {
            "answer": "Hi, what meds did they give you?  BP meds or anti anxiety meds?  My phobia is so bad, I avoid doctor appts. except when absolutely necessary, like I have to see my oncologist every 6 mos. for cancer screenings, I am a ten year breast cancer survivor and my BP started going up AFTER my surgery and treatments, as I was terrified of the checkups and getting a reoccurence.Now I am so bad I cannot even take my BP at home, let alone being terrified at the doctor's office.  Think I am going to look into CBT myself. I do take Xanax and do breathing exercises but only the meds seem to help, but I don't want to take Xanax all the time.",
            "post_id": "8019862",
            "timestamp": "1338905418",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "@ Superherb, welcome & yes you're not alone.....@Ltb3105 I am on xanax as per needed and like you I don't want to take them all the time, went to my gp this morning and she has told me to start Prozac (SSRI) and comeback in 2 weeks....I had my bp taken by the nurse last tuesday & it was fine....doc didn't take it today as she didn't feel the need to...as I can't take it myself anymore for the same reason as you guys I have put my home monitor away & haven't used it for over a month....it was just stressing me out more getting the hight readings from being anxious & putting me into panic attacks.It's so difficult as I find myself wondering what it is especially if I get a headache or feel anxious.....it's hard to get out of this vicious circle....I WISH I could still take it myself like I used to be able to without getting worked up but it's like my mind has been reprogrammed now & I can't swtich it back to the way it was before....I've been doing CBT and it's helping slowly...",
            "post_id": "8020074",
            "timestamp": "1338910687",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Thanks a lot for your comments. Re meds, I'm taking Prozac and Buspirone for anxiety, and Amlodipine and Metropol for BP.The problem with the BP meds is that I know my BP isn't that high, if I could only get an accurate reading. Also don't want to take SSRIs either.I finally found a shrink that might be just the right thing for me. She not only does CBT, but also relaxation and stress management training, cognitive and behavioral pain management, biofeedback training, surface EMG, thermal, skin conductance, individual pychotherapy,and medication consultation, done in collaboration with your primary care provider.Treatment is short-term, generally 6-12 sessions, with focus on measuring progress in increasing involvement in meaningful activites.With all of that somethings gotta give.Hope it helps. I'll keep you guys informed",
            "post_id": "8035533",
            "timestamp": "1339346479",
            "user_id": "user_2202657",
            "user_link": "/personal_pages/user/2202657",
            "votes": "0"
        },
        {
            "answer": "Hey, good to hear from ye....sounds like you've got good health cover....are you in America? I'm in Ireland and pay private health insurance but it's nowhere near as good as what you've just described.I started on the Prozac but find that I'm getting very prickly sensation on the skin on my arms and accross shoulders/back....also giving me nightmares and sick tummy....it's a bummer! I was on them 20 years ago for postnatal anxiety and they worked very well...I had the same symptoms but much lower key... these symptoms are a lot worse now....The reason my doc prescribed them & not a more up to date SSRI is because I was on them before....the way I see it my friend is that why take something to help my anxiety if it's gonna make me more anxious because of the side effects....I've actually heard in a few cases they can put bp up altho my doc says a definate NO on that one....oh this vicious circle of worry is awful! I'm not gonna have any CBT for a month either as my therapist is off on holiday....just at a point when some very tricky stuff for me was brought up.....I have systemic lupus and my next appt at the hospital is June 26th so hoping they will be able to help as they are quiet good at helping with anxiety/stress related issues too.......Thanks for keeping us informed",
            "post_id": "8035679",
            "timestamp": "1339350349",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "wow. my BP was 190/110 few days ago, was at the docs office, as usual.as soon as he put the cuff on, VOILA, HR goes up, i could HEAR my heart start pounding, palms sweating....panicky feelings, its been like this on and off for 10 years, im 35 now...this is annoying and getting ridiculous, to the point that i CANT EVEN use the home BP machines, i put that on my arm, and start to freak out, my dads had 5 heart attacks, and died in front of me the last time, they revived him...BUT that experience and my family history has messed with me head, and now my life is so stressful from stupid doc's visits, and BP MACHINES !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 147/120. 190/11....to name a few of my BP results....terribly stressful.",
            "post_id": "8036801",
            "timestamp": "1339381274",
            "user_id": "user_2216012",
            "user_link": "/personal_pages/user/2216012",
            "votes": "0"
        },
        {
            "answer": "Hi there, are you on bp meds? What does your doc think?I hear ye about the bp machines.....such a bummer not being able to take my own any more on the home monitor bp machine....isn't it amazing how powerful the mind can be, if only we could use it to our advantage instead of against us.I've got myself a copy of Paul McKenna's book with his hypnosis cd enclosed...the book is called 'Control Stress'...it's brilliant! He gives techniques to learn & use to take you out of stressful panic mode....definatly worth buying.",
            "post_id": "8037655",
            "timestamp": "1339415345",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Hi ColeenI live in the US in the state of Maine which is all the way north on the east coast, right under Canada.Re Prozac, I've been on it for about 20 years. I asked my doc if there was anything newer, but he says that they all have about the same formular, and that if it was working ok, then leave it alone.Anyway, if it's not working for you, then there are many SSRIs that might give you fewer side effects.  I don't think that Prozac can raise you BP either, and I would think that maybe it is the anxiety.While your CBT person is away, maybe it would be helpful to do a little reading.   The guy that came up with  this cognative stuff is \"Albert Ellis\"Although his book a pretty dated, it puts the whole thing in very simple terms.Good luck",
            "post_id": "8039113",
            "timestamp": "1339444278",
            "user_id": "user_2202657",
            "user_link": "/personal_pages/user/2202657",
            "votes": "0"
        },
        {
            "answer": "Hi, thanks for your suggestions. I'm going to mention to my doc about the possibility of trying another anti-depressant.....she was keen to keep me to Prozac as I had it 20 years ago for post natal anxiety type depression, and it worked well for me then....however body chemistry changes over time, also I wasn't on the bp tabs then...so I dunno maybe all that is relative. All I know is I've given the Prozac a fair go & really don't feel they are agreeing with me.....I can put up with the prickly skin altho bothersome, and even the nausea/stomach cramps but the tummy probs are getting worse & as for the nightmares!! They're horrific! Also I'm getting restless legs now and I remember that as a side affect before....such a shame really....I will have a look out for the book you mentioned, thanks. Meantime I've found Paul McKenna's book that I mentioned above very resourceful...if you can get a copy I would highly recommend it....Good luck to you and thanks for your suggestions :-)",
            "post_id": "8040791",
            "timestamp": "1339490136",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "I'm trying the following.  I listen to a YouTube of relaxing, peaceful, music while looking at stock photos of doctor's examining rooms and people having their BP taken.  I hope to reprogram my associations.  My BP is always good when I take it myself at home, but up when I go to the doctor.   There is some shame there, well, there it is, we're not alone!",
            "post_id": "8041442",
            "timestamp": "1339511048",
            "user_id": "user_2218672",
            "user_link": "/personal_pages/user/2218672",
            "votes": "0"
        },
        {
            "answer": "I find it so frustrating that I can't take my own bp anymore with the home monitor I have....I mean usually people get white coat when they have it taken at the doctors surgery or hospital....this weirdo here is the other way around ha! I still get a little anxious when the doc takes it but nothing like the home monitor....I think also it's coz with the older type manual bp reader (can't remember what they're called) I can't hear the machine going up & can't see the readings....or whatever......It's awkward as when I used to be able to take it myself at home it was reassurance for me....now if I have a bad day, am a bit stressed or not feeling very well I find I'm obsessing about wanting to be reassured that my bp is ok......I can't keep turning up at the doc's to have it checked or I'll be like a hypochondriac!Good idea what you said AspenTree about listening to the the relaxing music while looking at pics of people having bp taken to reprogram your associations....keep us posted how it goes & good luck!",
            "post_id": "8044753",
            "timestamp": "1339594651",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "I really need to get to a doctor, pulled my back out and having severe muscle spasms.  How do I make an appt. without having my BP taken?  This is the only thing holding me back from seeing the doctor!",
            "post_id": "8073761",
            "timestamp": "1340380648",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "Oh you poor thing :-(If I were you I would go along to the doctor and tell them the problem with your back but explain that you have Whitecoat Syndrome & are nervous about having bp checked (unless it's a doctor who knows this already, in which case remind them anyway!)...they will make allowances for that, and also if you're in pain they will make allowances for that fact also as being in pain can make a person more anxious which affects bp.....Hope you feel better soon!",
            "post_id": "8076174",
            "timestamp": "1340443226",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Forgot to say....a friend of mine gave me a tip yesterday....he does this all the time when having his bp taken....bring your phone or an ipod etc with some music downloaded that relaxes you. When having your bp taken put some ear phones in and listen to music you like as it's been taken, he finds it good as a distraction. I'm going to try this on tuesday when I have my lupus clinic appt....I am DREADING it!I also specifically ask whoever is taking it to use the older type of monitor instead of those electronic ones....I find the older type don't freak me out AS MUCH....probably because I can't hear the bloomin thing or see the numbers flying up....Hope this helps...let's know how you go & good luck!",
            "post_id": "8076182",
            "timestamp": "1340443828",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Went to the lupus clinic yesterday...need not have worried as they didn't take my blood pressure! The doc said I've to have a 24 hour monitor, they'll be in touch to tell me when to collect it pffffffffft...knowing the healthcare system here (or lack of it!) I'll probably never hear from them!Part of me doesn't want the monitor anyway coz I'm worried I'll freak out when THAT'S on me and they won't get proper readings then even......oh what a pain in the *** this is!If only I could take my own bp like I used to, just to reassure myself but no, my pulse takes off at the speed of light the instance the cuff goes on my arm.",
            "post_id": "8089608",
            "timestamp": "1340819669",
            "user_id": "user_2193833",
            "user_link": "/personal_pages/user/2193833",
            "votes": "0"
        },
        {
            "answer": "Wow!!  Surprised they didn't take your BP at the clinic!  I have been sick the last two weeks, caught some kind of flu bug, had low fever, aches, chills, sweating and extreme lethargy.  Do you think I went to the doctor for a quick fix???  NO!  Hubby also caught it so we've been sick together.  Just now starting to feel better but know I can't cop out much longer, as I am due for my 6 mos. checkup with my oncologist (10 yr. breast cancer survivor).  I will have to bite the bullet on this one.",
            "post_id": "8131390",
            "timestamp": "1342044926",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I have been dealing with the same problem myself recently.  It all started about 3 years ago.  I had always been 120/70-80 when my blood pressure was taken at the doctors office until this one visit when I went for a physical because it was required when I registered for college.  I had expected to go in and just find out my blood work results, and just do the standard bp, weight, etc...get the signiture and leave.Well the doctors assistant comes in casusally talking about the TB test and Tetanus shot as if I knew about it already.  So as she's getting the bp monitor ready, I'm sitting there worrying about having 2 needles, and wondering what possible side effects could come from the injection because I can be a bit of a hypochondriac at times.  Now I had been to the same office about a month and a half before on a seperate matter, and it was 120/80 as usual, but that day it was 150/80, and in this snooty judgemental voice she's like...oh thats a bit high.  The doctor did it himself several minutes later and it was down to 135, so he brushed it off as nothing.  The next time there I was so worried about my initial bp reading that I made it 150 again, which again went down a bit with the doctor later.Well a week ago the same thing happened, went from about 155 to 140.  He says its just white coat hypertension but can see I'm concerned so he suggests getting a home monitor so I can see my normal bp...but it turns out I get just as nervous with that.  the diastolic usually always stays about 70, but the systolic ranges from 130-150.  Every time it starts to inflate I feel that fuzzy jittery feeling come on, and the adrenaline waves, and a heart rate of 90-100 on the monitor when its about 65 2 minutes before the test.  Every high reading just makes me more nervous next time, and now I cant ever get an accurate reading from these things.",
            "post_id": "8135997",
            "timestamp": "1342163676",
            "user_id": "user_3122964",
            "user_link": "/personal_pages/user/3122964",
            "votes": "0"
        },
        {
            "answer": "Sorry to say, but it becomes a vicious cycle once the fear of taking your BP sets in.  With me it's turned into a phobia!  I am due for my oncologist check up.....not nervous about lab work, cat scans, mri, but nervous about the follow up  appt. with the dr. because I know they will have to take my vitals.The last time I went, I told the nurse I wanted my reading done AFTER the onocologist gives me the results of my tests, and even THEN, I hadn't calmed down enough and it was still high!I am dreading going but I HAVE to go!  What do I do?????",
            "post_id": "8174464",
            "timestamp": "1343231422",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I had this same problem ever time I would look at a blood pressure machine I would freak out! The whole thing was kind of embarrassing. I recently switched doctors and of course when I went there my blood pressure was high. He told me that I should try to take my blood pressure daily for a month just to see if it is different. I have to admit I was dreading do this the at home monitors for some reason made me more nervous then the ones at the doctors office. Anyway I did it the first couple days my readings where a little high nothing really bad. However eventually I stared to realize that it's nothing is going to change unless I just deal with my fears. Now I take it daily and most days I do have to do it two or three times until my nervousness subsides. There is no way to get over your fears unless you face them head on. Now my blood pressure is normal and I know that. Whenever I do go to my doctor I will be able to show him that in fact I do nit have high blood pressure. I haven't been back since but I hope I am \"cured\" of my fear. It is so frustrating and it is a cycle. It also Dosent help when the nurses are like Oh Your blood pressure is high and give you that look. But you can get over it! It may not be easy or what you want to do but you can do it!!",
            "post_id": "8181708",
            "timestamp": "1343404318",
            "user_id": "user_3154088",
            "user_link": "/personal_pages/user/3154088",
            "votes": "0"
        },
        {
            "answer": "I enjoy this forum on issues of 'freaking' out when someone takes your blood pressure.   has been happening to me for the last approximately twenty years.  Does not matter if dentist, doctor, nurse, et al, once someone places the BP cuff on my arm my blood pressure spikes.  On occasion up above 200 systolic.  Dread having an appointment which will require BP measured.  Unfortunately it seems as if everyone in the health care field is inclined to do so these days.  It seems the past decade has fomented the idea of who can have the lowest pressures.  Maybe a push by big pharma to produce all the pills and revenue.  Hypertension a big business in USA.  Have read approximately forty percent of people diagnosed are really not hypertensive.  My new doctor has hinted that my BP should be under 140 sys in his office.  Almost fell out of my chair with my heart racing about 140 and just completed BP 210/90.  In home blood pressure runs between 130/140 over +60.  He doesn't seem to care when I bring the numbers to my appointment.   Nice to know there are a fair amount of people that suffer from BP phobia's and fears.  Thought i was isolated and losing my mind over this issue.",
            "post_id": "8185236",
            "timestamp": "1343502422",
            "user_id": "user_3156130",
            "user_link": "/personal_pages/user/3156130",
            "votes": "0"
        },
        {
            "answer": "Well the day is almost here....have to see my oncologist Tuesday for the results of my lab work, scans, etc.  (10 yr. breast cancer survivor).  Suffice to say I am MORE nervous about my BP reading than I am about the results of the tests!  Is that sick or what????  I am actually shaking as I'm typing this.I even tell the nurse to come back and take it AFTER I get the results, but it STILL stays high as long as I am in the doctor's office!  My best friend told me to accept that it's going to be high and tell them I have a phobia about it.How will they EVER get an accurate reading??????",
            "post_id": "8209106",
            "timestamp": "1344177181",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I have had this same problem. Every time my BP has to be taken I FREAK out. Im pregnant and have a dr's appointment in 2 weeks and im definitely going to try the exhalation technique. I will let u know if this helped",
            "post_id": "8225916",
            "timestamp": "1344627455",
            "user_id": "user_3183440",
            "user_link": "/personal_pages/user/3183440",
            "votes": "0"
        },
        {
            "answer": "I have had this same problem. Every time my BP has to be taken I FREAK out. Im pregnant and have a dr's appointment in 2 weeks and im definitely going to try the exhalation technique. I will let u know if this helped",
            "post_id": "8225918",
            "timestamp": "1344627543",
            "user_id": "user_3183440",
            "user_link": "/personal_pages/user/3183440",
            "votes": "0"
        },
        {
            "answer": "Can feel your anxiety. Nurse did the same thing to me years ago, now I tell the nurse the Doctor is the only one I will allow to take my BP. Its always high but he takes it a few more times before I leave and sure enough it goes down. Going for my yearly check-up tomorrow petrified, even though he knows me and he is so kind and sensitive to my fears. I am 61 years old and have had this my whole life. I had my first panic attack at the age of 8 years. On meds and no more attacks, but always anxious. We all have our crosses to bare, I guess for some of us this is it.God Bless You and thank you for sharing.mom.***@****",
            "post_id": "8276266",
            "timestamp": "1346105249",
            "user_id": "user_3223073",
            "user_link": "/personal_pages/user/3223073",
            "votes": "0"
        },
        {
            "answer": "Thanks very helpful",
            "post_id": "8359270",
            "timestamp": "1348522189",
            "user_id": "user_3900332",
            "user_link": "/personal_pages/user/3900332",
            "votes": "0"
        },
        {
            "answer": "I cannot believe it!  Yesterday, went for root canal surgery and they took my BP reading!  I told the nurse it would be high and not to take it, but they said since they were doing a procedure that required anesthesia, they had to by law, take it. Well, the dentist walks in and says he cannot do the procedure with a reading that high!  200/97, pulse 80!!!!!They made me lie down in the chair and took it again a few minutes later.  It went down to 177, which was okay with the dentist.I have to go back in two weeks for the rest of the root canal to be finished up and I am freaking out all over again, just like I did when my eye doctor wanted to send me to the ER back in March!What do I do about this?",
            "post_id": "8411477",
            "timestamp": "1349979142",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I am so thankful to have found this site.  Until I read all these comments, I thought I was the only one out there with this phobia.  I just got back from the Gyno and as usual, I warned them that my BP would be really high there.  (At home its around 110/70.)  Like others, I feel like a failure at the test, and am concerned about the nurse's comments and afraid they'll put me on meds when I know I don't need them!  Sure enough - super high reading.  So high, in fact, she left the room and had someone else come in and take it to confirm the high reading.  Last year when I went in, the nurse told me that if it got any higher, they couldn't let me go home!!  That just freaked me out even more!!!  And it frustrates me when I tell them that I get normal readings at home.  It's like they don't believe me.  It's not too tough to take your own BP with an electronic cuff!  I just wish I could find a clinic with more sympathetic health care providers.  They tell me to relax in the Dr office and they take it again, but of course it is still high, because I am in the anxiety causing environment!!!  It's gotten so bad that I dread going to the doctor and have thought about skipping my annual exams, which I know is wrong.  If I just knew that they weren't gong to take my BP, all would be fine.Thank you everyone for sharing your stories.  They really help me and show me that I am not alone in this!!  I just wish more people in the medical community were more informed about this.",
            "post_id": "8453601",
            "timestamp": "1351172532",
            "user_id": "user_4215025",
            "user_link": "/personal_pages/user/4215025",
            "votes": "0"
        },
        {
            "answer": "OMG!!!  I feel as though I could've written your post!  My fear started last year when my EYE doctor (can u believe it?) took my pressure and wanted me to go to the ER!!!  Told him it's been high at any medical setting and that I suffered from white coat syndrome.  But ever since that visit, that damned doctor planted the seed and now I cannot even LOOK at my home monitor, let alone use it!Even my dentist takes readings!  A few weeks ago, he wasn't going to do a root canal on me unless my readings went down!!!!  To make matters worse, the RC couldn't be done in one visit, so I had to go BACK a few weeks later to complete the procedure....by that time, I was so freaked out that I popped 2 Xanax pills before the visit and by the time I got in the chair, I was snoring!Maybe that's the ticket....take something to calm me down before I go in for any dr. appt??",
            "post_id": "8484877",
            "timestamp": "1352042629",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I'm amazed as to how many people suffer with this specific anxiety. I am part of the club as well. I have had to go to the dentist. Almost a year ago I had to have a root canal and my BP was 200/110. My fear of the cuff inflating as well as having BP taken has been lifelong and then adding having to explain why to the nurses then again to the Dr. And why do they act as if you're the only patient they have that has a high reading. At 57 they look shocked when I say I'm not on BP meds and I get that condecending look as if they think I'm in denial and stupid and don't care if I have a heart attack. I'm overweight and of course they believe it's innevitable, even though the don't know me or my physical state. They look at the package and assume I'm unhealthy.  They don't believe me when I say it's normal everywhere else and look confused. Why are Drs. so off on understanding how a patient can react.They never ask any questions.  Anxiety is real and will spike the BP. So, after the root canal the tooth cracked and they told me I had to have it extracted. A temporary crown was placed on it and about a month ago it fell off and I had to start applying the temp. filling on it and the crack started getting wider. My fear of having to face the whole BP thing again kept me delaying the innevitable. Finally, I made the appt. and expected to have an easier time because they knew my situation. I had IV conscious sedation the first time and of course totally relaxed and BP came right down and the Dr. told me that since it did go down I  would be fine with Nitrous Oxide for the extraction.  I thought I had proven that it was anxiety. I show up for my appointment and the first hour was to apply the overlays and second hour was going to be the extraction. Then everything goes crazy. The doctor I had the first time was no longer there and the new doctor sees my BP and of course here goes the whole explaination and he doesn't even look at my record or what happened before and how my BP came down easily with sedation. He just goes into this rant about how I'm going to have to be IV sedated etc. I suggest the nitrous oxide first to see if that will work. He tells me he's not going to do the overlays because he wasn't scheduled to do sedation and in an arrogant tone keeps saying he really wants to see if any other type of sedation works to bring down my BP of 203/115 other than IV sedation. Of course he's announcing this loudly and everyone in the place can hear him. The oral surgeon comes in to prepare for the extraction. I do like him because he was the one that handled the IV sedation the first time and new my situation. I'm so tired by now but really want my tooth extracted to get it over with. I'm so upset and nervous by now and the nitrous oxide isn't working and nurses are all saying \"You need to relax\". I really hate when they say that. Finally, the oral surgeon tells me he can add a shot to help me relax and see what happens. But it irritates me because he's now also having doubts. His assistant who is monitoring the BP machine was really nice and I could tell she understood what I was going through. She offered me a pillow and sunglasses for the bright light. As usual once the shots kicked in my BP came down like a charm and he did the extraction.Now, I'm still stressed because I have to go back to have the overlays applied and I'm just hoping they don't make a big deal when my BP will probably be just as high. They're going to do the conscious sedation again with the shots.  And still I need to get this done but the stress waiting for the day also has kept my BP in the 150's/86 range. It goes up a little then down a little. I also keep telling myself I have to ignore their reactions and tune out their comments but these doctors and nurses need sensitivity training. They have completely forgotten how to treat the patient with compassion and understanding. I can't help but feel their only interest is to have patients like ourselves on BP meds so that we fit neatly into their box. They don't  care if we suffer the side effects being on meds we don't need.  I just don't understand why this has to be so difficult. We don't do this on purpose. Anxiety is real and yes we all work on trying to fix it so that we \"make\" them happy. Don't they know how humiliating it is for everyone to be discussing your BP as if you're an alien from another planet. It is aggravating which of course keeps our BP's high.  At this point I am going to try very hard to rise above their attitudes and comments and let them think what they want. I know my body and know why. If they don't get it well then that's their problem. I'm not going to be bullied into taking BP meds for something I know I don't have. So to everyone who has posted we know what the deal is and how the anxiety was created and that's all that matters. I also want to thank everyone for sharing their experiences because it has made me feel better just knowing how many other people have this issue.",
            "post_id": "8509824",
            "timestamp": "1352705751",
            "user_id": "user_4317286",
            "user_link": "/personal_pages/user/4317286",
            "votes": "0"
        },
        {
            "answer": "Going to get permanent crown put on 2morro.  I know damned well they well take my BP, even tho the root canal procedure is over with, and they really have no business taking it!Dunno what the answer is.........maybe taking some Xanax again like I did b4 the last appt???",
            "post_id": "8511686",
            "timestamp": "1352759359",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I thought they weren't that many people afraid of taking blood pressure... I am supposed to take it daily but I always have the fear it's going to be high too...",
            "post_id": "8511822",
            "timestamp": "1352762139",
            "user_id": "user_96121",
            "user_link": "/personal_pages/user/96121",
            "votes": "0"
        },
        {
            "answer": "hi i suffer from the white coat syndrome as when im relaxed at home it is a normal reading of around 120/70 but even when i first take my blood pressure i feel slightly anxious and its anything between 130 to 140 over 90  so i wait a third time as then i am more relaxed and its normal.i believe if the blood pressure is naturally high it wont ever have a lower reading i believe if your relaxed and its normal reading its not high.as soon as i go to the doctors its high and my pulse is high.",
            "post_id": "8519497",
            "timestamp": "1352975133",
            "user_id": "user_4335080",
            "user_link": "/personal_pages/user/4335080",
            "votes": "0"
        },
        {
            "answer": "Here I go again!  Had to go to dentist to get permanent crown, and they took my BP!!!  I asked why did they have to take it, since I wasn't having anything major done??  Of course, it was sky high and I asked the tech not to tell me what it was.  I wasn't even nervous this time!How do I get over this?????",
            "post_id": "8560709",
            "timestamp": "1354113458",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I also have this feeling if i noticed some sort of pain in my body i started to get nervous and i feel my heart beating faster i already went to the hospital and they took my bp my reading is 150/110. every time I'm thinking something bad will happen my bp is going high. i already went some laboratory test i found out that my cholesterol level is high and everything are in normal range except my cholesterol.",
            "post_id": "8675333",
            "timestamp": "1356943955",
            "user_id": "user_4594239",
            "user_link": "/personal_pages/user/4594239",
            "votes": "0"
        },
        {
            "answer": "Happy New Year to all!!!  rog, I too, feel that every ache and pain is a sign of a stroke.  My cholestrol is in the high range, I get lab work next month and if it doesn't go down, I will have to take meds for that too.  Wish there was a blood test for BP so I wouldn't be so afraid of the damned machine!!",
            "post_id": "8680220",
            "timestamp": "1357077004",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "As I write this I'm sitting in the Dr office. I have had to deal with this a few moments ago. Trying to not think about it doesn't help.  Im 36 and have hat this fear for awhile along with needles and blood just being in the offi ce freaks me out.Ive had panic attacks before and all and all I think there is this have fear that is perputated by the saying your bp is high.At the very least writing this comment has been carthadic.",
            "post_id": "8689533",
            "timestamp": "1357265353",
            "user_id": "user_4622216",
            "user_link": "/personal_pages/user/4622216",
            "votes": "0"
        },
        {
            "answer": "I have a few dr. appts. coming up, one is with my dentist and the other is my oncologist.  I cannot even bear to think about them taking my blood pressure readings!  My dentist almost refused to do root canal surgery b/c my reading were so high, even after I told him I suffered from white coat syndrome and panic attacks!I don't know how to get desensitized by this phobia.",
            "post_id": "8704758",
            "timestamp": "1357592197",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I can SO relate to ALL of you!  Can't believe how many of us are out there! I am 52, female, in pretty good shape for my age, but have been scared to death of the BP machine for the past 10 or so years.  It started in the doctor's office.  Now I can't even take it at home without my pulse racing and my BP shooting up way above normal (like 170).  In searching on the Internet about a year ago for help with my problem, I stumbled across a site that was selling CDs where you listened to music and breathed along with it.  It's called Breatheasy.  I decided to purchase the CDs and sat and did one of the breathing exercises for 5 minutes and then took my BP.  It was like 112/70.  I couldn't believe it!  Every time I use this system my BP is normal.  So what I now do is use this to take my BP before a doctor's appt, and then bring my #s to my doctor.  He says as long as I keep bringing him normal #s like this, he is happy (and so am I).  Now I am working on learning the breathing so well that I can do it in the doctor's office without listening to the CD.  But one step at a time.  It seems that when we are anxious we hold our breath or hyperventilate without even realizing it - which spikes our BP.  If you want to check it out here is the link: www.control-your-blood-pressure.com  I hope it helps all of you like it did me!  (I have no affiliation with this product other than a happy customer!)",
            "post_id": "8708761",
            "timestamp": "1357671257",
            "user_id": "user_4392254",
            "user_link": "/personal_pages/user/4392254",
            "votes": "0"
        },
        {
            "answer": "Hi again all,Next week, have cancer screening tests (am 10 yr. survivor) and a followup up with the doctor the following week.  Already I am dreading it,  because of the BP reading, but I also gained weight over the holidays that I haven't been able to lose yet.  I'm afraid of the scale as well, lol.Relaxation techniques do not work for me....tried the breathing exercises that a doctor suggested....everything flies out the door when I walk into the doctor's office or clinic.Still not able to take my BP with my home monitor.  I do take Benicar and hope for the best.  Been going through this fear for several years now and don't know how to conquer it!",
            "post_id": "8804432",
            "timestamp": "1359732828",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I'm pleased I have found this thread because I've had a similiar experience.I am a 43 y/o male and about 5 years ago I was commuting / working very long hours and running up stairs for a train carrying a large heavy briefcase and I felt a twinge in my chest (which I now know was just a muscle pain). I thought I'll go to the doctors just in case and get checked out. I was so nervous as I thought there might be something wrong, my heartrate jumped and my BP showed 160/x. I bought a home monitor and found that every time I used it my heartrate would jump from resting 55-60 right up to 110-120. Sure enough my BP was high. High on the machine at home, higher in the doctors surgery.I worked with the doctor to get checked over - blood checks, urine, chest x-ray, ECG etc etc. He walked me through all of the results and said I was fine. He prescribed atenolol and said to take it if my BP was high, but that I could choose not to if I resolved the fear / anxiety issue. He basically said that he could not get an accurate reading and because the readings he did have were high, he had to prescribe.I became a little obsessed with taking my BP, taking it 20 or more times a day. Every time I did it I would have an adrenaline rush and my BP would be high - I was wired on adrenaline from the fear of my own blood pressure machine, which will obviously increase your blood pressure over time!! So I decided to take my BP far less regularly, once every few weeks. I lost a little weight, exercised even more often. Now 5 years later, I take my BP every couple of months. I take it 3 times with 5 minute intervals. It normally looks like this 1st time 145/85 HR 115, 2nd time 135/80 HR 75, 3rd time 130/75 HR 60 and if I take it again it will keep going down a little. Last time I took it I was 122/73 HR 58.I've kept a log over the years and my average even with all of the highs is 136/84 HR 82. If I take the adrenaline caused spikes out, then I am in the mid 120s and 70s. I do take a quarter dose of 12.5mg of Atenolol a day (although my wife says I don't need to) and even with this, my heart rate will spike at 115-120 the first time I take my BP.What I have learnt is that if you have an inquisitive / restless mind (like I do) you can imagine all sorts of negative things. However the data I have collected indicates that I have a phobia (which is what the fear of having your BP taken, or potentially the result, actually is). If you have a phobia of having your BP taken then it is likely your BP wil be high when you are exposed to the subject causing your phobia. Imagine taking someone who had a spider phobia BP just after you had shoved a tarantula in their face!!The problem I see here is that when you go to the doctors or for a medical procedure they don't always understand. I've had nothing wrong with me and have not been to the Doctors at all in the last 5 years (except to register as I have moved country - and they did not take my BP!). I need to deal with that one at some point :-) I am hoping I wil have an understanding doctor, and I will show them my spreadsheet!",
            "post_id": "8831236",
            "timestamp": "1360458401",
            "user_id": "user_4881515",
            "user_link": "/personal_pages/user/4881515",
            "votes": "0"
        },
        {
            "answer": "hi ,i could be telling this story.about fifteen years ago.dave",
            "post_id": "8840463",
            "timestamp": "1360716607",
            "user_id": "user_3900332",
            "user_link": "/personal_pages/user/3900332",
            "votes": "0"
        },
        {
            "answer": "Well, went for my appt. thank God all my tests were negative, but my BP was sky high, PA didn't seem concerned at all, most previous cancer patients they see always read high when they are nervous about the appt.  She did say if it was that high ALL the time, I definitely would be having symptoms.  I do high cardio and strength training 3-4 x a week and have never felt out of breath, light headed or dizzy.  I work with a trainer and he has even upped some of my routines to heavier weights!She told me to try to take it at home under normal circumstances, but it doesn't matter.  Just the fact that I am going to take it makes my body go into full panic mode.  Not even breathing exercises or taking Xanax beforehand has helped.  My heart doesn't race, however, it's usually between 70-80 even with the high BP readings!I'll just continue to take my BP meds and maybe one of these days I'll find the courage to take it at home.",
            "post_id": "8842102",
            "timestamp": "1360768275",
            "user_id": "user_2141703",
            "user_link": "/personal_pages/user/2141703",
            "votes": "0"
        },
        {
            "answer": "I'm going through this too!  I have been doing this for approximately 5 years.  It all started in a doctor's office when I had PTSD and was in mid-panic attack and the PA took my bp only to find it was high!LOL  SURPRISE!!!  She freaked out and it went from there!  So....since then I have had issues with even wanting to make a doctor's appt., but now I have to go my gyno and I am bit apprehensive.  I have resolved myself that I am just going to state it straight up that I have whitecoat syndrome with a bp phobia.  My GP knows that and he just said to monitor it at home and at home it is great!!!Trying not to panic....LOL",
            "post_id": "8963678",
            "timestamp": "1364233037",
            "user_id": "user_5142403",
            "user_link": "/personal_pages/user/5142403",
            "votes": "0"
        },
        {
            "answer": "I'm really glad I found this post. My girlfriend thinks I am ABSOLUTELY ridiculous for having this fear. I to avoid the dentist and not too long ago I walked out of the optometrist because they said they needed to take my blood pressure. I'm 29, not overweight, non-smoker, occasional drinker, and fairly active. My problem is I had an extremely bad panic attack one time and my mom took my BP and it was through the roof because I was literally having the worst panic attack of my life. Ever since I am terrified of BP machines. I know I need to conquer my fear because I can't live my life afraid of a machine. It's a very stressful situation feeling so helpless to something so silly.",
            "post_id": "9338809",
            "timestamp": "1375128714",
            "user_id": "user_5834400",
            "user_link": "/personal_pages/user/5834400",
            "votes": "0"
        },
        {
            "answer": "So good to hear it's not just me! I am 28 and when i was 20 I had my BP done and it was 160/ ? and every time they went to do it i could feel my heart beat rapidly speed up EVERY TIME. So I got sent to my GP to have regular BP checks and the lowest they got was 130 but said that was still high.Recently I had another check and it was 160 then 150. I have just ordered a BP machine to take it at home myself as I do think it is just White Coat anxiety and would like to see what it is when i do it myself.The worst thing is for the past week since that BP check I have had bad anxiety. My heart feels like it is aching from the adrenaline and feel like every 5 seconds there is a surge of adrenaline  which cant be good for me???? I just wish it would go away but i dont know  how unless i go to the  doc and get sedatives or something for anxiety?! argh hate this.",
            "post_id": "9371166",
            "timestamp": "1376024566",
            "user_id": "user_5883453",
            "user_link": "/personal_pages/user/5883453",
            "votes": "0"
        },
        {
            "answer": "Try Magnesium glycinate for anxiety, also for  sound sleep and relaxed heart . If you take it as the bottle says, it will help control fear of the unknown, ie phobias. It will help hundreds of other health issue, including  what you have posted here, and your fear of BP check. Take Mg half hour before you go for BP check, it will get you all relaxed, no worries. .Search more on Magnesium. It is a mineral we all need but Its no longer in our food as the food supply has changed.My family is on Mg, more so than calcium. As we know, Calcium is present in most foods that we eat, but Mg is not thats why supplementation is almost always necessary.Mg is the relaxation mineral. Calcium is the contraction mineral. This is how it works for the heart.Gwyneth Paltrow uses it for sleep as she talked about her health habits  on Dr. Oz..Its the healthy choice for relieving anxiety, your body needs it and it will help for over all health; no sedatives please.No meds for anxiety please, just take your minerals.. :)Take care, I know this will help I know as I use it everyday.",
            "post_id": "9371369",
            "timestamp": "1376032364",
            "user_id": "user_5695050",
            "user_link": "/personal_pages/user/5695050",
            "votes": "0"
        },
        {
            "answer": "I have the exact same thing, I hate it, how it squeezes and makes my hand tinglyThe worst part is that it never seems to be able to get a reading first time. They always end up doing it 2 or 3 times",
            "post_id": "9460936",
            "timestamp": "1378544076",
            "user_id": "user_217665",
            "user_link": "/personal_pages/user/217665",
            "votes": "0"
        },
        {
            "answer": "I realize that this article was question was submitted several years ago, and that I'm about to say the same thing as many of the others who've commented already have, but I am so relieved to find out that I am not the only one with this problem.  The very first time it happened I was probably 20 years old.  I had never had a bad experience at the doctor's prior and I really liked my doctor.  For some reason I just got very panicked while waiting for my appointment.  When the time came for the nurse to check my blood pressure is was ridiculously high - like 190/130 or something.  She immediately left to get the doctor.  I could hear the two of them talking outside the door, speculating as to what could cause such a high reading.  Hearing them talk about me, and speculate that I was on drugs or having an adverse medication reaction or something, only made me more nervous.   By the time the doctor came in and took another reading my top number was over 200.  The doctor more or less interrogated me, which made me feel guilty and certainly didn't help anything, despite the fact that I had nothing to feel guilty about.  She then told me there was no way she could let me leave because she was afraid I would have a stroke in the parking lot.  Somehow, I finally got my BP down to a more normal level.  The entire time I worried that I was having a heart attack and dying - my first ever panic attack.  Now I have severe anxiety just about every time I see a blood pressure cuff.  My dentist surprised me with a BP reading a couple weeks ago (something new they're doing) and my BP was 165/97.  Luckily the dental assistant thought she'd done something wrong and just gave up.  I knew it was really that high, though, because I could feel my BP go through the roof the second I realized what was happening.  A few years ago I registered to be a bone marrow donor and now I'm worried that if the time came for me to donate, they wouldn't even let me because my BP would be too high!  I hope that someday this fear subsides but as of right now it makes me feel like I would rather die than go to the doctor for something.  It does make me feel a lot better, however, that so many others experience this problem!  Thanks to everyone who has contributed to this thread!",
            "post_id": "9498113",
            "timestamp": "1379649549",
            "user_id": "user_6221720",
            "user_link": "/personal_pages/user/6221720",
            "votes": "0"
        },
        {
            "answer": "Omg i thought i was the only one i dont even know how to brave right when they start to take my pressure smh every time i go to the hospital my heart rate goes up i can go in and it's normal but after being there for a while they come and retake it and say oh it's a little high i start to panic cause i know what's next they want to keep me  to check what's the problem i been thru this so many times now i go try to take deep breath blow out slowly then let hem check me if tge come back with ih i have to recheck it i be like nope i know i only get like this when i come here get my prescription and off i go:) but hate going to hospital had a very bad experience once in the hospit......",
            "post_id": "9525272",
            "timestamp": "1380490048",
            "user_id": "user_6343199",
            "user_link": "/personal_pages/user/6343199",
            "votes": "0"
        },
        {
            "answer": "I'm 35 and have struggled with high blood pressure since I was 16.  I'm in good shape (thin, jog 3-4 times/week), never smoked, eat healthy, rarely drink, and don't feel anvious most of the time.  However, I still find that when I take my BP readings at home the first few readings are high and gradually decrease over 10-20 mins.  Example: 145/90, 140/85, 135/82, 130/80, level off at 120's/80's.  Again, I feel calm and my pulse rate is normal (45-60 or so).Is it possible that I'm subconsicously anxious and this is causing my early readings to go up?  I do tend to suffer from occasional bouts of health anxiety and often worry about my blood pressure.Does anyone else experience this?",
            "post_id": "9594436",
            "timestamp": "1382535026",
            "user_id": "user_6570075",
            "user_link": "/personal_pages/user/6570075",
            "votes": "0"
        },
        {
            "answer": "The same thing happened to me at 19 or 20 years old.  I was in college and had a terrible respiratory and sinus infection.  I was taking sudafed like candy( I didn't know any better that it can raise blood pressure).  I went to the student health facility and a nurse took my vitals before seeing the doctor.  She freaked out because my BP was high.  It was 135/something.  She quickly went and got the doctor.  The doctor tried to reassure me that it was the sudafed that was causing a higher BP than normal for my age because then I was freaking out.  Well, that's where it all started.  I am terrified of going to the doctor now because my BP is ALWAYS high now when I go.  I know it's psychological , but the my mind is stronger than I am when it comes to this.  I have a wrist cuff that I use at home, but I still feel anxiety when using that.  It usually takes me 5 readings to get it in a normal range.  I'm now 38 and I can't believe how this one experience has stuck with me and caused so much anxiety.  Wishing you (us) the best in overcoming this!  Take care!",
            "post_id": "9751010",
            "timestamp": "1386929450",
            "user_id": "user_7002668",
            "user_link": "/personal_pages/user/7002668",
            "votes": "0"
        },
        {
            "answer": "I'm very thankful to everyone for posting. I too have anxiety when facing my blood pressure check at the doctors. Sometimes I rip the cuff right off! I'm sure the nurses think I'm completely crazy but the thought of my circulation being cut off terrifies me. The feeling of my heart in my arm then sends me into frenzy hence the high BP reading. I'm putting off pregnancy because of this fear! I'm 25. I want help.",
            "post_id": "9876153",
            "timestamp": "1390638954",
            "user_id": "user_3860935",
            "user_link": "/personal_pages/user/3860935",
            "votes": "0"
        },
        {
            "answer": "I'm so glad I found this thread.Here's my story/worry,I went to the Dr's and saw the practice nurse, I only went with a simple eye Stye.She saw to this and then said it's been a long time since we checked your BP and I immediately said well its going to be high. I could feel myself getting all worked up almost to the point of trembling/nervous.She took it and sure as eggs are eggs it was high, 160 over god knows what ( I didn't even see ), of course the nurse said yes your right it is high.I then told her I had been in hospital some months previously with Kidney stones and fever etc and that in hospital my BP and heart rate was high, although it did come down somewhat in hospital and they never addressed it, they did however do 2 ECG's there though but didn't say anything was wrong.Back to the Dr's/nurses office, she said she wants me back in a week to do bloods for testing for everything and  24 Hr BP monitor and urine sample. Well, for the next 7 days I am worrying all the time about the 24hr BP thing - \"it will be high all the time, I do a strenuous job so it will always be high \" I'm thinking to myself all the time.So the next feel I go to the nurse, she takes my blood and of course the dreaded BP, to which she said the BP had come down from last week, still high but not as bad. When I asked about the 24 BP monitor she said\"oh were not doing that today \", I explained that I didn't think it would work anyway and she is now happy for me to do home readings on my machine.She then took my pulse which was also high at 140, but she could see I was very anxois, she then did an ECG, took it to a DR in next room to look at and the result was OK but fast. My blood results came back a few days ago and all is good except for trace blood in urine sample ( could be to do with my kidney stones ) and to bring in another sample in 2 weeks. I have bought my own blood dipstick test kit yesterday and it read neutral !.Over the past week or so my home BP reading have been between as low as 120/77 and as high as 141/94 with my pulse being between 85 and 105.Although my 1st BP reading at home is usually high, it takes a few repeated rested readings to get it lower.I am at my wits end with worry here, what do you think they will do when I give them my BP readings ?.I don't mind just taking meds from the GP but hate the thought of having to go to hospital for tests etc.",
            "post_id": "9935079",
            "timestamp": "1391955546",
            "user_id": "user_7554372",
            "user_link": "/personal_pages/user/7554372",
            "votes": "0"
        },
        {
            "answer": "I so relate to this. I have a fear of almost all things medical, but I keep trying to explain to my friends that the numbers won't be better at home because it's the machine itself, the test, that stresses (grosses) me out. I can't stand the tightening, feeling the pulse, etc. If I pass a machine in the drugstore, I get nervous. I did buy one, and I finally had to put it away in a drawer because I'd take it, and, of course it was high, and I became consumed with it. I'm sure I'll end up on BP medicine, but I really don't think I need it. My last doc was sure it was White Coat, but my new doctor isn't buying it. It's frustrating than an important test will not be accurate for me.",
            "post_id": "9936857",
            "timestamp": "1391988327",
            "user_id": "user_7558415",
            "user_link": "/personal_pages/user/7558415",
            "votes": "0"
        },
        {
            "answer": "I so relate to this. I have a fear of almost all things medical, but I keep trying to explain to my friends that the numbers won't be better at home because it's the machine itself, the test, that stresses (grosses) me out. I can't stand the tightening, feeling the pulse, etc. If I pass a machine in the drugstore, I get nervous. I did buy one, and I finally had to put it away in a drawer because I'd take it, and, of course it was high, and I became consumed with it. I'm sure I'll end up on BP medicine, but I really don't think I need it. My last doc was sure it was White Coat, but my new doctor isn't buying it. It's frustrating than an important test will not be accurate for me.",
            "post_id": "9936885",
            "timestamp": "1391988782",
            "user_id": "user_7558415",
            "user_link": "/personal_pages/user/7558415",
            "votes": "0"
        },
        {
            "answer": "I am going through this problem now at the age of 68.  I also am a Christian and feel that God will eventually solve my problem.",
            "post_id": "9952938",
            "timestamp": "1392310738",
            "user_id": "user_7585194",
            "user_link": "/personal_pages/user/7585194",
            "votes": "0"
        },
        {
            "answer": "Hi,I don't know if you still check your post, but I am going through the same problem. And I am also going to take a CNA class and I have been thinking about the BP situation.....Fist I thought was silly but I have learned that is an irrational fear. It happens to many people but they  just do not say it because it is embarrassing. Have you tried Reiki? it did help me through my 2 pregnancies , however I still have the fear but it is much better that it was before and I can definitely tell that.",
            "post_id": "10021483",
            "timestamp": "1393614488",
            "user_id": "user_7718894",
            "user_link": "/personal_pages/user/7718894",
            "votes": "0"
        },
        {
            "answer": "I know how you feel. Same here it gets so overwhelming ....I tried few things to overcome this fear  but the it is still here....however, while pregnant I've been able to handle it very well which I thought it would never happen....I'm still trying to figure out how to get over this fear.",
            "post_id": "10021508",
            "timestamp": "1393614796",
            "user_id": "user_7718894",
            "user_link": "/personal_pages/user/7718894",
            "votes": "0"
        },
        {
            "answer": "I have the same issue. I m pregnant with  my second child and I thought the same before, I did not want to have kids just because of this fear and have to go to the doctor that often....but you know what? somehow I was able to make it and it was not as bad as I thought! I got help from a Reiki practitioner through both pregnancies and everything went well. I can not lie to you but I still have that fear sometimes it is better and others gets worse ...but if I did it you can do it!!",
            "post_id": "10021540",
            "timestamp": "1393615143",
            "user_id": "user_7718894",
            "user_link": "/personal_pages/user/7718894",
            "votes": "0"
        },
        {
            "answer": "When my blood pressure shot, the only thing that calmed it down was BreatheEasy. I'd listen to the lovely music - Indian & western classical and breathe in and out as the wave-like sounds of the music dictated. Trust me, my BP came under control and life since then has been beautiful. I also listen to the music while doing my Physical Therapy exercises … it is like doing yoga including the way I breathe. I strongly suggest to anyone who has lost hope of getting over the 'white coat' syndrome that we call when you go to the doctor and your BP soars, the best antidote for the white coat fear isto practice breathing while listening to the music and monitoring one's own BP on a home machine. My doctor accepted my 2-week BP readings that showed normal range in my BP taken twice daily. I found out about this wonderful program from Debbie on this website, she suggested BreatheEasy, vouching that it had helped her. I ordered online and voila from that day I am a different person free from fear",
            "post_id": "10076748",
            "timestamp": "1394652315",
            "user_id": "user_7840618",
            "user_link": "/personal_pages/user/7840618",
            "votes": "0"
        },
        {
            "answer": "I am so happy for you!  Thank you for letting me know that my recommendation helped you!",
            "post_id": "10079953",
            "timestamp": "1394715465",
            "user_id": "user_4392254",
            "user_link": "/personal_pages/user/4392254",
            "votes": "0"
        },
        {
            "answer": "Hi there, everyone...I found this site about a week ago. I've been struggling with this problem for the last month...ever since I was diagnosed with high blood pressure. I had gone to the doctor...first time in years...and was nervous (because doctors make me nervous), my heart was pounding and they took my bp. It was 190/104 and pulse was 120! The nurse said I've got to go tell the doctor and ran out of the room! She returned immediately with a pink pill (clonidine) which I took. Meanwhile, the doctor came in and said I need to find out why your blood pressure is so high. My heart was still pounding and I was very scared. She sent me next door to have an EKG done. My heart was racing but the EKG was normal. I have suffered from anxiety off and on for years...I sometimes have panic attacks, which are severe. Now I'm on blood pressure meds and am supposed to be monitoring my readings everyday before my next doctor appointment. Alas, I have developed an intense fear of checking my blood pressure. I have managed to take a few readings...they were under 140/90...but one reading was 162/95 and it scared the crap out of me and ever since I cant bring myself to check it. Im also terrified of my up and coming doc apt. because I know they're going to check my blood pressure. I'm taking clonidine .1mg twice every 12 hours. This has caused me depression and anxiety for the past few weeks and its affecting my life! I don't know what I'm going to do. Thanks for listening.",
            "post_id": "10090355",
            "timestamp": "1394903342",
            "user_id": "user_7867590",
            "user_link": "/personal_pages/user/7867590",
            "votes": "0"
        },
        {
            "answer": "Hi when I woke this morning  my pulse was 61 lunch time when I took my pb reading my pulse rate 142 and of cause it was high, doctors did this to me fear and anxiety of the taking my bp . 30 years ago,",
            "post_id": "10130303",
            "timestamp": "1395617514",
            "user_id": "user_3900332",
            "user_link": "/personal_pages/user/3900332",
            "votes": "0"
        },
        {
            "answer": "I am so glad i have found this site,everything i have read on here i can relate to,my bp problem started when i had my first daughter,every time  i went for my antenatel check my bloodpressure would be slightly raised,but the way the doctors and nurses spoke to me made me feel like it was something really serious this in turn made me really really anxious everytime i went for a check up and with time my bloodpressure would go from being slightly raised to very high,,viscious circle.After my daughter was born i had to have mt bloodpressure checked regularly and of course because the seed had been planted it was always high.eighteen months later i got pregnant again i was really happy to be having another baby but then the fear kicked in about the antenatel checks and the bloodpressure going up,i tries on numerous occassions to exsplan it was because i was so anxious but it didn't make any difference still had the omg comments from the medical proffession.After i had my 2nd daughter i was  left alone for a while,i then started having panick attacks and general anxiety disorder and was quite poorely with it,inthe back of my mind during all this what really sticks in my mmiind is bloodpressure checks i don't know if this caused my anxiety and panic but i'm sure it didn't help,i went for a routine doctors appointment oneday ans shhe said oh i will take your bp its not been taken for a while,i felt really really sick when she mmentioned aking my bp i told her oit would be really high because i always got really really anxious visting doctors annd having bloodpressure taken and that it would be really high cos iit always had been inthe past,she had a look into my medical records and said no your bllodpressure was ok really,but the day she took it cos of all the severe anxiety i felt it was sky high.I then had to book an appointment with the nurse for a repeat test,has you can imagine when it was  checked cos of my bp phobia it was  sky high,i now have a really good nurse and we had a good chat and i exsplaine my bp fears with her and she under stood,she advised me to get a bhome bloodpressure monitor and record my readings at home,then to take my readings to her when i had taken then at home and we would take it from there,the outcome was when i took my readings at home they were wiithin the normal range,she checked my machine was  giving accurate readinds by checking it with hers it was,she exsplained about white coat syndrome annd said thats what i have and its a recogniised condition i goo and see her every 6 mnths with my home readings and my machine so she can check its accurate,upto now it has been,she said my readings at home are normal so not to worry i go twice a year to see her annd evenn weeks  before my appointments due i get really worked up,i really wiish i could control this fear but as of yet i can't,i think its the bp phobia thats caused the anxiety and fear",
            "post_id": "11051020",
            "timestamp": "1409754607",
            "user_id": "user_10385209",
            "user_link": "/personal_pages/user/10385209",
            "votes": "0"
        },
        {
            "answer": "Hi, I only found this site a couple of days ago. It has been such a relief to see that so many people have this phobia about having their bp taken, and even when doing it theirselves at home. I am exactly the same.  I had a very traumatic experience 3 days ago at my doctors . Three days before this my bp had been 107 /71. I went for a flu jab and the nurse said she would take my blood pressure.  She said you can refuse if you like. Even though I know its high when I have it done at the doctors, I stupidly agreed to have it done. Oh my god !  Did I regret it. It shot up to 220 over 115, she kept doing it over and but it either went up higher or down a point or two. They wouldnt let me leave. They took me into another room and had the receptionist sit with me as they thought this would calm me down. It had  no effect whatsoever as I knew it wouldn't. After about an hour I had to go in and see the doctor. She immediately wrote me a prescription  for bp meds. Wants me to go back on anti depressants,  ( I have been on them within the last year)  but I dont feel depressed anymore. She also wants me to see a councilor. Anyway, I really didnt want to go on bp meds, especially the one she was giving me. I couldnt find anyone who said anything good about it. I decided to take my mukta vati  tablets that I took last year when my bp went up due to stress. I took 2 when i got home from the doctors, about 6pm. Then 2 more at 10pm. Took 2 at 6am the next morning. I have my own bp monitor and took my bp about 9 am.  Iwas getting average readings of 158/83 so my bp had come down a lot since the docs the evening before.  I took 2 more lots of 2 tablets that day.. To day I took 2 tabs about 7am. Took bp about 10 am and  it was now averaging 145/77. Took another 2 tablets at 12 midday. By 3pm my bp was averaging 132/73  and even had some in the 120's over 68. It is such a relief. I will keep taking them now and monitor every day for a while. They definately always work. I buy the Divya Mukta Varti, you can buy it on Amazon or just google it. Some of you may have heard of it already but more people with this awful problem need to know about it. It really helps with the phobia, because even though you feel stressed when taking your bp, it gradually lowers it anyway. It may take a few days longer to work with so e people but persevere because it does work.",
            "post_id": "11477519",
            "timestamp": "1415292117",
            "user_id": "user_11099305",
            "user_link": "/personal_pages/user/11099305",
            "votes": "0"
        },
        {
            "answer": "Hi IIucy, I put a post on this site yesterday, I read yours and I really felt for you. I am the same, suffered with anxiety for years. Sometimes with panic attacks.I also developed the bp phobia, and only this week had a traumatic experience at the doctors. The thing is, there is a way out of this. Maybe youve heard of Mukta Vati by now, it lowers bp amazingly and fast. Ive brought mine back down again in a few days. Even so, when I first sit down to take it I get the phobia, pounding heart etc. But even with that the first readings are not bad at all.  Then I start to relax because of that and it comes down further. Are you in USA ?   if so I see they are sold on Amazon. I have recently got some on ebay here in the UK. Hope this will be of help to you.",
            "post_id": "11482165",
            "timestamp": "1415351728",
            "user_id": "user_11099305",
            "user_link": "/personal_pages/user/11099305",
            "votes": "0"
        },
        {
            "answer": "My story is very similar to yours.  I never had fear having my BP done, but ever since i found out my BP was done at my Gp's office, i was terrified of having my BP measured.  The number would usually be high at first, and then later drops to the normal range.  I am very interested in the meditation technique that you had mentioned in your article.  can you talk a little more about it.   Thanks a lot",
            "post_id": "12379355",
            "timestamp": "1428722593",
            "user_id": "user_13144239",
            "user_link": "/personal_pages/user/13144239",
            "votes": "0"
        },
        {
            "answer": "I am hoping this helps someone.  I have suffered from anxiety for about 12 years.  I developed a fear with the blood pressure machine while pregnant with my first child and it continued through the birth of my second.I have found relief, however, from anxiety in general without using prescribed meds:1.  Take a magnesium supplement2.  Radically change your diet to one of \"clean eating.\"  It turned out that artificial sweeteners were root cause of most of my \"freak out\" episodes.  Unfortunately, they are in most products.  Look up their names so you can be familiar with them and read every label before you consume any item because they are in a lot more than just diet and low sugar items.  Sacchrin, dextrose, (anything with a \"ose\") to name just a few.  They are in jello, powdered drinks, frozen desserts, the list goes on and on.... You may have a different trigger but clean eating should help you figure out what it is.3.  Avoid caffeine and alcohol products.  I am convinced that some wines (they are not required to have an ingredient label) have BAD stuff in them.4.  Exercise regularly - it doesn't have to be crazy, but anyone can take a 30 minute walk each day.5.  Pray, pray, pray!  God is good and He is always willing to help!  \"God is our refuge and strength, an ever present help in trouble.\" Psalm 46:1It will probably take about three weeks for all of the \"bad stuff\" in your system to be gone enough that you will notice a difference in how you feel.",
            "post_id": "12681854",
            "timestamp": "1432432812",
            "user_id": "user_13996233",
            "user_link": "/personal_pages/user/13996233",
            "votes": "0"
        },
        {
            "answer": "I currently need to visit my doctor because of some abdominal pain. But my \"fear\" of getting my bp checked is what's stopping me.  My parents and my brother all have the same condition.  I know I'm very paranoid but the thought of people knowing I'm taking maintenance at my age because of high bp is really embarrassing for me.  I like the idea of the nurse distracting you from fear or whatever. I hope I could meet a nurse who would understand and act that way.  My hands are very clammy now just thinking about my bp being checked.  But I also want to get over my abdominal pains and my fears.  I'm just really glad that there are people out there who have the same fear as mine.",
            "post_id": "13091374",
            "timestamp": "1439174805",
            "user_id": "user_15213634",
            "user_link": "/personal_pages/user/15213634",
            "votes": "0"
        },
        {
            "answer": "I had it too. Normally my BP was 130/90. But when this anxiety of mine attacked me for the first time, it became 150/100 which made me freak out. I'm pretty surprised my BP surged that high, but when I took another BP the week after, it lowered to 120/70, and maybe it was because i started eating healthy and increased my physical activity.",
            "post_id": "13098105",
            "timestamp": "1439294053",
            "user_id": "user_15109217",
            "user_link": "/personal_pages/user/15109217",
            "votes": "0"
        },
        {
            "answer": "I love your post and you are dead right about everything.I have a terrible fear of BP machines and had to get mine taken this morning. It was 150/100 then went down to 150/90 after 10 minutes. not high for me.at home its 130/70. but i suppose the doctors have a duty of care so they ask me to come back in one week, history repeats itself. I dont think i will ever be able to beath the machine in hospital environment - its a learned behaviour that i just cannot change it seems.",
            "post_id": "13166025",
            "timestamp": "1440557231",
            "user_id": "user_15439782",
            "user_link": "/personal_pages/user/15439782",
            "votes": "0"
        },
        {
            "answer": "Thanks I'll try and remember these tips.I had a really bad panic attack at the dentist/Surgeons office yesterday 11-04-15 right about the time they told me they were going to take my Bp.The nurse told me as she was placing the cuff on me that it would probably be a little high. I went on to tell her I had White Coat syndrome and I knew it would be high. She looked really concerned as she said it was 180/115. Wow, that's the highest. She gave me water and I told her I would be outside getting some air. It was horrible. I came back inside and I didn't hear anything the gentle speaking surgeon said about extracting my cracked crown/tooth. All I heard was \"cadaver bone graft\" for my future tooth implant.When it was time to talk about the payment and setting up a date. I felt the pounding of my blood pressure and could not step in that small sized office space (small pantry closet size)Again, I told them I would be outside getting air. I grabbed a Coke on my way out. Called my wife and told her I loved her. Explained what happened, she reminded me to breathe. She left work to come be with me. I told her not too I would be fine. She works in another town.Walked back in to the front desk gave them y credit card for the visit. Walked back just to hand them my credit card and walked out. 5-10 min later walked back in and told them it wasn't a good time for me. I would call them tomorrow. Signed the receipt, grabbed the estimate and left.I walked to the near by water fountain to listen to the sound as I prayed to God to stay near me.I prayed, I self talked, the soothing voice from my wife helped but I still felt scared something bad (stroke) or something was going to happen.Drove to a nearby 7-11 and bought some baby asprin took two and drove home.My wife came home early rubbed my shoulders and I went to bed. She massaged my back until I went to sleep.She told me the next day (today) when she came home I looked pale white.I think it's a combination of things that triggered that horrible panic attack. Loss of sleep, stressed out due to finials at school and trying to keep up at my older age. Dehydrated from energy drinks I drank the day before during my studies.I feel embarrassed that I couldn't snapped out. It didn't matter what I told myself. I knew it was only a consultation appt. My wife says not to be embarrassed. I am not the only one that has had a panic attack in their office.This only seems to happen when it comes to my Bp being taken which is at my doctors office. Only this time it happened somewhere else and it felt way more Intense.Classes are over and I will be staying away from the drinks (energy) as well.",
            "post_id": "13433322",
            "timestamp": "1446668339",
            "user_id": "user_16282341",
            "user_link": "/personal_pages/user/16282341",
            "votes": "0"
        },
        {
            "answer": "ur awesome thanks for the suggestion..i usually have a normal bp..but one day when i got admitted in hospital for high fever.everything was normal untill..on the discharge day morning the nurse woke me up and took the reading..that showed 150/90 she was shocked and said its really high and why r u getting such high for ur age(i am 22).from that day when i go to near that machines my hearts starts pacing up..even after one month from now i face that problem..i can hear my heart beating hard face flushing and bp gets hike..i am very concerned with this because i don't know whether i am having a high bp or not..when i recently checked my bp it is showing 150.when i am explaining it to them they are laughing and taking the reading again that instant and making me more nervous..again it shows same and they confirms it i don't know what to do..but you helped me today.thank you",
            "post_id": "13494551",
            "timestamp": "1448550956",
            "user_id": "user_16500771",
            "user_link": "/personal_pages/user/16500771",
            "votes": "0"
        },
        {
            "answer": "Some of these people that work in the dentist do not know what they are doing - I have the same problem - white coat syndrome - when she strapped the little blood pressure strap on me which came from a pharmacy - I guess - and she made me hold my arm straight down - I tried to tell her no - you can't get an accurate reading holding your arm down - but she insisted - by this time I was already aggravated - then it came back way high - she said you nervous - I said yes I am - then I said that reading can not be right and I have never had a reading that high and she said let me get the nurse to take it and when she did the right way with a real blood pressure - it came back a little high not to bad but 30 to 40 points different from the other reading - Now I am a thinking - this tells you that your machine is not working correctly and you are taking blood pressure of people - I asked her - how often does this happen and she said - all the time.  So how many people have left there stressed to the max - going to their dr because of this .   I told my husband - I may go back there to get my teeth cleaned but if they even offer to take my b/p - I will leave -",
            "post_id": "13495205",
            "timestamp": "1448578062",
            "user_id": "user_16503213",
            "user_link": "/personal_pages/user/16503213",
            "votes": "0"
        },
        {
            "answer": "I have a similar issue. I had a bout of medical weirdness in Aug '15 (all is well now), but a lingering fear of BP machines has stuck with me. My BP was never high prior to this, and I've taken my BP at home for 2 weeks straight and it was always 117/78 ish.When I get anxious, the BP can get really high, like 148/88, or some other combination.Its good to know others have similar experiences.",
            "post_id": "13723395",
            "timestamp": "1457547755",
            "user_id": "user_17531055",
            "user_link": "/personal_pages/user/17531055",
            "votes": "0"
        },
        {
            "answer": "I feel the same way. Its absolutely nuts.",
            "post_id": "13723416",
            "timestamp": "1457548273",
            "user_id": "user_17531055",
            "user_link": "/personal_pages/user/17531055",
            "votes": "0"
        },
        {
            "answer": "While I havent had my BP go that high, I certainly experience the EXACT same thing you do.You are not alone.My doctor recommended I speak to a mental health professional, just in case. It's always a good idea to talk things through with someone who's trained in behavioral science.",
            "post_id": "13723460",
            "timestamp": "1457550202",
            "user_id": "user_17531055",
            "user_link": "/personal_pages/user/17531055",
            "votes": "0"
        },
        {
            "answer": "Sometimes, though, when I take my BP at home, especially if i havent done it in weeks, i get anxious until I get used to it.",
            "post_id": "13723475",
            "timestamp": "1457550515",
            "user_id": "user_17531055",
            "user_link": "/personal_pages/user/17531055",
            "votes": "0"
        },
        {
            "answer": "I am so happy to have found this thread. I had high blood pressure issues during my pregnancy which cleared up after giving birth but ever since I have a severe anxiety when I even see a bp machine. I have a home bp monitor which has really helped me. My fear now though is when someone else, other than myself, is taking it. I'm scared of it being high, and what they will say. Has anyone dealt with this? Do you say something to the nurse prior to them taking it? Has that helped?I need to go a chiropractor but am avoiding doing so because I worry they are going to take my bp.",
            "post_id": "13725594",
            "timestamp": "1457642939",
            "user_id": "user_17541257",
            "user_link": "/personal_pages/user/17541257",
            "votes": "0"
        },
        {
            "answer": "SO SO glad to find this thread. I normally have 120/80 - all my life. I am 53 now. But I just moved to the burbs from the city and gained 15 lbs and stopped walking 5 miles a day. So my BP went up. It was 143/90 in the CVS 2 weeks ago. Then I had it taken at the Dr.'s office last week and it was 150/100, then I took it at home while so nervous and it was even up to 180/120! Crazy. I am now trying to avoid meds, exercise like crazy, cut out salt, and stay away from that BP monitor! It is the devil. I have BP meds with me but I just think it's the fear of that stupid little machine that is causing this.",
            "post_id": "13746489",
            "timestamp": "1458668599",
            "user_id": "user_17642996",
            "user_link": "/personal_pages/user/17642996",
            "votes": "0"
        },
        {
            "answer": "sooooo i have just discovered that i get anxious as **** when i go in for the bp reading even when i'am in the waiting room sweaty palms and sweat from pretty much everywhere just comes on. I'am currently studying para-medicine and have recently had my fitness test with them my first reading was 163/84 with a HR of 65 fair to say i was so nervous it feels like its a test and i go into survival mode and want to do whatever it takes to win (or pass)  after 2 minutes we got it down to 142/80 which is still some what higher than normal but they allow for a \"stressful environment\". My only advice is which i'am  now taking on board is yep fear of a bp reading is definitely a thing and just go  in there happy and have a laugh because lets face it we are never gonna get 120/80 its just not gonna happen unless were inside our own home and our mate does our bp reading for us anywhoo thats my rant :)",
            "post_id": "13771989",
            "timestamp": "1459920562",
            "user_id": "user_17769099",
            "user_link": "/personal_pages/user/17769099",
            "votes": "0"
        },
        {
            "answer": "I have extremely bad white coat syndrome.  I lived in another state for 30+ years and my doctors (cardiologist, nephrologist, urologist and primary) all worked with me on it.  I found a BP monitor that had a printer so I could print out my home readings.  I would take them to my doctor visits and they did not require that my BP be taken at the office.  About once a year, I brought in my monitor and they took my BP in one arm and used my BP monitor for the other arm to make sure my machine was working properly.  I recently moved to a new state and my husband and I chose a doctor (much to our dismay) that would not even discuss the type of arrangements I had with my other doctors of 30+ years.   Since I was short on meds, I had to go through the visit.  My BP reading when they took it was 210/132 and she did not say a word about it being that high even with white coat syndrome.  My other doctors, on my first visit to them, always asked more questions and delved into the extremely high blood pressure readings that they get.  My normal blood pressure at home is 115/60 to 125/70.This doctor was very rude to both my husband and to me.  Her staff mirrored her attitude.  Needless to say we are in the process of finding a new doctor.  We are not people who are difficult with doctors and have had the same doctors for many years.  Two of the doctors have become friends and have been to our home and we have interacted socially.My white coat syndrome is not only exhausting to me, but a threat to my well being since I have an abdominal aneurysm and only one kidney.   I sympathize with all who have this same reaction to blood pressure.  I have tried hypnotherapy, self-hypnosis, meditation, etc. and have complete control over the rest of my life, but was never able to conquer this problem.If you can find compassionate doctors who really care about you, they will work with you so that you suffer the minimum stress.",
            "post_id": "13773294",
            "timestamp": "1459985702",
            "user_id": "user_17776161",
            "user_link": "/personal_pages/user/17776161",
            "votes": "0"
        },
        {
            "answer": "I think it might have to do with low self esteem, are you afraid of what others might think, do you think you are somehow odd and others will think you are strange or somehow think less of you?  If so change it, be courageous if it's high just say I've been like this all  my lifelaugh, say I will take my Blood pressure at home and if need so I'll bring it in and let you see my readings.",
            "post_id": "14070131",
            "timestamp": "1480776857",
            "user_id": "user_19601005",
            "user_link": "/personal_pages/user/19601005",
            "votes": "0"
        },
        {
            "answer": "I've been writing out what goes into my mind on a piece of paper, and basically it's very self conscious, and thinking of what others might think, a kid thing that has to do with not feeling I'm as good as other's, this has been a part of me since childhood, it's like self punishment.  So the answer to my situation is at home by myself readings, and bring them to the doctor, also too the cuff is very uncomfortable, I really dislike it, so what I do is pray, meditation is very relaxing, and laugh, knowing I am a good person no matter what, and being anxious for what ever reasons, plays no role in how beautiful of a person I am, and now I realize there are many folks out there that hate blood pressure readings too, so knowing I am not alone, I am perfectly normal, makes this a lot lighter, and much more laughable.:):)",
            "post_id": "14070143",
            "timestamp": "1480777906",
            "user_id": "user_19601005",
            "user_link": "/personal_pages/user/19601005",
            "votes": "0"
        },
        {
            "answer": "Hello Everyone,I have a friend who has the same problem.I've found the \"fitness tracker\" wristband \"Riversong wave BP\" that takes the blood pressure every hour during the night : it doesn't squeeze your wrist, you don't feel anything when it checks your blood pressure.You can also check your blood pressure during the day but manually...It also check your heart rate. It's also a pedometer...I've compared the results with a medical machine and the results are accurate.When you read comments about this product on internet, you will see that some people are happy and some people are disappointed…If you use this wristband, check the results with a real medical machine (you can ask a friend to do it for you).I don't work for the brand \"Riversong\", I just hope that this information will help you…Good luck.",
            "post_id": "14208488",
            "timestamp": "1498585467",
            "user_id": "user_20465285",
            "user_link": "/personal_pages/user/20465285",
            "votes": "0"
        },
        {
            "answer": "My dear God. I'm not alone. I thought this was something my mom passed me. She also had higher than usual BP when going to the doctor, but I can see that a lot of people suffer from it. In fact, I'm pretty sure I don't suffer from very high BP. Is just plain and simple anxiety. I'm 51, and the last time I went to the cardiologist, my BP was 160/90, and HR was around 140. The doctor prescribed Diovan 320mg, and asked me to keep measuring my HR, and advice him if it came lower. Just walking out of the hospital, it went down to 90, and at home, it was steady around 75.A couple weeks later, I started feeling weird, lacking strength, feeling feverish, not even been able to touch my wife. I called the doctor, and told me to go down to Diovan 160mg. I felt better the next day. It's been 6 months since, and I haven't had the courage to measure my BP again. I plan to get the wrist machine, and see if I can manage to reduce the anxiety and measure it, at least a couple times a week.But that's not all I've done for my health. I reduced salt consumption to a minimum, cut egg intake in half, I eat salmon 3-4 times a week, no pork, less bread, zero rice, breakfast is 1 boiled egg and a cup of cereal with some fruit and liquid yogurt, lunch is broiled chicken, or a piece of stake (no salt), salad and sometimes lentils or beans, and jello. Dinner is usually a big plate of salad with only olive oil, sometimes avocado and zucchini, and a piece of either salmon or chicken breast, with a few drops of olive oil in a hot dry pan. And a couple apples. That's all. I also walk fast for an hour 3-4 times a week.I also eliminated sodas completely, I only drink water and wine ;) I also eat raw carrots or apples for afternoon snack, or peanuts and almonds.I had a blood test a few weeks before going to the doctor last December, and my cholesterol was a bit higher than the normal level, but just a tad bit. I imagine that by now it should be normalized, with the dieting I'm doing. Tryglicerides were about normal.So, as I said, my plan is to get the wrist machine, and have another set of blood tests on October or November, and go visit my doctor again the first week of December.Now I know that my fear is real, and is the main cause of my higher than usual BP, since I don't have any symptoms whatsoever. No head aches, no nothing. My only symptoms started once I started taking the Diovan, and I've read it does get side effects, like increased sensitivity to heat. And sadly I live in a very hot country, so the weather doesn't help. That could be another cause of what I feel.I was particularly relieved when I read nurse Greenlydia post about relaxing and stop reading \"10 ways to die from high BP\".In fact since I had my BP taken at work last year, and it was obviously high, there is a record of that in my file, so next week there is a \"High BP awareness workshop\" and there will be a nutritionist and a doctor there, and I was \"required\" to attend. But I plan not to, one because it freaks me out, and I know they will measure everyone's BP. And secondly, because I don't need to read about how bad high BP is to your health, and what can happen to you if you don't take care of it. I KNOW is bad, for Christ's sake, and that's why I went to the doctor, that is why I'm dieting, and why I'm exercising. I don't mind the lecture about nutrition, but I'm sure I can find the same information on a google search.Anyway, thanks again for this thread. It really made me feel good, supported and understood. I'm not alone. Yipeeee!!!! Love you guys and gals.",
            "post_id": "14228996",
            "timestamp": "1501612785",
            "user_id": "user_20599449",
            "user_link": "/personal_pages/user/20599449",
            "votes": "0"
        }
    ],
    "post_id": "3532801",
    "question": "I know I am not the only one who absolutely freaks out when having my blood pressure taken.  Every time I go to the Dr's office, they always comment on how high my pulse and blood pressure are (last week when I went it was 127/92 and pulse of 133!)  Ha...and those numbers arent even unusual for me!  I know the pulse is high, but I don't worry about it as much just because I take it frequently at home now, and know that it is usually in the 80's when I'm at home.  But the blood pressure...ugh!  I am just convinced that I am going to have a really high reading sometime and that I'm going to just kill over.  And the docs and nurses make it worse by always saying \"well, your numbers are a little too high for your age, even though you are nervous\" (I just turned 30).So...has anyone successfully conquered their fear of having their blood pressure taken?  How did you do it?  I really want to get over this. I mean, I feel like i try to do everything right...I eat fairly well, I'm definitely not overweight, dont smoke or drink, somewhat active...the only thing I have trouble with is my anxiety.  Ugh...this is frustrating!",
    "timestamp": "1224077310",
    "title": "Conquering fear of blood pressure machines?",
    "user_id": "user_446896",
    "user_link": "/personal_pages/user/446896"
}