{
    "answers": [
        {
            "answer": "SMJMEKG--I READ UR POST AN OMG...THE NERVE PEOPLE HAVE.....U ALREADY HAVE ENOUGH ON UR PLATE WITHOUT SOMEONE TRYING TO ADD MORE...TAKE IT EASY DONT LET THE DEVIL GET TO U...HE WILL TRY IN EVERY WAY..",
            "post_id": "5343140",
            "timestamp": "1265331094",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Geez! I can't keep up with you ladies. The threads shoot from 0 to 60 quicker than a car! LOLIt's good we're all supporting each other. I love reading about everyone's status, so keep up the good work! SSBD!",
            "post_id": "5343156",
            "timestamp": "1265331480",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "Reposting for Amanda....I wasn't really young when I got married, I was 21, but not everyone agreed. My husband and went to the same place for our AIT (Army's job school). I used to go out to the bar on the weekends with my friends, but decided to go alone one night when they were at the hotel. A guy my husband was sitting with came up to me and asked me to join their table, and I agreed. My husband barely said a word to me that night, but I knew I had to see him again, I didn't know why and I couldn't explain it I just had to. So I looked for him everywhere I went and found him at the bar again, I stared at him ALL night, and I don't normally do that I'm very old fashioned, you know, guy asks the girl out, guy calls the girl, guy makes the first move....so I went outside to smoke, and he came out after, we talked for a few minutes and then he asked for my number, we talked every day after that. A couple weeks later I stayed at a hotel with my friend and he stayed at the same hotel with his friend. We woke up the next morning went to eat at a bagel place, my at the time boyfriend and I were looking at real estate magazines and he said \"we should just get married and buy one of these houses\" In the back of my head I was thinking \"that sounds like a good idea\". So later that day he told me he was kind of serious. Not too long after he sent an e-mail asking my parents if he could marry me, and soon after that we got married in a courthouse. Now...I was engaged to a guy for a year and a half before I joined the Army, I left him just after basic training, and met my husband a few weeks later. My husband and I had known each other almost three months, and dated just over two months before we got married. I think you can see where people didn't exactly agree, and you can imagine some of their replies when we told them two months later that I was pregnant. (We got the whole \"you could have told me when you got married\") BUT I got pregnant AFTER we got married. Anyways, my husband and I have been married for two and a half years next month. But I know my husband and I were meant to be. When I was engaged before my husband and I met, my ex and I picked a date...Sept 13, 2007. This was before I even thought of joining the Army...Guess what...that's the day I got married, because that's the day I graduated AIT, I knew I'd get married that day, I just didn't know to who. So that's my story. I wasn't that young, but people did disagree...BUT~~I wouldn't change it for the world!!!",
            "post_id": "5343174",
            "timestamp": "1265331808",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "Thanks. I try not to let it get to me, but it's hard not to sometimes.",
            "post_id": "5343176",
            "timestamp": "1265331835",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "What a sweet story...it's like you guys were meant to be for sure!!",
            "post_id": "5343455",
            "timestamp": "1265336713",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "IZTTC--LMAO AT 0-60 FASTA THAN A CAR",
            "post_id": "5343511",
            "timestamp": "1265337563",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "OMG so re-tested or what????????",
            "post_id": "5343600",
            "timestamp": "1265338919",
            "user_id": "user_992128",
            "user_link": "/personal_pages/user/992128",
            "votes": "0"
        },
        {
            "answer": "ARHhhhhh I just saw pic, thinking I must have missed something. CONGRATULATIONS SWEETHEART!!!! So exciting, are you heading to dr for first app etc? CONGRATS CONGRATS CONGRATS!!!!!!! x",
            "post_id": "5343610",
            "timestamp": "1265339061",
            "user_id": "user_992128",
            "user_link": "/personal_pages/user/992128",
            "votes": "0"
        },
        {
            "answer": "Thanks...I knew we were. I had doubts before I got married, but that was just because of past experiences with A-holes. But I finally realized that DH was NOTHING like anyone else I've ever been with. I had to let the past go.",
            "post_id": "5343775",
            "timestamp": "1265342018",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "awwww, that story was cute. Im glad you did decide to marry him instead of running like many women do. God works in mysterious days proof is the wedding date thing. Thats amazing. Im about to be 20 and he's about to be 22. We decided to get married at a court house (just the 2 of us) first, then in a couple yrs (when we have the money) we'll have a big wedding with everyone. What was it like to get married in a court house?heatherm4-I looked at the pic too. I didnt even know you took a test. Sorry, i havent been reading everything. CONGRATULATIONS!!! I hope it sticks and you have a wonderful and enjoyable pregnancy!I guess I have alot of reading to do!WERE IS EVERYONE IN THEIR CYCLES???",
            "post_id": "5344072",
            "timestamp": "1265351449",
            "user_id": "user_1090903",
            "user_link": "/personal_pages/user/1090903",
            "votes": "0"
        },
        {
            "answer": "It wasn't anything big, we went into the courtroom, there were two people in there as witnesses that worked at the courthouse...we didn't even have rings yet so the judge skipped that part of the vows...but we said our vows, kissed, signed the papers and went on our happy way. We had to pay $50 for the certificate/license, we got it the day we got married. The nice thing is the judge that was there doesn't normally do military weddings since a lot of them end in divorce, but she did ours! I was leaving for FL the next day, so I think that helped in her decision, or she just felt like we would make it! They even asked if what kind of vows we wanted, and googled wedding vows to find different types, we just used the regular old \"we are gathered here today, do you take this man/woman, you may now kiss the bride\"...we're also planning on having an actual ceremony one day, it's funny cause DS will probably be old enough to be our ring bearer.",
            "post_id": "5344111",
            "timestamp": "1265353338",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "OMG gurls11 dpo today soo excited! and scared adn eveyrhtign else. no symptoms though kinda loosing hope but not! beleive that little bean is there!",
            "post_id": "5344221",
            "timestamp": "1265357018",
            "user_id": "user_1168353",
            "user_link": "/personal_pages/user/1168353",
            "votes": "0"
        },
        {
            "answer": "I am on CD 28, 11 DPO.  Crampy here and there and my ta-ta's are still itchy here and there, and last night I could've sworn that they looked different, but could be my mind playing tricks on me. I won't test again until after Mon when AF should be due.  I got a BFN on 8 DPO.SMJMEKG- your story reminds me of my parents. My dad was in the navy at the time and stationed here in Charleston, South Carolina. They were mutual friends to another couple and they went on a double date. My mom said he barely talked and didn't think that he was even interested. 3 dates later, they were married and now, almost 37 years later, are still going strong :)",
            "post_id": "5345380",
            "timestamp": "1265388701",
            "user_id": "user_927769",
            "user_link": "/personal_pages/user/927769",
            "votes": "0"
        },
        {
            "answer": "Thanks gals...I'm getting super excited. We told my mom and step-dad last night. I wanted to wait until Valentines day but I was bursting!! LOL They're over the moon! My step-dad gave me a bunch of advice...he doesn't have kids of his own and hasn't gone through a pregnancy with anyone but his last part was \"make sure you wear slippers\" LOL Made me laugh! Out of all the pieces of advice that was one of them!!Aimz- I can't get in the docs until next week on the 12th. I was like \"WHAT? a whole week!!\" Dang!! LOL more waiting...that's all this is!! But she told me to call on Tues and see if they can slip me in there! Fingers crossed I can!! I'm anxious to get some blood done to check my thyroid and make sure the pills I'm on are going to be ok.",
            "post_id": "5345448",
            "timestamp": "1265389616",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "I am at CD4 (well the end of it because its 10:30pm here).  I decided to try on ovulation test this month.  Has anybody ever tried the brand Answer??  If so was it reliable??  I hate all this waiting!!!  Good luck to everybody this month.",
            "post_id": "5347409",
            "timestamp": "1265427535",
            "user_id": "user_1186413",
            "user_link": "/personal_pages/user/1186413",
            "votes": "0"
        },
        {
            "answer": "CD 26 AND COUNTING. FEW MORE DAYS. PLEASE GOD LET THIS BE MY MONTH. ONLY HAD SORE BREAST WELL REALLY SORE. MORE THEN NORMAL, AND THATS IT, OTHER THEN BEING VERY TIRED.",
            "post_id": "5347425",
            "timestamp": "1265427991",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Thought I'd join in. For those of you who don't know, I have 2 healthy daughters ages 10 and 7. No complications what so ever. DH and I decided to try again after 7 yrs. I had been on BC for that long so 3 months of trying, we go pregnant. But on Jan 16th had a natural m/c at 4wks and 3 days. My ob/gyn said to wait a cycle but I wasn't too emotional and was ready to try again right away. If my body isn't ready right after than it won't let it happen. I did ovulate this cycle. I also ate yams. If you know the story behind it then you know why I ate them. Wanted to give myself any chance to ovulate. I did ovulate. I'm currently on 9DPO. On 6DPO I had cramping/pain/twinges of and on since. Last cycle I had the same thing at 6 DPO and I believe that's when implantation was. I mean I was able to get a + HPT at 11 DPO. So I'm hoping these cramps will result to the same thing(+ HPT). My bb's started tingling on top yesterday (8 DPO). I will probably test on Monday. I also go to see the high risk docs on Monday also for a consultation. Maybe I can convince them to do blood test. I will be considered high risk because I was diagnosed with a certain type of arthritis 3 yrs ago and they say I would be more at risk of having preeclampsia, kidney problems, gestational diabetes because I have to take prednisone instead of my normal arthritis med.(I'm a nurse also) I have not ever experienced any of these issues though. My OB just wants to take precautions which I don't mind.My husband and I have been together since I was 18 and he 17. We got married at 22 and 21.Have had our ups and downs but still going strong after being together twelve yrs and married for 8. And many people doubted us.Huge congrats to all the BFP's! Its so nice to see there is hope for a happy ending.Thanks for reading my chapter book. Lol",
            "post_id": "5347786",
            "timestamp": "1265437567",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Oohhh baby dust ladies....it's great to see new people pop up all the time!! Can anyone tell me...is a sore throat in the mornings common in early pregnancy? Mine has killed for the last 3 mornings but it goes away after a bit.",
            "post_id": "5348180",
            "timestamp": "1265462111",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "HEATHER--I HEAR OF ALOT OF WOMEN GETTING SORE THROATS..MAINLY FLU LIKE SYMPS",
            "post_id": "5348469",
            "timestamp": "1265470561",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Heather-- that happens from not drinking enough but when we are dead asleep then it happens. It happens to me nearly every morning if you can keep it down then drink something seriously cold and it will go away faster.",
            "post_id": "5348625",
            "timestamp": "1265473599",
            "user_id": "user_796506",
            "user_link": "/personal_pages/user/796506",
            "votes": "0"
        },
        {
            "answer": "Or anyone else who just recently got a BFP--Do you guys have veiny breasts? I was just wondering if that's ALWAYS a symptom? So like if you don't have it, does it mean you're probably not pregnant?",
            "post_id": "5349742",
            "timestamp": "1265498463",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "I'm CD25 and I had a headache all day and still feeling hot. I have creamy CM and didn't have much of an appetite today except when I first woke up, I had been craving a donut and a brownie since last night so at 7:30 this morning my DH finally got me one. LOL! He asked me, \"when are you due for your period? you're having weird cravings!\"",
            "post_id": "5349747",
            "timestamp": "1265498625",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "I am checking in, and going to be sending you all lots and lots od SSSSBBBBDDDD....as for me almost cd 28, 4 more days. Please god let this be it for me.",
            "post_id": "5350019",
            "timestamp": "1265505054",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Angella, looks like we're only 2 days apart. I hope this is it for both of us. SSBD!",
            "post_id": "5350025",
            "timestamp": "1265505209",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "So another screwed up cycle for me. Should be 19 dpo and no AF and another neg first response yesterday :( Apparently I didnt ovulate when I thought.......Soooooooooooooo frustrating!!!",
            "post_id": "5350984",
            "timestamp": "1265548042",
            "user_id": "user_1026926",
            "user_link": "/personal_pages/user/1026926",
            "votes": "0"
        },
        {
            "answer": "I normally have very prominant veins on my chest and my breasts so I couldn't really go by that. It just looks normal to me. I think that part is different for everyone. I hope you get a bfp though. When you going to test?Thanks Nickie...I talked to a pharmacist and he said to drink hot water with lemon and tea and that should help too.SSBD...I hope to see more bfps!!",
            "post_id": "5351958",
            "timestamp": "1265570857",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "So tired today. I think I may test for the heck of it. Just pray for me okay everyone. I'm at work and going to do it on my lunch break in 2 hours I will update soon as I know.",
            "post_id": "5351976",
            "timestamp": "1265571152",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Heather-- you are more than welcome.. alot of it I think is from being slightly dehydrated because we are peeing so much throughout the night with our new found pregnancies... that and being pregnant really does deplete the ability to stay hydrated. I drink tea in the mornings also but without the lemon bc that seems that it dehydrates me more.Angella-- I really hope that you are pregnant :) I will be waiting for your update :)",
            "post_id": "5352159",
            "timestamp": "1265574742",
            "user_id": "user_796506",
            "user_link": "/personal_pages/user/796506",
            "votes": "0"
        },
        {
            "answer": "angella---im wishing bfp....breath i will stalk u in 2 hrs and 20 mins...lol",
            "post_id": "5352173",
            "timestamp": "1265575085",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Bfn...I'm so sad.",
            "post_id": "5352414",
            "timestamp": "1265579902",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "dont be sad  u will get it if it makes u feel better i took a hpt and bfn...we are still together",
            "post_id": "5352429",
            "timestamp": "1265580418",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Angella don't get too down on yourself... wait a few more days or until af is due and then test again!",
            "post_id": "5352459",
            "timestamp": "1265581183",
            "user_id": "user_796506",
            "user_link": "/personal_pages/user/796506",
            "votes": "0"
        },
        {
            "answer": "I'm going to test on Wed I think- that's when AF is due.Faith- I bought those new 6 days sooner First Response tests. Let's see how they are.",
            "post_id": "5352917",
            "timestamp": "1265594476",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "IZTTC--WE ARE DO ON THE SAME DAY IM LIKE 10DPO..I THINK...LET ME KNOW HOW GOOD THEY ARE",
            "post_id": "5352949",
            "timestamp": "1265595349",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Faith- LOL, I'll probably think they're the greatest thing in the world if they give me a BFP. Let's hope we both get them! SSBDAnd Heather- forgot to say thanks for answering my question. I guess even if my breasts aren't veiny, hopefully I could still be pregnant.",
            "post_id": "5352956",
            "timestamp": "1265595524",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "Okay, i was at work when I tested. But really I am not considered late until tuesday. So I am praying I am to early. And I wanted to ask. On the test window the control window had pink color to it, but the actual test part was just like a white line, it was not colorful at all. So I am thinking maybe their was an issue with it. It was a equat test from walmart. I think that is their brand. So I don't know..",
            "post_id": "5353277",
            "timestamp": "1265603985",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "OKay, I am not mad. i looked up online about the test, and this is what i found out. So maybe i am not out of the race.Because you want to know at the earliest possible time if you are pregnant or not I highly recommend getting the all white Equate brand from WalMart. They for some reason, changed their tests and it may be hard to find an all white one. If you see and Equate test that has a purple cap do not buy it!!! The new Equate with the purple cap measure 100mIU. If you can't find the Equate then I would suggest that you get one of the tests that measures 25mIU. The earliest that you can test is 12 days past ovulation and if you do not get what you think should be the correct result then test again 2 days later at 14 days past ovulation. If you have a 28 day cycle and are very regular then you most likely ovulate on day 14 or 15 of your cycle and can test as close as two days before your period is due. If your cycle is irregular then it is much harder to tell when or even if you ovulated. This is one of the reasons that I like charting so much. You know what is going on with your body.I took the one with the purple top. So god i hope this is correct",
            "post_id": "5353318",
            "timestamp": "1265604841",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Heather - Congrats i haven't been on this over the weekend really pleased for you.I'm now on CD11 and have been ttc since last wednesday/thursday only because my consultant told me to bed at least 3 times a week in a month to give me more of a chance of conceiving.  I've also given up the ovulation kits even though i vaguely know when i'm ovulating due to the pains and cramps i get.  Will keep you all updated when i have to go in for my laparoscopy.Best of luck to all you ladies ttc and a happy, healthy 9 months for those who have just gotten a BFP!!!",
            "post_id": "5353599",
            "timestamp": "1265617095",
            "user_id": "user_505857",
            "user_link": "/personal_pages/user/505857",
            "votes": "0"
        },
        {
            "answer": "well going a little crazy cockoo here girls tomorro is 14dpo! and well at the moment there are no signs of af... weird little cramps in my groin area today and increased Cm for this time of my cycle. DH says boobs look bigger i dont see it. know that the nips have starte burning in the post hour or so.. wondering? oh last hting the bloated ness is there but noraml for AF so not really coutning it as anything differ?well let me knwo your comments pls?",
            "post_id": "5353797",
            "timestamp": "1265628633",
            "user_id": "user_1168353",
            "user_link": "/personal_pages/user/1168353",
            "votes": "0"
        },
        {
            "answer": "CD 3 for me. AF showed a little earlier than normal.   Nice thing is that when its time for me to ovulate, DH and I will be on vacation together :)SSBD to everyone!",
            "post_id": "5354301",
            "timestamp": "1265641003",
            "user_id": "user_927769",
            "user_link": "/personal_pages/user/927769",
            "votes": "0"
        },
        {
            "answer": "Wow I stopped getting e-mails and popped in to check on everyone, who has gotten BFP?Baby dust!!",
            "post_id": "5354312",
            "timestamp": "1265641150",
            "user_id": "user_395769",
            "user_link": "/personal_pages/user/395769",
            "votes": "0"
        },
        {
            "answer": "Ahh I hope to see more bfps...I come on here and I get soo excited!! LOLThanks Nickie....I talked to a pharmacist and he told me to drink hot water with lemon and honey too. I think it's some sort of bug going around on top of dry air. I went to work and one of the kids voice was totally gone...I could see that happening to me if this persists!! Also it's been super cold so the air is really dry...I'm trying everything I can!Gailybaby- you have patience girl!! LOL I would have already tested by now. I always told myself I would wait until af is due but I always ended up testing early.Angella- Try try again!!",
            "post_id": "5354315",
            "timestamp": "1265641219",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "Well I tested this morning. BFN. I'm on CD 24 of a 28 day cycle and 11 DPO. I don't hink its going to happen this cycle. The little cramps and twinges since 6 DPO were probably nothing. My boobs have been tingling alittle on top. Not on the side like last cycle when I ended up m/c ing.To all who have not gotten their BFP baby dust and a special SSBD to Gailybaby",
            "post_id": "5355796",
            "timestamp": "1265665689",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Hey ladies, been a few days...not been in the best of moods lately. I'm apparently still needing to learn about a-hole people in this world. Anyways, CD 6 getting ready to start BDing every other day or just a few days in a row around o day. DH is leaving for two weeks on the 24th so it's gonna be a really long TWW this time around...SSBD to everyone!",
            "post_id": "5356228",
            "timestamp": "1265674797",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "I was feeling really queezy to my stomach all day today, nothing like anything I ever feel before AF, so I tested this evenning and got a BFN :-( That's what I get for being impatient, I guess, lol.",
            "post_id": "5356248",
            "timestamp": "1265675305",
            "user_id": "user_1042365",
            "user_link": "/personal_pages/user/1042365",
            "votes": "0"
        },
        {
            "answer": "I hope you get the opposite of me and see no AF!!! I was only 1-2 days late this time, I decided no charting this month, just going to BD.",
            "post_id": "5356404",
            "timestamp": "1265677876",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "BD like a crazy woman!!!!!!!!!!!!!! Ooooh that would be a long tww for sure!! HOpe the time passes fast!SSBD to ya'll!!",
            "post_id": "5356515",
            "timestamp": "1265679039",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "I forgot if I said congrats to you yet or not, so CONGRATS!!! How often did you BD?",
            "post_id": "5356585",
            "timestamp": "1265680047",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "TO ALL WAITIING ON AF TO ARRIVEE..PRAY AND HAVE FAITH...BABY DUST TO ALL....ANGELLA---THATS RIGHT UR NOT OUT......KEEP THAT ATTITUDE",
            "post_id": "5356637",
            "timestamp": "1265681016",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "thankyou faith,I tested agian, and I got a BFN. So i hopr i got a false negative. but this whole ttc does not seem to be on my side, So I an going to get some OPK this month., I think.",
            "post_id": "5357119",
            "timestamp": "1265690777",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Sorry you got another BFN. Don't give up hope until AF shows!",
            "post_id": "5357144",
            "timestamp": "1265691235",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "morning gurls!well its 14dpo and there is so far no sign. i have little pulling feellings ont he side of my abdomen and thats it... kinda wishing praying holidng thumbs all the above! ahhhh this day can not go fast enough!heather thanks.. the patience has taking so meny very strict talks wiht myself !!!!pointed finger int he mirror! you will not test today wait and see! lol:)",
            "post_id": "5357254",
            "timestamp": "1265695122",
            "user_id": "user_1168353",
            "user_link": "/personal_pages/user/1168353",
            "votes": "0"
        },
        {
            "answer": "Hey Ladies. HE PROPOSED!!! Caight me off guard because i really thought it would happen on Valentines Day or in April but it happened today. Im sooo happy. Im glad it was today because if it did happen on Valentines Day then it wouldnt have been a surprise. We've been talking and now it looks like we're getting married alot sooner; within the next couple weeks. Wow, I know!!!! Pray for us please. We're both really happy and no matter what, we'll keep or Faith in God. Thank you all so much for everything ( Sorry if im emotional right now but this is a real emotional moment for me).Congratulations for everyone with BFP\"S!!!! For everyone who recently got AF, please dont give up! Every month you see AF willl make you every more happier when you get a BFP!!!! God Bless you all!!!!",
            "post_id": "5357428",
            "timestamp": "1265703321",
            "user_id": "user_1090903",
            "user_link": "/personal_pages/user/1090903",
            "votes": "0"
        },
        {
            "answer": "wow~!!! That is soo cool! CONGRATS!!!!! :)",
            "post_id": "5357470",
            "timestamp": "1265706039",
            "user_id": "user_1168353",
            "user_link": "/personal_pages/user/1168353",
            "votes": "0"
        },
        {
            "answer": "Congrats Amanda that I'm glad he caught you off gaurd it is always better when you're not expecting it!!7yrs later - sorry for your loss, your story sounds like mine, DH and I have been together since 15-16 and got married when we were 22-23 and now have been married a year. We had a loss due to a blighed ovum which ended in a d&c June 1st 2009 ironically I'm 22 wks pregnant now and due June 13th. How weird would that be if I had the baby June 1st of this year?",
            "post_id": "5357715",
            "timestamp": "1265718956",
            "user_id": "user_395769",
            "user_link": "/personal_pages/user/395769",
            "votes": "0"
        },
        {
            "answer": "Thank you. Congratulations on your successful pregnancy. Yea that would be ironic if you had the baby on june 1st. But that could be a blessing.",
            "post_id": "5358068",
            "timestamp": "1265726835",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "CD12 and still ttc very hard, no unusual symptoms.  Sex is painful yet again when we BD though i'm getting pretty used to that now, my partners got to watch how far and hard he penetrates (Sorry TMI) or i'm doubled over in pain, this is when i know i'm ovulating",
            "post_id": "5358096",
            "timestamp": "1265727312",
            "user_id": "user_505857",
            "user_link": "/personal_pages/user/505857",
            "votes": "0"
        },
        {
            "answer": "AMANDA--CONGRATS...THATS AS BIG AS A BFP IN MY BOOK....NOW WATCH UR NEXT SURPRISE WILL BE A BFP....GILLIAN--HOLD ON GURL I KNOW WHAT U MEAN",
            "post_id": "5358311",
            "timestamp": "1265730681",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "Smj- Dh and I would BD every other day from CD10 to CD17 I think. A couple of those times I also laid down right away, put undies back on and put a pillow under my hips for about a half hour. I also didn't get up to go to the washroom unless I really had to.Amanda- CONGRATS! OMG...did you say a couple weeks?? Ahh planning a wedding within a couple of weeks?! Crazy woman!! That's why we went to Jamaica to get married....soooo less stressful and sooo worth it!Silvercheer- I have the same thing. I miscarried Oct 9th and I'm due Oct 15th! I thought it would be amazing if it was the same day. Kind of weird already that I'm due in Oct.",
            "post_id": "5358724",
            "timestamp": "1265738134",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "That is funny, God works in mysterious ways!",
            "post_id": "5358771",
            "timestamp": "1265738936",
            "user_id": "user_395769",
            "user_link": "/personal_pages/user/395769",
            "votes": "0"
        },
        {
            "answer": "SMJ--I WOULD SUGGEST BD EVERY OTHER NIGHT AND AFTER UR DONE LEAVE FATHER JOHNSON INSIDE MARY ROSE FOR LIKE 5 MINS..JUST LAY THERE...",
            "post_id": "5359796",
            "timestamp": "1265755595",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        },
        {
            "answer": "just checking in. Af is due tomorrow. We shall see.I wonder if anyone has ever got a BFN and then a BFP.I remember when I was younger, I got pregnate very young. Well I didnt even know I was, my mother mad me take a test, because she found out I had sex for the first time. Anyway, I tested two day in a row, all BFN. Then the third day I got a BFP. I was young but dont remember much ether. But needless to say, I hope this time this happens to me.",
            "post_id": "5359881",
            "timestamp": "1265757309",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "Thank You all for the Congrats!!!!Faith- I hope a bfp is in my near future but Im not so lucky with the Jobs. Chicago is one of the worse places to work. No jobs at all and they just cut over 2000 jobs this week. My concern now is working. Im playing for a miracle!!!Heatherm4- LOL, no we're not having a wedding until we have the money to have the big wedding that we want which probably wouldnt be for a couple years since we're trying to move out of Chicago this year. I would be crazy if i tried to plan a wedding in a couple weeks lol..... Jamaica, that sounds very nice. How was it out there?SLIVERCHEER- Hey, how everything going???",
            "post_id": "5359937",
            "timestamp": "1265758198",
            "user_id": "user_1090903",
            "user_link": "/personal_pages/user/1090903",
            "votes": "0"
        },
        {
            "answer": "I just got a BFP on Jan 15 and I must have taken 10 PG tests before then all BFN. It wasn't until the morning of my expected period that I used a FRER digital and it said yes+.  I even took a test the afternoon of the 14th with a BFN and then the morning of the 15th BFP. So it is definitely possible to get a BFN and then a BFP.",
            "post_id": "5359960",
            "timestamp": "1265758549",
            "user_id": "user_1158687",
            "user_link": "/personal_pages/user/1158687",
            "votes": "0"
        },
        {
            "answer": "Congratulations!!!!!  Now just to get that BFP!!!",
            "post_id": "5360006",
            "timestamp": "1265759496",
            "user_id": "user_1186413",
            "user_link": "/personal_pages/user/1186413",
            "votes": "0"
        },
        {
            "answer": "OMG!!! I love it! Father Johnson and Mary Rose...LOL!!! But that is a good idea, except I'm usually on top, and after a minute it gravity takes affect...what goes up must come down, and we've got black silk sheets! I'm usually pretty quick to roll over lay down, and prop up on a pillow.Ladies do you think it matters if the woman orgasms, are you more likely to get pregnant if you do? I've tried researching online and can't find anything on the topic at all. DH and I have toys that help me, I can't get one unless I use them while we're BDing, they're external toys so nothing goes in down there (aka Mary Rose, lol, faith too funny!). BTW what position do you ladies think works best? I'm usually on top, but should we be trying DH on top more or what?",
            "post_id": "5360020",
            "timestamp": "1265759700",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "CONGRATS on the engagement!!!",
            "post_id": "5360022",
            "timestamp": "1265759777",
            "user_id": "user_676912",
            "user_link": "/personal_pages/user/676912",
            "votes": "0"
        },
        {
            "answer": "I've heard that if a woman orgasms after the man cums, that helps his swimmers along because when we orgasm we contract. As for position I find mixed opinions whenever I search.Yesterday I tested at 11 DPO and got BFN. Today I tested and got very very faint line. Even DH could see it. The same thing happened last cycle when I m/c'd. I have internet cheapies so I will test often. I'm going to test tomorrow. If I see a line then I'm going to get a digital to confirm. I'm still having cramping/twinges off and on. I feel bloated. My nipples pertrude more than usual. Breast tingling at the top and they feel fuller. I mean I feel really snug up top. I've had more creamy cm than usual for this time in my cycle. The test said to read after 5 minutes. I read it at about 8/9 minutes. I did drop it on the floor when I went to pick it up and read it, so I don't know if that screwed up the results. I hope I'm really seeing what I'm seeing.",
            "post_id": "5360275",
            "timestamp": "1265763934",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "I heard the same that if a woman has an orgasm after a man it helps the \"little swimmers\" to go where they belong.  It is a favorable habitat.  As for positions I heard plain old missionary is good because it is closest to the cervix.  Don't really know how true it is but we shall see.",
            "post_id": "5360310",
            "timestamp": "1265764497",
            "user_id": "user_1186413",
            "user_link": "/personal_pages/user/1186413",
            "votes": "0"
        },
        {
            "answer": "CYCLE DAY?DPO?TWW?(2010)P12",
            "post_id": "5360321",
            "timestamp": "1265764710",
            "user_id": "user_894131",
            "user_link": "/personal_pages/user/894131",
            "votes": "0"
        }
    ],
    "post_id": "5343131",
    "question": "HEY LADIES..TO THE NEW LADIES WELCOME...OUR ROUTINE..IS TO POST SIGNS OF AF LEADING UP TO BFP..THAT INCLUDES ANYTHING U ARE FEELING..EVEN IF ITS LITTLE OR JUST DOESNT MAKE SINCE..IN THIS ROOM EVERYTHING COUNTS..WE HELP EACH OTHER BECAUSE ATLEAST ONE OF US HAS BEEN IN UR SHOES..baby dust..and lots of love..",
    "timestamp": "1265330967",
    "title": "CYCLE DAY?DPO?TWW?(2010)P11",
    "user_id": "user_894131",
    "user_link": "/personal_pages/user/894131"
}