{
    "answers": [
        {
            "answer": "i know someone whos fetus had one of those so severe they were worried about airway obstruction. she had a choice of a very complicated inutero surgery or abortion as the baby definitely would not live if born with the hyrgroma... she sadly chose abortion because $$ and rist of future fertility was a huge risk, but as i said her baby's was very severe...",
            "post_id": "1120687",
            "timestamp": "1112421600",
            "user_id": "user_43067",
            "user_link": "/personal_pages/user/43067",
            "votes": "0"
        },
        {
            "answer": "thanks for ur replt this baby has from the head and down the throat and into the abdomen     does anyone know of any sites that might help?",
            "post_id": "1120737",
            "timestamp": "1112590800",
            "user_id": "user_87135",
            "user_link": "/personal_pages/user/87135",
            "votes": "0"
        },
        {
            "answer": "My daughter is 11 weeks and was just diagnoses with cystic hygroma.  They told us that the baby would not survive, but I have read on here of people who have this and talk about having a normal life.  They have not been able to do amnio yet.  we was also told that this disorder also causes heart problems.   It seems like a lot of conflicting information.  can anyone shed some light on this.",
            "post_id": "1955924",
            "timestamp": "1191625777",
            "user_id": "user_293309",
            "user_link": "/personal_pages/user/293309",
            "votes": "0"
        },
        {
            "answer": "I am 18 weeks pregnant and my little girl was diagnosed with a cystic hygroma at 14 weeks. I had an amnio done and it all came back normal, so no chromosome abnormalities. Her hygroma has shrunk since it was first detected at 12 weeks. How big is your baby's hygroma? Where is it located? My doctors have never told me that my baby would not survive. Her hygroma is on the back of her neck and has gone from 6mm to 5mm as of 2 weeks ago. I have been seeing a perinatologist and I will also have to see a pediatric cardiologist in a few weeks to rule out a heart defect. Basically, get the amnio done. If it comes back normal, then you've eliminated that problem. They'll want to monitor the hygroma just to make sure it doesn't grow or extend to other parts of the body. If it's just the cystic hygroma with no other abnormalities, the prognosis is pretty good. I know if fetal hydrops develop, there is a 100% mortality rate. But again, if it's an isolated cystic hygroma there's a good chance of survival. Lots of these cases resolve themselves and the hygromas just diminish completely. I know I'm kind of all over the place, but I've been doing nothing but research for the past 5 weeks and there's so much information. I hope some of this helped....if you were even able to follow my randomness! I know how scary this is. Especially when you start researching online.....there are some really terrible things on the internet. If I can help in any way, please let me know!",
            "post_id": "1985472",
            "timestamp": "1192463908",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I am 16 weeks and the other day my baby girl was diagnosed with cystic hygroma ,and another chromosome abnormally, called turners syndrome.My baby girl has 2 cysts on her neck, and they look like they are each the size of her head....but my doctor said that they appear bigger on the ultrasound because there is no gravity in the womb to weight them down.....so they are kind of...floating.I am afraid her heart will give out due to the size of both of the cysts...because they ARE large.I'm glad to find people that have the same thing or that are going through the same thing as I am.I have been reading up on both turners syndrome and cystic hygroma  just for my own knowledge and comfort....Any advice?",
            "post_id": "2057619",
            "timestamp": "1194046840",
            "user_id": "user_321737",
            "user_link": "/personal_pages/user/321737",
            "votes": "0"
        },
        {
            "answer": "Your post gave me alot of hope.  It's great news that your baby's hygroma has decreased in size. I am 13 weeks pregnant and was told yesterday that my baby has a cystic hygroma.  It is on the side of the neck and measures just over 5mm.  I am meeting with my obstetrician in a couple of day and will request an amnio.  I know I am at higher risk of chromosome abnormalities due to my age (41), but I still have hope.  I agree with you about all of the info on the internet.  I sometimes feel that I should stop reading it because alot of it is scary, but then on the otherhand, I want to learn as much as I can.  How is your baby doing now?",
            "post_id": "2070646",
            "timestamp": "1194373467",
            "user_id": "user_325293",
            "user_link": "/personal_pages/user/325293",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry you're going through this. I was lucky enough to have clear amnio results. However, I always thought to myself that if it had to be something, I'd want it to be Turners. Before I got my amnio results back, the doctors told me it was most likely Turners, so of course I went in search of support. I found so many women who have wonderful, perfect daughters with Turner Syndrome. There are so many growth hormones and treatments that eliminate so many of the issues Turners babies have. I'm sure you've done your research and if you're anything like me, you're more focused on just getting your baby girl to live to term. I know how scary it can be to just sit and wonder if she will make it. How is her heart?? Have they taken a good look at it yet? The fact that you've already made it to 16 weeks is fantastic! I'll be praying for you and your baby girl! Please keep us updated! Oh, and I don't know if this would help you or not, but I rented a baby doppler. The fact that she was at such high risk for cardiac failure was enough reason for me to rent it. It made me feel so much better to hear her heart beat every day. Good luck!!",
            "post_id": "2079039",
            "timestamp": "1194538744",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Your story starts out exactly like mine! I was first told of the problem at barely 12 weeks and she was diagnosed at 14 weeks.  I'm 22 weeks now and as of 20 weeks, the hygroma was nearly gone. It's still there, but it hardly even noticeable to the untrained eye. I have since gone to a pediatric cardiologist to have a fetal echo done on her heart and that came back perfect. No heart defects! Now, there is no reason to think that I won't give birth to a perfectly healthy little girl. I'm telling you, I thought there was no chance. Everyone told me to stay positive and keep hope, but they didn't know the statistics. I remained optimistic, but realistic through the whole thing......it drove my family crazy! But I know the statistics and I know the odds and I'm telling you that there's a huge possibility that everything will be just fine for you and your baby. I'm glad you're getting the amnio done. Do you have it scheduled yet? Make sure you ask about the FISH test too. I got the results back in 3 days. It doesn't test for everything, but it tests for all the Trisomies like Downs and Edwards and it tests for Turner Syndrome as well. It was just nice to know the big things were out of the way so much faster than the full amnio results. I hope your amnio results come back completely normal and that stupid hygroma goes away all together!! Please keep me updated on your situation!! I'll be thinking of you and your baby! Good luck to you!",
            "post_id": "2079082",
            "timestamp": "1194539387",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Thanks Megan.  You have no idea how much hope your story gives me.  I am trying to only think positive thoughts and that is what is getting me through each day right now when so much is unknown.  I'm seeing my obstetrician today so hopefully I will have a date set for my amnio soon after that. Thank you for thinking of us.  It means alot to me and my husband also.  I will let you know how things go.  Please keep me updated on you and your daughter.  I am so happy for you!",
            "post_id": "2079651",
            "timestamp": "1194547680",
            "user_id": "user_325293",
            "user_link": "/personal_pages/user/325293",
            "votes": "0"
        },
        {
            "answer": "hey Amanda...my story is also just like u n megan....but i m one step further....my baby was born in july this year..n i m glad to say that he is absolutely fine...no problem what so ever..n he was also suspected for cystic hygroma n  his  chromosomes were also normal....I m sure both ur babies will be fine....prayers n beat wishes",
            "post_id": "2179551",
            "timestamp": "1196791443",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "I was just thinking about you and wondering how your pregnancy is going. Have you had the amnio yet? I don't know if you check this very often, but I check back once a week or so to see if you've updated yet! I'm hoping that everything is fine. My baby girl is doing well. I have to go back to see my specialist in a couple of weeks to check on her growth and to make sure the hygroma has gone away completely. I'm hoping that it's gone and I never have to see that man again! I hope you and your baby are well.......",
            "post_id": "2183992",
            "timestamp": "1196871511",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Sorry - I was too upset to write back for a while.  I had the amnio and my worst fears came true.  The baby has Downs.  We were devastated at that news especially as we also found out that the baby is a girl.  I already have 3 boys, so a girl would have been my dream come true.  I have another u/s scheduled for next week to check on the hygroma.  I am so happy for you that your daughter is doing great.  Good luck with your next appt.  Please continue to post updates on your baby.  I will keep checking this site once in a while.",
            "post_id": "2184465",
            "timestamp": "1196877130",
            "user_id": "user_325293",
            "user_link": "/personal_pages/user/325293",
            "votes": "0"
        },
        {
            "answer": "Hello all, firstly I want to thank you all. This thread has helped calm me. My wife and I are in our late 20s. We needed to be on fertility medication to get pregnant. This is our first. This past week at our 10 week appointment, our doctor noticed an irregular nuchal. He wants us to go for a second opinion with a prenatal screening specialist. That appointment is tomorrow, and I am scared to the bone. I just don't know what is going on and I am praying for my little baby to be healthy. Being a first time potential father it is really hard for me to deal with this. My wife is emotional and well I feel that if god forbid there is something wrong that we should discuss what our next course of action would be. It is really a horrible and somewhat lonely feeling being that it took us time to get pregnant. Really it is in gods hands now, I just hope and pray that all is ok. But being in this situation is just plain horrible being that we have been so looking forward to this. I know the screening is exactly that a screening and sets off alarms...but nothing is definite till you see a specialist. I just ask that if you can pray for our little baby. I thank you all and please keep this site going, you have no idea how mych you have helped.",
            "post_id": "2223561",
            "timestamp": "1197488511",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "No need to worry at this point......I know its easier said than done but trust me every thing will be fine. My memmories are still fresh about my pregnancy when doctors talked about high nuchal transluency and I can very well relate to you. Keep us updated when ever you visit your doctor next.Prayers for lil angel not yet out in this world and best of luck",
            "post_id": "2231800",
            "timestamp": "1197641440",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Thanks for the wishes. We went for our second opinion yesterday 12/13/07, the nt measurement was between 3.0 to 3.5. Per the physician the normal measure is 2.2 on the high end. So she told us there is a risk, she dubbed it as moderate. However this could also mean some sort of cardiac issues as well. Rather than taking a blood test and try and figure out what screening range we fall in we elected to go for a cvs. We should have the first set of results back by Monday. I've done some research online and well basically it is telling me stuff I already know. We probably have a 10 to 15% chance of something being wrong. We choose the CVS cause it is conclusive, we want a yes or no answer. I know some people will disagree, but not knowing for us is not an option. I just hope my little baby is ok. Again I don't know what normal is but from what I have read, normal on the high end is 2.2, so we know that there is a possibility that something may be wrong. Has anyone else experienced something like this?",
            "post_id": "2232165",
            "timestamp": "1197646277",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "I know how terrifying this is for you and your wife. My little girl's nuchal thickness was at 6mm at my 12 week u/s.....so double your baby's. However, I was told that the normal range was between 1 and 3mm.  I think you've made the right decision by getting the CVS done. The blood tests are so inconclusive....my specialist recommended that I avoid even doing the blood test. For us, we wanted an answer....not percentages. If you've read this thread you know that everything has turned out just fine for us. I have one more u/s with my specialist to make sure the hygroma has completely gone, but after that I'm done. A lot of times....especially if it's just a thick nuchal fold.....the connection in the 2 systems is just delayed. Once that connection happens, the fluid drains and goes where it's supposed to go and everything ends up completely normal. Sometimes I've wondered how many unborn babies actually have a thick nuchal fold, but it's never detected because in most cases an u/s isn't done that early on. I hope your results come back completely normal and you can just start crossing the potential problems off your list. If I could be of any help, please just let me know! Good luck and I'll be praying for your family!",
            "post_id": "2232779",
            "timestamp": "1197653590",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Oh honey....I'm so sorry. That's so not what I wanted to hear. I tried to imagine how I would feel if my results turned out like yours did, but I just can't. If you don't mind me asking, are you going to keep the baby? I'll be praying for strength for you and praying that your little girl's hygroma goes away and doesn't cause any more problems for her. Keep me posted when you can, I know you're in a stressful situation right now.",
            "post_id": "2232791",
            "timestamp": "1197653817",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Thanks Megan.....it is a trying time to say the least. We are trying to be strong, I mean sometimes my mind thinks that maybe this is just a red flag and all will be ok. And then sometimes it makes me think of all the possibilities it is pretty bad. As I am sure you know, it is really tough. Thank you for your prayers it does mean a lot to me.",
            "post_id": "2233454",
            "timestamp": "1197661968",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Well, we have still not heard anything. I really was prepared to know one way or the other today. And they still haven't got our results. That does worry me to be honest. I mean I was under the impression that if we gave the samples late Thurs that we would have heard today in the afternoon of the major tests. The fact it didn't come really sucks and both of us feel like our life is falling apart. For the first time in my life I don't know how to handle a situation, I really don't know what to do. I just keep praying that all is ok. I really just hope all is well with my little one.",
            "post_id": "2243994",
            "timestamp": "1197928237",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Well I have a bit of good news. We found out today that the first set of tests (which I believe is called the FISH test) came back normal for the major abnormalities. The complete results are still needed, which are for the less common disorders. So we are not 100% out of the woods, however feeling much relieved. Does anyone know outside of the 5 major abnormalities, what other checks are done?",
            "post_id": "2245564",
            "timestamp": "1197952398",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Wow this is super news......FISH results are MOST important....final report comes out normal in most of the cases if FISH is normal...I m sure it will be fine. After CVS my doctor just suggested to keep a check by U/S....I consulted high risk pregnancy radiologist and he told me that he have seen 4 such cases in his career...and when FISH was OK...it was a totally normal baby:).....he kept a check on babies heart...n after few weeks that thickness was totally gone in my case.....try to relax n most important keep ur wife happy........n after 1 or 2 months you will have a happy baby who will keep kicking inside:)....best wishes.",
            "post_id": "2246470",
            "timestamp": "1197985543",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "thanks...this was a really tough week. Its crazy I never realized how much your life can turn upside down. only a couple of more days and then we should be on cruise control (if that is possible)",
            "post_id": "2248602",
            "timestamp": "1198013093",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Hya just found out my baby has a cystic hygroma i am 16 weeks pregnant and very frightened been reading bits but dont want to read to much on internet has i get very scarred .is there anyone out there whos baby has survived would really like to know still having to think about alot of things my head all over the place thinking .sonya x",
            "post_id": "2251562",
            "timestamp": "1198075628",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Molly, I am sorry to hear that. I pray for your baby and family. I hope all turns out well.",
            "post_id": "2256800",
            "timestamp": "1198165396",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Hello all, my wife and I have a U/S follow up today. I am a little unclear as to what they check..or if it is to make sure that all is ok. I am still a little freaked out as all results are not back yet. But the FISH came back ok.",
            "post_id": "2256809",
            "timestamp": "1198165522",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Yay!! The fact that your FISH test came back normal is GREAT NEWS! Mine came back normal and a few days later I got the full amnio results back and they were normal as well. The normal FISH results are a very good indication that your baby will be just fine. I hope that the U/S goes well today.....hopefully there will be some regression. They should just check the thickness of the baby's skin. In a lot of these cases, the fluid begins to drain around 15 weeks, so most likely they're looking to see if the fluid has drained to the parts of the body it needs to go. Good luck! I'll be watching for an update! Congratulations again on the normal test results!!",
            "post_id": "2257190",
            "timestamp": "1198170738",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I'm sorry to hear about your diagnosis. I read everything I could on the internet just so that I could be informed and prepare for the worst. But I totally understand how scary it is. One minute everything is great and within days your life is completely turned upside down. I'm so glad you found this thread! There are quite a few of us who have gone through or are going through the same thing. I feel like it's been forever since my baby was diagnosed with a cystic hygroma and I just found out on Tuesday that it's completely gone. It's entirely possible for it to just go away on its own, but I know how hard it is to be unsure. Did they tell you how big the hygroma is? Where is it located? Good luck hun and I'll be praying that everything turns out well for you and your little one. Keep us updated!",
            "post_id": "2257215",
            "timestamp": "1198171145",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "hya all, the babys fluid is all around its body the doctors dont seem that certain it will survive,when i was last there was monday and it was still alive have to go back thursday the 27th to have another scan, still really scared and dont know what decissions to make ,what a horrible start to christmas but have to be strong for my other two children . thankyou for repliying will keep u up to date with news xxx",
            "post_id": "2257425",
            "timestamp": "1198173620",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Good News. All the results for our CVS came back normal and we found out we are having a baby girl. We are really relieved. The follow up was simple, they just listened for the heartbeat and drew blood. In two weeks we have another ultrasound, my guess is to check the swelling. Hopefully that will go down. The doctor said usually it corrects itself if there is no genetic defects. What a relief.",
            "post_id": "2261384",
            "timestamp": "1198247029",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Awwww! Congratulations!! What a relief! I'm so happy for you and your wife:) And yay for baby girls!:) You can breathe now!",
            "post_id": "2262085",
            "timestamp": "1198257190",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Molly. I really feel for you. My husband and I are going through the same thing. I am really scared. I am 26 years old and had to go to a fertility doctor and be put on fertility drugs in order to get pregnant. My husband and I have waited a long time to have a baby. My first ultrasound at 9 weeks looked ok apparently. I was released by my fertility doctor. I went to see my regular ob/gyn last wednesday and was told that my baby had a fluid filled sac behind the neck. My husband and I have cried constantly, but we keep trying to think positively. We go to a maternal fetal medicine doctor on friday the 28th and will be having a cvs done. This thread has given me some hope. I will pray for you and I hope that everything works out in both our cases.",
            "post_id": "2270179",
            "timestamp": "1198459312",
            "user_id": "user_369299",
            "user_link": "/personal_pages/user/369299",
            "votes": "0"
        },
        {
            "answer": "Thinking of you too hun hope all goes well for you on friday keep me up to date xxx",
            "post_id": "2271305",
            "timestamp": "1198498151",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "I'll be thinking of you both this week. I'm sure going through the holidays with such uncertainty is agonizing. Molly, I hope your scan goes well on Thursday....and I hope your little one is still in there fighting. Brookest81, good luck with your CVS. Waiting will be the hardest part.",
            "post_id": "2271872",
            "timestamp": "1198512710",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Dont lose hope dear......I am very sure next christmas you will have a new member in your family...a healthy lil happy baby....its just a bad phase that you and your family is going through and it will pass very soon. God is just testing you and he gives little trouble in between so you dont have to face big problems in life...in the end these experiences makes us good human being and force us to think how blessed we are....every thing will turn out fine....i can understand how bad it feels to be in such a situation..but just try to focus on positives...i know its easier said than done but for the sake of baby in your womb, plz eat right and think right ....do let me know if can be of any help...i will definately pray for you....and god will give you strength to face any situation.",
            "post_id": "2274833",
            "timestamp": "1198625716",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Dont lose hope dear......I am very sure next christmas you will have a new member in your family...a healthy lil happy baby....its just a bad phase that you and your family is going through and it will pass very soon. God is just testing you and he gives little trouble in between so you dont have to face big problems in life...in the end these experiences makes us good human being and force us to think how blessed we are....every thing will turn out fine....i can understand how bad it feels to be in such a situation..but just try to focus on positives...i know its easier said than done but for the sake of baby in your womb, plz eat right and think right ....do let me know if can be of any help...i will definately pray for you....and god will give you strength to face any situation.",
            "post_id": "2274834",
            "timestamp": "1198625716",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Dont lose hope dear......I am very sure next christmas you will have a new member in your family...a healthy lil happy baby....its just a bad phase that you and your family is going through and it will pass very soon. God is just testing you and he gives little trouble in between so you dont have to face big problems in life...in the end these experiences makes us good human being and force us to think how blessed we are....every thing will turn out fine....i can understand how bad it feels to be in such a situation..but just try to focus on positives...i know its easier said than done but for the sake of baby in your womb, plz eat right and think right ....do let me know if can be of any help...i will definately pray for you....and god will give you strength to face any situation.",
            "post_id": "2274835",
            "timestamp": "1198625754",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Hya all went for my scan today and baby still alive i was so happy,also some of the fluid has gone which gave me hope, baby still in danger cause it still as alot of fluid around top of its body but knowing some of it had gone gave me hope, going for a heart scan next week to see if babys heart ok so will keep you all up to date thankyou all for your support hope everyone else is ok xxx",
            "post_id": "2280583",
            "timestamp": "1198776336",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Molly that is good news. I am glad to hear that. We have a follow up next week with our OB. I am a little nervous but feel better now that I know that the cvs came back normal. But still I am airing on the side of caution. Just don't want to jinx anything.",
            "post_id": "2281214",
            "timestamp": "1198784638",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Thats good dear......i just wanted to know did you get the chromosomes tested?..I mean CVS or amnio.",
            "post_id": "2282502",
            "timestamp": "1198805389",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Everything will be fine....trust me. Please make sure your wife is eating well and not thinking too much as this could adversely effect baby. You know after my CVS was normal, my OB said \"dont you worry now and go out for a movie....just relax\". Those few days of tension were soooo taxing...I just could not think any thing else but about my baby 24*7....and tension is not good for baby at all.Take care and wish you a great 2008!!",
            "post_id": "2282543",
            "timestamp": "1198806010",
            "user_id": "user_352660",
            "user_link": "/personal_pages/user/352660",
            "votes": "0"
        },
        {
            "answer": "Hya hun never had any amnio test done got to decide if i want it done xx",
            "post_id": "2284366",
            "timestamp": "1198868626",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "It's amazing how many of us are going through this horrible process of learning about cystic hygromas.  It's a term we'd never heard before Nov. 26th - that's the day I had my nuchal (at 12 weeks).  The technician left the room and in came a somber-faced doctor who told us that our bbaies nuchal measurement was between 6-7mm.  From that point on, we were given nothing but horrible statistics.  Had a CVS the next day and the genetic counselor told us it was most likely one of the trisomies, or a grave heart defect.  We had quick results for the FISH test -- all normal -- but had to wait another 2 agonizing weeks for the results of the other chromosomes.  Those, too, turned out normal.  We were so relieved by those results, but still our specialists told us it was most likely a heart defect -- because of the large amount of fluid (almost 7mm).  Fast forward to yesterday:  we had a 16 week specialized sonogram. We got a miracle: the fluid was completely gone and the heart looks \"encouraging.\"  I share this story because we were in the depths of despair.  I know how you all feel and even though our results turned out well, I will never forget the pain and loneliness one feels when you're given this diagnosis for your baby.  My faith in God is what got us through this. I am religious - but really prayed more than I ever have in my entire life.  If you are religious - pray -- even if you aren't, how much can it hurt to take a chance....it can only help.  I'll pray for everyone on this site -- and wish you and your families all the best....",
            "post_id": "2286075",
            "timestamp": "1198897655",
            "user_id": "user_372618",
            "user_link": "/personal_pages/user/372618",
            "votes": "0"
        },
        {
            "answer": "Congrats on the good news! And regression in the fluid is wonderful! My baby girl started out with fluid from the top of her head all the way down to her bottom and now it's completely gone.....so it's entirely possible! I'll be praying for a good heart....a good heart is a huge step in the right direction. Good luck!",
            "post_id": "2288217",
            "timestamp": "1198952315",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I have been very upset and am just now able to write back. Friday when we went for our CVS, the ultrasound showed no heartbeat. We still went ahead and did the test, but I do not have the results yet. We are really devastated and now I just have to sit around and wait until I can have a D&C unless I pass the baby first. I hope things go well for everyone else and I will be praying for all of you.",
            "post_id": "2303077",
            "timestamp": "1199286854",
            "user_id": "user_369299",
            "user_link": "/personal_pages/user/369299",
            "votes": "0"
        },
        {
            "answer": "So sorry to hear your news hun must of been a terrible day thinking of you xx",
            "post_id": "2308201",
            "timestamp": "1199366764",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Thanks newborn, it has been two weeks now and all the cvs results came back fine. Tonight we have our follow up. To be honest, everytime we go to the OB I get nervous now only because I am not sure what to expect. I am hoping all goes well, so we can just enjoy the pregnancy. We haven't really been thinking about much, but like today I am on edge. Does anyone know what they do at the ultrascreen after the cvs. My guess is they will look for the fluid regression and heartbeat. But want to know if anyone has been through this?",
            "post_id": "2308547",
            "timestamp": "1199372895",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "I had my D&C this morning. It was really a sad time for me, but I felt it would be easier than passing the baby on my on. My CVS results came back and the Geneticist said that our baby had Turner Syndrome. I actually researched this before we had the CVS and had decided that that was something I was prepared to handle. The only problem is that 95% of pregnancies with Turner Syndrome to not make it. The strange thing is though that the ones that do survive live a fairly normal life. They just never grow to full height or go through puberty, but in most aspects they are like other children. Only girls can have Turner Syndrome, so this would mean that our baby was a girl. I felt that I did get some closure today and was told that our chance of something like this happening next time we conceived was 1%. Thank you all so much for keeping us in your prayers. I still need some more time to heal, but we want to try to conceive again very soon.",
            "post_id": "2317046",
            "timestamp": "1199492955",
            "user_id": "user_369299",
            "user_link": "/personal_pages/user/369299",
            "votes": "0"
        },
        {
            "answer": "I am newly diagnosed with a cystic hygroma (2.9 mm at 10 w 6 d) and the doctors are very concerned, giving my baby about a 30% chance of survival. Devastating. I am heartened and touched by your stories and am comforted to feel not so alone in this. We have the CVS on Tuesday, then the wait for the first results. Don't want to give up hope, but it is hard. One question: due to the early date of the NT scan, the doctor was VERY concerned about the 2.9 measurement, but I have read that 2.9 is just outside of normal...however, I also know that the CH grows everyday til 14 or so weeks, so maybe it's destined to become very large respectively as time goes on? Does anyone with more information have a perspective on this?",
            "post_id": "2324373",
            "timestamp": "1199642457",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "We were so surprised to read such positive outcome from a 6 mm cystic hygroma.... finally some hope to hang on to.  We just learned several days ago at 131/2 weeks that our baby has an almost 4mm cystic hygroma. I have done nothing but cry since, I try to hold out for hope but all the web sites and all the doctors are just so bleak.  I am scheduled for an amnio this Wednesday, I've decided against the FISH only b/c I can't bear to hear bad news in bits and pieces. I had a hard time with prayer, only b/c I feel God has forgotton me. Gratefully we have a 31/2 year old boy  followed by 3 miscarriages and now this pregnancy. I should mention that I am 43 / 44 at time of delivery and my husband is 47, so we are already at great risk for chromosonal disorders. I have searched and searched for some positive reports finally I've found something. Thank you for sharing our story, and for all out there your prayers are needed and appreciated.",
            "post_id": "2325606",
            "timestamp": "1199660873",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I read the last two post. My recommendation is for you to go for the cvs. We had one done at 10 weeks and our baby had a nt measure of 3.2. As most of you know we had our follow up last Weds. All is well, nt measure is normal now. So I strongly suggest you go for the second opinion. I know this is a tough time but I will pray for you.",
            "post_id": "2330746",
            "timestamp": "1199745156",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "I read the last two post. My recommendation is for you to go for the cvs. We had one done at 10 weeks and our baby had a nt measure of 3.2. As most of you know we had our follow up last Weds. All is well, nt measure is normal now. So I strongly suggest you go for the second opinion. I know this is a tough time but I will pray for you.",
            "post_id": "2330747",
            "timestamp": "1199745158",
            "user_id": "user_359184",
            "user_link": "/personal_pages/user/359184",
            "votes": "0"
        },
        {
            "answer": "Thank you so much Ray. Yours is one of the many stories that does indeed give me hope. (Which is a little too easy to lose during this time.) I have the CVS tomorrow, then have to wait until Thursday for the FISH results. Please keep us updated as I come back to this post everyday. Best to you, wife and baby. -Kammie",
            "post_id": "2332339",
            "timestamp": "1199772747",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "In case anyone needs a little hope, my ob told me today that every case of cystic hygroma she has personally seen in her career has turned out fine. (And she has a very very busy practice.) She seems to think the statistics are more grim than the reality. Still being pragmatic, but wow, that gives me a lot more hope. -Kammie",
            "post_id": "2336683",
            "timestamp": "1199846952",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "I do need a little hope and hearing what your ob had to say is very encouraging. I was orginally scheuled for my Amnio on Jan. 24 which would have me at about 16 weeks/4days. My OB and genetic counselor felt we should push it up to today Jan 9. During the sono. I was terrified to ask the tech. if the cystic hygroma had grown. The high risk Dr. felt I was too early along ( 14 weeks/2days) for a safe amnio and recommended that we reschedule for next week. I finally summoned up the courage to ask about the hygroma , he said the tech never measured it during this sono, so he did it himself, he felt our baby looked normal and that the hygroma had/has reabsorped, he said if he did'nt know any better and this was a first time US he would have never picked it up as abnormal. He also said that at 14 weeks the US scans/planes are now sagital versus profile so the measuring is different. Of course we are not out of the woods but he gave us such tremendous relief and hope. I'm sure you have felt the despair that I have felt when you think your baby is not healthy so it is really good to feel a little excited about this baby for a change. He also said that it's still a little too early to tell yet, but if he were a betting man he'd say this one' s a girl. Please for all of you out there, keepyour faith, don't loose hope even in your darkest moments, know that we are out here in cyber world and that we are all riding this freakin' nightmare rollercoaster. And sometimes you get good news. I pray for us al- Istherehope",
            "post_id": "2341290",
            "timestamp": "1199925294",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I am so happy for you to have such great news. That is wonderful. I can only imagine the relief you must be feeling. I, myself, went in for a CVS test two days ago (Jan 8th) and unfortunately my anteverted uterus was still too tipped back to perform it. They will try again in one week, otherwise I have to wait until February to get an amnio (til I'm 15 weeks). I am only 11w 5d today (Jan 10th). The wait is bordering on intolerable. In the meantime, I would like to have another US to see if the hygroma is growing or decreasing in size. I know that fluid is supposed to drain from behind the neck around 14 weeks when the systems connect. What I don't fully understand is whether a hygroma that drains at that time indciates that there is generally not an underlying problem. Is it only the hygromas that remain that are indicative of problems? Did your doctor give you more information than this? It seems nothing is black and white. Thank you for sharing your good news. More hope for all! -Kammie",
            "post_id": "2344966",
            "timestamp": "1199994094",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "At our consultation with the genetic counselor we were told that some hygromas reabsorp and leave behind a web neck which is usually indicative of Turner's syndrome, which are always female since the 45th chromosome is not paired with ither an X or Y chrome. Again, only an amnio can rule that out. Once they rule out all genetic disorders they then monitor the baby's heart, since statistically babies with reabsorption have some form of congenital heart defect, once they are able to rule that out they can tell you that your chances of delivering a healthy baby are very high, most likely to be completely normal without adverse side effects.I wish someone would have told me that the fluid is supposed to drain around 14 weeks that would have given me some hope last week. I had my NT at 12 weeks ( 12/24/07),  was told the hygromawas 4mm at 13 weeks, went in for another sono. at 14 weeks and was told that there was no significant fluid to speak of. Who in the hell really knows whats going on, obviously we are just looking for some good news at this time since the past weeks have been so emotionally draining. So we are hanging on to hope and praying that we will beat all the odds.  Thats why I was so happy to read that your OB said what she said about most reabsorping.What did your baby's hyrgoma measure at and at what week.I know it seems like time is standing still and that 15 weeks is years away, but all you can really do is read only good things and silently wait for the amnio. Keep the faith- Istherehope",
            "post_id": "2345576",
            "timestamp": "1200006212",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "Hya all went for my 20 wk scan today and wasnt good news,still alot of fluid around head and many other things wrong with it. babys head not the right shape, they think it as heart problems, and it also is not the right size for its age.the problems are just ongoing i had hope last week, but now thats gone im so upset . next week im going for babys heart scan but know its bad news not what im wanting to hear but lifes so cruel will keep you up to date with heart scan .good luck to everyone else xxx",
            "post_id": "2349263",
            "timestamp": "1200077344",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Molly, I am so very sorry to hear your news. I know after having a miscarriage six months ago that there is nothing one can say to make bad news more bearable. But it does help to know that others are thinking of of you. And I am.Istherehope, I called and asked my genetic counselor more questions and she basically told me exactly what you're saying. Another thing for you to feel hopeful about is that both my OB and the OB who I originally spoke to when she was gone said that they have never encountered a heart problem associated with a reabsorbed cystic hygroma. So you really do have reason to feel relief right now. : ) As for me, I was diagnosed at my NT screening at 10.6 days. The CH was 2.9mm. The doctor was concerned because it was so early on and it was already too big. I guess the idea is that she was afraid it would be all the bigger in a week or two. I'm trying to keep the faith! But it ain't always easy!",
            "post_id": "2351486",
            "timestamp": "1200114405",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "Hi....I posted on this forum quite a bit awhile back and haven't checked it in weeks. I don't know if you read my posts, but I just want to tell you that there most certainly is hope. At 11 weeks 5 days, my baby's nuchal fold was 6mm and she was diagnosed with cystic hygroma a week later. The fluid went from the top of her head, down her back, and all the way to her bottom. I am now 32 weeks pregnant with a healthy little girl. Her hygroma is completely gone and fortunately it caused no other problems. She had no chromosome abnormalities and has a perfect heart. I look back at all of those dreadful appointments with my specialist and it all seems like a bad dream now. I remember him telling me that certain parts of her were small for her age....yet another indication of a problem. And now, she's measuring big! At my last appt. with him he actually laughed and told me that I'm going to have a chubby baby. It was so surreal to look at the same man who talked to me about termination and the bleak chance of survival my baby had, and then to lay there and listen to him crack jokes about my baby girl's chubby cheeks. My point is, there is hope.....especially that early on. If I hadn't had an u/s at 12 weeks....if only they had waited until 18 weeks, they would have never even noticed the hygroma. I'll be thinking of you all and I hope that your nightmare is over soon. Take care.....",
            "post_id": "2359917",
            "timestamp": "1200329740",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Thank you! -Kammie",
            "post_id": "2360149",
            "timestamp": "1200332988",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "How encouraging to hear another story with a happy ending. I've been very optomistic and hopeful this past week, but last night I started having anxiety all over agian with rapid heart beat and shortness of breath...We go for the Amnio tomorrow and its back to all the B.S. of doom and gloom from all the doctors, I know that they have to inform you of every possiblity, but you are right if only I had'nt had that u/s at10 weeks, maybe all of this could have been avoided. This has been a very difficult pregnancy from the start. My doctors have laid out all the statistics since I am 43 and have had 3 consecutive miscarriages in 3 years, and now this cystic hygroma nightmare and all the possibile chromosonal abnormalities. I just keep praying for good news and reading positive stories. Thanks for sharing yours. Istherehope.",
            "post_id": "2366317",
            "timestamp": "1200441541",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "Please stay strong and have everybody you know and everybody they know pray for you and your baby. Reading all of  these stories really has kept me from drowning in sorrow. Please hold on with faith in your heart until you get every last test result back. Soon enough you'll finally get some good news and you can start enjoying this pregnancy for a change. I will be thinking of you, keep us posted....Istherehope",
            "post_id": "2366353",
            "timestamp": "1200441905",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I hesitate to share this because I don't want anyone else to lose hope, because I DO think that more often than not, there are happy endings. Unfortunately mine is not one of them. I got the CVS results yesterday and my baby girl has trisomy 13. Edwards Syndrome. Sad, yes! But I am glad I did not give up hope until I got definitive results. And we will try again. Best wishes to everyone on this board and to your little ones. -Kammie",
            "post_id": "2374067",
            "timestamp": "1200595284",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "My heart goes out to you, I am so sorry. I pray our results  are more  positive but I live in silent fear like most of us.  I had my amnio yesterday and that in of itself is terrifying, now the waiting game begins. I'm a little sore and afraid to do anything other than sit or lay around.  I am concerned however, as the specialist said our baby's hygroma is 3.6mm at 15 weeks 2 days,  and was 4.0mm at 12 weeks. Not much reabsorbtion if you ask me and ofcourse the doctors don't commit to anything,  He did say that he would'nt normally be all that concerned with this measurement as anywhere from 2-6mm can be normal. This confuses me still.He also said that my baby girls skull, femur and radius   all measured completely normal and in fact she was measuring a little ahead of herself at about 15 weeks 5 days, he said that chromasonal babies tend to grow slower with shorter limbs.  We did decide to do the fish test so some results should be in in 2-3 days. I am absolutely teriffied, I am beginning to hate my OB, everytime I go near his building I become physically sick to my stomach, I just hope once he could give me some good news. Sorry to be laying all this on you, but I'm sure you were in the same place at one time. I am so sincerely sorry for you to have to have gone  through this, I hope in time you'll find peace. Thinking of you,,,Istherehope",
            "post_id": "2374600",
            "timestamp": "1200601560",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "To any of you who've had an Amnio, did you feel sore afterwards? They tell you to call Dr. if you have contractions, discharge or bleeding, I would'nt say I have contractions, but I would describe it more as PMS cramps and discomfort, no bleeding or discharge thank god... Any advice  and any good news out there.",
            "post_id": "2374768",
            "timestamp": "1200603598",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "About your amnio......a  little cramping is normal. However if it's still going on today, I'd definitely call your doc. I had no cramping at all...I was just a little lightheaded and nauseous afterwards, but it passed. You're right, as long as there's no contracting or bleeding I think you're alright, but if you feel like something is wrong don't hesitate! Better to err on the side of caution. I'll be praying that your results are normal. I know how terrible the waiting can be.....2-3 days can feel like an eternity. Hang in there!",
            "post_id": "2378176",
            "timestamp": "1200672805",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I think your doctor's feedback sounds really good! Your baby's CH is now practically within normal bounds, and it has actually gotten smaller instead of bigger! But I know you were hoping it would be all gone. My CVS was done the same way as an amnio (abdominally with a needle) and I was sore for two days. Everything I read says a little cramping is normal after an amnio. It's all just a little scary. I convinced myself I was leaking amniotic fluid after my test. I wasn't. Remember, the rates of something going wrong after an amnio are like 1 in 1000. Try not to worry. And please post your results. I have hope for you! And I would love to hear about a happy ending. Meanwhile, I am planning a trip to Hawaii for my little family of three, can't travel for two weeks after my surgery, but then we're off. -Kammie",
            "post_id": "2379030",
            "timestamp": "1200684876",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "Thanks for your input, it helps knowing there are people out there going through similiar situations.   I do feel much better today.... Thank God. Minimal cramping, I even went for a short walk around the block for some fresh air.  I will continue to take it easy, thanks for your support...Isthere hope",
            "post_id": "2379950",
            "timestamp": "1200700638",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I am heartbroken to say that our FISH results have indicated that our baby has Downs Syndrome. We have an appointment with the specialist/genetic counselor on Friday to get the full Amnio results. Never have I been in a darker place in my life, I honestly don't know what to do. All along we have been praying for good news, now I'm praying for more bad news on Friday so if we decide to terminate the decision will practically be made for us. Part of me hopes of course that the test was wrong or that we will be the 3% that are false posititve. Again, I'm just rambling randomly as that is how my head is working right now.Anyone out there in similar situation?  Thanks for listening...Istherehope",
            "post_id": "2399635",
            "timestamp": "1201104680",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I'm so so sorry to hear about your test results. While I can't imagine what it must be like to actually know that there's something wrong, I definitely know the mixed emotions involved in the prospect. Before we got our results back I had convinced myself that there was something wrong and began to think about what to do when I found out for sure. It's such a terrible path to allow your thoughts to travel down, but it's inevitable. I'm just so sorry that you're faced with this decision. I suppose the best you can do is just sit with it for a few days. I hope you've got the support you need to get you through this. You just make the best decision you can for you and your family....that's all you can do. I'll be thinking of you and praying for your strength.",
            "post_id": "2399922",
            "timestamp": "1201108669",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I am SO sorry to hear of your results. I know how it goes: the roller coaster, then the shock, then the utter despair, then the decision. I was just in the exact same position as you a few days ago. Well, trisomy 13, which carries a far worse prognosis, but which also made the decision to terminate a little more black and white. Still, it was a process to reach the answer that would give everyone including the baby, peace. I do know the unspeakable depths of sorrow you are feeling. I don't believe there is a bigger pain to feel in this world. And I also know that, despite the fact that it feels that you will never be okay again, you will. Please please call me or email if you would like to talk. I would like to be of support. 206-335-2501 or ***@****Kammie",
            "post_id": "2401002",
            "timestamp": "1201123932",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "Thank you all for sharing your experiences, your fears , and your concerns, this has been the most difficult journey of my life.  I am beginning to find some peace (finally) with our situation.  We had our follow up consultation with the genetic counselor on Friday, basically she could tell us no more than what we already knew. Our baby has Trisomoy 21, no level of severity can be determined at this gestational age. We would be waiting until 20 weeks plus to learn the extent of congenital heart defect. Our baby will most likely have one form of 3 serious heart defects because of her present Cystic Hygroma. Her medical complications will follow her throughout her life..More than likely she will either pass in uterine or not survive the first year, of course no one can ever be certain of this but our chances  are very high for spontaneous abortion. At this point we can opt for medical termination where I would not have to go through heartbreaking hours of labor but simply be put to sleep.  If we decide to go forward with the pregnancy our chance of miscarriage increases daily and if we make it to term her chance of survival is very small.. As my husband put it(god bless his soul) we would decide to go forward, make our peace with Down syndrome, educate ourselves, prepare ourselves, anticipate her birth only to be further devistated with a 3rd. trimester miscarriage. God may think I'm strong for many things, but I can assure him as well as anyone that I would not mentally survive labor and delivery of a still born.. It' s creul and unimaginable.I have lived the past 31/2 years trying to get pregnant, suffering from 3 miscarriages and basically living and breathing pregnancy  issues and concerns every single day. I have found some peace in accepting thatI must let that dream go, I must live my life, be present in my life, my marriage, my job and most importantly my sons life, I've been absent for so long living a life of fertility concerns,,, It is time to let it go. My daughter has taught me more lessons than I could've learned on my own... I am her mother here on earth or in spirit, she is my daughter and when the time comes we will be together. Thank you all for being there for me, I will stay in touch and Thank you Kammie for our talk,it goes much further than you'll ever really know...Istherehope",
            "post_id": "2413807",
            "timestamp": "1201356795",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I just wanted to see how you are doing. And I want to remind you that the post-partum hormones hit hard 3-4 days after surgery. A few days after that, once they disappear, things get much easier. It's a lot easier to tolerate those few days of hormonal torture (the insult to injury) if you at least realize that's what's going on and that'll get better. Been thinking of you lots. Hope you have peace. I still have my moments of grief but in general have peace. Our talk went far in helping me achieve that peace. -Kammike",
            "post_id": "2461828",
            "timestamp": "1202064391",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "I'm new to this board but wanted to thank you all for sharing.  My baby was diagnosed yesterday with a cystic hygroma of 4.3 mm.  The baby is 12 weeks and I was told I cannot due a CVS due to a recent bleeding episode.  I am absolutely devastated.  I am 41 and my husband is 39.  This is our first and only chance at being parents, we had to conceive via IVF due to my endometriosis.  Our pregnancy was a miracle in itself as I was given a less than 5% chance success rate, and now this.  I can't even think straight.  I was happy to see that there can be positive outcomes with reabsorption but I am so scared.  The Dr. told us to wait 3 weeks and come back to see if it had changed and do the amneo.  That seems like an interminable wait.  We did not have blood drawn yesterday as he said it wasn't necessary to do another screening test with the results we already have.  However, I am going to request that today.  It may give me some info one way or another.  I understand that a CH >3 is cause for concern.  Is 4.3 off the charts or is there a chance for us?  I wish you all the best.  Thanks, Mary",
            "post_id": "2468872",
            "timestamp": "1202212134",
            "user_id": "user_410113",
            "user_link": "/personal_pages/user/410113",
            "votes": "0"
        },
        {
            "answer": "I'm still breathing that's about it....The procedure was much more difficult  than I had anticipated, well actually the 2 days prior to the procedure when I had the lamineria insertions..... that was literal hell.. Apparently it is much more difficult for women who have had C-sections and whose cervix has never been dialated before.  But, I'm still alive, although sometimes I feel dead inside.  The horomones hit hard , practically paralyzing me and my milk came in which broke my heart.  I was so looking forward to nursing, I nursed my son for 10 months and I truly loved it...Some minutes are better than others but it really is minute by minute for me right now.  I miss her thumping around inside of me, I miss the thought of her inside of me.                 I  have spoken to 2 therapists and have plans to attend a perinatal loss greif counseling group.  I'm trying to work it out, I know eventually it will be okay, I thank God I have my son to love and hug me through out the day. So like I said I'm still breathing and I intend to get better in time. Thanks for asking... I hope you are getting on with things, let me know how you are doing.  Istherehope ( my name is coleen by the  way.)",
            "post_id": "2469348",
            "timestamp": "1202223174",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "So sorry to welcome you to this board, wish you did'nt have to be here at all.. Please don't do too much research on the internet regarding Cystic Hygroma it will literally drive you to the point of insanity and scare the daylights out of you.. Just remember there have been stories of reabsorption and you just have to keep that in your head and in your heartuntil you know for certain exactly whats going on and honestly only an Amnio will be able to concretely tell all.. The hard part is waiting and silently sitting with all this in your headit is torture to say the least. Lean on your friends, pray with your family. Please try to hang in there, some Hygroma reabsorp at 13-14 weeks.  Just keep the faith... I will be praying for you.  Istherehope",
            "post_id": "2469373",
            "timestamp": "1202223584",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "Thank you for your kind words. I am clinging to the hope that there are sometimes positive outcomes.  It is just so hard.  I went back to the dr. today and they decided to do the CVS on Tuesday, which will give me results 2 weeks sooner than the amnio.  They will also do an ultrasound to see if there is any improvement.  The waiting is the worst, we are just devastated.  I may have to accept this is how things were meant to be.  I will pray for you and your family as well, you are very lucky to have a son.  God Bless.Mary",
            "post_id": "2472268",
            "timestamp": "1202261552",
            "user_id": "user_410113",
            "user_link": "/personal_pages/user/410113",
            "votes": "0"
        },
        {
            "answer": "I know what a dark place this is where you are right now, all of us on this thread have been in your exact shoes at one point, not many circumstances are like that. We all no precisely the fear, the pain, the confusion, the agony of waiting. But, what we all know intimately is that hope springs eternal, no matter how bad things seem right now, hope alway makes it's way back into your heart.  I believe it is a true defense mechanism to help us cope. . Never feel stupid or ashamed of maintaining that hope it is the only thing that will get you through to the next minute never mind the next day, it literally is minute by minute. I know there have been healthy babies born, whove started with similar circumstances, just keep praying and thinking positive. You are in my thoughts, please hang in there. Istherehope.",
            "post_id": "2474138",
            "timestamp": "1202312001",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I am so sorry for your situation, but I'm so glad you found this thread. When my baby was first diagnosed, I couldn't find anyone else who was going through what I was going through....and then I found this board. I would just like to 'ditto' everything that Istherehope has said. There are cases that turn out well....I'm one of them. At 4.3 there most certainly is a chance. My baby's hygroma was at 6mm when she was first diagnosed....and now it's completely gone. You absolutely have to hang onto hope...even if there's just a little. Having to wait for the CVS is going to be agony I know, and waiting for the results is even worse. But we've all been there, so feel free to vent your frustrations. I know how hard it is to feel so helpless, but hang in there. My baby's hygroma has been gone for months and I'm still a nervous wreck. I have an ultrasound on Friday just to check her growth and I'm scared to death that the hygroma will have come back.....as ridiculous as it is. I wish there was something I could tell you to do to make the time go by faster, but we all know how this stupid little fluid filled sack can take over your life. Just hang in there and stay strong. You're in my thoughts. Please keep us posted!",
            "post_id": "2474270",
            "timestamp": "1202314182",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I'm sorry to hear that you're having a tough time. But it is natural and to be expected and you are dealing with it in a healthy way. It will never be \"easy\". But it will get easier. I still think about it most of the day so I can't say I'm out of the woods either.  It almost feels like this surreal thing that never happened, yet it has left an emptiness that is hard to figure out how to fill. Always feel free to call or write. And yes, Colleen...just wanted to respect your online privacy! xo -KammieMary, I'm so sorry that you are going through the hell that we all have gone/are going through. The wait is nothing less than excruciating. There are good outcomes and there are bad. And there is absolutely no reason to give up hope as your case very well could have a good outcome. Unfortunately no amount of research can really help indicate what they outcome will be, as each case is unpredictable and there is nothing you can do to affect the situation. (A terribly helpless feeling I know!) That said, it made me feel better to be doing \"something\" so I researched non-stop. All I can say is that we humans (and women for sure) are stronger than we know. And in addition to having hope that everything will be fine, dont' forget to have faith that whatever the outcome, with proper love and support, you Will survive it. I'm thinking of all you guys.Megan, you are the little beacon of light!",
            "post_id": "2474747",
            "timestamp": "1202320492",
            "user_id": "user_380031",
            "user_link": "/personal_pages/user/380031",
            "votes": "0"
        },
        {
            "answer": "I am so happy to have found this site. I am 12 wks with my first baby and found out the baby has a 2.9mm cystic hygroma. I have done all the internet research and met with the genetic counselor. Everything I have heard and seen has been negative. Reading your posts has given me some hope and support. I have spent the last week and a half in a daze of fear and hopelessness. I feel like I can't live a normal life again until I have some answers. I did the First Screen blood test to at least get some answers although I know those aren't conclusive. I go back on the 19th for another u/s and possibly an amnio at that point. The waiting is agony. Fortunately, I have a friend with Turner syndrome so she has been very helpful to talk to. For anyone with that diagnosis, she says she doesn't feel it has hindered her life at all. She didn't even find out she had it until she was 17. She is now 37 and working on her doctorate degree and teaching school.Thanks for giving me some hope with all of your posts.  I just pray we have a good outcome like many of you have.God Bless you all, Denise",
            "post_id": "2489025",
            "timestamp": "1202596892",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "I'm glad you found this site too! You're right, there are mostly negative outcomes when you search the internet. However, I found it helpful in preparing me for the worst and being able to ask the right questions at my doctors appointments. Really, educating myself on every aspect of it was extremely comforting to me....I still don't know why! You're in my thoughts and I'll be praying for good news on the 19th!!",
            "post_id": "2495135",
            "timestamp": "1202744631",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Thank you for your response. I have been preparing for the worst, but praying for the best. I did find that it is easier to talk to the doctors and understand what they are talking about after educating myself on the internet. I have a Biology degree, but this is all another language to me. Your story has certainly given me some hope. Thank you for your prayers and I will keep you posted as I find out some answers.",
            "post_id": "2495334",
            "timestamp": "1202747808",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "So sorry to welcome you to this site, but thank God for it or you would just go insane..The only thing that I can tell you at this time is to keep hope and faith alive and close to your heart, never ever give up hope until all the tests are in..It's been my undersanding that Hygromas under 3.0mm is considered normal and that most of the time if U/S were performed at 14 - 18 weeks no abnormalities would be detected, as most reabsorption occurs during these weeks.  I hope and pray that that is the happy ending to your story.What you are doing is probably best, knowing exactly where you are heading and what potentially can happen is probably the best you can do for yourself as everything else seem so out of your control. It's the waiting that silently tortures you, just know that all of us on this thread have been exactly where you are and we are all still breathing so hang in there and we will all keep you and your baby in our prayers. God bless .... Istherehope",
            "post_id": "2497549",
            "timestamp": "1202776716",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I had another u/s today and the doctor said things are looking reassuring. The baby (a girl!) is developing well and the fluid is reabsorbing. He attempted to do an amino. today, but it was too early and it didn't work. I have to wait until the 29th to try again. My blood test came back as 1/78 for Down's and 1/10,000 for Trisomy 18. Although 1/78 is not normal, he said that is wasn't bad considering everything. I am starting to feel a little more positive, but won't really be reassured until I get the results of the amnio. and everything is ok. Thank you for your thoughts and prayers. I will let you know what happens after the amnio.  God Bless-Denise",
            "post_id": "2533476",
            "timestamp": "1203462691",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "I got my FISH results back and they were normal!! I am so relieved. My Doctor said to be \"cautiously optimistic\" as I wait for the rest of the results.",
            "post_id": "2603131",
            "timestamp": "1204757794",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "What a blessing, Thank God!  Keep the faith, everything sounds real positive, I'm happy for you.Keep us posted.Congratulations,Istherehope",
            "post_id": "2608733",
            "timestamp": "1204853110",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "This past wednesday I went in for my 10 weeks obgyn appointment, relieved after finding a heartbeat at 6.5w, I was  cautiously optimistic for this pregnancy-I had 3 misscarriages over the past 2 years.  My Dr. found a shadow at the back of the babies neck- not too worried but sent me straight to the Pernatolgists office.  And there I sat with a tech and 2 Dr's standing over the screen shaking their heads.  A nuchal fold cystic hygroma of 3.1 at 10w3d.  I went from that room into a meeting with the genetic councelor-who said a measurement of 3.1 at 10w is far more concerning than at 13w and then  2 hours later I had a transabdominal CVS.  I'm now waiting for the results.  You all have made it far more tolerable with touching stories of bravery and good news.I wanted to share that I've now learned the my step sister (who has 5 kids)  had 2 with cyctic hygromas-both born happy & healthy.  Her oldest had a hole in his heart and a cyst on his brain, and again born healthy and normal...if not a little overly rambuncious.A maternal viral infection can also cause a cyctic hygroma...which is interesting for me since I have cold sores(a herpes virus) and had a pap come back hpv+ years ago, so both those viruses are in my body dormant or not....interesting to ponder.  Hopefully the CVS results come back all clear and I can move forward with hope.Thank you all for your stories...they help alot.",
            "post_id": "2647652",
            "timestamp": "1205595071",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "Hearing that your step sister has had two healthy children following a cystic hygroma diagnosis is very very optomistic. I never ever heard of it until I had my 12 week U/S with a high risk doctor. MY OB sent me after seeing an \"echo free\" area behind the neck at 10 weeks. I measured 4.0 mm at 12 weeks, who knows what it measured at 10 weeks, my OB's office is not equipt with high tech U/S. Through it all though I never gave up hope, not until the last diagnostic test was performed.  Our story did not end happily, but that does not mean that yours won't. Just keep the faith, keep praying, educated yourself and talk to others on this site.  Keep me posted. Sending you blessings.Istherehope",
            "post_id": "2661821",
            "timestamp": "1205883920",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "How are you doing, any news yet? I've checking the site every now and again hoping to hear good news.Prayers,Istherehope",
            "post_id": "2661830",
            "timestamp": "1205884055",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "Well, the perinatologist called this afternoon to tell us we are having a chromosomally NORMAL girl!!  A huge sigh of relief...we're now back to being causiously  optimistic.  I'm sceduled for a 20 week anatomical US and a 22 week fetal echocardiogram, the Dr. seemed optimistic that this first big hurdle had been met.  So I'm hoping my daughter gets her baby sister she wants so badly at the end of this.Istherehope- thank you so much, for all of your kind words and courage.  Please do not lose hope of having a successful pregnancy.  Please do not feel guilt- you have done the right thing...my sister is the head of the Down Syndrome Connection in our county, and has heard too many tragedies of heart complications in early childhood than she cares to think about.  Because of a gene mutation I have (discovered after my last MC) I take massive doses of Folic Acid (not just the rda of 400 mcg but 4-5mg)  and have for the last year.  Some of the most current research is showing that folic acid is doing more than just preventing Spinal Bifida, certainly in women with this mutation.  So keep the faith and double down on that Folic acid.  I truly believe that your heart and mind will heal.  Blessings to you.",
            "post_id": "2666876",
            "timestamp": "1205975173",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "I got the final amnio results back and everything is NORMAL! We were so happy to hear that. I go back at 20 weeks for the fetal echocardiogram.Istherehope- Thank you so much for asking about me and for all of your thoughts and prayers. My doctor has even said that this is an answered prayer. He had little hope for us at the beginning. The genetic counselor said taht we have gone from a 30% chance of having a healthy baby to about 85% now.God Bless,Denise",
            "post_id": "2682199",
            "timestamp": "1206311901",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "I just thought I should check in here! I had my baby girl, Mackenzie Laurilyn, on March 3rd and am so happy to tell you all that she is just fine! She is absolutely perfect. She has a little excess skin on the back of her neck from the hygroma....but I couldn't care less! I will say though that the worry has not stopped. My doctor offered another chromosome test that would be more accurate and specific than the amnio, but we declined. We are however going to get another echo done on her heart....just to be sure. I had one done while she was in utero, but now that she's here, her heart can be seen much clearer. I'm so glad to see all of the recent good news on this thread! I'll continue to pray for you all!",
            "post_id": "2719309",
            "timestamp": "1207006148",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Congratulations on your baby girl! I am so happy that she is a perfect baby. Your story gives hope to everyone else.",
            "post_id": "2740919",
            "timestamp": "1207397077",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "I am so happy to have found this site.When i was 11w5days pregnant, one of my twins was diagnosed as CH,at that time, the specialist just told us that it looked like very serious,because the fluid is from baby's neck to back and we can see it clearly from the screen,but the other baby is normal.After doing some internet research,i was so upset and sad.We waited until 15 weeks to do the amnio, Fortunately,the result comes out normal！And he just said the hygroma is \"much less\",but we didn't know the size of it.Now i am waiting for the 22nd weeks echo (now i am 20 weeks) to check the baby's heart.The stories you shared here give me much courage and hope.I know i need to be strong and optimisic and prey for my babies' health.Bless everyone!",
            "post_id": "2790247",
            "timestamp": "1208397461",
            "user_id": "user_482707",
            "user_link": "/personal_pages/user/482707",
            "votes": "0"
        },
        {
            "answer": "im 12 weeks pregnant and doctors found nuchal fluid 9.7mm  i was devastated because i knew what that meant my baby was given a very bleak outcome so i did the cvs and got the fish rersults yesterday so far no chromosome disorders but im still terrified. i would like to know if anyone had a normal baby after having that much fluid",
            "post_id": "2820940",
            "timestamp": "1209017975",
            "user_id": "user_489526",
            "user_link": "/personal_pages/user/489526",
            "votes": "0"
        },
        {
            "answer": "Hi....I'm so sorry to hear about this. My baby's nuchal fold was at 6mm at 12 weeks. Significantly less than yours...but significant nonetheless. The fact that your baby has normal chromosomes is HUGE! My entire story is posted throughout this thread, but my outcome was good. My baby was born on March 3rd perfectly healthy. I'm starting to think that just maybe cystic hygromas occur far more frequently than anyone realizes. Isolated cystic hygromas have much better outcomes than those associated with hydrops or chromosome abnormalities. So already, your baby is ahead of the game. All you can do...as frustrating as it is.....is wait. Every ultrasound will be just as terrifying as the one before....but hopefully there will be less and less fluid every time you go. Hang in there! We've all been exactly where you are so please....vent....ask questions....do whatever you need to do because we all know what you're going through. Just know that there is a good chance that everything will be just fine and this will all become a distant nightmare. Good luck to you and please keep us posted!!!",
            "post_id": "2822508",
            "timestamp": "1209055242",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "thanks for your post it has given me alot of hope its great you had a healthy baby i hope my babys outcome is like yours and your right the internet is driving me crazy i havent read anywhere where anyone had a baby with that much fluid at 12 weeks however i refuse to give up hope  and this  website makes me realize im not alone i know its along road ahead filled with ultrasounds and checkups and god knows what else but everytime i go i will  remember your story and get strength knowing you had a healthy baby thanks again and good luck to you and everyone on this site keep us posed about babys development bye for now",
            "post_id": "2830205",
            "timestamp": "1209186731",
            "user_id": "user_489526",
            "user_link": "/personal_pages/user/489526",
            "votes": "0"
        },
        {
            "answer": "I just found out my baby has a ch at about 7mm.  I prayed and decided to wait until the 16th week to do the amnio.  I am just very sad and had never heard of such a condition.  I am just going to continue to pray and take the amnio in a few weeks I am 11 weeks right now, but would like to wait to see if the condition will correct itself.  Oddly enough I also had a abnormal placenta and it corrected itself which was strange.  Please keep me in your prayers.  I will let you all know the results when I do the u/s in a few weeks.  I am glad to read about all the miraculous stories.  God is truly a miracle worker.",
            "post_id": "2863043",
            "timestamp": "1209875255",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "I found this discussion group and can't stay away from it. We were diagnosed with our cystic hygroma at 12 weeks. I am now 14 weeks pregnant. Our cvs was normal and our geneticist says it's now a 40 % chance of a normal outcome since we got through the first hurdle. We have to look at the heart and anatomy at 18 weeks.We have 2 children already that are 3 1/2 and 1. I am 40 so this is our last try for another child. The research out there on the internet is doom and gloom. My goal is to find out how many babies are born alive and what are their outcomes and chances of being normal and healthy. I did find one study with a 20% chance of normal outcome. What do structural problems include? Is it just heart and/or skeletal? Anyway, I will keep all of you updated on our progress so we all get more information on outcomes associated with cystic hygroma. My first son has some special needs with club feet and low muscle tone so we are really praying for a healthy child this time. His therapy schedule is quite intense and he's doing great but parenting a child with any special needs is very challenging at times.We have hundreds of folks praying for us. i will pray for all of you too.Gina",
            "post_id": "2881047",
            "timestamp": "1210252139",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "The power of hope. Until just a few minutes ago my wife and I felt so alone because we are 14 weeks and were introduced to the term cystic hygroma yesterday. The growth is located on the neck of our little one and very clear on the ultra sound. The OBGyn immediately scheduled an appointment with a specialist and that is on Monday. Like most we have been very dazed about the prognosis from what is on the internet until we found this post. I can't express the relief from reading the positive outcomes from many of you. We don't know the size or details just yet. I think the best approach is to be positive and keep sharing even for those who dont have happy a ending your are at least among people who can truely relate to your fear and pain. We will be praying for everyone. C.",
            "post_id": "2884616",
            "timestamp": "1210308327",
            "user_id": "user_503231",
            "user_link": "/personal_pages/user/503231",
            "votes": "0"
        },
        {
            "answer": "Are you scheduled for the amnio test? Did you find out the size of it? ours was 6mm. Because of my age they were convinced it was chromosomal but all of the chromosomes look great. Now we are in the 40% survival rate area. It's all up to the heart and the structure of the body growing like it should now. This is tough stuff since we are all so far along. We are actually 14 weeks now too. I just want to know one way or another but that's not possible at this time. It's all in God's hands. That is for sure.I will be keeping you in my prayers too.Gina",
            "post_id": "2885386",
            "timestamp": "1210335310",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "You've come to the right place...this is the one place I found hope and relief while waiting for those CVS results.  The Internet and Genetic counselors are all doom and gloom.I had a CH of 3.1 diagnosed at 10weeks (not so bad if found at 12 or 13 weeks- bad at 10weeks)  So I had a CVS done that afternoon.  Thankfully we were told that we were having a chromosomally normal girl.  Our Perinatalist seemed to think that those results were the main hurdle.  We scheduled the 20week (May19th) anatomical US and  a 22 week fetal echo cardiogram.  I'm still a little nervous, but my OB and husband are pretty confidant everything is okay.  I will post results whatever they are.I had a girlfriend who is an MD read a number of things I found so she could translate for me.  She believes that when not chromosomally related a CH is most dangerous when found along with Fetal Hydrops (additional fluid/swelling).  If it's and isolated CH that is found in a chromosomally normal fetus outcome rises to 80% (I think that's what it is).  Certainly those odds appear here with the women on this board.My step sister has 5 children, 2 were found with CH and are happy healthy rambunctious children.   My girlfriend the MD...all three of her children had thick nuchal folds~all three normal if not obnoxious!  There is a lot of hope out there....stop reading the Internet....the fact of the matter is we know too much too early now and though Doctors may have some clues and evidence as to what it all means.....they DO NOT know everything.Good luck to you both!  I'll keep you posted for the next few weeks, I'm due early October I'll let you know how that goes too.",
            "post_id": "2885612",
            "timestamp": "1210339237",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "I'm so so glad you all found this thread. It's incredible how many people this has attracted. When I first posted here, the last post was in 2005. I am one of the positive outcomes. My daughter is 2 months old now and in perfect health. We've had all of the follow up tests done and she's completely normal. I know the fear and the torture of the unknown. Personally, I found the internet to be helpful. Not because of all the good things it said about CH (there wasn't much of that) but because I was able to educate myself and somewhat prepare myself for the worst possible end. I found it helpful when talking with the specialist....the things he said weren't so foreign after I had done my research. It also enabled me to ask questions that I knew were important. Just know, there is hope. And just as Jed868 said, isolated hygromas have a far better prognosis. The chance of survival and all around good outcome goes from 9% to 84%. The waiting is so gut wrenching, I know. Hang in there and know you always have a place to scream here on this board. We've all been there. Good luck to you all....you're in my thoughts.",
            "post_id": "2886635",
            "timestamp": "1210354590",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I don't know what studies you have found, but I thought I'd share with you a few that I found to be the most informative. I have them printed out and have kept them. The first....and the longest is by the American College of Obstetricians and Gynecologists. It's in Volume 106, No. 2, August 2005. The second you can find at www.genetics.emory.edu....just search cystic hygroma. and the last is just an article at www.emedicine.com/radio/topic205.htm. I hope you find at least one of these as helpful as I did. The first one is really long, but very in depth. They're not going to tell you that everything is definitely going to be fine, but at the very least you'll have a more rounded understanding of this condition. Keep your dictionary close by and look up any words your not sure of....that's what I did. Good luck!",
            "post_id": "2886662",
            "timestamp": "1210355047",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I am copying your story to keep it as a positive source for times of distress. I am so grateful that you posted the news of your beautiful baby.About the studies, I read all 3 of them. It's the Malone study(the long one) that gave about a 17% chance of having a healthy baby when initially diagnosed with the cystic hygroma during first trimester. It then goes on to analyze the outcome of normal babies excluding chromosomal and structural malformation issues...95% which is amazing. That's when you get to the end of 2nd trimester and jumped through the other hoops. Who knew? This is a very difficult process to go through. We have 4 more weeks of waiting to analyze the heart and anatomy. I know if I was you, I'd be on my hands and knees thanking God daily for that little girl. I am sure that you are probably doing that already. Thanks again for your encouragement.Gina",
            "post_id": "2887578",
            "timestamp": "1210367957",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Megan is right about the informational part of the Internet, it helped alot esp talking to the Perinatalist after the test results came in.  I even stumped him once or twice with questions:)  But I did get overwhelmed even hysterical once or twice with the doom and gloom.  Since your CVS results were good~I just meant to try and relax a little.  My step sisters two CH kids were born totally normal just like Megan's little girl.I did find an article by a Stanford Geneticist \"Ask the Geneticist\" about CH and MTHFR~ a gene mutation I have.  He said that it is possible for the MTHFR to make little microscopic blood clots in the development of the Lymphatic System that block it and produce the fluid build up and can just as easily unclot and make everything flow properly again.  That's what stumped the Perinatalist....he said it had nothing to do with MTHFR...when I mentioned the blood clot theory he was dead silent.  Hmmmm.....they don't know everything!I have found in the last two years between miscarriages, CH and gene mutations that it's the women on these boards that end up knowing more than most Dr's.Keep the faith!  Good luck to you!",
            "post_id": "2889909",
            "timestamp": "1210431388",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "Thanks for your feedback. I am hanging onto every word from the people on this board. One question...have you had any heart or anatomy scans yet? I am hoping to do a pretty thorough scan of the body and heart before 20 weeks. Our hospital (duke) says they can do it but I'm wondering if you were able to get a good look at the heart as of yet or the spine, and bones.This is so scary but am trying to keep faith in God. Please keep us posted of your results from the 19th of May. That is so close. I know you must be sitting on pins and needles right now. Also, how big was your hygroma and at how many weeks? I go in to the docs tomorrow to check for a heartbeat and see if the cyst has grown any. Our geneticist says it might be growing up until 16 weeks or so.Hope to hear from you soon...and am praying for you.Gina",
            "post_id": "2895303",
            "timestamp": "1210597427",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "I am so glad to have found this forum, I am at 13 weeks and have a 6mm growth on my baby, we had a CVS today and will find out the results tomorrow, inc the gener. My sisters youngest had a higher # and her daughter had 2 holes in the heart, one closed up, and the other is going to be operatedon when she is 5,i will keep reading these boards, they are very uplifting,",
            "post_id": "2896925",
            "timestamp": "1210621760",
            "user_id": "user_506064",
            "user_link": "/personal_pages/user/506064",
            "votes": "0"
        },
        {
            "answer": "Welcome to this board. Great story about your sister. You sound so calm and together. It's great to hear that in your writing.I have a question for you about your sister's child. Could they detect the hole in the heart via sonogram prenatally for your niece? Also, does she have any other medical issues as a result of the cystic hygroma?It's amazing how many of us are pregnant with this diagnosis. I think Megan is so right about the fact that probably back in the day many babies had this but it just resolved by the time we did sonograms back then. Hoping that is at least the case with all of us.Glad you are here to discuss this with all of us.Gina",
            "post_id": "2897383",
            "timestamp": "1210628778",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "thanks for the welcome! I am trying to stay +, this am with the genetesist was tough, she was an emotional person, and i kept thinking the worst, as they kept talking about the worst... my sister daughter Caroline, is 3 1/2 now (will be 4 in sept)m they found the heat defects prenatally, chromosomally she was fine, However she is a developmentally delayed girl, has low muscle tone, and they havnt found an exact diagnosis. She isn't talking yet, but she goes to a special school in town with other special needs kids and LOVES it!  She walked later, 2 3/4 age, but now she loves running after chickens :)  She goes to dr's reguarly, as she has slow growth, and they have tested everything imaginable, but she loves life, loves hugging and cuddling with people and loves reading magazines(not books), from cooking magazines to good housekeepingso I don't know if they are related, her devel probs with the growth she had, I will certainly keep you updated on my results and I look forward to reading more about everyone else,thanks",
            "post_id": "2897759",
            "timestamp": "1210633974",
            "user_id": "user_506064",
            "user_link": "/personal_pages/user/506064",
            "votes": "0"
        },
        {
            "answer": "My Ch was 3.1 at 10 weeks.  My Dr. caught it early and called the perinatalist right then and there and rescheduled my 12 week scan for that morning.  I had the CVS that afternoon.  The Counselor said that a 3.1 at 12 weeks wouldn't have been as big of a red flag as at 10 weeks.  At 10 it was a HUGE red flag.  Our perinatatlist can do an anatomical scan before 20 weeks but with CH feels that a lot is resolved at 20 weeks that may not be at 16 or 18.  My Dr. did one quick look at 14 weeks and the fluid already looked as if it were going down.Good luck~ I'll keep you posted.",
            "post_id": "2899524",
            "timestamp": "1210680854",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "I'm so glad those studies were helpful to you. Just a note about anatomy scans and echos....I had both done. I found the anatomy scan to be extremely unnerving. The peri said that my little girl's arms and legs were \"short\" for her age of gestation (yet another sign of a problem). But when I went home and did some research I found that usually the arms and legs catch up with the rest of the body later on in pregnancy so there was no way he should have been able to say with confidence that it was an issue....in my opinion anyway. I was amazed though at everything he was able to see from an ultrasound. He was able to see that her heart and kidneys were normal. He also kept switching to 3d to get a good look at her facial features to look for 'markers' for downs. When I went for the fetal echo, I couldn't believe that they could see anything from that machine! It didn't look nearly as clear as the one at my peri's office. So even though the cardiologist said her heart was fine, I decided to take her in for an echo after she was born...just to be sure. Thankfully, the first cardiologist was right and her heart was perfect. It just goes to show that the worry doesn't stop once they're born, but at least with baby in arms you won't feel so incredibly helpless. And yes, I do thank God everyday for my healthy little girl. It still brings me to tears thinking about all that we went through. I'm constantly touching the back of her neck....she has some excess skin from the hygroma. I actually love it....it's like a little reminder of how lucky I am and how grateful I am.",
            "post_id": "2900189",
            "timestamp": "1210692212",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "We just had an ultrasound. We are 14 weeks and 6 day. The doc was happy that the anatomy looks good at this point. It seems that we are club feet free which is great since my son has that. However, she was concerned the hygroma hasn't gone down at all. It hasn't grown either. It is about 7 mm and goes from the back of the nect to the top of the spine. She said it should have reabsorbed by now. I am having an anatomy scan in 3 weeks and the echo early in 3 1/2 weeks. My head is hurting from all of the numbers and stuff they are throwing at me...syndromes, genetic mutation possibilities, etc.I keep reminding myself that God is in control of this and try to refocus when this happens. So a a great report of the anatomy but still praying that the hygroma goes down a bit before the next visit at 18 weeks. Thanks for your feedback. This is one of the toughest things I have ever dealt with besides my dealing with my little boy and his physical challenges. Your feedback is really helping me with my patience in all of this.Megan, glad you told me about the leg anatomy concern. These doctors tend to always look at the negative. I guess they need to prepare us though.Gina",
            "post_id": "2900289",
            "timestamp": "1210693714",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hello everyone we just wanted to let everyone know that we went to the perinatatlist yesterday. He was one of the best doctors you could ever meet. He spent an entire hour and half with us and explained everything in detail. The Dr. even shared that he and his wife had a child with a ch that didn't make it so he could really understand both as a Dr. and a parent what we were going through. The positive things we have going for us is that the heart beat is very strong and normal. We also found out that the baby is going to be a boy so that eliminates turners syndrome. The Dr. said that our little boy appears to be growing normal except for the cystic hygroma which measures 9mm which has him very concerned.We are scheduled for an amnio on 5/29/2008 when we are at 17 weeks. The Dr. said it takes 3-4 days for the full results but until then try to relax and approach each day one at time. He reassured us when we left that he has seen many miracles happen in the womb and that hope, support and prayer are the best medicines for anyone facing troubles in their life. Thanks to everyone who is sharing we will be praying for all of you.  C___",
            "post_id": "2900327",
            "timestamp": "1210694361",
            "user_id": "user_503231",
            "user_link": "/personal_pages/user/503231",
            "votes": "0"
        },
        {
            "answer": "got my preliminary cvs results  cvs came back normal and it's a boy, now we just wait and see, at 16-18 wks we do a heart scan i believe,does anyone know how accurate the preliminary results are? dh is still worried that it could come back not normal,thanks for the support, i really love reading everyones story, it helps",
            "post_id": "2900909",
            "timestamp": "1210702277",
            "user_id": "user_506064",
            "user_link": "/personal_pages/user/506064",
            "votes": "0"
        },
        {
            "answer": "Thanks Gina for the message of concern and curiosity about my baby. I am at 25 weeks now and everything seems fine. The Amnio was normal and the echo was normal. When I went for what I thought was the \"anatomy scan\" at 21 weeks, they really didn't look that closely at limbs and so forth. They did say that she is about 11 days big for her age and that is also supposed to be a good sign that things are progressing well. He said that I probably wouldn't have a 6 pounder, more like 8. My husband and I are both very tall, so we expect a long baby. When I went back to my OB for regular monthly visit last week, he said that this is the biggest miracle he has seen. He said a 10 wk ch almost always means miscarraige. He said \" I don't know who you are praying to, but say a prayer for me\". I think he needs to read the messages on this site so he can see that I am not the only one that has had a miracle. I hope all of you who are waiting for tests and results keep faith and realize that there is hope. Just keep praying and try to relax.",
            "post_id": "2901744",
            "timestamp": "1210713905",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "That's great news Denise. Your positive story is so wonderful. I know that God has decided what is best for our family and am trying to totally give it up to him but I can't help trying to look for answers more quickly.You and C's perinatalist are so supportive and positive. The doc at our Maternal Fetal Medicine clinic was doom and gloom again today. She focused on the negative of the cyst not going down in size rather than the good news about the anatomy. I'm a big fan of hope and you have given us some. Thank you for sharing.Gina",
            "post_id": "2902468",
            "timestamp": "1210724227",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Our geneticist said there has been just an occassion that she was burned with the quick result test. Therefore she wouldn't do it for us. However, in reading all of the stories here, it seems that it has always been accurate. Stay positive!gina",
            "post_id": "2904071",
            "timestamp": "1210763890",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "I saw a few perinatologists in the practice and most of them were doom and gloom too, only one was a little more positive. The genetic counselor was the worst. It didn't seem like he could find anything positive to say. They wouldn't do the CVS test for me since I could cause a miscarriage by doing the test. They just told me to wait 2 weeks and see what happens. That was very hard. I had to wait until I was far enough along for the amnio. We even tried the amnio a little early and the placenta tented instead of puncturing. I had to wait another 10 days to try again. The waiting is the hardest part since all you do is worry and read bad things on the internet. Just stay on this site and if you have questions, ask the women here. We have done all the scary research and seen all the doctors. Hopefully we can help you get through this time.",
            "post_id": "2908723",
            "timestamp": "1210849093",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "The early results are almost always an indication of complete normalcy. I was worried about that too so again, I did my research:) our FISH test came back normal followed by normal full amnio results. I'm sure yours will be the same!!",
            "post_id": "2909684",
            "timestamp": "1210867767",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,We had our Dr. appointment today and the ch was completely gone in 2 weeks.  The nurses said it was a complete miracle it measured over 10mm 2 weeks ago and now its completely gone.  We have the amnio soon, please keep me in your prayers.  I would encourage everyone to really pray and I started taking a ton of folic acide.  I dont know if it helps but I am taking a lot of it and the baby heart looks great and the baby actually looked great.  Keep up the faith and just continue to pray all you moms! We will make it!!",
            "post_id": "2912095",
            "timestamp": "1210903154",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Yeah. I love it Nassime!!! I am taking folic acid and loads of it since we concieved. I think I take 2400 mcgs a day. Is that what you take? And prayer is actually the most important. I am so happy for you and I know you are breathing better now. You are still in my prayers along with the rest of these ladies.Gina",
            "post_id": "2913259",
            "timestamp": "1210937945",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "We had our 20 weeks anatomical scan yesterday and the fluid was all gone!!  Growth was normal.  We saw all four heart ventricles and blood flow was good....She even waved and sucked her thumb!!We have the fetal echocardiogram June 4th, but the tech and the Doctor thought everything looked good yesterday.  Huge relief!I have to go back at 30 weeks to take another look at the placenta because it was a little too close to my cervix~ clearly this isn't going to be a worry free pregnancy!  But at least some of our biggest hurdles are over.Good luck to all~ keep the faith.",
            "post_id": "2931059",
            "timestamp": "1211294134",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "That's WONDERFUL news!!!! I'm so so relieved for you!",
            "post_id": "2931211",
            "timestamp": "1211296045",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I am taking 2400mg of Folic acid also with my prenantal vitamin and praying for a healthy baby.  Our amnio is coming up soon so please keep us in your prayers.  This board has been a blessing it does give us all hope in a pretty scary situation.  I am going to continue to pray for all of you and your little people.  GOD BLeSS!!",
            "post_id": "2931555",
            "timestamp": "1211299529",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "We got bad news. The cvs test we took was contaminated with maternal cells. They took my blood sample per my request to check it. This is 1/1000 chance of happening in which it is contaminated in both of the tests they conduct. Unfortunately our child has trisonomy 13. It's pretty fatal so we are very sad. It's related to my age. Good luck and my prayers are with all of you.Gina",
            "post_id": "2978640",
            "timestamp": "1212234586",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry.  After losing three pregnancies last year I still can only imagine your grief.  You sound as though your faith will get you through.Keep taking that folic acid if you decide to try again.  Last summer while waiting before TTC I did a detox diet, added antioxidants to my supplements and vitamin C.  Who knows if it makes a difference, but since Grandpa cured his own cancer with that kind of stuff, I'm a believer.Snuggle up to your family and try and look past today and toward a future full of joy, happiness and peace.",
            "post_id": "2982025",
            "timestamp": "1212329589",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "Dear Gina,I am so sorry for your bad news. I haven't posted on here since Jan., but every now and again I check in. Our baby had a 4mm cystic hygroma, and our amnio results revealed T21. We were, needless to say devastated beyond belief. We did finally choose to terminate after much pain and anquish. I won't go into our experience too much as some people have different beliefs. I feel what ever your decision is it will be made with love and selflessness. If you want to contact me I will give you my phone number. This is a heartbreaking place to be in, may you find some comfort in your heart.Coleen (istherehope)",
            "post_id": "2988871",
            "timestamp": "1212458596",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "gina sorry for your new, wishing you the best.we had to go for a fetal survey u/s today at barely 16 wks, geneticist told us to come but u/s techs were annoyed that we were there and said it was too early, but then proceeded to say the heart looks poor and it doesn't look good. we did fortunatly meet with a nurse who said it is too early to tell and things  can be diagnosed yet, we go in three weeks for the echo for babys heart.",
            "post_id": "3002316",
            "timestamp": "1212704158",
            "user_id": "user_506064",
            "user_link": "/personal_pages/user/506064",
            "votes": "0"
        },
        {
            "answer": "We had our fetal echo this week and everything looked good.  We got to see all of the valves opening and closing and the blood flow was lit up so we could see flow.  The Doctor reminded us that he can only see BIG problems and not the little ones.  So for now no BIG problems.Keeping our fingers crossed for the next 16 weeks!",
            "post_id": "3004658",
            "timestamp": "1212758422",
            "user_id": "user_451023",
            "user_link": "/personal_pages/user/451023",
            "votes": "0"
        },
        {
            "answer": "The cystic hygroma is gone and we took the amnio yesterday.  The baby knew something was in womb and starting hitting the needle back and forth like a basketball.  Thanks God the Dr. knew what to do!! It was amazing, they told us that the FISH results will be back in 24 to 48 hours.  They also told us that the heart had a malformation and we needed to go to the pediatric heart specialist.  I was really hurt, I was hoping things would go well since the cystic hygroma cleared up so fast.  I have to keep praying and realize that there is nothing I can do about this.  I can only pray and let God do the rest. Gina I am so sorry to hear about your little person.  I will keep you in my prayers.  This is a very tough process, they told us it was a girl and I have a 2 year old girl and a 3 year old boy.  So I have been crying all morning I just want the baby to be healthy so she can play with her brother and sister.  Please keep praying for my little one that she makes it.  Thank YOU!",
            "post_id": "3004836",
            "timestamp": "1212761191",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "How many weeks are you to do the echo?  Exactly what did they do they told me my baby has a malformation but the heart beat was regular.  So, I dont know what to think they are sending us to a pediatric heart specialist.  We are waiting on our amnio results to come back early next week to rule out any abnormalities.  Keep me in your prayers.  I am 16 weeks right now!",
            "post_id": "3007381",
            "timestamp": "1212801889",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "I am keeping you in my prayers while I rest at home. Our baby's heat beat stopped a few days after we got our results back from the amnio. WE had a D&E yesterday. Our baby did a have a chromosomal abnormality. I just can't believe the heart stopped beating so quickly after the results came back to us. I know it was God bringing her home to be with him.I will be praying for you consistently. Keep us updated and keep the faith. Miracles happen all of the time. OUr docs were going to do the echo as early as 18 1/2 weeks.Gina",
            "post_id": "3008586",
            "timestamp": "1212840730",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hi Gina,I got the test results back and the doctor said we have Trisomy 18, Edward's Syndrome and we should terminate because it is fatal.  I want to keep the baby and dont want to terminate the pregnancy.  What is a D&E, my primary doctor just called and said he wanted to start the process of the D&E and then after the baby passes and if the placenta doesnt come out he would do a D&C.  I am so out of it right now I just dont know what to do.  The good thing is my doctor who I have had for over 8 years can do the procedure.  He said typically he would not do it because of morality issues but Edward's Syndrome is fatal.  Please keep me in your prayers there is still hope for other moms I do have two beautiful children and I have to thank God for what I already have.",
            "post_id": "3017073",
            "timestamp": "1213040111",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "I am so sorry about the diagnosis. A d&e is a dialation and extraction. It's very emotional because it ends the pregnancy. Even though our little one passed before the procedure, it's still a really difficult situation. I'd be happy to help you through it all. Our diagnosis was also fatal.You need to decide if you can live with the consequences of miscarrying naturally and waiting it through or doing it now. I know with my 2 children and one having some special needs, it was easier to have this all end sooner rather than later. Fortunately God took care of it his way which was a true blessing.I am keeping you in my prayers. Do know you aren't alone. Women are strong beings and you will get through this. I know I can't take my eyes off of the 2 little ones I have now. They are such a blessing and yours will get you through it. I promise.Gina",
            "post_id": "3017868",
            "timestamp": "1213052564",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Thank you this is the most painful thing I think that has every happened to me.  I wonder why this happened.  I can really feel the core of my being at this point it is horrible.  I spoke to the doctor in detail and he's going to give me a D &C and induce the labor so it can pass the baby.  I want to carry the baby to term and I dont want to carry the baby to term.  I have mixed emotions.  They told me due to the heart defect the baby will surely die inside and had a very slim chance of making it and would definately die in the first days of life.  I named the baby Hannah and I am not going to let her death be in vain.  I will try to find what God is trying to say to me and what I have learned.  I really look at my family different now.  I am so grateful for the 2 little people I do have and a husband. All of the women who read my message please dont get discourage, keep praying and you can definately have a different outcome.  Please pray for me I can feel myself slipping away I am not really in it right now my mind is drifting so much pain and hurt.  I really was looking forward to this baby. I have to give myself time to grieve.",
            "post_id": "3018841",
            "timestamp": "1213066100",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Nassime,I am so sorry. Please email me directly and I can walk you through some of this stuff. I had a friend go through this same experience in November. she is pregnant now with a healthy baby. My direct email is ***@****. I'm 4 days past the D&E and things are looking and feeling better emotionally. I named my little girl Faith. It helps me connect spiritually with God about the whole situation. All of my friends and family refer to her as Faith as well. How can we not? These are little beings who have been a part of our lives and that we love as our children.so send me an email for some more one on one support. I'd be happy to help. I know having a friend go through it helped me alot.It seems as though the cystic hygromas associated with chromosomal abnormalities are pretty severe. It's wonderful to know about the women here delivering healthy babies too. We need to keep the faith for all of them.Gina",
            "post_id": "3019740",
            "timestamp": "1213095708",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hi Gina,Your real email did not come up on the site.  I am leaning towards carrying the baby to term.  I dont want to abort the baby! God made the baby so he can take it away when he is ready.  I will do my part but I just cant kill her, I would rather wait and see what happens.  I know from the doctors she will surely die and if born the average life span is 3 days.  I'm going to call the doctor in a few minutes and tell him I'm going to keep the baby and just carry the baby until God calls Hannah home.  Its just difficult to know she will surely die.  I just feel its not my decision to make, it has been made and I should just carry it out!  I just cant do it right now, I just cant kill her!!",
            "post_id": "3019934",
            "timestamp": "1213100471",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Hi Gina,Thanks so much!! I found a Hospice for Babies and if the baby lives they come out and help take care of it and plan the funeral and everything.  I am so glad I decided to keep her and if she doesnt make it okay but there is a lot of support in communities for these types of situations.  I am so grateful for the Hospice and I am going to look for other support systems in my area.",
            "post_id": "3021475",
            "timestamp": "1213122899",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "I just logged on after not being on for about a month. I am so so so sorry to hear about both your babies. My heart breaks for you. I'm sitting here with my baby girl and because of stories like yours I squeeze her a little tighter. I will be praying for your strength.....",
            "post_id": "3038681",
            "timestamp": "1213481269",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Hi Megan,Thanks, hold on to your little lady with all your might and thank God she is doing well.  I just pray my little lady makes it.  I know the diagnosis is fatal but I contacted a few foundations and some people live til 27 years old and over.  So I am hopeful some of them go to preschool and some are not severly retarded.  I dont care what she is as long as she lives and if she can just grace our home for just a little while.  I would be so grateful!! God bless you and keep Gina and I in your prayers.  It's not easy caring a baby to term knowing it has a fatal condition but with God all things are possible.",
            "post_id": "3040832",
            "timestamp": "1213548242",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "I commend the decision you have made. When we were faced with all of the \"what ifs\" I was certain that I wanted my little girl, in any form, in my life if it was at all possible. I felt the same way....it was not up to me to stop a beating heart. I'm not a religious person, but I knew that it was not within my realm of responsibilities to stop her heart. I can only imagine how terrifying every day is for you and will continue to be. I will be thinking of you and your baby girl....there is always hope. I think it's wonderful that you are being so proactive. You just never know....your baby girl could be the one who shocks us all and I hope with everything in me that she does just that.",
            "post_id": "3042179",
            "timestamp": "1213580192",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Nassime you have given alternatives to many others who may face the decision to terminate or not. I think that is so beneficial. I had no idea there was hospice that could support people through these types of situations. Fortunately I did not have to make any decisions. I prayed that God would take over no matter what and he did that for us sooner rather than later. Every person is different and I feel we all do the best we can in making these decisions. It just depends on what we can handle and you are amazing in what you are doing. I still pray for you and Hannah regularly. Keep us updated.I'm still undecided on getting pregnant again. I know this could happen again and fear going through this again. Besides watching my son in the hospital experience seizures, this was the second most difficult time of my life and I'm sure yours as well.Has anyone out there known anyone to get pregnant again after this and went on to have a healthy pregnancy? My age is 40 and I know the odds are against us. Letting go and letting God.Gina",
            "post_id": "3045371",
            "timestamp": "1213649439",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "I had no idea about hospice for babies either. I honestly don't feel that there is a right or a wrong decision when someone is faced with things like this. It's a personal decision that one has to make for oneself. I think what Nassime has decided to do is absolutely beautiful. I'm so grateful I didn't have to make any of those decisions and I can only imagine how difficult it must be to have to do. I spent some time yesterday researching both Trisomy 13 and Trisomy 18 and it was heart wrenching. I think the only thing worse than finding out that your baby has something like that is what happened to you.....being told that everything is normal and then finding out that there was a mistake and there is actually something wrong. Your strength is incredible. Have you had genetic testing? I would assume that would be the only way to know for sure the possibilities of having a healthy baby. I wish you the best of luck and please know that you and your angel are in my thoughts.",
            "post_id": "3046399",
            "timestamp": "1213666434",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,I am so excited the Hospice nurse is coming out tommorrow and I joined the Trisomy 18 Foundation.  I will have regular ultrasounds and the doctors will continue to monitor the baby.  I appreciate all the support and trust everyone will make the best decisions for there own situations.  I am just so happy I have been in touch with moms whose babies have lived 27 years with some mild to severe retardation.  You just never know with these little genetic defects.  I know if you have a child with a genetic defect the genetic counselor told us that its a 5% chance that it can happen again.  I want to try again after this baby is born...but I honestly cant take anymore.  This is a lot to deal with and come to terms with.  I just pray she makes it most of the babies dont make it.  It is really fatal with some rare 1 out of 8000 living pass 1 years old....but if I can have her lovely face for 1 day that would be the best and if we can bring her home with all her little defects and she lives...I would be so grateful to God...I know my other two little kids will probably drive her crazy.  I pray she can withstand the two of them they are busy!! Gina just pray about things and try again!! Only God knows all children are beautifully and wonderfully made and give it another go!! Dont lose hope all things are possible if you believe.",
            "post_id": "3048884",
            "timestamp": "1213722816",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Thank you for sharing your lovely story with all of us. You truly are an angel and have given hope and encouragement to so many of us dealing with all of these issues. This thread needed to hear from someone like you. What a great inspiration! You have made the worst case scenario (knowing you might lose your baby) a little more tolerable and into a beautiful experience. Thank you for that! I know I treasure my little one with his special needs every single moment of every day. I can't imagine not knowing him and am so proud he picked me to be his mom. Hannah has picked you and that is special and something you will treasure forever. Not every one is up to the challenge and that is okay too. Their journey is just as hard. They also need our support.Gina",
            "post_id": "3050758",
            "timestamp": "1213746887",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Thanks for the words of encouragement and you are right this is a hard thing to deal with.  I wish all the moms the best on any decision its so tough either way, just heart wrenching.  The hospice nurse is coming today at 2pm, I cant wait!  I also found Chrosomome 18 Foundation and Research center that can help with some of the problems.  My doctor has been gloom and doom but all his staff were crying and found all kinds of information for me.  I have to go for monthly ultrasounds to be sure she is growing okay.  I am so grateful for her my husband didnt like the name Hannah so we it to Charity. Thank God for Charity please pray that she makes it...I really want to hold her and bring her home.  Gina when are you going to get started again...dont be afraid.  I will pray for you and all the other ladies also.  Its strange my doctor said its been a spike in abnormal AFP's and a lot of women are coming up with chromosonal abnormalities.  He said he had never seen so many not sure why?  Well I have to go clean up for the Hospice Nurse to come will let you all know how it goes.  They have about 10 offices across the US I will try to find the link to help out other moms. Love you ladies!!  Oh the good news is she doesnt have spina bifida or any other disorders we are going to have enough to deal with so thank GOD for that!!",
            "post_id": "3052816",
            "timestamp": "1213797662",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "HelloI'm glad I have found this site, its giving me lots of hope!Our baby was diagnosed with a CH of 4.3mm at a scan I had at 13+3, we had a CVS, the results of which have come back normal yay!We had another scan at 16+4 and the CH had gone! From what they could see of the heart it looked OK, 4 chambers and a heartbeat. I have a full cardiac scan on Tuesday when I will be 21+3. I am just hoping that it was a good sign the CH went away.Hugs to you all that have had bad news and stay strong xx",
            "post_id": "3061981",
            "timestamp": "1213972197",
            "user_id": "user_541233",
            "user_link": "/personal_pages/user/541233",
            "votes": "0"
        },
        {
            "answer": "That is GREAT NEWS!! It sounds like your little person is off to a great start.  I'm sure everything is going to be okay.  Keep us posted on everything!! YEAH!!",
            "post_id": "3062638",
            "timestamp": "1213981944",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Welcome to this board and congratulations on your good news! Sounds to me like your little one is going to be just fine! With a normal CVS, regression of the CH, and a good heart, there's no reason to think you won't have a perfect little bundle. The process of it all is terrifying...we all know! Hang in there! Good luck on Tuesday!",
            "post_id": "3064850",
            "timestamp": "1214018859",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I agree with the other ladies too. Once you get the green light from the cvs and the heart's structural formation, you should be good to go. I bet all is wonderful. Great news. We are praying for you and only thinking positive thoughts. Let's claim your little one as healthy all around.Gina",
            "post_id": "3068665",
            "timestamp": "1214135886",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hello!Well all was well at cardiac scan and we are having another boy! (we have a 3 year old boy already)I have to go back in 8 weeks as my 'padding' (ie fat!) meant the sonographer couldn't see all the tiny details so they need the heart to be bigger but she said it all looks fine. There is still a thickness at the back of the neck but no cysts.Thank you for your kind wishes.x",
            "post_id": "3078277",
            "timestamp": "1214338031",
            "user_id": "user_541233",
            "user_link": "/personal_pages/user/541233",
            "votes": "0"
        },
        {
            "answer": "Congratulations on your new boy!! That's wonderful that she thinks his heart is fine. I'm a worry wart and took my daughter in for another echo after she was born. I just can't imagine them getting that detailed of a picture of such a tiny little organ through all that gunk! But I suppose maybe they know what they're doing:) Congrats again on all of your good news! I hope the thickness goes away....if for nothing more than your peace of mind.",
            "post_id": "3080120",
            "timestamp": "1214368854",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "My baby was diagnosed at 10 weeks with a Cystic Hygroma around the neck area when I went for my routine ultrasound.  My Doctor suggested I go see a Perinatalogist to do another ultrasound.  I did, and they confirmed it.  That same day I sat with a genetic counselor, which did not give me much positive news.  I left there a wreck.  I go tomorrow (Thursday) to get the CVS test done.  Although I have a lot of faith in God, I'm really scared!! The next 7-10 days are going to be horrible waiting for the results.  I've gone on the internet once and the information is very negative so I stay away.  The only positive thing was this site, which gave me hope.  I'll keep you guys posted.   Please keep me in your prayers.  Take care.",
            "post_id": "3082680",
            "timestamp": "1214421826",
            "user_id": "user_545757",
            "user_link": "/personal_pages/user/545757",
            "votes": "0"
        },
        {
            "answer": "Hi JayDid they give you the measurement? As you can see from my posts our baby's was high and everything seems to be OK.Make sure rest after the CVS.Lots of luck and good wishes to you.xx",
            "post_id": "3082802",
            "timestamp": "1214423860",
            "user_id": "user_541233",
            "user_link": "/personal_pages/user/541233",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry about your news, but I'm so so glad you found this thread. Keep in mind, genetic counselors give you the worst case scenario. My baby was given a 3-9% chance of survival and a 70% chance of having a chromosome abnormality based on the size of her hygroma. How big is your baby's? I know....we all know.....what a dark time this is for you. Just please please know that there is hope. There are a lot of women on here who have had not so great endings, but there are also a lot who have....I am one of them. I wish there was something I could say to ease that awful feeling in the pit of your stomach right now, but the only thing that can do that is a definite answer. You are most certainly in my thoughts and I'll be praying for normal CVS results. We're all here and we all know what you're going through right now, so come on here and scream if you need to. And I'm telling you, if you have ANY questions about any of this...post them on this board. Every single woman on here has done mass amounts of research and combined, I honestly think we know everything there is to know about Cystic hygromas:) Good luck to you and you're in my thoughts.......",
            "post_id": "3083899",
            "timestamp": "1214440850",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I'm sorry about your news, too... and I'm right there with you. My baby was diagnosed with a Cystic Hygroma at just over 10 weeks measuring at 6mm -- it wrapped around the baby's head and down to the bottom of the spine. Another ultrasound later that day confirmed it, and the specialist gave us a grim prognosis. We spoke to a genetic counselor and had a CVS test done a few days later. The hygroma grew to 8mm the day we took the CVS test. We have to wait until Monday for full results, but have since had another ultrasound and the hygroma grew again. I'm at 12 weeks now, and scared out of my mind. These last few weeks have felt like a lifetime, so I understand your fears. Good luck on your CVS test today. I will keep you in my thoughts, and please do the same for me...",
            "post_id": "3086218",
            "timestamp": "1214493895",
            "user_id": "user_546541",
            "user_link": "/personal_pages/user/546541",
            "votes": "0"
        },
        {
            "answer": "I had my CVS test done this morning.  The Cystic Hygrom goes from the babies head all the way down to his butt and on his belly area also.  I'm really worried because last week it was around his neck only.  The FISH results will be given to us on Monday.  I'm so scared!!!!  Thanks for your thoughts and prayers.  I'll let you know how the preliminary results come out.  Talk soon, Jay",
            "post_id": "3086705",
            "timestamp": "1214500907",
            "user_id": "user_545757",
            "user_link": "/personal_pages/user/545757",
            "votes": "0"
        },
        {
            "answer": "Hi,Just continue to pray, my baby had a CH and it measured 10mm it went away in less than 2 weeks so you never know with these things.  My baby does have Trisomy 18 but it doesnt mean you have a genetic abnormality.  Please try to stay positive the health professionals are so gloom and doom...you would think they would try to be more upbeat.  Almost all of the CH's go away so try not to worry.  We are here for you!!  Just continue to pray!",
            "post_id": "3090072",
            "timestamp": "1214575623",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Hi,I received my results this afternoon, it's Turner Syndrome.  I went on the internet and it really scared me (i.e. webbed neck, feet, hands, infertile).  My genetic counselor said there is a 1% chance the I will hold the baby through term.  I'm devastated, I was dying for a girl! My husband has 2 sons from a previous marriage.  If there is anyone out there that can give me more information on having a daughter with Turner Syndrome I would really appreciate it.  Please keep us in your prayers.",
            "post_id": "3102528",
            "timestamp": "1214871612",
            "user_id": "user_545757",
            "user_link": "/personal_pages/user/545757",
            "votes": "0"
        },
        {
            "answer": "Oh hun...I'm so so so sorry. First of all, I think Turners is the lesser of 2 evils. When I had convinced myself that my baby girl had an abnormality, I prayed for Turners. I've never heard the 1% for Turner's....when I was researching, it was 5%. I know that doesn't sound like a lot, but my daughter was given a 3-9% chance of survival and here she sits. Also, there are so many different levels of Turners. I'm going to go see if I can find it for you again, but I had found a website in doing my research where there were video interviews of these 2 little girls with Turners.....I couldn't even tell there was anything wrong. Because you know now, and God willing she survives long enough to be born, they've got growth hormones that will help her to be pretty much normal sized. If she were to have a webbed neck, they have surgery to fix that as well. I know I'm all over the place, sometimes I just don't know what to do with all of this information. Talk to people. Get in touch with women through the web who have beautiful daughters with this syndrome. I know the part you're probably most worried about is whether or not she'll make it at all and my heart aches for you for having to feel that feeling. If there's anyone that knows what you're going through right now it's Nassime. I'm sure you could be a lot of comfort to one another. I guess maybe start by going to www.turnersyndrome.org. It has any information you'll need and links to anything else you need. I'm so so so sorry for your news. You and your little girl are in my thoughts. I'm holding so much hope for her.",
            "post_id": "3103026",
            "timestamp": "1214880096",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "This is the website that helped me a lot in researching Turners. I hope something on here helps you.http://images.google.com/imgres?imgurl=http://www.magicfoundation.org/images/photos/tammy_update.jpg&imgrefurl=http://www.magicfoundation.org/www/docs/115/turner_syndrome.html&h=250&w=200&sz=41&hl=en&start=28&um=1&tbnid=A3QOuND5yhUUIM:&tbnh=111&tbnw=89&prev=/images?q%3Dturner%2Bsyndrome%26start%3D18%26ndsp%3D18%26svnum%3D10%26um%3D1%26hl%3Den%26rlz%3D1T4ADBF_enUS226US227%26sa%3DN",
            "post_id": "3103068",
            "timestamp": "1214880931",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I know it's hard to know about the survival rate but if she makes it, the chances of a normal life are so good. I also prayed my little one would have Turners syndrome. There is a novel out this summer (can't remember the name right now) about the syndrome. It's on the best sellers list currently and is about a little girl with the syndrome and her siblings. It shows how she is not abnormal but those we think are normal are really those having so many issues in life.I know this is hard to swallow right now but research it and find out if this is something you can deal with. These young women have very normal lives for the most part. One woman on the website I found is a top geneticist worldwide...and Megan is right about the hormones out today. I will be praying for you too.Gina",
            "post_id": "3103942",
            "timestamp": "1214907416",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hi,My little lady has Edwards and I would trade with you in a minute.  It's not so bad they have growth hormones to help her grow taller and breast. They can even have children by invitro fertilization.  She will more than likely not be mentally retarded and my genetic counselor met a Turner's girl in med school. You are really blessed I know you are dissappointed but just pray for the brighter side of Turner's.  I wish that out of all the syndromes I had got Turner's but I got Edwards which is the worse one of the bunch..Be grateful your little girl can still get married, have a baby, go to med school, run around, get potty trained...you are fine. Just pray she makes it because the doctors tell us moms most of them with Turner's and Edwards dont make it!! Your little one will and we will pray for her.  God Bless and dont be sad you are really blessed take it from me!!",
            "post_id": "3105546",
            "timestamp": "1214934289",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Thank you ladies for sharing your stories and for the information!  My doctor said to wait for the final results which should be back on Monday.  I'm praying to God nothing else comes up.  I'll let you guys know.",
            "post_id": "3109771",
            "timestamp": "1215018165",
            "user_id": "user_545757",
            "user_link": "/personal_pages/user/545757",
            "votes": "0"
        },
        {
            "answer": "Please do keep us posted..I know you are rather upset.   My little person had a cystic hygroma and it went away in less than 2 weeks and it was bigger than your little person.  We now have some heart malformations and two cycst on the brain but the cysts will go away soon.  Just pray God can heal her a little health issues and she can live a good life...try to stay positive and I just read about a little girl who is 4 years old and has T18 who can speak, sign, walk, and is now going to pre-school. The good news is your little lady will not be mentally retarded..just keep praying and I will pray for you..ask as many people and churches to pray for your lady.  God Bless and keep us posted if you need to speak w/ me privately just let me know and I will send you my number.  It is really difficult carrying a baby with an abnormality but its also rewarding.  We dont know what the future will hold for these babies.  I even have a mom whose baby has a huge hole in all 4 chambers and 4 leaking valves and the child is doing fine....you just never know what to expect.  You have to let go of the control and just trust in God and stay positive.  You will have good days and bad days but you will make it to the end.  It also gets easier as time goes on..I dont have as many crying spells as I use to each day is a little brighter and I like looking at the flowers and the tops of the trees during the day it reminds me of God's awesome power and how truly blessed we are to have such special babies.   You are ELECT PARENTS and God will lead the way just follow and trust in him, whatever your decisions or outcome.  Since this happen to me I have become closer to God and more in tune to my emotions and dreams and goals.  In time you will realize the blessings that she has already brought you....dont worry-pray!",
            "post_id": "3110162",
            "timestamp": "1215023772",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Hi,I had my 20 week ultrasound and the baby looks good.  Luckly, no facial deformaties, no cleft or club foot, no clenched fist or short legs.  The heart is the problem she has a large VSD and ASD and they are not sure if she will make it due to the Trisomy 18.  I'm still hopeful. The heart was beating strong and she was very active.  I was so happy to see her and cant wait until she comes home.  The specialist decided that I should come back closer to my due date for another ultrasound and just continue to follow up once a month at my ob/gyn.  Overall, I was pretty happy about everything and I am going to stay hopeful.",
            "post_id": "3145627",
            "timestamp": "1215815726",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Are facial deformations common with Trisomy 18? That's great that she's looking well as far as that's concerned. I wish her heart was better. I'm sending all my hope your way! Please keep us posted!",
            "post_id": "3146481",
            "timestamp": "1215833408",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "hya  all",
            "post_id": "3178659",
            "timestamp": "1216580589",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "Hya everyone been a while since i been on here think the last time was just after christmas when i told you all that on my first scan they found out my baby had a cystic hygrome .Sadley on the 11th may i went into labour and my baby son bradley was still born thought  everythink was going well each week i went for my scan and i never gave up hope i got to 38 weeks when he died ,although this is a really difficult time im just glad i carried on with my pregnancy and didnt give up hope i miss him so much words can not explain, anyone out there please do not give up hope you never know things might just work out , i will continue to look on this site because it helped me through a difficult time anyone who wants to ask anythink please ask xx god bless all and hope you all ok x molly",
            "post_id": "3178686",
            "timestamp": "1216581070",
            "user_id": "user_365952",
            "user_link": "/personal_pages/user/365952",
            "votes": "0"
        },
        {
            "answer": "So sorry for your loss. I can't imagine how difficult that was for you at 38 weeks. My little one's heart stopped beating at 18 weeks and I still think about it daily and how sad I am without her. did you find out if he had any kind of syndrome. WE knew our little girl had trisomy 13 and knew she was in trouble and probably wouldn't survive because of the actual syndrome. It's still hard to deal with the loss though. Terrible thing.We are considering another try at this but don't know if we could handle another loss like this one.I hope you are finding peace now. Know that we are all here for you.Gina",
            "post_id": "3183418",
            "timestamp": "1216683164",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Oh hun....I'm so so deeply sorry. I can only imagine what you must be going through right now. To make it so far. Bradley will be in my thoughts....and you as well. Take care of yourself and please know that we're all here for anything you need. I wish you strength and peace.Megan",
            "post_id": "3183478",
            "timestamp": "1216684188",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "ihave been havingseverecrampingwithmymenstrualcycle foryears also bad pelvic pain and having heavy menstrual cycles.  idontknowwhat the causes are but iam seeking advice frompeoplethat relate thankyou",
            "post_id": "3183826",
            "timestamp": "1216689665",
            "user_id": "user_458638",
            "user_link": "/personal_pages/user/458638",
            "votes": "0"
        },
        {
            "answer": "My husband just made this video for our Mackenzie. I wanted to share it with you all....if anyone can appreciate it, it's everyone on this board. If anything, I hope it can provide a little hope for those of you still holding on to your little ones.http://ca.youtube.com/watch?v=8cLF1pLb8oc",
            "post_id": "3184244",
            "timestamp": "1216696242",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I just watched your video and it made me cry (maybe it is part hormones). It was very special for someone who has been through all of this to see how beautiful your baby is. Mine is due in 5 weeks and we have every reason to believe that she is perfect, but I need to see her to really feel assured. Thanks for sharing and for all the advise and comfort you give everyone on this site.",
            "post_id": "3193139",
            "timestamp": "1216857180",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "Your video was wonderfully inspiring to so many who are going through this very scary situation.  Adorable family....Thanks for sharing.Funny story. My friend Kristin said they told her mom (28 years ago) that her daughter had a cystic hygroma and probably had downs syndrome. Her mom said she didn't care what she had but that she was having this baby. Anyway, Kristin is a typically developing individual who teaches at my former school. She's actually gorgeous and exceptionally bright. Back in the day, people did well without so much information and life went on just like it does today.Gina",
            "post_id": "3196010",
            "timestamp": "1216918696",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Well your response made me cry and I can't blame it on pregnancy hormones! I'm so excited for you to feel that feeling of complete relief and joy. Even when all of our tests came back normal and all of the ultrasounds looked good, there was still that thought in the back of my mind....what if?? When I saw my baby girl for the first time, it was the single most beautiful moment in my life. Of course the day my son was born was a wonderful day, but it was different. We knew he was healthy. This whole experience has completely changed my perspective. I now appreciate all of the little milestones that I took for granted with my son. I wanted to add, after my daughter was born, the one thing I was still really concerned about was her heart. Even though the fetal echo came back normal, I couldn't help but worry that something was missed through all that gunk! So I opted to have her echo done again and after that, I was able to rest easy. Just a thought if you're still a worry wort after she's born like I was! I'm just so grateful for this board and all of the stories on it. Please keep us posted on your little one. I'm always thinking about every single woman....and our one man:)....on this thread.",
            "post_id": "3198056",
            "timestamp": "1216947602",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I've always wondered how many people would not be here today if ultrasounds had been given so frequently and so early back then. I also wonder how many people choose abortion simply because of the advice of doctors and genetic counselors....before even getting tests done to find out for sure. I agree, all of the information out there today can be wonderful....but it can also hinder your decisions and cause someone to make a potentially terrible decision. I was lucky enough to have an incredible doctor who knew exactly how to balance realism and optimism. I'm not sure what I would have done without him. I wish more doctors were like that. My peri was the complete opposite though....he was entirely worst case scenario. I just wish doctors would explore the more hopeful avenues before jumping to the \"doom and gloom\" Oh here I go! I had better stop myself now!",
            "post_id": "3198156",
            "timestamp": "1216949136",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "How are you? How is your baby girl?",
            "post_id": "3213735",
            "timestamp": "1217333094",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Hi Megan,I don't post here anymore since my pregnancy ended in Jan. 08, I did just want to add some insight to a comment that I'm sure was purely innocent, but bares mentioning nonetheless.I can assure you that mothers who have chosen to terminate their preganacies   did not make that choice soley on the information of an ultrasound. Believe me I know this for a fact. Inititally we were told our baby had a 4.0 mm  cystic hygroma and than we were told of all the possiblities associated with this diagnosis, we had an amnio and a fish test to confirm genetic abnormalities. I belong to a website calledA HEARTBREAKING CHOICE, it exists completely for families who were faced with the God awful, gut wrenching, heartbreaking decision to let their angel babies go, there is not a single woman who made that decision based on an U/S.I understand your point, that sometimes too much information too early on is just too much and that most likely things turn out positively, unfortunately that is not always the case.There are so many moms out there who have survived this journey, they loved their babies enough to set their spirit free and to not suffer in our physical world.Just a word from the outsiders here, nothing more, just here to enlighten the whole spectrum.Thanks for listeningIstherehope",
            "post_id": "3216392",
            "timestamp": "1217375414",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I understand, but I need you to know that I NEVER said that all women choose to terminate with only an US. I don't want anyone on here to think that I said that. I have talked to many women dealing with or who have dealt with Cystic Hygromas and unfortunately I have run into women who have terminated before having an amnio or CVS done. So while you haven't run into any, I can promise you they're out there. Most of them dealt with this condition upwards of 10 years ago and doctors gave them no hope whatsoever. I'm by no means saying that that's everyone's case.And of course I would never suggest that letting your baby go is an easy choice to make and I'm heartbroken that you would take my comment in that context. I'm simply saying that the OB community FOR THE MOST PART has a no hope kind of outlook when it comes to CH. I just feel that termination shouldn't even be brought up until they know for sure. I was offered termination at my very first peri appt....and I wish I hadn't been. If I hadn't personally talked to women who have terminated after merely a CH diagnosis, I wouldn't have even mentioned that in my above comment. I'm sorry if this is defensive, but I just feel that my comment was misunderstood.",
            "post_id": "3220473",
            "timestamp": "1217458116",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I agree Megan. I was also encouraged to terminate at the first US visit that they found the CH. the doc said many women terminate and don't pursue testing because they'd rather not know...and yes, that is their CHOICE. For me it was important to give it my best shot and test...and I did and it came back wrong the first time. I had hope for a while and then we found out that there was a trisomy which was tragic. I had to make a decision to terminate or not to and fortunately in a way, God stepped in and took over that part for us sooner rather than later. It's true that alot of medical professionals do post a doom and gloom view but unfortunately it is accurate for a big percentage of the time. Thank the Lord this site exists and some women can see your healthy baby and wait for more information before making a decision.and istherehope: I checked out that site and joined. What a great resource for all of us who have lost babies. Great resource.Gina",
            "post_id": "3223989",
            "timestamp": "1217529719",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hi Megan,Little mama is still kicking!! The doctors and I have decided not to have anymore ultrasounds because its to hard on me right now.  I mean to see her kicking and playing and to know that she is not expected to live is really hard.  I will be honest the only reason I am carrying this baby to term is because of my relationship with my GOD!! I simply can not terminate my pregnancy.  I would not wish this on my worse enemy it is extremely painful and you dont know when your baby is going to die.  I just keep praying for her and I do wish so much for her to come home and be with us even if just for a little while.  The choice is not easy its so sad either way!! A baby is supposed to be a joyous occassion and I am praying for a miracle.  Please pray for me anyone who reads this!! Pray that she makes it and is able to come home with us!! Thanks",
            "post_id": "3228520",
            "timestamp": "1217621980",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Oh bless her little heart. I just can't even imagine what you must be going through right now. I'm astounded by your strength....you're amazing. I think about your sweet girl every day. She sounds like a fighter to me:) Hang in there momma.....",
            "post_id": "3229275",
            "timestamp": "1217633913",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Thank you. Your story gets to me every time! And you're right....too often the grim prognosis ends up being the end result. I don't know if you have a MySpace, but there's some amazing women I've been in contact with on there that have all dealt with this....every aspect of it. Some have lost little one's, some have given birth to beautiful babies with a CH, some are grown women living with the condition. It's definitely worth checking out. You continue to be in my thoughts......",
            "post_id": "3229415",
            "timestamp": "1217637223",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Megan,Please do not take offense as no accusation was intended, as I said I simply wanted to widen the spectrum and to offer a broader perspective from someone who actually lived through the experience.Most women who terminated at least all that I know of have entered into their decision with much anguish and pain. . All went to the fullest extent of diagnostic and genetic  testing and eventually accepted what they could not change and moved forward with the next step. Living with that grief is truly unbearable.I understand your point in regards to the OB community and their \"doom and Gloom\" approach. But, it is their job to inform patients of all the potential possibilities and outcomes. Our Genetic counselor was very supportive, and only when we asked about every and all options did she bring up termination. I get the fact that much much more information and testing should be performed before termination is discussed, my experience was just that, some other Moms had different experiences.Again, it was not my intention to offend you, I must admitt that I was taken aback  when I responded to your first post because it seemed  such a general statement to me and I guess my experience and pain is still too raw. As I've said, I merely intended to shed some light on a very personal, heartbreaking situation. Its unfortunate that all of us have had to consider this option or have it offered to us at some point in time. I wish every mom had a positive end result, but that is not always so.GinaI'm glad that you looked into the web site, it has been an incredible source of strength and support for me. Sad to have you join, but glad that it has helped you out. Take Care.",
            "post_id": "3236120",
            "timestamp": "1217815447",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "I welcome any and all aspects and points of view where this is concerned. I think the reason I was offended was merely because of the implication that I thought women \"jumped\" to termination too quickly. I won't pretend to understand the pain felt by a woman who chooses to terminate a pregnancy because of this. I do however completely understand why one would. If I had been told that my baby girl had no chance, I might have done the same thing. Of course the grief is unbearable and of course these women make their decision with anguish and pain.....what kind of person would I be to suggest otherwise? I'm glad your genetic counselor was supportive, that just isn't the case for everyone. In no way am I saying every doctor, every specialist, every counselor is always worst case scenario.....but some are and I feel that is worth being addressed. I completely understand what is required of them and that they must provide all of the options.....absolutely. I was actually grateful that my peri was so up front with me. I didn't want false hope, I didn't want the \"what ifs\" However, I do wish that he hadn't come out and ask me if I wanted to terminate before I even knew what in the world was going on. I needed time to process the news and to weigh the options before making such a huge decision. I apologize if my statement seemed \"general\" because that was never my intention and in no way was it meant as a disrespect to anyone who has had to make this decision. I was inches away from having to make that same choice myself. Nothing that I posted was meant to minimalize what you and so many other women have had to go through. The fact that I have my little girl proves to me that doctors can be wrong a small percentage of the time. And just because I've had her and she's healthy doesn't mean I've forgotten the pain and fear and utter desperation I felt while she was inside me. I remember it and I remember it well. I still research daily and I'm trying to do my part to raise awareness and money for research.I want this thread to continue to be a place for women to come to when they feel like they're the only ones in the world going through this. I want it to be a place of hope and information as it has been for quite some time now.Regardless, I have nothing but love and hope for you and your entire family....especially you sweet angel. What you have had to go through is gut wrenching and I hope that you're finding peace. You and every woman on this thread are in my thoughts on a daily basis.",
            "post_id": "3236306",
            "timestamp": "1217818882",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "My little lady passed this weekend!! Her little heart just couldnt take it anymore!! I have to go to the hospital today to be induced and have a stillborn baby.  Please keep me in your prayers!! This has been very difficult and painful and I had hope that she could come home with us if just for a while but she didnt make it.  God called Charity home and I will miss her little spirit inside of me.  I am so grateful for this board and all the comments of everyone.  It was very informative and all the ladies really gave me hope! I do want to try again but my husband doesnt so I will just pray about it!! Thank you all so much!!",
            "post_id": "3265952",
            "timestamp": "1218472479",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "My heart is broken for you, there is no greater loss than the loss of a child. I will pray for peace and comfort for you and your husband during this difficult and painful time.She will always be in your heart for you to love for always, her spirit has passed through you and has moved on to suffer no more.Peace and Strength to you, you have been remarkably brave. God Bless you., Istherehope",
            "post_id": "3267733",
            "timestamp": "1218497397",
            "user_id": "user_380277",
            "user_link": "/personal_pages/user/380277",
            "votes": "0"
        },
        {
            "answer": "Oh honey....I'm just so sorry, I don't even know what to say. I know you wanted to have her home with you if only for a little while. You are most certainly in my thoughts as you go through this. She was just too perfect for this earth. I imagine her little body was so tired. I don't know you, but I know you're a strong woman...that's obvious. I hate that you have to go through this and I wish there was something I could say to take away the pain. My heart just breaks for you. I'm sending you all my strength and all my prayers. You're sweet little angel will always be in my thoughts........",
            "post_id": "3267759",
            "timestamp": "1218497871",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry to hear this. You are amazing and her little spirit will be with us all forever. these little people are not to be forgotten but loved and I am certain we will all be with them again someday in a very happy place and time. It's been tough for you and will continue to be for a while. Your husband and I are at the same place whereas you and my husband are more courageous about moving on and trying again. It's scary to think it could happen again but you have to have faith. Please know you are in my prayers daily. We are all here for you in these difficult times.Gina",
            "post_id": "3271439",
            "timestamp": "1218571728",
            "user_id": "user_502445",
            "user_link": "/personal_pages/user/502445",
            "votes": "0"
        },
        {
            "answer": "Hi all. I am SO grateful for finding this site, as so many of the stories are by far more positive than on any of the medical expert sites! Here's my story so far..I'm 13+ weeks preg at the mo, at my booking scan we were told there was an enlarged nuchal fold on the baby at the time measuring 3.2mm and that I needed to come back for a more detailed scan in 2wks time. We were led to what we referred to as the \"bad news room\" and left waiting for an eternity. Eventually a specialist midwife came to us and spelt out that there was a very high chance of our baby having downs syndrome or some other chromosomal disorder. She said also if this were discounted then there was an equally great chance of a major heart defect. She advised that there was only something like a 10-15% chance of a \"good healthy outcome\" and without saying so in as many words, advised us to terminate.We booked our scan for 2wks later and set about searching for as much information as we could on the internet-the hospital could give us virtually none, which didn't help matters at all!I had the nuchal scan at 12wks and was told the fluid had now doubled to 6.4mm and was known as a cystic hygroma. Again we were told with much tutting and shaking of heads that the prognosis was dire. \"we can't tell exactly what causes it, how it will affect your baby or whether it will survive\" is what we were told..some help! Unwilling to give up all hope while some still existed we booked for a CVS test 2 days later (last thurs). The consultant warned us our chances of it being downs were one in 4, and of it being any chromosome ab in general prob nearer 60%.Well, the first cvs results came through this morning..clear! I could barely believe it! I know that doesn't mean we're out of the woods by a long shot, as we were told well something is still causing the fluid to be there, and now it's more likely to be a heart defect instead. But, it's one less thing to worry about as far as we're concerned.I'm due to go for another scan at 16wks, which is still nearly 3wks away, to check how things look, and we're just hoping beyond hope that the fluid has gone down at least a bit, I honestly don't know what we will do if it doesn't go. I don't know about you, but I find the constant waiting to be the hardest part, and never seeming to actually know anything! How did you cope day to day, when every day feels like a week? It's the worst torture imaginable. All we can do is hope for the best. In the meantime though, I'm finding some comfort from stories such as yours, a lot of the medical sites are all doom and gloom, but often the mothers' stories of their own experiences tend to be more positive so I'm clinging to the thought that there could also be a happy outcome for us. It's frightening to think how many mums may have felt there was no alternative to termination when given medical advice, when clearly there are more positive outcomes than certainly I was led to believe.",
            "post_id": "3273889",
            "timestamp": "1218623228",
            "user_id": "user_588446",
            "user_link": "/personal_pages/user/588446",
            "votes": "0"
        },
        {
            "answer": "I'm so so glad you found this thread! First let me say congratulations on a normal CVS test! That's a HUGE hurdle. Do they have you scheduled for a fetal echo yet? I don't want to give you false hope, but the fact that the CVS test came back normal is a great sign. Once you get the baby's heart checked, you'll know more. It's unfortunate that nobody seems to know what \"causes\" a cystic hygroma. I mean, I know it's a delay in the 2 systems, but it's impossible to pinpoint what exactly causes that delay. The women on this board have experienced all aspects of a cystic hygroma. Some stories are good, others are not. But nonetheless, there is so much knowledge among everyone on this board. I completely agree, waiting is the hardest part. Not knowing from day to day is agonizing. Unfortunately, all you can do is wait. I know how frustrating it is....just wanting to do something, anything for your baby and feeling completely helpless. I also wanted to add....try your best not to focus on the fact that the fluid grew between 10 and 12 weeks. I had my first scan at 12 weeks and my baby's nuchal thickness was at 6mm so who knows what it was 2 weeks before that. My baby's CH didn't resolve until 27 weeks, so keep hope. She was born completely normal, with no indication of her condition other than a little excess skin on the back of her neck. I wish I could give you an easy way to get through your days, but I can't. It just *****, there's no way around that. I found myself researching to pass the time. I wanted to know everything there was to know about this condition. Just know that you can come to this board anytime and vent your frustrations....we've all been through what you're going through. I hope our personal stories can be of some comfort to you. It's true that the doctors are right about the prognosis a pretty large percentage of the time.....but there are exceptions, so don't loose hope. If you have ANY questions at all, please post them here. I can pretty much guarantee that someone on this board can give you the answers you need. You will be in my thoughts and please please please keep us posted!!!!",
            "post_id": "3277319",
            "timestamp": "1218674285",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "Charity Lynne Divers was born to Heaven on August 13, 2008 at 1:47pm in Atlanta, GA.  I was able to hold her as soon as she came out and dress her in a cap and gown and blanket.  The minister came and baptized her and commanded her spirit to heaven.  It was such a precious ceremony and the nurses and doctors were so nice and patient with me.  At first I was scared but the minister prayed and counseled my husband and I for about 2 hours before I actually had to push her out.  We had Now I Lay Me Down to Sleep come out and do professional bereavement pictures with me and some of the kids.  Charity was able to room with me while at the hospital.  My husband and I prayed over her before they took her down to the morgue.  It was a very precious time..she had my husbands hands, feet, and arms and my eyes.  She was so cute and precious. They have an Angel Garden at a cemetary in Atlanta and  and we are in the process of getting a brick for the Angel walk dedicated to Charity.  We are also going to put music to the picture  CD that Now I Lay Me Down to Sleep is making for us right now.  Once the brick is ready to be placed I will go ahead and have a small ceremony for her and prayer service.  Please keep us in your prayers.",
            "post_id": "3279619",
            "timestamp": "1218726800",
            "user_id": "user_498400",
            "user_link": "/personal_pages/user/498400",
            "votes": "0"
        },
        {
            "answer": "Hi, and thanks for your comments. Everyone around me is urging me to stay positive and that things will work out ok, but well, you just never know for sure till you hold the baby in your arms (or sadly not) do you??It made me smile when you say you researched to pass the time, that's exactly what I've been doing for the last 3 weeks, and driving myself demented in doing so, but I can't not!No one at the hospital has mentioned a fetal echo to me, just that they will US me more often to check the heart. So looks like that's something I will have to ask about, thanks!It's hard to stay strong, but my husband and I have decided that now we know ther's no chromosome abnormality to worry about there's no way we're going to terminate this pregnancy regardless of what they find, I'm just going to let nature take it's course and hope for the best, useless maybe, but what else can you do!? Thank you for being so welcoming.",
            "post_id": "3280580",
            "timestamp": "1218740229",
            "user_id": "user_588446",
            "user_link": "/personal_pages/user/588446",
            "votes": "0"
        },
        {
            "answer": "I hear ya! That's how my friends and family were. Telling me all the time that everything was going to be fine....but they didn't know the statistics, they didn't spend hours researching the prognosis. You're right, you don't know for sure until your baby is born. And even then, at least for me, there was still so much worry. I would analyze every inch of her wondering if \"this\" was normal and if \"that\" was okay. I took her in for things that should have been passed off as normal newborn behavior, but I just didn't know with her. I had an echo done on her when she was a few weeks old, just to be 100% sure that she had a good heart. Since then, my worries have died down tremendously.I honestly think research is a great thing to do while you're \"waiting\" For me, I wanted to know EVERYTHING. I wanted to know all of the terminology so that I would always know what my doctor was saying and it also gave me the knowledge I needed to ask good questions. As long as you can keep a level head and are able to take in the not so good outcomes and stories.I would definitely ask about a fetal echo. I mean, I suppose it is just an ultrasound, but it needs to be detailed of the heart and a pediatric cardiologist needs to look at it. I'll definitely be hoping for a good, strong heart:)You're right, hoping for the best is all you can do. I know how much it hurts to feel utterly helpless. Just take it day by day. I'll be watching this site like a hawk for your updates! You and your family are in my thoughts......",
            "post_id": "3281744",
            "timestamp": "1218754841",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "I just can't even begin to wrap my mind around what you've gone through. I'm so glad you had the support system that you had. You are such an inspiration....you're so much stronger than I could ever hope to be. Know that your sweet little Charity will continue to be in my thoughts and in my prayers every day. I hope you can begin to heal and find peace. Take care of yourself hun.....I'll be praying for your strength.",
            "post_id": "3281774",
            "timestamp": "1218755236",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        },
        {
            "answer": "To Nassime- I am so sorry to hear about Charity. I will keep you in my prayers.To Annie and others who are looking for hope- I wanted to let everyone know that after having all the scary waiting and testing that you are going through, Ashlyn Georgia was born on 8/9 and weighed in at 10.0 lbs. She is absolutely perfect and such a blessing. My doctor said her story is one to share since he said any doctor who saw her 10 wk u/s would have said her odds of surviving or being normal were very slim. I hope my story gives hope to some of you. Thank you to everyone on this post who prayed for me and gave me hope.",
            "post_id": "3285252",
            "timestamp": "1218830004",
            "user_id": "user_414929",
            "user_link": "/personal_pages/user/414929",
            "votes": "0"
        },
        {
            "answer": "I've been wondering about you! 10 pounds! What a big girl! Congratulations! I'm so relieved for you! Welcome baby Ashlyn!!!!",
            "post_id": "3285861",
            "timestamp": "1218840122",
            "user_id": "user_274927",
            "user_link": "/personal_pages/user/274927",
            "votes": "0"
        }
    ],
    "post_id": "1057537",
    "question": "hi this is about my sister in law she has been diagnosed with a cystic hygroma and has an amnio that has returned negative so it is not chromosonal, she has another appointment 04 13 i just wondered if anyone else has experienced this?    any reply will be gratefully received  thanks safia",
    "timestamp": "1112421600",
    "title": "cystic hygroma",
    "user_id": "user_87135",
    "user_link": "/personal_pages/user/87135"
}