{
    "answers": [
        {
            "answer": "OMG cherie you always think up the best questions , I have so many ,I will think up the worst and get back here.......",
            "post_id": "4727553",
            "timestamp": "1249304322",
            "user_id": "user_535822",
            "user_link": "/personal_pages/user/535822",
            "votes": "0"
        },
        {
            "answer": "I had had ulcerative colitis for 10 years.  It had gotten progressively worse in that time.  My gastro doc was older and near retirement.  When it got real bad I would call into his office and his secretary would not give me appointments and just tell me to increase my meds which I had already done.  In the last few years I ended up in the hospital several times due to dehydration.It was during one of my hospitalizations that I was in a private room when I got the most awful pain in my abdomen.  It was different than anything else I'd ever experienced and was excrutiating.  I called the nurse and she told me that after all the years I'd been sick that I should be able to handle the pain better and left.  I tried calling the doctor's office but it was night time.  I screamed for help and nothing came.In the morning I woke to a group of people hovering around my bed with an x-ray machine.  When the nurses changed shifts the new nurse found me in my bed with practically no blood pressure.  My bowel had perforated and the poison was throughout my body.  They rushed me into surgery where my entire large colon was removed.  I was in intensive care for 4 weeks and lucky to be alive.My family told me that when the surgeon came out in the hall after the operation that my gastro doc was there.  The surgeon pushed him up against the wall and put his fist in his face.  He told him that he had never seen a colon is such bad shape and that if he ever saw another of that gastro doctor's patients in such bad shape that he'd kill him.  Amazing!As well, the chest tube I had that delivered pain meds and nutrition to me wasn't put in properly.  I had a breathing tube in and could not talk and was in such pain.  My SIL noticed that I was jumping every time someone touched the bed and got them to look at it.  They fixed it and then gave me a morphine pump that I could press when I needed it  It was pure joy to be able to hit that button.This was 16 years ago and feels like it happened to a different person at this point.",
            "post_id": "4727794",
            "timestamp": "1249309447",
            "user_id": "user_483733",
            "user_link": "/personal_pages/user/483733",
            "votes": "0"
        },
        {
            "answer": "During my VBAC labor when I told her something was very wrong and we needed to stop and she told me I didn't know what I was talking about and I ruptured and my baby and I nearly died....",
            "post_id": "4728128",
            "timestamp": "1249314873",
            "user_id": "user_391963",
            "user_link": "/personal_pages/user/391963",
            "votes": "0"
        },
        {
            "answer": "it astonishes me how drs and nurses are so quick to not believe in the patient, bith your stories are something else..Trudie love what your dr did to the other he deserved to be decked for that.",
            "post_id": "4728244",
            "timestamp": "1249316704",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "Almost every time I go to my pcp these days, I'm disappointed beyond belief!!!I had one doctor who insisted I was an alcoholic because my red blood cells were enlarged and he SWORE that alcoholism is the ONLY thing that causes that.  A few years later, I was going to a different doctor - the one I have now and HE noticed it also, send me for lab work and dx'd pernicious anemia, which causes enlarged red blood cells also; plus I had been complaining of fatigue for years and no one would listen.  The one doctor insisted that I was tired because I was depressed and even put me on paxil for a while.  The paxil made me even MORE tired and I just quit taking it - boy was the dr upset with me!!!  That, when I should have been receiving vitamin B12 shots all that time.And then there's my current pcp - after he dx'd the pernicious anemia, I still kept telling him I thought there was something wrong and he insisted there wasn't.  I finally got his NP to send me for thyroid testing and it was discovered that I'm hypO.  Well, after I got started on meds and still  couldn't lose any weight - my pcp looked at me one day and sort of \"sneered\" at me and said \"There's nothing ELSE wrong with you - you just need to MOVE MORE\" then he turned on his heel and left the room.  Then there was the day he found out I was going to an endo and the endo had started me on cytomel - oh by the way, there WAS something else wrong..lol -  my pcp stammered and stuttered for a bit, then said \"Well, I recently read that not everyone does well on synthroid alone\" -- I'm sitting there thinking \"RECENTLY READ?\"   If he didn't know the options for treating thyroid disease, why was he trying to treat it????I think I might have pre-diabetes, but my pcp won't listen to me, nor would he look at the record of my fasting blood sugars that I tried to show him............most of them over 100.................Always quick to blame ME if I don't feel better right away - like *I* am not following directions or something.....................Not as serious as some others, but definitely very annoying....",
            "post_id": "4728321",
            "timestamp": "1249318105",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "The most disappointed I have ever been was with the pregnancy of my daughter. At the end I started loosing fluid with her and new I was because I had gone through it with my son. I tried telling my OB and he kept telling me that I was peeing on myself and all was fine. I told him no I am not I am loosing my water I know I am. I begged him to do a sonogram and refused saying its against hospital policies to perform more than two and I had already had two sonograms.Finally two weeks after I told him I was loosing water I went into labor with my daughter and sure enough I had a dry labor due to not having any fluid and she ingested her own muconium.(sp) and was very sick at birth. They sent her cord off for testing and everything because of her illness. She had to have her lungs sucked out and scrapped at birth and before she could take her first breathe. Now she has asthma and develops upper respitory illnesses easily. I was once told by a repitory therapist that her delivery is the reason for her staying sick.All this could have been avoided if he would have just listened to me!",
            "post_id": "4728373",
            "timestamp": "1249319176",
            "user_id": "user_637356",
            "user_link": "/personal_pages/user/637356",
            "votes": "0"
        },
        {
            "answer": "what a shame, when Im a PCT I will always assume my patients are telling the truth, even an addict could come in with real symptoms of a different aliment . ughhhh",
            "post_id": "4728447",
            "timestamp": "1249320243",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "I had a hysterectomy several years ago, went to the family doc to get hormones or something to increase the sex drive. So I was sent for a mammogram to one doctor then to a gyno for a pelvic (uh? nothing in there folks?), then to a shrink to talk about my sexual issues,  and told to come back in a month and we would talk about it. It was all I could muster for the one doctor payment to the family physician much less the others, so I said to h#ll with it.  Just a money game to me.  Whatever happened to the family doctor handling it?",
            "post_id": "4728459",
            "timestamp": "1249320405",
            "user_id": "user_285927",
            "user_link": "/personal_pages/user/285927",
            "votes": "0"
        },
        {
            "answer": "WOW! You guys have some really bad stories!! SS the drs never listen!! Mine aren't that severe but my first dr i got in my hometown seemed nice until parts of my pap came bk bad he then insisted on getting my boyfriends (now DH) name for a script as well as me and he then very rudely told me he could only treat us and not the other girl my BF was cheating on me with!! Needless to say i wont go to him or any other Indian dr in my town (no pun intended)my new dr not as bad but not so smart either! It's a decent size clinic so i went upstairs to the GYN dr for a rash down yonder i thought it was down there i needed a gyn they looked at me saw my Eczema on my legs and insisted i had down there too so i got sent downstairs to the family dr they could not even figure it out and embarrasing enough i had to show like 10 people my crotch!! they gave me some stupid cream that didnt work and i had 2 go bk yet again a week later cus i was hurting so much FINALLY after all this i get told I have Candia some yeast infection stuff and have to get an anti biotic for it!! And all the while GYN could have diagnosed a simple yeast infection!! and the best part the price for these visits is high enough i cant go bk anymore which bites cus i wanted my fertility testing done and now its out the window again!!",
            "post_id": "4729289",
            "timestamp": "1249335172",
            "user_id": "user_362249",
            "user_link": "/personal_pages/user/362249",
            "votes": "0"
        },
        {
            "answer": "Very long story short .. my daughter's allergist insisted my daughter had scabies and that I was in denial in that it affects all social classes.  OK .. I disagreed and told him he was wrong and I refused to use a pesticide wash on a highly allergic 8yr old girl and went straight to my dermatologist who took one look and laughed that \"those who don't know shouldn't profess to know in areas outside their domain\".  And that was 8 yrs ago and it was not scabies .. it was an allergic dermatitis of some sort that wasn't common .. can you believe it ?Yep.  Trusting one's instincts is so vital.He said he'd do a skin culture if it didn't clear up in 48hrs and it was gone by then!",
            "post_id": "4729701",
            "timestamp": "1249341593",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "chitchat===imagine the damage that could have been done to your DDTeko===simple HRT is all you likely needgonkuangel---so sorry for all you have been through, it is not fair at all : (Do all listen to your bodies and trust your instincts a large percent of the time you will be right!!!",
            "post_id": "4730802",
            "timestamp": "1249366984",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "Oh, I had a nightmare of a time about 1 1/2 yrs ago!  I went to the ER 5 or 6 times in 1 month because I was very short of breath.  I mean...BAD.  I couldn't walk across the room w/out huffing and puffing and I was getting no sleep.  I was too scared to sleep because I didn't think I would wake up.  That's how bad it was.Anyway, all the docs did for me was take x-rays and said no pneumonia and sent me on my merry way.  They told me it was stress and tried to give me atavan or valiums.  I freaking knew that it wasn't that.  They didn't believe me.  After all of that, I went to the lung doctor and she did a lung function test on me and looked at my x-rays.  BOTH showed normal.  SOOOO, she didn't believe me either.  At that point, I was totally in tears.  I'm not the crying type either.  But, I thought, at least the lung doctor would take me seriously.  After doing some research online, I saw that pulmonary embolisms could cause my shortness of breath.  I knew that I needed a CT with contrast to diagnose it.  I called her and demanded that she order it.  She did and low and freaking behold......I was positive for  pulmonary embolisms and had to be admitted to the hospital.Does that suk or what?  I could've dropped dead from that!  AND, I was thinking about a law suit!!!  I have absolutely no faith in doctors anymore.",
            "post_id": "4730951",
            "timestamp": "1249373919",
            "user_id": "user_587315",
            "user_link": "/personal_pages/user/587315",
            "votes": "0"
        },
        {
            "answer": "I had forgotten about when I had my hysterectomy 13 yrs ago.  I had the laproscopic one, so only 4 tiny incisions, but had some internal bleeding.  Had to spend the night in the hospital, with very low bp and blood counts - they were seriously thinking of a transfusion, but things finally started turning around and I went home the next day.  Did really well for next 2 weeks, then all of a sudden one day, I couldn't go to the bathroom.  I ended up having to go to ER as it was on a Sunday.  When I got to ER, they drained off 600 cc - 3 times........... I was in SO much pain until they started draining it off.......Well, the PA came in and INSISTED that he do a pelvic exam - I told him I had stitches in there and didn't want him to do mess them up.  He wouldn't back off and I had no choice but to let him.  Well, it turns out that I had a large vaginal blood clot that my doctor was expecting to be reabsorbed by my body but it had put so much pressure on my bladder that I went into urinary retention ----- stupid PA ripped it loose and I started bleeding so bad it was horrible.  THEN they sent me home with a catheter and I had to get in to see my GYN the next day......boy, was HE ever mad when I told him what happened because all they really needed to do was drain off the urine and let me go.  He later told me that he had really raked that PA and that he'd never do THAT again............. I ended up with the catheter for over a week.......Ugh..",
            "post_id": "4732454",
            "timestamp": "1249412363",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "see how much we have to advocate for ourselfs, now most of us on here are somewhat medically minded imagine the folks who are not like in Zodiacs case they may of just gave up and ended up dead, and Barb OUCH, wow 600 ccs 3 x I couldnt imagine the bladder stretching so thats horrid.",
            "post_id": "4732604",
            "timestamp": "1249415029",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "In Nov 07 I am admitted to the hospital straight from the ER due to severe stomach pain and vomitting.  I am finally dx'd after 4days with 2 duodenal ulcers.  The gastro doc starts me on Reglan.  Within 12hrs my period seems to start and it was due so I wasn't worried.  I am discharged from the hospital and have an appt in 4days with this doc for follow-up.By the time I see her, I am bleeding heavily and passing clots and cramping.  I am sure it's the Reglan, but not completely since I've never taken it before.  She tells me Reglan has Nothing to do with it...go see my gyno and she's snotty about it.   She explains nothing about duodenal ulcers or how I should care for myself.  I looked these ulcers up on the Internet.I go straight the pharmacy downstairs, get a printout of side-effects of Reglan and uh oh, look at that?  It's a rare, but serious side effect!  I bring the printout back upstairs for my doc to see and change my next appt with her to another doc in that group.I am currently dealing with a dentist who keeps telling me the pain my new crown is causing is \"all in my head!\" when my TMJ specialist, who was referred by my DENTIST says the crown is on wrong and needs to be changed.  Specialist called my dentist LAST THUR and dentist told specialist he would call me right away.  Right!   I haven't heard from my dentist and I imagine it's because changing the crown means my dentist would lose money.",
            "post_id": "4733232",
            "timestamp": "1249425582",
            "user_id": "user_242912",
            "user_link": "/personal_pages/user/242912",
            "votes": "0"
        },
        {
            "answer": "anyone in the USA who is seriously unhappy w doctor or dentist and wants action but does not want to suit can go another route, you can get out your yellow pages and find your state board of medical proffesion,,,You may call they will send you a packet, i did this for a dentist once, this guy sliced my lip open w a scapel, it was negligence he was careless, You go to a meeting testify infront of a panel of his peers and guess what they get fined and its documented, enough of these and they may loose their license, If its serious enough they may loose it anyways.",
            "post_id": "4734501",
            "timestamp": "1249455063",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "Some amazingly sad stories here! Can't believe how many medicos can get it so wrong!I have a list a mile long of my problems of misdiagnosis, but here is a Readar's Digest version.Mole on my leg at age 17 was 'nothing to worry about' and simply vanity on my behalf to want it removed and checked for melanoma, which runs in my family. 5 years later different doc, 1st stage cancer...thanks!Constant tooth abscess due to my inappropriate oral hygiene. Even though not one ever had a source of entry for infection. Over time I have had almost all my molars bar 2 removed and numerous fillings.   Discovered it is an auto-immune thing due to my Hashimoto's attacking my teeth.Told when having one molar removed, when I said I could feel the pain of it, that I was being too focused on the pain itself. Told them I have weird nerves due to my un-noticeable deformity on one side of my face. The nerves are not were everyone else has them. Needless to say after they held me down with me screaming and they took the tooth out and me in total shock of low blood pressure, shaking etc, they said, Oh, you weren't making it up!Left knee with severe pain for 3 years put down to my leg being slightly shorter than the other., lack of exercise ( I am a walking nut!) or something else I choose to forget. Bone pain up to hip so severe I would cry in my sleep and have to sleep with legs up like a frog. Change of doctor says you have chronic chrondomalacia patallae. Surgery should severe damage due to other dumb doctors ignoring it.Same knee surgery. Told nurse that the pethidine every 4 hours was making me feel funny and it would make me knock out as I felt it going up my arm...she said I was just tired after the surgery. Different nurse walks past at one point and sees my I/V machine oxygen levels down to 40 %, my blood pressure almost non existant and my body with hives all over it and my lips swelling up...me unconscious. True Allergy to Pethidine nearly killed me.Moving along...my severe depression put down to my being abused as a child.....PTSD, hubby leaving me, and having 3 young kiddies with medical problems.  15 years of me saying something is very wrong....fast foward after numerous anti-deprresants (one which I had a severe reaction to after telling doctor I should not be on it so soon after coming off a different one, his response? \"I just love arm-chair doctors and those who peruse the net for their information\" Again, I nearly died.....sigh....) to discovering I have Hashimoto's disease and then found a pre-cancer in my thyroid...Yet again, thanks guys!So, I do have many other stories but I think that will do for the moment....The moral of the story? I think I have more than the lives of 15 cats!",
            "post_id": "4734528",
            "timestamp": "1249456077",
            "user_id": "user_219241",
            "user_link": "/personal_pages/user/219241",
            "votes": "0"
        },
        {
            "answer": "ANOTHER MORAL OF THE STORY RED opphs caps, is again advocate for self had you not done it numberous times, yikes what coulda happened, thank God for all the self doctoring and reading we all do",
            "post_id": "4734688",
            "timestamp": "1249466866",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "My new gastro doc is not in the office so when I call in my renewal for Prilosec, old snotty doc approves once a day instead of twice a day.  I call the office and ask \"what? why?\"  Snotty docs nurse, who was sooo Nice and Helpful btw, tells me this doc will not approve twice because DOC thinks I shouldn't be in so much pain anymore and I need to come in.  What??  Come in, wait an hour the way I feel just for an rx?  Ridiculous!I beg snotty docs  nurse to intervene.  She does, and I get the okay for twice a day, but not until after an entire day of frustration!After reading all the posts here, that is absolutely right, you need to be your own advocate and that is why I am not waiting for my dentist to call any longer.  They are closed today, but tomorrow I'm calling first thing in the morning and Beg my dentist to change this crown.  I shouldn't have to pay for it, but will if I have to...I'm That miserable!",
            "post_id": "4735673",
            "timestamp": "1249490428",
            "user_id": "user_242912",
            "user_link": "/personal_pages/user/242912",
            "votes": "0"
        },
        {
            "answer": "I'd say two stand out. The first was a dentist I had who was going to drill two cavities. He put Novacaine on one side of my gums and waited for it to get numb then came back and drilled on the wrong side. Painful to say the least (lol but not funny). I ended up going to another dentist and no reason to bump the other thread but I did recently get my teeth cleaned with the accomodations I needed for my physical disability and it was fine.As for the second it was a specialist I was referred to by my psychiatrist (can't be more detailed as I made a complaint about it). I was mailed over 50 pages asking very personal questions about my mental health history including explicit questions and if I had ever been on the wrong side of the law (which of course I haven't). I decided I'd fill out the questions that weren't too personal but his secretary said I had to fill out the whole form. I then told her I would cancel the appointment (as I could see that wasn't a person I could deal with, plus it wasn't covered under my insurance). She requested the forms back and I had no problem mailing them but then I was told I had to pay for the forms because I had marked them which cost $50. I made a formal complaint and since it was just procedural they said they couldn't process it. However because I c.c.'d the letter to the doctor to that agency (within the system, OPMC) they mailed back the check for the initial co payment as well as the payment they requested for the completed forms without further explanation. I always respect doctor's needs to complete forms beforehand but questions that personal are best asked in office.",
            "post_id": "4736825",
            "timestamp": "1249508735",
            "user_id": "user_585414",
            "user_link": "/personal_pages/user/585414",
            "votes": "0"
        },
        {
            "answer": "I don't have any horrific accounts to tell.  I've been pretty frustrated with doctors on many occasions.  The worst story I have to tell is relatively recently when I had been in the hospital with renal failure.  No one on the hospital staff paid any attention to me when I told them that I've been diagnosed with IBS over 20 years and I had reason to believe I had Celiac.  I wanted them to pay attention to the fact that I'm gluten intolerant, which I told the staff all the time.  The nephrologist didn't even pay attention to this for some reason.  One would think that since they were paying attention to the urine that they would've noticed that the urine output was fine but nothing was happening from the other end.  CLUELESS!  What, were they looking for diarrhea or something?  Not everyone with IBS/Celiac has diarrhea from eating gluten.  Some of us experience the opposite issue.  These are supposed to be medical people and it really irked me that they weren't the least bit concerned that I was getting impacted.The problem was that their menu was extremely limited for people with gluten intolerance issues.  White rice was it in that department.  And, that affects me as bad as gluten does, because all the important stuff, the fiber, is stripped away.  I couldn't make up for it in the other part of the menu, because I'm allergic to lettuce and other produce items.  If this hadn't happened so suddenly, I would've asked my friends to bring me food from home.  But, people need time to prepare for stuff like that and they have their jobs and other responsibilities to go to.The hospital staff didn't bother sending a \"nutritionist\" to my room 'til the day I was to be released.  Yeah, thanks for the \"help\".  They couldn't even be bothered at least bringing an enema for the impaction.  If they had at least bothered to bring something for the constipation in the first place, I wouldn't have been so miserable in the GI dept for so long after being released.It made me mad that no one took me seriously when I knew very well what I needed in the GI dept, like I couldn't possibly know what I was talking about.  If I'm old enough to have gray hair and have had GI problems my whole life, I think I should be given credit for knowing what my own needs are in this dept.The biggest thing that makes me mad about this is when I think about the \"what ifs\", had this been a much more serious issue--like the stories that have already been recounted.",
            "post_id": "4738228",
            "timestamp": "1249542131",
            "user_id": "user_681148",
            "user_link": "/personal_pages/user/681148",
            "votes": "0"
        },
        {
            "answer": "I know what you mean. I am gluten intolerant and the dietician came to me when I was in hospital for me 2nd knee surgery and said I was being naughty in not having any carbohydrates! I explained and she said, well there is nothing on your file, so you probably only think you are gluten intolerant. Few days later when the nurse asks, (and I just love the way they ask) Have you opened your bowels today? I said no I haven't for 4 days now. They went aggro at me. I said I am gluten intolerant and I am bound up like a s h i t brickhouse!  They gave me 4 doses of yummy laxative, still nothing happened after 2 days....I got home stopped eating the wheat products...( I would have starved to death in hospital if I had not eaten the pasta and bread!)  A week later...KABOOM!Total der-brains at the hospitals I tell you! That painful bloated feeling of constipation and impaction is soooo difficult to live with!",
            "post_id": "4738417",
            "timestamp": "1249553182",
            "user_id": "user_219241",
            "user_link": "/personal_pages/user/219241",
            "votes": "0"
        },
        {
            "answer": "When I was pregnant with my son, my quad scan came back high for spinal bifida. I was sent to a high risk OB to have a high resolution ultrasound. That doctor found low blood flow to the placenta and gave me a guarentee of high blood pressure and preterm labor. He sent the report to my regular OB. When I went to that appointment, my OB asked me what the specialist said. I explained that the specialist told me that I was guarenteed to develop high blood pressure, probably preeclampsia, and go into preterm labor. The doctor looked at me, laughed, and with a huge smile on his face said, \"If you had preeclampsia, we would be terminating the pregnancy\" I do not think that was funny, or a reason to smile, and I did go into preterm labor 5 weeks after his conversation at 27 weeks with very high blood pressure!",
            "post_id": "4756838",
            "timestamp": "1250017329",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "I would have knocked the dr out! Who the he$$ does he think is and who gives him permission to threaten to kill ur baby!! I would NOT have gone bk to him!!So glad u and ur son are ok now!!",
            "post_id": "4757074",
            "timestamp": "1250020087",
            "user_id": "user_362249",
            "user_link": "/personal_pages/user/362249",
            "votes": "0"
        },
        {
            "answer": "Thanks! My doctor was a complete idiot and I will NEVER go back to him. I tell everyone I know to stay as far away from him as they can! It was horrible....I was 20 at the time too, so still fairly young and that was just SOOO inappropriate!",
            "post_id": "4757664",
            "timestamp": "1250029475",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "thats beyond horrid,,we would of terminated the pregnancy as if he had any say in such a decision I woulda reported him to state board,, a@@hole is right..uggghhh I hate such drs,,,my cousin was told after a amnicnetisis that she 4 sure was carrying a downs baby,,she almost terminated,,,,and yes  her dd was born 100% fine shes bright pretty and happy,,,i wonder how many pregnancys are terminated on false negative tests ,,very sad/.",
            "post_id": "4759197",
            "timestamp": "1250072589",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "I completely agree. There is no way in hell I would have terminated the pregnancy, even if I had developed preeclampsia. AND he would have had ZERO say even if I had considered it. My mom and I just stared at eachother in disbelief!",
            "post_id": "4760019",
            "timestamp": "1250089206",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "Too many to talk about.",
            "post_id": "4765845",
            "timestamp": "1250200200",
            "user_id": "user_4336",
            "user_link": "/personal_pages/user/4336",
            "votes": "0"
        },
        {
            "answer": "I'm kinda going through dr he** right now. Why asks patients what happened if you don't listen to ALL they have to say? It's like they hear a few symptoms and say yeah its ?, but don't listen to the rest. I was taken to ER by ambulance Aug 8th. Started with trouble breathing, stood up and blacked out for second, laid down still trouble breathing, started to hyperventilate. My muscles contracted. Everyone thought I was having a stroke. ER can't explain what happened. Follow up with Family DR. Went to him Monday. He says inner ear problem, because I've had diziness since the incident, and pressure in my head that gives me headaches. He gives me prescription, and thats it. Doesn't tell me I can't go to work, or not to drive. I could barely walk. Stopped taking meds as prescribed because it wasn't helping. Took nausea away but I was still dizzy. He agreed to send my to Ear Nose and Throat Spec. Drove over an hour to see this doctor. To sit in his office for 10 minutes, and have him tell me he can't help me. By listening to me explain what happened he didn't believe my problem is inner ear. Called my Family Dr. They said they were sorry, but what did I want to do now. I'm the patient, shouldn't the doctor be telling me where I should go from here. So we pushed for an MRI, I just had it done on Monday, so now I wait to see if anything is on there.I'm still dizzy and still have pressure in my head. I can't seem to believe I had a panic attack that led to this.",
            "post_id": "4784479",
            "timestamp": "1250692925",
            "user_id": "user_119341",
            "user_link": "/personal_pages/user/119341",
            "votes": "0"
        },
        {
            "answer": "My TSH was a bit high on a blood test (thryroid) So the dr put me on a Synthetic thyroid hormone.  I'd get heart palps, and I felt like I'd go crazy trying to rush around to do things and everything was just..well...hyper...So I took myself off and called the dr and he said \"you got to be on it?\"  He thought something else was causing my problems.  I fought with him for about 4 months and then sought a second dr.  She said \"you have to be on it\"  so back on it I'd go at a lesser and lesser dosage with the same results...I was done...simply done with drs and my thyroid...frustrated, upset and definitely depressed.I got a really bad UTI and went to a third dr, but he was in the same medical group as my second dr.  He dealt with the UTI and ask, what was up with my thyroid and I went off.  Told him I was not there to talk to him about that.  I wasn't ever going to talk to a dr ever again about my thyroid...It was just a way for dr's to charge my insurance company for things that I didn't need and blah blah blah.  He calmly sat there and took my rudeness and ranting and then advised me that by looking at my chart, there was a very real problem...He rediagnosed me in about 30 seconds of looking thru my chart.  I had an ultra sound done.  I had a nodule on my thyroid that was putting out extra hormone and every time I started on the meds, I'd go thru something called Hyper storm...It is soooo much fun.  Unfortunately, the nodule was cancerous but we caught it early....if I'd stayed with the first two docs, I'd still be sitting here now with cancer in my throat and no idea that it was even a possibility.  Oh and the diagnosis was Hashimoto's thyroiditis...My body was creating antibodies that were attacking my thyroid.",
            "post_id": "4786592",
            "timestamp": "1250731458",
            "user_id": "user_793305",
            "user_link": "/personal_pages/user/793305",
            "votes": "0"
        },
        {
            "answer": "Another VBAC story....gone bad...long story short....My daughter has CP....",
            "post_id": "4786754",
            "timestamp": "1250734418",
            "user_id": "user_298824",
            "user_link": "/personal_pages/user/298824",
            "votes": "0"
        },
        {
            "answer": "my God, see once again tis is why I tell people advocate for selfs and be pushy try nice first if that dont work kick it up a notch, had you continued on the meds the cancer would have just spread. Most pts know their own body, its getting our thoughts converyed and having a dr believe us thats the problem. Id love to send this whole thread to every dr in the usa.crabby, I know its hard w dd, your a great mom. write your story out becauseyouve had many problems does not mean yours is not worth sharing your friends here care for you I do.",
            "post_id": "4787578",
            "timestamp": "1250762049",
            "user_id": "user_599170",
            "user_link": "/personal_pages/user/599170",
            "votes": "0"
        },
        {
            "answer": "Thanks Cherie...",
            "post_id": "4787844",
            "timestamp": "1250771381",
            "user_id": "user_298824",
            "user_link": "/personal_pages/user/298824",
            "votes": "0"
        },
        {
            "answer": "I nearly forgot about this horror story, 'til something sparked my memory about a horrible experience at a dental clinic...Speaking of mercury fillings, a number of years ago I had a horrific experience at one of those low income dental clinics.  It was such a nightmare that I vowed never to set foot into that clinic ever again...I had gone in with a problem with my bite.  I specifically told the dentist that I don't want amalgam or mercury filling to correct the problem.  I was in that office for a couple of hours, which was agony, since I have TMJ dysfunction, too, and the bite block wasn't used for some reason.  I can't remember why it wasn't used.  The dentist only complained that her back was in misery.  When it was all finished, I looked in the mirror and discovered that there was a silver colored filling where I had had the composite filling years before that.  You should've seen how pale I turned when I saw that.  I was horrified.  It was years later that I was lucky that a dental student managed to spend hours and hours to carefully remove the amalgam fillings that had replaced the composite filling I had paid good money for out-of-pocket.  He repaired the damage without my losing more of my tooth.  I am so grateful that he took so much effort to repair the amalgam.  I have health issues that the amalgam was clearly making worse and that low-income dental clinic dentist didn't even care.I didn't know it at the time that the amalgam was being removed, but the amalgam should've been removed by a specialist, since it can cause problems for both the dentist and the patient if not done correctly.  I have no doubt that I still have heavy metals in my system from the mercury.This was such a horrific experience that I have since warned my friends and associates to steer clear of this particular low-income dental clinic.  I would not be able to see a dentist than to ever step foot into that clinic ever again.  I will also never trust any of the dentists at any of the low-income dental clinics ever again.",
            "post_id": "4791111",
            "timestamp": "1250843932",
            "user_id": "user_681148",
            "user_link": "/personal_pages/user/681148",
            "votes": "0"
        }
    ],
    "post_id": "4727478",
    "question": "Drs are humans , of a sort !!LOL, they make lapses in judgements and sometimes can it be are they sometimes even WRONG?It took me three years to get my neck diagnosed, went many places was handed many pills, last dr finally listened really listened got me an mRI and sent me to surgeon Id of been papalysised in a year or two.the one time that made me the madest was the dr that when I described my hands going numb tole me it was impossible, handed me a script for heavy pain meds and sent me on my way. Im like I am not lying. He says we hear so many things in here youd be amazed,.Just wondering if anyone else has similar stories,,,and friends above all else you know your own body NEVER give up do not take no for an answer. do not accept the bandaid of pills yup they help in the meantime but are not the soultion, Had I countiuned to mask my problems I coulda been dead, Pain is a symptom always listen to it...ANYHOWS,.,,Im gonna be on here a lot so bring on the bad drs stories,,,",
    "timestamp": "1249302521",
    "title": "Descripe the one time your where most dissapointed in your dr.",
    "user_id": "user_599170",
    "user_link": "/personal_pages/user/599170"
}