{
    "answers": [
        {
            "answer": "I am currently taking DHEA. since November. They say it takes at least 4 months to work properly. I am 40 and have had 1 failed ivf. I am trying IUI this cycle as my Doc said sometimes while taking the DHEA before the 4 months time some women get preg naturally or doing IUI. So I am trying the IUI then maybe 1 last IVF cycle as money is a major factor. I will keep you posted if I have any success.Good luck to you",
            "post_id": "2443294",
            "timestamp": "1201705202",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "I am currently taking DHEA. since November. They say it takes at least 4 months to work properly. I am 40 and have had 1 failed ivf. I am trying IUI this cycle as my Doc said sometimes while taking the DHEA before the 4 months time some women get preg naturally or doing IUI. So I am trying the IUI then maybe 1 last IVF cycle as money is a major factor. I will keep you posted if I have any success.Good luck to you",
            "post_id": "2443295",
            "timestamp": "1201705203",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "Thank you desperado.  I've also been taking it since late december.  No symptoms other than thinning of hair.  We trying to raise money for our next IVF.  Please keep me posted or updated.  I'll do the same.  Thank you and God bless you",
            "post_id": "2473420",
            "timestamp": "1202290953",
            "user_id": "user_401655",
            "user_link": "/personal_pages/user/401655",
            "votes": "0"
        },
        {
            "answer": "HiI did IUI on Saturday and am now doing the dreadful 2WW and I am already feeling discouraged but not defeated. I have PMS signs and it sucks cuz IF and WHEN AF shows up I'm gonna feel like burying my self under my sheets and never waking up. Don't mean to seem negative but today I am feeling prety down. Anyhow good luck to both of us. Let me know what's new for youTake care",
            "post_id": "2478932",
            "timestamp": "1202399806",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "Hi , I'm so glad to have found a topic on DHEA!! I just went through my first failed IVF cycle and was diagnosed with poor egg quality. I don't have high FSH which would generally make it simpler to understand why I have a diminished ovarian reserve, but I have high E2 levels which artifically supress my FSH.I was also adviced to take DHEA for 16 weeks in the hopes that it will improve my egg quality. But I have no clue where to begin, where to buy DHEA supplements and what kind to use? Also, I have read that DHEA can have lasting side effects like irreverisble hair loss, which of course has not been confirmed, but I was hoping you guys would know.Are there any side effects? Which brand of DHEA to use?lots of SSBD to you ladies:)))xoxoxoxoJulie",
            "post_id": "2479884",
            "timestamp": "1202411536",
            "user_id": "user_346530",
            "user_link": "/personal_pages/user/346530",
            "votes": "0"
        },
        {
            "answer": "Desperado i wish you all the best, may you get a big fat ++++.Julie im scared now - my hair is thinner now but i thought once i stop DHEA it will grow back.  I want a baby so much i dont think i'll stop DHEA now.  Im using the original DHEA i'll check the brand name and tell you.  I take 1X 25mg in the morning and 1 in the evening.  Im self medicating on it so im scared to increase the dose.  I just want to prepare myself in advance for our next IVF.  Good luck to both of you.",
            "post_id": "2482997",
            "timestamp": "1202470533",
            "user_id": "user_401655",
            "user_link": "/personal_pages/user/401655",
            "votes": "0"
        },
        {
            "answer": "Ladies I am on 3 pilss a day 25mg. I have naturally thinning hair so I haven't noticed it getting any worst YET.... I am willing to lose some hair if it would guarantee me my baby. I can always get a wig or a hair transplant once I find a sitter for the baby for the day :). Anyhow I am so DESPERATE I am willing to try just about anything. By March it will be 4 months so maybe if I find the money I'll do one last IVF in April and then I'll know this DHEA really worked.Julie check with your RE they are the ones that determine the dose. I wouldn't have tried the pils without finding out as much as possible from my RE or doctor. They say it doesn't have a lot of side effects except for the hair loss. I have experienced a slight headache if I take my last pill too late in the evening but that's it so far. The website I went on to order my pills is: dhea.com.Good Luck to us all",
            "post_id": "2483472",
            "timestamp": "1202484326",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "Hi ladies, thank you soooo much for the responses. Ovary, Do let me know what brand of DHEA you are using.  When are you planning your next IVF cycle? I have an appointment with a new RE third week of feb, so I dont know when or IF i'll be starting any IVF at all.. I just turned 30 and can't believe I have poor egg quality:(((Desperado, all the very best to you!!  It's been two months since my first failed IVF and I have been taking Spirulina, wheatgrass since then. I haven't started on DHEA since I only found out about it recently. I do hope sooooo much that it will work for you guys.. How long have you been on infertility treatment?Do keep me posted ladies!CheersJulie",
            "post_id": "2484010",
            "timestamp": "1202492683",
            "user_id": "user_346530",
            "user_link": "/personal_pages/user/346530",
            "votes": "0"
        },
        {
            "answer": "This is a long email but I type fast and have alot of info for you ladies.here goes....I started IVF 2 years ago and started DHEA 1 year ago after 3 failed IVF cycles. I now have 10 embryos on ice and am in the middle of what we hope to be our last cycle.After alot of experimentation and mis-steps, our last cycle yielded 10 eggs, 5 were unfortunately immature but the other 5 all fertilized.I had 14 antral follicles at baseline last week and tomorrow is day 6 scan.Couple basics from my experience.1. DHEA works - I recommend to everyone get your DHEA-S and Testosterone levels tested and take DHEA dosage based on those levels. The very low doses being suggested only work if your T is already normal...but most of us with poor response will have low T and need the DHEA. If your T is in the low or below normal range I really recommend 100mg/day.2. Take it in the morning - your body absorbs it in the early morning - first thing when you wake up.3. Test your T level after starting to take the DHEA to ensure that your body is absorbing it and your T level is rising. The goal range is in the high normal or, if you're a REALLY poor responder like me, I shoot to keep it at 100 pg/ml.4. Once you start, your ovaries will become very active. In order to suppress them and get best results, you need the estrogen patch. You WILL OVULATE THROUGH THE PILL. The pill is not enough to suppress your active ovaries. I start the patch right after ovulation, keep it on for 2 weeks, go off for 3 days, then start stims.5. Baseline exam should have E2 less than 30 and at least 8 antral follicles all about 5 mm. You don't want a leader follicle for sure...make sure they're all less than 7 mm. This will be your best circumstance for the investment. DH and I defined our own criteria in baseline after the docs always said....less than 10 looks good to go and we would get different sizes and not enough mature. So we set the rules after that and it has REALLY paid off. Min 8 antral follicles and all about 5 mm. The doc got frustrated when we went 3 months without starting a cycle but I just kept my cool and humor and he was really excited and humbled by the great results we eventually got.6. You will likely need to stim for longer than the usual. I have been stimming for on average 10 days. And the E2 takeoff/major increase, seems to start a bit later. The important thing is how many follicles you see on the follow up scans.Good luck ladies!***@****if you want to email put DHEA only in the subject and I'll pick them up as early as I can.",
            "post_id": "2494393",
            "timestamp": "1202722810",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "OK- let me try and get past the filter with my emailanitasto   aolCheers,Anita",
            "post_id": "2494395",
            "timestamp": "1202722867",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Is anyone still out there? I'd really like to hear if this info is helpful. I know alot of women are wondering about DHEA and am thinking of doing more - like maybe building a website just for DHEA info/users.Thoughts?Anitasto",
            "post_id": "2500581",
            "timestamp": "1202836548",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thanks for the info. It was very helpful cuz I had no idea what to look for and what to ask my RE to check for. I guess experience does make one wiser. I am on my 3rd month and have 1 more to go on 3 pills per day. I'm hoping to be able to do IVF in March because I'm afraid if I wait to do the ivf after having taken DHEA for the 4 months it might wear off. I don't know. I'm just so confused sometimes. It's all quite overwhelming.Let me know how your cycle is going",
            "post_id": "2503352",
            "timestamp": "1202875375",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "I started DHEA last week...it says take 25mg a day but I'm taking 50 mg..you think that I should take more than that?? I'm self-medicating too:)  Unfortunately I wont be able to be on it 4 months before IVF..more like 6 weeks.Also, do you keep taking it while you're stimming or do you stop when you start the injectables???And this is supposed to help you get more follices with better quality??? That's what I need!",
            "post_id": "2503526",
            "timestamp": "1202878283",
            "user_id": "user_208962",
            "user_link": "/personal_pages/user/208962",
            "votes": "0"
        },
        {
            "answer": "Hi Anita,Thank you so much for the detailed info! What I would love to know is if someone actually SAW an improvement in egg quality after taking DHEA for 4 months? Also, is it true that taking DHEA results in permanent hair loss? How severe is it? How much better is DHEA when compared with doing acupuncture, wheatgrass, spirulina..etc?thanks and all the best!!Julie",
            "post_id": "2504957",
            "timestamp": "1202919360",
            "user_id": "user_346530",
            "user_link": "/personal_pages/user/346530",
            "votes": "0"
        },
        {
            "answer": "Check this out, VERY interesting article.http://ezinearticles.com/?DHEA-Helps-Thwart-Infertility-In-Older-Women&id=702017",
            "post_id": "2507163",
            "timestamp": "1202945714",
            "user_id": "user_414225",
            "user_link": "/personal_pages/user/414225",
            "votes": "0"
        },
        {
            "answer": "All the ladiesI've stopped DHEA because i was experiencing serious hair loss, im scared that my hair might not grow back but I dont care, as long i can have a baby in my arms.  I still have a full bottle which i will take as soon im 100% sure of the month we'll be starting with IVF no 2.  Right now we dont have enough funds but im sure we will do it before the end of the year.Good luck to you all and lots of +++++++",
            "post_id": "2508908",
            "timestamp": "1202977706",
            "user_id": "user_401655",
            "user_link": "/personal_pages/user/401655",
            "votes": "0"
        },
        {
            "answer": "HI DearMay i ask how many eggs did you get during your first IVF cycle?  I got 7 but only 4 fertilized and all were put back because of my age.  I just pray that DHEA will yield more and quality eggs for me.  Everything went well with the steaming but none of the eggs took.  My problem is blocked tubes.",
            "post_id": "2508915",
            "timestamp": "1202977889",
            "user_id": "user_401655",
            "user_link": "/personal_pages/user/401655",
            "votes": "0"
        },
        {
            "answer": "Hi.... Not sure if you saw my post but I got my BFP. I'm still in shock but tryin to keep positive. I do believe the DHEA really worked because I did about 4 IUI's and 1 IVF I had 2 eggs put back and cycle still failed. I had given up on IUI's plus I was told by a GYN that I should give up totally on fertility treatments because I have 1 blocked tube, fibroids and I am 40. Well good thing  I never gave up and to top it off the IUI worked not even IVF. I am a believer in God and science working together. My advise to you. Don't give up I am living proof of having faith.Best of luck",
            "post_id": "2518456",
            "timestamp": "1203170319",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "Dear anitasto,I found your long write up and feel like hitting a gold mine. I have been trying to find out more about the DHEA. I have asked three different RE and they all gave me different responses. Two believes that it does not work at all.I wonder how you find out the balance of the different hormones, i.e., Testosterone, estrogen. Is that by your own experiment and experience or your RE told you.I just started take it for 5 days without knowing all the details. Should I get my testosterone and estrogen levels tested first? Please advice me?Many many thanks to your help.Frisbe",
            "post_id": "2573674",
            "timestamp": "1204206113",
            "user_id": "user_432206",
            "user_link": "/personal_pages/user/432206",
            "votes": "0"
        },
        {
            "answer": "I have two more questions about DHEA:1. Do you recommend that I took all 75 mg DHEA in the morning for better absorption?2. I will be do an ivf soon. Should I stop taking it after the embryo transfer? Does the DHEA affect the embryo development?Thank you very much.Frisbe",
            "post_id": "2573846",
            "timestamp": "1204208537",
            "user_id": "user_432206",
            "user_link": "/personal_pages/user/432206",
            "votes": "0"
        },
        {
            "answer": "I have been on 75 mg of DHEA for 4 months from my doctor and we will begin an IVF cycle next month. I am also taking 2 mg of TotalDHEA which a holistic doctor prescribed to take with it for better absorption.I can never remember to take it (plus everything else) 3 times a day and normally take it all at once. Is that bad?The only side effect that I've seen is my face has broken out badly, but the doctor told me to expect that.I have very few follicles (1-2) in every IVF/IUI we have attempted. The doctor sees this as our last go.I'm a bit concerned just because the doctor has never had anything to do with DHEA before, and I hope we're doing things right.",
            "post_id": "2753869",
            "timestamp": "1207675435",
            "user_id": "user_474419",
            "user_link": "/personal_pages/user/474419",
            "votes": "0"
        },
        {
            "answer": "Taking DHEA is new for me too and I really believe it helped me conceive in Feb though I had a miscarriage. I am 40 and maybe my egg quality was poor but I had taken the DHEA for less than 3 months when I conceived. I am still on it and like yourself hope it has helped. Believe and have faith it will help!!! Even though there were times you forgot to take it don't worry taking it for 4 months is great. I wish you all the best for your IVF please keep in touch and let me know how things go.BTW how old are you and how long have you been TTC?",
            "post_id": "2756694",
            "timestamp": "1207714198",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "I'm 36, and have been trying since age 32. I have one 14 year old son. In 2005 I conceived a beautiful baby girl who unfortunately was diagnosed with trisomy 18. I carried her to term, but she was stillborn. Since then we have been unable to conceive. The doctors believe that I have a low ovarian reserve, which is so mindnumbing. I just don't understand what would cause it. Part of me really thinks it is the stress of everything that happened, now compounded with being unable to conceive. My family history includes all sorts of women who have conceived late in life. Pregnancies and deliveries themselves, even with Amara, are really easy for me. Maybe I'm just in denial, but I don't get it. I'm really hoping the DHEA will make a difference. I believe that doctors have given up hope and this is their \"last shot.\" We are going on the patch this month and then trying for an IVF in May. It's the last protocol they haven't tried. I've never had more than 2 follicles. Thanks for the note.",
            "post_id": "2757390",
            "timestamp": "1207743001",
            "user_id": "user_474419",
            "user_link": "/personal_pages/user/474419",
            "votes": "0"
        },
        {
            "answer": "Your story is touching. You've already been through so much and I hope DHEA is your answer. I'm so out of it. What is the \"patch\"? I have two children 18 and 13. I remarried and my current husband has no children of his own so I understand your frustration once being able to conceive and then being told we CAN'T!!!!!!.  After what you've been through I can see why you were stressed. I too get so stressed at times I hardley want to talk to anyone. I will keep you in my prayers for your IVF in May. I wish you and your DH a successful IVF cycle, a successful, healthy pregnancy and a safe delivery. You deserve this........ honestly you do.Please keep in touch",
            "post_id": "2761092",
            "timestamp": "1207797649",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "DHEA for low fertilization rate??Hi, I'm glad found this site just recently...I had two failed ICSI in the last 6 months, each time produced 7 eggs, 5-6 matured ones but with fair or poor quality.  First time none of them was fertilized and second time we had one fertilized with no fragmentation 6 cell transferred at day 3 but BFN.  We have several male issue here as well.  My first RE said it's the egg quality due to my age (39) and he refused to retreat me anymore if I don't move to DE.  So I went to a second RE and also was told don't waste time and use DE.  They don't think there is consistent and large evidence that DHEA will work.  My antral count (no stim) dropped from ~10 six months ago to now ~4 after two ivfs in last 6 months.  I am taking DHEA now and along with acupucture and herbs, and  I am trying to find a RE or convince my current RE to give me one more chance (seems they all want to just do DE).  Anyone can share some their similar experiences and thoughts, or support?ThanksBNF",
            "post_id": "2765248",
            "timestamp": "1207876277",
            "user_id": "user_476990",
            "user_link": "/personal_pages/user/476990",
            "votes": "0"
        },
        {
            "answer": "hello, who is your Fertility specialist?  Im nearly 40 and about to undergo my second IVF.  I intend going to Dr Joubert at Pretoria East hospital, i hope and pray that he's not negative about the age issue because im not yet prepared for a Donor Egg lecture. Please tell me.  My first specialist was Dr Pentz at Kloof hospital.",
            "post_id": "2791368",
            "timestamp": "1208431755",
            "user_id": "user_401655",
            "user_link": "/personal_pages/user/401655",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies – Long time! Sorry about that! Here are responses to your questions. This is a long one but I hope I’ve answered all your questions. And I promise to log in here more often! Desperado:  Congradulations on the conception but terribly sorry to hear about the miscarriage. Hang in there babe – you’ll get a babe yet. My recommendation is mortgage the house for IVF and PGD before time runs out. ;)  see response to your Qs  #1 and #2 below.Shayla: taking more is good. With your enthusiasm you’ll do great! Good luck! You are #3 belowJulie 1615: yes they have proven increased quality of embryos. Got to centerforhumanreproduction and read up there and/or follow the link to their published study. Hair loss is EXTREMELY rare with DHEA. DHEA shouldn’t be compared to acupuncture – do them BOTH. You are #5, 6, and 7 below. Best to you too!Frisbe: what a great name! I know how you felt…I felt the same way when I read the published research by Casson and Gleicher in 2000 and 2006 respectively. Be sure to ignore the naysayers sweety. You’ll find them everywhere. My husband calls doctors and nurses technicians instead of scientists. Even my own RE, despite all his support, still doesn’t recommend it outright to new patients. Doctors are most often extremely slow to change and embrace new protocols and they are afraid of doing more harm than good when wading into the abyss. Some goodies for you in  #8, 9, 10, 11 below. And see #2 – 4 for your second questions. I’ll look forward to hearing your updates!Blondemacb: I think its fine to take all at once in the morning but work at 100mg first if you go that route. Yes…my back and face broke out….but scrubbing with those hand scrubby gloves from Target helped somewhat. For you….I REALLY recommend counting your antral follicles before starting your last cycle. I had DOC scan me on day 15 and day 27 before my period for 3 months. Each month on DHEA I had 2 more until I had 10 antral follicles after my Testosterone had been up consistently for like 2 or 3 months. We were in the same boat as you…..on our last try and couldn’t take a chance of wasting it without seeing a minimum of 8 antral follicles before we said GO. See #12 below about the patch….this is important for you.BNF:  My Dear you are in a common predicament with many of us poor responders. If you can’t find a high quality doc to take you here’s a suggestion….challenge your doctor to scan your ovaries on day 20 and 27 of your cycle. Ask if he sees more activity will he reconsider. I promise you my dear he will see more follies and when you do IVF all of your mature eggs will fertilize. I’ve done 3 cycles and every mature egg I’ve gotten has fertilized normally. Also had a friend do the 100mg/day in the am for just a month and she got 4 eggs, all fertilized normally, and she’s got  the BFP! Hang in there….I would put $$ that you’ll be in another cycle within 2 – 3 months.1.\tDHEA DOES WEAR OFF. I’ve been on high doses for a long time and within 2 weeks of stopping the DHEA altogether my testosterone level returned to its original very low level. My ovarian function has slowed visibly via ultrasound in one month. At this rate I am guessing that 4 – 6 weeks off DHEA after 4 months on it will return you to COMPLETEly original condition.2.\tSTOP DHEA BEFORE EMBRYO TRANSFER. DHEA increases your testosterone and high testosterone is a common cause of miscarriage. This is also reflected in the higher than normal miscarriage rate at CHR when they studied DHEA.3.\tIF YOU DON”T HAVE 4 MONTHS TAKE MORE. In general I don’t think that 25mg 3x/day is going to work for more than 50% of women. If you get eggs and are just improving quality then I think it could be enough. If you get very few or no eggs then I recommend 100mg/day once in the morning. I would not take any more than 150 mg. I have experimented all the way up to 450mg/day and prematurely ovulated despite the proper injections to avoid it.4.\tTAKE IT IN THE MORNING. After much research and my own switch from 3x/day to just the am I believe DHEA is primarily absorbed and converted to DHEA-S in the morning. So I took it 8am daily in my, what I’ll call second phase of experimenting. My Testosterone only then began to rise quite nicely and consistently and antral follicle count increase soon followed.5.\tEMBRYO QUALITY YES, CHROMOSOME QUALITY STILL UNKNOWN. Note – you can have a normal chromosome setup in an embryo and also have  crappy embryonic (fluid) health. We know DHEA improves the fluid health but its not yet clear if you would get a higher number of PGD quality. Its also interesting to note that miscarriage can be higher with DHEA.6.\tHAIR LOSS IS EXTREMELY RARE. Hair loss can occur with very very high levels of testosterone….like over 200ng/dl I believe. If you have few or no eggs then you likely have very very low testosterone and DHEA up to 150 mg/day should not raise your testosterone over 120ng/dl. Everyone is different so best to find a doc that will throw in DHEA-S and T to your blood work just to see that you’re not having some strange hyper reaction and getting very high Testosterone levels. These blood tests are very inexpensive.7.\tDHEA BEST WITH ACCUPUNCTURE AND BABY ASPIRIN. Because DHEA increases your testosterone your red blood cell count will increase thus actually thickening your blood. So it is really good to do it with BABY ASPIRIN AND ACCUPUNCTURE to thin the blood a bit and get it over to your ovaries. Poor responders, in conjunction with low testosterone, can also have poor blood supply to the ovaries reducing your response and Accupuncture can take care of that.8.\tTEST TESTOSTERONE AND DHEA-S ON DAY 1-2 & 14, AND ESTROGEN AND FSH ON DAY 1-2. Best if you can get these tests before you start for baseline. After a week on DHEA your DHEA-S should increase significantly, like anywhere from 50 to 100%. It WILL go well above normal but this had no ill effect on me even over 2000ug/dl. Get you lab results printed from your doctor and keep track. Don’t just take the verbal…’you’re above normal…within range…etc.’ you typically get from doc. Track this yourself because the docs do not have a basis in publication for evaluating this data.9.\tBASELINE ESTROGEN GOES DOWN on DHEA. Poor responders typically have elevated baseline estrogen. DHEA can and should cut that elevated level in half after 2 months.10.\tBASELINE FSH GOES DOWN on DHEA. Again..poor responders typically have elevated baseline FSH. I’ll spare you the biochem and just tell you that mine went from 11 to 3.5 and stayed there around 3 while on DHEA. There is a direct correlation between these and increasing your Testosterone level via DHEA.11.\tALCOHOL INTERFERES WITH DHEA-S – DON”T DRINK AND DO DHEA.12.\tESTROGEN PATCH TO DOWNREGULATE OVARIES BEFORE STIMMING. I ovulated through the pill 2 months straight while on DHEA and the doc wouldn’t believe it until he saw it. Another friend had the same experience. Finally my doc got advice from GLeicher who did the study. The only way to downregulate your ovaries once you’ve gotten higher testosterone from DHEA is the ESTROGEN PATCH. I had to use 2 patches and switch them every day just to keep all the follies at less than 7 mm before stimming.",
            "post_id": "2863357",
            "timestamp": "1209889472",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hello!Thank you so much for your long very informative response. I had my day 2 ultrasound, etc. yesterday...with only 4 antral. However, I looked back at my antrals for the past 7 (wow, it's been that long with 4 iuis and 3 stopped ivfs) and I've had more than 4 only once when I had 9, and that time I only ended up with 1 actually growing. Last time I had 3 antral and 2 grew. I think I'm going to wait and see and hope that I have 3 out of 4...that is the magic number for them going through with an ivf...I need 3 eggs to grow. I'm hoping the DHEA will help.What my biggest concern is is that the center, who is one of the leading fertility clinics around and are really based on research, do not have any experience with dhea. Myself and another woman are the first there. They wouldn't do a blood test for DHEA, stating there wasn't anything they would learn from it. :-( I'm really bummed about that.I just started clomid last night. I've tried every cocktail mix there is thus far. What cocktail mixes worked for you best with DHEA?J",
            "post_id": "2881308",
            "timestamp": "1210256769",
            "user_id": "user_474419",
            "user_link": "/personal_pages/user/474419",
            "votes": "0"
        },
        {
            "answer": "I totally understand what you're dealing with. None of the REs are doing bloodwork because the studies published, other than CASSON in 2000 didn't track blood levels so they have nothing to go on. I tracked my blood for almost 2 years and 4 cycles. Please trust me tracking your blood is important and you need to just be firm and tell them you want it. They will give it to you if you demonstrate determination.  Tell them its very very important to you that they test DHEA-S and Testosterone (T) free and total at least bi-weekly and your FSH and E2 on day 2 of cycle. You will likely find your T in the low range to start. I recommend taking DHEA at doses increasing by 25mg every 2 weeks until you can see your T close to 100ng/dl. And get the lab report print out from them...and track this yourself. This is your money and your baby....I firmly believe you need to find a doctor who will at least allow you to test your DHEA-S and T twice a month until you start your cycle. I rolled over to doctors for 3 cycles and lots of $$ and failure before I finally went on the search for a doctor who would work with me.I just had a transfer yesterday of 2 hatching pgd quality blasts out of 5 tested at age 41. 2 years ago I couldn't even get more than 2 embies past day 3. The DHEA and your Testosterone levels are all the difference in making those healthy eggs.Sounds like you're heading in the right direction. Hang in there! :)anitasto",
            "post_id": "2892290",
            "timestamp": "1210499210",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "You are such an inspiration. Please keep us posted since you just had your transfer. I will pray for you to get your BFP. You've prepared yourself so well for this journey. You have given us so much hope and information and it's greatly appreciated. You deserve this and I believe it's going to happen you WILL be rewarded for all your hard work.Take care and keep hope alive.",
            "post_id": "2895846",
            "timestamp": "1210607250",
            "user_id": "user_204002",
            "user_link": "/personal_pages/user/204002",
            "votes": "0"
        },
        {
            "answer": "thanks sooo much for your kind and encouraging words...which have brought tears to my eyes. So few folk understand what a journey this has been. Promise i'll keep posting.Today ...8 dpo/3dp5dt... I started cramping and have been for the past several hours. based on other 2ww blogs from ppts this seems a good sign. :)   oh - btw - the embies are both boys! dh is cautiously optimistic but happy so far.how are u my dear? would love 2 hear how ur doing.",
            "post_id": "2897151",
            "timestamp": "1210625309",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I'm sad to report that our 2 hatching embryos didn't quite take. HCG of 2 today at 15dpo or 10dp 5det.We still have 5 embies on ice that are actually younger than these. Hard to imagine what can beet hatching embies.Still a big believe in DHEA so hang in there ladies. These were PGD tested hatchers at 5 days and I was 41 at collection time. Nurses said that hardly ever even happens for donors. Those results, even though my uterus didn't hold on to them, are worth the effort if it helps others succeed.Wishing you all well and lots of follies....Anitasto",
            "post_id": "2927194",
            "timestamp": "1211272564",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thank you very much for the support and inspiration. This past IVF cycle, with a Clomid/ganirelix cocktail I ended up with only one follicle (later one more sort of appeared that was hazy) and they turned the IVF into an IUI. I have been doing acupuncture religiously along with the DHEA this cycle. They did the IUI on Monday and I'm crossing my fingers and doing a lot of deep breathing. My acupuncturist wants me to try a lot of visualization so I've been scouring the net for fertilization/implantation pictures.Based on some things mentioned, I stopped taking the DHEA however for right now as I had read about the possible miscarriage link. I will start taking it again if this doesn't work out and I will increase my dose to 100. Is that what I should do? What do you recommend?All my doctors still refuse to do any DHEA or testosterone testing, so I'll have to experiment blind. My doctor told me that he no longer feels i am an IVF candidate as I have never had more than 1 or 2 follicles develop to the appropriate size, but wants me to keep trying IUIs or move to a donor.I'm at the point where I just want to try some more alternate options. Doctors don't seem to know much, except for \"hey, here is a new cocktail.\" My doc did agree that if I wanted I could try one more time, possibly on the Femera cocktail which I haven't tried yet. I\"ve tried every other drug combo there is.What drug combos have worked best for you? Good luck on your journey. :-)Jenn",
            "post_id": "2935768",
            "timestamp": "1211374309",
            "user_id": "user_474419",
            "user_link": "/personal_pages/user/474419",
            "votes": "0"
        },
        {
            "answer": "Hi Jenn,I'm really hopeful for you that your IUI was successful. I can suggest a couple of things for you..a. try going to your regular family physician and ask for a hormone panel. I did this with my physician who was a woman, brought her a print out of the case study by Gleicher of the 42 year old with 60+ frozen embryos, and she was all over it. She gave me blank bloodwork sheets so I could get tests whenever I wanted.b. If the number of follies hasn't increased with 75 mg/day I would definitely increase dosage if this cycle isn't successful. I can tell you that 75mg/day sort of helped for me but when I picked it up increasing about 25mg/month to over 200mg/day I got a cycle with 10 eggs. Turned out 5 were mature and 2 of those were the PGD normal embryos I spoke of last. That puts us at 40% quality. Not too shabby.BUT...before taking ALOT of DHEA....its really important to be sure you're not sending your Testosterone through the roof. If you get pounding heart and shortness of breath your near the ceiling.Hang in there Jenn and let me know how things turn out. :)Hugs for now,Anitasto",
            "post_id": "2984991",
            "timestamp": "1212397796",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I am a physician.  Started trying at 33y.  No success.  Countless IUI's.  One failed IVF cycle and one cancelled.  At 35y I was told to think about egg donors and they were willing to continue IVF but since I was a poor responder they did not think it would work.For the second IVF cycle I had already started having acupuncture and taking their herbs.  After leaning of the poor quality of the eggs retrieved...I sat in bed and researched poor responders.  I came across the information on DHEA.  My RE knows Casson and spoke with him about his study.  He is a believer in DHEA.  I started 25mg 3x day and in six weeks was pregnant.  We had a miscarriage at 10 weeks.  Went back on DHEA.  Three months after starting it up again my antral follicle count was much improved.  Few weeks later found out was pregnant again.  My RE wants to do a study on it since he saw the positive effects first hand.  He was very willing to try what I wanted to do and encourage you all to find an RE that wants to work with you.I am 31 weeks pregnant with a baby girl and am soo excited.I used the same DHEA from the Casson study, from Belmar Pharmacy...you can order by phone and they mail it out the next day or two.  I had acne and hair loss.  Controlled it with alternating 25mg 2xd and 3xd.  My side effects we well controlled.I had testosterone levels checked and they were high but not problematic and since my RE was working with me on this experiment he was watching and checking regularly.I continued acupuncture.Hope this helps.  Wish you luck.  It is such a hard road to do what we have all done to get pregnant!P",
            "post_id": "2986984",
            "timestamp": "1212431133",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Hi Puglies and Antitasto, when you were taking DHEA, did you notice that your menstrual period changed?  I have been taking DHEA for two months and now I have very light periods whereas they used to be heavy.(I go for my third IVF round now.  Supression in June, stim in July (middle-long protocol)).Thanks,Angela",
            "post_id": "2996293",
            "timestamp": "1212600574",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Did any of you that used DHEA have normal FSH levels but low antral follicle count?  If so, did DHEA improve the AFC even though your FSH levels were already in the okay range?Thanks,Angela",
            "post_id": "2997375",
            "timestamp": "1212613506",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "My FSH was borderline elevated.  Upper limits of normal on some scales and one point high on other scales.  And I had low antral follicle count.  The months wasted playing with IUI I had normal everything.  My cycle only changed to go back to 30days which it had shortened to 28days with IUI.We were waiting for Jan for another round of IVF when I got pregnant in Nov.  So mine ended up a spontaneous pregnancy.Good luck with third round!!  How long have you been on DHEA??P",
            "post_id": "3000883",
            "timestamp": "1212685523",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "I started taking the DHEA about a month and a half ago.  I calculate that by the time I stim, I will have been on DHEA for around 3 months.I am an American living in Germany.  The docs here a little conservative.  I just turned 41 and felt I did not have any time to lose so I started DHEA on my own (I bought DHEA when I went home to the States, Natrol brand, because a prescription is required for it here in Europe).P, I am so scared to do what I am doing, but at 41, I am in the corner and worry I cannot afford NOT to take DHEA, especially if it will do something about my antral follicle count and maybe improve oocyte quality.I was happy to have found your posting and see your reply.  Gals like you make me feel less alone in all this.Angela",
            "post_id": "3001344",
            "timestamp": "1212690668",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "I was not scared, just reaching giving up.  We were ok with donor eggs because all I was my husbands baby and I could have that either way.  DHEA was not scary or hard to take.  But I had resources that many do not.  If my RE was not helpful, I could have figured it out on my own.  But if you look at DHEA, there are many people who take it for various reasons.  I would be scared to take more than 75mg/d.  It is a hormone.  But if you have been on it for 3 months than you must be doing well on it.  In the studies they use it three times a day.  I hope that is how you are taking it.Does your RE know you are taking it?The whole process is insane.  It is hard to take all the pills and injections and feel like a failure.  I kept trying to be optimistic and tried to remember all I needed was one good egg.  But I am not optimistic by nature.  It was hard.GOOD LUCK!",
            "post_id": "3010270",
            "timestamp": "1212876867",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "I am a very poor responder. I am 35 and have been trying for 4 years. I had dhea levels checked last year and they were 550 (high) so I assumed I am not a candidate. Did you have baseline levels done? If my dhea is high, will my dhea-s also be. I am desperate at this point.",
            "post_id": "3018635",
            "timestamp": "1213063317",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Dear Antitasto,I am so glad to read your paragraph. I had a Hep C treatment which wiped out my ovarian function, I wish I had known or the doctor had told me the side effects, because the H-C treatment was to clear the path for pregnancy. Now I am 43 and have FSH reading at 39. I am told my chance to pregnancy is around 1% and told to use donor egg. I am thinking of trying DHEA but no one out there will work with me. I live in the UK, and you know how nasty and inept the National Health Services is, so do you know of good honest experienced US doctors, I do not have a lot of money to burn, but still want to try IVF once since natural is too late for me.Regretta",
            "post_id": "3023806",
            "timestamp": "1213163150",
            "user_id": "user_533026",
            "user_link": "/personal_pages/user/533026",
            "votes": "0"
        },
        {
            "answer": "I never had a baseline dhea level.  I think the only thing my RE checked was testosterone.   And this was not tested until two months into me taking DHEA.  It was high but as long as I was asymptomatic he wanted me to take as close to 75mg/d as possible.  I took myself down to the 50-75 alternating because I was tired of the acne.  I am sorry I do not have any answers about it baseline DHEA levels.  Have you researched it on the internet?P",
            "post_id": "3027894",
            "timestamp": "1213241760",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "EARLY OVULATION ON DHEA?I have been taking DHEA since a failed IVF in mid-May.  (I'm 31, but I have low ovarian reserve and didn't respond too well to the IVF, so my doctor said I could try DHEA in gearing up for the next IVF.)  I've noticed that I seem to be ovulating a lot earlier than usual--on day 11 the first cycle, and now I seem to have ovulated on day 8 on the following cycle.  (Before the IVF, I never ovulated before day 14.)  Have you ladies experienced the same thing?  Does DHEA make you ovulate early?Ann",
            "post_id": "3033826",
            "timestamp": "1213366452",
            "user_id": "user_535041",
            "user_link": "/personal_pages/user/535041",
            "votes": "0"
        },
        {
            "answer": "First of all - thank you so much PUGLIES for joining this blog, sharing your experience, and answering our same boat friends' questions! I have felt quite alone in this for a long time and your experience, qualifications and connections are just what this avenue of fertility is needing. I wonder if we might chat more directly some time if your re is considering a study. I've actually written a study outline based on my solid year of endocrine function research and experience and data of my own 2 years.Either way - I'm enjoying your messages! :)",
            "post_id": "3068526",
            "timestamp": "1214125678",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Ann,Great question about early ovulation on DHEA. I did experience-earlier ovulation-shortened cycles as short as 24 days from usual 28-lighter and shorter periods.If this is happening I think it is also likely that the DHEA is lowering your base FSH level as that effect also coincided with these symptoms for me. This is a good thing.But I strongly recommend have your day 3 FSH, T, E2 monitored while on DHEA. My E2 went TOO low (because I treat myself like a rat and took more than most) and we managed this by adding the E patch between cycles after ovulation while waitin to start.Go girl! :)Anitasto",
            "post_id": "3068528",
            "timestamp": "1214125932",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "My Dear - so sorry about your Hep C treatment and current predicament. I gladly refer you to my RE here in San Diego at La Jolla IVF - just google and when you call ask for Amy and tell her  referred you. They are the most loving and supportive folks around.Beware however - despite all my time and progress and success with DHEA with this clinic - they will do whatever blood tests you request but will not focus on DHEA portion of your care just the traditional. You can ask - just don't expect much. The doctors out there just haven't by and large evolved to the DHEA world.Best Wishes to You,Anitasto",
            "post_id": "3068532",
            "timestamp": "1214126199",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi you two,  yes my period is lighter and ovulation a bit earlier, though not much.  I stay on the 75 mg per day, and no my RE does not know about it.  A little hair loss and a little bit of acne, but nothing worrisome.I will let you know how it has affected me and follies, if at all.  Next week I begin the supression phase, in July I stim.Keep letting me know how you are doing and anything new you might hear of regarding DHEA.Angela",
            "post_id": "3074073",
            "timestamp": "1214256481",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Given your symptoms/changes, it really sounds like its working. Congradulations on that important step! Hope you have follies like popcorn! haha ;)Cheers,Anitasto",
            "post_id": "3084843",
            "timestamp": "1214458714",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi.  Thanks so much for staying with this thread.  I am a 40 year old woman.  We have serious male issues.  I have a beautiful 3 year old son who is a product of IVF / ICSI.  (11 eggs, 4 fertilized and implanted).   DH & I did a second round of IVF in Dec (07) and produced 6 eggs.  Only one of which fertilized.  I was implanted on day 3 because of fragmentation of the egg.  Amazingly, I did become pregnant.  Unfortunately, I miscarried at 10 wks.  Saw my Dr. this week hoping to do another IVF cycle right away.  He has now started me on DHEA.  He printed me several studies regarding its success.  I wonder now why he did not mention it for last cycle.  Anyway, he told me to get in touch in 8 weeks and we will set a schedule.  I am hoping for the best as this is the last IVF we will be able to afford (borrowing from my 401K this time as I already have a loan out for the last one).I really just wanted to say THANKS and let you know how much your experience and insight mean to all of the ladies out ther (like me) who are paddling that boat in the vast overwhelming ocean with you.Sending good baby mojo your way,Civsgirl",
            "post_id": "3092082",
            "timestamp": "1214608366",
            "user_id": "user_547750",
            "user_link": "/personal_pages/user/547750",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for your input. I am 35, with highest fsh 15 but a very poor responder to stims. I was hoping to get your feedback about if i should try dhea and at what dosage.I had labs done on day 21 of my current cycle (this was after femara/repronex which produced a dominant follie so I cancelled and tried naturally):dhea-s 78 ug/dl (range 45-270)dhea 473 ng/dlserum testosterone 76 ng/dl (range 14-76)free direct testosterone 1.0 pg/ml (range 0-2.2)My hesitation is my test level. I'm not sure if it is high from the stims I did this cycle so I will recheck it on day 2 of my next cycle. If it stays at this level should I still do dhea? My free test is normal, so do I go by that number or the total? With my dheas low, I'm not sure why my test is high. I would love to get your input.",
            "post_id": "3093820",
            "timestamp": "1214662801",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "I can't tell you how much your message means to me. Thank you so much for your recognition and appreciation. Its been a long road for us and knowing what I've done is helping others really makes it so much more worth it.Hope we'll see you back here with your updates. Sounds like your doc is getting on the wagon and that is a really great sign for all of us.Hug over IP ;)Anitasto",
            "post_id": "3102595",
            "timestamp": "1214872734",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Well you are an interesting one. I went through my data and did several hours of research before responding. So here goes....Its too curious that your T is in a good range but your FSH is so high, especially for your age.Here's some relative comparisons to your numbers to show your uniquenessMy baseline DHEA was 392 and DHEA-S 66 with T=29 and free T=1.2pg/mL, FSH=10Your (repeating here) is 473 and DHEA-S 78 with T=76 and free T=1.0pg/mL, FSH=15PCOS is more like     10000 and DHEA-S 700 with T=120 and free T = 7 pg/mL, FSH = 3(the PCOS isn't from any specific data - but you get the idea)Normally, when T is high, FSH is low and vice versa. Because you're not quite fitting this typical spectrum I think you were smart to question and will be wise to look a bit further before adding DHEA.Here's what I would do if I were you......1. Have blood tests on Day 3 for the following hormones (day 21 is also an option if timing is poor and waiting is too hard (I can hardly ever wait myself ;)):ACTH, Cortisol, Dhea, Dhea-s, Androstenedione, T, free T, E2, Estrone, SHBG, IGF-1, EGF as well as Thyroid panel: TSH, T3 and T4All of these hormones are related and a disproprortionate level somewhere in the chain provides excellent pointer to the problem.Testosterone is supported by the Adrenal gland primarily and can also be effected by the thyroid gland.IF your doc says .. 'it's all in the normal range' and you get those good old #s in hard copy to see for yourself (just to be sure and also you can share here ;))....then, ok, I'd start the DHEA but at a low dose like 50mg in the am and test your T after a week. If its already over 100 then lower the dose or reconsider. If not I would probably cautiously move forward and bi-weekly test DHEA-S, T, IGF-1 and FSH twice a month afterward. This is really important I think in your case.Good news is that you're relatively young so if you can quickly focus on figuring this out then there is quite likely a solution and you can then be on your way to the baby farm. ;)I hope you'll post back here and share your findings. I'm really interested to see what the other levels look like and what your doc may have to say. Note - if your doc looks at you dumbfounded which they shouldn't but somehow often seem to.....you're just playing it safe and making sure no stone is left unturned.  You don't want to give up on your babies prematurely.A curious situation unsolved nags at me more than the average person...so I really hope you'll come back.You'll be in my thoughts...Sincerely,Anitasto",
            "post_id": "3104293",
            "timestamp": "1214916999",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Can you weigh in for Civsgirl? Hope you're still with us....eventhough you probably have a bouncing baby by now! :)Anitasto",
            "post_id": "3108128",
            "timestamp": "1214982876",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I really appreciate your reply. You knowledge of endocrinology is really amazing. My sister is a doctor so she is ordering these for me. I was pre-med so I have a basic understanding. I'm in nyc where the re's just look at the fsh and response to ivf, so I am going at this on my own. I am expecting my period today and will have all the labs tomorrow an will post back early next week when I have the results. One thing with my history is that I conceived very easily on my own 4 yrs ago, but m/c at 10 wks. My fsh after that was 7. Due to impatience to get pg, I did clomid soon after the m/c which spiked my fsh to 15, changed my cyles (3-5 days of spotting before af) and have been unable to conceive on my own or with ivf. So i do feel I may have some hormonal inbalance that may have been triggered by the clomid. Hopefully the labs will uncover something. Thanks again for your help and I will post the results next week.",
            "post_id": "3108758",
            "timestamp": "1215003929",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Hi Anitasto!THANK YOU so much for sharing detailed information on DHEA. I have been reading on DHEA. I am glad I found this forum and your messages.I just had my first failed IVF. I had 12 mature eggs retrieved, all fertilized, had 5 growing to 3-day, 3 transferred, other 2 didn't make it to freeze. I am 40 and TTC #1 with my DH. We got married Jan 2007.I got PG the first month we started to ttc around July-07, I didn't know. I was on progesterone that my GYN gave me and I just started to see my RE. He told me to get off progesterone so he could start the fertility workup. I wasn't getting my period so RE did a blood test and found out I was actually PG. I miscarried at 6 weeks. Next normal cycle I took the CCCT and again got PG, I wasn't taking Progesterone. I miscarried at 4 weeks. We did medicated IUI cycle in January-08. Then took a break, started acupunture and chinese herbs for couple of months. Then did our first IVF in June-08. In a nutshell, that is my TTC story.I contacted the NYC clinic (http://www.centerforhumanreprod.com/premature_ovaries.html - discovered, from one of their patient who was taking DHEA to increase oocyte count without telling her doctor) how DHEA helps fertility in older women. I asked them what doses they usually prescribes for patients. They prescribe 50mg in the morning and 25mg at night for average weight women (100MG, 50mg + 50mg for women over 185lbs). Of course they are against shelf-treatment. I ordred DHEA from Belmar Pharmacy, waiting to receive it.I mentioned about that clinic because Regretta from UK asked for a clinic in US who works with DHEA.I will be contacting my primary care doc to order me the hormone panel/blood tests you mentioned. I had a baseline done in September 2007 as part of my fertility workup, and my Testostorone was 86 (normal is between 14-76 I believe). From your research/experience, is that too high to take DHEA?Last blood work on day-3 prior to IVF cycle was in May-08, here are the numbers:Estradiol 25.7Prolactic 18.6FSH 7.39LH 4.7TSH 1.66Thank you again!HQ",
            "post_id": "3111995",
            "timestamp": "1215052458",
            "user_id": "user_551909",
            "user_link": "/personal_pages/user/551909",
            "votes": "0"
        },
        {
            "answer": "No baby girl yet.  Sorry have been out of the loop.  Just tired, big, excited and still working.  Also have had visitors from out of town.  How did you get interested in DHEA?  Every time I talk to my RE  he says he wants to do a study but he has yet to even start the basics.  Will let you know if he goes for it.  I know he tried someone on it after my success but she could not tolerate the side effects.So first...my cycle actually got longer while on DHEA.  As I tried to post earlier but maybe was too tired to make sense, I used to have a 30d cycle and with all the hormones and stimulations I came down to a 28d cycle.  My cycles are usually pretty light so hard for me to weigh in on this issue.My first thing for Civsgirl would be to wait for three months on the DHEA before using up limited financial resources if it is not too late.  As anxious as we all are to get results most of the information I have seen  states that three months is the earliest that the researchers have started stimulations.  In November I went for repeat ultrasound for antral follicle count and we were maybe going to commence stimulation late December for Jan retrieval, assuming I responded to DHEA (which I did).  This would have actually put me on DHEA for four months.My personal plan was to try one stimulation without retrieval and see how I responded and we were talking with RE about this when I got my good news.  A part of me wonders if repeat stimulation on DHEA is a part of it's success.  In Casson's article I think one person was stimulated twice and had success after the second round.  Also the woman who started all of this did how many cycles and found with each stimulation more eggs produced.   My RE was going to check with Casson but again all sort of stopped because of my pregnancy.I am curious about dg223.  My testosterone went high on DHEA but as long as I was asymptomatic and could control symptoms, my RE wanted me to go ahead.  I need to find out how high the level was and when he was going to get worried.  I think that would be issue to worry about as far as taking DHEA.  I agree with the other endocrine work-up to see if the labs are coming from higher on the endocrine chain.Unfortunately or fortunately for me I was able to get pregnant spontaneously before we did a whole recheck of lab work.  So all I have from my personal story is the testosterone level and repeat ultrasound.Has anyone heard from Angela??  I hope the stimulation is going well!!Good luck to everyone else as well!P",
            "post_id": "3115485",
            "timestamp": "1215124949",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Wow, you are such an inspiration.     I am 41 and going to do an IVF in Sept/Oct and will be 42 then.   I started accupuncture and herbs in June and of course all of the lifestyle changes and am taking two ounces a day of wheatgrass daily.    If you don't mind I have a question or two regarding DHEA.    Can it be harmful or detrimental to a cycle?      I have one ovary and my day 3 FSH is 11.5, and E2 of 30 had two cancelled cycles a few years ago due to poor response and follicles not getting big enough.      I'm assuming I would have to tell my RE that I had been taking DHEA so they could surpress early ovulation?Thank you again for being willing to share your knowledge with others.There is no doubt your reward is due.betsyj",
            "post_id": "3116291",
            "timestamp": "1215139332",
            "user_id": "user_552740",
            "user_link": "/personal_pages/user/552740",
            "votes": "0"
        },
        {
            "answer": "Wow!!! I cannot express how hapy I feel to have found this forum. I have been trying for years. Here is my story.I am now 38 yo. I got pregnant naturally at age 34 but miscarried at week 8 (no heartbeat). A lttle less than a year later I got pregnant on my own again, but the baby (a girl) was diagnosed with a hyplastic right heart (a very rare but serious heart condition that is almost impossible to live with) at week 22 and after much difficult consideration we decided to termiante the pregnancy. A year later i tested with high FSH (9.8) and went for IVF with Gleisher (17 eggs, 7 mature, the 3 that survived transfered on day 3) that tment resulted in a preganncy that was not viable and miscarried on week 6. After that I have undergone 2 more IVF's and a frozen embryo cycle. I generally respond very well to the stimulation ( last cycle I had 19 eggs, 13 fertilized, and after PGD 8 were good, but still no pregnancy) and the Drs. cant explain why I cannot get pregnant. I decided to take a break and do some acupuncture + herbs and maybe let nature take its course. After my last lab test my acupncturist (who is also an MD) prescribed me 50mg of DHEA in the morning These are my results from day 3 June 08:TSH 3rd generation 0.91T4 free  1.2FSH 4.4Estradiol <32DHEA Sulfate 134I am worried that the dose might be low or that if I do get pregant I might hurt the pregnancy with the DHEA, What are your thoughts? So far I have been taking it for a week, I do not feel any side effects.What do you think of my DHEA level?Any guidance is well taken, I would reall love your input..ChupsPS: What is so special about the DHEA from Belmar pharmacy?",
            "post_id": "3118300",
            "timestamp": "1215199576",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hey Ladies, I will start stimming sometime this week and will let you know about my follicle count.Question for Puglies and Antitasto.  Did DHEA increase your antral follicle count as well or only follies produced during stims?  For the past two IVF's, I got as many follies as antral.  I assume that is the way it normally is, whether or not DHEA was taken?Anyway, hope you all had a good 4th of July.I had to work on the 4th because here in Germany it is not a holiday, and of course, it made me kind of sad and I missed my parents and brother...then AF came that night.  The protocol from the clinic I go to usually starts stimming on Day 4 or 5, then start with Follistim (trivia - it is called Puregon over here.  Wonder why Organon bothers giving it a different name for Germans)Talk to you soon!Angela",
            "post_id": "3123526",
            "timestamp": "1215367541",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Angela,Hello and hope you aren't too homesick, you have a big month ahead of you;)   Please do update on your follies.Betsy",
            "post_id": "3124411",
            "timestamp": "1215386879",
            "user_id": "user_552740",
            "user_link": "/personal_pages/user/552740",
            "votes": "0"
        },
        {
            "answer": "I did have a significant increase in antral follicle count.  But never made it to a stimulation because of the spontaneous pregnancy.Did you antral count go up??  Good luck!  Keep fingers crossed for you.Where in Germany are you?P",
            "post_id": "3124599",
            "timestamp": "1215390943",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "I've read this thread quite a few times.. and thought I would finally chime in.  I have pretty high FSH and my one inject cycle yielded exactly 2 mature follicles (which I know from previous scans I can make 2 on my own).  So.. i started on DHEA, bought at at an Organic food store.  I started with 25 mg, then upped the dose to 50 mg, then to 75 mg. over the course of 2 1/2 months.  ( Please keep in mind: I have NO idea if I had a high or low level of natural DHEA in my system. I did NOT tell my RE I was taking this.  I just wanted to try and produce as many follicles as possible for my IVF cycle)  I was told by my RE I would probably have 4 mature follicles with maybe half of those fertilizing.  I stopped my DHEA about 8-9 days into stims.  I had to stim longer than most people, b/c my E2 levels were sooooooo slow to rise, but at the end I had 11 eggs/all 11 were mature and 9 fertilized.  I transferred 3 perfect 8 cell embies on a 3DT.  My first and second betas have been positive and doubling so far (low beta numbers so I am really crossing my fingers here).  But I did make all those eggs and the fert. percentage was awesome!",
            "post_id": "3124627",
            "timestamp": "1215391528",
            "user_id": "user_458090",
            "user_link": "/personal_pages/user/458090",
            "votes": "0"
        },
        {
            "answer": "Ladies -- so many of you are great inspriations!Anitasto, I have read and re-read this string so many times and referenced others to it; you are a wealth of information!!!Sasparilla, we sound like we're following the same path (and oh how I hope I'm shortly behind you with a postive beta).  I've been lurking here for almost 2 months, also started self-dosing 25 then 50 then 75 and finally up to 100 mg a day (started taking while waiting for blood test results from OB-GYN, RE doesn't know I'm taking DHEA; once I found my levels were low I started increasing every week until my current levels).  Guess I've been pretty lucky with only oily skin reminiscent of my teen years!I've been on DHEA now for 7 weeks and AF came again today (cycles even before DHEA have consistently been 23 days, so no chang there).  After being on DHEA for 3 weeks I had a CD3 FSH test and had my highest reading ever at 15 - pretty depressing, but I'm hoping that I just hadn't been on the DHEA long enough to make much difference.  Also, I have upped the dose since.  We've had 2 prior IVF failures (second actually got a clinical pg for a couple of days off a really bad quality egg and emby) and are ready to move forward.  We have been planning on doing an IVF cycle this month but I am starting to second guess whether we should after re-reading all the posts that I should be on the DHEA as long as possible (well, 3 months) before cycling.  All of these decisions are tough when going through this with failures behind.  *sigh* if anyone finds that crystal ball that works, pass it on!Anyhow, I just wanted to chime in and say thanks to all those that have posted and provided such great inspiration.  Thanks especially to Anitasto!Lynne",
            "post_id": "3124810",
            "timestamp": "1215395091",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "I forgot one! Please add your LH to the list on day 3 this week. Sorry ‘bout that. The LH/FSH ratio is important to rule out PCOS tendency which I’m not as familiar with but understand it calls for some different approaches in IVF.That’s soooo great that your SIS is a DOC! That’s just the support you – and ideally all of us – really need!So glad you’re getting these tests and looking forward to seeing your #’s. I think I’m going to learn a lot from your situation…have read up on how clomid works and am really glad you mentioned it.My knowledge of endocrinology is as good as google, the books, and how much time I can devote to devouring such a wonderfully complex system. My background is physics and information modeling for software…..so I just love this complex research stuff.You’re most welcome for the input. Its always a pleasure if I can have any positive effect in helping others make their little dreams come true.Until then – Anitasto",
            "post_id": "3124855",
            "timestamp": "1215395694",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thanks for weighing in and giving your blessing to the approach for Dg233.  Sorry about the BIG situation…my heart always melts for the physical toll I see women undertake at the end game.How did I get interested in DHEA? Well….abridged version….a series of events drove me to find out why I wasn’t having my own kids and solve it or at least have peace in understanding it which would allow me to move on without regrets. I’ll spare you all the details. ;)Where is Casson at? I understood him to have left Oregon but couldn’t find him during my research when I had questions.3 months is a good period of time agreed. But I will note here that my best results came in just one month’s time when I upped my dose. Also, there are a couple studies out on Testosterone patch in which women go from an average of 2 eggs to 8 eggs in a cycle and 26%  success in the group. That led me to conclude that it wasn’t necessarily a time factor as a dosing factor and I still think that. However, for the very best situation, eggs do take 3 months from their very initial selection to ovulation so its reasonable to assume it’s a good thing and this time factor would be more likely to contribute to the improved chromosomes.Hope you had a great 4th weekend!Anitasto",
            "post_id": "3124863",
            "timestamp": "1215395748",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Q: Can DHEAQ be harmful or detrimental to a cycle?A: Yes – Great question and glad you asked. And this is most important. In lab rats high doses of DHEA have converted all normal females to PCOS females. In my last 2 months of DHEA I took A LOT of DHEA and, sure enough, my LH went high and ruined the last cycle which only resulted in 2 eggs, neither of which survived the thaw. I don’t want to write a book here but just to say….keep track of your Testosterone and LH, start at the 75 mg in the morning and increase gradually not more than 25mg more/2 weeks until you see what it does. 25mg can make a big difference. If you can get your T between 80 to 120 for a month before your cycle then you’ll rock.Q: I'm assuming I would have to tell my RE that I had been taking DHEA so they could supress early ovulation?A: Short answer – Yes. Make sure he’s doing LH tests along with the E2 from the beginning. And just so you can evaluate for yourself…an LH greater than 1.0 is enough to cancel a cycle. The ideal upper limit before HCG is 0.7 There are studies on or related to this by Fleming, 2000; Coppola, 2003, Ferrari, 2004.I think my reward is due too and hope like heck it works. But even if it doesn’t, this opportunity to help others is truly a reward in itself.Best of IVFing to you!-Anitasto",
            "post_id": "3124867",
            "timestamp": "1215395786",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi all,Good luck with all your cycles. Again it is really great and inspiring to have found you guys..I have another question, after rereading some of the posts I think that my levels of DHEA- Sulfate + 134  is probably high as it is. My Acupuncture/MD said I should take it to elevate my Estrogen levels, which are within normal range but on the lower end (estradiol <32). Can you guys explain again the relationship between the Estrogen leves and DHEA levels?.Again best to you all...Chups",
            "post_id": "3125125",
            "timestamp": "1215401644",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "I've been thinking about you and reading and re-reading your post. At first I was jumping to complicated reasons for miscarriage when it hit me.Your numbers demonstrate a perfect baby making machine and you have gotten pregnant on your own three times in what...4 months?......why do you have an RE who's suggesting IVF? And the fact you didn't get pregnant even with your cycle makes me wonder if your stress level got high because of IVF (stressful stuff!)Gosh...if I could give you a hug I would.If I were in your shoes I would1. take baby aspirin - some studies believe it increases conception and reduces miscarriage by up to 50%.2. get your progesterone checked shortly after ovulation. If its low, throw on the supplements. Even if they're mid-level it won't hurt.3. get a couple of tests for blood clotting which causes recurrent early and sometimes late term miscarriage. The treatment for these is heparin.4. take no more than 25mg dhea if you feel srongly about it...it won't hurt but taking more in your case, especially if you do have blood clotting issue would not be so good.5. start accupuncture for fertility weekly. its fantastic for reducing stress AND making sure your blood flows to nourish fertility. But I think it really helped me being older and so anxious to get our kiddos.6. read this thread on heparin treatment for recurrent miscarriage. Blood clotting is a common cause of recurrent miscarriage and there are several different reasons for having blood that really likes to clot. Do you get clots commonly in your period???http://www.pregnancy-info.net/QA/answers-Using_Heparin_during_pregnancy_/7. I would definitely get tested for autoimmune antibodies. I'm not so much an expert on this but...I am getting tested for Antiphospholipid Antibody Syndrome (APS) which causes blood clots due to unusual antibodies that interact with proteins. My dad has blood clots as well as an uncle and they've been on Cumadin for over a decade. Studies indicate it runs in families though they haven't nailed down the gene.Note - I have a girlfriend who had 4 consecutive early miscarriages before starting aspirin and succeeding.Would love to hear how things develop for you....and I really hope you can be successful the good old fashioned way. It seems like you have great potential for it!Sincerely,Anita",
            "post_id": "3125457",
            "timestamp": "1215410623",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "OMG! I just read your post and cracked up laughing! I LOVE IT! Your RE must have been floored! Did you ever tell him?BTW – my E2 climbed really slow too and it was a 14 day cycle where we got 10 eggs. You’re the first I’ve heard with this so its put my mind to rest on the issue.Thanks soo much for sharing!Congradulations!Anitasto",
            "post_id": "3125678",
            "timestamp": "1215425140",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "AngelaSK07I went back to make sure I hadn’t missed any posts and realized you didn’t get response to all of your questions about what happens during stims. So I just made a list of your questions from your different posts and summarized below. Hope this helps!Q: Did you notice your menstrual period changed?A: Yes – shorter cycle and lighter periodQ: Did any of you that used DHEA have normal FSH levels but low antral follicle count?A: My FSH was 10 – 11 and antral follicle count at beginning was 2. Doh.Q: Did DHEA improve AFC even though your FSH levels were already in the ok range?A: December cycle had AFC of 11 and retrieved 10 eggs. Q: Did DHEA increase your antral follicle count as well or only follies produced during stims?A:  In December started with AFC of 11, saw as many as 16 follies and retrieved 10 eggs after 14 days of stims. 5 were mature and fertilized normally.Q: For the past two IVF's, I got as many follies as antral.  I assume that is the way it normally is, whether or not DHEA was taken?A: I think the # of antral follies you see when you start is the minimum you should get at the end.While I was on DHEA I determined not to start a cycle until I could see 10 antral follicles to be sure I’d have good outcome and not waste precious resources. More follicles appeared..up to 16 follicles during stim if I trust the scan…but my E2 climbed slow and all were I think 15 – 22mm at HCG. We got 10.From the sounds of it so far I bet you’ll have great results. Can hardly wait to hear!Did you see Sasparilla's post?Anitasto",
            "post_id": "3125680",
            "timestamp": "1215425192",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "As exciting as a positive pregnancy test is the pain of losing a pregnancy is surely twice as disappointing. Sooo sorry for your losses. Doing PGD is so great ….it helped us to know we could make great embryos and truly minimize risks later. But, like you, we didn’t get pregnant with them. My heart really goes out to you. What a roller coaster you’ve been on.I don’t really think DHEA is the crux of your problem but it wouldn't hurt to test your Testosterone level. DHEA-SO4 of 181 is in normal range but there is room for it to go up. If you do start it, I would keep it to 25mg. Your baselines are so good and your FSH already so low that more than this could create other problems for you.How thick was your lining before transfer?How many transfers have you done?There’s another post here .. a woman who was miscarrying…HQ2007. check out the response to her post.At the end of the day I want the baby and the fastest way to her or him. So when my PGD quality embies didn’t work in me I felt a surrogate could short circuit a potentially long path figuring out that part of it and I couldn’t spend the time.Ironically, the attorney who educated me about surrogacy had a similar story. She did IVF over and over, got pregnant and miscarried. After 3 of those she worked with a surrogate and has twins from first try.I’m not trying to advocate here…just offer a potential option for a really challenging situation. In the meantime….I’d check the bloodclotting issues, low low dose DHEA, and if you get a positive test for one of those issues heparin’s the next step. As you’ll see in HQ’s response, there’s some good possibilities for miscarriage issues.I’ll be thinking of you and truly hope your next try is end of your rainbow…gold and all. Oh – dhea from a pharmacy is generally a compounding pharmacy so efficacy is more consistent and reliable.-Anita",
            "post_id": "3125736",
            "timestamp": "1215427848",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "If I may…I’m a little concerned to hear you went on dhea and got a HIGHER FSH.What was your baseline FSH before? Can you get a new test this cycle on day 3 since you’ve been on it for 7 weeks now? If you can it would be a really good idea I think just to be sure things are headed in the right direction.I had initial hiccups with DHEA and wasted 6 months before I started testing closely and working around the hiccups as soon as I could see them in the blood work. And there were several along the way.If you can get a new FSH to see if it’s dropped I’d also suggest an LH, Testosterone, Free Testosterone, DHEAS04, and E2 of course. At least then you can rest assured your cycle should reap rewards. And if things are funny you can maybe work it out before your cycle.Hope we hear from you.Anitasto",
            "post_id": "3125758",
            "timestamp": "1215428682",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Q: My DHEAS is already high at 134.R: You may be confusing Testosterone and DHEAS values. 134 is a mid to low range for DHEAS but if it were Testosterone that would be high. So I think you can handle some DHEA.Q:Can you guys explain again the relationship between the Estrogen leves and DHEA levels?R: Based on my understanding and my own experience measuring available serum interim hormones in the chain....As your DHEA increases and flows through the hormone chain (which I'll spare you) at the end it increases FSH receptors in the follicles (based on study last year in Chile) and by a negative feedback less FSH is required for ovulation. With FSH reduced your baseline E2 is reduced also...though other hormones effect E2 this is the most relevant I think for DHEA. That's one reason I think a low dose of DHEA is good to start with when your baseline E2 is already pretty good. But your DHEAS will go up to a healthy level I think before it effects baseline E2I know...long answer. I gotta work on that. :)Hope this helps.Cheers,Anita",
            "post_id": "3125783",
            "timestamp": "1215429758",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thank you so very much for your answer!!!! I cannot tel you how I wish my Dr would interact with me the way you do with us... Your knowledge is amazing, so especific and detailed!! WOW!So far I have had 4 transfer (3 fresh cycles and 1 frozen, I still have two frozen embryos). As far as I know my lining has been fine, \"beautiful\" to use Drs. words! ( i believe that it was 14 mm thick or maybe 7, cant remember...) 1 of the transfers was a bioquemichal pregnancy and the other resulted in a miscarriage at week 6. But again, i dont think my dr. was concerned about that because he thought my problem was that my eggs were not good.In any case my acupuncturist/MD also had me test for the antiphospholipid AB panel and the results were low positive titers... (especifically the Cardiolipin was out of range , slightly elevated...) He explained that it meant that my blood was thicker and that it could be related to miscarriages, for this he recomended the baby aspirin which I have been taking...Anyway thanks again for your support.Good luck to all potential moms..Chups",
            "post_id": "3126243",
            "timestamp": "1215440823",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "BTW< Love your long answers!!!chups",
            "post_id": "3126255",
            "timestamp": "1215440927",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Anitasto -- thanks for the input!I was surprised my FSH went up after being on the DHEA but it had been 9 months since I had FSH last tested so don't know what my current baseline really is.  (My last FSH tests were almost every month for a year so I had a pretty good history - during that time it ranged 4.8 to 13.6 - so I was surprised to see the 15.0, but figure a year and aging will do it's thing, regardless of the DHEA.)  I am going in for bloodwork tomorrow though so will see if the extra month has made any difference.When I first had my DHEA levels tested I did also have DHEA-S tested and insulin (I didn't know any better at the time to ask my OB-GYN for testosterone and don't know that she knew any different and tossed in insulin for 'just because').  DHEA was 46, DHEA-S was 1.7.  When I did finally have testosterone tested I had been on DHEA 25 days and it measured 44 ng/dL.  From those results alone (DHEA and testosterone) it seemed logical that I should continue taking DHEA and in fact after the testosterone results increased my dose to 100 mg.You did answer one thing that definitely puzzled me - FSH should go down on DHEA (mine didn't and I need to find out why or at least if it is now).  Another question I have is the correlation between DHEA and DHEA-S.  My OB-GYN told me that DHEA-S should be <10 but from other posts it sounds like people are scoring much higher.  Now I'm wondering what was measured for me (perhaps on a different scale?).  Any ideas?A few last questions (for now at least!) -- I had a DHEA blood test which took a week to get the results from - is that normal?  Is the DHEA saliva test as reliable as the blood test?  Is the saliva test is as reliable, is it any quicker to get results than the blood test?Thanks for your interest in researching this all and your willingness to share it!!!!",
            "post_id": "3127547",
            "timestamp": "1215458845",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Curious - has your doctor done a CBC to see just how thick your blood is on aspirin?I'm wondering if its possible to check this with your red blood cell count and see if aspirin is in fact thinning it appropriately. I express concern here because DHEA will thicken your blood further. And while I think its a reasonable step for you, it also would make me want to track the RBC to ensure its ideal or in the low range and stays there and if not you can determine you should introduce heparin.Make sense?And glad you like my long answers. I'll have to tell DH that. heheAnitasto",
            "post_id": "3127573",
            "timestamp": "1215459097",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hey - sounds like you're making progress...and definitely have some ideas for you.This is what I think I'm understanding so far from your posts.....need some helpbaselineDHEA            46  (ng/dL?)DHEA-S         1.7  (ug/dL?)FSH              13.6 at same time as this DHEA & DHEA-S?then after 3+ weeks on 75 mg of DHEA andTestosterone   44 ng/dLFSH               15Tomorrow is great! If you can get the following plus the previous records we really should be able to put this puzzle together.If you can get a newFSH to see if it’s dropped I’d also suggest anLH,Testosterone,Free Testosterone,DHEADHEA-S04,E2and if its not too much to ask....since you'll already be there...could you add on these?ACTHCortisolSHBGIGF-1At least initially I'm guessing your T is increasing because with the baseline DHEA and DHEA-S above (if units are right) your T would be quite lower than 44ng/dL in my experience AND if it were taken at the same time and there is nothing else going on besides typical poor responder stuff like most of us here.(necessary disclosures eh?)But I throw in these other tests in for the sake of time, because I'm not clear on past records and .... most of all... if your baseline DHEA and DHEA-S were in those units they are awfully low. HOWEVER - almost all labs have different reference ranges (though I've never heard of <10 in any unit or lab as normal - but first time for everything). SO you really need the full report so you can also see the units and reference range.And let me just confirm - you've never been pregnant right? I didn't see it in your post but just want to make sure I'm not missing a big zinger in here.Hope we hear back! :)Cheers,Anitasto",
            "post_id": "3128246",
            "timestamp": "1215469954",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "OK Gals - I got this email back from CHR and it contradicts what I've said earlier. I emailed them the question back in February to see if I should go off DHEA but in their response didn't address the question and my RE said to go off of it. But since I'm on here so much the question was really nagging me.so sent this email to tweidner thechr.com on July 1____________________________Please tell me...As a general rule, do you take women off of DHEA before you transfer the embryos?Thank you so much for your input.Sincerely,AnitaI got this response July 2nd and have been pondering since._______________________Dear Anita,Thank you for contacting the Center For Human Reproduction. You posted the following message to us – As a general rule, do you take women off of DHEA before you transfer the embryos?No we don’t. If you have further questions, please call our New York office at +1 212.994.4400 to arrange a phone consultation with one of our physicians.Best Regards,The Center for Human Reproduction____________________________So after all this pondering....here's my thoughts... If we're on a low dose and T is in reasonable range...ok stay on. If we're on a wicked high dose and T is way outside normal range....cut back to get in the normal range. I'd be shocked of those guys up their patient doses like I was on so the answer makes sense they'd stay on. But I sure wish I had this answer in February...I wet cold turkey for a month B4 Xfer. Jeezo. Live and learn.What do you gals think?Anitasto(I really should get a job - but can't hardly help myself - I love this stuff - and you gals are way better than office co-workers)  :)",
            "post_id": "3128330",
            "timestamp": "1215471420",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thanks again Anitasto!!!I will defenitely follow up on your suggestions. I am a bit clueless with some of the stuff..What are CBC and RBC? Is there a time in the month that is best for doing this?Anyway i will speak to my accupuncturist/MD...Cheers to you all!chups",
            "post_id": "3128878",
            "timestamp": "1215482479",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "CBC is Complete Blood Count and measures several different elementsRBC is Red Blood CellsThe CBC is a panel of tests which includes RBC count among several others.There is no timing requirements for CBC.Look forward to your update!Best,Anitasto",
            "post_id": "3129339",
            "timestamp": "1215490551",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Well, after 3 months on DHEA I am not sure if I see a difference but my antral count is 8 this time.  I began stimming yesterday.  My next ultrasound will be on Monday, July 14 and will let you ladies know how it turns out.Angela",
            "post_id": "3133480",
            "timestamp": "1215575884",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Oh, and one more thing I noticed.  Out of all the lab values my clinic does before stimming, the one that really seems different this time is E2.IVF #1 E2 started out as 0,10 pg/mlIVF#2 E2 was 9,30 pg/mlThis time E2 is 97,88 pg/mlThink it is because of the 3 months of DHEA?Anyway, it is too early to say whether the extra antral follicle is because of DHEA.  Maybe I had it all along and the docs did not notice.Gotta take my follistim now. Talk to you gals later!Angela",
            "post_id": "3133537",
            "timestamp": "1215576988",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "How exciting!My highest E2 at baseline when I started stims was 42pg/ml.I found the DHEA made my ovaries super active so we focused alot on downregulating in luteal with E2 patch and making sure they were all 6mm or smaller to avoid a leader folly.8 follies is great! How many did you have before?Happy cycling! :)Anitasto",
            "post_id": "3133744",
            "timestamp": "1215583208",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Just wanted to wish you luck!!!crossing my fingers!!chups",
            "post_id": "3135263",
            "timestamp": "1215621121",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hello! And thanks again for your detail reply and kind words. I am really glad i found this forum.I received my Belmar 25mg DHEA and started on it today. But, I was on 25mg DHEA from Natrol (got from healthfood store) for a week now. I will not be increasing the doses anytime soon.  So far so good. I have not noticed any side effects yet.I was on aspirin during my IVF cycle. I generally felt better, so I continuted to take baby aspirin. Also read the same information about clotting and taking aspirin. So aspirin is on!When I started TTC, I went to OBGYN. She did diagnose prgoesterone deficiency and put me on progesterone gel and referred me to a RE. This was July 2007. When I went to see the RE, I was PG, but didn't know. So he asked me to get off Progesterone to do the fertility workup. Anyway, I have number from various blood work, here it is if you are curious :)  Neither my first RE or current RE have done any tests for blood clotting or DHEA or auto-imune antibodies :-/Progesterone levelMay-08       CD3         0.2Dec-07       CD36        6.92 (I was PG but m/c)Dec-07       CD38        3.2 (I was PG)Nov-07        CD10        0.15(I actually keep a spreadsheet of all the values from tests that were done :))I have started acupuncture around March-08 and I am still doing it. It does provide stress relief and I am very relaxed afterwards.I  do get clotting during period on my heavy day(s). Hmmm...I have not had any clotting tests. I am reading on Heparin as you mentioned...On the blood tests:I am having difficulty getting my PCP order the blood tests. She is willing to do it, but she wants my RE to write the list of tests so she can copy it and give me the order. She apparently not sure about the specific codes of various tests I asked for. My RE's office gave me ICD-9 codes for some of the tests, but not all. Do you have any advise on how to get my tests? Should I change my doctor? Is there another way I can find out the correct ICD-9 codes for my PCP? I have no fertility coverage. So if RE writes the order, my insurance won't cover the blood tests.Maybe I will ask DG233, her SIS is a doc and just wrote the blood test order for her. I just need the correct codes to give to my PCP.ICD-9 code         Test000455              Thyroid panel: T4, T3, T4302634              Thyroid panel: TSH, FreeT4, TPO004697              DHEA-Sulfate004515              Estradiol (E2)I will post with updates once I figure out how to get my blood tests done!THANKS AGAIN!HQ",
            "post_id": "3135299",
            "timestamp": "1215621539",
            "user_id": "user_551909",
            "user_link": "/personal_pages/user/551909",
            "votes": "0"
        },
        {
            "answer": "Hi! Had a quick question. Did you discontinue DHEA after you got pregnant? How soon after? If you were taking aspirin also, did you continue that?Thanks so much!HQ",
            "post_id": "3135634",
            "timestamp": "1215626276",
            "user_id": "user_551909",
            "user_link": "/personal_pages/user/551909",
            "votes": "0"
        },
        {
            "answer": "Great updates.Here's what my lab (LabCorp) has for reference rangesFollicular (B4 u ovulate)   0.2 - 1.4 ng/mLLuteal                            3.3 - 25.6 ng/mLIf these are relevant to your numbers...3.2 PG and 6.92 PG it seems pretty low.  I know when I'm in an IVF cycle they test my PG level and want to see it over 20. Seems your PCP was on. You must have been a little POd at the RE...?DHEA and Progesterone after you ovulate seem like a good thing.As for getting blood tests....when I realized I was on my own I basically called around to REs in the area and phone interviewed them saying I needed someone who could be flexible and support blood tests that I want to do from my research because I just wanted confidence that I hadn't left anything unchecked and we had limited resources and failed 3x. I definitely got sympathy and that's how I found my RE. I was also lucky to start as my PCP was about 44 and had tried and failed IVF in the past years and was getting into the anti-aging business. So she was only too happy to be supportive. But when it got comlicated she preferred I use my RE.I started using LOTS of smiles and treats for nurses despite bad news and never showed frustration toward them. Maybe its basic stuff....but when I started I was frustrated and it was hard to hide. The honey sure helped.Hang in there HQ! I just bet you'll be prego in no time. ;)Anitasto",
            "post_id": "3136214",
            "timestamp": "1215634764",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Antitasto, Puglies, and Chups, thanks for the support.Anti, my AFC before was 6 the first IVF, 6.5 the 2nd IVF.  I say 6.5 because the doc said she saw a 7th follicle but it was small.  Now it appears I have 8 antral follicles.I read Gleicher's Study again and it seems his patients had higher E2 after 4 months of DHEA.  I had only 3 months of DHEA, so I am going out on a limb here and guessing that my rise in baseline E2 this time around is due to the DHEA, so it must not be a bad thing.Anybody want me to email them Gleicher's study?Anyhow, stim day #3.  After today I go down to 225 IU per day of Follistim.Baby Dust to you all,Angela",
            "post_id": "3137922",
            "timestamp": "1215663361",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Hi! I had my labs done that you recommended and wanted to run them by you.These were done on day 4 of my current cycle (was away for the holiday wknd so couldn't do earlier). My lab is also labcorp.fsh 9.2lh 6.5androstenedione 93 ng/dl (range 47-268)VEGF, serum  168 pg/ml  (range 62-707)IGF-1  122 ng/ml (range 115-307)DHEA-S  53 ug/dl  (range 45-270)estradiol 68serum testosterone 48 ng/dl (range 14-76)TSH 1.12 (range .35-5.5)T4 7.9 (range 4.5- 12)T3 92  (range 85- 205)DHEA 449 ng/dlACTH,plasma  13 pg/ml (range 6-48)prolactin 7.5estrone 57 pg/ml (range 37-138)SHBG 60 nmol/L (range 18-114)cortisol,pm 7.6 ug/dl (range 3.1- 16.7)So it seems all is normal. Interesting that my testosterone and dhea-s levels went down. (Last month they were 76/78 on day 21). I'm not sure if the testosterone was elevated from the stims I did last month. Do you see anything that would need more work-up? Should I start dhea? Would you recommend 25/d and recheck levels next month? Again, I really appreciate your feedback and insight. Thanks!",
            "post_id": "3139610",
            "timestamp": "1215706073",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Well, I'm on day 3 of stimming (Angela SK07- sounds like we're on the same cycle timing!) and day 47 of DHEA (started at 25mg and worked my way up to 100mg per day).My CD3 b/w came back with a lower FSH (yeah!) at 5.7 and higher E2 at 115.  These are consistent numbers with what I've had pre-DHEA (though when I'd had FSH that low and E2 that high I always had left over /unruptured follies from the prior cycle).  Interestingly the nurse commented that the high E2 is an indication that FSH is artificially masked lower than what it should really be (and since they tested me last CD3 with FSH of 15.0 they know current history).  Note - RE does not know I'm taking DHEA.  Regardless the cause (and I'm cautiously thanking DHEA), I'm happy to see lower FSH since (purely anecdotally) it seems women with 'normally' high FSH tend to have better IVF cycle success when their FSH is lower during their cycle month.Also good - my CD3 u/s showed a 'conservative' 8+5 follies less than 10mm with no evident dominant follie and no left-overs (RE said there may be more than 5 on the left ovary but was counting conservatively).  These counts are on the higher side for me (best I've had before with no prior cycle left-overs was a total of 8 follies).So I go back Friday to see the results of stims. I've been on Estrace since mid-last-cycle and now am on 450 iu follistim, 15cc low-dose HCG, plus baby aspirin.  The stim dose is on the high side (but 'normal' for me based on prior cycles; always do better with higher doses).Anitasto -- I really appreciate your input and suggestions on tests I should get.  Unfortunately, since my RE doesn't know about the DHEA I don't feel at liberty to ask for extensive testing, so have had DHEA support testing done at my OB-GYN (they will do the testing but also important, insurance covers with them and not the RE).  Unfortunately I wasn't able to get in to get the tests on CD3 so am ’flying blind’ taking the DHEA for this cycle at least.  As for FSH levels on DHEA -- I probably wasn't clear, the 13.6 FSH I had tested was almost 1 year ago (so I don‘t really have a current baseline FSH prior to starting DHEA).  My recent cycle info is:6/16/08 CD3: FSH=15.0, E2=35, LH=3.3, PG=0.6 (DHEA for 23 days 25mg worked to 75mg)7/08/08 CD3: FSH=5.19, E2=115, LH=1.7, PG=0.4 (DHEA for 45 days; 100mg since 6/17/08)So a question for anyone:  The low-dose HCG is a new med for me this cycle, what is the purpose?Thanks all for your input and support!!!",
            "post_id": "3139743",
            "timestamp": "1215708111",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Hi Garden4Lynne,Yay!  We are cycle buddies!  Today was also my day 3, but I have been on DHEA for 3 months.  My E2 is quite a bit higher this time around.  It must be because of the DHEA.I think if the nurse knew you were taking the DHEA, he/she would not talk about E2 masking FSH.Never heard of low dose HCG.Luck you with the follies!  13 is a lot!Angela",
            "post_id": "3139806",
            "timestamp": "1215709061",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Thanks Angela!Here's hoping we both have great cycles!I re-read your last note about the high E2 -- I hadn't caught that when I read before so was just chaulking up my high E2 to other factors.  Would you mind sending me the study you mentioned, sounds like interesting reading!  (I don't know if you can attach anything through medhelp... if not, my personal email is (my medhelp nickname) @yahoo.  Thanks!",
            "post_id": "3140024",
            "timestamp": "1215711824",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Great!  Your FSH and Testosterone are much more in alignment and other levels in the chain are normal but low normal with SHGB in upper midrange. Your labs are almost identical to mine....classic poor responder. If it were me in your shoes, I would go forth on 75mg/day of the DHEA, test on CD3: T, DHEA-S, E2, FSH and CD21: T and DHEA-S. Once you're sure its going up then you'll want to avoid platea. If you plateau with T less than 80 then add another 25mg every 2 weeks until you're sitting in the 80 - 120 range.If you're trying to get PG naturally I'd choose the 80 end and if IVF I'd choose the 120 end of that range and then reduce a bit after the cycle.As for previous higher T reading, there are many things that can raise and lower your T. I'd just get T and DHEA-S checked as above and make sure things progress as expected.  If you want to do more tests.... I also tracked....SHBG went down and IGF-1 went up...but within normal or close to normal limits. My DHEA-S was 1854 after 3 mos at 100mg DHEA/day. That was when we really started to see more follies.BTW - have you ever had a successful pregnancy? While miscarriages are common, I only had one m/c before I learned about the antibody syndrome issues....which cause m/c. I'll do a separate post on that for everyone in a few days once I can reach the expert. I'm just learning about it and wish I'd known before my failed cycles as there are things we can do.I'm excited for you and glad things are all where they are!Look forward to hearing your progress! :)Anitasto",
            "post_id": "3140338",
            "timestamp": "1215716085",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Sounding great!  On dhea my FSH went from 10.1 to 3.9 in one month. SO I'd say you're on the $$ thinking its the DHEA. But with your E2 that high I also would be concerned about a leftover unruptured follies though glad to hear they're all under 10.In any case....allow me to add a tale of history for you here....You see, on DHEA your ovaries become very very active and they produce large follicles like jelly beans once your T is high. So downregulating and ensuring there are no large follies before you stim is really important.  I ultimately required 2 Estrogen patches daily to keep them quiet for 2 weeks before stimming.Sounds like you're doing really great and I'm really excited for you!Anitasto",
            "post_id": "3140394",
            "timestamp": "1215716909",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Garden, sent you the Gleicher and Barad study.  A bit technical but interesting.Angela",
            "post_id": "3140463",
            "timestamp": "1215718116",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Never heard of low dose hcg during the cycle....but I got curious and did some reading..HCG and LH are biochemically almost identical and they're using HCG in place of LH because it lasts longer in the system and, when you're not pregnant, acts and effects exactly like LH.  There are studies that show small amounts of LH given during the cycle improve the outcomes.I didn't have this in my cycle but, reading more on it, I would ask for it if I were to cycle again. Sounds like your doc is up on his stuff. ;)fun fact - you can use an ovulation predictor test to also test pregnancy because it picks up the HCG as if it were LH. Tradeoff is OPK are lots cheaper just slightly less sensitive.Here's really good reading on HCG for LH in IVFhttp://doctor.medscape.com/viewarticle/532831Hope your garden is growing! ;)Cheers,Anitasto",
            "post_id": "3141107",
            "timestamp": "1215726828",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Dear Angela,I too would love to have a copy of Dr. Gleisher's study.  here is my email:***@****.Thanks and good luck once again.chups",
            "post_id": "3143372",
            "timestamp": "1215782579",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Weird!!! sorry about that... I didn't know that this thing blocked emails, i guess it is a good thing...anyhow its: monchiv @ hotmail . com (all together, obviously!)thanks a lot,best.chups",
            "post_id": "3144677",
            "timestamp": "1215800442",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hi - I hope no one is offended by my jumping on this post, but I have skimmed and read most of the posts with interest.  Here's my story - did Clomid, injectables and one IVF - all failed!  I have an FSH of 3.something and my TSH is, now, 1.75 (will get another check tomorrow). Due to financial concerns, my DH and I decided to pursue a path of natural conception and have been with my new OB since Feb./March cycle!  (NaPro technology, if anyone's interested!)Anyway, this past cycle, he did a complete hormonal profile - I went in for b/w every other day for Estradiol checks and then once ovulation was confirmed, Estradiol and Progesterone.  7DPO, he did a range of tests, one of which was DHEA.I had read various things about the correlation of DHEA and fertility and was doubly curious due to my diagnosis of sub-clinical hypothyroidism. (Knew that they were connected somehow...) However, I was very uncomfortable with self-medicating on this particular hormone and wanted to trust the advice of people caring for me (my OB, chiropractor and my acupuncturist)So, my DHEA came in at 95, to which the doc said 'it's on the low side.'  He wants to see it in the 200's.  He prescribed DHEA (which I get from a Compounding Pharmacy, so they make it there and it's PURE DHEA) at 25 mg once a day.  I will also get this re-tested tmw, so I'll let you know if there has been any change.I was chatting with my acupuncturist about how I have instantly responded to the DHEA (more energy, less depression, lessened fibromyalgia symptoms) and I was telling her about this post and my re-check tmw.  She said to be sure that testosterone was being re-checked because it needs to stay low in order to not affect your uterine lining and thin it out, preventing implantation.  I told her that I had read that some women were taking upwards of 75 mg per day of DHEA and she was IMMEDIATELY concerned.She said that was a very high dosage (per her, 25 is standard for women and 50 is standard for men)....she said that at that dosage, testosterone checks should be happening because DHEA can raise it and counter the very thing that we are trying to accomplish.I just thought that I would share the information as I received it!  Sorry for the long post!Thanks!",
            "post_id": "3144943",
            "timestamp": "1215804791",
            "user_id": "user_216278",
            "user_link": "/personal_pages/user/216278",
            "votes": "0"
        },
        {
            "answer": "Welcome to the party! We all love new input...this is a learning process for everyone.I'm curious, how many eggs you got and how many fertilized in your ivf cycle? Can you share with us? Its amazing that your FSH is 3 something...low... while your DHEA is also low. For me and others in here its typically DHEA Low and FSH mid to high.Your accupuncturist is right that your T should be tracked. My lining was slightly effected on very high dhea and high T. With dhea of 95 pg/ml (if it was tested in the am)...i suspect your dhea-s and testosterone are also very very low and should be checked to be sure. DHEA itself is unstable in your system but DHEA-S is very stable and can be tested any time of day.A great article to see the typical blood values when dhea is added is Casson's study in 2000 with dhea and ivf. You can google for it or if you like I can send it to you if you send your email.Hope you'll let us know how things are going and keep us posted.Happy baby making! :)Anitasto",
            "post_id": "3146554",
            "timestamp": "1215835342",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "It's been awhile, but I believe that we had 16 eggs, 11 fertilized, 4 were frozen and 7 were watched - I had three transferred in, but lost them all; to which I blame my OHSS and uterine lining was probably a wreck!  The cycle, in my opinion, should have been cancelled, but I really don't think about the 'what if's' anymore.I think I misspoke (or mistyped ;) ) It is my DHEA-S that was 95.",
            "post_id": "3147426",
            "timestamp": "1215872696",
            "user_id": "user_216278",
            "user_link": "/personal_pages/user/216278",
            "votes": "0"
        },
        {
            "answer": "I'm curious about wanting4#1's comment on the relationship between DHEA and Thyroid levels... Does anyone know more about this? I too have been diagnosed somewhere along the fertility path with subclinical Hypothiroidism and currently take 60mg of Armour thyroid to control it. Anyone know about this?chups",
            "post_id": "3148277",
            "timestamp": "1215891288",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hi Chups,  I sent you the article via email.  Tomorrow I go in for my ultrasound.  After only 3 months of DHEA, I would be surprised if there were a difference, but of course, I have my fingers crossed anyway.Angela",
            "post_id": "3150736",
            "timestamp": "1215971224",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Thanks for the article, Angela.Much luck tomorrow with the ultrasound... Will be looking forward to hear about how it went...best,chups",
            "post_id": "3150949",
            "timestamp": "1215976029",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Here is what I found on the Internet regarding DHEA and Hypothryoidism:Dehydroepiandrosterone (DHEA) is a steroid produced by the adrenal glands and is the most abundant one found in humans. DHEA may be transformed into testosterone, estrogen or other steroids. It is found in the body as DHEA or in the sulfated form known as DHEA-S. One form is converted into the other as needed.Cortisol and DHEA are among the hormones produced by the adrenal glands. It is possible that these hormones can reduce the immune system dysfunction seen in Hashimoto's thyroiditis. More studies are needed, but taking these medications appropriately carries little (if any) risk and can markedly improve the patient's function and overall health.",
            "post_id": "3151445",
            "timestamp": "1215988157",
            "user_id": "user_216278",
            "user_link": "/personal_pages/user/216278",
            "votes": "0"
        },
        {
            "answer": "Thanks for the low dose HCG education!  I'm glad to hear/read that my RE is up on some current things (though he's the one that said DHEA is 'like any steroid and will have no impact whatsoever'!).So my Friday u/s and b/w were fairly uneventful.  Count droppd from 13 (on CD3) to 9 follies (3 days later) all under 10 mm and E2 was 164.  I was a little surprised by the drop in count and by the low/no growth, but thought about it and realized I was still on Estrace so still suppressing.  We'll see on Monday /tomorrow what happens with the next tests (I'm supposed to start antagon then too apparently).I'm curious whether there is any value in having DHEA, DHEA-S and T retested at this point in my cycle (stim day 8; T last tested almost a month ago and DHEA's 1.5 months ago).  What are your thoughts?As always thanks!!!",
            "post_id": "3152110",
            "timestamp": "1216002913",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Hi,I'm new to this Forum. I went through three times IVF but not sucess. Last time I did the CGH so I found that my egg quality was bad.I mention DHEA to my doctor, but he said he doesn't like DHEA. I haven't got a chance to ask why but he just mention that we 're going to work on the protocol for the next IVF.I heard some people get pregnant from taking the DHEA. So I 'd like to try. Can I take it without Doctor approval?Any Ideas? Thank you,",
            "post_id": "3154269",
            "timestamp": "1216058260",
            "user_id": "user_561110",
            "user_link": "/personal_pages/user/561110",
            "votes": "0"
        },
        {
            "answer": "To answer your question - can I take it without Doctor approval? - absolutely. In fact most of us here started without even notifying the doctor while others are lucky to have doctors 'in the know'.If I were you, I'd fire your doctor. DH and I did 3 cycles with no eggs or poor quality until DHEA and we got 10 eggs in December, 5 fertilized and 2 were pgd quality.Most local doctors we know now are trying either DHEA OR Testosterone patch for women who get few and/or poor quality eggs.Be Strong...Be Brave...Step Out...and Take Charge of your own fertility. Doctors with comments like yours really bother me given all of the data that's now available about DHEA.Let us know what you decide and come back for support and questions. :)All the best,Anitasto",
            "post_id": "3159848",
            "timestamp": "1216164252",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I typically had my E2, DHEA-S and T tested every other day during the cycle. Increased E2 can reduce T so I generally added 25 - 50mg like during days 6 forward. It also seemed to make the follies grow faster and more pop up. I'm sorry I didn't mention it earlier but I'm always a little reluctant to throw out a curve when there's already so much to keep straight in a cycle. I know others don't generally do that but I just went from my blood levels working to keep my T around 100pg/ml.Soooo....yes....I think its worth testing your DHEA-S and T just to see whats happening.Did you get a scan today? How many follies did you see?Also, it sounds like you're on estrogen during your ivf cycle? Is that right? Asking because I've never heard of that.I'll check back soon - eager to hear how things are going.Anitasto",
            "post_id": "3159947",
            "timestamp": "1216165565",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Garden....if you had a scan today and had even fewer follicles than before please let me know. This happened to me in 3 cycles.Hope to hear from you.Anitasto",
            "post_id": "3161105",
            "timestamp": "1216185616",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "If you want to keep your doctor here are some ieas...You can bring the studies from Gleicher in 2006 (5?) and Casson in 2000 for your RE to read. My RE has always been open to things I've brought in. Many REs haven't read these studies...this is still very new info. If you need them I can send a copy if you want to give your email.After your RE has had a chance to read them (ask him to read them and get back to you..) if he doesn't suggest DHEA then you might just say... \"I'd like to try it. Can we check my DHEA-S and Testosterone and go from there?\" Your RE should be supportive unless he can point to some very specific reason he dosen't think it will work for you.Other women go to their gynecologist or regular PCP and ask for the tests which avoids any potential conflict with your re.Best of luck,Anitasto",
            "post_id": "3161120",
            "timestamp": "1216186503",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Anitasto -- First, you are great to show such interest and coach me through this.  I can't thank you enough!!!Just got back from another u/s and b/w (latter results this PM).  I seem to have settled into 3 growing follies (there are still a couple under 10mm, but the 'leaders' are now 15, 11, and 10).  I'll likely be starting antagon today (Ganirelix) and go back Friday to see where things are to make the decision whether to go to retreival or scrap this cycle.  It's been a little diappointing starting with such a large field (13 follies) and settling down to so few maturing. My stats are:Tue\t7/8/2008\tCD3/Stim1: FSH=5.19, E2=115, LH=1.7, PG=0.4, RO=8<10, LO=5<10Fri\t7/11/2008\tCD6/Stim4: E2=164, RO=6<10, LO=3<10Mon\t7/14/2008\tCD9/Stim7: E2=102 (drops off Estrace), RO=12,10,1<10; LO=1<10Wed\t7/16/2008\tCD11/Stim9: E2= , RO=15,11,2<10; LO=10,1<10I was probably premature to start another cycle having been on DHEA only 6 weeks, so I am 'consoling' myself that if we scrap this cycle because of low counts, it's not the end of the world (a little $ out of pocket for meds and tests, but not the big bucks of a full IVF try).  And another 4 weeks on DHEA can only help right?  That said, I'm not completely writing this cycle off.  But will put my ducks in a row to do another round of blood tests (all those you mentioned before) if I get to another CD3.  It would be so much easier to have an RE work with me on this rather that going to my OB-GYN for tests, but I hope at least my experience will benefit others in the future going to this RE!Oh, a question:  you said you were having DHEA-S and T tested every other day when cycling.  When I had my DHEA and DHEA-S blood tests for baseline it took a week to get the results back - is that abnormal?  (Just wondering how/if you were getting results back so quickly)Also -- you said you had fewer follies on 3 cycles.  What did you do?  Was this before DHEA or during and did you end up scrapping the cycles?Thanks again!Lynne",
            "post_id": "3162464",
            "timestamp": "1216221936",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "I was told to stop taking DHEA when I got the positive pregnancy test.  I have read some studies where they wait for two positive bhcg levels with appropriate rise.  No aspirin, although when we were going to try stimulation that was part of the plan.Sorry it took so long to answer but I am 37weeks and still working.  Spend most of my other time sleeping.Good luck to everyone!P",
            "post_id": "3162854",
            "timestamp": "1216227770",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Hi Lynne,Glad to hear from you. I assume your follicles are like disappearing, right? Or are they just not growing?If they're disapearing then this is what happened in my cycles and I can offer my data and what we did. I've drafted it but don't want to post unless its more clear you're in the same boat that I was.If they're not growing then its different. Did you say you are taking Estrogen during stimulation? Just want to be sure I'm understanding correctly.Look forward to your response.Hang in there - I know exactly how you feel and my heart is going out to you.Anitasto",
            "post_id": "3163731",
            "timestamp": "1216240159",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Almost forgot about your other question.I think it's possible that most doctors either get labs back next day but don't have a critical nature for them like REs do. But its also possible the arrangement is separate and REs get top priority.One thing for sure - REs get their blood results same or next day.I think it wouldn't hurt to ask the head nurse at your OB's office - and if you explain the situation they will likely work with you to get it to you quicker.Anitasto",
            "post_id": "3163750",
            "timestamp": "1216240434",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "The best approach I can offer in talking with your doc is along these line.....\"I've been doing alot of reading on DHEA and its really important to us to feel that we're not leaving a stone unturned. Would you mind terribly if we also test and track my DHEA-S and T (free and total) while we're drawing for E2?\"This is sooooo no skin off their back and I would be really surprised to hear a doc who would say 'no'.It can only hurt NOT to ask I think, and IF THEY SAY NO, you haven't lost anything.As always - avoid being demanding at all cost. If they say no, just be cordial and thank them for considering it. And then consider if you want to continue with that doctor or just find another route to get the bloodwork you need.I hope you all don't mind this advice. Its hard for me to hear about doctors ignoring DHEA and/or patients being afraid to ask and it then costing time, money, and potentially less success in having to work around it.All the best!Anitasto",
            "post_id": "3163783",
            "timestamp": "1216240953",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I completely agree.  It is such a hard road to go down.  When you get into the IVF circles you are not talking about regular health care.  This becomes more of a fee for service type of healthcare so insurances and limiting healthcare costs are not in control since most do not cover.  So remember you need to have a sense that your RE is working with you.  And they should respond in kind since you are free to pay whomever you want to work with you.  This is a freedom of having to pay for the services...the one positive as you shell out the savings. Plus RE is not a typical field.  Protocols that we follow are based on studies but every RE knows many cases that they thought were hopeless and were proven incorrect.  I am sad to hear that many of you do not have an RE who is at least willing to support your interest in trying something different.  It is better that they are involved to make sure you do not suffer any bad side effects.Best of luckP",
            "post_id": "3165228",
            "timestamp": "1216262827",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Honestly, I don't know that follies are disappearing.  There are some that are definitely not growing.  When I asked my RE this morning (kind of that desperation plea :-) how I could have started with 13 and now be down to 5 or 6 worth following his answer was there may still be some really small follies that aren't worth following since they're not growing; they may be prepping for next cycle.  I will specifically ask when I'm back on Friday for a total count and ask whether some are disappearing vs. just not being counted bec they're so small in relation.",
            "post_id": "3165291",
            "timestamp": "1216263900",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "RE: Pregnancy on DHEADear all,I wanted to chime in with my story, which I hope will be encouraging for all.  Am in my early 30s with diminished ovarian reserve (FSH as high as 13, low Inhibin B, low-ish antral follicle counts).  Did a Clomid + IUI cycle with no luck, then an IVF, also with no luck.  I only produced 5 eggs during the IVF cycle, even though we did the short protocol, and the fertilization rate and embryo quality weren't good (two out of five fertilized, and only one of those made it to be a 4-cell day 3 embryo).  After the failed IVF, I started taking 75 mg/day of DHEA to gear up for another IVF, and got pregnant on my second DHEA cycle.  I was also taking Clomid at the time and we just found out that it's twins!  Who knows what happened, but it seems that the DHEA gave me a boost of something that I needed in order to produce better-quality eggs.  We'll see if the pregnancies work out; even if not, it seems to be a great sign that two out of two eggs fertilized and have been developing for a few weeks.  I also did acupuncture and took wheatgrass pills and flax seed oil.  My doctor told me to stop taking the DHEA as soon as we got the positive pregnancy test.Wishing you all the best of luck,Ann",
            "post_id": "3167373",
            "timestamp": "1216314515",
            "user_id": "user_535041",
            "user_link": "/personal_pages/user/535041",
            "votes": "0"
        },
        {
            "answer": "Ann, what a wonderful story!  Thank you for sharing!Angela",
            "post_id": "3168009",
            "timestamp": "1216324208",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Thanks for your response. I just talked to my doc today. He doesn't like DHEA because he said it 's going the increase the Male hormone which we have to keep it low. He said he's going to give me an estrogen hormone for the next IVF cycle and this will improve the egg quality. He also told me to take the Birth Control pill now until I start the next cycle and this also can improve the egg quality.What do you think about his idea?I still want to try the DHEA. But If not recommend from the doctor how can I get the blood test. I have a low protein S problem, last time my doc put me on the heparin.I heard DHEA has an effect on the blood clot.Please advise.Thank you,",
            "post_id": "3168329",
            "timestamp": "1216329040",
            "user_id": "user_561110",
            "user_link": "/personal_pages/user/561110",
            "votes": "0"
        },
        {
            "answer": "Hi Lynnny...I just wanted to chime in here on your RE's comment - because I received a similar comment from an RE I saw previously, unfortunately I never questioned what he said and we spent lots of $ pursuing a course of treatment that may not have been right for me based on his 'misdiagnosis'.  Sorry in advance for my soapbox rant, but I feel very passionate about drs \"diagnosing\" without actually running any tests!During a phone consult this 'well respected' RE he stated that his practice believes all older women have high levels of testosterone (the male hormone) and he follows a specific protocol to counteract that high T.  He does not believe in DHEA because of the risk to increasing that T (though I found that out long after I'd left him; I didn't know about DHEA back then).  What I never questioned until much later (after failed IVFs) was how he determined I had high T - he made this 'diagnosis' during a phone consult - he had all of my medical records but I had never had my T tested before, so did he make this 'diagnosis' by listening to me?Once I started reading about DHEA I decided to get tested through my OB-GYN.  I had a baseline DHEA and DHEA-S but did not have Testosterone tested until I'd been on DHEA supplements for almost 2 weeks.  That T test showed I had very low T - by that time it may have even been raised by the DHEA I had been supplementing. So that RE's guess about my \"high T\" was completely off-base.Unless your RE actually tested your \"male hormone\" levels he has no basis to state what your male hormone level may be.  If he won't test your levels go to your OB-GYN or your family dr. (Anitasto has provided great info on basic 3 tests to get).If you feel you need an explanation for requesting the tests - you can always tell them your acupucturist wants to put you on DHEA for fertility but from what you've read you'd feel more comfortable understanding what your levels are before actually starting any supplements.Good luck!Lynne",
            "post_id": "3168595",
            "timestamp": "1216333129",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Lynnie,I’m very sorry to hear that your doctor is responding this way. Garden is right…..unfortunately REs are too invested in just doing cycles ….in my experience most are not reading up or even if they are, often are just not comfortable changing their approach.Puglies – so glad you chimed in on this. Its so very important for women to be successful and have bloodwork to be sure things are going right.Garden - I really feel rant energy with this issue too so I'm really glad you chimed in. ;)As for Estrogen DURING an IVF cycle at same time as stims…..I have to say….all of my research simply says there is no basis for it. Estrogen should be used to downregulate before a cycle (the pill or patches) only…and in some cases after transfer as new studies indicate this increases PG rates. Its not to be used during stimulation if that’s what he’s suggesting. IF you find anything to the contrary in literature I’d be very interested to read it.The next post is the best advice I can offer after much of my own experience and just really thinking about this situation.I hope you find it helpful.All the best,Anitasto",
            "post_id": "3170340",
            "timestamp": "1216371380",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "This is a long post – but I’ve spent much time considering and trying these and this has really all the best advice I can offer to get your bloodwork (preferably with the same person who’s doing your cycles). So please bear with and read thru.HERE ARE SOME QUICK AND EASY CHECKS YOU CAN DO TO FIND SUPPORT FOR DHEA BLOODWORK................Call accupuncturists in your area that specialize in fertility. My local fertility acupuncturist knows every RE in this town backward and forward because she works with them. I imagine its similar in most towns.Post on this blog the town you live in and ask for referrals from gals here. You could get very lucky. I’m in San Diego and can offer great resources here.Contact your PCP and let them know you're situation and ask if they can check adrenal function with DHEA-S, T (free and total) with day 3 fertility panel FSH, E2, LH. Most PCPs are pretty agreeable with this and tests are inexpensive. But they will order they're own stuff - so be sure to tell them what you want specifically.ON TRYING TO FIND AN RE WHO WILL DO DHEA REALATED BLOODWORK.......Imagine this analogy - humor me here...You’re in a delicate dance with a big hungry bear (yes...he wants your ivf $$). If you remain calm and make just the right steps, you can get the bear to dance with you. If you appear aggressive or turse….well….the bear will eat you and move on. If you are too meak and play dead...well... the bear will not be interested in you, walk over you and then walk away. I hate to say it....but this is life. And this is how I’ve felt in searching for an RE and even working with him until we struck the right balance of mutual respect. And that took six months of displaying consistent calm but determination.In trying to get RE cooperation (not support – you’re unlikely to find it) it’s really important to back up your requests with good research. They will take you much more seriously.If you want to try with your current RE I would fax or deliver a copy of Casson on DHEA and IVF in 2000 (free on inet), Gleicher on DHEA in 2005 and 2006 (the case study of one woman with 66 embryos and the followup study with 26 or so women on DHEA.) If you need copies post your email and I’ll send them all to you. Otherwise Casson is free online and Gleicher's are about $5 I think as a patient. Ask your doctor to review those and ask if you can talk with him in about a week. This gives you time to check around so you have backup if you need it.In the meantime….CONTACT REs AND ANY OTHER ENDOCRYNOLOGIST YOU CAN FIND CLOSE TO HOME - ESPECIALLY WITH FOCUS ON FERTILITY (many do thyroid and diabetes only). Antiaging is also pretty good...these folks seem to be most well rounded in their understanding of the endocrine system.ASK FOR A PHONE CONSULT. Almost all of them give free phone consults or some have a set fee for a consult….they do them all the time.OTHER RESOURCES................Also contact any PCP who is a woman especially in her 40s. Most of these will likely be kindred spirits in your plight and willing to help. But like Garden, having to see 2 different doctors is not ideal unless you just have a lot of time. But even then, it will wear on you eventually.HOW TO ASK...WHAT TO SAY...IMPORTANT TONE AND APPROACHAnd a very important thing I think….. I would really avoid asking what any RE or other doctor what they think about DHEA if I were you. You will get as many different answers as there are REs and once they’ve stated a negative opinion it is very hard for them to save face and agree to help you. Asking their opinion just opens the door to conflict when your opinions differ.After telling them about your failed cycles and sincere desire to have your own children…I would only say “…..I am planning to use DHEA and would so much appreciate if you will be able to add bloodwork for DHEA-S and T prior to and during the cycle. Is this something you can do?”I write this script because the wording is really important here. You’re not asking what they think or what they are willing to do. You’re asking if they ‘can’…which the answer of course is yes…they can do anything they want.  If they say no then they simply don’t want to do it and that’s ok too and best to find out early. You WILL find support with this sweet, kind, educated and sincere request. If you strike out more than twice…I would even be willing to make calls on your behalf. I mean this seriously.ON AN RE WHO HAS ALREADY SPOKEN NEGATIVELY ABOUT DHEA.........When you talk again with your RE and he says he has read the articles (which you sent and asked him to review) but is not comfortable or anything negative which you should expect…. then I would say….“....I really appreciate your taking the time to talk with me further and I do understand  this is different from what we discussed. I would really like to try this next if you could allow me to do that. Would you be willing to consider Gleicher’s protocol?”If he agrees to this…..you’re home. And in this case you have to say ‘willing’ because he’s already stated a position so you are in fact asking him to bend and recognizing it. This will give you ‘humble’ points and make it difficult to refuse you.CONSIDER PRACTICING YOUR APPROACH AHEAD OF TIME.......If you have a difficult time taking a position like this…e.g. you’re generally shy or avoid conflict at all cost or are intimidated by doctors (most of us are)…then practice these scripts with DH or a girlfriend. Same goes if you tend to run the other way...bull in a china shop...  ;) And if you have a confident and diplomatic friend, consider asking them to call on your behalf. This is probably not necessary but I've been asked by a few girlfriends at different times to go with them to REs and other important stuff to advocate and its always been an honor to help them get what they need.I think it is so very important to find the support you need in order to ensure you are getting successful outcome with DHEA. Most can do well without it but you don't want to be the one who really needs it and waste time. DH and I spent 6 months without DHEA, 4 more months without good support, and then had DHEA complications that took a year to figure out that we never would have without bloodwork support. As many of you know, we did get 10 eggs in a cycle on DHEA .... 2 1/2 years earlier in our first IVF we only ever saw 1 follicle.I sincerely hope you ladies find this helpful.All the best,Anitasto",
            "post_id": "3170381",
            "timestamp": "1216372729",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "The other thing about the DHEA, I search the bad side effect of DHEA and found that it may cause breast cancer. That might depend on the dosage you take but not quite sure about this. Do you have any idea?Thank you,",
            "post_id": "3170962",
            "timestamp": "1216388971",
            "user_id": "user_561110",
            "user_link": "/personal_pages/user/561110",
            "votes": "0"
        },
        {
            "answer": "Well Antitasto,  on Wednesday at my ultrasound, I approached my fertility doc about DHEA here in Germany, even gave him copies of the studies.  \"I don't believe it.\" he says.  I answer \"Even after the studies from Casson, and Gleicher & Barad?\"  \"No\", he abruptly answers  (very German, just like my hubby - to an American it is like getting the door slammed in your face).\"Well ok\" I said and was not about to tell him that I have been taking DHEA on my own for 3 months.  God only know what he would do, maybe cancel the cycle or something.So yesterday I had the retrieval. 8 eggs, the most I ever had (maybe it is due to the DHEA, and if I went to another IVF round I would even produce more).  But for now I am waiting for those 8 to get to 5-day blastocyst.Baby Dust to All,Angela",
            "post_id": "3174788",
            "timestamp": "1216465163",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Angela - congrats on your retreivals-- I'm sending lots of baby dust that you'll end up with too many to transfer!!!We decided on Friday to cancel this cycle.  It's a little disappointing but I'm taking the philosophical approach that this gives the DHEA more time to work in the system (this cycle started after 6 1/2 weeks on DHEA).  The disappointment is that we started with such a large pool of follies and growth really only occurred in a few (started with 13, last u/s had a 20, 14, and 11 with 3 under 10).  The good news is that's the largest starting pool I've ever had, but the final number growing is about par for me.Anitasto - first thanks for the coaching on how to approach your RE!  Great information and recommendations!!!  Also, I do have a couple of questions as I work towards another day 3:My RE had me on Estrace as a mild form of estrogen priming protocol (EPP) to prevent an early leader, which obviously didn't help given the results, but he had me on the Estrace up to stim day 4 - which from your earlier post to Lynnny it sounds like you disagree with.  On a prior IVF I was on a different (more aggressive med) EPP that lasted almost the entire stim period and from what I have read on other boards it seems a pretty standard approach... am I misunderstanding your concern about taking estrogen during a cycle or I'm curious what you have read that gives you concern.Based on what I experienced with the high starting pool of follies then the few that grew (oh, I did ask whether the other follies had disappeared or just hadn't grown, the RE did a count and believes they just did not grow), any ideas on what to do?  Is it a matter of not enough time on DHEA or something about the protocol (or other) that could be changed to ensure more uniform growth going forward?  My RE said he wouldn't change anything about the protocol, this just wasn't destined to be a good cycle... but as with most women after a failure, I'm looking for what could / should be changed.  I really appreciate your input!!!",
            "post_id": "3177924",
            "timestamp": "1216564886",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "One more question -- reading back through all the posts I think you said that your E2 took a long time to jump to high numbers during stim while you were on DHEA.  Looking through my numbers with this cycle I see the same thing.  Why is that?  Is that a bad thing or will the E2 finally jump up?As a possible related asside, I always have prematurely ovulated while stimming unless I was put on an antagon (Ganirelix), this is the furthest I've gone on stims without an antagon and without ov - confirmed by progesterone tests... in the past the best I've gotten is to follie size 15 before ov, this time I got a 20 and still hadn't ov and the E2 showed I had no need for the antagon -- trust me I was skeptical and kept challenging the RE - 'shouldn't I be on Ganirelix yet???'",
            "post_id": "3178065",
            "timestamp": "1216567725",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Was so upset yesterday.  Out of the 8 eggs retrieved, only 4 could be fertilized (we used ICSI).  Why would that be?On my prior IVF they could fertilize 6 but half of them stopped growing.I am going to have my hubby call the doc tomorrow and ask for answers in German.  Their English is ok at the clinic but not on the very technical matters.Am so disappointed.",
            "post_id": "3178189",
            "timestamp": "1216570708",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Don't be too disappointed yet.  You still have four eggs that have fertilized!!!!  See how they grow!  A lot of the times they can not be fertilized because they are poor quality or not matured.  Remember it only takes one good egg.  That is what I would tell myself every month.Remember Baby Dust!!!P",
            "post_id": "3178609",
            "timestamp": "1216579464",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Hang in there girlfriend!  Puglies is right -- 4 is still a good number!  I'm throwing all the baby dust I can your way!!!Lynne",
            "post_id": "3179528",
            "timestamp": "1216599288",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Just wishing you luck!!! Baby dust and all good things for you and your four eggs!!!chups",
            "post_id": "3179929",
            "timestamp": "1216608534",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Chups, garden4lynne, puglies, and Antitasto, thank you for all your support.  It is such a hard time, this IVF thing.  So emotional.  This is my third time and the last time insurance covers it, so I am a bundle of nerves.  Yes, I know I need to calm down because it is better for the embryos.Apparently at least one of them made it because they scheduled my transfer for Wednesday afternoon.  The internet portal does not say how many embies made it, and getting someone on the phone is a nightmare.So Antitasto, I will keep on with the DHEA.  I think at 3 months it is the reason I had one more follie than usual.Baby Dust,Angela",
            "post_id": "3181900",
            "timestamp": "1216660500",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "My doctor already said \"NO\" to try the DHEA but instead he want to put me on the estrogen priming. He said it would increase the Egg quality. Anyone has an experience with the Estrogen priming? Is it really increase the egg quality?Anyway I decide to make an appointment with the Human Reproductive Center in NY to discuss about the DHEA this Friday.",
            "post_id": "3182304",
            "timestamp": "1216666181",
            "user_id": "user_561110",
            "user_link": "/personal_pages/user/561110",
            "votes": "0"
        },
        {
            "answer": "Angela -- yipee!  That's great news you have a transfer scheduled!!!  Oh how frustrated you must be not able communicate directly with anyone at your clinic -- a website to tell you your info???  Yikes!  I guess as frustrated as I get with he RE's here and our system, I should be thankful that I get to talk with a real person.  Anyhow... I'm so hopeful that soon you won't have to deal with all this IF stress anymore!!!  I'll be thinking sticky thoughts for you!  (And I know you already know this, but hopefully you can find something to distract yourself from your worry... listen to classical music, go for a long walk, ... hugs!!!)Lynnny -- that's great that you have a consult with the NYC clinic about DHEA.  I'm very curious about them and hope you'll provide some feedback after your meeting (they have a sister clinic in Chicago I thought about, but when I was looking for a new RE I couldn't find anyone on the boards that had seen them, so the 5 hour drive seemed too far for a 'maybe' consult).  I'm sure you know all this but keep in mind that they probably will be very pro-DHEA (all their studies, etc.) so don't hesitate to ask questions about your concerns (seems you've listed several here).  Good luck!",
            "post_id": "3182598",
            "timestamp": "1216670558",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "That is great news!  Keep up your spirits as hard as it is.  Try not to stress too much although I always hated it when someone told me that!  It is great your insurance has paid for three rounds.  My husband's sister is in Germany and she did three rounds of IVF.  Only had something to transfer on last round.  She transferred one embryo and she has a beautiful little girl!  Third times a charm!  Keep us updated and greatest of luck!  May disappear for awhile...contractions and term.Baby dust...love that!Lynny - so curious about the guys in NY.  Do you meet with Gleicher or Barad?  I have asked about estrogen priming myself when I found an article about it.  Talked with my RE about it.  He said some believe it helps.  Some women respond differently to each medication and so it is hard to say what will work for you.  Many RE's think Gleicher and Barad are on the fringe of medicine and so I think that does not help with convincing standard doctors about DHEA.  My doctor was intrigued because of Casson.P",
            "post_id": "3182871",
            "timestamp": "1216674558",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "I just wanted to thank Anitasto and the others of you that have shared your journeys so openly - I have been watching this with interest over the last few weeks and have found it all so fascinating and helpful.I hope you don't mind - but here is a little bit on me:  My DH and I started IVF in April for PGD purposes only - we had no idea that there were any issues with me (I am only 32) and DH's trial wash was perfect.  After 3 days of stimming on cycle 1 my FSH was increased from 150u to 300u and the cycle later cancelled for poor response. Cycle 2 was also cancelled.  Cycle 3 we had determined that I had poor ovarian response, though my FSH readings at the beginning of a cycle are all normal - in fact I was told that all my hormone levels are normal at the beginning, but my E is slow to rise during a cycle and I just seem to have a low follicle count on every cycle.  Cycle 3 we had 8 follicles, and retrieved 6 eggs. Only 3 could be ICSI'd - 2 of those fertilised abnormally and the final one was graded poor and didnt get past 5 cells.  I was scared that the quality was all so poor and we were told to prepare ourselves for never having our own children, though not to give up all hope yet.My Dr then put me on DHEA - I havent had my levels tested however I can say that we then started another cycle after only 1 month on the DHEA - sadly we only got 4 eggs - I was devastated - but all 4 fertilised normally and all 4 got to blastocyst stage (though 2 were too slow to get to PGD testing in time).  2 were good enough to be PGD tested on day 6, 1 passed the PGD and was transferred - unfortunately no BFP but what a difference from cycle 3 to cycle 4.  I am now back on the DHEA and will also do an oestrogen priming protocol this cycle.  I am also about to start acupuncture.  I am not sure if any of you have any suggestions - my Dr says that adding the oestrogen priming is the last trick in her book - however I am hopeful that if we just keep on going that we will get there eventually.  I am not exactly sure how the Oestrogen priming helps?I am also interested in whether DHEA can increase or decrease miscarriage rates and notice that the CHR state that their research shows as follows:'This is why the timing of the arrival of the Toronto data was so exciting; these data not only confirmed the high pregnancy rate in very unfavorable patients with diminished ovarian reserve, but demonstrated an identical reduction in miscarriage rate to the one observed by us (when compared to national IVF data). Since the combined data sets between CHR and the Toronto center involve an adequate size patient sample, we are now confident to state that DHEA supplementation significantly decreases the miscarriage rate in women with diminished ovarian reserve.'http://www.centerforhumanreprod.com/premature_ovaries.htmlDoes anyone know anything about DHEA and miscarriage rates - ie if I manage to get to transfer again do I stop taking the DHEA or not, and if I stop - when should I stop????",
            "post_id": "3184092",
            "timestamp": "1216694038",
            "user_id": "user_567541",
            "user_link": "/personal_pages/user/567541",
            "votes": "0"
        },
        {
            "answer": "Welcome Hope!  Finding this string has been a great source of info for me too and the more people that contribute, the more we'll all learn!Thank you for sharing your story - my heart goes out to you for your cycle failures but it sounds like you have reason to be optimistic from your last cycle with DHEA!Regarding your question on miscarriages... I'd have to go back through the post to be sure, but I believe it was Anitasto that wrote that CHR had a higher miscarriage rate because they left people on DHEA through transfer up to the first or second positive beta.  I'm not sure what the right answer is - I've read Dr. Gleicher at CHR state that \"There is no evidence to suggest that DHEA is harmful. PCOD patients, who get pregnant all the time, have very high DHEA levels.  Pregnancy, itself, is a high DHEA state since the placenta is a DHEA factory.\" (so presumable supplementing into the early pregnancy shouldn't be a problem).  But I'm inclined to take the conservative approach and follow Anitasto's advise that DHEA supplementing be ended with transfer since it tends to increase a woman's testosterone and high T can lead to m/c (or at least pull back on the amount taken... then again if you're getting blood tests throughout your cycle like Anitasto suggests, you'll know what your T levels are and make an assessment whether there is a risk of high T / continuing DHEA).(Note - the comments from Dr. Gleicher were from a phone consult a woman on IVFconnections.com had with him in 2005 and posted to that board; she reconfirmed that info with him again in May this year.)",
            "post_id": "3184238",
            "timestamp": "1216696115",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Hi everyone!I have read your posts with great interest because I have started to take DHEA despite my fertility specialist's request that I stop taking all meds and vitamins unless he prescribed it.I'll briefly share my story:  I was treated for a hyperthyroid when I was 27 years old, my periods became scant and eventually stopped, which I now believe was caused by the medication I took.  I was diagnosed with premature ovarian failure at the age of 30, FSH of 120, with menopausal symptoms and no follicles.  My husband and I were devastated.We were told we had exactly one option:  IVF with donor eggs.  We've had 3 IVFs (2 fresh, one frozen, with 2 different donors).  NO BFP.  The doctors talk about using donor eggs as though it's as close to a sure thing as we can get with IVF.  We've spent for than $60 000.00 (due largely to the $23 000.00 we spent on the first donor, through an agency).Now there's news DHEA may help women with premature ovarian failure, too.  In a recent Greek study, available at www.neogenesis.gr, 5 women with POF became pregnant while using an off-the-shelf DHEA product from Natural Organics Laboratories Inc.  I purchased some yesterday, switching brands so I could take DHEA that is similar to the type used in this particular study.  The closest I could find is \"Nature's Plus\" DHEA (25 mg) capsules, from the same manufacturer.  I'm stopping my hormone replacement therapy this month and I'm going to see how I respond to just DHEA.  I do seem to have some hair loss, but I'm not going to fret about it unless it becomes noticeable.Thank you for sharing your stories with me.  It's so nice to know that I'm not alone!Laura",
            "post_id": "3186237",
            "timestamp": "1216743931",
            "user_id": "user_567971",
            "user_link": "/personal_pages/user/567971",
            "votes": "0"
        },
        {
            "answer": "Hi Laura!I read the Greek study too -- inspirational!!! Let's hope we're all as fortunate!  I've experienced some hair loss too (always lost some, say 10-20 strands in the shower), but now it seems like I'm getting a hand full (not literally, but probably 2-3 times as much as before).  I can't run my hands through my hair without at least a few strands coming out any more.  But I figure if this is my magic bullet, a little hairloss (and acne like my teen years!) is worth it.Kudos to you on taking this step (regardless of your specialist's admonisions)... but you may want to get a baseline test of your DHEA, DHEA-S and Testosterone before you go too far.  If not with your specialist perhaps another dr you see.  While on the face of it your symptoms sound like you'd benefit from DHEA, you'd hate to create another issue...Keep us posted on your progress!Lynne",
            "post_id": "3186722",
            "timestamp": "1216750383",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "I googled “DHEA Breast Cancer” and this excerpt was the first result:The evidence that DHEA may prevent breast cancer is difficult to evaluate. Animal studies have shown that DHEA is very effective in preventing breast cancer, while the human studies have been inconclusive. There are studies showing that DHEA protects against human breast cancer cell proliferation by blocking estrogen receptors on breast cells, yet other studies contradict this finding.As for estrogen increasing on DHEA, I am still in a different camp, but everyone’s body is different. In my experience my E2 initially increased at baseline but was always associated with either late luteal cyst or early developing follicle. Once this was under control with downregulation, my baseline E2 averaged 40pg/mL when ovaries were quiet.Also, increased estrogen and BC association are peri or post menopausal as far as I understand the research.I’d be very interested to read what you’re referring to that says DHEA increases BC risk. Can never read too much.Best,Anitasto",
            "post_id": "3189155",
            "timestamp": "1216784387",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "So sorry to hear, but glad your $$ are available for a much better day. And you’re most welcome – glad you think the advice may be helpful.E2 RISING SLOW OK? I think it’s ok…at least my cycle with 10 eggs, 5 fert, 2 PGD perfect was a 14 day stim cycle. There are solid studies to the contrary but those were not with DHEA. Sasparilla posted “I had to stim longer than most people, b/c my E2 levels were sooooooo slow to rise, but at the end I had 11 eggs/all 11 were mature and 9 fertilized. “ It’s slow but it does jump.Why E2 rise slower? I could speculate or theorize but it’d be long and I’d rather save it for more research when I have more time. ;) Sorry.ESTRACE BEFORE STIMULATION was very important for me to downregulate and was recommended by CHR. But the follicles in the early stages are primarily composed of Testosterone and then convert to Estrogen around size 7-8mm. E and T impact each other negatively…e.g. T goes up, E goes down and vice versa. I read this and found it in my own bloodwork.6 weeks on DHEA is a good start – how much are you on?Great to hear you didn’t need the Ganirelix. It slowed my folly growth and made my cycle longer….and …. in retrospect my RE had me on it without Progesterone bloodwork. Hmmm…wish I’d have thought of that before. Glad you posted it.ESTRACE DURING STIMS – I just can’t find ANYTHING! I’ve searched and searched. If it were typical or normal there would be SOMETHING I believe. I’ve researched lots of protocols and just never heard of this. Estrogen is always used to downregulate. Think of the pill. If I were you I honestly just wouldn’t use it other than to downregulate. PUGLIES - HELP HERE?DOSAGE & BW - I honestly think you should get your new bloodwork and see where your DHEA-s and T are. I went back thru my notes from you to see if anything stuck out. Your baseline DHEA and DHEA-s were extraordinarily low.DHEA 46  DHEA-S 1.7. My baseline was DHEA 392 and DHEA-S 66. My acceptable range from labcorp  is DHEA 135 – 810 and DHEA-s 40 – 325.Mine was higher than yours and lower than those in Casson’s study and my first real IVF results came on 150mg/day but I was tracking my T. You want your T to be around 100 I believe based on my experience.I’ll be interested to hear what your levels are now. Can you repost them with your original baseline, time and dosage on dhea, and current levels? I think this would be so helpful for others here.Hang in there my dear! The fact that you have some changes is good – just need to figure out the tweeks and you will get there. For some it comes like butter but I had to do some tweeking and it appears if you keep with it you’ll get there. Just know you’re not alone and I feel confident for you that it will happen if you can get your BW, right dosage, and right protocol (thinking sans estrace).Keep us posted my dear. :)Sincerely,Anitasto",
            "post_id": "3189360",
            "timestamp": "1216787175",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hey Angela - I'm sooo hopeful for you.Xfer today? How many??Hang in there baby!! :)Anitasto",
            "post_id": "3189415",
            "timestamp": "1216788080",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hope02,Hi Hope. And welcome also. I’m sooo excited to hear another doctor freely adding DHEA. Sounds like your in great hands.A couple things from your post along with other posts on estrogen sent me searching…..And here’s the thing, just like estrogen during stims I didn’t find a study but on estrogen priming I did find some blogs. Here’s a quote from one, “I talked to the nurse at Dr. Swanson and asked her if they do estrogen priming as part of the antagonist protocol.  She said no, they used to, but they weren't getting a good response.”  Her doc is proposing estrogen priming by taking it 4 weeks before stimming. Here’s the link: http://wombmatewanted.typepad.com/blog/estrogen-priming/index.htmlMy theory on estrogen priming is that with DHEA its critical to downregulate the ovaries for 2 weeks, starting immediately after ovulation, just before stimming. I don’t like the 4 weeks of estrogen because then you don’t ovulate so your ovaries don’t get LH which is important to the health of future follicles. I once did Estrogen for 3 weeks instead of 2 for scheduling purposes and follies started disappearing after 12 days of Estrogen so I wouldn’t do it again. Also, CHR – which started this whole thing after Casson – uses 2 weeks on Estrogen patches prior to stims, 3 days off everything but baby aspirin and vits, then stims – this worked for me very well.We’ve had different approaches on this blog to going off and staying on DHEA after transfer. If I were to go again, I would just cut my DHEA down to 50mg after retrieval and 25mg after PPT. Some quit after retrieval all together, some quit after 2 ppt. My email on this question to CHR got a response that they do not stop the DHEA supplements after transfer.As for miscarriage. I think its pretty straightforward. Most of us see better quality eggs and embryos on dhea. It thus should follow that there should be fewer miscarriages.Its easy to worry about everything – but the acupuncture will definitely help you relax. I think it sounds like you’re going to do really just fine in this next cycle given your fert rate this time.BTW – DH and I did pgd without PG results. We are doing 3 day xfer next time. Most dhea’ers are doing 3day xfers. Just a thought.Finally - I think your instincts are right – keep doing what you’re doing and just get your bloodwork to see that your T is close to 100 and you have increased number of antral follies before starting stims to be sure you $$ are being very well spent.Looking forward to hearing how it all goes!Sincerely,Anitasto",
            "post_id": "3189523",
            "timestamp": "1216790067",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "And just sitting here thinking about you and thought - what the heck - better safe than sorry.  Just to be sure, I would get your thyroid panel....that's TSH, T3 free and total, T4 free and total. It can't hurt and better to be sure than go thru another cycle without knowing...especially if anything shows up. I doubt it will based on your info, but that's where I was going in asking if your follies were disappearing.Also - just want to say thanks for chiming in on so many of these posts. Its really great you're responding to women and passing on your support here.  ;)Cheers Girl!Anitasto",
            "post_id": "3189585",
            "timestamp": "1216791931",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Laura,Welcome. Thanks for sharing the greek study....fantastic!I was thinking about your situation and feel a little concerned that your FSH is so very high and going off HRT. I think in your case more than most it is critical that you get a hard copy of all your bloodwork before stopping HRT and get baseline DHEA, DHEA-S and T before starting DHEA as well as typical day 3 panel.What are your taking for HRT? I'm curious because this is new to me.I don't mean to create concern for you....just want to encourage doing this with full knowledge because frustration can (and has for me) drive us to make big steps which are usually good....but just take care to be stepping in the right direction. ;)Thanks so much for joining and sharing! Really looking forward to your info and progress!Sincerely,Anitasto",
            "post_id": "3189597",
            "timestamp": "1216792498",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I keep having afterthoughts about you....it must be the wine! hehe.Your LH levels are slightly concerning. The gold standard as I understand it based on many studies is that LH should be between 0.5 and 1.7 at HCG injection before retrieval. Yours fortunately appears to be going down on CD 3 while you're on DHEA. But it should be lower on CD3....like below 0.5. And this now also leads me to question the use of HCG in your cycle. I could understand if your LH was 0.0 and never went up, but if he's adding HCG and then also adding Ganirelix to avoid ovulation its kind of chicken and the egg. Make sense?I'd just get your labs like you do and follow that LH and don't add that HCG if your LH is over 0.5 and once you see 0.7 definitely start the ganirelix.Here's a link that lists the studies and their standards.http://humupd.oxfordjournals.org/cgi/content/full/12/1/3/T8?ck=nckHere's the best study I think....http://humupd.oxfordjournals.org/cgi/content/full/12/1/3?ck=nck#T8Let me know your thoughts. My last cycle had LH of 5+ and our eggs were ****. That's the problem with high LH. I seriously regretted allowing my doc to do the retrieval knowing the LH and responsibly he should have canceled it. Ugh!Sweet dreams my fellow blogmeister. ;)Anitasto",
            "post_id": "3189665",
            "timestamp": "1216794686",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thank you for your information and concerns! ;)The problem with HRT is, I was basically left to sort that out by myself, with the help of my naturopath.  My family doctor didn't know how much estrogen and progesterone I should take, or the type, and after the first two BFNs the fertility clinic never called me again.  It's heinous, really.  I asked the fertility specialist what I should take, he said I should be in the care of my family doctor, and the family doctor didn't want to interfere with the fertility clinic's advice.Bottom line:  they don't know how to deal with women whose ovaries don't work properly, as POF occurs in only 1% of women 35 and younger.Here's the HRT protocol I figured out on my own:  Day 1 - 20, 1 tablet of estrace (2mg) in the morning.  On day 21, I stop the estrace and use 1 progesterone suppository at bedtime, nightly until I get my period, around day 28.  If I do the progesterone around day 15, which was information I found online, then my period arrives around day 20.I thought I'd go off HRT for one month and just use DHEA and see if my cycle returns with DHEA,  as was mentioned in the Greek study.  It's a good sign that I menstruate on the hormones;  my naturopath said truly menopausal women don't have any menstrual blood flows, even when taking HRT.A few weeks ago, we had our third IVF.  This time, I had LOTS of bleeding when I wasn't supposed to, and thought the transfer may be cancelled.  There was lots of clotting mid way through the cycle, when I was increasing the estrogen.  On day 14 of my cycle I had a full, five day, very heavy period, followed by lots of spotting.  It's a dramatic change from a year ago, when I had a tough time bleeding, even after taking provera.  Then we started some massive doses of estrogen to get me ready for the transfer, and I spotted all the way up until the day before.Anyway, you're right about bloodwork, and I'll call the family doctor and see what he thinks...Thanks, Ladies!Laura",
            "post_id": "3192178",
            "timestamp": "1216843030",
            "user_id": "user_567971",
            "user_link": "/personal_pages/user/567971",
            "votes": "0"
        },
        {
            "answer": "OK - I completely understand now. Thanks!BTW - Did you see follicles in your 3 cycles or was it focused on prep. for Xfer?Also - here's an idea that 'could' give you an early indication of whether you'll respond to DHEA...DHEA converts primarily into testosterone which does all sorts of things to cause your ovaries to produce follies. There is a great study that uses only the Testosterone patch for POF women and they went from 1-2 follies to 8 eggs on average at retrieval and 26% PG.Here's the link:   http://humrep.oxfordjournals.org/cgi/content/full/21/7/1884If DHEA is going to work for you then its possible a short quick route just to test it would be to use a T patch according to the study, and just see if you can see follicles.Also, women with severe POF are often put on Testosterone to sustain bone density.If that works .... it should be a good indicator of whether DHEA will work and you don't have to wait months to find out. In the study the patch was put on shortly after PD begun for I think 4 days and...boom...there were more follies.Hope this is helpful. Your persistence is really inspirational and I'm rooting for you in a big way.Best,Anitasto",
            "post_id": "3193283",
            "timestamp": "1216858783",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Anitasto -- you are a Godsend!!!!  If I win the lottery I'm going to set up a foundation to study IF and name you director!!! I really can't begin to thank you enough.  I don't know how you find some of the things you do but really appreciate the links, etc.!  (Oh - and thanks for the chuckles... 'it must be the wine')OK...I'm heading in tomorrow for progesterone test, assuming I o'd will go on Estrace.  I will also question why I was on Estrace so long last cycle - sounds like there is no reason to go beyond AF start, in fact there is a risk.I've been on DHEA for 61 days now though it took me 3 weeks to work from 25mg dose to current 100mg dose (so 37 days now taking 75mg in AM and 25mg in PM).  I plan to get DHEA, DHEA-S, and T all retested on CD3 so have about a week more to go.  ***Unless you think I'd be better getting updated bw sooner than CD3... let me know.***I did have my thyroid panel run before my last cycle (was 5 days after AF if that makes a difference).  All results came back in normal range [vs reference range]:TSH=1.96 [0.5-5.2], FT4 free=1.2 [0.8-1.8], T3 free=2.8 [2.3-4.2]I REALLY appreciate the links to the LH studies - gives me good basis to have discussion with the Dr.  Thank you so much for thinking about this one; after reading the study I'm also concerned why he had me on the mini-dose HCG given my CD3 LH levels.",
            "post_id": "3193977",
            "timestamp": "1216869641",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Hi everyone!Lots of great info. Thank you!I have  a quick question. I started on DHEA 25mg little more than three weeks ago. Past weekend, after I got back from vacation (I had some sun exposure), my arms and legs started to itch a lot. I noticed the spots are a bit red, bumpy and has rash.Anyone experienced any kind of skin rash while on DHEA?Also, I have a bit more hair loss than usual, not nothing alarming.Thanks much!HQ",
            "post_id": "3200554",
            "timestamp": "1217007276",
            "user_id": "user_551909",
            "user_link": "/personal_pages/user/551909",
            "votes": "0"
        },
        {
            "answer": "Glad to hear you're enjoying the sun! hahaWhile I was on DHEA my sun became really really sensitive to the sun. Like, just driving the car with sun on my arm it almost felt like it was burning my skin. So I bought a few long sleeve white thin t-shirts and wore them alot. Only now that I've been off it for a couple months and feel fine in the sun do I realize how much effect it had. But I didn't get bumps or anything (unless these bumps from the cabin are not bug bites -  hehe).Hope they get better!Best,Anitasto",
            "post_id": "3200909",
            "timestamp": "1217012525",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Thanks so much for your kind words! You really made my weekend. It means so much that all my neurotic researching is helpful to others also. I started writing chapters of a book on my experience and now have to write the science part. If you know any publishers I'd be ever so greatful. I feel so much for women out there who seem to be flying blind without a book they can pickup and read about  ivf for regular women.I think anything CD 1 - 3 is totally fine and truthfully I think more towards the CD1 is best because my ovaries were so active it seemed a shorter window to get the baseline before E2 started picking up.Hope you had  a great weekend Garden!Anitasto",
            "post_id": "3209108",
            "timestamp": "1217233858",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Does anyone know if you can take Clomid & DHEA at the sametime?",
            "post_id": "3209882",
            "timestamp": "1217256553",
            "user_id": "user_573189",
            "user_link": "/personal_pages/user/573189",
            "votes": "0"
        },
        {
            "answer": "Hi Anitasto,I just wanted to say, what a great idea writing a book about your experience. I believe something like that is very much needed, I know I would buy it.Many women need good information and empowerment, and from what i can tell you can give them both...cheers!chups",
            "post_id": "3210793",
            "timestamp": "1217270821",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hi i have been reading this forum for around a month now and wanting to post for a while my story is  ive been been ttc for 1 year i have a daughter 11yrs old then came the blow i have high fsh and am pre menapausal although i have no menapausal symtoms anyway about 2 months ago i started on dhea after reading about it on the chr study i take 75mg per day and today i start on gonal f its so scary i don't how to feel i'm afraid to be too hopeful incase its unsucessful and i will be crushed but at the same time i don't want to be too negative. I live in derbyshire England and its been a battle to get this treatment as my doctor feels its a waste of time and money as he says donor egg is the only route for me and if this doesn't work i'm not sure he will be willing to treat again any words of advice would be great thank you",
            "post_id": "3214212",
            "timestamp": "1217341473",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "I've been reading and reading and reading. And here's the best conclusion I can think of.If your baseline FSH is high then DHEA is probably a good idea even with clomid. If your baseline FSH is low and/or you have PCOS, I probably would not include DHEA. I could go into it....but....it'd be a textbook.Care to share your bloodwork with us?I'm very interested in this comibination as I've been thinking about it ever since dg223 posted her effect from clomid.Best,Anitasto",
            "post_id": "3216701",
            "timestamp": "1217381582",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "What was your high fsh? Did you have any other bloodwork you care to share?I understand you're in the throws of the 'cycle' and its a stressful place to be. I found accupuncture for fertility 2 or 3x a week extremely helpful in getting me relaxed, not to mention it improves blood flow to the ovaries which is really important as DHEA can thicken your blood a bit. Be sure you're taking baby aspirin too on that note.Hope you get mega follies. ;)Anitasto",
            "post_id": "3216712",
            "timestamp": "1217381810",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "wow...so much information!After 3 failed IVF cycles in Luxembourg, I'm now trying a specialist fertlity clinic in Belgium. They want me to start on 75mg DHEA immediately, which finally felt like a positive step...until I started researching the side effects of DHEA! I guess it'll be some years before the serious side effects are clear, but the common effects are also disturbing...of all of you who experienced hair loss [and that seems to be quite a few] can you tell me if it grew back after you'd stopped taking the DHEA?? And facial hair/ lowering of the voice/acne etc etc, and all the other testosterone-induced side effects...are they temporary? I've read that they are irreversable! Can anyone advise that has actual experience of this?",
            "post_id": "3217815",
            "timestamp": "1217414253",
            "user_id": "user_575147",
            "user_link": "/personal_pages/user/575147",
            "votes": "0"
        },
        {
            "answer": "Hi Antitasto, Puglies, Garden4Lynne, everybody:  I have a BFP today, 6 days after transfer.  50.5 IU HCG.  I do not know if DHEA had anything to do with this, really.  I had only been taking it for three months and it only increased my antral follicle count by 1.I also did NOT have a high FSH reading, though, so maybe the benefits to gals like me are minimal.  I am however, 41, and that is why I took it in the first place....that and because half my eggs seemed to be incompetent.Yes, I know I am not out of the woods and I have to make sure my HCG doubles by Saturday, and that ladies my age have a higher miscarriage rate, but hey, I am lucky that I made it to a positive beta.Hey mme_z.  You are in Belgium, are you?  I am in Munich, Germany and the doc at my IVF clinic told me he did not believe in DHEA (but I bought some in the States and took it for 3 months anyway.)  I am impressed that other European docs are starting to give it a try. Do not worry about hair loss.  I took 75 mg a day and the loss is minimal, not even noticeable on your head.  Now I am losing no hair at all because I stopped taking DHEA after my transfer last week.  Just like Antitasto said in one of her earlier posts, it is out of your system pretty fast.  Yes, I had a bit of acne but nothing the dermatologist could not handle and absolutely no lowering of the voice at all (I think you have to be on a much higher dosage for that to happen.)  Good luck!Angela",
            "post_id": "3219260",
            "timestamp": "1217440593",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Hi thanks for the tip on baby asprin.My fsh last time tested was 20.2 which i was told was too high also i had anti mullerian hormone of 2.13pmol/  also on an ultrasound scan  an antral follicle count of just 3 .To be honest I don't understand all of this but my doc says all this means i have 'significantly limited ovarian reserve'.I am currently having accupuncture and chinese herbs (behind my docs back because the clinic totally is against them) folic acid,royal jelly, and dhea but also drinking wheatgrass,no caffeine ,less dairy i'm also vegetarian.I started on gonal f 450ml injections yesterday and on saturday i go for a scan fingers crossed for bags of follicles .",
            "post_id": "3220077",
            "timestamp": "1217452166",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Angela - Congrats!!!!  Keeping my fingers crossed for you!  How many embryos did they transfer?  Did the RE say anything about improved quality of eggs?mme_z - I had what felt like was significant hair loss but hubby did not agree.  Acne was like when I was in college...which was not horribIe.  Had some facial hair growth and this also went away when I stopped the medication.  Had palpitations but did not last, was only at the beginning of taking the med.  When I researched taking the medication before I started most everything said that symptoms were reversible.  No voice changes either.Good luck!P",
            "post_id": "3220532",
            "timestamp": "1217459288",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Angela -- I can't tell you how happy I am for you!!!!!!!!!!!  You have been on my mind - sending sticky vibes and all that... you made one of the big hurdles with your BFP and I so hope your next beta numbers keep going up!mme_z -- I'll echo what Angela said regarding the hair loss - it feels like a lot to me, but no clumps or anything (where maybe I'd run my hands through my hair before and occassionally get a strand or two or 10 in the shower, now I always get at least 3-5 and in the shower maybe 30.  Acne isn't that bad (my memories of the teen years are so much worse!); I more notice how greasy my face is and now wash at least twice a day to combat.  No voice change and sadly no increased libido :-/Anitasto - I did talk to my RE about the Estrace, he agreed we'll stop it with AF this time rather than continuing into the cycle with stims.  Also talked about the micro-dose HCG (LH equivalent) - his philosophy was since other meds like Menopure and Bravelle already have LH in them, by adding the micro-dose HCG to Follistim or Gonal-F it's mimicking what those other meds already have.  I'm OK with the theory now, but depending on where my LH is on the CD3 tests, we may discuss again.Just a general vent... sorry... this is what happens when I have too much time in between cycles.... my RE views DHEA as a 'steriod' so he doesn't know I'm taking it and I went to the OBGYN for baseline testing.  Last week I asked to get updated tests and got a hard time since my first tests came back \"in the normal range\" - I said 'yeah, for an 80 year old!' (a bit of an exageration but I got my point across, sure the range may be 35 to 430 but mine measured 46 - so maybe the 80 year old comment wasn't that far off!).  Regardless, the OB won't retest.  So I'm flying blind with what the supplementing has done to my levels.Oh, and... AF hasn't shown up yet which only starts messing with my head (already 3 days later than I would expect it).  I had the most vivid dream last night about having twins after not knowing I was pregnant for 9 months (all came from a news story earlier in the day about women that don't know they're pg until they deliver, unlike me though they are usually very over weight women...anyways, it's amazing what you take into your dreams! lol!).  Oh and yes, I get inside my own head wondering if... but I know the likelihood is next to zero since both tubes are blocked... but how it's messing with me.  Anyhow, all that is why I've stayed of the boards for a few days... trying to find some sanity (and not succeeding!)  Thanks for 'listening' to my rant!Otherwise I'm sticking with the regime of 75mg in the AM plus 25mg in the PM plus my baby aspirin... I'm on day 68 (9.7 weeks) of DHEA... for me that's 3 cycles - which I'm assuming is what the experts / studies seek for optimal DHEA levels in the body - they say 3-4 months but I'm assuming it's cycles of follie / egg growth, so given that I'm getting close to that \"optimal\" time... I sure hope this next cycle is \"THE ONE\"!",
            "post_id": "3221287",
            "timestamp": "1217472016",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "Congradulations Angela! I'm soooo happy for you! Looking forward to hearing if things continue doubling. How many embies did you transfer? You said there were 4 eggs right?We're doing a transfer of 4 embryos to my surrogate tomorrow....these embryos were my first embies on DHEA. I was so disappointed last time that its hard to think about it.Garden - so sorry to hear about your ob. How about your regular physician? I don't know wat the rules are over there but can you go to another ob or physician? If its absolutely not possible another way to play this game is to have an antral follie count scan on CD21 and CD28. I started this after a couple months and when I finally got to the right DHEA dosage (it was like 150mg/day for me) we could definitely see more follies each month. On CD21 there would be like 6 total, then on CD 25 there'd be 8 and CD28 we'd see 10. Maybe your doc won't go for all those scans but he should at least go for the CD28 so you can track how many follies. I'd say when you see at least 2 - 3 more than before you'll be in good shape and have good egg quality.Hang in there babe! You know my pg was 3 days late after my last failed attempt and I thought I was going to loose my mind. I just went ahead in for an HCG test and got my sanity back.Maybe all of us on this site will end up with our little bundles and move to a 'new mom' discussion together. ;) With Angela's PG I'm optimistic for all of us.Baby dust!Anitasto",
            "post_id": "3224033",
            "timestamp": "1217530476",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "I did Royal Jelly too and in one of my cycles (is ate like half a jar a day in my herbal tea) I swore it was making my follies grow faster. ;) That was the 10 eggs cycle too.Thanks so much for posting the AMH! I hadn't heard of it and just went and read its a marker for ovarian reserve kinda like FSH. Do you have your results....can you share what the normal range is on your lab report? After a little hunting it appears I'd have to pay to see a study for normal levels.Also - your FSH (is/was?) 20? Was that your last baseline just before this cycle?Hoping for follies for you! ;)Anitasto",
            "post_id": "3225964",
            "timestamp": "1217563501",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Some info on AMH (supposedly this is to replace the FSH and the antral follicle count as more accurate):http://www.canigetpregnant.co.uk/Anti-Mullerian Hormone (AMH) is a new blood test developed following clinical research which measures ovarian function – how your ovaries are working. It is more accurate than a simple oestrogen test. Currently it is not available on the NHS.It can help reassure women about their current and medium term fertility – important when deciding when to try for children ,especially for women who work. It can also help to predict a likely menopause, and is starting to be used by some clinics to help judge possible IVF success and also as a marker of polycystic ovarian syndrome – a common hormonal condition.http://www.canigetpregnant.co.uk/results.php28.6 - 48.5 pmol/l  You have the green light: You are safe to wait for at least another two years before having children15.7 - 28.6 pmol/l You have the green light: Test result indicating good AMH levels2.2 - 15.7 pmol/l  You have the amber light: You should start to think about having children within the next two yearsLess than 2 pmol/l  You have the red light: If you have been trying for children, please see your doctor",
            "post_id": "3227175",
            "timestamp": "1217599711",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "thanks for that info although i've had the test and was told my results were not good i didn't totally understand the why's and whats",
            "post_id": "3227222",
            "timestamp": "1217600449",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "All,I've still been hanging around listening to the posts, sounds like there are some babies on the way for some of you, awesome news.I was wondering if any of you ever got your Inhibin-B (mine <30) tested.   I got mine tested with my FSH (11.5) and and Estradiol (28).    I had done tons of googling (well maybe not in comparison to some here) and read studies suggesting Inhibin-B was the biggie indicator of ovarian reserve.   I'm just concerned because anything under 45 for Inhibin-B is supposed to be an indicator of poor reserve and poor response and I'm well below that.  I just haven't seen much of any mention of it here.I'm trying hard to get my body healthy: acupuncture, herbs, qi gong, 2 oz. fresh wheatgrass daily (yuk), dhea, royal jelly, spirulina..and others.  I've also started taking some of the Natural Vitality liquid vitamins, cell rejuvinator (MSM) and a product called Calm - ever heard of those or tried them, my chiropractor is totally sold on them.Just looking for some opinions from others, hopefully I'll be cycling in October.Oh and Anita, I also think you should write a book, you have a lot of the info already written down here.   It's just sad that as much as IVF/fertility services cost us we have to be our own doctors and have our own back which unfortunately usually means multiple failed cycles before we learn enough.   I know I've learned enough that I am going to be interviewing doctors/clinics before I make my choice, I'm in the Triangle area of NC if anyone has any opinions of specific clinics if mentioning names isn't a post no-no.Thanx LadiesBetsy",
            "post_id": "3229221",
            "timestamp": "1217632956",
            "user_id": "user_552740",
            "user_link": "/personal_pages/user/552740",
            "votes": "0"
        },
        {
            "answer": "pyar - I wish I could offer some information but I really don't know anything about the AMH (how to interpret results or anything), I just happened to have that link and info from when I was supposed to take it before (we decided not to go with that Dr so didn't have the test).Besty - I'm impressed!  You sound like you have a regular pharmacopia you're taking!  (I can't believe the stack of stuff on my counter - and I'm one who not too many years ago couldn't be trusted to remember to take the Pill every day... now all the tablets etc. are like clockwork!)  Hopefully it all contributes to a great Oct cycle!  Sorry but I'm not familiar with the Nat Vit, MSM, or Calm.ALL -- I keep meaning to post that the Center for Human Reproduction (clinic in NYC and Chicago has done a lot of DHEA studies - probably more than any other US clinic) has a note on their website that they're going to do a DHEA study.  I don't know if this is like other studies where you get reduced prices, but if you're interested and qualify (unfortunately only for women \"under 38 years old\") check it out!Even if you're not eligible / interested - their site has some interesting stuff on it re: DHEA.http://www.centerforhumanreprod.com/about_newsletter_0508.html (towards the bottom of the page / end of the DHEA article):Participants Wanted:As a final news item in regards to DHEA, we are getting ready to launch the prospectively randomized DHEA study in younger women (under age 38) with so-called unexplained infertility, which we previously announced for early 2008. If you are interested in participating and/or are a physician who wants to have one of your patients considered for this (free of charge) study, please contact us.P.S. Wish me luck -- going in for CD3 b/w and u/s tomorrow.  I'm hoping for GOBBS of follies!!! :-)",
            "post_id": "3229587",
            "timestamp": "1217641055",
            "user_id": "user_531774",
            "user_link": "/personal_pages/user/531774",
            "votes": "0"
        },
        {
            "answer": "ok been for my ultrsound today got 2 follicles on left side one = 15 and one = 13.5 the clinic said this is good  and that more than 2 would have been a problem to continue to iui so going for another blood test tomorrow then another scan monday in the mean time they said to keep on the gonal f injections then i think they will do the last injection can't remember what that ones called but it makes you ovulate then they do the insemination then i don't know suppose i just wait just needed  to sound off sorry if i'm going on but never been through this so i don't know if its all well so far because i don't have anything to compare with",
            "post_id": "3232343",
            "timestamp": "1217715855",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Hey Ladies,Sorry, I have tried to read all your posts on DHEA but can't seem to find anything on it's effects for men? Can anyone tell me if it can help men as well? I'm thinking about trying it myself but was wondering if my husband should as well. He has mobility issues w/ his sperm and I was just wondering if this can help in that area, or even increase his sperm count. I have searched the web, but all I find are things about women.",
            "post_id": "3233240",
            "timestamp": "1217737995",
            "user_id": "user_353148",
            "user_link": "/personal_pages/user/353148",
            "votes": "0"
        },
        {
            "answer": "Here was my dh protocol......-25mg dhea/week  (if your dh is young then I wouldn't do it because increased testosterone in men can reduce sperm count. dhea falls off after age 30 so I would think 40 years + is safe and a good idea)-alcohol limited to 2 beers a week and none for 2 weeks before a cycle - reduces sperm count-ORGANIC FOOD - study showed men on organic farms have 2x sperm count and one of my closest friends doing ivf with his wife (guy) tested this and doubled his sperm count in a month on organic food.-no bicycling 2 weeks before he was needed-no golf /he wasn't a golfer but after I read about it he wasn't going to become one either ;)Good luck!",
            "post_id": "3233524",
            "timestamp": "1217748244",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Update on our embryos.So all four of our embryos from our first dhea cycle survived the thaw this week and grew to 8 cell embryos for our day 3 Xfer on Friday.2 embies were 8 cell grade A2 embies were 8 cell grade BThe cycle #3 a full year earlier without dhea we got 4 eggs1-didn't fertilize1-fertilized abnormally and arrested at 2 cells1-arrested at 4 cells1-grew to 7 cells on day 3 and slowed before Xfer thought we did xfer and no pg.My surrogate is staying with us and we're babying her like crazy. She's great and while its tiring, its also fun and rewarding to give back to her. I know surrogacy seems strange and we said we'd never do it when we started this journey. But having perfect embryos on ice after failing my uterus twice and being so sick of research I just wanted them to have a perfect uterous for their best chance. Its hard to know what you'll do until the circumstances are in front of you - ya know? I'm just greatful we have a wonderful, fun, kind surrogate.Garden - just wanted to say THANKS for posting the research! You Rock! :) Look forward to your #s this week. Hang in there baby!Betsy - MISSED YOU! What's happening with you?? Didn't test my Inhibin B (or did I??-have to dig it up maybe) but I read tons about it. I'll post more on it Tuesday ok? Thanks for the book plug! :)Pyar - Sounding good! 2 months of dhea is really good for quality. For now, let's spread baby dust on you. If things don't work then we'll be here for you!.. with all our thoughts and advice. ;) One thing I would say in your situation is I'd stay on the dhea after your IUI if I were you with FSH at 20 and 2 months dhea I'd guess you're just getting to healthy dhea and t levels which you need to be successful.Puglies - are you a mommy yet? you might have said but when ru due?You gals are all really so wonderful. I think we have the best blog going on the I-net.Anitasto",
            "post_id": "3233564",
            "timestamp": "1217750613",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hey Puglies, they transferred 3 because you can only transfer 3 embies in Germany (crazy law, I know) and anyway, one of the 4 stopped developing.  So I got 3: 2 blasts,  and the other one almost to blast.  Went in for my second beta on Saturday.  I was supposed to have doubled and I succeeded.  Am up to 189.7 m IU/ml.  I do not know the significance of the numbers themselves, but the important thing is that I achieved the doubling.I will have to go in for an ultrasound on Friday.  Apparently they can see something by then.Antitasto, congrats on getting a surrogate, but especially congratulations on the thawed embies.Thanks Garden, I will be keeping my fingers crossed for you on the next cycle.  You can do it.  And if your FSH was high, then I have no doubts whatsoever that it will help you.",
            "post_id": "3234595",
            "timestamp": "1217784811",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "Hi Garden, my last comment was referring to DHEA.....(sigh...pregnancy brain already.  I will be a complete idiot in a matter of months).  I do think it helps those in a high FSH situation.  I even think it helped me, but only minimally because I do not have high FSH to start with.Angela",
            "post_id": "3234963",
            "timestamp": "1217791867",
            "user_id": "user_527483",
            "user_link": "/personal_pages/user/527483",
            "votes": "0"
        },
        {
            "answer": "hi everyone!-i have been lurking a few days after being refered to this site by angela. good luck chickie!!!WOW!this is the place i have been looking for!!!i needed numbers and science and you guys are the jackpot.Me 44.5 DH 462 rounds clomid bfn1 iui w/follistem hcg & gnrh bfnmy re is very reluctant and she will not be my doctor in the futurethey haven't tested me on much. i will give that later.i don't think we will have the opportunity for ivf but you never know.my plan is to get tests done in sept and start another clomid cycle w/iui in oct. hopefully i will be using my obgyn... if she is cooperative.i have now been on dhea a couple of weeks. i have also started wheatgrass, l-arginine and baby aspirin. i also take the fertiliaid supps.i have started this month w/basal temps and checking cm. i used lh teststhis week to check for ov. as usual the stripe is light.been ttc over a year now. highest fsh that i'm aware of is 11.i need your guidance if you guys are willing. we can go to private e-mail if u prefer. i'm not in rush because i'm skipping this month because of insurance blip. oh and my insurance does not cover any fertility treatments.i just wanted to introduce myself and let  you guys know i'm here....hanging on every word....andreanew orleans",
            "post_id": "3235938",
            "timestamp": "1217811201",
            "user_id": "user_579306",
            "user_link": "/personal_pages/user/579306",
            "votes": "0"
        },
        {
            "answer": "What wonderful news for both of you!!!  Surrogates are a great way to go and why not maximize your chances if you are able to!The both of you sound like the number of quality eggs were much improved on DHEA.  How very exciting.Doubling of your bhcg is the standard test to check in pregnancy.  Your hormone levels should at least double every two days.  Sometimes even if it does not quite double it can be ok although usually indicates a problem.  You have more than doubled and that is great news.  Your numbers are great!  YEAH!!!  Wouldn't it be fun to tell your doctor about the DHEA if all goes well?Baby dust to you and hopefully you will have a big pot belly to call your own (or surrogates) in a few months.Baby due date this week.  I am ready!GARDEN...keep trying!  I am sorry for the cancelled cycle.  Maybe the extra month will be all the difference in the world!  I will be looking to see your posts for the next cycle!Good luck allP",
            "post_id": "3236062",
            "timestamp": "1217814174",
            "user_id": "user_525437",
            "user_link": "/personal_pages/user/525437",
            "votes": "0"
        },
        {
            "answer": "Thanks so much for the reassurance re side effects of DHEA...started taking them end of last week, so fingers crossed.Also, the link to the CHR article on DHEA was very encouraging reading!![www.centerforhumanreprod.com/about_newsletter_0508.html]Thankyou girls & good luck to all of you",
            "post_id": "3237355",
            "timestamp": "1217856764",
            "user_id": "user_575147",
            "user_link": "/personal_pages/user/575147",
            "votes": "0"
        },
        {
            "answer": "i think i might ask for letrole instead of clomid next cycle. any body have any info?thanksandrea",
            "post_id": "3237941",
            "timestamp": "1217866221",
            "user_id": "user_579306",
            "user_link": "/personal_pages/user/579306",
            "votes": "0"
        },
        {
            "answer": "Andrea - Welcome!All - Hello, hope you are doing well.   Even though I won't be cycling until Octoberish time-frame I think all the recommendations of getting tested regularly is a good idea even if it is out of pocket expense so I'm going to call my PCP office and see if she will order my tests.   So I want to ask for CD3:FSHE2LHDHEA-STestosterone Free and Total (?)is that what I want or is there something I missed?I mentioned in my last post that I started taking MSM (methylsulfonylmethane) the same compound they put in glucosamine and other supplements to help with absorbtion (?).   Anyway, I had my husband start taking it too and even though it's only been a few days we both have a ton more energy.    I'm also hoping it will boost the DHEA effectiveness as well.Does anyone else have any thoughts on the Nurses Health Survey where they discovered that women who had at least one serving of full fat dairy a day were much more fertile than those using nonfat/lowfat dairy products?     One of you with more technical knowledge on DHEA could probably explain how fats and hormones work more than I could.I know the whole dairy and MSM are now on my spreadsheet of herbs/supplements, foods, no-nos, dos and don'ts to boost fertility that I have been keeping as I find things that seem to have a concensus of support.It is really great to have others to talk to about our long and hard quest for baby(s).     Is anyone out there in NC or know anyone who has cycled in the Raleigh/Durham area?Well, past my bedtime so better get my stress relieving bath in and get some beauty sleep.Betsy",
            "post_id": "3240354",
            "timestamp": "1217899177",
            "user_id": "user_552740",
            "user_link": "/personal_pages/user/552740",
            "votes": "0"
        },
        {
            "answer": "don't know whats happening with my post but they don't seem to go through so i'll  try one more time i was just trying to update so here goes againgonal f = 6 days2 follicles = 19 and 17.5next step jab to ovulate then its up to mother natureclinic say results so far good so what can go wrong now not being negative just need to know all senarios.Also orignally clinic doc didn't want to treat me because he expected no response to stims and only went ahead because i insisted. so what i want to know is is it all down to quality now or are there other factors i need to consider what do you think. thanks i hope m message doesn't come through 3 times now",
            "post_id": "3241731",
            "timestamp": "1217937306",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "this was on cbs news yesterday morning  to view copy the link below and paste in your browser.http://www.cbsnews.com/sections/i_video/main500251.shtml?id=4318538n",
            "post_id": "3242036",
            "timestamp": "1217943378",
            "user_id": "user_566175",
            "user_link": "/personal_pages/user/566175",
            "votes": "0"
        },
        {
            "answer": "Hope you are doing well. I wanted to post some follow up labs for you. I have been on dhea for 3 weeks now, alternating b/w 25 and 50 mg/day. I was a little nervous to start on 75/day. These are my cd2 labs from yesterday:fsh 15.4 (last month 9.2)lh 9.7 (last month 6.5)dheas 354 (last month 53)testosterone 105 (last month 48)shbg 66 (last month 60)igf-1 119 (last month 122)I am worried about my fsh/lh spiking. It usually fluctuates and I have had a high of 15 in the past so I dont know if its coincidental or from the dhea. My testosterone/dheas also went quite high in a short span of time. Should I continue or decrease the dose and monitor next month. I have had some palpitations but no other noticeable side effects so far. I am so desperate for something to work as I am a very poor responder. The studies seem so promising, but I dont want to cause any further problems. Thanks again for your input.",
            "post_id": "3243035",
            "timestamp": "1217959282",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Ladies,I just wanted to wish you luck. It is so inspiring to hear about your progress!!Lots of baby dust!!!.Puglies good luck with your delivery. That is sooo exciting!!Also, does anyone know anything about night sweats? I have had this symptom on and off for years now. It got worst with the hormones and treatments. Usually i get them before my period is about to come, probably two or three nights before (starting on day 26, maybe). I have been seeing an acupuncturist 3x/week and have been taking the herbs that she prescribed, this has almost completely controlled it. However this last cycle i had a big sweat on day 21 which is very odd, and i wonder if it is DHEA related as I have been taking it now for 6 weeks on a regime of 50mg/day. Does anyone have a thought about this?chups",
            "post_id": "3248306",
            "timestamp": "1218055572",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hi Betsy. Sorry it took me so long to follow up on the inhibin B question. Turns out I had tested Interleukins as they are associated with attachment of the embryo. So no comparison Inhibin B test for you - sorry.But I did do some digging. You may already know this but...just in case and for others...Inhibin B is secreted by the granulosa cells which are the early cells of a follicle and multiply as it grows. It is very much like measuring FSH...e.g. high FSH then few follies, low Inhibin B then few follies.The good news is that becacuse Inhibin B is secreted by granulosa cells, there's no reason to conclude that a low measurement will result in FEW follies after DHEA ultimately results in MORE GRANULOSA CELLS because it results in more follies.If possible, it would b great if you could get your RE to retest your Inhibin B on Day 3 before your next cycle with your other labs. It should be increased. If your experiment is successful then maybe we dheaers could use inhibin B on day 3 as another marker that the dhea is working.http://www.medvet.umontreal.ca/crra_ang/CAP_inhibine.pdfHope this is helpful my dear.Anitasto",
            "post_id": "3248813",
            "timestamp": "1218063610",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi Anitasto,I was reading your last post and you mention \"Interleukins\", What is that? I think my main problem might just be related to embryo implantation...Once again, good luck with your transfer. It is very inspiring to hear your story with your surrogate...All the best,chups",
            "post_id": "3249268",
            "timestamp": "1218071223",
            "user_id": "user_553167",
            "user_link": "/personal_pages/user/553167",
            "votes": "0"
        },
        {
            "answer": "Hi AnitastoI have just had",
            "post_id": "3250402",
            "timestamp": "1218099831",
            "user_id": "user_567541",
            "user_link": "/personal_pages/user/567541",
            "votes": "0"
        },
        {
            "answer": "Oops - sorry about that - i was writing:i have just had a day 19 BT of a natural cycle - and my levels are:e - 100p - 0LH - 11Clearly I am not ovulating - but I am also worried about how low my e is....does anyone know if this is really bad - should I be worried - and how worried?  I have been on dhea for 2 months and thought that it would help with my natural cycle.......does anyone understand what it really means for my hormones to be at this level on day 19 of a cycle??On a positive - it has been great to read of some BFP's on the thread - congratulations!!",
            "post_id": "3250411",
            "timestamp": "1218100129",
            "user_id": "user_567541",
            "user_link": "/personal_pages/user/567541",
            "votes": "0"
        },
        {
            "answer": "I wanted to add some further labs that were pending initially. My free testosterone is 1.5 (range 0-2.2) and my dhea is 2647. I'm not sure what matters more- the free or total testosterone?  At this point I have decreased my dose to 25mg/day. I know most re's dont even check labs of patients on dhea, so I cant find any data about how soon or what a normal response is to it. I think you wrote your levels went quite high, was it this quickly?",
            "post_id": "3251026",
            "timestamp": "1218119187",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Dg223,First of all – great job on keeping up with your blood levels. I know you’re nervous, I was totally nervous too. But before going into detail, just want to start by saying that I think you’re ok and don’t need to change anything right now.That said….here are my thoughts…An excerpt from Casson’s study “DHEA supplementation enhances serum free IGF-I concentrations by ~150%, probably independently of changes in GH secretion”I looked this up because your IGF-1 is going up and SHBG going down even though slightly there should be a more marked change to the opposite. I looked at my own labs historical spreadsheet of bloodwork and then remembered – IGF-1 oscillates with your cycle.  My IGF-1 was close to baseline on CD3 but increased about 150% on CD21. Forexample, my first IGF-1 on 11/14 CD3 was 152. On 12/01 CD21 it was 215. Ithen had a cyst and cycle messed up but next compare…cd21 on 12/19 it was 200 and then on cd3 01/02 it was 160. Soooo…I’m not surprised based on that if your IGF-1 didn’t increase. However, it would be nice to see your SHBG go down. This is not so critical, however, as long as your Free Testosterone is going up. SHBG binds up hormones and keeps them from acting on other cells…not so great…but you probably have higher free T so shouldn’t be a big deal.SO – if possible – ask your sis to call the lab and add on T free (just fyi always request T free and total) and E2.The reason for E2 in particular is…it may explain why your FSH zoomed so high. It’s kind of like clomid. Clomid works by blocking estrogen receptors in the brain so it shovels out FSH which gives you more follies. With high T, as I’ve said here before, I believe your true baseline E2 goes down. In my case it once went like in the teens and at the same time my FSH shot up to 15. We handled it by putting on Vivelle dot patches/estrogen patches at 15 days into my cycle. This prepped the ovaries by quieting them down before the cycle, and also stabilized my fsh to its tue baseline of about 4.1 when my T was around 100.Just one more thing, if your sis can get the lab to do it, ask for GH and free IGF-1. I’m partially curious but also if the others don’t come back as expected it will be more info.The palpatations are ok, I had them for quite a while at that range when I first started before my body adjusted. Be sure you are taking baby aspirin at least twice a day and drinking PLENTY of fluids to offset the added blood thickening that occurs with dhea and greater red blood cell count.Most important. Relax. Don’t drink alcohol or extra sugary stuff and after you ovulate ask for the Vivelle dot patch….I wore 2/day as it took that much to keep my hyperactive ovaries quiet. I tried oral estrogen but it didn’t do it.Last but not least – have your DHEA-s and T drawn again in about a week. If your T goes over 150 then I would step it back. I suspect thought that you should be leveling off at or below 120.Hang in there babe! You’re doing great! :)Anitasto",
            "post_id": "3253475",
            "timestamp": "1218155429",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hello well i had my iui on wednesday and now we wait 3 weeks i really don't know how to feel at the mo i'm just trying to not let it take over everything everyday its so hard i don't want to be too excited and build my hopes up too high just to come crashing down but at the same time i don't want to be negative has anyone any tips on how to keep the right balance sorry for going on i just needed to off load",
            "post_id": "3256220",
            "timestamp": "1218217954",
            "user_id": "user_574229",
            "user_link": "/personal_pages/user/574229",
            "votes": "0"
        },
        {
            "answer": "Thanks so much for your advice. I forgot to add that my estradiol was 24, pretty low. Interesting about dhea lowering e2, I hope that is why my fsh spiked. After I did clomid years ago, my fsh also spiked to 15 and it seems my hypothamus never \"readjusted\" itself. I know I have a low afc and am a poor responder, so it probably unmasked the issue. I was able to conceive easily before clomid. I wonder if more estrogen in my luteal phase will help to keep my fsh down and thus better egg quality? I'm glad you told me you did this along with continuing the dhea. I wasnt sure about adding in more hormones.  Again ,thanks for the reassurance as i was worried sick all week about my labs.",
            "post_id": "3256533",
            "timestamp": "1218222855",
            "user_id": "user_531962",
            "user_link": "/personal_pages/user/531962",
            "votes": "0"
        },
        {
            "answer": "Sorry it had taken me so long to respond. Just a comment on your last post - I wouldn't reduce your dhea if I were you until you get another reading and its going 'way' high. Also, I presume you're taking your dhea in the am? Just curious because you info would then support my hypothesis that your body really only uses the am intake/or is most receptive that time of day.YES - when my body got the right dose of DHEA it responded in less than 2 weeks with increased T that then leveled off and stayed there. My T first leveled around 40 then around 100, both were completely dose dependent. So if you've been on it a while you could be leveling off. But again, its important to recheck like within a week. You don't want to cut your dose in half and loose the T you've gained. Another option is to take the 2nd 25mg at night. i believe that's like taking a half dose. You have time to work this out before your cycle and you 'could' just get your T and DHEA-s blood to reduce cost.Another thing I found is that it appeared over time my body had the capacity to lose sensitivity to the DHEA. Another reason I caution about going down in dosage because it could take more to get back where you are. This isn't the case for everyone I'm sure...just something to consider and more reason to see if you're continuing to climb before reducing your dose.SOrry for the long post. Just feel bad itstaking me a while to get to folks questions so I'm spending less time editing. ;0Cheers Babe!Anitasto",
            "post_id": "3256947",
            "timestamp": "1218230168",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Oneforme:Check out the blood work that Dg223 is doing. Of those, I think its most important that you're on 75mg to start for 2 weeks, check your Dhea-s and T to e sure its being absorbed, and get it up over 80 and keep it there as early as possible. Your quality won't go backward from here I think while you're on dhea, but because of age its really important for you to make sure its working as expected to avoid any loss of time. DH and I lost 6 months until we knew how to test and be sure it was working. Doh!Good luck!BetsyJI think anything with the letters 'meth' in it will likely give you more energy as meth is a stimulant.  Same thing with anything that has 'phen' in it. I could be wrong about this but I think its the most likely reason you have such quick energy.Fat retains hormones is my understanding which is why I think women who eat dairy with fat are more likely to eat other things with fat and more likely to be fertile mertile. Just a postulation though.Pyar -I know this is late and you've probably already had xfer, but the reality is yes...at this point you're down to quality I believe unless there is any kind of implantation issue. Chups has asked about that so I'll come back to that topic later and share what I understand on inhibins and interleukens.ChupsIts possible that your cycle is getting shorter. I say this because if you say you usually sweat when your period begins and for me and others here DHEA shortened our cycles by up to 6 days...that's one possibility. The other is maybe your PG and your body is reacting. I myself have had night sweats off and on for the past 20 years literally. Alot of times its emotional stress (sweated buckets for months after my brother passed away - that was when it started). There are other issues associated with night sweats including diabetes but that has lots of other symptoms too and I would think would be consistent and increase consistently.Hope this is helpful.Hope02 - I gotta run now but I'm thinking on your info and will come back. Simple thoughts are late ovulator because e-100 is ovarian active and likely a folly and LH=11 is up there too. Did you post your age and other info? The more the better...OK - more later my fellow dheaers. Sorry for the delays everyone. I'm glad there are more coming along and trying dhea. I really think it helps of course. My mind has just been pre-occupied with this 2ww and researching hcg levels/betas etc.",
            "post_id": "3257056",
            "timestamp": "1218231985",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Hi AnitastoYou are a godsend for helping us all out with your knowledge - honestly you should start charging for your services!!As for more info on me - my life story and stats in a paragraph (or two)Went on the pill at age 15 as was getting a period every 2 weeks.  Went off the pill at age 20.  Within 6 months back to bleeding every two weeks (and not just some light spotting) so went back on the pill - took 7 pill changes before I found one that could stop the period every 2 weeks - Diane 35.  Dr's said that the period every 2 weeks was a great thing - it meant that I was super fertile!!!!  Stayed on the pill until I met my husband - he has a rare skin condition -epidermolysis bullosa - has the dominant condition and is a carrier of the recessive - I havent been tested for the recessive but chances are slim that I would have it - tis a death sentence for our child if I do.  We explored IVF PGD for genetic purposes only as my husband felt strongly about not passing his skin on.  No known fertility issues.  In fact I still thought i was 'super fertile'!!  First IVF cycle in April 08 (I am 32 and my husband 28) - long down reg cycle - FSH doubled after 3 days to 300u as I was not responding - cycled cancelled after 8 days stimming.  Period arrived 6 days later (this didnt surprise me with my history though my FS was surprised) Cycle 2 antagonist started on first day of period - after BT which showed my hormones had baselined.  Cycle 2 cancelled after 4 days due to oestrogen producing cyst.  Trigger injection given and period arrived 10 days later.  Cycle 3 started - antagonist - 300u daily from the start - got to EPU - 8 follies, 6 eggs, - of these: 1 was 'cracked', 2 were immature, 2/3 that fertilised were abnormal despite the ICSI (1 had 3 pronuclei and the other 1).  The final egg got to 5 cells was fragmenting badly and didnt go furhter.  Dr said that things werent looking and that we needed to prepare ourselves for not having our own children - said that to get 3 pronuclei doing ICSI was highly unusual.  She also said though that she wasnt out of ideas and suggested I try DHEA.  I guess the fact that we know that 50% of our embryos will have my husbands condition means that we really need more eggs - or will need to do lots of cycles - we are prepared for this, now.  We then almost immediately started cycle 4 - my FS said that we could take a break but she thought that the FSH in my system from the last few cycles could also help with quality - I also immediately started taking DHEA 75mg (even though Dr only prescribed 50mg a day - I had found this post within days of starting the dhea)  I have been having 50mg in the morning and 25mg at night - not sure if I should change this to all inthe morning??  Cycle 4 - long down reg - started on 400u daily FSH.  Again had 8 follies - 4 eggs at EPU - all 4 fertilised normally, 2 made it to the necessary blastocyst stage by day 6 for biopsy and were good enough quality for biopsy (though were rated fair not good) - 1 was unaffected and transferred - BFN.  I stopped taking the DHEA on the day of EPU under my Dr's advice but recommenced as soon as I got the BFN - was only off it for about 2 weeks in total.  EPU for this cycle was on July 4 - I am now getting ready for cycle 5 - and was going to start the lucrin on Monday - however my BT results came back at E - 100, LH - 11, and P - 0 :  which my Dr says is baseline.  Hence as of yesterday I am now back on the pill and still taking the DHEA.  I dont know what it means at all that I have been on DHEA for a couple of months now with only a short break and my hormones are so low on day 19 of a natural cycle???Anyways - wow what  a post - I think that is pretty much all the info that i can give you (other than that my husbands swimmers have been tested and are all really good - so any issues it would seem are with me) - any thoughts you have or possible solutions would be greatly appreciated.  Thanks again for your help.  HOpe",
            "post_id": "3257940",
            "timestamp": "1218248754",
            "user_id": "user_567541",
            "user_link": "/personal_pages/user/567541",
            "votes": "0"
        },
        {
            "answer": "All of the information posted is very helpful. Even though a lot of the abbreviations don't mean a lot to me. Let me tell you my story...I am 42 years old and am considered obese. I finally married for the first time at the ripe old age of 39. My husband had been married previously, but had never had any children. Before marriage I had resigned that I would be a single, childless spinster. After marriage, we could think of nothing else.We went to the doctor, and were given the odds (due to my weight). My husband was tested and given thumbs up on count and motility (and something else, but I have forgotten now). However it was discovered that I do not ovulate every month.My doctor prescribed Clomid. which we took for over a year and nothing happened. Then in August of last year, my doctor was on vacation and the on-call-doctor refused to refill my prescription (said she found no evidence of it, which really made my doctor mad when she returned). When it came time for my cycle to start in Sept, I didn't. I was pregnant. Unfortunately, it didn't last for very long. I miscarried 2 days before our 2nd anniversary (great gift, huh?)We were devastated and heart-broken. But my doctor assured me that we did this on our own, and that means we could do it again.Well, it's been almost a year since the miscarriage, and nothing. I was afraid to go back on the Clomid because I had heard that it could cause cancer. But my doctor tells me that there is no evidence supporting that. I start taking Clomid again this Sunday, and have started taking DHEA today (after reading everything I can possibly find on the subject)I have not told my doctor about the DHEA, but I have an appointment to see her on the 18th and will discuss it with her then. I am a little afraid of what she might say, but I really can't waste anymore time. At the rate things are going, I will 50 before I get pregnant! But I have faith in God and medicine! In the meantime I will continue to read this thread. It is very inspiring.Keep your fingers crossed that we can do this!prg5266",
            "post_id": "3257965",
            "timestamp": "1218249320",
            "user_id": "user_584502",
            "user_link": "/personal_pages/user/584502",
            "votes": "0"
        },
        {
            "answer": "Hope02,Thanks for posting your story. It sounds like you’ve really been through the ringer. It does sound though like the DHEA made a difference in your last cycle. And its so great that your RE recommened it for you. Whatever the issue with your current levels whether annovulation or lack of progesterone production, it appears your IVF is overcoming these so I hope you can take comfort in that. Below are comments and questions for you to see if we can draw some conclusions together.“I dont know what it means at all that I have been on DHEA for a couple of months now with only a short break and my hormones are so low on day 19 of a natural cycle??? “Your E2 seems fine for a single follicle. Your P=0 just means you didn’t ovulate….as I’m sure you understand. This can happen on DHEA too, especially if you had a tendency to be annovulatory prior to DHEA. I believe this happened to me in 2 cycles on DHEA. Your LH level just means you haven’t yet or aren’t going to ovulate. Again, not so surprising if you didn’t ovulate before DHEA. Why are your cycles 2 weeks? Typically it’s a luteal phase defect and either your ovulating but producing no progesterone or not ovulating at all.If you weren’t ovulating before or have a luteal phase defect then DHEA will not ‘necessarily’ always repair this, but IVF can overcome it. It would be good to confirm this either way though.Here are some questions for you..1. What were your baselines in the past on day 3ish for FSH and E2?2. Have you ever done a home LH test to verify ovulation? If you don’t ovulate, then of course you wouldn’t have Progesterone. But its possible to ovulate and have little to none. LH is also valuable for egg quality and…given your quality….I’m curious. These are cheap at Walmart …… if you haven’t tried this before…if you start testing now we could see if you get to ovulation before your flow.3. Was your progesterone ever tested at any time during your short cycles prior to ivf? A lot of women are short on progesterone and have shorter cycles and its easily solved with supplements. I’m sure you probably know this stuff but just wanted to cover the bases.4. Have you had any BW on DHEA, DHEA-s and Testosterone (T)? This will also be helpful. I’m guessing these are low for your age because of quality and you’re still getting 8 eggs as a reflection of your age….so its not terribly low like us old timers here. ;)5. Do you workout a lot…how much?6. Do you drink….how much?7. Are you particularly lean?I don’t know but, like dg223, you’ve peaked my interest and I’ll stay with you in trying to solve the puzzle if you feel determined.I’d love to get paid for this….if you or anyone you know has a link to a publisher please feel free to put us in touch. I’ve drafted 6 chapters so far. ;)Look forward to your info.Best,Anitasto",
            "post_id": "3258462",
            "timestamp": "1218260278",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        },
        {
            "answer": "Couple of info bytes on follicle growth to help understand why DHEA and T help us out….Follicles are predominantly composed of Testosterone until they are about 7-8mm after which they convert to Estrogen dominance. (This is why I think baseline follie scan should show all follies at or below 7mm instead of 10mm…10 is not optimal and those follies have already begun synthesizing FSH and will horde it from the others generally speaking. This is especially true if you tend to have lead follicle(s)). The follicular fluid, in addition to T, also has DHEA and other goodies. The only T that can go into these guys is Free Testosterone since the rest is bound to Sex Hormone Binding Globulin (SHBG). If you exercise A LOT, your T can be lowered by synthesis to proteins to build or repair muscles (anyone please correct me on this if I’ve stated it wrong or not fully enough). I tested it also after workout and then when I wasn’t working out. My Sunday 20 mile bike race dropped it in half two times in a row. So I quit that….though probably should have still done like 5 miles for circulation….and it climbed and maintained at over 80 pg/ml. I tested the effect of alcohol also and it dropped my T by 2/3 after like 5 shots of rum. There’s not a lot of literature on this but there was some.",
            "post_id": "3258471",
            "timestamp": "1218260627",
            "user_id": "user_416227",
            "user_link": "/personal_pages/user/416227",
            "votes": "0"
        }
    ],
    "post_id": "2420380",
    "question": "hi all.  has anyone who had prior failed IVF, used DHEA after that and become pregnant.  Im almost 40 and had a failed IVF.  I've read on other forums that DHEA helps when you are aging.  Any suceess stories out there please.thanksOvary",
    "timestamp": "1201510113",
    "title": "DHEA and IVF",
    "user_id": "user_401655",
    "user_link": "/personal_pages/user/401655"
}