{
    "answers": [
        {
            "answer": "tengo 28 anos y tengo un ano con dolores de espalda y pecho, me han echo radiografias y me han chequeado mi carazon y todo  sale bien y hay dias que no aguanto el dolor.me podrian orientar,que estudios pedirle al  doctor.gracias",
            "post_id": "4718965",
            "timestamp": "1249058582",
            "user_id": "user_988406",
            "user_link": "/personal_pages/user/988406",
            "votes": 0
        },
        {
            "answer": "Hola anny!!! tan solo queria contarte que yo llevo 5 años de menos a mas con tus mismos sintomas. Hasta el punto de ser ya insoportable, me dan nos dolores muy intenos: dolor pecho, espalda, brazos, mandibula, mareillos, no puedo hacer bien deporte.... eso si ningun medico me sabe decir lo qu tengo, ni tratamiento por supuesto. Solo pastillas que no me hacen practicamente nada. Probare de aqui un par de meses terapias de hipnosis a ver que tal.Un fuerte abrazo de uno que esta igual que tu :)",
            "post_id": "5015562",
            "timestamp": "1256589850",
            "user_id": "user_1087061",
            "user_link": "/personal_pages/user/1087061",
            "votes": 0
        },
        {
            "answer": "hola, yo llevo dos años con un dolor en el pecho y los costados, en la espalda mas por el lado izquierdo y bueno,  el medico dise que se debe a las preocupaciones , qeu esta mas ligado a lo emocional , pero realmente duele. el dolor es que como que quema o como que los nervios estan recogidos.    me hise un electrocardiograma y el medico dise qeu esa muy normal ,    me recomendo qeu hisiera ejercicios de estiramiento  y que en lo posible nadar.bueno ese es mi aporte***@****ese es mi correo para los que  quieran agregarme y comentar sobre los sintomas y compartir comentarios al respecto.",
            "post_id": "5106561",
            "timestamp": "1258922721",
            "user_id": "user_1116836",
            "user_link": "/personal_pages/user/1116836",
            "votes": 0
        },
        {
            "answer": "yo tengo lo mismo sintomas con un dolor en la espalda. en el pulmon derecho. tenho un anos. y el dolor sigue creciendo y los rayos x no salen nada. no se que hacer",
            "post_id": "5216211",
            "timestamp": "1262143216",
            "user_id": "user_1153555",
            "user_link": "/personal_pages/user/1153555",
            "votes": 0
        },
        {
            "answer": "Hola dios o aquel que tuvo la brillante idea de crearnos.Aparte de este dolor insoportable en el pecho que por lo que veo no soy el unico y al parecer ninguno de nosotros tenemos algo, no que va tan solo tenemos un horroroso e insoportable dolor que nos hace de esta \" maravillosa vida\" mas \" bonita\".La cuestion es que llevo desde peque con todo tipo de dolores a veces musculares a veces de  huesos y a veces emocionales y los medicos siempre me han dicho \" bueno pues estas perfectamente\" !!!! Y UNA MIERDA!!!!!! estoy jodido, si no valen para nada para que hemos creado este sistema \"tan bueno\" si no son capaces de curar nada.Muchas gracias creador del cielo y de la mierda por crearnos, te quedaste agusto he???? la clavaste.",
            "post_id": "5600189",
            "timestamp": "1271924375",
            "user_id": "user_1288772",
            "user_link": "/personal_pages/user/1288772",
            "votes": 0
        },
        {
            "answer": "hola  io  igual  que ustedes  desde  kasi  ia  tres a nos  aprox  tengo  un  dolor  a  la  altura  del  pecho  espalda  i  pecho  lado  izquierdo  en  las  noches  no  puedo  dormir  del  dolor  tengo  22  anos  i  ia  paresco  una  nasiana  kon  este  padecimiento  a  veces  me  duele  el  cueyo  i  los  hombros  pero  ese  dolor  claramente  es  tension  puedo  identificarlo  sinembargo  el otro  dolor  es  algo  profundo  me  acuesto  boca  arriba  respiro  i  me  duele  me  toco  i  me  duele  algo  extrano  espero  i  no  sea  algo  grabe  no  se   que  pueda  ser",
            "post_id": "5858222",
            "timestamp": "1277964709",
            "user_id": "user_1365944",
            "user_link": "/personal_pages/user/1365944",
            "votes": 0
        },
        {
            "answer": "me pasa amy, mas de 2 años practicamente co ese dolor igual a ustedes.fui al medico me hicieron examenes del riñon, sonogramas, colecta de orina de 24 horas,laboratorios, ect... todo salio bien tal parece que ese maldito dolor acompañado de otros en la espalda baja y alta, son discosherniados o nervios pillados, ahora me mandaron hacer un ct. veremos que pasa.vayan al medico no siempre los dolores es lo mismo. OK.",
            "post_id": "6068968",
            "timestamp": "1282773145",
            "user_id": "user_1425397",
            "user_link": "/personal_pages/user/1425397",
            "votes": 0
        },
        {
            "answer": "Hola, yo llevo casi los mismos sintomas que describen los chicos aqui, comence hace 2 años y medios pero como estaba embarazada no pude hacer nada, cuando nacio mi gorda le comente los dolores a mi profesor de enfermeria(es Dr.Clinico, y medico generalista, traumatologo y no se que mas), y me dijo que los sintomas que presentaba era CONDRITIS, con diclofenac e Ibrupofeno se me pasaria el dolor y que tomara solo cuando me estan dando los dolores, ya que él llegaba a la conclusion de los años que venia sufriendo ya era cronico. Por ahora no puedo seguir haciendome otros estudiso pero si en algun momento le llegan a dar en el palo, les aviso. Hasta ahora lo mas probable es la Condritis. Exitos y que sigan bien.",
            "post_id": "6422325",
            "timestamp": "1291531145",
            "user_id": "user_1525602",
            "user_link": "/personal_pages/user/1525602",
            "votes": 0
        },
        {
            "answer": "Hola , yo presentaba el mismo dolor justo en medio del pecho y atras de la espalda justo abajo del brazo en medio cuando alzaba los brazos me dolia muy duro en el pecho no podia dormir tenia k estar doblado a la par de eso tenia un dolor muscular en la espalda  al lado de la  columna fui al medicome dijo k era tension  q me relajase me receto ibuprofeno y orfenadrina B y k no cargara mucho peso ya k mi trabajo me exige cargar peso y k no ande doblandome ni haciendo malas posturas  ,segui sus indicaciones , y me paso  casi despues d un mes de seguir sus indicaciones , espero les ayude",
            "post_id": "6710424",
            "timestamp": "1299444121",
            "user_id": "user_1626913",
            "user_link": "/personal_pages/user/1626913",
            "votes": 0
        },
        {
            "answer": "Hola ami me acaban de empezar unos dolores en el costado izquierdo de la parte alta de la espalda pero no lo tengo constante solo me da unos minutos y de repente, bien puedo estar sin moverme y me da el dolor es muy intenso y sofocante y cuando pienzo que ya no soporto mas desaparece completamente, tambien en la pantorrilla izquierda me pasa lo mismo pero ahi si lo tengo constante, estoy tomando medicamento para la presion alta pues acabo de tener una cesarea por preeclampsia no se si tena algo que ver.",
            "post_id": "6918670",
            "timestamp": "1305809083",
            "user_id": "user_1689527",
            "user_link": "/personal_pages/user/1689527",
            "votes": 0
        },
        {
            "answer": "yo tengp ese dolor igual q ud por lo general me da en las noches y no me deja dormir lo peor es q primero me daba en el  hombro y brazo izquierdo y hy lo tengo en los dos hombros me duele mcho me vesti para ir al medico y me senti asfitsiado luego me sente en la compu y me relajey aqui estoy jeje no se que hacer",
            "post_id": "7106299",
            "timestamp": "1311931403",
            "user_id": "user_1750830",
            "user_link": "/personal_pages/user/1750830",
            "votes": 0
        },
        {
            "answer": "cuando se realizan estudios para descartar enfermedades serias, y salen todos los redultados bien....mmmm!!!!!!. podemos entonces pensar que  nos hace falta relajarnos y tomar la vida y situaciones con mas tranquilidad.......habeces por nada nos alteramos y preocupamos y de nada sirve..yo creo hay mas que ocuparnos y entonces todo fluira.por una preocupacion se altera nuestra espalda mente y corazon, y con una sonrisa vivimos mucho mas tiempo.",
            "post_id": "7220737",
            "timestamp": "1315446950",
            "user_id": "user_1794311",
            "user_link": "/personal_pages/user/1794311",
            "votes": 0
        },
        {
            "answer": "Hola espero que se encuentren bien ,yo tengo el mismo problema y he hido al doctor y me han hecho barios examenes y todo esta bien .Nuestro problema es de estres ,entre mas le pones atencion al dolor mas te duele ,por eso ignoralo aunque te duela y mejor si no te tocas el pecho y veras que despues de unos dias se te quita , yo se que no es facil pero si funciona mi correo es ***@**** por si gustas escribirme para contarme .Todo es psicologico es sorprendente cuanto dolor sientes al enfocarte en el problema",
            "post_id": "7523889",
            "timestamp": "1324709886",
            "user_id": "user_1952892",
            "user_link": "/personal_pages/user/1952892",
            "votes": 0
        },
        {
            "answer": "http://www.youtube.com/watch?v=bN_TcfnYgjc    un video de una clinica de la columna en df y guadalajara sale en el programa de tercer milenio con jaime mausan que ah curado a muchas personas que padecian dolores incapacitantes espero les sirva y puedan liberrarse de ese dolor saludos1.Receta para un baño aromático para disminuir el dolor: Prepara un baño de agua caliente y echa al agua 250 gr. de sales de Epsom, 5 gotas de aceite esencial de mejorana, 5 gotas de romero y otras 5  de lavanda. Una nota importante, previamente tenemos que echar los aceites esenciales en las sales de Epsom, diluirlos  y después echarlos en el agua de baño.2.Otro remedio clásico es un buen baño de sal gorda y si es perfumado mucho mejor, también le podéis aplicar algún aceite esencial relajante, por ejemplo lavanda o verbena.3.Se hace una infusión de tomillo o de romero, se deja reposar unos minutos y se cuela. Se mezcla con arcilla, puede ser verde o roja, hasta que tenga una densidad parecida a un puré o crema. Se aplica a la zona afectada directamente y caliente, pero con sentido común, que no le haga daño a la piel. Lo dejamos unos 20 minutos. Una vez que se limpie la zona debemos echar algún tipo de pomada o aceite.4.Un remedio natural chino. Envuelve una raíz de jengibre con hojas de col y ponlo a asar 1 hora en el horno. Una vez hecho esto, se corta en cachos la raíz. Ponemos las rodajas calientes en la espalda, en la zona donde tenemos dolor y lo sujetamos con una gasa. Nos lo dejamos al menos durante 20 minutos.5.Usa un gel o ungüento de árnica, alivia el dolor y la inflamación. Debemos aplicárnosla en la zona del dolor, eso si nunca se debe aplicar en una herida abierta.6.La aromaterapia puede ser un gran aliado para disminuir el dolor muscular, los aceites esenciales como el alcanfor, jengibre, romero, tomillo, lavanda, etc. Estos aceites esenciales podremos usarlos en aceites de masaje o baños aromáticos.7.Debemos hacer ejercicio para fortalecer la espalda y estirarnos bien, antes y después del ejercicio y realizar un ejercicio suave. Probad con el yoga, tai chi, pilates, natación…8.Los estiramientos de cuello y de espalda son muy beneficiosos. Por supuesto, mientras estamos en frente del ordenador no debemos olvidarnos de descansar 5 minutos cada hora y estirar bien todo el cuerpo, hay muchos ejercicios que se pueden hacer sentados en nuestra silla de trabajo. Y, por último, es muy importante vigilar nuestra postura al trabajar y a lo largo del día.9.La hidroterapia es una buena solución, si es posible acudid a un SPA o balneario urbano, los chorros de agua y su temperatura os ayudará notablemente a encontraros mejor.Tenemos que tener en cuenta que estos remedios debemos usarlos con carácter preventivo o después de una buena terapia o masaje.Para disminuir el dolorUna mezcla de ulmaria, sauce y harpagofito nos ayudará a disminuir el dolor y la inflamación que podamos tener en la zona dañada. Podemos tomarlo tanto en infusión, extracto o en cápsulas. Eso si, debéis saber que las plantas medicinales tardan un poco en hacer efecto con lo cual no tienen un efecto inmediato y hay que tomarlas varios días seguidos o semanas, en función del caso.Contracturas crónicasSi padecéis de manera regular de contracturas, sobre todo por la tensión del día a día y no suelen mejorar fácilmente, os recomiendo que depuréis vuestro hígado con plantas como la alcachofa o el cardo mariano. En medicina tradicional china el hígado es quien controla los tendones y muchas veces es en parte culpable de algunas contracturas.",
            "post_id": "7550220",
            "timestamp": "1325596159",
            "user_id": "user_1966439",
            "user_link": "/personal_pages/user/1966439",
            "votes": 0
        },
        {
            "answer": "http://www.youtube.com/watch?v=bN_TcfnYgjc    un video de una clinica de la columna en df y guadalajara sale en el programa de tercer milenio con jaime mausan que ah curado a muchas personas que padecian dolores incapacitantes espero les sirva y puedan liberrarse de ese dolor saludos1.Receta para un baño aromático para disminuir el dolor: Prepara un baño de agua caliente y echa al agua 250 gr. de sales de Epsom, 5 gotas de aceite esencial de mejorana, 5 gotas de romero y otras 5  de lavanda. Una nota importante, previamente tenemos que echar los aceites esenciales en las sales de Epsom, diluirlos  y después echarlos en el agua de baño.2.Otro remedio clásico es un buen baño de sal gorda y si es perfumado mucho mejor, también le podéis aplicar algún aceite esencial relajante, por ejemplo lavanda o verbena.3.Se hace una infusión de tomillo o de romero, se deja reposar unos minutos y se cuela. Se mezcla con arcilla, puede ser verde o roja, hasta que tenga una densidad parecida a un puré o crema. Se aplica a la zona afectada directamente y caliente, pero con sentido común, que no le haga daño a la piel. Lo dejamos unos 20 minutos. Una vez que se limpie la zona debemos echar algún tipo de pomada o aceite.4.Un remedio natural chino. Envuelve una raíz de jengibre con hojas de col y ponlo a asar 1 hora en el horno. Una vez hecho esto, se corta en cachos la raíz. Ponemos las rodajas calientes en la espalda, en la zona donde tenemos dolor y lo sujetamos con una gasa. Nos lo dejamos al menos durante 20 minutos.5.Usa un gel o ungüento de árnica, alivia el dolor y la inflamación. Debemos aplicárnosla en la zona del dolor, eso si nunca se debe aplicar en una herida abierta.6.La aromaterapia puede ser un gran aliado para disminuir el dolor muscular, los aceites esenciales como el alcanfor, jengibre, romero, tomillo, lavanda, etc. Estos aceites esenciales podremos usarlos en aceites de masaje o baños aromáticos.7.Debemos hacer ejercicio para fortalecer la espalda y estirarnos bien, antes y después del ejercicio y realizar un ejercicio suave. Probad con el yoga, tai chi, pilates, natación…8.Los estiramientos de cuello y de espalda son muy beneficiosos. Por supuesto, mientras estamos en frente del ordenador no debemos olvidarnos de descansar 5 minutos cada hora y estirar bien todo el cuerpo, hay muchos ejercicios que se pueden hacer sentados en nuestra silla de trabajo. Y, por último, es muy importante vigilar nuestra postura al trabajar y a lo largo del día.9.La hidroterapia es una buena solución, si es posible acudid a un SPA o balneario urbano, los chorros de agua y su temperatura os ayudará notablemente a encontraros mejor.Tenemos que tener en cuenta que estos remedios debemos usarlos con carácter preventivo o después de una buena terapia o masaje.Para disminuir el dolorUna mezcla de ulmaria, sauce y harpagofito nos ayudará a disminuir el dolor y la inflamación que podamos tener en la zona dañada. Podemos tomarlo tanto en infusión, extracto o en cápsulas. Eso si, debéis saber que las plantas medicinales tardan un poco en hacer efecto con lo cual no tienen un efecto inmediato y hay que tomarlas varios días seguidos o semanas, en función del caso.Contracturas crónicasSi padecéis de manera regular de contracturas, sobre todo por la tensión del día a día y no suelen mejorar fácilmente, os recomiendo que depuréis vuestro hígado con plantas como la alcachofa o el cardo mariano. En medicina tradicional china el hígado es quien controla los tendones y muchas veces es en parte culpable de algunas contracturas.",
            "post_id": "7550224",
            "timestamp": "1325596262",
            "user_id": "user_1966439",
            "user_link": "/personal_pages/user/1966439",
            "votes": 0
        },
        {
            "answer": "yo tambien tengo este dolor en la espalda y pecho...pero en mi caso mis bronquios estan inflamados...segun los rx...la tomografia dice casi lo mismo ...pero añade normal...tenia anemia pero ya no la tengo...tengo carraspera....que no se pasa...y me falta aire cuando camino rapido...tambien he hecho malestar estomacal...cuando me recupero de lo estomacal...me vuelve lo de la espalda...que sera no ..lo se...los médicos me dicen que estoy que es alergico...pero  me siento mal...hasta la sicologa me ha dicho que es mi mente...pero las flemitas de la carraspera no se van..y me preocupa que pueda contagiarle a mi hija....",
            "post_id": "8236957",
            "timestamp": "1344962514",
            "user_id": "user_3191494",
            "user_link": "/personal_pages/user/3191494",
            "votes": 0
        },
        {
            "answer": "yo tambien tengo este dolor en la espalda y pecho...pero en mi caso mis bronquios estan inflamados...segun los rx...la tomografia dice casi lo mismo ...pero añade normal...tenia anemia pero ya no la tengo...tengo carraspera....que no se pasa...y me falta aire cuando camino rapido...tambien he hecho malestar estomacal...cuando me recupero de lo estomacal...me vuelve lo de la espalda...que sera no ..lo se...los médicos me dicen que estoy que es alergico...pero  me siento mal...hasta la sicologa me ha dicho que es mi mente...pero las flemitas de la carraspera no se van..y me preocupa que pueda contagiarle a mi hija....",
            "post_id": "8236985",
            "timestamp": "1344962945",
            "user_id": "user_3191494",
            "user_link": "/personal_pages/user/3191494",
            "votes": 0
        },
        {
            "answer": "Bueno acabo de leer todos los comentarios de diferentes personas que padecen dolores similares a los que padesco ya hace mas de 5 anos y pienso no soy la unica que estoy sufriendo y segun los medicos es Fybromalgia segun el psicologo todo esta en el poder de la mente y en el stress y en el estado animico y que padesco deprecion+anciedad,^_^...............pero segun el sistema en el pais que vivo no pueden hacer nada los Drs y solo me llenan de medicamentos para dolor o mejor dicho Narcoticos  y cuando llego al Hospital mer dan Tylenol 3 y me regresan para la casa, pues ya no me creen nada; asi que si continuan con estos dolores si hubican mas de 11 zonas donde duele aparte de TODAS  las articulaciones, pies ,pecho, espalda, cadera, cuello, dolores de cabeza de mandibula ya saben que es Fybromalgia y para eso solo lo tratan con Lyrica y lo que me ha pasado es que me ahumentan la dosis cada seis meses y trato de caminar y estar en lo que pueda relajada pues es verdad que los nervios atacan mas los dolores, !Espero tengan Suerte y Tratar de Vivir con estos dolores hasta que Dios nos la preste en la Tierra! .............Amen.",
            "post_id": "8275793",
            "timestamp": "1346095643",
            "user_id": "user_3222700",
            "user_link": "/personal_pages/user/3222700",
            "votes": 0
        },
        {
            "answer": "bueno eso es solamente stress tencionalno piensen tanto, hacer deportes, caminarm conversar con amigos en un grato ambiente.y para los dolores o relajante muscular les remoniendorelajante muscular en las noches reflexanpara el dolor y desinflamacion dolnix cada 8 hrsbendiciones  :)",
            "post_id": "8509141",
            "timestamp": "1352684634",
            "user_id": "user_4315637",
            "user_link": "/personal_pages/user/4315637",
            "votes": 0
        },
        {
            "answer": "hola tengo esas misma molestia.solo que tengo otro síntoma que es el de una molestia en la garganta. como si la comida no me va ja es como si algo me topara por fuera siento ese. nudo que no me deja nunca.",
            "post_id": "8614766",
            "timestamp": "1355347292",
            "user_id": "user_4488039",
            "user_link": "/personal_pages/user/4488039",
            "votes": 0
        }
    ],
    "post_id": "3998629",
    "question": "Hace seis años me operaron de un CIA,  llevo mas de un año con dolores de espalda y pecho, alguna vez que me remitieron al Cardiologo me dijo que estaba bien que no era problema del corazon, me preocupa por que hace mas o menos 8 meses este dolor se ha ido intensificando, me esta viendo el fisiatra, me han tomado radiografia de torax, gammagrafia a los huesos, examenes de sangre y  hasta ahora todo ha salido normal,  en las ultimas semanas me ha vuelto el dolor con mayor intensidad, cuando se me presentaba lo soportaba y evitaba el tomar medicamentos pero en esta ultima semana este dolor es tan fuerte que no lo soporto tomo acetaminofen y aun asi no se me quita del todo, el dolor, generalmente se me presentaba en la parte alta de la espalda y el pecho, llevo 4 dias en los cuales este dolor esta atras del seno y debajo del brazo, es insoportable.  Ademas cuando camino me duele el pecho, y al subir un puente me falta aire cuando estoy en la parte superior de este.Me preocupa por que cada dia me siento peor y no se cual es la causa.Quisiera me ayudaran a poder identificar cual puede ser la causa de este dolor y asi poder pedir al doctor me remita al especialista indicado y me hagan los examenes correspondientes.Muchas gracias por su ayuda.",
    "timestamp": "1234883924",
    "title": "dolor pecho y espalda",
    "user_id": "user_768041",
    "user_link": "/personal_pages/user/768041"
}