{
    "answers": [
        {
            "answer": "Congrats NewMommy08 - my husband and I also went through IVF in June.  We are right at 11w2d so we are right there with you.  We put 3 eggs back in and all three took.  We were only pregnant with triplets for about 2 weeks and then we lost one at 8 weeks.  We still have twins that were very healthy and moving around quite a bit yesterday at the ER.  It's rather scary so be prepared.  I've had spotting on and off so if you have any of that, take care of yourself and contact your doctor immediately.  I am high risk at well.  You can plan on lots of doctor's appointments but you get to see those precious babies progress and it's awesome.Since I am just as far as you, I can only tell you what we've decided.  They are going to be very small at birth and you will not make it to Feb.  Hopefully you can carry until December some time.  You will definitely be on bed rest.  Your doctor will tell you when to go on bedrest.  I would hold off telling anybody except maybe my family until around 16 weeks to make sure they are still very happy and healthy - and by then you might know the sex.  It might be hard to hide, as I am already huge with just the twins - I can only imagine 4.  We were going to go with one crib, but we are now going to get 2 since we are down to 2.  I am pretty sure you can do two for now if that's easier for you - they can share until 5-6 months is what my doctor said.  That will give you time to get settled.I would recommend pumping your milk as much as you can - that's important.  And plan on going through alot of diapers.  We have already started buying them everytime we go to the store and we 5-6 months to go.  It won't hurt.I've given you all my experience so far - hope it helps somewhat.  Just take it easy and don't overdo yourself.  That's the most important thing.  You have 4 little lives to think about.  Congrats and I am so happy for you.",
            "post_id": "1732944",
            "timestamp": "1186851841",
            "user_id": "user_220217",
            "user_link": "/personal_pages/user/220217",
            "votes": "0"
        },
        {
            "answer": "Wow! 4 babies! That is very exciting! I am almost 38 weeks with my first baby and the buying and planning for 1 has been sooo exciting and fun! But it's very eye opening to how expensive things can get! Like KellyTexas said, start buying diapers asap! I have stocked up on quite a few since around 13 weeks so we shouldn't have to buy any for quite awhile! Hit up as many garage sales as possible, also! It's getting kind of late for them...but you should still be able to find some good things for cheap! :) I also go to www.freecycle.org alot. If you sign up for your area's group, you'll be surprised how many things are offered that you'll be able to use! The site is free and the stuff is free....it's a program to try and keep the landfills from filling up.Anyhow......congratulations! :) Keep us posted!!",
            "post_id": "1733296",
            "timestamp": "1186862426",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "Wow, 4!  Congrats.  Your concern is normal.  It can be a bumpy road but you'll get there.  I went through 1 can of formula powder a week (approximately) and about 1 pack of diapers a week (also approx).  The thing with diapers and formula is that you won't know which is best unless you try it out on them first.  That holds especially true with formula.  People suggested the best formulas but DD could not tolerate them and we had to go with a soy based formula.  DD also did not do well with Pampers (she had a rash) so we went with Huggies (even though they're beginning to disappoint me with the leaks since DD is very mobile at 10 months and moves around a lot).  Also, keep in mind that most likely they'll be premies so you'll need diapers that will fit them.  DD was born 5.7 lbs and wore premie diapers for about a month.  I'm glad you found us.  Congrats again and ask any questions you might have.  Most of us don't have twins/triplets, etc but we went through it so you'll just have to multiply by 4 ;)",
            "post_id": "1733549",
            "timestamp": "1186870232",
            "user_id": "user_149979",
            "user_link": "/personal_pages/user/149979",
            "votes": "0"
        },
        {
            "answer": "Hi!  Congratulations!  I'm not having 4, but I am having 3!  I'm 24 weeks pregnant with triplets and would be happy to share anything I've learned with you, as well as my experiences thusfar.  As to your questions:When do I quit my job? - leave this up to your dr.  I'm sure he'll tell you when it's time.When do we tell everyone? I tried keeping it a secret, but everyone knew by 12 weeks.  News like that travels amazingly fast.  I'm known as the \"triplet lady\" around town.  I'm famous!How do you budget for 6 instead of 2? - I have NO idea.  We don't know how to budget for ours, we're just trying to save, coupon shop, and pray and have faith it will work out.How much formula and dipers do you go through a month with just 1 baby? - Other triplet moms I've met said they went through about 1 can per day for a while.  I'm not sure what state you live in, but in CA there are programs that help with this.What formula is best? - Can't tell until babies are born, unfortunately.  I wish I could start stocking up now!What dipers do I use? - Again, you never can tell.  My mom works in NICU and they use Pampers, so we've been buying those,  but I'm also stockpiling a small arsenal of other brands, and I'm having a diaper shower and asked for any and every kind and size.Do I buy 4 cribs or have them share for the first little while? - We will probably start by having all 3 babies in one crib, but we went ahead and got 3 and just set them up today, actually. :)  Other moms of multiples I've talked to have mixed opinions - most say they kept the babies together for a few months, but a few have said the babies did much better separated, so I figured we're prepared either way.Hope that helps a little.  Keep in touch, and I'm happy to answer any other questions you have as well as I can!",
            "post_id": "1733562",
            "timestamp": "1186870975",
            "user_id": "user_120255",
            "user_link": "/personal_pages/user/120255",
            "votes": "0"
        },
        {
            "answer": "Sorry forgot to mention, my doctor said that if all goes well he wouldn't put me on bed rest until 22-25 weeks.  I work in a law office and it can be pretty stressful so my doctor said to be done working by 18-20, does that seem to early?",
            "post_id": "1734171",
            "timestamp": "1186895313",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies!!We put in 5 eggs and got 4, my doctor said that he only thought that we would end up with 2 or 3 if we did 5 eggs, so we went for it and ended up with 4 little ones!  They all look good so far.  My doctor wants to do a cerclage, which is a little surgery where I guess they strengthn your cervix and my doctor said that hopefully that would keep them in until hopefully 30-32 weeks. We will eventually need 4 cribs so I think we are going to just get all 4 now.  The thing I'm kind of nervous about it my doctor said that with several babies there is a chance that there could be another one that was missed in the ultrasound, so he said he was going to make sure we have only 4 the whole time. lol.  I don't know what to buy and not to buy, like gear wise because unfortunatly I wont be able to hold all of them all the time.",
            "post_id": "1734165",
            "timestamp": "1186896011",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "Wow, I just got so many new questions.  I have a SUV, Suburu Tribeca and it hold 7, but it will be a pain putting that fourth baby way in the back... What do I do for a car?  And strollers...  The biggest I have ever seen triplet strollers.  I have so much just running through my mind!",
            "post_id": "1734203",
            "timestamp": "1186897755",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "Unfortunately, your situation is so risky that you will be put on very early bedrest.  Hard to say how early, but 18-20 sounds about right.Since you'll have preemies, you may need more room rather than less, so I'd start saving up for the cribs.  You'll likely have apnea monitors, home oxygen, possibly other equipment.  But you'll have a lot of time after the birth.  The babies will be in the hospital for quite some time, and the hospital will give you an idea of what you'll need long before they come home.But certainly plan on very early bedrest.  Much of it will be in the hospital, so prepare for that, too.  Good luck!",
            "post_id": "1734455",
            "timestamp": "1186924354",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": "0"
        },
        {
            "answer": "New Mommy, your excitement is really uplifting.As far as the cribs, I probably would've gotten 2 and had 2 babies sharing one.  Going off work at 18 weeks... bedrest can be a pain, but it is well worth it!  Unlike the singleton parents like myself, you don't only have to worry about you and a baby, but now you have four extra lives counting on you!As for a vehicle.. I think that is about the best you are going to get.  At least it fits 7!  I'll trade you my beat up VW for your SUV, it seats... *counts*  5... and well not a baby seat and 2 kids well.When do you tell people?  Personally because of how high risk you are, I'd wait till you are on bedrest, unless you are already obviously showing, then perhaps just the closest friends and family as well of course as your boss.How do you budget for 6 instead of 2?  Hmmm well a lot of coupons!  I budget for 5 but they've been slow editions to the family.  Visit a lot of Mom 2 Mom salesAs far as diapers.. I was told to plan on a large pack of diapers per week per child... I think that was about the average for my daughters when they were younger.  It was far too long ago, about to get a crash course with Lilith.What formula is best?  I love organic formula, but plan on breastfeeding as long as possible.  Remember that with your little ones, it might be better to stock up on gift certificates for the formula more than anything else, because you might run into a situation where they need soy formula or something like that.What diapers... Get a Costco or a Sams Club membership!  I think that is going to save you a lot of money in the long run.  For the most part, all diapers are created equal, and sometimes the biggest difference is between a boy or a girl can depend on the diaper brand you get.",
            "post_id": "1734570",
            "timestamp": "1186928460",
            "user_id": "user_175662",
            "user_link": "/personal_pages/user/175662",
            "votes": "0"
        },
        {
            "answer": "I forgot to mention this in my earlier post. There are pack n play's out that are made for twins. There are 2 of the bassinettes on top. This may be something for you to look into! We are planning to have my little guy sleep in his pack n play the first several months and only nap in his crib. I'm not sure how costly the pack n play's are, but they could buy you some time by using them so you could buy the 4 cribs gradually!",
            "post_id": "1734625",
            "timestamp": "1186930557",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "We have a minivan that seats 8 - a Toyota Sienna. You could easily put 2 babies in the second row seats and 2 babies the 3rd row seat, with room for others!  As far as strollers, a friend of mine with triplets and a 3 year old has a quad stroller called a runabout.http://www.stroller-advisor.com/quadruple-and-quintuple-strollers.html",
            "post_id": "1734644",
            "timestamp": "1186931349",
            "user_id": "user_120255",
            "user_link": "/personal_pages/user/120255",
            "votes": "0"
        },
        {
            "answer": "I have 2 kids, one 3 1/2 years, one 7 1/2 months both in diapers, I buy costco's kirkland brand, they are $45.00 for 200, as oposed to 50 brand name diapers for $20.00 at the grocery store (that's almost 1/2 the price!) and they are super, the are pretty much identical to huggies supreme and I have never had one leak!",
            "post_id": "1734646",
            "timestamp": "1186931388",
            "user_id": "user_127529",
            "user_link": "/personal_pages/user/127529",
            "votes": "0"
        },
        {
            "answer": "Sorry, hadn't finished!Kirkland wipes are great too. Check out walmart for reasonably priced stuff too.I also collect coupons, many I get off the internet. Shop consignment stores and stock up on clothes for the follow year at end of season sales. I also sell any clothes that are done with at the consignment stores.Congratulations on your pregnancy, I hope it all goes well",
            "post_id": "1734650",
            "timestamp": "1186932392",
            "user_id": "user_127529",
            "user_link": "/personal_pages/user/127529",
            "votes": "0"
        },
        {
            "answer": "It is all just so crazy... I'm so excited, but I'm very stressed already!  On the September 13th I will have my surgery for the cerclage done and that makes me nervous but I know it will help keep those babies in there longer.  My doctor said that if he didn't do it, to count on babies before 30 weeks and he said if I do have it done that he thinks it will be as early as 32 weeks so that will be very good!  Hopefully we will be able to bring them home shortly after they are born.  My husband is hoping that out of those 4 there is at least 1 boy, but I'm thinking all girls because daddy would go crazy! Lol.  Thank you ladies.",
            "post_id": "1735008",
            "timestamp": "1186943129",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "well congrats! Im stressed about one, who will be here in 28 days!!! Good luck to you!!!!!",
            "post_id": "1735194",
            "timestamp": "1186949124",
            "user_id": "user_223520",
            "user_link": "/personal_pages/user/223520",
            "votes": "0"
        },
        {
            "answer": "yey!!  28 days!  I bet you will be just fine.  Do you know what you are having?  I think we will find out what we are going to be having... I would love for these little ones to get here so I can meet them but I know it will be a while.  Good Luck!",
            "post_id": "1735227",
            "timestamp": "1186950884",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "We are having a boy and he is our first! We are excited but now its soo close we are stressing!!! And for me, this pregnancy flew by! So hopefully it will for you! Good luck!!! And i cant stop staring at your ultrasound pic. I am amazed!!",
            "post_id": "1735514",
            "timestamp": "1186960941",
            "user_id": "user_223520",
            "user_link": "/personal_pages/user/223520",
            "votes": "0"
        },
        {
            "answer": "Lol. I know either can I!!  Those babies are packed in there! I guess after like 14 or 15 weeks the babies get to big to get them all on one picture like that so I am hoping for another picture of all of them together before they get too big!",
            "post_id": "1735544",
            "timestamp": "1186961229",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "aww!! Too cute!!",
            "post_id": "1735546",
            "timestamp": "1186961402",
            "user_id": "user_223520",
            "user_link": "/personal_pages/user/223520",
            "votes": "0"
        },
        {
            "answer": "Shamanda~ Do you know what you are having?KellyTexas~ Do you have any feelings about what you are having?",
            "post_id": "1736060",
            "timestamp": "1186972774",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "i just really wanted to say congrats! and let you know how HAPPY it is to hear your news! it gave me the goose bumps when i read it! best of luck keep us posted!",
            "post_id": "1736305",
            "timestamp": "1186979933",
            "user_id": "user_246850",
            "user_link": "/personal_pages/user/246850",
            "votes": "0"
        },
        {
            "answer": "I know... I am just so excited, we went in for a normal u/s thinking we would see 1 maybe 2 but instead saw 4.  It was so crazy and just keep looking at that picture and just can't believe it!  And the fact that my doctor thinks that after the little surgery to keep my cervix closed that we should be able to carry to about 30-32 weeks.  It would be amazing if we could keep them in that long, or even longer, less risks.",
            "post_id": "1736330",
            "timestamp": "1186980017",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "if you get a costco membership get the executive, they will give back like 2% of your spending and with 4 babies that could be a fair amount.  im still just totally amazed how a body can stretch to accomodate 4, im only 21 weeks and i feel tapped out right now! lol.  cant wait to hear all about your exciting adventure.",
            "post_id": "1736351",
            "timestamp": "1186981418",
            "user_id": "user_166855",
            "user_link": "/personal_pages/user/166855",
            "votes": "0"
        },
        {
            "answer": "Yeah... I am measuring at 20 weeks and am only 11 weeks pregnant, it is just so crazy.  I don't know how much bigger I will get but holly cow, those little ones are packed in there tight!",
            "post_id": "1736450",
            "timestamp": "1186986593",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "the only thing that i can strongly suggest is swings and the boungy/vibrating seat one for each. Kind of pricey but i think well worth it:)",
            "post_id": "1736761",
            "timestamp": "1187009731",
            "user_id": "user_173145",
            "user_link": "/personal_pages/user/173145",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies!  I am just so excited for this long jouney!",
            "post_id": "1736907",
            "timestamp": "1187012813",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "hi newnewmommy08. i am having twins due October 3rd. multiple pregnancy is fun, exciting and scary. it's so amazing when you start feeling them move around in there. my girls are so squirmy and big. i have been dealing with alot of complications so far, but it is all worth it. i measure about 8 weeks ahead at every visit. lol. people keep asking me when i am due, then looking dissapointed when i tell them October.as for bed rest...i have been on and off it since ten weeks. the last big scare was preeclampsia. now i have gestational diabetes. my biggest advice to you is to take care of yourself and not to feel at blame if you do develop any of those conditions. with multiples you do run a higher risk.i agree, buy diapers now! i started at 10 weeks and grab a pack every time i go to the store. my doctor says you can expect to go through a large sized bag a week per child.with budgeting, i have no idea... we are just trying to prepare for everything. loli am using one crib for them until the hit around 6 months, we have a second, but i won't set it up until i need it(less clutter)the quad stroller is an option, but they are cumbersome. if you will take the babies out by yourself it sounds like your only real option, but if you'll have help i would maybe get two doubles. alot more manueverable.just do your best to eat well, follow your doctors orders like never before and take it easy. you'll need frequent rest breaks. i know i do :)",
            "post_id": "1736896",
            "timestamp": "1187013350",
            "user_id": "user_174515",
            "user_link": "/personal_pages/user/174515",
            "votes": "0"
        },
        {
            "answer": "Congrats!  I am only having 1 this time and I have 1 two year old-  I can tell you that I tried to pump my milk for her, but I had problems keeping up with only 1!!  So good luck to you, but if you have to switch to formula early don't feel bad about it-  I had so many problems and everyone made me feel so bad about it-  my DD is VERY smart and only had brest milk for the first 6 weeks, and that was mixed with formula-  I tried a few different kinds before I found one that worked for her- it was good start-  but it is about $22 to $24 for a big tub of it, I think- and we did one tub a week, more or less...  so you might want to just use the generic brands, I have friends who used those, and their kids did great on it...  It will save you a lot of money!  After I started the GoodStart, I didn't want to switch, so I just kept on it...I also liked the huggies best for little ones,  but I have heard lots of different advise of that one, and I'd say just try different ones to see what works!The rest of the questions are good ones, but not sure I have good answers for them!  Good luck!",
            "post_id": "1737265",
            "timestamp": "1187021238",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "Thank you so much!  I am just so overwhelmed with everything, I have so many thoughts and questions going through my head!",
            "post_id": "1737352",
            "timestamp": "1187023759",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        },
        {
            "answer": "We're having identical boys and a girl.  Perfect!",
            "post_id": "1738294",
            "timestamp": "1187044282",
            "user_id": "user_120255",
            "user_link": "/personal_pages/user/120255",
            "votes": "0"
        },
        {
            "answer": "I had gone in to get my blood drawn this morning just to check things and my doctor said that everything looked great but I have had some major swelling and he wants me to take it easy and he put me on bed rest for the next few days.  I talked to my boss and told him that I would help him for another 2 weeks from home and then I was done.  So I'll be 13 weeks when I stop working.  Does that sound like a good time?  I just feel so large and feel like I have grown so much since my last u/s a few days ago.",
            "post_id": "1752175",
            "timestamp": "1187069960",
            "user_id": "user_249534",
            "user_link": "/personal_pages/user/249534",
            "votes": "0"
        }
    ],
    "post_id": "1732899",
    "question": "I was looking online trying to find a place where I could get some good support and found this and read some posts and it's perfect, you women all see so wonderful!  I am 28 years old and have been trying to concieve for over 6 years now and we finally tried IVF and my husband and I had our 11 week ultrasound and found that we are not only pregnant with one baby, but FOUR!  We are having the quadruplets in late Feburary and I am a nervous wreck.  We are a very high risk pregnancy and our doctor has been wonderful thus far.  I just have no idea how we are going to do it with four babies, but we are just so excited we finally got pregnant!  I have so many questions, being a first time mommy and all.When do I quit my job?When do we tell everyone?How do you budget for 6 instead of 2?How much formula and dipers do you go through a month with just 1 baby?What formula is best?What dipers do I use?Do I buy 4 cribs or have them share for the first little while?There are just so many things running through my mind!!  Thank you all so much for your help!",
    "timestamp": "1186850590",
    "title": "First Post: 11 weeks pregnant with...",
    "user_id": "user_249534",
    "user_link": "/personal_pages/user/249534"
}