{
    "answers": [
        {
            "answer": "Hi allhope ur all having a good day and looking forward to even a better weekend..well i did HPT yesterday , itd suppose to show + SIGN , well after 3 min there was just one SINGLE line , so meant not pregnant, checked the same HPT out of curiousity again none (( i did imagine an imaginary line though ))) neways this morning while i was cleaning the garbage there was clear + sign on same HPT,,????now should i just disregard it or ????????? please advise ..im in some kind of limbo????",
            "post_id": "1101463",
            "timestamp": "1084510800",
            "user_id": "user_34301",
            "user_link": "/personal_pages/user/34301",
            "votes": "0"
        },
        {
            "answer": "They say that you are not supposed to check after 10 minutes or so b/c you can get a false result...i'm not sure why, but i'm pretty sure they all turn positive if given enough time...But, if you are still unsure...you could always test again...good luck, we'll keep our fingers crossed for youAndi",
            "post_id": "1101464",
            "timestamp": "1084510800",
            "user_id": "user_67284",
            "user_link": "/personal_pages/user/67284",
            "votes": "0"
        },
        {
            "answer": "Emma1-Awww..Hon, I am sorry you are having such mood swings! Hope you feel better. And I agree! I can't wait to get where Blondie is!! I want to feel great and feel my baby moving!! ASAP!Mani-Agree with above post although I would like to add that since it came up neg the first time, I would wait a few days to test again just so you are not wasting your money on multiple tests. But you should defintly test again.Angel4JohnnyB-WHere are you??? HAve you had that baby?? I am a little worried about you? Let us know if you are here and how you are!!All-Well, DH got home last night from NY and as you all know I wasn't feeling particularly perky last night. Iw as worried about the effect my puking and such had on the baby. Well, the first thing DH wanted to do was find the heartbeat with the doppler. He found it right away (that little peanut must be getting bigger every day because his little heart gets easier to find!)and of course that put my mind at ease! You should have seen the look on his face. He just sat there for the longest time listening in awe to his baby's heart beating!",
            "post_id": "1101465",
            "timestamp": "1084510800",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "Here I am.  It has been such a long devastating week.  The baby was born on Tuesday evening and she looked perfect. It did end up being a cord wrapped around her neck 3 times so I guess it had nothing to do with the pre-eclampsia after all.  They are having graveside services on Monday, which is so strange because that was her delivery date. (Anyone that doesn't know what I am talking about see post from Tuesday for complete explanation).Anyway I myself am doing well and thank God everyday when I feel my little peanut move. Although I must admit that I am a little more panicked.  I have a doctor's appointment next Friday and then we will schedule the ultrasound.  I can't wait!Christie and Still A Mom- I know in a previous post from awhile ago we were talking about birth certificates in situations such as stillbirth.  I don't exactly remember the whole thread and I can't find it but I know Still A Mom you ended up making one on the internet or something can you tell me more details?Also Christie I thought you mentioned something about the law and the weight of the baby or what the \"qualifications\" are on getting a birth certificate can you fill me in more?  I live in Michigan also and I know each state may be different. Any information you can give me will be helpful.",
            "post_id": "1101469",
            "timestamp": "1084510800",
            "user_id": "user_55779",
            "user_link": "/personal_pages/user/55779",
            "votes": "0"
        },
        {
            "answer": "I have a question for anyone in the dental business or nurses..etc. I had an appt this mornig for one wisdom tooth to be taken out w/ anesthesia and laughing gas. Well I drank orange juice this a.m., so they sent me home! and rescheduled for Wed. Well, WED. is CD14 for me. I usually ovulate later than that but this is my 1st round of clomid, so I don't know if I'll o' earlier or not.Does or can anesthesia and laughing gas have ANY effect on ovulation itself?? I really can't afford to mess this clomid cycle up. I really don't think it will cause problems w/ ovulation per say, but what about the pain killers I'll be on from CD14 thru CD16?",
            "post_id": "1101470",
            "timestamp": "1084510800",
            "user_id": "user_56777",
            "user_link": "/personal_pages/user/56777",
            "votes": "0"
        },
        {
            "answer": "ok, so BFN...CD30 i'm REGULAR...so WHAT THE HECK IS GOING ON W ME! sorry! i had to vent! i'm so frustrated! Christina, yup i'm super regular..28 days.. i really don't know WHAT to think.  =(",
            "post_id": "1101471",
            "timestamp": "1084510800",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "thanx for the input, its just seeing even a faint and late positive does give some hope..im so sorry to hear about the loss of the baby..im sure God will bless her with another one and please dont stress out urself..things would be perfect for youlove. Mani",
            "post_id": "1101472",
            "timestamp": "1084510800",
            "user_id": "user_34301",
            "user_link": "/personal_pages/user/34301",
            "votes": "0"
        },
        {
            "answer": "Missy- I am so sorry. AS for the birth certificate, what exactly did they issue? If they only issued a death certificate, I would think that would be ridiculous. For there to be a death, there has to be a birth right?Stephw-Is there anyway to reschedule the appt yourself until you are done with this month and know whether or not you are in fact preg? I am not sure if it is safe with Clomid (I have never been on it) but that would be my suggestion, unless of course that is not an option.",
            "post_id": "1101474",
            "timestamp": "1084510800",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "I'm not sure about how it would affect Clomid. I know that my dentist has told me that he will not do any work on me (which I need some done as well) until after the baby was born.I would call your OB to find out what thier recommendation is. Good luck! Let us know what you find out!",
            "post_id": "1101476",
            "timestamp": "1084510800",
            "user_id": "user_59030",
            "user_link": "/personal_pages/user/59030",
            "votes": "0"
        },
        {
            "answer": "Thanks for your encouragement.  I just called my doc so she will call back sometime today.  I'm just worried that if i AM pregnant that it's ectopic and that's why my HCG isn't showing.  I know i'm freaking out for probably nothing..but i'm paranoid now lol! I usually write down everytime we BD but this month I didn't..the only time I totally remember is CD5 (I know gross i was still bleeding but hubby had been outta town for two weeks LOL) then AF stopped completely..I thought that was wierd but anyhow I just don't know.  With one of my other pregnancies it took over a week of AF being late to show on hpt..but I don' tknow.  If AF doesn't show by Monday i'll go to the lab.  Thanks for encouraging me! HUGS!",
            "post_id": "1101481",
            "timestamp": "1084510800",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "Go to the doctor. You could have high blood pressure. I think the flashy spots in front of your eyes is a sign, not sure but I think it is. So what if your doctor thinks you are paranoid. It is better to worry and check out stuff than get really sick. GO TO THE DOCTOR!!!!!!!!!!",
            "post_id": "1101482",
            "timestamp": "1084510800",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "I would call the doc.  for sure! they won't think you're overreacting and it's better to err on the side of caution.  please call your doc and let us know what happens! =) Kellie",
            "post_id": "1101483",
            "timestamp": "1084510800",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "kellieD- hey, sorry about the BFN and no AF.  I know it can be frustrating and even if you are regular doesn't mean things can change now. I was ALWAYS regular and in March, I just never got my AF and I wasn't pregnant.  Well, I had to take provera to induce AF and had to do it again this cycle TOO! ??? weird I know. I also had all tests done and I'm normal/regular w/ all hormones and everything. If you still haven't gotten AF by next week...then call your doc. Also, remember that you could have ovulated really late. Our bodys are a mystery and do not always operate 'by the book'.Kassimom- hey, I just spoke to my nurse at doc's office and am going to reschedule to June. Since I am actively trying, I don't want anything getting in the way and causing any problems. I just hate this \"dragging me along\" ****. I had appt in APril,then rescheduled to May, and now have to reschedule to June. Well oh well, its all for the best!!!",
            "post_id": "1101477",
            "timestamp": "1084510800",
            "user_id": "user_56777",
            "user_link": "/personal_pages/user/56777",
            "votes": "0"
        },
        {
            "answer": "It is called a certificate of life and you can find it one www.griefwatch.com They also have a baby book that is especially for if you lost the baby that is wonderful. Did they take pictures of the baby? I hope that they got to have a lot of time with the baby. It is kinda hard to see exactly what the certificate looks like because it is all white, but it has pearlized stars and moons on it and in the corner a teddy bear crying. It has a place for all the information and the doctor and one nurse, so make sure it is there favorite, they will only put one nurse on it. Get the one with calligraphy on it. They do a really good job and it is only about $9.Let us know how the mom is doing. I will continue to pray for all of those touched by the life of this percious baby.Mandi",
            "post_id": "1101478",
            "timestamp": "1084510800",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "Hello Everyone,I'm 29 weeks pg. For a week now I've been having dizziness/lightheadedness and seeing flashy spots.  I feel like I'm on a rocking boat trying to walk at times.  I'm not sick, so no inner ear problems. My feet/hands have been a little swollen, but it's been really hot out and I am on my feet all day at work.  I'm afraid to call my doc.  I've had so many issues, that I'm afraid that she'll think I'm overreacting or something.  My other fear is that she'll take me off of work just because I have had issues.   I really can't be taken off of work yet because we are closing on a new mortgage in 3 weeks.  I just don't know if I can deal with these symptoms that long and or if I don't go to the doctor, and most importantly, that something could go wrong with the baby.  Just need some level headed advice since I can't seem to think right lately.  Thanks Ladies.",
            "post_id": "1101480",
            "timestamp": "1084510800",
            "user_id": "user_40725",
            "user_link": "/personal_pages/user/40725",
            "votes": "0"
        },
        {
            "answer": "hey everyone,Thought id stop in and say hello.. I feel pretty crappy today.. a lil depressed to be honest.. tired of the same run around with my fiance.. i swear all he does is tell bullshit to me... have to go to work at 4pm till 12 tonight.. fun fun... ~~sigh~~ anyways.. hows everyone doing?? hopefully better than I am...~*Chloe*~",
            "post_id": "1101487",
            "timestamp": "1084510800",
            "user_id": "user_30688",
            "user_link": "/personal_pages/user/30688",
            "votes": "0"
        },
        {
            "answer": "call the doctor now!  vision disturbances are signs of pre-eclampsia - which if monitored and looked after, is very low risk for problems.  not looked after, it's a different story...i would call now!  kat23",
            "post_id": "1101488",
            "timestamp": "1084510800",
            "user_id": "user_66797",
            "user_link": "/personal_pages/user/66797",
            "votes": "0"
        },
        {
            "answer": "Go to the Dr. now!  They are right.  Visual disturbances are a symptom of pre-eclampsia.  I wouldn't hesitate to go to the ER because it may take too long to be seen by your regular physician.Seriously,Shelly",
            "post_id": "1101490",
            "timestamp": "1084510800",
            "user_id": "user_52056",
            "user_link": "/personal_pages/user/52056",
            "votes": "0"
        },
        {
            "answer": "Well, I called the Dr. and she is going to bring me in to try and hear the hearbeat. When I went last Monday she said it was too early with doppler....I am 11wks 3dys today. Should they be able to hear it today? Anyone Please advise......I don't understnad why i have days like this, but I'm going out of my mind.......",
            "post_id": "1101491",
            "timestamp": "1084510800",
            "user_id": "user_59030",
            "user_link": "/personal_pages/user/59030",
            "votes": "0"
        },
        {
            "answer": "YOU NEED TO GO TO THE DOC!!! not only does it sound like your bp is up but it sounds like you may be a little dehydrated.beleive it or not even a 2% drop in hydration can cause you problems. the other thing you need to take note of is when you stand up do you get that feeling like someone put cups over your ears for a  second. that is a big dehydration sign.let us know and don't take this lightly~nanci",
            "post_id": "1101492",
            "timestamp": "1084510800",
            "user_id": "user_65183",
            "user_link": "/personal_pages/user/65183",
            "votes": "0"
        },
        {
            "answer": "anyone hear from andij has she popped that baby out yet?~nanci",
            "post_id": "1101493",
            "timestamp": "1084510800",
            "user_id": "user_65183",
            "user_link": "/personal_pages/user/65183",
            "votes": "0"
        },
        {
            "answer": "Hey, thanks for asking about me but no need to worry, I'm fine.....baby is fine. I read the posts yesterday just didn't answer anything, my computer froze up on me after about 10 minutes and I just didn't have the energy to reboot and sign back on.......I just pressed the 'power' button and let it shut down that way. Yeah, yeah, I know I'm not supposed to do that.......LOL.My next appt is Tuesday hopefully the midwife will check me (I'll be 39 weeks that day) and tell me if any of these contractions are doing any good. I'd hate to be feeling like Andi, hurting and knowing the contractions aren't helping the baby arrive.Hugs,VikkiOh, by the way, I did read your post from yesterday about you not feeling well. You said you spoke to your dr. and all so I'm sure what he told you has helped, I just wanted to add my two cents.......Sometimes people end up impacted after a few days of constipation and once impacted the liquid bowel movement will move around the impaction making you think you have diarrah (sp?).......anyway, when you do pass the impaction you may feel ill and even throw up while on the potty.....you may feel light headed and sweat as well.More than likely not your problem since you didn't mention being constipated but just something to be aware of.",
            "post_id": "1101494",
            "timestamp": "1084510800",
            "user_id": "user_47678",
            "user_link": "/personal_pages/user/47678",
            "votes": "0"
        },
        {
            "answer": "emmathey heard my son's heartbeat at the doctor's office when i was 9 weeks along.  however they can't always hear it that early.  we were shocked. i thought i was just going in for a check up.  i had no idea they would try and find the heartbeat but they did.",
            "post_id": "1101495",
            "timestamp": "1084510800",
            "user_id": "user_67640",
            "user_link": "/personal_pages/user/67640",
            "votes": "0"
        },
        {
            "answer": "Hello everyone. I am now 2 weeks overdue for AF. I took a blood test a few weeks ago and it was BFN. I have too pee all the time and I am frequently nauseous. A friend of mine suggested the idea of a tubal pregnancy. She says all the symptoms are the same, but the test comes back neg. Does anyone know about this.Kimi",
            "post_id": "1101497",
            "timestamp": "1084510800",
            "user_id": "user_68728",
            "user_link": "/personal_pages/user/68728",
            "votes": "0"
        },
        {
            "answer": "Ladies I would LOVE your opinions......this month my temps/chart looks very different.  I dont want to get my hopes up but I just cant help it.  Any opinions are extremely appreciated!http://www.fertilityfriend.com/home/childatheart",
            "post_id": "1101498",
            "timestamp": "1084510800",
            "user_id": "user_59821",
            "user_link": "/personal_pages/user/59821",
            "votes": "0"
        },
        {
            "answer": "Hi there! w/ my ectopic I did get a positive HPT the day AF was due but when I had my first blood draw my HCG was only 17.  It DID double every 48 or so hours though but I spotted the whole time...then at about 7 weeks I started cramping along with it and my HCG was over 10,000..then at 8 weeks and a few days I had the worst pain of my life...and it ruptured.  I would call your doc.  Perhaps your HCG started really low? Did they do a quant beta HCg on you?",
            "post_id": "1101499",
            "timestamp": "1084510800",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "Hi girl, haven't seen you in a while. How's things going.ANd I don't want you to give your hopes up either BUT....that chart looks GOOD....very promising. You're 11dpo, so you MAY be able to get a + if you are preggo. You going to test soon? Or wait it out just to be sure? Well Here's lots of babydust...GoodLuck...and pls come back and let us know!!! ;o)",
            "post_id": "1101500",
            "timestamp": "1084510800",
            "user_id": "user_56777",
            "user_link": "/personal_pages/user/56777",
            "votes": "0"
        },
        {
            "answer": "I am not sure what a quant beta is. The doctor did not talk to me when I went in for my test, only the nurse did. I was spotting about three weeks ago and I have some cramping now, but none of my normal PD symptoms. What exactly happens with ectopic PG? Thanks for your help.Kimi",
            "post_id": "1101501",
            "timestamp": "1084510800",
            "user_id": "user_68728",
            "user_link": "/personal_pages/user/68728",
            "votes": "0"
        },
        {
            "answer": "I think there are two types of HCG lab draws - at least here - one is qualitative..just tells you if HCG is present or not and the other is quantitative..measures the numbers...that's my understanding i could be wrong.  W/ my ectopic it was a normal pregnancy just implanted in the wrong place (mine in my right tube).  Some symptoms I had were spotting, cramping on the side (right tube) and my shoulder hurt near the end too.  Are you having similar? I would call the doc and just tell them you want a HCG level drawn again and then repeated in 48 hours.  I know my first was 17 which is very low but it did double so they kept checking and I was on prometrium and everything until they realized there was not a baby in my uterus..they knew that w/ my HCG levels so high there was a baby somewhere though...i know..long story..if you wanna know anymore feel free to email - ***@****",
            "post_id": "1101502",
            "timestamp": "1084510800",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "Thanks for the info!  I have been popping in and out but just not posting much....I know How antisocial of me! :-)I hope everyone is doing well.  Congrats for all those preggies, I hope to join u soon!I think I will wait two days and see what happens with temps.  If they go into the 98's then I will test.  Either way the last 2 evenings was a bust I got so nauseous!  Dh thinks its a good sign because my dry heaves and glassy eyes happened at the same time.  Leave it to him to get excited for that! lolThanks again ladies!",
            "post_id": "1101504",
            "timestamp": "1084510800",
            "user_id": "user_59821",
            "user_link": "/personal_pages/user/59821",
            "votes": "0"
        },
        {
            "answer": "Hi all - I just found out I'm pregnant (as most of you know), and I'm going on a couple of camping trips during this summer, still in the first trimester.  I have a couple of camping-related questions:1. Is it okay to swim in lake water?2. Is sunscreen safe during pregnancy?3. What about bug repellent?  I heard DEET is not safe for pregnant women, and today I saw a \"natural\" bug repellent that has no DEET but has 10% citronella.  Is citronella safe?  Is there a better, safer alternative?4. What can I do for itchy bug bites, if I am not well protected from them in the first place?Thanks for any guidance you can provide!",
            "post_id": "1101505",
            "timestamp": "1084510800",
            "user_id": "user_39788",
            "user_link": "/personal_pages/user/39788",
            "votes": "0"
        },
        {
            "answer": "Oh Geez, I can't afford to end up in the hospital right now...we are moving tonight/tomorrow.  My bloodpressure has always been really low. Now I'm really scared.",
            "post_id": "1101506",
            "timestamp": "1084510800",
            "user_id": "user_40725",
            "user_link": "/personal_pages/user/40725",
            "votes": "0"
        },
        {
            "answer": "I also have similar problem lately (I'm 24 weeks tomorrow BTW) because of hypotension or low blood pressure which can also cause those symptoms (extremely common in pregnancy and not preeclampsia related at all thank goodness). My last blood pressure check I measured at 94 over 67 but as long as I stay hydrated they said not to worry until I get down to low eighties. The diziness gets really annoying, expecially when trying to take care of my daughter, do dishes, etc. but if I sit down for a minute and drink a glass of ice cold water I feel much better. Doc says it's not dangerous at all, just a lot of blood flowing too efficiently. Do you ever get like tension headaches too? I do and I guess that's another sign. Either way be glad, it means your heart is working great and oxygen supply to the baby is fabulous with minimum body effort. I hope I explained that right.I'd call your doc to make sure (and don't feel bad because it's they're job) but I'm pretty sure if your pressures are usually low that that's what's going on. Try to stay calm and relaxed until you hear back from them.",
            "post_id": "1101508",
            "timestamp": "1084510800",
            "user_id": "user_49654",
            "user_link": "/personal_pages/user/49654",
            "votes": "0"
        },
        {
            "answer": "Oh yay for the dry heaves, that sounds pretty preggo to me.And I'm not preggo, I'm on the \"clomid challenge\" lol, so I don't think you want to \"join me\" here but I hear ya. I can't wait to join in on the \"graduates (preggos)\" too!WOW, alot of quotation marks I used...uh, anyways. TEST GIRL TEST!!! Whatcha waiting for?? I'm hoping for you.",
            "post_id": "1101509",
            "timestamp": "1084510800",
            "user_id": "user_56777",
            "user_link": "/personal_pages/user/56777",
            "votes": "0"
        },
        {
            "answer": "Hello everyone - I noticed a post a few days ago about a bicornuate uterus and going full term. I have a bicornuate uterus and am now 38 weeks! It has been a long pregnancy - bedrest began at 20 weeks (due to contractions), I had steroid injections (for the baby's lungs) every two weeks from 24 to 34 weeks, lots of pain that was so hard to describe to doctors, a couple of stay overs in the hospital BUT our little guy is doing extremely well! (It's just me we're trying to keep sane!). So best of luck to those who are close to giving birth and those who are pregnant or trying to conceive. I know that all this pain and such will be forgotten the moment I finally get to hold our dear baby boy.Shelley",
            "post_id": "1101510",
            "timestamp": "1084510800",
            "user_id": "user_30428",
            "user_link": "/personal_pages/user/30428",
            "votes": "0"
        },
        {
            "answer": "ARGH!...lolJust go for a walk and don't stop until you've got your baby in your arms..not in tummy! By then, you'll not only have your baby, but have lost all your pregnancy weight. ;o)))) lolAnd I'm sure you probably already have heard this, but having intercourse can help too.",
            "post_id": "1101513",
            "timestamp": "1084510800",
            "user_id": "user_56777",
            "user_link": "/personal_pages/user/56777",
            "votes": "0"
        },
        {
            "answer": "I agree with Stephw, Go for a walk and see if that get's that little peanut out. I know that's what both of my sil's did when they were pregnant, we went walking up a hill and sure enough that got the ball rolling. She ended up in the hospital at around 11:00pm, and had the baby at around 3:00am. If that doesn't work i had a fried of mine go 4x4ing, and that got the ball rolling for her too. Just a couple of suggestions for you, hope all goes well make sure you keep us all posted.",
            "post_id": "1101514",
            "timestamp": "1084510800",
            "user_id": "user_60455",
            "user_link": "/personal_pages/user/60455",
            "votes": "0"
        },
        {
            "answer": "My BP last time was 100/60, so sounds simular.  I drink a ton of water a day.  I drink at least 3 liters of water.  I'm totally addicted to water.  Never would touch the stuff before, but since I've be pg, it's water/icecream from the DQ/pancakes/veggies and fruit.  I keep telling my hubby the baby is going to be a vegetarian.  I'll try leaving work a few minutes early and get a call into the doc.  It's very non-private here at work and difficult to talk freely on the phone.",
            "post_id": "1101515",
            "timestamp": "1084510800",
            "user_id": "user_40725",
            "user_link": "/personal_pages/user/40725",
            "votes": "0"
        },
        {
            "answer": "Rubbish : ) I walk at the very minimum 1 mile a day with ds, mostly uphill to no avail. I even added a trip to Costco yesterday : ) Dh and I have been having sex 1-2 times daily (not as much fun as it used to be,lol) to no avail. None of these \"techniques\" will work if the baby won't drop and put pressure on the cervix to open it up.He will come when he is good and ready, just not sure when that will be!Andrea",
            "post_id": "1101516",
            "timestamp": "1084510800",
            "user_id": "user_40010",
            "user_link": "/personal_pages/user/40010",
            "votes": "0"
        },
        {
            "answer": "Thanks for asking, no baby yet : ) Stubborn little boy I tell ya (wonder where he gets that,lol)Contractions are still every 10 minutes, going on 10 days of this bs now. Talk about exhausting!! I go in next wednesday ( my due date) unless I actually go into labor before then of course. I told John I wasn't going into L&D unless we saw Tristan's head crowning, he is terrified of that thought as I am pretty dang stubborn myself and he fears I will stick with that threat,lol!Anyway, as far as the posts regarding sunscreen. Most are safe in pregnancy, double check with your OB for specific ingredients to avoid (always avoid topical products with retinol or vitamin A as they have been linked to bone deformities in developing fetuses) Citronella is safe, I lived in Houston when I got pg with Jonathan and was a mosquito magnet, literally. I found an all natural non aerosol spray that was citronella (smelled like lemon pledge) and was given the okay by my doctor to use it. For the existing bites, she gave the okay for benadryl cream, lowest % you can find.Good luck!!Andrea",
            "post_id": "1101511",
            "timestamp": "1084510800",
            "user_id": "user_40010",
            "user_link": "/personal_pages/user/40010",
            "votes": "0"
        }
    ],
    "post_id": "1055249",
    "question": "Hope everyone has a good weekend! This week has been awful and today is no better! I'm not used to not being able to handle my emotions, but they have gotten the better of me.Kristen - Buckeye - cheesetoo - missy - capermom - kassimom -How are you all doing?Blondie - glad to hear that you are doing good!!! Can't wait until I get to where you are. Maybe I'll be able to breathe then.",
    "timestamp": "1084510800",
    "title": "Friday open forum.......................",
    "user_id": "user_59030",
    "user_link": "/personal_pages/user/59030"
}