{
    "answers": [
        {
            "answer": "thank you for sharing this with us.  I would never judge you for your decision.  I am sure that it was hard thought and the most difficult thing you have ever had to do and I would never even attempt to put myself in your shoes.  I just pray to God that I will never have to be faced with a similar situation.  Good luck to you and your twins...",
            "post_id": "2851840",
            "timestamp": "1209647823",
            "user_id": "user_147929",
            "user_link": "/personal_pages/user/147929",
            "votes": "0"
        },
        {
            "answer": "I remember reading when you found out and then that it was triplets.  No judgment here - just wanted to say I hope you have a wonderfully successful and enjoyable PG from here on out.  Any decision like that is personal and no one else's business.  I wish you luck!Hugs,Lori",
            "post_id": "2851849",
            "timestamp": "1209647974",
            "user_id": "user_174233",
            "user_link": "/personal_pages/user/174233",
            "votes": "0"
        },
        {
            "answer": "I agree with gram... NO ONE has the right to judge you faced with such a difficult decision. I don't think you will get ANY negative feedback from anyone here. Congrats on your twins and Happy & Healthy Pregnancy!!",
            "post_id": "2851857",
            "timestamp": "1209648146",
            "user_id": "user_121828",
            "user_link": "/personal_pages/user/121828",
            "votes": "0"
        },
        {
            "answer": "I also wanted to say best wishes for the healthy pregnancy.  I don't believe you should be judged here or you should even care if someone does.  You only have to answer to yourself and I am sure it was an extremely hard decision to make.  Have faith in your decision and never let anyone ever change your mind on that.  You did the best thing for you.  That is all that matters.  When you see those two lil ones it will hopefully lessen the hurt you are enduring now.  :)",
            "post_id": "2851858",
            "timestamp": "1209648184",
            "user_id": "user_97615",
            "user_link": "/personal_pages/user/97615",
            "votes": "0"
        },
        {
            "answer": "Girl we so won't judge you...i know the scared feeling you must have had......when we found out we were pregnant with triplets I too was scared although I just left it in Gods hands b/c I don't think I would have been able to make a sain decision.....but God thought it was best for us to only have twins and he took the third baby on himself.....but my dr's assured me it was for the best and now my twins have more room to grow and be healthy.....I know how hard it must have been for you but don't let anyone let you feel you are a bad person for doing it.....you did what you thought was best for you and your babies.",
            "post_id": "2851860",
            "timestamp": "1209648222",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "I was actually thinking about you, I hadn't seen you on in a while.  My heart breaks for you. I think any of us who have gone through fertility treatments understand that this may be a decision we have to make.  Doesn't make it easy, but I'm just saying that we wouldn't judge you for it. We understand. * hugs*",
            "post_id": "2851898",
            "timestamp": "1209648811",
            "user_id": "user_188789",
            "user_link": "/personal_pages/user/188789",
            "votes": "0"
        },
        {
            "answer": "Hello, I just read your post and I understand even though I have not gone through what you have.  I know I have come arcross certain people on this site that do juge (I'm not one of them)  Only god has real judgment!  I am here to support you on your decision. Feel free to send me a message to my mail if you would like to talk. I wish you the best through out your journey with this pregnancy.",
            "post_id": "2851902",
            "timestamp": "1209648912",
            "user_id": "user_384464",
            "user_link": "/personal_pages/user/384464",
            "votes": "0"
        },
        {
            "answer": "Heather-There are tons of women here that will not only support you but be there for everything that you go through! Some may judge but those that do have reasons and issues themselves. Please know that there are many many of us here that may not know exactly what you are going through but do understand being in the situation of making a very tough decision and we value everyones support and opinions if those opinions are coming from a non judgmental view and coming from the heart! Know that I am here if you need to talk!!Patty",
            "post_id": "2852041",
            "timestamp": "1209651105",
            "user_id": "user_208686",
            "user_link": "/personal_pages/user/208686",
            "votes": "0"
        },
        {
            "answer": "I am just so sorry you were in a situation where you even had to make a decision like that.  You did what you thought was best, under Dr. advisment, but I am sure it couldn't have been easy for you.  As the other ladies said, nobody has the right to judge you, and you are supported.  I think its very brave of you to share knowing that there are certain people (few thank God) that may give you a hard time, but you posted this in order to help others.  I wish you all the best with the twins, and you have total support.  Take good care, and a happy healthy remainder of your pregnancy.",
            "post_id": "2852066",
            "timestamp": "1209651414",
            "user_id": "user_377493",
            "user_link": "/personal_pages/user/377493",
            "votes": "0"
        },
        {
            "answer": "You are a STRONG woman for posting this!NOBODY has the right to judge you. Everyone's behind you here! You take care of yourself and your babies, and FORGET any negativity you might here.Prayers go out to you and your family!",
            "post_id": "2852118",
            "timestamp": "1209652015",
            "user_id": "user_490183",
            "user_link": "/personal_pages/user/490183",
            "votes": "0"
        },
        {
            "answer": "Ditto!!!",
            "post_id": "2852119",
            "timestamp": "1209652032",
            "user_id": "user_281219",
            "user_link": "/personal_pages/user/281219",
            "votes": "0"
        },
        {
            "answer": "Hi HeathJo,All I can add is that I respect and honor your strengh as you endured such a difficult decision.  I've learned from my own infertility issues that this forum is the only place where you can share most personal stuggles without being judged or criticized.  And in return it helped me get through the difficult times.Welcome to the twin club :)Milana",
            "post_id": "2852333",
            "timestamp": "1209655047",
            "user_id": "user_310089",
            "user_link": "/personal_pages/user/310089",
            "votes": "0"
        },
        {
            "answer": "I definitely wouldn't judge you, and I know what you had to do had to be a difficult thing, BUT in light of it all ther is a bright side........you still have 2 viable healthy beans ready to sprout.......congrats, and enjoy the rest of your pregnancy",
            "post_id": "2852535",
            "timestamp": "1209657706",
            "user_id": "user_186844",
            "user_link": "/personal_pages/user/186844",
            "votes": "0"
        },
        {
            "answer": "Heathjo- I just want to wish you lots of Happiness with your twins..... You made the best decision for your family and I am very happy for you..that you have been blessed with two little mircles.... CONGRATULATIONS!!!!wannabenana - why are you commenting on the pregnancy forum.... it shows you are Male... I have seen you commented on numerous pregnancy questions.... saying you have been pregnant... ??????",
            "post_id": "2853159",
            "timestamp": "1209666500",
            "user_id": "user_453888",
            "user_link": "/personal_pages/user/453888",
            "votes": "0"
        },
        {
            "answer": "I'm sure you did what you and your doctor felt would give your children the best chance at survival without birth defects, and preserve your health so you could take care of them when they arrive as well.  It must have been a terribly difficult decision to face, and I think you're brave for posting here for support!  I was worried about facing this myself, as my doctor warned me that he expected quads based on how I responded to the fertility medications.I think a lot of people watch these shows on TLC where they follow people with multiples and see that the children are relatively normal, but that is NOT the norm.  More often, women carrying more than twins often face serious health risks, including gestational diabetes and preclampsia, and the babies are put at serious risk as well. Here are just a few quotes from a medical journal about this topic to give you and idea:\"Fertility experts have carried out an analysis of nearly25,000 pregnancies that has clearly demonstrated that babies who arepart of a multiple pregnancy face major risks to their life andhealth.\"\"Deaths in the period around birth were five times as frequent fortriplets as for single babies (a rate of nearly 40 per 1,000 comparedwith under 8 per 1,000 for single babies).\"\"Over 57% of the babies who were small for their gestational age weretriplets.\"\"More than half of triplet pregnancies are complicated bypreeclampsia.\"The medical risks for the babies in triplet + pregnancies are:* being born prematurely and needing intensive care* dying before birth or in the first year of life* physical disability and learning difficulties e.g. cerebral palsySheri",
            "post_id": "2853169",
            "timestamp": "1209666582",
            "user_id": "user_324372",
            "user_link": "/personal_pages/user/324372",
            "votes": "0"
        },
        {
            "answer": "You must have me confused with someone else.Where have I said that I'm pregnant? Show me.",
            "post_id": "2853215",
            "timestamp": "1209667059",
            "user_id": "user_191371",
            "user_link": "/personal_pages/user/191371",
            "votes": "0"
        },
        {
            "answer": "I cannot express how much all of your posts have helped me! I knew you ladies would not let me down, and that posting this would do some good to sometone sometime in the future. Little did I know how much I myself would benefit from it.Sheri--Thank you soooooo much for posting those statitics and facts. They are but a mere few I had to consider when making this decision. I honestly had no clue that having triplets was THAT big of a \"deal\"--to either myself or the babies. I did my research and also heard firsthand stories from specialists in the field of perinatology as well as parents of multiples (more than twins), and understand that the chances of carrying a healthy triplet pregnancy to term was low. You are so right about those shows on TV where they show the minority: healthy families of multiple births. It puts a lot of pressure on people to think that if they cannot do it they have failed somehow. I so appreciate you helping enlighten people. I just couldn't bring myself to post that stuff myself or to share the stories I have heard.wannabenana--First, my point in posting this was not to generate more personal questions about my situation, but just to share that this is an issue for people. Second, please don't start a personal war with anyone here--at least not on my thread. It distracts from the issue. If you have any comments or questions about this post I would just prefer if you would keep them to yourself. I shared what I felt like sharing, and that seemed to be good enough for the other 15 ladies who responded. I'm sorry if it wasn't for you.",
            "post_id": "2853293",
            "timestamp": "1209668209",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "Heather - I applaud your courage and you know how I feel about your decision - your health comes first & nobody knows that better than me.  Pm me anytime - I'm thinking of you & I wanted to also say thanks for the lovely note!!! - love ya, jen",
            "post_id": "2853303",
            "timestamp": "1209668313",
            "user_id": "user_254689",
            "user_link": "/personal_pages/user/254689",
            "votes": "0"
        },
        {
            "answer": "Heather we all think you did a brave thing for you and your family.....and we still have alot in common with out twins......good luck from here on out......do you know their genders yet?",
            "post_id": "2853351",
            "timestamp": "1209668884",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "Actually, under Vsentz post question \"Alright, got \"Bring the Bubs\" plan,On April 29th at 12:11 pm, you posted, \"my labour with my son went on way too long\"So you have claimed to be pregnant.Please forgive me HeathJo, I mean no disrespect to your post, which covers such an important issue, and I know was so difficult for you.  I just wanted to point out a lie.  I hope you are not upset with me, but felt the need to stand up for you and agamommy.",
            "post_id": "2853428",
            "timestamp": "1209669737",
            "user_id": "user_377493",
            "user_link": "/personal_pages/user/377493",
            "votes": "0"
        },
        {
            "answer": "I cannot imagine what you have gone through in making this decision.  I wish you the best with your twins.  It sounded like you sought much advice and did what was best.  While I am sure it was not easy, you did what you had to do.  Best of luck and wishing you a healthy pregnancy!!!!!",
            "post_id": "2855007",
            "timestamp": "1209691482",
            "user_id": "user_223372",
            "user_link": "/personal_pages/user/223372",
            "votes": "0"
        },
        {
            "answer": "I can't imagine what you are feeling right now but you don't need to worry about being judged, it's not anyone's place to judge you, you did what you felt was the best so you don't worry about what others think. I commend you for being honest with all of us, it wasn't even anyone's business but your own, You just be strong for your two little ones and I wish you the best and lots of prayers to help get  you through this.",
            "post_id": "2855142",
            "timestamp": "1209694093",
            "user_id": "user_313425",
            "user_link": "/personal_pages/user/313425",
            "votes": "0"
        },
        {
            "answer": "Thank you again for your incredible honesty. It was your posts that encouraged me initially to ask questions and lean on the women here (I think i've told you that before). Although I know it was a very difficult decision to make, I am proud that you chose the path you did...for you and the babies. And I am even more proud to have you as a friend.I hope nobody here is judging you. It is posts like these that change peoples lives; that can make a woman feel like someone in the world knows what she's going through - just when she thought nobody did.Bravo...",
            "post_id": "2855647",
            "timestamp": "1209702593",
            "user_id": "user_381606",
            "user_link": "/personal_pages/user/381606",
            "votes": "0"
        },
        {
            "answer": "Thank you for you story....its not something people come forward and say.  I cannot imagine having to make that decision and Im sorry you were put in that situation.  Fertility is complex alot of on here have been through alot to be pregnant on a variety of levels.  Please keep us posted on your growing twins progess and I hope you have a sucessful and uneventful remaining pregnancy.Ericka 9wks 3days",
            "post_id": "2855827",
            "timestamp": "1209708457",
            "user_id": "user_377412",
            "user_link": "/personal_pages/user/377412",
            "votes": "0"
        },
        {
            "answer": "Thanks again for everyone who responded to this. It offers a higher purpose for what has happenned, and has helped me in my healing. You guys are the BEST!!!!!",
            "post_id": "2856691",
            "timestamp": "1209736829",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "I read this post and felt very bad for you .I will relay the story of one of my best friend who 2 years ago doing IUI was pregnant with triplets and after hearing their heartbeats could not go through selective reduction. At 15 weeks her cervix started to open and they stitched her closed and with medication and bed rest she carried on. Unfortunately  at 22 weeks  she went into labour as one of the babies had no amniotic fluid and had died. None of them survived and the little angels are in heaven right now.All I am trying to convey is that this is a very difficult decision that you have made and no one has a crystal ball to see what is going to happen in the future. To end on a happy note 6 months later my friend was pregnant with a singleton and now has a beautiful healthy daughter who is almost 1yrs old. She does not regret her decision as she did what she thought was best, and you should feel the same about your decision. Good luck and god bless.",
            "post_id": "2857457",
            "timestamp": "1209746841",
            "user_id": "user_432779",
            "user_link": "/personal_pages/user/432779",
            "votes": "0"
        },
        {
            "answer": "Feather--Thanks for sharing that story. I am so sorry this happenned to someone so close to you. I am glad your friend has no regrets, but my heart breaks for her loss. I can understand totally her deciding to go ahead with the pregnancy and not undergo selective reduction. I had to carry all 3 for 7 weeks knowing that one would be gone, and every sonogram and hearing the heartbeats was so bittersweet. I had follow up appointments today, and seeing the oe very still little body with a flat line is indescribably hard. It will be another week or two before the third baby is totally gone, and knowing I am carrying this little body around is also very hard.I am so happy your friend has a healthy daughter. I am sure the joy she takes in raising her is healing, just as it is to see my two very healthy twins doing backflips on the sono screen.Thanks again for sharing this story, as it is similar to the very many I have heard from bother doctors and patients about their experiences carrying triplets. While it may seem to some that selective reduction is an easy way to prevent the possibility of a problem, the truth is it is a very difficult way to save other babies' lives. That is why I went through with it, to save my twins and my own life, as we were all in danger. Thank God we are all doing well now.God Bless,Heather",
            "post_id": "2857962",
            "timestamp": "1209754067",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "You coming on here and sharing your story with everyone, despite the pain it is probably causing you says so much about your character.  Even through a tough time you are trying to help others by bringing something to the forefront that so many people have gone through, yet don't discuss because of the fear of how others will react or judge.  You are quite an amazing person, and I wish you 2 beautiful, healthy happy babies who will grow to appreciate what their mom went through to bring them into the world.  All the best to you, and the best of luck to you and your soon to be family.",
            "post_id": "2858203",
            "timestamp": "1209757946",
            "user_id": "user_377493",
            "user_link": "/personal_pages/user/377493",
            "votes": "0"
        },
        {
            "answer": "Adgal--Awwwwww! You are to sweet :-) Thanks for recognizing the potential for this helping other people.",
            "post_id": "2858601",
            "timestamp": "1209764133",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "Hi.  I haven't posted on this forum for a while, as I'm ttc and usually on the fertility forum, but I wanted to let you know that your sincere words really touched me.  I have not been in your situation, so I don't know your pain, but it's obvious from reading your post that you had a very difficult decision to make & I just want to say that no one can judge you.  You are the only one who knows your situation & what's best for you.  I commend you for having the courage to make the decision you did & to share it with us.Best wishes to you through your pregnancy !  :)",
            "post_id": "2859124",
            "timestamp": "1209774259",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Thanks mommyin08. Best wishes in your TTC journey :-) I'm SSBD to you, as I have extra! :-D",
            "post_id": "2860017",
            "timestamp": "1209792793",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "Heather ~ BEST of luck in all you do ~ and Congratulations again ~ keep thinking positive ~ !! ~",
            "post_id": "2860639",
            "timestamp": "1209822779",
            "user_id": "user_431805",
            "user_link": "/personal_pages/user/431805",
            "votes": "0"
        },
        {
            "answer": "Thanks !  I appreciate all the baby dust you can send my way :)",
            "post_id": "2860707",
            "timestamp": "1209824683",
            "user_id": "user_299260",
            "user_link": "/personal_pages/user/299260",
            "votes": "0"
        },
        {
            "answer": "Its so nice to see such support on this forum.  If I would have been preggo with more than two, I would have made the same difficult decision.  I wondered how the women on this forum would react and I am impressed.  Thank you for sharing.Although you are still grieving your loss, we are so happy that your twins are doing well.  Our hearts and thoughts are with you and your family.  HUGS!!!",
            "post_id": "2867176",
            "timestamp": "1209995638",
            "user_id": "user_359142",
            "user_link": "/personal_pages/user/359142",
            "votes": "0"
        },
        {
            "answer": "Selective reduction for the reasons you listed should never be judged. I wish you a safe, healthy, and happy pregnancy.  We all know this was not an easy choice. You take care of yourself and the little ones. We all understand.",
            "post_id": "2868508",
            "timestamp": "1210013552",
            "user_id": "user_405408",
            "user_link": "/personal_pages/user/405408",
            "votes": "0"
        },
        {
            "answer": "Thanks to all the wonderful ladies on this forum again. I am so impressed with how generous people here have been about this issue. I have received so many pm's and notes from people about their experiences with friends who were pg with triplets, or people who work in pediatric health care, or who know someone who has reduced. It has helped open up the discussion, and I am glad about that so that no one ever feels like they can't talk about it here. I know I made the right decision for us, but it's nice to feel reassured. If circumstances were different I'd love to have had 3 at once. . .",
            "post_id": "2868966",
            "timestamp": "1210019375",
            "user_id": "user_328927",
            "user_link": "/personal_pages/user/328927",
            "votes": "0"
        },
        {
            "answer": "You made a decision based on health of you and your babies. This decision is the hardest and most selfLESS one that anyone can make. I personally have never had to make this choice and I am so sorry you had to.Now, you take it easy and enjoy the rest of your pregnancy and keep us updated.",
            "post_id": "2870656",
            "timestamp": "1210047787",
            "user_id": "user_479472",
            "user_link": "/personal_pages/user/479472",
            "votes": "0"
        },
        {
            "answer": "HeathJo-  So glad that this post is growing strong! I'm also glad the negativity has kept away!  Like I said I am here to support you HeathJo. Wishing you a wonderful rest of the day!Hugs, Delma24 weeks!!",
            "post_id": "2871591",
            "timestamp": "1210080249",
            "user_id": "user_384464",
            "user_link": "/personal_pages/user/384464",
            "votes": "0"
        }
    ],
    "post_id": "2851792",
    "question": "Please don't judge me ladies. It is difficult for me to post this, but I am doing so in the hopes that if anyone else has to face this dilemma they won't feel as alone as I have.I was carrying triplets, and due to numerous health reasons concerning my babies and myself, took 3 doctors' advice and reduced my pregnancy to twins yesterday. I could write forever on why this was the best decision for me and my babies, but suffice it to say this was not done frivolously.I just want to be very honest on this forum and feel I have the freedom to do so without being judged. I struggled with infertility, so doing this was especially difficult and a pretty ghastly process.If anyone else has or does face this, you are welcome to pm me. If anyone thinks I am a horrible person for doing this, please don't pm me or rag on me here--it's truly the last thing I need right now. 99.9% of the ladies I have encountered here are wonderfully understanding and sweet, so I am not trying to insult anyone by saying this.Again, I am just being forthright b/c apparantly this issue is WAY more common than I knew, and not an issue people discuss. I am the type of person who will come forward and bring issues to the forefront in the hopes that someone else can be helped, and in the name of honesty.Thank you all in advance for allowing me to put this issue out there, and I pray none of you have to ever make this decision.",
    "timestamp": "1209647038",
    "title": "From Triplets to Twins",
    "user_id": "user_328927",
    "user_link": "/personal_pages/user/328927"
}