{
    "answers": [
        {
            "answer": "Well, before my Dr caught my high TSH, and reading what symptoms were what.  I think I experienced hyper symptoms with a high TSH, when I was on Levo, I accually had normal TSH but felt yucky, rundown, lazy.  Now I have been off Levo for 6 weeks and I think I feel more hyper again. I have energy, quite the appetite. But I also feel normal, like before all this thyroid nonsence.  I have to rest soon, not sure what it will say.The endo said I probably had postpartum thyroidis. (shrugg) Don't know I am just hoping my results come back normal and I can forget about all of it.",
            "post_id": "1948658",
            "timestamp": "1191443548",
            "user_id": "user_253837",
            "user_link": "/personal_pages/user/253837",
            "votes": "0"
        },
        {
            "answer": "thanks for your response - yeah I was hoping for post partum thyroiditis but mine was permanent - you may be a lucky one - I'll keep my fingers crossed for ya :) T.",
            "post_id": "1948770",
            "timestamp": "1191445800",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I have Hashimoto's toxicosis and have cycled up and down a lot. A whole lot. Forever. Well, not forever, but it seems like forever.The only significant indicator I have when I first turn Hyper is heart symptoms. Not racing heart. Pressure on the heart. A dull ache. Skipped beats and once in a while a little rev up for two seconds. A feeling that the heart is way past tired, and ready to just stop. Normal blood pressure and heart rate.The depression is worse, and eventually I get shakey, am hungry a lot and need to sleep a lot.I am tired and can't stand heat or cold whether I'm Hyper or Hypo. When I'm Hypo, my muscles hurt.I haven't tried playing with my meds. I'm sure it would help if one could anticipate one's hormone levels a day ahead, but I can't. The symptoms lag behind the actual levels. I'm sure I'm nearly euthroid right at the moment, but my heart still feels like I'm very Hyper.Hope I understood the question.I'm not thinking too fast today.",
            "post_id": "1948805",
            "timestamp": "1191446415",
            "user_id": "user_213044",
            "user_link": "/personal_pages/user/213044",
            "votes": "0"
        },
        {
            "answer": "thanks for your quick post - yes you answered my questions exactly and yes the symptoms do seem to lag behind the levels - I see internist soon and am requesting an mri of my thyroid as not even the endos have looked at it so I just want to cover all bases - I am also going to talk to her about taking my Levoxyl on as needed basis like I have been doing past week -( after last hyper episode even being only on 1/2 dose thought I would have a heart attack )- this as needed seems to be working so we'll do bloodwork again and probably in a couple more months and see if this works (this is the one method I havent tried in 6 years) so its worth a shot - I still believe there is a way to work with our body and avoid destroying it - I'm not giving up and hope you won't either - thanks T.",
            "post_id": "1949152",
            "timestamp": "1191452835",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hashimotos about 10 years a go, but I seem to go through phases of hypo where I put on weight, I'm tired, I lose my memory, I'm become unmotivated & depressed, all I want to do is sleep and I feel the cold.  Other times I am hyper and I can't stop eating yet I don't put on weight and lose it easily, my muscles ache, I can't sit down to a meal or watch TV without getting up and I have very little sleep etc.  I'm go,go,go and I'm full of ideas, enthusiasm and motivation.  So contrasting - like two different people and yet my T3, T4 and TSH levels appear to be the same regardless of what mode I am in.  I have just gone from Hyper back to Hypo and given my blood test results are unchanged, my Drs are just saying, 'things have caught up with you, that's why you are tired' but it's happened so many times before that I'm not convinced that it's unrelated to my thyroid condition.  Do you know of any way to manage which mode one is in apart from looking at blood test results?  My Drs seem unaware of this ability to 'switch' between hyper & hypo  Could I have Hashitoxicosis?  Any ideas on how it is diagnosed, managed & treated please?",
            "post_id": "1984425",
            "timestamp": "1192424415",
            "user_id": "user_300767",
            "user_link": "/personal_pages/user/300767",
            "votes": "0"
        },
        {
            "answer": "Hashitoxicosis is diagnosed by demonstrating a presence of anti-thyroid antibodies indicating Hashimoto's, along with a history of hypothyroidism that cannot be regulated along with frequent or prolonged bouts of Hyperthyroidism such that Thyroid replacement hormones must be discontinued by times.One method of treatment, that seems to fail consistantly, is to shut the thyroid down with Methimazole or Tapazol, and use replacement hormones like Synthroid or Armour to treat the drug induced Hypothyroid state.It can be very hard to diagnose. I was first diagnosed with a \"slow thyroid\" and put on Synthroid even though my chief complaints at the time all pointed toward Hyperthyroidism. My bloodwork said Hypo, so that's what I was treated for. I was tested every three months for a year and a half, and my bloodwork showed a need to up my meds every so often.Then I went in quite ill one time and my bloodwork showed I was extremely Hyperthyroid. Suddenly I had Grave's disease instead. After a lot of frequent bloodwork and a lot of horsing around with several doctors it was discovered that my levels were swinging up and down every week, and what my tests showed just depended on what day I walked into the lab.That \"one time\" was sixteen months ago and it has been hell ever since trying to treat it. After having lived with it for over three years trying to get regulated, I have decided the only way to treat it is surgery and RAI.My hope is that it will be controlled by Synthroid after the treatments, but I am starting to wonder if it will ever really settle down. I can't see how one could bounce up and down weekly if one does not have a thyroid, but the more I read the more complicated it seems.",
            "post_id": "1984717",
            "timestamp": "1192446574",
            "user_id": "user_213044",
            "user_link": "/personal_pages/user/213044",
            "votes": "0"
        },
        {
            "answer": "these stories are so familiar - bravo to those doctors who believe you - I saw 3 different endos in 2 different states - none of which believed you could fluctuate up & down and still be Hashimotos - 1 even overdosed me for months on Synthroid - I had double vision, blurred vision, \"sore eyes\" and was told \"you're old get glasses\" I had vision correction surgery 6 years prior and had perfect 20/20 vision until this quack - I was fine even w/ hashi prior to this staying on a lower dose - this jerk wanted me less than 2 tsh - I was bedridden for days, sick in many ways and lost my great vision in a matter of months - anyhow - after 6 years of egotistical doctors I now have a wonderful internist who is very knowledgable about all forms of thyroid disease and attends conferences frequently about these issues -  I stay on the low side to avoid going hyper and am doing everything I can to keep my metabolism up by exercise & strict diet of healthy foods - my heart goes out to those folks w/ more serious thyroid problems than mine - maybe more doctors will wake up and realize Hashimotos is much more than sluggish thyroid - it's a roller coaster ride and it's not fun - hugs T.",
            "post_id": "1985630",
            "timestamp": "1192466628",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "It's great to hear your comments.  Thanks AR-10 for your explanation on Hasitoxicosis.  Terri, I liked your last sentence as it's almost exactly what I said to a friend last week - it is about time that Drs reaslied Hashimotos is more than just a sluggish thyroid - it's a roller coaster ride and it's not fun at all.  The Blood test results seem so innacurate.  Interesting about the loss of vision, as mine has deteriated over the past years and I'm still young.  Does anyone else suffer bad allergies & asthma?  I have terrible probs with my skin, breathing and even food tollerence at times.  Just trying to get an idea if some of these things can be related.  Also, I did some reading about the possibility of Adrenal gland function being connected with Thyroid function where switching occurs between hyper & hypo.  Has anyone else heard of this?    Nice to know that I'm not alone with the switching between hyper & hypo.  I think I'm going to have to try your method Terri of keeping my synthetic dose on the lower side and working on increasing exercise & better diet too.  I'm not quite ready for removal of the gland just yet.",
            "post_id": "1987255",
            "timestamp": "1192494316",
            "user_id": "user_300767",
            "user_link": "/personal_pages/user/300767",
            "votes": "0"
        },
        {
            "answer": "I have had Hashimoto's for about 10 years. Initially, in my early 20's a doc discovered a lump on my thyroid and general swelling which they biopsyed but could not get a good sample of. A partial thyroidectomy was done to rule out cancer and the lump turned out to be benign. (follicular adonema). I was told that the remaining piece of thyroid would continue to function well and to periodically check my levels. At that time, I did not know that I had Hashimoto's. No one told me. And really, as if any twenty-something is going to go for blood work regularly! If it 'aint broke........Fast forward to age 31 when, after my second son was born I began to fall asleep standing up! I went to get my thyroid checked and was definately experiencing hypo symptoms. I started taking a low dose of Synthroid. I am now 36 and have been experiencing a few hyper symptoms lately as well as continued hypo and a goiter and another lump has developed which is also benign. I have been advised to discontinue the Synthroid and will see an endo in a month after getting my TSH and free T3 checked. I am wondering if anyone has had dizziness especially immediately upon eating? I also get teeth chattering, muscle soreness, a heavy feeling in the eyes and the weirdest one.......my left eyelid is sometimes noticeably droopy!!! I also notice that my lymph nodes in my neck swell and feel sore sometimes. I also developed celiac disease last year. Am I alone here? Does anyone share these symptoms? I suspect Hashitoxicosis and I hope that the endo will listen. I am tempted to get the rest of the thyroid removed to eliminate the swings",
            "post_id": "2579844",
            "timestamp": "1204308900",
            "user_id": "user_435737",
            "user_link": "/personal_pages/user/435737",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone,I am new to these kind of \"posts\", but find them extremely helpful and comforting.  I have Hashimotos--diagnosed Jul 2007, about 7 months after the birth of my son (first child.)  I felt horrible, despite my tsh only being 9.5 (I have heard that some people's tsh is really up there), but my antibody level was really high.  Was started on synthroid 50 mcg in middle Jul 2007.  Tsh has been \"fine\" over the last 9 months.  Despite my internist telling me to get it checked 3 months after starting, and if it was fine then, I wouldn't have to check it but once a year!!!  Fortunately for me, I am a nurse myself (however, I have found, that when it is you as the patient, all of the nursing mentality goes right out the window), so I persisted and had it checked 2 more times.   After only 3 months of synthroid, my tsh was down to 2.8 (end of Sep. 2007), and then I had it checked a second time about two months later (Nov. 2007) b/c I was feeling crappy again--at that time it was 2.3.  I was told to stay on the same dose and that it was \"perfect.\"  Well, back to feeling better for a while, at least.  In Feb of 2008 I had my routine gyne appointment and asked again to check my tsh--my periods were heavier anyway, and I just wanted to keep tabs on it.  This time it was 1.8 (which was about 7 1/2 months on meds.)  Which brings me to the present....I have again been feeling really crappy the last three weeks or so (April 2008).  Back to the brain fog, slow and sluggish feeling, and lots of weakness and fatigue.  This time, I am having some muscle twitching or something--not constant--but noticable enough.  I actually was freaked b/c it reminded me of when I was pregnant and the baby would kick--it's like a quick little jerk or something--calves, abdomen (sometimes).  It comes and goes---some days I don't have it at all.  I did have the weakness and sluggish feeling when I was first diagnosed, but didn't have this twitchy thing.  Of course, if you google muscle twitching, the first things that pop up are ALS and MS--which totally freaked me out!  But, I definitely have all the other \"thyroid\" symptoms-which, strangely enough, is comforting that I am quite sure it is related to my thyroid prob.  I have read all your posts and sounds like you can swing from hypo to hyper....great, what fun!!  I haven't yet had the pleasure of experiencing \"Hyper\", so I am wondering if you have any insight.  Anyone else have this muscle twitching thing ever?  I read in a lot of places that it may have to do with low calcium levels/parathyroid involvement??  As far as I know, my T3 and T4 were both normal.  Also, one of the posts I read was someone who had post-partum thyroiditis...do you a have Hashimoto's?  Because my diagnosis seemed to coincide with my pregnancy and delivery...I was wondering if eventually things would just go back to normal (i.s., meaning I would be able to go off of meds.)  I know that pregancy can trigger the problem, though.  Along with this intermittent muscle twitching, I am really achy, constipated, foggy, tired, and I am quite sure I am having some heart palps...not very often, but I have noticed a few little flutters here and there, and also having a strange feeling in my left eye (like it is swollen and something is in it) and find that my vision is a little blurry after reading a lot or doing a lot on the computer.  Pulse and BP are OK (so far--checking at home.)  Sorry post was so long...new at this and have lots of questions, but feel so much better knowing that other people are experiencing the same things.  It's scary.  The thing I find so strange, and perhaps very specific to thyroid (??), is that the symptoms seem to sort of move through in waves(there is the nurse brain in me!)  It's like one or two days of really bad brain fog, then a day or two of the muscular discomfort, and a day of constipation, and a few days of visual disturbance in some form...it is enough to make you think you are crazy!!!  I feel like I can't catch a break here!   I am going to call doc tomorrow and get my levels checked--I read some of you saying though that the sxs seem to lag behind the levels, so not sure what to expect.  I feel like I am having sxs of both hypo and hyper at the same time, but my gut tells me that I may be leaning torward hyper.  Also, does anyone feel that they have a certain \"range\" that they feel best at??   As my tsh has probably never been below like 4.0, roughly, then perhaps a tsh of 1.8 is too low for ME (although it is within normal limits)????  UUUGGGHHHHH!!!!  Thanks for reading and any input would be appreciated!!  Hope you are all feeling well......KS",
            "post_id": "2825365",
            "timestamp": "1209094265",
            "user_id": "user_490396",
            "user_link": "/personal_pages/user/490396",
            "votes": "0"
        },
        {
            "answer": "Everyone has a certain set point, with a range of 0.75+/-. So you have a 1.5 spread with the magic number in the middle.Each person has a slightly different set point, and it may change with age.It could be that you need a higher TSH, but your symptoms say otherwise. Could it be that you are getting some synptoms from the Synthroid?If you have high antibodies, you should be getting checked every three months, period.",
            "post_id": "2825453",
            "timestamp": "1209095870",
            "user_id": "user_213044",
            "user_link": "/personal_pages/user/213044",
            "votes": "0"
        },
        {
            "answer": "Thanks.  I guess I will wait and see,what the levels are.  I also was thinking about effects of the actual medication itself.  Anyone have probs with Synthroid versus other meds???",
            "post_id": "2827139",
            "timestamp": "1209137386",
            "user_id": "user_490396",
            "user_link": "/personal_pages/user/490396",
            "votes": "0"
        },
        {
            "answer": "Hi KS -I sent you a long post then it disappeared because I haven't been on here in so long my password expired - I had the twitching too and thought Parkinsons, ALS, etc. I was on too high a dose synthetic t4 - I also had constipation, huge swollen belly, no appetite but no full feeling when eating, slowed digestion, heartburn, - had this everytime I would be on any synthetic unless I stayed on too low dose - also had horrible edema, hands, feet, moonface, swollen skin above the eyes, I could go on forever- sluggish brain, bad memory, constant hair fallout, acne, migraines, the list goes on ad nauseum - I would have to stay on low dose or go on & off completely to get rid of side effects then start over - I also added Cytomel per doc (even he thinks this is a joke) and no matter how small the dose I was hyper, chest pain etc) so back to square one - also tried natural but only at doses 50mcg up to 100mcg - felt great but it also was too potent - anyway cut to the chase - I went back on the Armour in November but only @ 30mcg - have been great ever since - lost 5 lbs., made Honor Society @ school, (couldn't remember what day it was prior to this) running faster & longer, doing better @ the gym and my family sees a huge difference in my mood and me too - no side effects - just have to take 1/2 my 30mcg after my morning run on empty stomach - then other 1/2 just before lunch as it's potent but in tiny doses not even noticeable other than you feel great - also I drink a little coffee so I add way more decaf to the mix - anyway I hear your concerns about hashimotos - doctors think this is same as sluggish thyroid older women get - not the same - hashimotos toxicosis is going hyper/hypo - you will be more hyper @ night and more hypo daytime and t4 just gives you side effects and no help - see my previous posts about eyesight & t4 - anyway - I haven't been on here in awhile because I've been too busy & felt great - see what your doctor says about trying low dose of Armour to start - this is not for thyca patients - but I love it and it's only 10$ with or w/o insurance - yeah! Many others on here criticize natural but don't knock it unless you've tried it - I met a woman from UK who has been on it since the 60s and her american doc put her on synthetic instead and she went immediately downhill and asked for her Armour (natural) back - let me know what happens :) Terri",
            "post_id": "2827565",
            "timestamp": "1209143540",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I'm a bit confused, I've been told I've got Hashimotos disease is that the same as Hashimotos toxicosis or different. Only I'm swinging between hyper and hypo, but am mostly hypo in my bloods, even though my symptoms are more in line with hyper?! But my endo told me this week that I will definately end up hypo for good like the rest of my family in the next few months. But after reading what everyone has said here, it sounds like you can stay swinging for years? That's why I'm wondering if there's a difference between the two conditions?",
            "post_id": "2827719",
            "timestamp": "1209145899",
            "user_id": "user_440728",
            "user_link": "/personal_pages/user/440728",
            "votes": "0"
        },
        {
            "answer": "Thanks, Terri, for your quick reply.  It is so nice to know that there are other people out there going through this ****!!So, to re-cap, you are saying that you had a lot of these really annoying symptoms when you were on too high dosed synthetic T4 (hope I got that right.) Does that translate to Synthroid (or is it any type of synthetic replacement?)  Again, new at this, and trying to get the \"lingo\" down, etc.  So, it may mean that my tsh may be too low--or at least too low for me, right (and therefore, the synthroid dose is too strong or high--right)?  I won't hold you to anything, don;t worry, but just want to make sure I am following you b/c that is what I am thinking....that now (I've been on synthroid 50 mcg for about 10 months) maybe I am going the other way...HYPER!!!   I am getting blood work today, so will see what happens.  Glad to hear that you also had that muscle twitching thing...good piece of mind, and also glad to hear you are feeling better.  Thanks so much!!!p.s.  What is ARMOUR??  IS it an RX or over the counter??",
            "post_id": "2827812",
            "timestamp": "1209146904",
            "user_id": "user_490396",
            "user_link": "/personal_pages/user/490396",
            "votes": "0"
        },
        {
            "answer": "Good to hear that you are doing so well, Terri.:-)",
            "post_id": "2827895",
            "timestamp": "1209148312",
            "user_id": "user_213044",
            "user_link": "/personal_pages/user/213044",
            "votes": "0"
        },
        {
            "answer": "Hi KS -Here's what I've learned - Tsh is acronym for thyroid stimulating hormone - if your tsh is high number it means your pituitary gland is putting out alot more tsh to make up for your low t4 & t3 - so you want a lower tsh - I don't recall the exact numbers on the range but it's less than 1.0 to 4.5 or 5.0 - mine stays higher near 10 because if I go withing that \"official\" range - I am way too hyper (but that doesn't mean I have energy) so I stay higher tsh - but keep my t3 & t4 in range - also I've tried lots of synthetic like Synthroid, Levoxyl, generic synthetic, etc. but Armour is freeze dried pig thyroid - the problem some people have with it is that the t3 to t4 ration in a pig is higher than in a human so for some people they don't like it but I don't convert t4 to t3 so for me it's perfect - everyone is different - hashimoto's disease (named for dr. who discovered it) is when the body sees thyroid as invader and body attacks it and slowly destroys it over time until it doesn't work - hashi toxicosis is when your body is going hypo/hyper instead of just going more & more hyper - some people just take their thyroid pill & have no problem - others like us have all kinds of side effects - Armour is prescription but can obtain it through some naturopathic doctors (not actual md's) Endocrinologists & many gp's go ballistic if you utter the words Armour - it's been used since the late 1800s as rx for thyroiditis - that muscle twitching scared me to death - it got so bad when I was on 100mcg Levoxyl that I would lay on my arm to keep it from jumping around at night when I was attempting to sleep - my doctor (Endo) told me I imagined it or drank too much coffee ) make sure your doctor listens to you when you tell your symptoms - and ALWAYS keep copies of your blood test results and write your brand of thyroid med & dosage on every test and how you feel at that time - this has helped me keep track of what worked and what didn't - if your doctor won't help you - find a new one - good luck - let me know what you find out - research all you can about the tests your doctor has requested and others he hasn't - my doctor checked my Vit D levels & they were very low even though I eat healthy, work out & take vitamins - not unusual w/ thyroid patients to have low D - also a good doc will check antibody levels & many other levels - talk to him/her about this - the thyroid websites have good info about this too - Terri",
            "post_id": "2833514",
            "timestamp": "1209268742",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "Oh, I forgot to answer something else - I've been euthyroid all my life - like lesser symptoms of thyroid - but it got worse w/ my first son & then horrible w/ 2nd child (which is not unusual to get way worse w/ a 2nd birth) mine was not post partum - I will have this for life - anyway, no one ever diagnosed this problem - I self diagnosed @ age 42 and then had to argue to get doctor to test it and one even told me I was borderline and she refused to give me meds - I really hope someday research is done on this disease and the symptoms we suffer from so that thyroid patients are treated with the kindness & understanding other chronically ill people receive. T.",
            "post_id": "2833550",
            "timestamp": "1209269502",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "As a teenager I had a goiter. PCP put me on synthroid. Took it about a year and then I don't remember why but I didn't take it anymore. Always felt depressed. Was treated for depression for years. After the birth of my 6 year old I found a doctor who said I was hypo at tsh of 5 and put my on 75mcg of synthroid. Have taken it for the last six years.Started having cervical radiculopathy, raynauds, depression, fatigue, muscle pain, joint pain. Went through all the tests and nothing was wrong with my spine or anything else. I do have carpal tunnel.Just tested and now my tsh is at 1.67 so the doctor tells me I am fine and to keep taking the meds. I was also diagnosed with Hashimotos disease.Here are my symptoms:chest painnumbness, tingling, pain in arms and legsstomach pain after eatingeither no appetite or ravenousweight lossdiarrhea or constipationstart periods 3-5 days earlier than normal and are heavy with crampsheadachechillsfeel like I can't regulate body temp (either too hot or too cold)nausea at timesfatiguedepressedexhaustedcrying and irritableanxietydry lips and skinbrittle haireyes hurtforgetfulnessexhausted by any activityI think that my body is dumping the thyroid hormone all at once and then I get really sick. I have good moments. I can have a couple of days where I feel pretty good (not totally myself) but better than when I am so sickI take 75 mcg of synthroid per day and 30 mg of adderall for ADHD per day. Probably don't have ADHD. I think it is due to the thyroid inbalance. II have trouble writing and remembering words. At times my tongue feels like it has been scalded by hot coffee or a hot drink.The doctor seems to think I am crazy and \"difficult\" Keeps trying to put me on antideppressants but I know I don't have clinical depression.Anyone have any ideas?God bless us all that have to live this private hell every day. It seems like no one understands how I can be fine one minute and feel like I am dying the next. I want to be healthy and productive!!!!",
            "post_id": "2847026",
            "timestamp": "1209557717",
            "user_id": "user_495023",
            "user_link": "/personal_pages/user/495023",
            "votes": "0"
        },
        {
            "answer": "I saw your post and had to respond - I may get crucified by others on post but please ask your pcp if you can lower dose to 50 and see how you feel - try that a few months & see - I switched back to natural (Armour) but I tried lower dose of synthetic (like Synthroid, Levoxyl etc) and felt better @ lower dose - of course my test levels didn't look great - but I felt alot lot lot better - even 50mcg Levoxyl was too much for me & I had all the symptoms you mentioned plus many more - I finally went back to natural but @ a very low dose & now the best I've felt every - the test results say I should feel bad but feel great - go figure - a good doctor will listen to how you feel - not what the tests say - talk to him/her & find a new doc if they don't agree to help you find a dose and/or brand of thyroid med that helps you - good luck - you deserve to feel great - :) Terri",
            "post_id": "2857554",
            "timestamp": "1209748172",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "Believe me I understand everything you say. I have been to so many endocrinologists who either think I am making everything up or say they are just too busy to deal with my problems.  I believe that I had thyroid disease as a teen but it was not diagnosed until age 21 when I had Graves crisis. After a year of PTU they diagnosed me with Hashimotos. I have degree in nursing but my health is so bad I cannot work. After 32 years with Hashimotos you would think I could be well but it doesn't work like that. The thyroid has a mind of its own and yo-yo's up and down. You may have a normal TSH but still feel high or low.  8 years ago I began having terrible muscle and tendon spasms that no medicine helps. 3 years ago I lost all balance and now cannot walk a straight line and fall constantly. 2 years ago blackouts started - they come on with an aura of excessive yawning or horrible chills and then I am literally unconscious for up to two hours. After this I have to will my arms and legs to move and have slurred speech. 1 year ago I began to have severe abdominal pain and spasms after eating. Six months ago I began to have terrible pain in my arms and upper chest - tests show that my muscles are spontaneously tearing. In addition, I have such terrible headaches, joint and muscle pain I cannot sleep, My left foot is completely numb but feels like I am stepping on cold things. I have seen numerous neurologists who tell me that I have no sensory nerve function or reflexes but there is no cause for it. Could be thyroid related. I have taken synthroid which puts me on a roller coaster of TSH values (highest 81), then Armour  thyroid which did the same thing, now I am taking a compounded med of T3 (not Cytomel) dose 60mcg twice a day.  I really don't think anything helps. My husband of 28 years just thinks I am mean but the truth is I am so depressed, exhausted and in so much pain I just can't handle much. Anyone have suggestions?  By the way I also have low VitD and B12 levels (but B12 shots lower the level), and and a high sed rate which indicates inflammation. My real worry is that I will develop thyroiditis and vasculitis and have another stroke (first one in 1990). I am a tough old bird (52) and I just keep going. I also had breast cancer at age 38 that the doctors said was due to my thyroid. GREAT!!!   One last thing don't just accept the diagnosis of carpal tunnel because I read an article about how hypothyroidism can cause thumb and hand pain and I truly experienced that when I was really low!  Thanks for letting me vent, no one seems to care that I feel the way I do.",
            "post_id": "2857786",
            "timestamp": "1209751457",
            "user_id": "user_336005",
            "user_link": "/personal_pages/user/336005",
            "votes": "0"
        },
        {
            "answer": "you are an amazing woman ! What has your doctor said about RAI or removal of thyroid - it sounds like your life would only be better without it as it sounds like it so bad it's damaging the rest of your body - hashimotos does cause muscle spasms & carpal tunnel - I read that in several different sources - you sound like you go into hypothyroid coma - I can't believe a research hospital isn't looking into your case - is this a possibility in your city/town? The losing balance/spasms etc are things I only experience when I on too high a dose of synthetic & my TSH is less than 10 - go figure ! It sounds like we have similar side effects but from different brands & different amounts - I can't for the life of me figure out why the medical community isn't doing something - at least acknowledge that these patients are not crazy - I hate egotistical doctors who refuse to listen to their patients - my very best to you & I hope you will prevail in your search to find the solution.....T.",
            "post_id": "2860719",
            "timestamp": "1209824979",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I am so glad I found this thread. I was diagnosed w/Hashimotos just this year. I have been so confused b/c my TSH showed hyper, then normal, then hypo, and hyper again since Feb. This has all been since last June. The first endo wanted me to take meds for the hypo, but I did not and it swung hyper on its own. Now my new endo wants me to take tapazole, but I am not sure. I do not really have too many symptoms and I do not want the meds to take me in the opposite direction and make me have symptoms. This is a very frustrating thing and it is hard to get straight answers from the doctors. They just want to put me on meds, but not explain it. So I have been coming here for answers. I thought Hashimotos was supposed to be hypo, so this helps me realize this can be the normal course of things.",
            "post_id": "2865082",
            "timestamp": "1209939523",
            "user_id": "user_247031",
            "user_link": "/personal_pages/user/247031",
            "votes": "0"
        },
        {
            "answer": "Check out Hashimoto's encephalopathy. I just wrote a whole lot on medical community thinking I ws writing Dr. Lupo. I must be very loopy today. I am having bad time right now. Doctors say it is lupus, don't know if I agree.",
            "post_id": "2872010",
            "timestamp": "1210086201",
            "user_id": "user_336005",
            "user_link": "/personal_pages/user/336005",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone,To hoopie65:  It is so amazing...all of the things you described, I have had them over the last year.  Like many of us have said, it seems to come and go....a few bad weeks and then a break for a few weeks.  That is what I think ultimately makes people think they are crazy...it's like you keep waiting for the next \"thing\" or \"symptom\" to start.  It is terrible!To Terri:  Thanks Terri, for your insight and replies.  It sounds like you have done a lot of research and trial and error.... I hope to eventually feel better and back to \"myself\" sometime!  This post has been a great source of support for me and really helps me feel like I am not alone...thanks to all.An update:  I had my blood ckecked at my PCP actually just yesterday.  Was hoping to get in earlier, but the office didn;t call me back and then they were closed, etc, etc.  I would have liked to have my levels checked about 3 weeks ago--when I first posted here and was feeling horrible.  But, that didin;t happen,  Plus, it seems like sometimes the levels don't give an accurate picture anyway--either they are normal and you feel horrible, or if they are out of whack, you might miss it as the symptoms may lag behind.  Anyway.....My TSH was 1.63, T4 was 1.1, and antibodies down to 256 (from > 1000 in June 07.)  They didn't check T3--I had to barter for them to even check the antibody level!!!!   So, on paper...everything is, of course, \"fine.\"  My doc told me to stay on 50mcg per day.Last week I felt really pretty good...the muscle weakness and brain fog had gone.   I was still having a funny feeling in my left eye occasionally, constipated, and a few muscle twitches (but much less than a few weeks prior.)  Otherwise, though...pretty good.Hah!!  Just started yesterday having some GI fun...sort of had this wierd metallic / acidy taste in my mouth yesterday and most of the day today.  No particular \"heartburn\", but I am burping more than usual????  not too bad, but just another one of those \"fun\", transient symptoms (I hope!)  I also did have some gurgling (like my stomach was revved up), and a really soft BM (lovely!)--  HYPER???  Again, a TSH of 1.63 might be too low for me--that's was I think.  Considering I felt great with a TSH of 5.5 (prior to starting any meds or even being diagnosed, but GP at that time jsut sort of gave me the heads up, but I felt completely fine and didn't go on meds).....hhhmmmm.A few last thoughts/questions:Anyone else have a wierd taste in their mouth or bouts of acid reflux?  I have never had any GI symptoms to speak of, so maybe it was just   something I ate-- I don;t know.  It is really very mild.d  But, since all these things keep popping up, I just assume that they may be related to my Hashi's / thyroid.I have an appt. with an Endo that was ref. to me by 2 co-workers who really like him--one has Graves, the other, Hashi's.  The appoint. is not until July, however!!  But, i am going to wait....what else can I do?  I am going to bring all of my labs and questions with me...so I hope he will have some insight.  But, in the meantime, if I should need or want to have my \"levels\" checked again....what is the standard, or should I say, what is the standard that I should ask for.  TSH/T4/T3/antibodies??  All???  Just curious what anyone else has routinely checked.   B/C I have an HMO (lovely managed care), it's like pulling teeth to get anything done.  The Endo that i am seeing is not even in network, and I am just paying out of pocket for the consultation--and if I need to change ins., etc, from there--I will.Does anyone know or has anyone experienced any changes in regard to the antibody level decreasing?  I am not sure if the fact that the antibody level has dropped significantly would make me feel any different..is it supposed to make you feel better, worse, or maybe doesn't matter at all??Also, I haven't had time to research \"adrenal\" involvement, but have seen that idea thrown into the mix here and there.  I wish I could just be \"happy\" with the fact that I have thyroid disease (Hashi's), and attribute my symptoms to that.  But, because I am so up and down, I get worried that there is something else wrong, even though Hashi's seems to be the likely culprit for everything I experience....it's frustrating.  Everytime I get a new symptom, my mind starts racing to figure out what else it could be!   UUGGHHH!Thanks for listening!  Good luck to all...take care!!",
            "post_id": "2875135",
            "timestamp": "1210128618",
            "user_id": "user_490396",
            "user_link": "/personal_pages/user/490396",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hashimoto's about 4 months ago, but previously had been treated for Hypothyroidism beginning a year prior (TSH about 7.5 at that time).   When I was diagnosed with Hashimoto's, my TSH was normal, however, my antibodies were way up.   The endo stopped the Levothyroxine I had been taking to see if my other symptoms (anxiety, muscle tension) would go away with stopping the meds.  4 months later the symptoms are still there.  I was previously put on antidepressants for the anxiety, which I just now in the process of getting off of.  My symptoms of being anxious with the muscle tension go away later in the day, and I am perfectly fine from about 3pm on through the rest of the day.Has anyone else experienced this phenomenon of side effects that consistently occur daily but only for a portion of the day, and then go away?   Thanks for your input and I wish you all the best.",
            "post_id": "2877466",
            "timestamp": "1210181506",
            "user_id": "user_501637",
            "user_link": "/personal_pages/user/501637",
            "votes": "0"
        },
        {
            "answer": "Yes, I too feel like symptoms are at certain times of the day.  Usually I am fine in the early morning, at home when I am getting ready for work, etc.  Then around 9:30am things start acting up.  I feel like my worst time of day is between 10-4pm.  I also usually feel better in the evenings as well.  Hang in there!",
            "post_id": "2877495",
            "timestamp": "1210181926",
            "user_id": "user_490396",
            "user_link": "/personal_pages/user/490396",
            "votes": "0"
        },
        {
            "answer": "Thats interesting about antibodies going down - wouldn't that be a good thing? Something I've known about but didn't realize I had - vitamin D deficiency very common with this and my doc tested me and I was so was under the range so after precscription mega dose I was up to par & then continued on maximum dose according to health recommendations then tested 6 mos. later - very very bottom of range - so now I'm taking just over maximum to see if this helps - this is not a water soluble vitamin so have to be careful but already my nails, hair, skin better - just a minor thing but I'm such a health nut as well being vitamin deficient would be an unusual thing for me - be sure to have your doctor check vitamin D levels especially if you live north of Atlanta, Ga area as this seems to be the point at which too little sunshine is an issue w/ vit D levels during winter etc - hope you both are feeling better - T.",
            "post_id": "2885682",
            "timestamp": "1210340544",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I feel bad jumping into this forum, but after reading all your comments and realizing the amount of experience and knowledge, I was hoping someone could help me figure this out.  I am a 28 year old male and have seen numerous doctors with mixed diagnosis.  This all started for me about 5 years ago...waking up one morning complaining my eyes felt off, dizziness and my left ear hurt.My results and ranges are below.  I cannot gain weight no matter what I eat, I'm not tired, but have insomnia, breathless or shortness of breath, anxiety, depression, my eyes hurt, nervousness, my body feels like it's on turbo speed half the time, cannot tolerate the heat, but I shake like a bobblehead in the cold, hot flashes, shakiness all the time, headaches and almost constant diarhea.  I have a tough time waking in the morning and am shaking when I do.  My worst problem, is my eyelids feel as though they weigh 50 lbs. each, my right eye is sometimes noticeable smaller than my left and my eyes feel as though they are off (like unbalanced).  I am being treated for hypo, but definately feel hyper!  Any suggestions, comments or ideas on what it is or where to go from here?  I have never had a scan of my pituitary, thyroid, adrenals or thymus gland (which have been suggested).Results: Ranges:10/12/05:TSH: 1.20 0.40 - 5.5 MU/L2/21/06:Free T4: 0.91 0.59 - 1.17 ng/dLTSH: 0.94 0.35 - 4.82 uIU/mLT-4, Total: 6.4 4.5 - 12.0 MCG/DLT-3 Uptake: 34.6 25.0 - 35.0% Uptake8/15/06:TSH: 1.11 .34 - 4.82 uIU/mL10/12/06:TSH: 1.20 0.40 - 5.5 MU/L6/21/07:T-3, Free: 377 230 - 420 PG/DLT3, Reverse: 0.19 0.11 - 0.32 ng/mLFree T4: 0.73 0.71 - 1.85 NG/DLTSH: 1.39 0.50 - 5.00 uIU/ML7/17/07:Here are the saliva test results;fTSH 57 NormalfT4 0.25 Normal Normal: 0.17-0.42 ng/dlfT3 0.27 Borderline Low 0.21-0.27TPO PositiveE2 (Estradiol) 9 Male (20-49 yrs): 1-3 pg/ml, Male (50-85 yrs): 1-5 pg/mlP1 (Progesterone) 30 Male (adult): 5-95 pg/mlTTF (Free Testosterone) 34 Male (20-30 yrs): 60-110 pg/mlCortisol:7:00-8:00 a.m. 6 Depressed 13-24 nM11:00-Noon 4 Depressed 5-10 nM4:00-5:00 p.m. 3 Normal 3-8 nM11:00-Midnight 5 Elevated 1-4 nMCortisol Burden 18 23-42DHEA 4 Normal 3-10 ng/mlMy morning Cortisol blood test was 19.3 (Range: 4-22 MCG/DL).Antibodies test was negative.8/7/07:TSH: 1.80 0.50 - 5.00 uIU/mL9/12/07:Free T4: 0.75 0.71 - 1.85 NG/DLTSH: 1.27 0.50 - 5.00 uIU/ML1/19/08:Free T4: 0.66 0.71 - 1.85 NG/DLTSH: 0.17 0.50 - 5.00 uIU/mL1/30/08:TSH: 0.95 Range: 0.50 - 5.00 uIU/mLEstradiol, Serum <32Estradiol Reference Ranges:Male: <=54It goes on to say no pediatric reference range established.T-3 Uptake: 40.31 High Range: 25.0 - 35.0% UptakeT-4, Total: 5.7 Range: 4.5 - 12.0 MCG/DLFree Thyroxine Index: 2.30 Range: 1.12 - 4.20T-3, Total: 93 Range 60 - 181 NG/DLTestosterone, Total: 393 Range: 241 - 827 NG/DL",
            "post_id": "2898596",
            "timestamp": "1210648062",
            "user_id": "user_134692",
            "user_link": "/personal_pages/user/134692",
            "votes": "0"
        },
        {
            "answer": "Dear Friend-You sound hyper for sure - get a good Endocrinologist if you don't already have one - your tsh is so low - which would explain the shakiness etc - I hope you have insurance - please get to a good Endo in your town/city - also I would send this same post to the doctors forum on this website to see what he says - good luck to you & keep us posted what you find out - Terri",
            "post_id": "2900582",
            "timestamp": "1210697459",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "i just want to say that I just found this site and the comments I've read make me  feel much better. As an older woman, 54, diagnosed with Hashimmoto's and grave's three years ago I find that I too have been going up and down week by week between hyper and hypo. Now I have been told that my cholesterol is over 240. Is this a hypo symptom. i never had this before. also, since I am going through menopause, I think that the doctor's all say it is menopausal, but I have many hypo symptoms most of the time with some hyper days. I go to the endocrinologist next week so I'll see what she says. But it is great to know that it is not all in my head.thanks for the posts",
            "post_id": "3006673",
            "timestamp": "1212789924",
            "user_id": "user_529550",
            "user_link": "/personal_pages/user/529550",
            "votes": "0"
        },
        {
            "answer": "I just started this forum today.  I am so frustrated and completely confused by all of it.  Your comment sounded the most like me with the exception that I just found out in June I have Hash.  I didn't have a goiter or any physical symptoms.  I think this has been coming on for years and I just didn't realize it and have been treated for so many other things, depression, anxiety, panic attacks, carpal tunnel, the list goes on.I am so completely confused as to how my TSH levels are \"normal\" but I feel so terrible.  Right before I was diagnosed I had to have back surgery in February and before that I had gained about 40 lbs.  I then lost 40 lbs. fairly easy before the surgery and after the surgery got even skinnier because I became very ill with what I thought was the flu.  Then I went back to work crying because I was so tired and colder than I have ever been in my life.  I can't think straight - my thoughts are all over the place.  I forget everything and get confused as to which is right or left.  I could go on and on.  I am also on Levoxyl 75 mg. daily and I was diagnosed as B-12 deficient so I take weekly shots for now.  I don't feel any better really.  I have days where I think yes, its working a little and then BAM the next morning I don't even know what day it is.  My eyes are beginning to hurt like they are scratched.  The thing you mentioned with your tongue is something I experienced and they said it was an iron deficiency - maybe it could be your B-12 as well.I am just on here looking for answers.  They tell me thyroid tests are \"normal\" but I feel terrible.  When do they increase meds if ever?  I just don't know what to do at this point and had been researching the Adderall but I'm not sure if that is for me either.  I have gained weight back but it is maintaining around 10 lbs.  I really haven't even talked to my doctor about this since the initial test, the nurse just called and said you are this and you this and come in get shots and take this medicine, etc.Any answers anyone can give me are appreciated.   Thanks.",
            "post_id": "3312637",
            "timestamp": "1219424511",
            "user_id": "user_597354",
            "user_link": "/personal_pages/user/597354",
            "votes": "0"
        },
        {
            "answer": "my personal experience is that the blood work results don't match how i feel. when i first was diagnosed as Hashi, all my blood word results were just in the middle of the range, but Dr put my on Synthroid, due to the anti-body, symptoms, and my gland was slightly enlarged. my last blood word result shows i am bit towards hyper, but i actually feel very hypo.. i learned here that basal body temp is another factor we can consider, so i started to measure that every morning and my temp have been under 97.8 all the time, this matches how i feel..hypo. perhaps you can check BBT as well see where you are at, if you have the symptoms, and your BBT is constantly lower than 97.8,  you need to talk to  your Dr see if he/she will raise the dose.hope this helps. i know how frustrated it can be.",
            "post_id": "3312786",
            "timestamp": "1219427106",
            "user_id": "user_410801",
            "user_link": "/personal_pages/user/410801",
            "votes": "0"
        },
        {
            "answer": "Thank you.  It's funny that you would mention BBT - mine has constantly for years been 97.6 or slightly lower.  Anything over that and I am feverish.  I asked about the dosage the last time I was there and they said it was too soon so I have to wait until October to have my blood rechecked again.  Everyday I feel new symptoms, anger outbursts, scratchy eyes.  I don't have an Endocrinologist - do you all think it is imperative to have one or is a family practioner qualified enough to  make these determinations?  I love my doctor but I don't want this to continually get worse.  Every week they ask if I feel better yet and when I say \"not really\", the nurse looks at me like I am crazy.  I should direct her to this website.",
            "post_id": "3313171",
            "timestamp": "1219433390",
            "user_id": "user_597354",
            "user_link": "/personal_pages/user/597354",
            "votes": "0"
        },
        {
            "answer": "I haven't felt my old self again since last year i was diagnosed. so believe me, you are not crazy. like today. i feel very blue, and it's Friday! normally i feel happy on Friday. if you can't see your Dr sooner, i don't know, if you want to try to raise the dose just a little bit yourself? I am doing that myself... you can always cut back. just be very careful, don't go beyond 25 mcg.  also some people think take selenium helps.with regard to Dr. VS. Endo....personal experience, the Endo i saw didn't help much, he just orderred a whole bunch of tests(he suspected my adrenal as well), when the result all came back \"normal\", he didn't even bother to listen to how my feel and asked me to go back to my family doctor..... since you have good relationship with your family doc, perhaps you just need to raise more questions next time: for example, can  you put me on a different medicine?  do you think this dose is right? or do you suspect i have other issues?Gee, hope this helps.",
            "post_id": "3313357",
            "timestamp": "1219437089",
            "user_id": "user_410801",
            "user_link": "/personal_pages/user/410801",
            "votes": "0"
        },
        {
            "answer": "I know what you mean about feeling blue today.  I do too and it's not normal for me. I am always the smiling happy funny person and no one knows how to react to me these days.I was thinking that might be the case with the Endo dr.  but I wasn't sure. My daughter had Graves and took the Radioactive Iodine and is now full blown Hypo and she always saw an Endo and he didn't do any more than our family dr.  I think you're right - I just need to actually talk to the doctor about it instead of the nurse and just sitting idly by while they mess around with my health.  It's just so new to me and honestly, when they told me I had this, I thought it would just go away after a few months on medicine.  No one told me anything.  What little I know is from researching the internet and until I got on this site, I had no idea how horrible this disease is - I thought \"no big deal, take some pills for awhile and you'll be ok.\"  hmm.....guess I was wrong huh!! LOL",
            "post_id": "3313449",
            "timestamp": "1219438506",
            "user_id": "user_597354",
            "user_link": "/personal_pages/user/597354",
            "votes": "0"
        },
        {
            "answer": "I don't know if I'm bipolar or if I'm swinging back and forth between hypo and hyper with Hashimoto's Toxicosis.I've struggled with Hashimoto's for decades.  I've had all kinds of horrible problems with it...tired, cold, body aches, foggy brained, falling asleep all the time, chronic sinus infections, dry skin (especially dry cracked heels), hair falling out and the hair that didn't fall turned gray/white within a matter of months (Was only in my 30's when this happened!  Way too young for gray/white hair.), rapid large amount of weight gain within a matter of months (especially around my middle), elevated blood pressure, elevated cholesterol, GERD, glaucoma, bowel problems (alternate between constipation and diarrhea), \"female problems\" (irregular periods, then no periods at all, then developed ovarian cysts, then developed large fibroids and had hysterectomy), moon face and neck swollen, facial hair growth, strange hump at the back of my neck, weird looking purple marks on my stomach, breasts, hips, thighs, night sweats, heart alternates between skipping beats and rapid beating and the list of symptoms goes on and on.  On another message board it was suggested I might also be suffering from PCOS and/or Cushing's Syndrome besides Hashimoto's.  Will see my doc again in a couple of weeks and will discuss this with him.I'm on Armour Thyroid.  Doc worked me up to 3 grains (180 mg) and I still had low thyroid symptoms so he upped my dosage to 4 grains (240 mg) which I understand is a very high dose.Now I bounce between feeling hyper and hypo.  My last lab said my TSH was 0.02 which is extremely low, but doc says I'm OK and not to worry about low TSH.  Hmmm...don't know about that.Anyway, the worst of it all for me is the swings between hypo and hyper and the mood swings.  I go from being very manic to being very depressive.  Love the highs, hate the lows.When I'm low I'm difficult to be around.  My husband has to walk on egg shells around me when I'm at my worst.  Friends and relatives stay away from me when I'm like that.  The depression is so bad that there are days I don't want to get out of bed.  Went to doc and complained about depression and doc prescribed antidepressants.  I went online and read about the antidepressant he prescribed and I didn't like the list of possible side effects so I have not taken the antidepressant.When I am experiencing my lows, I don't want to get out of bed.  Everything from my head to my toes aches.   I move very slow and talk very slow and sluggish and have a difficult time thinking clearly.  I have trouble finding the words I want to say and forming sentences.   I can't remember from one minute to the next.  My short term memory is shot when I'm in a depressive state.  In my depressive state I think very negative thoughts and I cry a lot.When I experience the highs, I feel euphoria.  I'm so up I want to do cartwheels around the house!  I talk constantly and fast, I am antsy and can't sit still.  Can't sleep.  Can't even concentrate on TV or a book and all I want to do is get out of the house and go go go.Does anyone else have these extreme mood swings?  I'm wondering if my very high highs and very low lows are from Hashimoto's Toxicosis or if I'm actually bipolar.",
            "post_id": "4042381",
            "timestamp": "1235895999",
            "user_id": "user_503817",
            "user_link": "/personal_pages/user/503817",
            "votes": "0"
        },
        {
            "answer": "test message",
            "post_id": "4049148",
            "timestamp": "1236061564",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "Hi there, just wanted to say by all means have your doc check for anything else you or he/she thinks could be wrong (especially if your insurance will pick it up) On the other hand it does sound like you could have gone hyper - which happens to many of us so always err on the cautious side and ask doc if you could try lesser dose to see how you feel - hyper doesn't always mean energy or weight loss - this often has the same effects as hypo but far harder on your body. Be careful especially with Armour - it's way more potent due to having t3 component. I just found a new doc who will test all my hormone levels besides thyroid so I did blood work and now am waiting to do saliva test for other levels and cortisol, adrenal etc. Also, this doc treats only w/ bioidentical hormones not chemical or pregant mare's urine, ie. Premarin, Depo, etc. Do get your hormone levels checked, also, I quit eating wheat 9/23/08 and this solved alot of gastro problems - also, I exercise and eat no hydrogenated oils and eat organic, no hormone foods. All these things do a world of good for folks w/ immune system problems like Hashimoto's. Also, started accupuncture w/ a doc at a teaching hospital and taking chinese herbs. This has helped me feel fabulous, down side is it is expensive for accupuncture. Went to an endo at same hospital and he couldn't get over how small my thyroid is - it used to be huge, now I swallow handfuls of vitamins no problem. Do all you can to help yourself. I wish I could be of more help. I went off all thyroid hormone 3 months ago and feel great because I eventually go hyper even on only 15mcg a day. I know my tsh has gone down 10 points since accupuncture and herbs so right now I will see what happens with other hormones which are low (estrogen & testosterone) and will then think about dealing with taking thyroid hormone again. Wish I had some insight for you but I always used to ask doc to lower dose to see if I felt better because the hypo/hyper thing gets so confusing it is sometimes hard to tell what you are so worst thing is to go too high as you don't want to go hyper.***Be sure to get vitamin D checked - this is often low in thyroid patients and can cause depression if too low.By all means take vitamins if you need to. Best wishes.",
            "post_id": "4049181",
            "timestamp": "1236062873",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "Hello, yes I have hashimotos, it was found out 3 years ago, I have family history of thyroid conditions, my grandmother my mother and my sister, my sister was found to have hashis to, 3 years ago I had 4 months of feeling rotten, feeling sick, tired, really run down, i have come down sick again its been about 4 weeks now it is the same thing, my thyroid levels are normal, i have the goiter and enlarged thyroid with nodels, I can feel it in the left side of my neck it chokes me, it takes me ages to eat a meal, my hair is dry, my throut feels dry, when i burp my thyroid hurts on the left side, my weight has gone up, i have reflux, I am not on thyroid medicine but my sister and mother are, and my grandmother was to, my head feels foggy and i have really bad headaches, my hands and feet are cold and sweat alot, i have heart flutters about twice a week, other times more flutters. I wake up in the middle of the night with coughing fits, muscle sore throut, i carry a water bottle with me everywhere in case i have a coughing fit. well i think thats everything, my thoughts r with u all.",
            "post_id": "5118658",
            "timestamp": "1259222903",
            "user_id": "user_1109439",
            "user_link": "/personal_pages/user/1109439",
            "votes": "0"
        },
        {
            "answer": "did you say you were'nt on thyroid meds? It really sounds like you should be if you were diagnosed with Hashimotos. Don't let all of our problems scare you off - many people take thyroid meds with no side effects and they feel great. We just happen to be the exceptions to the rule.",
            "post_id": "5124821",
            "timestamp": "1259447371",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "Have you read about parathyroids? They are not related to thyroids, except to be neighbors. Check out the site: www.parathyroid.com, also B12 neuropathy. B12 is often cucurrent with hypothyroidism, but doesn't look like a cause and effect, but still researching this.KatT333",
            "post_id": "5585584",
            "timestamp": "1271619086",
            "user_id": "user_1284422",
            "user_link": "/personal_pages/user/1284422",
            "votes": "0"
        },
        {
            "answer": "In my experience, taking the thyroid meds can lower your magnesium.  Taking vitamin D also lowers magnesium.  So often doctors only test for D, then you are already low on magnesium AND taking d which lowers it further.  Get your Magnesium RBC checked - NOT just the regular magnesium, insist on the RBC test.Good luck.And PS - I have hashimotos and was in the ER with .03 TSH a few weeks ago.  I was going into thyroid storm.  Everyone is different so PLEASE don't try to make your hashimotos close to zero if it isn't right for YOUR body.  If it is GREAT.  If not, be careful. It could kill you.",
            "post_id": "5662870",
            "timestamp": "1273447251",
            "user_id": "user_1308535",
            "user_link": "/personal_pages/user/1308535",
            "votes": "0"
        },
        {
            "answer": "Just wanted to ask is it likely to switch between hypo and hyper for the rest of ones life?? I couldnt bear that! Im more hyper but tests show hypo. I feel like there is so much strain on my heart. Does any1 else feel that?Have to say I feel so comforted and normal reading these threads.Thanku every1",
            "post_id": "5664486",
            "timestamp": "1273501868",
            "user_id": "user_1308034",
            "user_link": "/personal_pages/user/1308034",
            "votes": "0"
        },
        {
            "answer": "Hi - not all of us with Hashimoto's go hypo/hyper but some do and doctors don't always believe us because they will say your lab values are perfect or you're still hypo (but we feel hyper). A good doctor will listen to how you feel not your lab values. I tend to stay a little more hypo (with my doctor's okay) because hyper makes my heart hurt and I'm too out of breath. Talk to your doctor - if he/she is listening then your doctor should find a happy medium with you to feel better. By the way, I was tested for Graves too and it was negative for the antibodies - some of us just react this way and there are numerous theories why. It may take some months to find an amount that works for you with your doctors help. Hope it all works out for you!",
            "post_id": "5668835",
            "timestamp": "1273594154",
            "user_id": "user_285309",
            "user_link": "/personal_pages/user/285309",
            "votes": "0"
        },
        {
            "answer": "I agree with CourageToHeal.  My thyroid nightmare started as preeclampsia back when I was pregnant 11 years ago.  I bloated up like a tick, got jaundiced, looked and felt like poo.fast forward 8 years.   Systemic poison ivy necessitates Prednisone treatment for 3 months.  Extreme reaction prompts dermatologist to take me off prednisone COLD TURKEY.    End up in Emergency Room for Cushing's Syndrome caused by Prednisone.Fast forward another year.  I end up in ICU for edema so extreme that my lungs fart, my heart is enlarged, and abdomen is very distended.  Idiot doctor diagnoses Congestive Heart Failure (falsely) and suggests a lap band because my \"60 pound weight gain over 2-1/2 months must be to over-gorging\" myself. Heart pounding out of chest.  Out of breath.  Vertigo, night sweats, flush when voiding, narcolepsy, chills, cold extremeties, rash (for 11 years now) on arms that comes and goes, periodic hair loss, blurred vision, headaches and ringing in my ears.  Doctor suggests I must be bipolar or depressed. (DEPRESSED????   Ya THINK?!?!?!)  His solution to the edema is to put me on Torsemide and Furosemide to keep water at non-dangerous levels and fails to warn me that they FRY your kidneys.Fast forward 1 year.  Get second opinion on Congestive Heart Failure at Heart First.  No CHF anywhere.  Enlarged right ventricle from edema, but no plaque, no congestive anything... great circulation from head to toe.   PreHypertensive.Fast forward 2 years.  Ob/gyn takes one look at me and says that although my TSH and T4 look 'a bit low, but nothing significant' puts me on 20 mcg of synthroid.  Over half my symptoms (but not the edema) get much better.Fast forward to 4 months ago.  Ob/gyn says she's going to triple my synthroid because it isn't working as well anymore, and she's \"operating on a hunch\".Fast forward to two weeks ago.  Doctor who claims the swollen lymph nodes I'm concerned about (because 90% of the time they mean cancer) are nothing more than an enlarged thyroid.  Orders cat scan and sonogram to prove to me I'm being hysterical.Fast forward to today.  Cat scan and sonograms both suggest prior surgical removal of thyroid... because left side is MISSING and right side is \"remnant, probably missed in removal surgery\".  Thing is, I had no reason to have my thyroid removed because everyone insisted my thyroid levels were normal the whole time. Cat scan also reveals cloudy liver, \"probably fatty deposits\".  Suggests biopsy to make sure.Fast forward to this coming Monday.  Having entire abdomen lined with mesh to repair 6 hernias caused by abdominal distension, having gall bladder removed (large stone) which because of mesh, later removal would prove 'most problematic', and liver biopsy.  Two weeks from now, going to rheumatologist and oncologist to rule out other scary things.  But the writing is on the wall:  My doctor is an idiot, probably failed high school anatomy, and completely missed Hashi's toxicosis and myxedema.  Ob/gyn probably saved my life.In any event, enlarged lymph nodes are probably from Hashi's.  God knows it's pretty much run its course (because there's nothing left of it), and I'm lucky to be alive.The symptoms that started with my pregnancy (preeclampsia) never completely went away.  They just waxed and waned.  I am convinced that since liver deposits/damage are caused by preeclampsia, and because preeclampsia is also an autoimmune response as is Hashimoto's, there MUST be a connection.",
            "post_id": "5679647",
            "timestamp": "1273814832",
            "user_id": "user_1313420",
            "user_link": "/personal_pages/user/1313420",
            "votes": "0"
        },
        {
            "answer": "Your life will never be the same once you get this disease.  I had every medical problem in the book.  The toughest part is that it seems to mess with your emotional well being.  I have never felt the same as my pre-thyroid days.  I have high BP, all kinds of immune system problems, advance sinus disease, etc.It is just one thing after another.I was diagnosed with Graves dieases/enlarged thyroid gland and then the it burned itself out after a year and went hypo.  It was unbalanced for the first five years and then it settled down.  It seems that I have never returned to my previous emotional state.",
            "post_id": "6008232",
            "timestamp": "1281379395",
            "user_id": "user_1408167",
            "user_link": "/personal_pages/user/1408167",
            "votes": "0"
        },
        {
            "answer": "Wow! You've been through hell and back. How awful! Hugs.I had pre-myxedema and was quite ill so I know what that is like. By the time a doctor treated me with a high enough dose of thyroid medication she told me I had about three weeks to live. I could barely lift my hand to pet my cat who was sitting on my lap.The first doctor to treat my thyroid disease under treated me. As a result I suffer from the bounces - back and forth between hyper and hypo. She also told me I have \"garden variety\" hypoT and so did the next doctor who treated me. However, my endo says I have Hashimoto's.Right now everything is okay for the most part. I just got over being hypo again after being close to hyper again, my TSH was .71 and I was losing lots of weight without much effort. What sent me over the edge was another attack of thyroiditis this last winter.I haven't been stable since first treated in late 2003.",
            "post_id": "6035866",
            "timestamp": "1282028349",
            "user_id": "user_263988",
            "user_link": "/personal_pages/user/263988",
            "votes": "0"
        },
        {
            "answer": "I was having terrible symptoms with a normal thyroid level. The antibodies however were high. My endo started me on a lose dose of Synthroid. I then complained that I was just getting worse so he tripled my dose. I ended up in ER a few times afterwards because I thought I was going to die. Doctors felt it was a thyroid storm, but there was nothing ER could do for me but give me ativan.  Well, A few days later I ended up in the hospital for psychosis, apparently I wasn't really sleeping and was up for 72 hrs. The theory of my psychiatrist was thyroid toxicosis since I never really had any issues afterwards. Needless to say I did not visit my endo again (he apparently had some law suit issues I was not aware of).",
            "post_id": "6647945",
            "timestamp": "1297724268",
            "user_id": "user_1535467",
            "user_link": "/personal_pages/user/1535467",
            "votes": "0"
        },
        {
            "answer": "Hi. If you were having a thyroid storm, the ER should have put you on Beta blockers to control it. I can understand the Ativan use as thyrotoxicosis can cause a very high level of anxiety. I had a thyroiditis episode that gave me two different thyroid storms while I was being treated with a chemotherapy. Unbeknownst to me I was a Hashi's patient and the Interferon really ticked off my immune system, causing it to wage war on my thyroid. The beta blockers were temporary and they controlled the high heart rate and blood pressure that the thyroiditis caused.It sounds like you may have been in a hyper state when you were started on the meds. Do you have any labs that the more knowledgeable can see from that time and now? They may be able to tell you what was going on...~MM",
            "post_id": "6650182",
            "timestamp": "1297789406",
            "user_id": "user_327086",
            "user_link": "/personal_pages/user/327086",
            "votes": "0"
        },
        {
            "answer": "Please, please tell me the name of your internist.  I'm really scared and can't take these symptoms anymore.",
            "post_id": "6760986",
            "timestamp": "1300900982",
            "user_id": "user_1643346",
            "user_link": "/personal_pages/user/1643346",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hashinoto's 7 yrs ago. My thyroid levels went up and down for 4 yrs. It was awful and I couldn't go on medication for fear it would be the wrong one at the wrong time of the cycle. I finally had my tsh go way below 0 and I was also tested for Graves markers which also came back positive.  So, I had both. My endo doc told me a small percentage of Hashi people flip to Graves but still have Hashi markers too.I went on anti-thyroid med and after 10 months went into remission with my Graves.  I've been in remission almost 2 yrs now. I always have the possibility of it coming back. And I also have the possibility of my Hashi's kicking in as well.",
            "post_id": "6789475",
            "timestamp": "1301715907",
            "user_id": "user_699286",
            "user_link": "/personal_pages/user/699286",
            "votes": "0"
        },
        {
            "answer": "hello i am amazed at all the people here with hypo/hyper symptoms..i too can relate..i was dianosed with hashies then went hyper on synthyroid the dr took me off the meds and im still hyper i have a multinodular goiter and i feel awful im very tired my eyes are so bad (double vision).and muscles ache ..sooo many symptoms of hypo but my tsh is very low ..so the dr says im hyper..im just learning about all this stuff.as i was diagnoised only a year ago...dr now says fybromalgia is the the cause of muscle soreness..i dont know ..i still think i have hypo symtoms even though they say im hyper i think i should be back on synthyroid as it did make me feel more energetic..the dr prescribes meds for nerves and sleeping ..i dont like taking pills that just hide what is relly going on...please advise..im scared and tired of feeling this way........thankyou.for letting me vent",
            "post_id": "7160764",
            "timestamp": "1313661788",
            "user_id": "user_1766910",
            "user_link": "/personal_pages/user/1766910",
            "votes": "0"
        },
        {
            "answer": "Hello,I have been in the same boat as many of you have.  I've been trying to get on the right meds, doses, and other meds to help the systems from other meds for almost six years now.  I just received the last round of 22 various blood tests and the ones that stick out in my mind and would love some feedback and/or thoughts or concerns.TSH: 8.7, (normal 0.450 - 4.500),Vitamin D -25 Hydroxy: 22.4  (normal 32.0 - 100),AM cortisol: 32.6, (normal 6.2 - 19.4),PM cortisol: 19.1, (normal 2.3 - 11.9),Thyroid antibodies: 140 (normal 0 - 34),Thyroid Peroxidase: 215 (normal (0 - 40),Thyroxin -T4: 0.23 (normal 0.83 - 1.77),Reverse T3: 39 (normal 90 - 350).My Dr. had ordered more, but Lab Corp. either lost the work or can't find the paperwork.  Who knows, but I won't be going back there again.I know exactly how Beenewt3 and Terri have felt.  I have been trying to find the right combination for over 5 years and I'm not there yet.  What has been the biggest struggle for me is the weight gain, which hit me hard and fast.  I do pilates weekly and changed my diet and I have actually gained a pound or two here and there, but I have not lost a signal pound.  I also sweat like I just stepped out of the show and this continues all day long.  I''m at a crossroads at the moment.  A friend of mine who has Hasimotos goes to a really good doctor, an endocrinologist, and she recommended that I make an appointment with him,  Unfortunately, his first avaialble is not until December, but I take this as a good sign.  I'm on the list in case there is a cancellation.  Well, I have taken up enough of ya'lls time, but if anyone has had numbers like what I posted and or know exactly what they mean, please don't hesitate to contact me.  I would really appreciate all of you that give a large amount of your time and support here help others.gijane140",
            "post_id": "7315322",
            "timestamp": "1318388036",
            "user_id": "user_1837294",
            "user_link": "/personal_pages/user/1837294",
            "votes": "0"
        },
        {
            "answer": "A couple of observations for you.  First, your Vitamin D is way too low.  Hasn't your doctor told you to take D supplements?  You need to get the Vitamin D level up toward the middle of the range.  Second, can that T4 result actually be that low?  Please double check the test result.What medication are you taking and what is the daily dosage?  On what basis has the doctor decided to change your meds over the last 6 years?  Was it based on your TSH levels?  Do you know if you were tested for the biologically active thyroid hormones, Free T3 and Free T4?",
            "post_id": "7315365",
            "timestamp": "1318389385",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "I am a Nutritionist.  When you are diagnosed with Hashimoto's, you have an auto-immune disease.  You need to find a Chiropractor that deals with blood work and or does muscle testing.  They can find the root cause of your auto-immune disease and you will be amazed how fast you get better.Your auto-immune disease is what causes the thyroid to become disturbed.  This in turn causes the reaction to hypo and hyper thyroid.  Find the root cause, correct the issue.About Synthroid.  It is a synthetic product.  If at all possible you need to go to a natural product.  Armour is a natural product.  When you put a synthetic product in your body, you just give it something else to battle.  There is a pharmacy in Madison, WI called Women's International Pharmacy. #800-279-5708.  They can compound something called P-Thyroid.  You need a prescription from your DR.I was diagnosed with Hashimoto's thyroiditis about 10 years ago.  I had my 1st bout with thyroid problems after my daughter was born 32 years ago.  That lasted 4 years.  It came back with a vengence 10 years ago.  I decided to get into nutrition because the regular doctors couldn't really help me.  I see an MD who is a Nutritionist as well.  We resolved the auto-immune problem and I no longer take medication!!!!!!!  Feed the body, heal the body.  Muscle testing can get to the root cause.  Mine happened to be scars!  Scars can capture the electrical signal sent from the brain at any point in your life.  They then fire randomly and cause other issues.  Mine just happened to be thyroiditis.Some good books to read are: \"Solved, the Riddle of Ilness\" by Stephen E. Langer, M.D. or \"Hypothyroidism Type 2\" by Mark Starr, M.D.Hope this gives Hope to you.JJ",
            "post_id": "7458643",
            "timestamp": "1322709484",
            "user_id": "user_1922501",
            "user_link": "/personal_pages/user/1922501",
            "votes": "0"
        },
        {
            "answer": "Members have replied to posts about this concept several times.  I do so again only to prevent members from running across this post and wondering if this could really be true.The whole concept seems to be based on the belief that Hasimoto's is due to gluten getting into the body due to the problem of \"leaky gut\".  Then the body supposedly produces antibodies to attack the gluten molecule.  Also, since the gluten molecule is supposedly very similar to thyroid gland tissue, the antibodies also attack the thyroid glands.  There is never any explanation of why there are actually two different antibodies involved with Hashi's,, TPO ab and TG ab.  Neither has there been any scientific data provided to prove that the proposed treatment eliminates the antibodies, even though  tests before and after treatment would be relatively easy to do.  Instead, all that is provided is anecdotal information.So until statistically valid proof is available, I'll continue to question if this is only a new way of making additional money from thyroid patients, through extensive testing and the sale of supplements available only from practitioners.",
            "post_id": "7462934",
            "timestamp": "1322830901",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "omg!. I have exact symptoms as you described.  I've been on and off the synthetic meds never feel right.As soon as they put me on synthroid and Levoxyl even with low dosage of mcg, i would feel hyper like heart symptoms. \"Not racing heart. Pressure on the heart. A dull ache. Skipped beats and once in a while a little rev up for two seconds. A feeling that the heart is way past tired, and ready to just stop. Normal blood pressure and heart rate\"  exactly as you described.  Then when i am off the meds, then i feel tire, chills, depress.  My question is even with the hyper symptoms, do you still keep yourself on the sythetic meds?  I have hashimoto too? is is why it causes hyper and hypo feeling?  What have your Dr. done for you so far? Please help!  I've been suffering for last  years, and I am not sure i should take the meds or not anymore, because i feel bad either way.",
            "post_id": "7617901",
            "timestamp": "1327380363",
            "user_id": "user_1999956",
            "user_link": "/personal_pages/user/1999956",
            "votes": "0"
        },
        {
            "answer": "Hi Terri Thyroid\" I now have a wonderful internist who is very knowledgable about all forms of thyroid disease and attends conferences frequently about these issues \"who is your Dr.  I've seen  Endos and i think they think i am making those symptoms up.  Even though my blood test shows -2-3 Tsh when i was on the Synthroid or Levoxyl but my symptoms are shown hyper.  I told my Dr and they don't believe me!  I am desperate searching for a Dr who have seen the case like me and know how to deal my condition.  Is your doctor in LA area?",
            "post_id": "7617925",
            "timestamp": "1327380691",
            "user_id": "user_1999956",
            "user_link": "/personal_pages/user/1999956",
            "votes": "0"
        },
        {
            "answer": "This thread is very old and many prior posters are no longer involved with us.  You will get lots more response if you will click on the orange Post a Question button at top of page and re-post this under your own name.",
            "post_id": "7617927",
            "timestamp": "1327380726",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "\" I actually was freaked b/c it reminded me of when I was pregnant and the baby would kick--it's like a quick little jerk or something--calves, abdomen (sometimes).  It comes and goes---some days I don't have it at all.  I did have the weakness and sluggish feeling \"Yes i have that feeling too sometimes.  This is all started after my miscarriage, then i was on the rollercoaster of hypo and hyper symptoms.  My Dr don't really believe that small dosage can cause hyper symtoms, but i feel every bit of it.  At this point, i don't know if i should or should not take the meds anymore.",
            "post_id": "7617947",
            "timestamp": "1327381294",
            "user_id": "user_1999956",
            "user_link": "/personal_pages/user/1999956",
            "votes": "0"
        },
        {
            "answer": "I am on several facebook forums (5 different ones with amazing information) for Hashimoto and have learned so very much.  I am taking a natural thyroid compound from a compound pharmacy since I had so many allergic reactions to fillers in the drug companies.  I've recently started Low Dose Naltrexone as autoimmune treatment for Hashi. (Look up Low Dose naltrexone Homepage).  I quit eating ALL GRAINS, Dairy or soy. (because of the USA putting extra proteins in the grain seeds to mass produce the crops (that our bodies don't know how to digest. (See Robyn O'Brien on Youtube).  The USA puts chemicals in the grain seeds so the crops produce their own pesticides.  I eat caveman foods (organic natural meats with no hormones, fresh and frozen vegetables and fruits, Penta water without fluoride toxins, BPA or chemicals.  I found a D.O. doctor for the Hashimoto since 3 endos, 3 primary care doctors, and 5 specialists did not know enough about autoimmune diseases.  This is what Dr. Noel Rose says about most medical doctors: \"Most physicians went through medical school at a time when we didn't understand much about autoimmune disease,\" says Noel Rose, M.D., Ph.D., director of the Johns Hopkins Autoimmune Disease Research Center in Baltimore. \"It's not prominent on their mental radar screen.\"Unfortunately, this delay to diagnose has huge costs. The longer a patient goes untreated, the greater her risk for irreparable damage.”One you have one autoimmune disease, you are likely to develop more than one autoimmune disease.  Hashimoto is NOT a thyroid disease.  It is an autoimmune disease.  You do not cure an autoimmune disease by having the thyroid removed.  A good resource for autoimmune diseases information is from AARDA -(American Autoimmune Related Diseases Association, Inc.)   Just info.  I'm doing so much better with all the changes I've made.  It's true, you are what you eat.",
            "post_id": "7712177",
            "timestamp": "1330063045",
            "user_id": "user_1633833",
            "user_link": "/personal_pages/user/1633833",
            "votes": "0"
        },
        {
            "answer": "Yes, I have some hyper symptoms (intermittent double vision, getting hot and sweaty, getting the shakes in my hands, depression, etc.) and many hypo symptoms (diagnosed with Hashimoto's in November 2010). My blood work comes back fantastic. I asked to have my anti-TPO Ab levels checked, but last time I went in the lab didn't draw it because it was on the last page or something stupid, so now I have to go back in. Grrr. My hypothesis is that if my Ab levels are high it could explain the hyper symptoms - the antibodies could be attacking my thyroid, causing follicles to burst and dumping thyroid hormone into my system and making me hyper (called \"thyroid dump\"). But it would have been helpful to have the levels measured when I was experiencing the worst of those (things have since gotten somewhat better). We'll see.",
            "post_id": "7713011",
            "timestamp": "1330094148",
            "user_id": "user_2045792",
            "user_link": "/personal_pages/user/2045792",
            "votes": "0"
        },
        {
            "answer": "my tsh was .04 now .01  I feel fine & vitals are great",
            "post_id": "7773264",
            "timestamp": "1331854959",
            "user_id": "user_2076915",
            "user_link": "/personal_pages/user/2076915",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hashimotos Thyroididus in 2010, then was told it was Graves disease.. I took beta blockers and anti-thyroid meds for 2 yrs then was told to take a radio-active iodine treatment.. which I did, and now my endo says I am now hypo insteadd of  hyper.. I am currently taking Levothyroxine 100mg.. within 4 days of taking this i had a complete loss of vision for 2 hrs, and since my vision is always blurred, ive started having constant migraines, never have an appetite and have to force myself to eat( which is not much at all) all in all I feel like I did before I eever took the treatment except no heart palpitations.. I feel wired, cant sleep.. has any one else had anything similar? my endo acts like none of it is a big deal, but i have two small children at home and this really scares me.",
            "post_id": "7857897",
            "timestamp": "1334328623",
            "user_id": "user_2112641",
            "user_link": "/personal_pages/user/2112641",
            "votes": "0"
        },
        {
            "answer": "Hold in there ksue, I'm 51 and its frustrating when they blame things on menopause.  I tell the doctors off. Luckily, i have artillery backup ( literally), I'm in the navy attached to a heavy weapons unit and go everywere with them, hot flashes and all, so I quite them down with the menopause bs. I can no longer do my military job because of  all this tyroid nonsense.  I will be going to ask for  rai treatment  and get this up and down  silly thyroid business over and done with, and be just like our former president George Sr and his wife Barbara Bush and worry only about treating the hypo.  I figure, if you are going to have both symptoms lingering around anyways, why not simplify  and just worry about one. if I don't have it done here, i will go oversees and do it.hope every body finds what finally will work for you. Stay strong!!",
            "post_id": "7971316",
            "timestamp": "1337560671",
            "user_id": "user_2177240",
            "user_link": "/personal_pages/user/2177240",
            "votes": "0"
        },
        {
            "answer": "okay this is to everyone.  I have been feeling like complete crap for a while now.  So a month or two ago i noticed a lump on my neck.  I went to the doctor and had blood work and a needle biopsy which was not fun.  She called and told me that i have thyroiditis and its autoimmune.  And that it was not safe to put me on any medication because she wants to see if it will just 'level out' and if not she will just give me hypothyroid medication.  But she also told me  ' this will eventually turn into being hypothyroid.'  I think i am switching back and forth from hyper to hypo.  When she called me she said at the time my tsh levels were low and the rest was normal.  I am confused and waiting for her to call me back again because i just dont have enough information from her.  My weight keeps changing rapidly and i can barely function some days and i keep going from constipated to diarrhea (sorry tmi) and i go to hot to cold and actually being able to think and being completely cloudy headed..   She said that the tiredness was just normal but she can't medicate.  Shoudl i see another doctor?  i am so lost",
            "post_id": "8044596",
            "timestamp": "1339591053",
            "user_id": "user_2313571",
            "user_link": "/personal_pages/user/2313571",
            "votes": "0"
        },
        {
            "answer": "So i have been hypothryioid for about 20 years, 3 years ago i had parathyroid surgery, they removed 2...during the surgery he did a biopsy and found out i had hasimotos...now i go between hypo and hyper....so a question...yesterday i ate some rye bread (gluten) i don't really do a gluten free diet but try to stay away from it as much as possible,  but today i am extremely hyper could it be due to the rye?",
            "post_id": "8049062",
            "timestamp": "1339694584",
            "user_id": "user_2501480",
            "user_link": "/personal_pages/user/2501480",
            "votes": "0"
        },
        {
            "answer": "She can't medicate? The tiredness is just \"normal\"?  I would see another doctor for sure.",
            "post_id": "8050734",
            "timestamp": "1339732737",
            "user_id": "user_2501480",
            "user_link": "/personal_pages/user/2501480",
            "votes": "0"
        },
        {
            "answer": "Yes!! You are describing me to a T!I want to use natural dessicated thyroid or the synthetic liatrix,to see if that is better than Synthroid.No gluten and no nightshade veggies, less broccoli cabbage, and less soy.Diet seems to be key. I'm keeping my remaining bit of thyroid glad!hugsJoni",
            "post_id": "8051567",
            "timestamp": "1339765579",
            "user_id": "user_2606274",
            "user_link": "/personal_pages/user/2606274",
            "votes": "0"
        },
        {
            "answer": "my doctor again told me there is nothing she can do for me.  She just wants to watch it.  I keep cycling and i know it.  I go from one extreme to the next.  I can't take it.  I work full time and i also go to school. So the past three days i have had heart fluttering and sweats and ectremely hot.  i couldnt sleeplast night at all.  I am going to see an endo next week.  hopefully they will be able to do something for me since my doctor wont medicate or anything.",
            "post_id": "8052053",
            "timestamp": "1339776968",
            "user_id": "user_2313571",
            "user_link": "/personal_pages/user/2313571",
            "votes": "0"
        },
        {
            "answer": "oh and my weight has dropped about 5-6 pounds since 2 days ago when i started feeling like i was hypo again.  and when i feel like im hypo i have gained up to about 10 pounds in about 1 1/2 to 2 weeks.  and this keeps going back and forth.  its really annoying",
            "post_id": "8052082",
            "timestamp": "1339777590",
            "user_id": "user_2313571",
            "user_link": "/personal_pages/user/2313571",
            "votes": "0"
        },
        {
            "answer": "I have had my TSH levels tested for almost a year now.  My TSH level has jumped around from 0.02 to 48.4.  Finally went to a Endocrinologist.  Sometime back I was on the .175 and for quite sometime now they have had me on 200mcg.  Said that the dose I need is in between the two and there is no other does manufactured between .175 and the 200mcg.  I have had a variety of side effects that I believe is from my thyroid problem.  Some of them have been very frightening.  Twice I did something that I have no recollection of at all.  Don't even remember it after someone tells me what I did.  The brain is just not functioning.  How severe have your side effects been?",
            "post_id": "8173429",
            "timestamp": "1343202744",
            "user_id": "user_3141481",
            "user_link": "/personal_pages/user/3141481",
            "votes": "0"
        },
        {
            "answer": "I too am going from one extreme to the other.  I had a Family Doctor named Dr. Shumate ( who has 11 children )  The most amazing doctor I have had the benefit of overseeing my health.  In 2006 my 21 year old daughter was killed.  Within the next year I lost my job.  Eventually I lost my cobra and went on disability for PTSD and dissociative behaivor.  When I blew off the charts from hypo to hyper during this time I was seeing Dr. Shumate.  He wasted no time and completely took me off the Synthroid...I can't remember but I would say for at least 2 weeks or longer.  Then he very slowly put me back on it taking baby steps with the dosage.  And he corrected my problem within a relatively short period of time.  Family Practice doctor..not an Endocrinologist.  Due to disability I could no longer see him anymore due to insurance.  He is such a wonderful doctor who \"CARES\" that whenever I get really uncertain about things I can leave him a message and he has called me back every single time to advise me.  I will be contacting him tomorrow.  Mainly because I don't agree what the Endo doctor is doing.  What really ***** with a thyroid problem is everytime they alter the dosage you have to wait six weeks to see where you are and if they are going to change your dose.  I have gone from .175 to 200mcg.  It was determined that the dose I need is in the middle of those two  numbers.  The manufacturer does not produce a pill of any different dose...it's either .175 which is too low for me or 200mcg which is too high for me.  So I bounce back and forth. For awhile they had me taking 1/2 of one dosage that I had and 1/2 of another which equated to the approx. .186 that my preferred physician believes I need to be on.  Here is a list in order date of what my TSH has been...six weeks between each one.  TSH 48.85  then TSH 15.57 then TSH 0.03 then 0.02 then 15.85 then 0.02  I f****k give up.  Too complicated..too much time in between dosage changes and then they still don't have it right.  I haven't even begin talking about the side effects....OMG.... I will be dropping off a copy of my TSH levels and a note to Dr. Shumate (the FANTASTIC doctor) tomorrow before I go to the hospital to check in on my almost 89 year old neighbor who is having worse difficulties than I.",
            "post_id": "8177233",
            "timestamp": "1343291351",
            "user_id": "user_3141481",
            "user_link": "/personal_pages/user/3141481",
            "votes": "0"
        },
        {
            "answer": "This is a very old thread and I'm sure none of the previous posters will respond to your post.You are correct that there is no dose between 175 and 200 mcg levo; therefore, in order to get a dosage between the 2, why not try alternating them -- 175 mcg one day, 200 mcg the next, which will give you an average of 187.5 mcg/day. I've done this numerous times, when I needed a dosage between the manufactured doses.That said, if you are only getting tested for TSH, you really don't know what dose you need.  TSH is a pituitary hormone and can fluctuate greatly, even intra day; it is not necessarily indicative of actual thyroid hormone status.You need to be tested for the active thyroid hormones, which are Free T3 and Free T4.  Free T4 is considered a storage hormone and can't be used directly; it must be converted to Free T3, which is the hormone used directly by the cells.It's possible that you need to add a medication with a T3 component, such as cytomel; or switch to a desiccated porcine medication, containing both T3 and T4.Without adequate testing, there's no way you can get adequate treatment and get your levels stabilized.It takes 4-6 weeks for dosage change to take place, when one is on a T4 only medication.  It simply takes patience to regulate levels, but patience does no good, if you aren't getting the proper tests.",
            "post_id": "8177548",
            "timestamp": "1343303462",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "I have been diagnosed with hashimotos and have had blood work for a year every 6 weeks and the dr increases my medication every time. I became irritated over it and ingested a dropper of lugals iodine and my lab work was normal for the next 4 lab tests. just saying!!!",
            "post_id": "8207305",
            "timestamp": "1344114344",
            "user_id": "user_3171008",
            "user_link": "/personal_pages/user/3171008",
            "votes": "0"
        },
        {
            "answer": "As I pointed out, just above, this is a very old thread and none of the previous posters are active on the forum any more, so I'm sure Karlyward won't respond.You should be aware that iodine is usually contraindicated for those with Hashi's, as it makes things much worse.",
            "post_id": "8207487",
            "timestamp": "1344118703",
            "user_id": "user_649848",
            "user_link": "/personal_pages/user/649848",
            "votes": "0"
        },
        {
            "answer": "Hi my names Selina and I'm 23 years old. I was diagnosed with hashimotos about 4-5 years ago when I found myself extremely exhausted and not really able to concentrate at my desk job. I almost didn't graduate high school and I have been depressed for years. I am on 100 mcg of levothyroxine and I am literally just taking my Drs opinion and going with it since I don't have health insurance and go to a clinic to be treated. I was referred to a psychiatrist about a month ago who prescribed Wellbutrin for me because I was apparently depressed and the depression was the main reason I couldn't concentrate or remember anything. I just got a new job and I'm extremely frustrated with myself I'm in the field of sales and people and I am falling behind becaus I can hardly remember/recite my script unless I go over and over and over them again and again. I have horrible memory, the depression is there, I get extremely emotional, and I feel like I can't accomplish the things in life that I want to because I'm held back by all of this. I have been diagnosed with hypo I don't eat gluten or soy. Does anyone know what could possibly be going on with me?",
            "post_id": "11686946",
            "timestamp": "1418816758",
            "user_id": "user_11503719",
            "user_link": "/personal_pages/user/11503719",
            "votes": "0"
        },
        {
            "answer": "Please post your thyroid related test results and reference ranges shown on the lab report.  Also if tested for Vitamin D, B12 and ferritin, please post those as well.",
            "post_id": "11687597",
            "timestamp": "1418829733",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "Hi there! I feel the same way as you! I know this is an old post, but how are you doing now? Any improvement?",
            "post_id": "11707466",
            "timestamp": "1419173073",
            "user_id": "user_11540727",
            "user_link": "/personal_pages/user/11540727",
            "votes": "0"
        },
        {
            "answer": "I am very doubtful that you will get a response from wagbird.  There are a number of members with considerable knowledge and experience with hypothyroidism.  If you will post our thyroid related results and reference ranges, along with symptoms you are having, we will be happy to help iinterpret and give you our recommendations.",
            "post_id": "11707512",
            "timestamp": "1419174118",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        },
        {
            "answer": "Synthroid made my hair fall out. I switched to Armour and it is fine now.",
            "post_id": "13829330",
            "timestamp": "1462649734",
            "user_id": "user_18042843",
            "user_link": "/personal_pages/user/18042843",
            "votes": "0"
        },
        {
            "answer": "I understand why you might think it was the Synthroid, but more likely it was due to inadequate levels of Free T3 when taking the Synthroid.  Frequently we hear from members taking T4 meds that their body is not adequately converting the T4 med to T3.  Free T3 correlates best with hypo symptoms.  So switching to Armour would have raised your Free T3 level and helped relieve hypo symptoms.  What were your dosages and Free T4 and Free T3 levels before and after the switch?",
            "post_id": "13829519",
            "timestamp": "1462658259",
            "user_id": "user_448183",
            "user_link": "/personal_pages/user/448183",
            "votes": "0"
        }
    ],
    "post_id": "1948555",
    "question": "This is kind of a survey/question to those of you diagnosed hypothyroid Hashimotos but who feel or actually are cycling into a hyper (not hypo) state. Do you seem to have symptoms of hyper like red in the face, hi b.p., shakiness, depression, hot all the time not hot flashes, hot tempered, double vision or poor vision etc etc but yet you feel run down, tired, fuzzy mentally, slow gastro processes so you go to the doctor and he/she says you are right in target range for tsh below 3.0 or thereabouts and great free t4 free t3 levels and all else looks good so maybe they raise your thyroid med dose thinking you're still a little hypo (not hyper) or have you lower dose in case you are actually hyper and for a short while you feel better or feel worse right away so now you don't know if you're up or down ? Yes, that is a run on sentence but hopefully I'm clear - here is my theory - maybe you have gone so hyper your body is shutting down or slowing down to protect itself or it's just breaking  down altogether - Has anyone had this experience and if so what do you do about it or what does your doctor do or say to help you? And if our thyroid gland worked normally would pituitary and other supporting systems output consistently same amounts ? I know this is a good question for Dr. Lupo as he actually believes there is a phenomena as Hashitoxicosis unlike my past 3 endos. I'm curious what you folks think about this and what your experiences have been.",
    "timestamp": "1191441649",
    "title": "Hashimoto's Toxicosis and going hypo and hyper",
    "user_id": "user_285309",
    "user_link": "/personal_pages/user/285309"
}