{
    "answers": [
        {
            "answer": "umm..side affects..of course ! unless you the 2 male things we have down there..stop it..HCG does not in anyway help with weight loss..need proof...just ask...",
            "post_id": "115565",
            "timestamp": "1181797200",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "I personally have not experienced any negative side affects.  Only good things (swelling in joints went down, scratchy throat causing me to cough constantly went away).The only negative side affect I've read from the blogs are headaches for the first couple of days. and only 2 people mentioned headaches.",
            "post_id": "115566",
            "timestamp": "1181797200",
            "user_id": "user_202710",
            "user_link": "/personal_pages/user/202710",
            "votes": "0"
        },
        {
            "answer": "lol your funny..I know more about HCG then anyone on here../and most doctors..it has zero weight loss facts..ZERO..i see you have been brain washed by KEVIN THE CRIMINAL not-TRUDEAU..LOL you lost weight because of 500 cals..lol NOT HCG...stop looking for short cuts...AIDS is man made...From my studies..yes..man screwed up and caused it im leaning towards. but we arent injecting people with it...get a clue my dear..and stop being brain washed...*I bet at 1 time you wash brain washed by the biggest scam in the world..ATKINS..LOLEverything you offer is from people who are anti GOV ,do I fully trust the GOV..def not !! but your so called proof..is people thoughts..not facts...ZERO facts...and KEVIN T is your saver ? hes a criminal..lol and scam artist..he promotes HCG..then says use his pill form.lol pill form is a joke and would enver work..why did you ignroe the facts about HCG i posted..facts..son..facts..no, you are not a body builder...but what is a body builders main goal ? and how they get paid.. ?? its how low and lil fat they carry..and odd..they inject every steroid there is..HGH & INSULIN..but odd..no HCG. HCG keeps there ***** from shrinking from doing roids..lol does nothing for fat loss..dont you think they would say wow..all of sudden ,im loseing fat..and it would be used for that...you need to wake up...they also give it to young boys with undeceding testys..hmm......no weight loss in them..I challenge you..anyone and KEVIN to prove me wrong...he can even calL!me...hes a salesmen...no more..no less..and a con man..and a very good 1..hes laughing all the way to the bank...",
            "post_id": "115568",
            "timestamp": "1181797200",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "lol its a joke and its his HCG and the goof kevin pushing it...you people need to get a clue..and fast....",
            "post_id": "115576",
            "timestamp": "1181797200",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "Although you are entitled to your opinion, I would appreciate it if you would respond in a more positive way.  I have no problem with the fact that you disagree with the use of hcg, but why not communicate it to others in a kind manner.  No one will ever listen to what you have to say if you always condescending in your tone.  Furthermore, please respect the fact that we have the right to utilize our own means necessary to lose weight.",
            "post_id": "115581",
            "timestamp": "1181797200",
            "user_id": "user_211067",
            "user_link": "/personal_pages/user/211067",
            "votes": "0"
        },
        {
            "answer": "I read in your post that you have problems with your adrenals.  I currently am being tested for a suspected adrenal problem, which I attribute to my exercise bulimia and overconsumption of ephedra, caffiene, etc.  Have you been diagnosed with an adrenal problem and if so, what did you do about it?  Any information would be appreciated.  Thanks.",
            "post_id": "115586",
            "timestamp": "1181797200",
            "user_id": "user_211067",
            "user_link": "/personal_pages/user/211067",
            "votes": "0"
        },
        {
            "answer": "you are right...if you notice..i show those respect who give it..also keep in mind..im 100% right..that makes some mad..but those are the facts..im not mad at anyone here..im mad at the fact criminals like KEVIN T get to lie scam & cheat..you know how much $$ he got to promote over 200 people in his book..be real...be smart..its always about $$ read what I posted about HCG how can you read that and ignore it ? makes no sense..i got no $$ to make..i think the FDA is a joke also..but im very well educated in drugs..steroids..supplements..and HCG...with over 15 yrs in the bizz..if i come off the wrong way its because im mad at the scammers..not people here..or if they attack me..they  get it back..good luck to you..and rememer..there are zero tricks...ZERO  heres some info to get where im comming from.....if you notice..those nice to me..I'm nice back..but any who...I'm very well known for knowing my stuff about weight loss..supplements..and steroids...(I'm getting injections Friday for a rib prob) so I do my home work..and I have friends in the body building world..which HCG is old news and used very much..not to be a basher..but I asked all including a top level pro bodybuilders in magazines..and they all said..HCG will not help with weight loss..sorry if anyone does not agree...but my finding & studies..im happy with..but to each there own.....to me after going though every horror weight loss story...over 100 books...300 magazines...3 doctors..and real life (oh and over $8,000) experince..there is no trick..no secreet....burn more then you eat..simple as that..all..and ps some of the dumb stuff ive done..but learned fromlost 12lbs in 5 hrslost 30 lbs in 28 dayslost & regained 30+ lbs 6 x in 1 yearmy body has never fully recovered from this nonsense to this day...my adrenals are gone..my metabolism is shot..but after 12 exams... 5 courses...2 schools...15 yrs of real use..every diet there is ..and weird tricks..drinking warm sauerkraut juicelemon juice,cayenne pepper,maple syrup,warm waterno food..no fat..low fathigh fat500-800 grams of carbslow carbsno carbslow cal high cal saunas..I've done it all and after all this its the same everytime...calories in vs out............now I'm perfect at it..after surgery I went up to 195 lbs 26% body fatdropped 42 lbs and went to 7.2% body fat in 4 months (my goal)I'm happy..just could use energy....that's why IM looking intoB-12 injections, I've taking EPHEDRA for over 13 yrs..it don't even work that good for me no more..I still take it prob 3-5 x a week..this is long..once again good luck to you..be safeps read about HCG from  a non-related source..I can send you many if you chose...have a good night..",
            "post_id": "115583",
            "timestamp": "1181797200",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "Sorry that post was for fightu35!",
            "post_id": "115592",
            "timestamp": "1181883600",
            "user_id": "user_211067",
            "user_link": "/personal_pages/user/211067",
            "votes": "0"
        },
        {
            "answer": "tired is not the word..at this time im not on any RX meds...the #1 mistake DR'Smake with tyroid is the testing.. make sure you had a full thyroid panel test..free T3 free T4 and TSH test...reports are 95% of doctors do not test righ.t.and tell most people there thyroid is 'ok' but 'ok' is not good enough for most people...from my studies...cortizone inections or pill form seem to help greatly..its only like 10-25mg's if you want mor einfo do a search onADRENAL BURN OUT,ADRENAL FATIGUE...any  ?'s just ask..let me know how you make out..",
            "post_id": "115595",
            "timestamp": "1181883600",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "Hi- I've been looking into hcg shots.  I've lead all of keven t's books.  I going the organic route, off otc drugs and I don't want to be fat any more.  If you've done the hcg let me know.  Also I have been watching ITV and there are some interesting supplements there.  Any one tried them?",
            "post_id": "115603",
            "timestamp": "1181883600",
            "user_id": "user_218883",
            "user_link": "/personal_pages/user/218883",
            "votes": "0"
        },
        {
            "answer": "HI..ive taken EHPEDRA for over 10 years..and still have it..and take it..just not as much.. to test your adrenals the right way..you need an AM/PM coritsol test.. make sure you tell your dr. dont let him short change you adrenal probs are more common in women very..to help..stop all stimulants..even coffe...you can buy some supplements..lto help..I have adrenal support from NATRA-BIO or go to bodybuilding.com ..go to store..type in adrenals..heres a good product..http://www.bodybuilding.com/store/palo/reset.html ...in time adrenals will bounce back any  ? just ask",
            "post_id": "115588",
            "timestamp": "1181883600",
            "user_id": "user_216119",
            "user_link": "/personal_pages/user/216119",
            "votes": "0"
        },
        {
            "answer": "Thank you for the information.  I have completed a 24 hour urine collection for cortisol after taking dexamethasone(don't know if this is the correct spelling).  I was wondering if your doctor ever prescribed a medication for you.I currently have stopped taking all caffeine/ephedra supplements.  The reason for the suspected adrenal gland problem was a suddent weight gain which started last summer.  I gained 30 pounds in 2 months with no change in diet or exercise.  At first, my thyroid was checked and everything was ok, which led them to suspect my adrenals because a urine test showed extremely high cortisol levels.I have never felt so tired in all of my life and have never been able to not lose weight.  This has been an extremely frustrating year, so I am hoping if my adrenals are corrected, I can start feeling like myself again.  Have you also experienced extreme exhaustion?Thanks in advance.",
            "post_id": "115591",
            "timestamp": "1181883600",
            "user_id": "user_211067",
            "user_link": "/personal_pages/user/211067",
            "votes": "0"
        },
        {
            "answer": "So, you know MORE than ANYONE about hCG and more than most doctors?  But you still never answered the original question, Captain Brilliance.   The original question has anyone experienced negative side affects.In your know-it-all answer you tell her how stupid she is, and that only an idiot would take hCG and any weight loss is all in the mind, etc... but your soapbox ranting never answered her question.Have you definitive evidence, ... no you don't have anything definitive other than your loud, obnoxious opinion, so let's just stick with that. In your UN-humble opinion, what are the negative side affects?I can't wait to hear your response, since you know more than anyone else about hCG.",
            "post_id": "2311347",
            "timestamp": "1199405443",
            "user_id": "user_377573",
            "user_link": "/personal_pages/user/377573",
            "votes": "0"
        },
        {
            "answer": "Common side effects reported include:o Abnormal enlargement of breasts in men (gynaecomastia)o Over stimulation of the ovaries causing production of many ova (eggs) in womeno Multiple pregnancyo Acneo Tirednesso Changes in moodo Irritation in area of useo Excessive fluid retention in the body tissues, resulting in swelling (oedema)o Hair losso Prostate hypertrophyThe side effects accompanied with hCG use (which usually relate to higher levels of male sexhormones, such as extreme acne), its low rate of effect and the cost deter most athletes fromusing it for performance and image enhancement.Risks of counterfeit productsThere is an active blackmarket in hCG and in addition to the legitimate hCG preparations formedical use, there are counterfeits which may have few, if any, active ingredients and carry therisk of contamination.",
            "post_id": "2334434",
            "timestamp": "1199816266",
            "user_id": "user_382055",
            "user_link": "/personal_pages/user/382055",
            "votes": "0"
        },
        {
            "answer": "Has anyone heard of this side effect from hcg?  I only took the injection twice and then about 2 weeks later I started to feel like something was stuck in my throat.  I went to a local dentist friend and he used his little mirror to look and said I needed to go to my primary dr.  went the same day and he sent me to an ENT.  The ENT thought for sure it was a thyroid goiter but sent me for a thyroid scan and uptake test, turned out my thyroid was perfect.  Now there are multiple masses and ulcerations in my throat and they are spreading up the very back of the tongue.  The symptoms I have had are pain in my ears, pinched nerve feeling behind my eyes, the feeling of pressure in my sternum area, and no one to date feels comfortable enough to biopsy them. They have put me on a pure liquid diet because my food was getting stuck so bad.  I do go tomorrow Feb 28th to an oral pathologist at The University of Texas Medical Branch in Houston, TX but has anyone heard of this problem in relation to HCG injections?",
            "post_id": "2568626",
            "timestamp": "1204124601",
            "user_id": "user_433392",
            "user_link": "/personal_pages/user/433392",
            "votes": "0"
        },
        {
            "answer": ".25 injection per dayFirst the 500 calories a day made me suceptable to sinus and UTI infections. If I ate normally for two days when I was sick  I gained 4 pounds back.I was very very tired. Could barely get out of bed. Doc said sinus/ UTI and my BP was 89/56. NO GOOD..close to a bottom out. I began to eat normally..not Burger king...normaly and gained back 12 pounds in 12 days...now I have stretch marks where there were none before.I was under the impression you didn't lose if you went off the diet of 500, not that I would gain it back a lb a day.great....",
            "post_id": "2644573",
            "timestamp": "1205523602",
            "user_id": "user_450365",
            "user_link": "/personal_pages/user/450365",
            "votes": "0"
        },
        {
            "answer": "I was smoking but got what seemed like burns all over my tongue..very painful burns. Like bumps. I kept rinsing my mouth with hydrogen peroxide ...and they have healed....but I have stopped the hcg as well.i can't tell if there is a connection.....could it be viral.....?",
            "post_id": "2644619",
            "timestamp": "1205523972",
            "user_id": "user_450365",
            "user_link": "/personal_pages/user/450365",
            "votes": "0"
        },
        {
            "answer": "My suggestion is do not read/follow the Kevin Trudeau plan. Read/follow the Dr Simeons plan. The originator of the diet and original founder, who was an endocrinologist studying the effect of HCG.I don't know why someone would sugesst atheletes would take this as an enhancement drug? They must be confusing it with HGH, which is completely different. Acutally, people who use HGH will often result to taking HCG to restore their male parts to normal and reverse the effects of HGH shrinking them. HCG is used to help establish normalcy to underdeveloped male parts. It does not make you bigger unless it is underdeveloped and by no means should ever make it smaller.It also is confusing that someone posted it would cause men to grow breasts? I have never heard of that before but know that my husband had \"man-boobs\" his whole life even though he was not overweight. With HCG, they are gone....",
            "post_id": "2653936",
            "timestamp": "1205735282",
            "user_id": "user_407715",
            "user_link": "/personal_pages/user/407715",
            "votes": "0"
        },
        {
            "answer": "I have been on HCG for 26 days.  I have lost 14lbs.  9inches on my waist.  I have never felt so good in my life.  High energy, reflux is gone and joint pain seems diminished.  I am following the original Italian protocol.   Yes, 500- 600 k per day. This is very easy to do.  I am just not hungry.   I am totally impressed.  I am being followed by an MD that is also a restorative medicine clinician.  She has balanced my hormones on a bio identical basis.  I can not express how great I am feeling...thrilled in Seattle.",
            "post_id": "2771913",
            "timestamp": "1208031613",
            "user_id": "user_478490",
            "user_link": "/personal_pages/user/478490",
            "votes": "0"
        },
        {
            "answer": "I am just starting the hcg and am just about to start my period.  I couldn't really plan a good time to start because my periods are so irregular.  I'm only into my third day, so I feel like it would be better to stop and start over after my period, but don't want to have to binge and pig out all over again.  Does anyony know if it's a big deal if I continue my injections through my period?",
            "post_id": "3313977",
            "timestamp": "1219447586",
            "user_id": "user_597859",
            "user_link": "/personal_pages/user/597859",
            "votes": "0"
        },
        {
            "answer": "do you know how hcg will affect me? i have seizures, hbp, hi cholesterol, arthritis, asthma, gerd and 100 extra pounds. any chance of keeping it off?",
            "post_id": "3322490",
            "timestamp": "1219674457",
            "user_id": "user_381319",
            "user_link": "/personal_pages/user/381319",
            "votes": "0"
        },
        {
            "answer": "I have completed one 40 day cycle of hcg and I for one, love it. No side effects to date. I had more energy, slept without the use of my rx sleeping pills, felt better than I had in years, and yes, I lost 20 lbs and many inches although I did not measure at the beginning. I lost 4 inches in 2 weeks and overall two pant sizes. Very noticable.I'm looking forward to a second cycle of it. Plus, there are so many women around here that now want to take it, I'm planning a seminar. So, the side effects will be helpful in discussion. My doctor has been injecting it for 2 years as a maintenance program and so has his wife. Plus, he says in some of his fibromyalgia patients, the hcg has really helped their pain lesson (not in all but in some).Everybody should investigate it for themselves and need to feel good about, wholly, before taking it.One other thing, it was great having a friend take it at the same time. We talked every morning after we weighed. Helped tremendously to have the support.",
            "post_id": "3342159",
            "timestamp": "1220047072",
            "user_id": "user_604760",
            "user_link": "/personal_pages/user/604760",
            "votes": "0"
        },
        {
            "answer": "Where is Seattle do you get your HCG injections, which MD prescribes them?",
            "post_id": "3380137",
            "timestamp": "1220913685",
            "user_id": "user_614064",
            "user_link": "/personal_pages/user/614064",
            "votes": "0"
        },
        {
            "answer": "google hcg...i went through HCGMedical. I lost 27 lbs in 40 days. I went from a size 12 to a size 6. i LOVE this program. It has changed my life! the program i went through was all doctor supervised and always  had diet coaches on hand to assist me with any questions.I am getting ready to start my 3rd round in hope of acheiving my goal of 137. only 15 more lbs to go!",
            "post_id": "3511046",
            "timestamp": "1223585427",
            "user_id": "user_646165",
            "user_link": "/personal_pages/user/646165",
            "votes": "0"
        },
        {
            "answer": "you pulled your information off of a site that gives information about hCG injections for women who are trying to get pregnant.with the dosage that is prescribed to people looking to lose weight, the only known side effect is light headedness and this is actually due to not drinking enough water...while on the hCG you must drink as close to 1 gallon of water a day as you canhcg actually improves skin quality, will tighten your skin as you lose weight, help improve your sleeping patterns, give you more energy throughout your day on top of resetting your metabolism",
            "post_id": "3511077",
            "timestamp": "1223585870",
            "user_id": "user_646165",
            "user_link": "/personal_pages/user/646165",
            "votes": "0"
        },
        {
            "answer": "Hi,You were asking about side effects.  I haven't had any negative ones.The diet has been very easy for me.  The HCG controls the appetite.  I make 64 oz of herbal & green tea mix and drink that daily before 1 pm and then switch to water and drink as much as I can up to another 64 oz averaging between 80-120 oz per day.  Buy a postal scale to weigh your food the food scales aren't accurate enough.  The food you're allowed is very limited not only in amount but in selection.  Don't do calorie matching and make other choices.Read inches and pounds several times before starting and while on it.  If you do what it says, it'll work for you.  I've lost about 30 pounds in 30 days. I'm a male and this seems typical.  Women may lose a little less. I haven't been doing much in the way of exercise as I fractured my leg just after starting the diet.When you come off the diet, you have flush your body of the HCG.  You do this by eating the same drinking & 500 cal diet for 3 more days while not getting the HCG.  Then you can eat anything you want as long as it doesn't have fats or carbs in it for 3 weeks AND you don't gain or lose more than 2 pounds going above your last lowest weight while on the drops.  Then for the next 3 weeks, you can slowly introduce fats and even more gradually carbs.  Inches and Pounds tells you what to do if you gain too much.   Follow it it works.It sounds to me like people haven't read the info and are gaining their weight back by going back to normal food right away.  Get the story straight and follow the plan -- read Inches and Pounds.  It does work.After I normalize my weight (after the six weeks) I'll decide if I want to do it once more (you have to wait between series) or if I'll go back to weight loss the more conventional way.Keep in mind that the reason you're doing this is to get rid of the fat cells not just make them smaller as in normal dieting.   And to reset your metabolism.   Afterwards, you have to adjust eating habits not to a diet but to a way of life.  Meaning that you give up eating more than you use, get away from fast food, restaurants and processed food, augment it with healthy liquid input (1/2 gallon a day is good) and exercise.IMHO - it works if you work the plan.  This is what I've found.Craig.",
            "post_id": "3661378",
            "timestamp": "1226765893",
            "user_id": "user_683565",
            "user_link": "/personal_pages/user/683565",
            "votes": "0"
        },
        {
            "answer": "I have friends who have used hcg for weight loss and yes it helped tremedously but i have some interesting facts you all would want to here about.  My friend did the simione diet (HCG along with the 500 calorie per day).  He was losing the one pound per day like it stated.  In my opinion why this works is because when you take HCG, which is a hormone that is found in abundance in females when pregnant, it stimulates your natural growth hormones to react therefore protecting the body from catabolism (eating muscle for energy), instead it utilizes fat.   You see when your body goes into starvation mode, hence 500 cal per day, your body would rather feed off of muscle and spare fat as much as possible because it is preferred for the survival of the body insulation, coating of body organs, etc...  So....it will work, but there are some downfalls!  towards the third week of the diet he experienced very severe throat pain, got really sick like a bad flu, and eventually gained his weight back.  Also, as he los the weight he looked like he was sick, he looked emaciated, cancer like, pale, thin, weak.He now is taking HCG again, but this time under a physicians care.  He was prescribed HCG along with T3/T4, Testosterone Cyponate, DHEA, Vit D, and Pregnalone (spelling?).  Again, about three weeks in his throat was in severe pain and now he is thinking that maybe HCG has this horrible side effect with him.  The other meds above he is taking are still not showing him massive gains but, again this isn't a typical cocktail for someone looking to enter a bodybuilding competition, it's strictly to increase hormones to optimal levels, because with stress, bad food, no exercise, you can be on a hormonal rollercoaster and suffer from many thyroid conditions.Hope this was helpfulDR",
            "post_id": "3689578",
            "timestamp": "1227358227",
            "user_id": "user_690732",
            "user_link": "/personal_pages/user/690732",
            "votes": "0"
        },
        {
            "answer": "What you are describing sounds like ANGIOEDEMA, a very serious allergic reaction. Get to an environmental allergist asap. In the meantime, take high quality salmon oil to decrease the inflammation. Ask for an epi-pen in case your throat swelling gets drastic. Hydocortisone will also help diminish the allergic reaction. What you describe are classic Angioedema syptoms. Get to a Dr. who knows how to treat it...lots of Vit. C, and above.",
            "post_id": "3707447",
            "timestamp": "1227755398",
            "user_id": "user_695176",
            "user_link": "/personal_pages/user/695176",
            "votes": "0"
        },
        {
            "answer": "Does anyone have any information about severe morning sickness like nausea during HCG load days?  My sister got very sick and we think it is because she didn't drink enough water or oolong tea, but we are trying to find out anyone that has info about it.  She is also on a progesterone birth control pill which was ok'd by the clinic we are using.I've lost 75.2 lbs with HCG and didn't experience any bad side effects but I am not on b/c pills so our situations aren't exactly the same.Thx!",
            "post_id": "3714184",
            "timestamp": "1227983280",
            "user_id": "user_696981",
            "user_link": "/personal_pages/user/696981",
            "votes": "0"
        },
        {
            "answer": "I really loved it, not only because it helped with me losing weight but also it minimized my hot flashes.  The only down fall was that I began having pains with my right ovarie which I had to stop that injection. I was informed in my case since I previously had surgery (partial hysterectomy) leaving my ovaries I COULD NOT continue with HCG.I was so disappointed.",
            "post_id": "3715302",
            "timestamp": "1228009255",
            "user_id": "user_697252",
            "user_link": "/personal_pages/user/697252",
            "votes": "0"
        },
        {
            "answer": "I am getting ready to take HCG not to lose wight but to go back to healthyer eating habbits befor I got pregnant with my second kid I was 135lb I was at 160 when I had my baby after that I noticed I was hungry all the time I went to the gym and I drank lots of water but im so so hungry i'll eat tell im sick and in an hour ill be hungry againits been 8 months and im now 230lb I am depresses I hate my body I hate me! my body is taking a dive I have chest pains, my joints ake I get bad head akes after eating and ive had low thyroid problems for 5 years HCG was suggested by my ant whos a nurse to repres my hunnger just so I can eat healthier I was told it just represses hunger right?  is there a better hunger reprecent? ive tryed slim fast special gum pill ect im also a hypo condriack so has anyone died from this and how safe is it I still going to talk to my doctor. just needing imput maybe youve her of this.",
            "post_id": "3856633",
            "timestamp": "1231541179",
            "user_id": "user_731718",
            "user_link": "/personal_pages/user/731718",
            "votes": "0"
        },
        {
            "answer": "I am interested in getting the HCG. I have also had a partial hysterectomy, why would it not be a good idea to get the injections. Pain in ovaries, would that be the only reason or what would really happen to my ovaries?",
            "post_id": "3887081",
            "timestamp": "1232244049",
            "user_id": "user_739211",
            "user_link": "/personal_pages/user/739211",
            "votes": "0"
        },
        {
            "answer": "Ephedra or any other stimulant/drug is defintely not the way.  That should be obvious.I don't know anything about hcg and came here in search but I would assume that if it did work it wouldj preferable to stimulate its' production naturally if that is possibel.",
            "post_id": "3896398",
            "timestamp": "1232473935",
            "user_id": "user_741476",
            "user_link": "/personal_pages/user/741476",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tied for 13 years and am 48 years old.  I have lost 32 inches and 16 lbs on HCG in 29 days however. I didn't start my period on the day I was supposto. Like 4 days ago.  I barely showed pink after intercourse and still have sore breasts.  Has anyone else done this.  I dare not think I am PG but now am afraid to continue back on the inj incase I am PG.  Chances are slim to none but I have heard that HCG causes birthdefects??  How long after the shots can I take the test does any one know! Teresa",
            "post_id": "3927883",
            "timestamp": "1233175506",
            "user_id": "user_749059",
            "user_link": "/personal_pages/user/749059",
            "votes": "0"
        },
        {
            "answer": "did you find out if you are pregnant? i have read that HCG is not a fertility treatment but it can facilitate pregnancy! if not did you find out what was going on?",
            "post_id": "3978271",
            "timestamp": "1234369326",
            "user_id": "user_762459",
            "user_link": "/personal_pages/user/762459",
            "votes": "0"
        },
        {
            "answer": "I have been on HCG for 15 days and I have lost 16 lbs. The only side effect I have had is dry mouth.",
            "post_id": "3998948",
            "timestamp": "1234889168",
            "user_id": "user_768118",
            "user_link": "/personal_pages/user/768118",
            "votes": "0"
        },
        {
            "answer": "Read Pound and Inches or you do not qualify to say anything about the hCG Protocol. (PERIOD) It works and I am proof...30 pounds in 30 days at 66 years of age with 3 stens in my heart.  I now do 5 light work out a week and play tennis to keep my youthful body.  Any 4.0, overweight 66 year olders want to try me at tennis?",
            "post_id": "4002858",
            "timestamp": "1234971905",
            "user_id": "user_769283",
            "user_link": "/personal_pages/user/769283",
            "votes": "0"
        },
        {
            "answer": "Read Pound and Inches or you do not qualify to say anything about the hCG Protocol. (PERIOD) It works and I am proof...30 pounds in 30 days at 66 years of age with 3 stens in my heart.  I now do 5 light work out a week and play tennis to keep my youthful body.  Any 4.0, overweight 66 year olders want to try me at tennis?",
            "post_id": "4002859",
            "timestamp": "1234971915",
            "user_id": "user_769283",
            "user_link": "/personal_pages/user/769283",
            "votes": "0"
        },
        {
            "answer": "I have been on hCG for 12 days and have lost 14 pounds.One thing I cannot stress enough is to drink plenty of water! i had heart palpitations about my third 500-calorie day that made it impossible to sleep, so I went to the ER here and they said I was dehydrated! You need to take your body weight, divide it in half and thats the number of ounces of water you need to drink a day. I had been drinking half that, probably, but because I was probably eating 2000-3000 calories a day my body was able to pull enough water from the food that I didn't have such severe dehydration. So cutting down on the calories definitely affected it. Ever since I have began to drink the proper amount of water I have felt fine, though.Stay safe!",
            "post_id": "4033306",
            "timestamp": "1235670585",
            "user_id": "user_777665",
            "user_link": "/personal_pages/user/777665",
            "votes": "0"
        },
        {
            "answer": "I'm a 39 yrs old male and I've just completed my 1st week of HCG. (down10lbs :)) However I'm concerned that I did not have any bowel movements until day 6. I THINK I'm drinking lots of H2O...I'll increase my intake.Has anyone experienced constipation and if so is there an Dr. Simeon 'approved' laxatives?I have to laugh when I read that some of you did not experience hunger during this phase...I'm constantly hunger.",
            "post_id": "4043821",
            "timestamp": "1235940429",
            "user_id": "user_780561",
            "user_link": "/personal_pages/user/780561",
            "votes": "0"
        },
        {
            "answer": "A few things, if you are constantly hungry, is your hcg fresh? Are you getting enough protein? You might try upping your protein by adding a protein shake or more meat with meals. I have used a protein shake called ultra lean by Biogenesis that has worked well for me with the hunger problem(up to 4 scoops a day is allowed - this particular protein shake works to balance blood sugars but does not interfere with the hcg)For constipation, you can try adding 1 tsp to 2 TBS mct oil per day(medium chain triglyceride oil can be found at life-enhancement.com) or magnesium supplements.As for the water, take your weight in pounds, divide by two and drink that much water in ounces a day. (ie. if you weigh 170 pounds, drink 85 ounces of water a day)Hope this helps, good luck.",
            "post_id": "4044916",
            "timestamp": "1235961277",
            "user_id": "user_572196",
            "user_link": "/personal_pages/user/572196",
            "votes": "0"
        },
        {
            "answer": "We opened & mixed up the hcg just before using.I've been only taking @ 200g of protien/ day...I'll move that up to 400g. Do you think this will this slow the effects of the weight loss?I have not been drinking enough H2O either...I'll correct that immediately.Regarding the MCT oil...do I cook with it or just take by the TBS?",
            "post_id": "4045088",
            "timestamp": "1235964538",
            "user_id": "user_780561",
            "user_link": "/personal_pages/user/780561",
            "votes": "0"
        },
        {
            "answer": "I use Magnesium Glycinate supplements for constipation.  You have to experiment to find out how many it takes for you...my doctor said to take however many I need.  They do the trick without the extra calories or fat that other things might add.  Also, my doctor had me take 1 TBS psyllium husk in water 3 times per day (30 minutes before meals or apple snack).",
            "post_id": "4045946",
            "timestamp": "1236002943",
            "user_id": "user_740652",
            "user_link": "/personal_pages/user/740652",
            "votes": "0"
        },
        {
            "answer": "can someone here tell me about when doing the HCG u cannot do ur hair or use body cream.  Im about to start and I would like more info before doing it..Thanks",
            "post_id": "4081981",
            "timestamp": "1236814993",
            "user_id": "user_790880",
            "user_link": "/personal_pages/user/790880",
            "votes": "0"
        },
        {
            "answer": "i am looking into doing HCG. my question is. is there really a big difference in getting yourself like online or something or going through the DR. is it just as simple as taking the injections or is there other stuff along with it?",
            "post_id": "4134705",
            "timestamp": "1238087013",
            "user_id": "user_805742",
            "user_link": "/personal_pages/user/805742",
            "votes": "0"
        },
        {
            "answer": "I have been on the Simeons diet but am not taking hcg injections but have used Releana, an HCG oral dosage.  It only requires about one dropper worth of liquid a day (1/2 in am and the remainder at night).  I am also under a doctor's care for this diet).  Since January I have lost 49 lbs, which along with a preceding diet started in late November has given me a total of a 82 lb loss.  I got tired of being fat/obese and determined if I did not do it now I probably never would.  Releana has worked for me and without side effects.  The 500 calorie diet wasn't as hard as I thought it would be but there was a few weeks where I thought about \"regular\" food a lot.  After eight weeks of releana, I went on a 3 week normalization diet and will start another 4 week diet tomorrow.I don't know about Kevin Trudeau or any alleged chicanery.  The releana diet is being taught at the OHSU med school as a diet alternative.  Again, it has worked for me and seems to be working for others here and that is about all I can say.  If it has not worked for others, well that is true of a lot of other diets.  If people have had problems with it, I would guess they have had problems with others.",
            "post_id": "4144736",
            "timestamp": "1238354608",
            "user_id": "user_808885",
            "user_link": "/personal_pages/user/808885",
            "votes": "0"
        },
        {
            "answer": "I have been on the HCG diet now for 9 days and I am starting to have problems with my vision. Anybody experience this?",
            "post_id": "4330203",
            "timestamp": "1239149049",
            "user_id": "user_863780",
            "user_link": "/personal_pages/user/863780",
            "votes": "0"
        },
        {
            "answer": "I lost 22 lbs in the first month of the HCG diet. I became pregnant with my fifth child while taking injections and took about 3 days worth before I realized I was late for my period. I was nervous about side effects and how they would effect my baby based on the warning of birth defects, but my now 6 month old is perfect with no signs of any birth defects. Don't freak out if you got pregnant while taking injections but definetly stop taking them if you think you may be. You do not want to risk your babies health just to lose weight.Read Pounds and Inches! Don't waste your time or money on The Weight Loss Cure by Trudeu.Other than getting pregnant, I didn't experience any side effects. In fact, my energy was great! And I never experienced headaches, but I drank lots of water. When I was hungry, I drank a cup of water with a few tablespoons of lemon juice (I add a splenda) and ate melba toast and felt fine.Oh yeah and my husband continued doing the diet and lost 50 lbs and had man boobs before he started and ended up with regular pecks.Also, HCG has to be fresh. It has to be stored in a moisture free environment in its powder form, and after its mixed it needs to stay refridgerated and is only good for 30 days.Hope this helps and good luck.",
            "post_id": "4340609",
            "timestamp": "1239394755",
            "user_id": "user_866910",
            "user_link": "/personal_pages/user/866910",
            "votes": "0"
        },
        {
            "answer": "I am going to start diet in 14days.  Do anyone no if the HCG help stop the hunger?   Anything i should be aware.",
            "post_id": "4346490",
            "timestamp": "1239580418",
            "user_id": "user_868747",
            "user_link": "/personal_pages/user/868747",
            "votes": "0"
        },
        {
            "answer": "I have first hand used this medication with tremendous results in clients of all ages, sizes, shapes.  The patients had their bodyfat done via Hydrostatic weighing pre and post therapy!  Almost all had a very significant reduction in bodyfat %, but more importantly there was not a loss in Lean Body Mass (LBM).  To be on 500-600 cals a day and to exercise 1-2 hrs a day and not lose muscle is amazing.  Without the HCG the body would lose at least 1-2 lbs of muscle per weak!   That is all the evidence I need to prove that medication works!",
            "post_id": "4348262",
            "timestamp": "1239636798",
            "user_id": "user_869349",
            "user_link": "/personal_pages/user/869349",
            "votes": "0"
        },
        {
            "answer": "having really bad headache on my third day, second day of low cal diet. This morning I was unable to keep any food down. Is this normal?? I feel like my body is in shock from the low-cal diet....not sure!",
            "post_id": "4362149",
            "timestamp": "1239915583",
            "user_id": "user_873592",
            "user_link": "/personal_pages/user/873592",
            "votes": "0"
        },
        {
            "answer": "Hi, im in south florida and am on the second day of HCG Simieons diet plan, I found a clinic that has you come in once a week for weigh in they have a support team. I was told to eat as much high fat foods as i could handle for the first 2 days and then start the 500 cal diet.has anyone else done the 2 day dream eating? all I can think of with every bite is how damn fatning what I am eating is!  I have 40 pounds to loose and have read the book online but havent found it to purchase yet. where has anyone found the actual book for purchase?I have read alot of success stories on line here and am thankful for a blog for support.",
            "post_id": "4372069",
            "timestamp": "1240174150",
            "user_id": "user_876576",
            "user_link": "/personal_pages/user/876576",
            "votes": "0"
        },
        {
            "answer": "Concerning your entry on Jan. 26, I can tell you what might be happening. You probably figured it out, but I'll give it anyway. (I am an RN, by the way.) HCG is a hormone that is normally produced by women just after a fertilized egg has implanted in the lining of the uterus. Its job is to keep the endometrial lining intact until the placenta can produce enough estrogen to take over, then hCG production tapers off. In your case, I suspect that hCG is simply keeping the endometrial lining intact beyond when it would have normally disintegrated and discharged (menstruation). In this case it doesn't mean you are pregnant, but is giving you a \"false positive\" by preventing menstruation. Stopping the hCG treatments should result in resumption of your normal cycle. Timing your hCG diet plan to coordinate with your cycle would be better for your peace of mind but otherwise should not be a problem.Side note: Early detection pregnancy kits look for the presence of hCG in the blood or urine as a reliable indication of pregnancy, so obvioiusly if you are on the hCG diet that test will be void. It will give you a positive even if you are not pregnant.",
            "post_id": "4375973",
            "timestamp": "1240262470",
            "user_id": "user_877804",
            "user_link": "/personal_pages/user/877804",
            "votes": "0"
        },
        {
            "answer": "I also just started my shots on Sunday and today is my day to start the 500 cal diet.  Let's keep in touch and see what happens.  I do not know if I can stay on a 500 cal diet for long but will give it a try.    stay tuned",
            "post_id": "4378206",
            "timestamp": "1240319314",
            "user_id": "user_877511",
            "user_link": "/personal_pages/user/877511",
            "votes": "0"
        },
        {
            "answer": "just make sure the hcg is coming from a dr. i tried it through some online weightloss place and i do believe i did not receive hcg..please be careful. and by the way i lost only 5 lbs  and  gained 20 when i stopped. The injections were pre filled and mailed to me.   not a good idea.",
            "post_id": "4381346",
            "timestamp": "1240367491",
            "user_id": "user_133250",
            "user_link": "/personal_pages/user/133250",
            "votes": "0"
        },
        {
            "answer": "has anyone gotten a skin rash from doing the hcg shots?",
            "post_id": "4394735",
            "timestamp": "1240696677",
            "user_id": "user_883876",
            "user_link": "/personal_pages/user/883876",
            "votes": "0"
        },
        {
            "answer": "I have taken the hcg shots for 2 weeks now and have lost 10 pounds.  The first 2 days, I was hungry while decreasing my food in take.  Now, I am fine with the 500 calories and I'm enjoying the results.  I did experience headaches the first 2 days but learned I had to increase my water intake.. this is very important to do.  I have experienced a sore throat today but I have dry sinuses and sore throats outside of using hcg anyway.  Overall, I am totally thrilled with the results and I never thought I could decrease my food intake and not feel hungry all the time.  The descipline is easy and well worth it!!!",
            "post_id": "4421806",
            "timestamp": "1241366183",
            "user_id": "user_892593",
            "user_link": "/personal_pages/user/892593",
            "votes": "0"
        },
        {
            "answer": "I just finished my second round of HCG and the diet.  I am a 43 year old male, and just under 6 feet tall with an broad athletic build.  I started around 237 on my first round and ended up at 196.  I didn't do a good enough job on the phase following the first round of injections and put about 15 pounds back on.  I just am finishing an 18 day 2nd phase today.  I am back down to 199 (I have been putting on muscle in the gym).I am now around 13-14% body fat.  I lost 8 inches around my waist and I'm fitting into 34 pants comfortably now.  I lost 40 pounds in my first phase while LOSSING VERY LITTLE MUSCLE!  Those posting that HCG does not work are ignorant.  I have had incredible energy and success while transforming my body.  I have now had several friends and family members do the diet with very similar results.  This is life changing for all of them.  My sister is very disciplined with diet but has had a very difficult time losing weight.  Her body really restists it.  This is the first diet (she has done weight watchers, zone, body for life, and others) that has made a big impact on her weight loss.  My back fence neighbor who is a diabetic down over 50 pounds, my good friend down 50+ pounds, the list goes on and on.I had zero side effects on the diet.  Just great success!",
            "post_id": "4422911",
            "timestamp": "1241391307",
            "user_id": "user_892934",
            "user_link": "/personal_pages/user/892934",
            "votes": "0"
        },
        {
            "answer": "I've been on hCg for 9 days, I've lost 9 pounds as of this morning. I have felt some low energy the first few days, I probably didn't binge properly.  My problem is TODAY!  I fell of the wagon big time.  I was feeling faint and figured my bloodsugar was low.  I ate a glazed donut and a little bite size piece of chocolate and two little sleeves of sweettarts.  Is this going to squash my efforts?  Or do I just shake it off and keep going?  What can I expect?",
            "post_id": "4438906",
            "timestamp": "1241733730",
            "user_id": "user_897803",
            "user_link": "/personal_pages/user/897803",
            "votes": "0"
        },
        {
            "answer": "I have been on the Diet for 8 days now and have lost 9lbs so far. I have a few questions...Does anyone have any other recipes?? I almost died this weekend trying to switch up my meals. Also has anyone had any muscle spasms? I've woken up twice out of my sleep with my calves freaking out. I feel like I'm not getting any protein and I've had a few headaches. HELP!!!",
            "post_id": "4451470",
            "timestamp": "1242082815",
            "user_id": "user_901800",
            "user_link": "/personal_pages/user/901800",
            "votes": "0"
        },
        {
            "answer": "Ellez. My friend is on hcg and told me that she had muscle spasms for the first two week and it went away after that. I just started the hcg on Sauturday May 9th and I have't had any problems.",
            "post_id": "4453654",
            "timestamp": "1242143494",
            "user_id": "user_902551",
            "user_link": "/personal_pages/user/902551",
            "votes": "0"
        },
        {
            "answer": "I am on the protocol for the fourth day.  I am on 150cc and think that after the first bottle I will jump to 200cc.  I weight 315.  Today I weighed in at 307...don't believe it yet until I get under 300.  I do have light headaches and a little hunger...that is why I think I will up the dose.  500 calories really can be alot of food.  Use cabage..coleslaw and put your chicken or meat on it.  I am cheating a bit and using salsa because I can not stand plain salad.  Melba toast is delicious.  I too have tried all...lost most weight on a traditional plan when I was 18 but took steroids in college playing football and gained alot quick.  Ten years in the army kept it off but then got out and life took over...not I am where I am at.  Yes, people on the biggest looser lost weight...why???portion contol and five plus hours a day in the gym.  We all don't have that luxury.  I have friends that have done this and swear by it.  My wife is skeptical, but it really does not affect our lifestyle except no more Cold Stone....I will keep you all posted.",
            "post_id": "4462765",
            "timestamp": "1242337414",
            "user_id": "user_905405",
            "user_link": "/personal_pages/user/905405",
            "votes": "0"
        },
        {
            "answer": "Does anyone know whether the 23 day or 43 day protocol works best?  Trying to decide if I should skip my Sunday's?",
            "post_id": "4462769",
            "timestamp": "1242337481",
            "user_id": "user_905405",
            "user_link": "/personal_pages/user/905405",
            "votes": "0"
        },
        {
            "answer": "There are a lot of comments on this particular thread that need clarification. SIde effects can be both negative (headaches) and positive (safe weight loss or hunger suppression). Many 'side effects' reported attributed to hCG during the protocol can be due to the low calorie intake, dehydration, the change to improved food choices, the body 'detoxifying' (the term is used loosely) because of the change to all organic foods, or a combination of the above. Of the many years hCG has been around there have been very few true long lasting negative side effects reported. And actually, none have been reported in decades that have been attributed specifically to the low dose hCG used in the protocol. Some of the things reported in this thread can be alleviated with increased water intake. Side note: drinking a few ozs of pure aloe vera juice/gel with each meal helps with bowel movements better than colace or other medications perscribed. Organic senna tea helps as well. A common side effect to this protocol is dry skin. This is usually temporary and improves on its own towards the end of the protocol. Again, using aloe vera gel helps and is a good skin conditioner but not the best moisturizer. Those of you who get headaches can use tylenol but if the headaches concern you or are unbearable or worse than you have ever experienced, stop the protocol and see your physician. You must be guided by a physician if you are going to utilize the hCG protocol. This is not for everybody.  --DrG",
            "post_id": "4485506",
            "timestamp": "1242909898",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "How are you doing? I don't know how tall you are but however you choose to loose the weight you keep it up. This is not just about loosing weight, it is about educating yourself on how your body reacts to different foods, portion choices, educating yourself on how to keep the weight off in order to avoid future health issues. Ensure a health care provider is following you. The 3 most common things people experience on this protocol are 1. Dry skin 2. constipation and 3. boredom with the diet. Drink plenty of water. to choose whether 23 or 43 or even up to 59 days is up to you and whoever is following you. That is very individual and there is no right answer for everyone. Congrats and keep us all posted!  --DrG",
            "post_id": "4485532",
            "timestamp": "1242910435",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "Hello All,I just purchased the Oral HCG here in CO from the Company directly and am wondering if anyone else has taken the Oral type,(not the injections). If you have please let me know all the details, etc: if you like it, if you don't, if you had side effects. Or any other thing that may be useful. I would appreciate it. Thanks",
            "post_id": "4488668",
            "timestamp": "1242965725",
            "user_id": "user_913425",
            "user_link": "/personal_pages/user/913425",
            "votes": "0"
        },
        {
            "answer": "I couldn't loose weight at all. I tried everything possible. My last resort was to try HCG. I did the first and second phase of HCG. I stayed on the diet for 40 days and of course cheated some. However, I lost a total of 25 pounds in six weeks. My hormone levels regulated including all my other levels regulated as well. My cycles became normal and I no longer have mood swings. With my great sucess my husband decided to do the HCG diet... he only did phase two and he lost 27 pounds. He did not follow the diet according to how it should be and those were his results.This is the only method that helped us and we are both in our fortys... If you are interested in trying this product we went through HCG Medical (lookscompany.com) Ask for Britni Bersin she was our specialest....",
            "post_id": "4504479",
            "timestamp": "1243440405",
            "user_id": "user_918963",
            "user_link": "/personal_pages/user/918963",
            "votes": "0"
        },
        {
            "answer": "hCG treatment has been fantastic for me - I'll be 50 years old this year, and was 25-30 pounds overweight.  Went on the 43-day oral hCG regimen (sublingual drops, not shots) beginning in late January and lost 20 pounds during that time.  Although it is recommended that you use no lotions, creams or face makeup during the hCG treatment, I had to continue using some lotions, taking essential fatty acidsand using a rash cream sparingly for eczema, so that may have slowed downmy weight loss a bit (if you wear it, you might as well have eaten it,because it is absorbed into the body and metabolized as if you had).Was hungry the first few days while my stomach was shrinking,but learned I COULD go to bed hungry and not be adversely affected.Discipline!  If you're willing to live (temporarily) like others are not willing to,then you'll be able to live (slender) like so many others are not able to.I've kept the weight off for over 2 months (perfectly) by following Kevin Trudeau'sPhase 3 and now Phase 4 diet recommendations (but not perfectly).The key to keeping the weight off is to weigh yourself 1st thing every morning,and do a fast/protein-only dinner day any time you weigh in at over 2 poundsabove your ending hCG weight.If you have 3 days where you plateau, do a 6-green apples throughout the day,then as much steak (or chicken, preferably hormone and antibiotic free, range fed)as you can eat dinner, and you'll start to lose again.I'm now doing a 20-day regimen to lose another 10 pounds.As of Day 5, I've lost 4 more pounds.The most amazing thing about hCG is that it pulls the bad fat stores,stuck deep down in your body, out of all the right places.I have my 20-something body back, a feat I couldn't even accomplishwhen I trained for and successfully a marathon 5 years ago.The trick is in what it does to reset your hypothalamus and hence your setpoint.And all in less than half a year.Now I'll actually be CELEBRATING my 50th birthday,instead of wondering if I'll be carrying that extra 30-poundburden around with me the rest of my life.Don't let anyone tell you hCG doesn't work.I know lots of people who are using it with fantastic results.The key is in following the diet protocol, doing the apple/protein plateau breaker,and staying on top of your weight every day once you're done.I've been fat (well, 30 pounds fat on a should be 115-pound body)and I've been slender, and slender is a whole lot more enjoyable.It's worth changing your eating habits to stay slender -let your taste buds know who's boss!Nothing tastes as good as thin feels.Worried if I could do hCG cuz I have mild hypoglycemia, but the fat being pulled out of your bad fat stores to be burned up throughout the day seems to minimize any hypoglycemic effects.  I would not do it if I had severe hypoglycemia - you must take care of that first.  I did that through a liver/gall bladder cleanse several years ago - for 3 days, eat only fresh fruit, fresh or steamed veggies & brown rice; drink lots of apple juice, too; on the 3rd night, before going to bed, drink 3/4 cup each of freshly squeezed lemon juice and extra virgin olive oil; in the AM you may pass hundreds of gall stones and have reduced or no hypoglycemia symptoms that very day forward.",
            "post_id": "4510749",
            "timestamp": "1243572832",
            "user_id": "user_920897",
            "user_link": "/personal_pages/user/920897",
            "votes": "0"
        },
        {
            "answer": "I have tried so many things to lose weight. I am considering HCG. But, I don't eat because I am hungry. I eat due to stress and/or depression more often than not. I know that I am probably seldom really hungry when I eat. No, there is nothing that can be done to remove the stress/depression factors unfortunately. This diet sounds like it helps you not be hungry so you are able to eat at the 500 cal level. Do you think there is any hope for someone who eats like I do?",
            "post_id": "4518703",
            "timestamp": "1243814989",
            "user_id": "user_923677",
            "user_link": "/personal_pages/user/923677",
            "votes": "0"
        },
        {
            "answer": "We share this difficulty. I have found that working on a diet without dealing with the feelings is a waste of time.I started going to overeaters anonymous. I was worried it would be a bunch of crazies in a room.  It turned out to be a wonderful place to learn, feel and build supportive relationships.It helped me on several levels. It helped me learn why I ate (feeling lonely) and a different way to actually feel the feelings.  I had always trusted that some sweets would have me feel better. Now I can call a friend and go for a walk instead.HCG is a wonderful tool.  It does not promote weight loss. It does completely eliminate the hunger pangs. It's still up to me to make a good choice of what to eat and to follow the very specific instructions in the Simeone book.",
            "post_id": "4520857",
            "timestamp": "1243890845",
            "user_id": "user_924426",
            "user_link": "/personal_pages/user/924426",
            "votes": "0"
        },
        {
            "answer": "Sometimes I feel like I eat to punish myself for something that I don't even know what I've done. If by chance I drop a few pounds I find myself eating more as if to gain back those pounds. It is definitely a mental thing with me.I will check on an overeaters group. There has to be one here somewhere. And I will also find a physician who utilizes HCG and endorses the Simeone program. Thank you so much for your response.",
            "post_id": "4526231",
            "timestamp": "1244026653",
            "user_id": "user_923677",
            "user_link": "/personal_pages/user/923677",
            "votes": "0"
        },
        {
            "answer": "I am on the Releana/HCG diet plan I was wondering if anyone had side effects that caused their central nervous system to shut down...After 1 1/2 weeks @ 500 cal a day, I became really ill....no rashes, or anything but let me know. It does work I have lost 17lbs but I have discontinued it,Good luck everyone",
            "post_id": "4528028",
            "timestamp": "1244058183",
            "user_id": "user_926704",
            "user_link": "/personal_pages/user/926704",
            "votes": "0"
        },
        {
            "answer": "Go see you primary physician as soon as you are able. Your central nervous system should not be \"shutting down\" because of the protocol. You likely have some other issue that needs to be looked at right away. Whatever the cause, you need to be seen quickly if you are ill and have no explanation for your illness.",
            "post_id": "4530259",
            "timestamp": "1244119930",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "Eating a donut and chocolate will definitely slow you down. But maybe for only a day or two. Get back to the Simeon's diet and you should be fine. I personally did almost the same thing and didn't lose weight for two days - but didn't gain anything either. Stop beating yourself up and just do better today, OK?Also, if you are experiencing low blood sugar, you need to spread you meals out more or use a protein drink supplement to balance your blood sugars throughout the day. We have used UltraLean by Biogenesis for this very purpose to good effect on the hcg protocol. (it does add calories but we stay under 1000 a day and it doesn't seem to affect the weight loss)",
            "post_id": "4553050",
            "timestamp": "1244732380",
            "user_id": "user_572196",
            "user_link": "/personal_pages/user/572196",
            "votes": "0"
        },
        {
            "answer": "Side-effects:  Mild skin rash developed after four weeks.  Small, mildly itchy, red bumps under my left arm.  Not too irritating.  On and off, I've had what have felt like tiny, micro-muscle tears or pinched nerves somewhat randomly throughout my body.  I cut back on the intensity of my workouts (less weight lifting, ride my bike a little slower, et. al.) and that seems to have helped.  I've had some moodiness, but what do we expect on so few calories?RESULTS: I'm on day 37, and I've gone from 267 to 233 - almost a pound a day.  I had four lapses from the strict protocol, but didn't go too far overboard.  I followed each lapse (with the permission of my physician) with an \"apple day\" and that helped keep me on track.  I work out at least an hour daily as well.HOPES: I hope to reach and stay below my target weight of 230 and continue losing a pound a month for a year.  If I can reach 220 by June 2010, I will consider this a success. All my friends are congratulating me, but I just keep telling them this is step one; it's next summer, keeping the weight off, that really matters.Michael J.",
            "post_id": "4564237",
            "timestamp": "1245068808",
            "user_id": "user_938369",
            "user_link": "/personal_pages/user/938369",
            "votes": "0"
        },
        {
            "answer": "I too lost weight with the injections.  All of it appeared to be fat and I was soo pleased.  Another friend of mine started them and did wonderful too.  My problem:  I ended up with breast cancer and do not know if it had anything to do with it or not for sure but I suspect it did since it works with the hormones.  My friend had noticed a lump too but fortunately it was just a cyst.  Once she got off the shots the lump shrunk so with those 2 stories..I just don't know.  It was great weight fell off but I will never use it again just because I am not sure...",
            "post_id": "4581422",
            "timestamp": "1245501742",
            "user_id": "user_943716",
            "user_link": "/personal_pages/user/943716",
            "votes": "0"
        },
        {
            "answer": "I am so sorry to hear about the cancer. My mother has had 2 radical mastectomys and my dad, colon cancer so I have seen it's effects. BUT, that has been quite a while ago and both of my parents are still survivors. Take hope. I'll be praying for you and your family.",
            "post_id": "4581535",
            "timestamp": "1245506072",
            "user_id": "user_923677",
            "user_link": "/personal_pages/user/923677",
            "votes": "0"
        },
        {
            "answer": "I have using taking HCG spray for a week. I am very hungry. I have added some extra calories, just more chicken , fish and veggies. I have only lost 3 lbs in a week. I am drinking more than a gallon of water a day. I did get the enery/ appetite surrpessent from Body Solutions In CO Springs where I live and they are helping but the HHC oral is not working for me.",
            "post_id": "4582055",
            "timestamp": "1245521472",
            "user_id": "user_930612",
            "user_link": "/personal_pages/user/930612",
            "votes": "0"
        },
        {
            "answer": "Just curious to know, i was told by my dr that hcg could increase the chance of a pulmonary embolism or blood clot, has anyone else heard this before, i would like to begin a diet using hcg but unfortunately ive had a blood clot about 4yrs ago so i am very apprehensive about taking it, ive tried researching but havent seen clots as any side effects..let me know if u have heard of this please.",
            "post_id": "4617470",
            "timestamp": "1246502516",
            "user_id": "user_955497",
            "user_link": "/personal_pages/user/955497",
            "votes": "0"
        },
        {
            "answer": "I am on day 3, the first vlcd day and am super sick! I can't eat anything at all because it just comes back up. I'm trying really hard to drink enough water but I can't keep it down. I don't know if it has anything to do with hcg but I am wondering how having almost no caloric intake will affect my body on the diet.",
            "post_id": "4651556",
            "timestamp": "1247430882",
            "user_id": "user_966333",
            "user_link": "/personal_pages/user/966333",
            "votes": "0"
        },
        {
            "answer": "thanks for the well informed comments. Have you ever heard of any kidney problems when someone was doing the hcg protocol? thanks for an answer",
            "post_id": "4669745",
            "timestamp": "1247862541",
            "user_id": "user_972511",
            "user_link": "/personal_pages/user/972511",
            "votes": "0"
        },
        {
            "answer": "I am on day 5 of my HCG shots now and have lost 8.3 lbs as of this morning. I don’t feel tired or even have headaches, I do however feel hungry a good portion of the time. Not ravenous, but hungry :)I was surprised that I lost 1 lb after the first day even though it was a binge day. No loss day 2, but significant loss from days 3 & 4.I consumed huge amounts of caffeine prior to starting HCG (24-40 oz a day of coffee and then soda in the afternoon/evening) so I’m surprised that I don’t have the caffeine with-drawl headaches. I’m drinking 1 cup water upon waking and then 1 cup of black coffee for breakfast, and throughout the day 1 or 2 cups of Oolong tea and LOTS & LOTS of water. The main drawback is spending so much time in the bathroom!Late afternoon/evening have always been the time of day I feel the most hungry, so smelling the dinner the rest of the family is eating is the hardest thing right now. They have all said they want eat the same foods as me (just in larger portions) so that should help…we’ll see how that goes.Day 3 - I was not so sure how I was going to do on this, but seeing the 8.3 lb loss is VERY encouraging. I’m sick of feeling tired all of the time; and looking in my closet thinking, “what can I wear to cover the fat?” instead of, “That’s cute; I think I’ll wear that today!” I’m 44 and had been thin until the past 8-10 years (even after 4 babies – getting back into my old clothes within 3-4 months after birth). I started the HCG needing to loose 105 lbs. How does one get to this point? Rhetorical…I know it feels good to be thin, and I know I can do it again! The goal is worth the effort!",
            "post_id": "4672620",
            "timestamp": "1247943682",
            "user_id": "user_973438",
            "user_link": "/personal_pages/user/973438",
            "votes": "0"
        },
        {
            "answer": "Anyone with existing renal (kidney) problems needs to see their primary physician to evaluate whether the hCG is appropriate. Not all renal problems are the same. As far as the hCG protocol being a direct cause for kidney problems I have not heard of any cases. However, if someone dehydrates themselves significantly or eliminates the fruits/veggies and just takes in high protein foods, the potential for kidney problems increase.To All: Hunger is a very subjective and complex issue. The hCG protocol does not \"cure\" hunger but allows for it's suppression in the normal setting. hunger can be triggered by so many things not related to your body requiring nutrition. It can be triggered by smell, sight, and emotional desires. Finding your individual triggers for hunger and minimizing those triggers is helpful. Also, some people are hungry only because they have trained their body to eat for the sake of eating at certain times of the day (or night) and for the sake of eatign certain things. Part of the learning with the protocol is the 'retraining' of your body to eat when it acutually needs the nutrition and to help your body to process foods more efficiently.",
            "post_id": "4674898",
            "timestamp": "1248020332",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I have been on hcg for 15 days and yesterday my throut started hurting and my hips and all my joints in my legs hurt. I also have a headache. Has anyone felt like this?? Or am I just getting a summer cold...I have lost 13lbs and I'm so happy. Please let me know......",
            "post_id": "4689975",
            "timestamp": "1248376858",
            "user_id": "user_979272",
            "user_link": "/personal_pages/user/979272",
            "votes": "0"
        },
        {
            "answer": "I am on my second HCG diet atm, I needed to lose 160#'s.  I have had GREAT success with this, the 1st diet I lost 52 pounds then another 8 pounds in the 6 weeks after it.  At this time in my second round of HCG I have lost 16 pounds in 14 days.There have been NO side effects for me or the other 6 people that I personaly know that have done this or are doing it other than weight loss.Before I tried this diet I researched it for almost 6 months extensively and found very very minor side effects associated with HCG, I talked to 4 different doctors and none had heard of any serious side effects...like I said I REALLY researched this!!As for anyone that says \"of course you will lose weight you are eating only 500 cal\", they need to try it...I have and you DO NOT lose weight, your body goes into starvation mode and hoards everything it gets....you burn through the good fats very quickly then become extremely tired and lack energy.Hope this helps someone...do research, there is a lot out there on this, ask some doctors...a little home work goes along way in this diet scam country of ours!",
            "post_id": "4794365",
            "timestamp": "1250931328",
            "user_id": "user_1013070",
            "user_link": "/personal_pages/user/1013070",
            "votes": "0"
        },
        {
            "answer": "I am on my second session of the HCG and it has been a life saver!  I have had absolutely NO side effects at all.  I am going through a doctor and have weekly appointments to talk, ask questions and get measured.  The first time I did it I lost 40 lbs in 31 days and over 40\" total.  During the 6 weeks I was off of it, I watched what I ate but continued to eat out at restaurants and continued a normal lifestyle.  I have less than a week left on my second session and so far I have lost 35 lbs and almost 45\" total.  This is the only things that has EVER worked for me.  My daughter has been doing the drops under the tongue and has been successful, losing 25 lbs in her 40 days, but it has been more of a struggle for her with hunger.  I've heard that the drops aren't as effective at controlling hunger.  Also, she has to take them 4-6 times a day which is, I think, ridiculous.  Her friend, who has a lot to lose, has done the drops as well and in her 40 days will lose 40 lbs and has gone from pants size 16 to 12.  I am doing the cream and would never do anything else!!  I have friends that have done injections as well, and it worked for them, but they wish they would have known about the cream before!  I plan on doing this 3 more times and my goal is to be down a total of 170 lbs.I don't understand these people that are so closed minded as to think that all you have to do is watch what you eat and exercise.  That's great for some people, but I did that for 20 years, religiously, and what did I get? Nothing!  With thyroid diseases, PCO and degenerative arthritis that prohibits me from exercising strenuously enough to make much of a difference, it has been impossible for me to get below a certain weight.  After high prednisone treatments came the horrible weight gain and, subsequently, the extra lbs that I didn't need in the first place!Using HCG is, for me, the only solution to a problem that has made my life miserable for many years.  I was almost to the point of gastric bypass but now that is off my radar for good!  Those that judge the users of HCG must not have the problems losing that some do.  They need to stop judging and support those of us that have made informed decisions to make a difference in our lives.",
            "post_id": "4797805",
            "timestamp": "1251044237",
            "user_id": "user_1013884",
            "user_link": "/personal_pages/user/1013884",
            "votes": "0"
        },
        {
            "answer": "I'm looking at going to a local clinic that does B vitamin shots.  Does anyone know anything about those?  They start you on the B vitamin and then you can also do the HCG shots but it doesn't sound like they make you stick to the diet.  They have you eat healthy organic foods but not the typical protocols.Has anyone done this and if so has it worked or do you think it will work?  Has anyone done the HCG injections and not done the exact diet but still lost weight?Trying to investigate before I spend the money.",
            "post_id": "4837102",
            "timestamp": "1252043530",
            "user_id": "user_1027748",
            "user_link": "/personal_pages/user/1027748",
            "votes": "0"
        },
        {
            "answer": "Hi I am the manager at a wieght loss franchise that offers injections such as the B12.  Now first of all, I'm not gonna say anything good or bad about this hCG stuff because I don't know a whole lot about it just yet.  However, from what I have gathered there are side-effects to it just like there is to anything else these days.  I'm not sure that altering hormone levels in the body should be a persons first choice in their efforts to lose weight.  At my clinic we offer something called a Lipo injection that helps to get rid of the fat in the body along with B12 and B6 injections.  We also have prescription appetite suppressants.  Personally I would suggest you check into clinics that offer this sort of thing before injecting yourself DAILY with hormones.  That seems a bit extreme to me.  You and everyone else is welcome to check out our website at www.letslose.com and see what we offer.  Once again, I am not criticizing this hCG stuff but I personally wouldn't want to mess with my hormone levels unless I had to.",
            "post_id": "4839191",
            "timestamp": "1252095189",
            "user_id": "user_1028351",
            "user_link": "/personal_pages/user/1028351",
            "votes": "0"
        },
        {
            "answer": "I need help !!! I have kept my hcg in the fridge until i need to use.., but i recently got a flu and could not start yet. I want to know how long the hcg lasts or remains potent? I have had it in the fridge a week already.Iwill be starting hcg for the 2nd time. the first time i lost 15#.I just do not want it to go bad because of the money i paid for itthanks",
            "post_id": "4846348",
            "timestamp": "1252336353",
            "user_id": "user_1030957",
            "user_link": "/personal_pages/user/1030957",
            "votes": "0"
        },
        {
            "answer": "I have a good friend in the Ft. Myers, FL area that went through New Life Medical and lost 50 pounds in 13 weeks.  She went through Four Phases:  Detox Diet (1 week); Ketosis Diet (2 weeks); HCG Injections (10 weeks); and Maintenance, which she is doing on her own.  She did not follow the original protocol.  She ate whatever she wanted, keeping it to 600 calories or less per day.  She chose healthy foods and she gets a lot of exercise.  She didn't worry about any of the original protocol caveats such as prohibiting the use of body oils.he has been off the program since May and is doing great.",
            "post_id": "4852847",
            "timestamp": "1252504834",
            "user_id": "user_1033255",
            "user_link": "/personal_pages/user/1033255",
            "votes": "0"
        },
        {
            "answer": "Vit B12 shots are not for prolonged/sustained/ and persistent weight loss. It is an adjunct for different weight loss protocols that helps in different ways for different people temporarily.How long hCG last in your fridge depends on whether it has been mixed or not. If it has been mixed it can last anywhere from 30 to 60 days if kept in the fridge. If it has not been mixed and is dry it willlast for a few years. Is there an expirarion date on your hCG? There should be. Even if a clinic has prepared the hCG for you they should ALWAYS place an expiration date on the meds. ALWAYS.",
            "post_id": "4861319",
            "timestamp": "1252696524",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "as you know the use of HCG is still controversial.. the side effects mentioned earlier are with the use of high doses of HCG.. for infertility.. 10000 units a day, 5 days a month for 6 month..i would like to know how much, the dose of HCG, ever one is taking.. and if you also taking adipex..",
            "post_id": "4863084",
            "timestamp": "1252737729",
            "user_id": "user_1036648",
            "user_link": "/personal_pages/user/1036648",
            "votes": "0"
        },
        {
            "answer": "Hi all, I am in the 6th week of my second session of HCG under a Dr's care.  I am using the injections in the belly.  I've lost 80 lbs since March '09 when I began my first session of HCG shots.  The Dr. also tested my thyroid and we are finally at a dosage of T3/T4 where my levels are normal.  He says that this along with a sensible diet once I reach my goal (which I'd like to lose another 40#) and the thyroid meds (which I may need for the rest of my life) I should be able to keep the weight off.  I haven't had any bad side effects.  In round 1, I have to admit I was hungry at first but the Dr. perscribed adipex and that has helped.  Although I only take 1/2 pill (~18.75mg) once a day and only when I'm on the HCG and 500 calories.  The next 3 weeks there are additional foods added and 900 calories total, then the next 3 weeks calories are up to 1200.  I feel really great!  I was 301# when I started, I hated myself and taking a downward spiral.  I also have Osteoarthritis in my knees very bad.  My orthopedic Dr. told me that I needed to lose considerable amount of weight in order for him to do a knee replacement and have it be successful. After that vist I sat in my car and cried! But then I made the call to the Dr. that he recommended to help me lose the weight.  The doctor he recommended had also been on the HCG diet and has been successful at losing his weight and has decided to offer the program to his patients.   That is my goal and after the knee surgery I plan on exercising even more and staying healthy.  I've been on other diets, Jenny Craig (lost 74#) Well 4 Life (lost 54# and then after gaining it again lost it again) along with other diets that I don't need to mention because they may work for others.  I was never able to keep it off.  Remember, it's not a diet, you need to change your life style and the way you eat if you have a weight problem.  Which I never had until I had two kids, got a divorced and remarried but now work in an office WAY too much and way too many late hours! lol....But now with the help of a wonderful DR, getting my thyroid in check, taking off the weight (with the help of HCG, B12 shots, adipex) and the support of my husband and friends and doctor I am losing this weight and feel like I can finally keep it off for good again....  I FEEL GREAT!!!!Do what works for you, but for the right reasons, and under a Doctor's care to be safe.  Be safe and God Bless you all!!CM in AZ",
            "post_id": "4865845",
            "timestamp": "1252824095",
            "user_id": "user_1037700",
            "user_link": "/personal_pages/user/1037700",
            "votes": "0"
        },
        {
            "answer": "Oh, forgot to mention, the Dr. suggested I take Miralax for any constipation.  With little or no fat intake, this can be a small side effect but the Miralax worked well.",
            "post_id": "4865848",
            "timestamp": "1252824229",
            "user_id": "user_1037700",
            "user_link": "/personal_pages/user/1037700",
            "votes": "0"
        },
        {
            "answer": "I started my HCG injections today so I'm loading today and tomorrow. I'm eating so much. It feels disgusting. I just know these 2 load days are going to make me gain 10 lbs. A few questions tho:I'm trying to do everything to the letter. I'm using Burt's Bees shampoo, conditioner, body wash, face wash, and face scrub. They are not 100% but they are all over 98% natural and all that. Is this okay? I'm also using Tom's deoderant and toothpaste. I'm a little worried about the shower water though because I didn't have the money to get a filter put on it. Has anyone seen any marked difference in filtered vs. non-filtered shower water? I am in the military and have a PT test coming up next month. I have to do 2 minutes of pushups, 2 mins situps, and run 2 miles in less than 19 mins. I'm a little worried about how the 500 calorie diet is going to affect my performance. If I don't pass I get in trouble and I don't want that. Maybe I should up the diet a couple hundred calories the day before? Anyone have any ideas on this?Thanks in advance for responses.",
            "post_id": "4901889",
            "timestamp": "1253741947",
            "user_id": "user_1050363",
            "user_link": "/personal_pages/user/1050363",
            "votes": "0"
        },
        {
            "answer": "I want to try the HCG but I'm a little worried while I was pregnant with my first child I had preeclampsia (hopefully spelled that right). I was wondering if that would come into effect since this is a hormone that pregnant women have?",
            "post_id": "4923452",
            "timestamp": "1254258972",
            "user_id": "user_1057272",
            "user_link": "/personal_pages/user/1057272",
            "votes": "0"
        },
        {
            "answer": "i fel so slepy, i dont know if this is the side effect of hcg injection. its my 3rd day of hcg, il be starting tomorw to have only 500 calories but you know i still love to eat so much, is hcg can help to supress food intake?",
            "post_id": "4943032",
            "timestamp": "1254752907",
            "user_id": "user_1063365",
            "user_link": "/personal_pages/user/1063365",
            "votes": "0"
        },
        {
            "answer": "I took the sublingual hcg (spray under the tongue) for 5 weeks-had to go somewhere the last week when I really couldn't stick to the diet) but anyhow, still lost 27 pounds.  the only side effect was a slight headache the first couple days and took aleve.  I did exercise in that I walked 3 miles a day but I do that most of the time anyhow, and did my push ups and sit ups.  I am starting it up agaian to lose my last 15-20 but was bery pleased.  I lost 8 inches around my waist, and a few more around my hips and breast.  I purposely measured my calf muscles and arm muslces and did not lost any inches there.  It really did seem to be just the fat.  I feel great.  I wasn't fatigued, but I know of others who were when on the diet, but it could be you are doing too much.  I have a pretty sedentary job but if your life requires a lot of activity, that could be the problem.  good luck.",
            "post_id": "4950583",
            "timestamp": "1254923310",
            "user_id": "user_596792",
            "user_link": "/personal_pages/user/596792",
            "votes": "0"
        },
        {
            "answer": "I posted a comment to you, but did it to \"any1\" by accident, so be sure to read my earlier comment.  I forgot to add that the most amzing thing about the diet was that I WAS NOT HUNGRY.  I actually had to force myself to eat what I was supposed to eat.  If you are a stress eater, that may not be the case, but as for me, I wasn't even tempted to cheat on the diet.",
            "post_id": "4950597",
            "timestamp": "1254923519",
            "user_id": "user_596792",
            "user_link": "/personal_pages/user/596792",
            "votes": "0"
        },
        {
            "answer": "I am on my 3rd week of the HCG injections and could not be happier! I have nothing but wonderful things to say about it. I am 17lbs down as of this morning :)I did research on the original HCG protocal for 3 months before starting the injections.While there are some people on here talking like they know everything on this and bashing it, I will not claim to know it \"all\" ( because I am not a doctor) I am here if you have any questions. I will try to answer them with all that I have gathered on the original studies and people that I have know to do this from years back to now.",
            "post_id": "5025449",
            "timestamp": "1256825158",
            "user_id": "user_1090303",
            "user_link": "/personal_pages/user/1090303",
            "votes": "0"
        },
        {
            "answer": "I am on my 7th day and have lost 5.5 lbs. I had one day of no weight loss, and then a lb the next day and then this morning only 1/2 lb. I need to lose a total of 30 lbs. I to a pedicure yesterday and they use lotion on your feet and lower legs. I should not have done that.I have been hungry althoI am not craving anything in particular.once I start eating lunch and then dinner I am ok. I am not having a problem with hunger going to bed.I read that hcg pulls estrogen and testosterone from the fat and that is what helps you to lose in those areas. I am staying off estrogen until the diet is over. I also take Tmeds but I am NOT stopping that. I am finally where I need to be with my thyroid.All KT does is tell his experience, how to get hcg and the diet phases. some question and answer and anecodotal accounts.NO ONE will ever be able to do all of  what HE thinks you need to do. Dr. Simeons did not suggest all the stuff KT does.   Like Apple Cider Vinegar and Coconut Oil...A nurse at my clinic  said she was able to quit taking HRT because it seemed to \"reset\" her hormone imbalance. Cool.My clinic will not prescribe any prescrip for appetite suppression. They said it is counter productive. As soon as you get off the drug, the hunger just comes right back. They did give me a product for constipation called Release.My main complaint is moodiness. Otherwise no side effects so far by 7th day.",
            "post_id": "5029547",
            "timestamp": "1256920431",
            "user_id": "user_1011765",
            "user_link": "/personal_pages/user/1011765",
            "votes": "0"
        },
        {
            "answer": "I have to stop the hcg at 15 days because of travel and Thanksgiving. What will happen ? ccccccan I start again in 8 days??",
            "post_id": "5075054",
            "timestamp": "1258091801",
            "user_id": "user_1106558",
            "user_link": "/personal_pages/user/1106558",
            "votes": "0"
        },
        {
            "answer": "Ok - Today's my first day on Oral Drops and my head is killing me! I am trying to gourge myself but it's not taking! I have been on phentrime for a while so I'm really not used to this - I'm going to go have some tacos and a regular soda! (YUCK!) Maybe I'll even go to the Cheesecake Factory and pick up a slice of cheesecake - you will I be sick then! I'm thinking they do this to us on purpose so we will remeber how sick we felt eating these foods and never want them again! Oh, I know where I'm eating after Church 2morrow! Texas Roadhouse!!!!!Seriously, I went online and purchased the drops from a company in MD and they stung at first becaise the mix is H2O and 10000 (strength) Pregnayl and pharm. alcohol- BUT MY HEAD HURTS for at least two hours after taking it.Advice?",
            "post_id": "5125105",
            "timestamp": "1259455926",
            "user_id": "user_1122348",
            "user_link": "/personal_pages/user/1122348",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,Please say a prayer for me that this works!  I am so tired of being overweight.  Not only am I hypothyroid, but I also suffer from hypoglycemia and fibromyalgia.  Autoimmune disease runs in my family.  At any rate, it has been super hard for me to do the 500 calorie a day diet.  I started this a few weeks back and would lose a pound, then gain 3 back.  I felt horrible and mad at myself for being weak.  I was basically doing the injections for naught, as I wasn't doing the protocol correctly.  The day after Thanksgiving was day 3 for me and I am down 4 pounds total 5 days.  I am always thinking of food and how good it will taste.  This is very difficult, and the food selections are limited.  I will be soo glad when I'm not hungry all the time and the weight falls off, and I have energy and a joie de vivre (sp?)  Please lift me up in prayer, as I would love to lose 40 lbs.   thanks so much!",
            "post_id": "5131057",
            "timestamp": "1259633340",
            "user_id": "user_886281",
            "user_link": "/personal_pages/user/886281",
            "votes": "0"
        },
        {
            "answer": "Hi!  i just started the hcg diet yesterday...my dr. suggested the injection in the thigh...i couldn't do that..and because i have so much belly fat, I figured I would have enough \"cousion\" as to not feel the pain..and it was fine.  I paid $600 for a two hour consultation..;o( Thank GOODNESS the dr. takes payments..the meds are $40 every two weeks..and 100 needles from walmart were 12$.  So, The only problem..I am worried because I have hypothyroid...and hypoPARAthyroid..i had a thyroidectomy two years ago..and losing weight is just not as easy as it used to be!  and I take calcitriol and calcium everyday...dr. didn't really know if it was a problem...so I am assuming it wasn't..;o) I sure hope not!  I have been overweight for most of my adult life and all of my teen years...onset at about 12..I have had four children and I did weight watchers last year..and did alright...I weigh 194 and I am 5'1...I am very motivated and I know I can stick to the 500cal...my dr. said to \"gorge\" for two days..but, some are saying three..I appreciate all the previous comments..and if anyone knows anything about my situation..please share..btw...I was on 222mcg synthroid..and switched to nature-throid yesterday..65mg..hope this is the right amount!  I have a friend who was was just like me...size I mean..and from July to December she lost 63 lbs....and maintained inbetween her 2 and 3 round..she is on her third round now and only wants to lose 15 more..this is amazing how GOD can use your body to heal you...(hcg being a natural hormone) not a diet drug!  Happy LOSING!!",
            "post_id": "5250349",
            "timestamp": "1263055629",
            "user_id": "user_1166156",
            "user_link": "/personal_pages/user/1166156",
            "votes": "0"
        },
        {
            "answer": "I do not understand how any of you could knowingly starve your body like that.. Hcg or No Hcg 500 cal diet is insane.. Your body needs fat to function. Low carb is ok but there again if your working out you need some carbs or you will have muscle loss. My sister did Hcg in a medical clinic and did the entire program. She has skin hanging off her everywhere! No muscle tone.. Lost fat no doubt on 500 cal but also lost muscle ton and lots of it.... Fast weight loss is not the way to go people.. Slow.. Change your life by controlling your habits..Its not that hard and it is mostly mental. Everyone wants to eat   something that we know isnt good for us. And you can.. Just be smart about it. And move your body. People take all this stuff and pump it into there body thinking it will help. Being smart will help. Telling your self you can control what you do and what how much you eat.. Fact of matter is.. People do not move like we use to ..I have been over weight since kids. No body's fault but my own. Being young and never worried about what my eating habits were.So I have been trying this way that way.. Never got into pumping pills or anything like that to help .. But thought it.Long story short.. My body has changed its shape so my much in the past year it is incredible.. I have always worked out but decided to try something different. Started doing a program extreme hour, hour and 15 every day with on day off,,, started writing down what I eat and guess what... Went from wearing a 16 reg to a 11 jr. in jeans! Gained muscle and now the weight is coming off.... And tons of energy. Hello no pills.. No Hcg.. I wish you all luck with whatever it is you think you need to try. Just be safe and smart about it.. Its your body.. Its only gonna give you what you give it....",
            "post_id": "5256442",
            "timestamp": "1263230784",
            "user_id": "user_1168655",
            "user_link": "/personal_pages/user/1168655",
            "votes": "0"
        },
        {
            "answer": "Am very anxious to give this a try. Have heard only good things about it. Am wondering if anyone knows of any clinics in the Long Island, NY area, NYC or the boros.I know some people use the homeopathic & some the injectible or sublingual. I don't think I could inject myself, but am also concerned that the homeopathic may not have as much HCG in it.Any thoughts or suggestions for me?",
            "post_id": "5257088",
            "timestamp": "1263240752",
            "user_id": "user_1168908",
            "user_link": "/personal_pages/user/1168908",
            "votes": "0"
        },
        {
            "answer": "I started the HCG drops 6 days ago and I've lost 10 pounds since I have been doing the 500 calories (4days). I am a very active person so after doing things I do get a bit tired but I still ride my bike everyday and play soccer with the boy. I feel they are helping. From what I've read the HCG will burn your existing fat for energy... so how much fat do you have and will it help you survive?I have friends who did the diet and he lost 20+ and she lost about 17 in a 26 day period, and they just started a second round.",
            "post_id": "5264439",
            "timestamp": "1263411372",
            "user_id": "user_1171799",
            "user_link": "/personal_pages/user/1171799",
            "votes": "0"
        },
        {
            "answer": "I've been on the HCG diet for a week now.  I have done pretty good, haven't cheated once and I\"ve lost 6 lbs.  Today I'm feeling a little concerned.  I felt a little crampy last night, and today I have an occasional vaginal discharge that has a little blood tint and a very sweet smell.  I think I'm ovulating right now, but this is a little different.  Anyone had this?",
            "post_id": "5271492",
            "timestamp": "1263580397",
            "user_id": "user_1174495",
            "user_link": "/personal_pages/user/1174495",
            "votes": "0"
        },
        {
            "answer": "okay soo HCG works ...but tell me what happens when you stop taking the shot and stop eating only 500 calories a day?? you go back up obviously...you cant take the shot forever and if your not taking the shot anymore no way you can only eat 500 calories everyday...soo ya i believe it makes you lose weight but how is all that lost weight maintained.....really?? iv only been reading people comments that are saying \"yaa iv been doing it for this many days blah blah...but nun that has said yaa i did that and i have been off of it for soo long and havnt gained any back? sounds pretty impossible right? sounds like a quick TEMPORARY loss to mee :/",
            "post_id": "5271779",
            "timestamp": "1263585965",
            "user_id": "user_1174593",
            "user_link": "/personal_pages/user/1174593",
            "votes": "0"
        },
        {
            "answer": "Yes.  It works.  I lost 40 lbs and after completing the program.  After the injections cease, you MUST maintain your 500 cal per day diet for 3 additional days, in order to allow the HCG to leave your body.  After this you must complete an additional  21 days of maintenance, my set weight was reset.  That was 2.5 years ago.",
            "post_id": "5272886",
            "timestamp": "1263608341",
            "user_id": "user_308335",
            "user_link": "/personal_pages/user/308335",
            "votes": "0"
        },
        {
            "answer": "are my chances of getting pregnant higher if i am taking HCG and no birth control?? I am 3 days late, showing on pregnancy test that i am pregnant, i feel no symptoms of being pregnant!  but not sure how long before HCG gets out of my system. a bit nervous here.  Does HCG make me more fertile?",
            "post_id": "5296725",
            "timestamp": "1264197990",
            "user_id": "user_1179474",
            "user_link": "/personal_pages/user/1179474",
            "votes": "0"
        },
        {
            "answer": "You are an idiot, and you know nothing.  Over 50% of my church (300+ people) including my pastor have done HCG.  My wife and I have done HCG.  It has worked for all of us.  My pastor has dropped from 325 lbs. down to 200 lbs., and is now working toward 185 lbs.  You can't tell me this doesn't work!DON'T LISTEN TO NEGATIVE PEOPLE LIKE THIS WHO DON'T KNOW WHAT THEY ARE TALKING ABOUT!!",
            "post_id": "5308483",
            "timestamp": "1264497638",
            "user_id": "user_789879",
            "user_link": "/personal_pages/user/789879",
            "votes": "0"
        },
        {
            "answer": "Today is day 11 for me ( 9 shots) i have lost 9 pounds. i cheated once and it didn't affect me other than me being overly hungry the next day. the food intake is easy and sometimes seems to much. my doctors have me on 4 small (10 oz) protien shakes a day with 3.5 oz meat and a handfull of vegtables, and a small piece of fruit with each meal. i have had no side effects than 1 headache and i used to get 2-3 a week. you are supposed to drink 1/2 your body weight in ounces per day of water. that is the hardest part, going to the bathroom like every 1/2 hour. i have suggested this to friends and the are being just as successful. if you think you may be pregnant you need to stop taking the hCG for a minimum of 5 days before you can get an accurate answer. thanks for all the information and keep up the great work everyone! :)",
            "post_id": "5318816",
            "timestamp": "1264715877",
            "user_id": "user_1191793",
            "user_link": "/personal_pages/user/1191793",
            "votes": "0"
        },
        {
            "answer": "I have been living an over stressed, under enjoyed, life -eating fast and junk food so long my body is paying the price by prematurely spazing on the hormone end.  I feel I really need to RESET my body weight and purge my body of all the crap I have been putting in it.I have limited funds SO a doctor supervised plan is out of the question.  I need to find the most cost effective way to proceed- if someone could tell me which would be the most cost effective product- powder/cream/drops/injection? which can be purchased online.  It is scarry to purchase on line without knowledge of the purity of the product- SOIf someone who has had long term success -with no side effects - ( preferably a female in her 40's- like me -so the side effects would be more relevant)could give me the name of the supplier they use I may be set to give it a go.Thanks for any help!!",
            "post_id": "5347923",
            "timestamp": "1265445997",
            "user_id": "user_1201887",
            "user_link": "/personal_pages/user/1201887",
            "votes": "0"
        },
        {
            "answer": "Let me tell you what my OB/GYN explained to me about HCG.  It is so simple.Seems to me she is an expert in the field of women, their bodies, and what happens with their bodies when they are pregnant.She said your body creates this HCG hormone while you are pregnant to tell your body to release stored fat to burn for energy.  The fetus utilizes your daily food intake for growth, your body will get any left overs and if that is not enough it will be fed off of stored fat that is released by the HCG harmome. Thus the reason for the low calorie diet.  If you body is burning stored fat for energy you do not need to consume large numbers of calories.Simple as that.  When your body is burning stored fat you are not hungry.There should be no side effects any different than the ones you got when you were pregnant.The bottom line is do your own research.",
            "post_id": "5358744",
            "timestamp": "1265738511",
            "user_id": "user_1205698",
            "user_link": "/personal_pages/user/1205698",
            "votes": "0"
        },
        {
            "answer": "I started the HCG shots on Monday. Tuesday morning I started my cycle and could not take the shots. However I remained on the 500 cal diet and to this day have lost 6.9 pounds. I will resart the shots this coming Monday. However, to follow the 500 cal. was hard at first. I have found that if I cut 1/2 a pickle into small bites and snack on one or two bites when a craving starts then I can get through the need to cheat! Wish everyone the best of luck. Thanks for posting! It is really alot of help reading youor stories!",
            "post_id": "5396553",
            "timestamp": "1266725048",
            "user_id": "user_1219659",
            "user_link": "/personal_pages/user/1219659",
            "votes": "0"
        },
        {
            "answer": "Hi. I started my HCG plan 4 days ago counting today (almost midnight).  I had not really thought about the side effects of HCG so I started looking online and stumbled upon this blog and have read almost every post.  What I can tell you is that I have lost about 1.8 kg in those 4 days (about 4 pounds) and I feel pretty good.  If everything works out, I will probably go with only one round, then do the maintenance period (another 21 days) and probably CHANGE my old eating habits to a healthier life style.I'm 27 years old, male, 5'11'', and I have decided to lose weight and get back to \"my old self.\"  I used to weigh 185 lbs about 3 years ago but before I started the program I was 215-217 lbs, size 38 pants.  I have had absolutely NO side effects myself as of yet, and I plan to stick it out.  I do feel pretty hungry throughout the day but I drink as much water as I can.  I am close to drinking one gallon of water a day and during weekdays I drink two 24 oz cups of decaf coffee to try to suppress the hunger (I've never drank any type of coffee before that, but decaf is working fine).  In fact, my hunger has gone down considerably from the first day I started to today (right now I am king of hungry though, but that's probably because it's midnight and my last meal was at 7:45 PM).My mom purchased the HCG product in powder form and she started taking it before me.  I take 22 mL orally every morning 30 minutes prior to my first meal, and at night after my last meal (as directed).  My mom started cheating a few days into the diet and now she pretty much quit.  She did so because she couldn't handle her hunger/cravings and that's pretty unfortunate.  But for the 30 days or so that she was in the plan (1st round + half) she did lose quite a lot of weight and several size inches.  Her skin did not hang and her face looked very good (unlike other 500 k diets that stretch your skin to your bones).  I don't plan to drop the diet in any case because I think of it as only a 6 week thing and 6 weeks go faster than anything else.  I also take a multivitamin supplement every day to make sure that I'm OK on that end.  Also, I do feel slightly more energized every day and that has been an added plus, but I'm sure it's the HCG (from what other people have posted).The last thing I would mention is that while my mom did her 30 day course, she did not have any side effects.  And the one thing that convinced me to start on the HCG diet was the fact that I saw her with my own eyes lose all the weight that she did.  As I mentioned earlier, it's a pitty that she gave up on it so soon (two days ago, actually), and I am still trying to convince her to at least enter a maintenance period before she dwells back into 'old habits.'  I plan to exercise at least 30 minutes a day in the upcoming days (today I did 35 mins. of bicycle), but first I wanted to see how I felt with just consuming 500 k/day.Many thanks to everyone for all the posts, some have added insight, others confidence, others 'things to watch out for', good recommendations, etc.  I will keep posting soon.--e.",
            "post_id": "5396762",
            "timestamp": "1266732552",
            "user_id": "user_1219744",
            "user_link": "/personal_pages/user/1219744",
            "votes": "0"
        },
        {
            "answer": "I finished my 2 load days and am starting the VLCD tommorow. The load days werent the free for all I thought they woud be. I ate bagels, pizza ect..but felt icky. My normal workout was very hard!I am looking to loose 10-15 pounds.To those who say \"just work out and eat right\" , that isnt always enough!I work out 5-6 times week, spinning, running, weights, trainers, yoga ect. I eay very healthy,vegetarian, no fast food, lots of water, no white carbs ect. I still cant loose those last 10 pounds. Im no couch potato!I am under a doctors care. He procured the shots for me and pre-filled the needles.  (He believes the sublingual method does not absorb enough of the hcg). I was worried about the shots but they dont hurt at all.Ive spent hours researchin this online and notices one thing95% of users LOVE itAlsmot no negative comments were made by people who actually tried it or used it under a doctors care.I have a blog Im using to chart my progress and would appreciate any input.http://hgcprotocal.blogspot.com/Thank all! Good luck!",
            "post_id": "5399170",
            "timestamp": "1266808110",
            "user_id": "user_1220630",
            "user_link": "/personal_pages/user/1220630",
            "votes": "0"
        },
        {
            "answer": "I don't know how many of you may share my particular circumstances, but if it will helpto answer some questions, here goes:   I'm female, 72 yrs old, 5'1\" and need to lose60 lbs. (best weight, 109).  I've been \"kicked out\" of every weight loss program becauseI whined and complained, hating every minute, and realized I really didn't want to takethe responsibility of managing my own weight control.First became aware of HCG in Europe 30 yrs ago.  I began my own program witha positive attitude and a sense of joy - knowing I was in control. Sure, I've had theheadaches, crabbiness, deprived, feeling sorry for myself, believing that I wouldNEVER be able to eat like a regular person...etc.  I almost mugged a child for hisice cream cone and have gazed longingly at my dogs' dishes, have had erotic dreamsabout food....the whole sad picture.  But I kept my eyes on the prize and on a pairof 501 jeans I hung by the fridge.  When I can get into those w/o crying, I'm home free!First of all, my darlings, you have to infuse this experience with PMA - Postive MentalAttitude.   Know that this is only a small slice of time from your life and the rewardsare many.  Make a game of it; appreciate the challenge in finding how many waysyou can serve the measly 500 cal.  Refer to UTube.....there are some funny blogsand great recipies.  I've shared some earlier on this site.Each day is your own AA meeting, so take it One Day at a Time.  Yell outloud whenyou see each pound disappear each morning.  You're not losing weight - you're givingit back to the Universe (let some other soul use it).  If you get headachy - drink a bigglass of spiced tea.  Take potassium for leg cramps - psyllium seeds for constipation.Eat slowly....chew to a pulp....visualize the nourishment as it enters your body.  Eatnaked in front of a mirror ( it worked for me and pleased the neighbors) - that'll makeyou think twice about breakin Protocol!Most of you will be going through sugar and carb withdrawals just like a drug addict.I promise, when you are on Phase 3 and 4, you won't want these things again, in fact,expect to feel sick.  Keep a record of the money you're saving on Haagen Daz aloneand when you make an extra 50.00 on the grocery budget, treat yourself to a massage.I don't have a family or support system, so it's been a one-woman show, but I getall the credit, right?  I'm just finishing up my 40 day series, down 35lbs and gettingready for a 5-day trip to Haiti.  We sleep in a big tent, eat Army rations (lots of crapin those) and patch up people who would do anything for the food you and I throwaway.  Getting outside of your own skin and helping another human being is thevery best way to forget your aches and pains.  And anytime you want to reclaim thepounds you gave back to the Universe....well, there's always McDonalds.I'm a professional makeup artist, working in Neiman's and Saks, so I can appreciatehow important our \"surface selves\" contribute to what we think is happiness.  YouHCG \"virgins\" have made a major committment to more than being attractive; you'vepromised yourselves a healthier, longer life -- fill it with JOY!!Blessing and Good Luck to all.....A Texas Glam Ma....",
            "post_id": "5401997",
            "timestamp": "1266877009",
            "user_id": "user_1211971",
            "user_link": "/personal_pages/user/1211971",
            "votes": "0"
        },
        {
            "answer": "I think I may be having an allergic reaction, too.  The roof of my mouth is swollen (entire palate.)  When it first started, three days ago, it burned when I ate and then would go away.  Now, there is no pain, but it is swollen to the point of turning it white.My throat is a little sore, but that happens a lot with me.I am only using the Drops and am on Day 17 and it just started a few days ago, but have followed Simeons protocol, but have lost 22 pounds.",
            "post_id": "5433809",
            "timestamp": "1267653571",
            "user_id": "user_1232684",
            "user_link": "/personal_pages/user/1232684",
            "votes": "0"
        },
        {
            "answer": "Just FYI for everyone:In looking into doing this myself, I bothered to actually look up the medical research on the subject (which is very easy to do...) and numerous clinical, double-blind trials prove that hCG has no more of an improved weight loss result than placebo. In other words, it's not the hCG, it's the diet. Further, there was no comparable difference in fat loss between hCG and placebo, and no comparable difference in feeling hungry between hCG and placebo. Listen, I value the idea of finding a great method that works, and understand and even agree with the idea that there may be some conspiracy or something preventing real weight loss drugs or methods being approved by the government, but it only takes a little bit to do the research yourself. Stop wasting money on the hCG and just go on the caloric restriction diet (taking vitamin supplements along with, of course). And of course, I'll finish with some links to the actual testing data:http://www.ajcn.org/cgi/reprint/29/9/940.pdfhttp://www.ncbi.nlm.nih.gov/pubmed/2405506?dopt=Abstracthttp://www.ajcn.org/cgi/reprint/26/2/211.pdfhttp://www.ajcn.org/cgi/reprint/14/3/133.pdfhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC1237915/pdf/westjmed00268-0035.pdfhttp://archinte.ama-assn.org/cgi/content/abstract/137/2/151",
            "post_id": "5434034",
            "timestamp": "1267657820",
            "user_id": "user_1232758",
            "user_link": "/personal_pages/user/1232758",
            "votes": "0"
        },
        {
            "answer": "While I do appreciate the post about the scientific research, I did educated myself and my 100+ friends, family and acquaintances did too. We are not a bunch of uninformed beanheads who ignored the studies. I myself found numerous problems with many of those clinical trials, as would anyone in the medical community with experience in clinical trials.Unfortunately, I have been on many diets that did not \"work\", that is...if I could have stuck with them, I may have had some weight loss, but I was either faint, irritable or had too many cravings to fight it. I have been on Releana for 10 days with a very low calorie diet. I have not been hungry, had any cravings, my mood is excellent, and as of this morning, I have lost 10.1 pounds.In those clinical trials, I cannot vouch for the type of hCG they used, where they procured it, the efficacy of their particular hCG, etc. I can only use my experience to describe my results.Yup, a VLCD will produce great results, if you can live through it, but that in itself is not an answer the the lifestyle change that goes along with taking hCG in the Simeons Pounds and Inches protocol, and most of the research has little to nothing to do with sublingual Releana. The VLCD is only one part of the success of Releana. It requires a lifestyle change, and give the blueprint to do it, while suppressing appetite and lifting mood. Everyone is different and must make their own choice. Personally, I don't see how anyone could have a viable opinion about Releana unless they tried it themselves. Of course, we can have opinions about things we don't try...it just makes them less credible. I didn't think it would work either. I was wrong. It does. I do not care if anyone thinks otherwise; now that I am doing it, I can tell you, it works for me. When I read posts from naysayers on this discussion board and others, I remember, I used to be one too. And I wouldn't take the opinion of anyone but myself now. I don't want to try to convince anyone of anything. I am only talking about my experience, and not theoretical or hypothetical or anything else data. I am constantly amazed at the negativity of people who haven't tried it and at the same time am amazed at the success of the 100+ people I know who it has worked for. Again...I am talking about Releana only, not homeopathic, not injectable, not the stuff from China or India available online. Appreciate the comments, but I know what I know, and do not see why anyone cares what I or anyone else is doing. I mean, it's my money, and my time, right? If I am a fool, then it isn't affecting anyone else, and at least I am speaking from personal experience. Why on earth would anyone else care what I wear, what I drive, what I watch on TV, or my method of dieting? I certainly am not affected by your choice of diet, and you aren't affected by mine. I am not wishing to sound angry here, and email is not effective at expressing mood, but just from a common sense viewpoint...if what I or anyone else does isn't affecting you, then why bother to post your negative and uninformed by personal experience view? It's pretty arrogant. But I do appreciate your passion, and if you do find an alternative that works this well, I hope you try it and report back, cos Releana is darned expensive! Thanks!",
            "post_id": "5442603",
            "timestamp": "1267894717",
            "user_id": "user_1227051",
            "user_link": "/personal_pages/user/1227051",
            "votes": "0"
        },
        {
            "answer": "Sorry for the typos above, jeesh, I sound like George Bush! I did educated myself, hehehe! I am in a hurry, gotta get out to the garden before rain and wind sets in!",
            "post_id": "5442609",
            "timestamp": "1267894827",
            "user_id": "user_1227051",
            "user_link": "/personal_pages/user/1227051",
            "votes": "0"
        },
        {
            "answer": "Also, let us remember that this thread is discussing side effects. There are other boards to talk about the efficacy. Thanks!",
            "post_id": "5442611",
            "timestamp": "1267894871",
            "user_id": "user_1227051",
            "user_link": "/personal_pages/user/1227051",
            "votes": "0"
        },
        {
            "answer": "My husband and I both did the shots for twenty one days. Yes we lost about a pound a day....BUT on the shots we both felt nauseous and continue to feel nauseous even though it has been months since we have stopped taking hcg. I have never in my life felt this nauseous, i have always had a strong stomach...when i was pregnant with all 5 of my kids..i hardly EVER felt nauseous!!!!! THIS IS A SIDE EFFECT FROM THE HCG..and my husband has the same problem. I have noticed the nauseous feeling happens when my stomach is empty.I DO NOT RECOMMEND THIS TO ANYONE...i did lose \"weight\" but it was muscle...i know this is a FACT...I look at my husbands body and it really just looks like he bulked down because he lost muscle and he feels like it too. One other thing that i have noticed is the lumpy cottage cheese bumps everywhere on my body...and i have never had a problem with this before...",
            "post_id": "5447815",
            "timestamp": "1268062231",
            "user_id": "user_1238003",
            "user_link": "/personal_pages/user/1238003",
            "votes": "0"
        },
        {
            "answer": "I cannot stress strongly enough that you should be doing hCG under a doctors protocol. Also, there must be hundreds of hCG providers. You can order from the internet and its coming from Bombay or China; you can get Releana, which is patented and FDA approved for sublinguals, you can use homeopathic hCG. They are all different, they all have their risks and side effects, and you need to post what exactly you are doing before you condemn ALL hCG. That is like saying if you get nauseous on aspirin, that everyone should avoid all painkillers. I am on day 14 on Releana, under a doctors care, I have lost 12 lbs with NO hunger and NO negative side effects. There is nothing wrong whatsoever with stating your opinion, regarding your own experience, but to give a blanket yea or nay to 6 billion people on the earth strictly due to your experience is arrogant and inappropriate. The subject here is side effects and I do thank you for mentioning you had nausea. That is the first indication to me that you were taking either the wrong dose, injecting incorrectly and certainly not under a doctors care, or it would have been corrected. I am going to suppose you were taking a wrong dose or had a bad batch of hCG. By the way, I do not sell or profit in any way from hCG. It is just common sense that if millions of people are using it successfully that your experience is unique and you apparently did little to solve it. You should not have lost muscle at all. That is what would happen if you were NOT taking hCG. This leads me to believe that your hCG was fake, as are many on the internet.",
            "post_id": "5455501",
            "timestamp": "1268245155",
            "user_id": "user_1227051",
            "user_link": "/personal_pages/user/1227051",
            "votes": "0"
        },
        {
            "answer": "I started taking HCG, after the 9th day I had not lost weight but became very swollen, my pelvic area became very tender and I had a heavy period like flow. I stopped taking the HCG immediatly, three days later the symptoms have started to get slightly better.I have to agree about the hunger, I haven't been hungry at all and I have had a tough time eating the recommended amount of calories.  But bottom line is I didn't lose any weight.   I am hoping that after the edema goes down  I may see some difference.I am happy this worked for a lot of you, but bottom line is it scared mePart of my issue is when I called my physician to tell her what was happening she told me to continue taking it, that can't be right.  .",
            "post_id": "5493559",
            "timestamp": "1269264960",
            "user_id": "user_1254185",
            "user_link": "/personal_pages/user/1254185",
            "votes": "0"
        },
        {
            "answer": "I Have been doing alot of reading, But i can not find any info on what  age is ok do to my 10 ys old in over 100pounds, can  she do  1 round? is it ok for her?",
            "post_id": "5502445",
            "timestamp": "1269466152",
            "user_id": "user_1257246",
            "user_link": "/personal_pages/user/1257246",
            "votes": "0"
        },
        {
            "answer": "Absolutely not! This protocol is not for children. As I have always mentioned, ensure you speak to a physician and be under a physician's care when doing this protocol.",
            "post_id": "5504797",
            "timestamp": "1269529289",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I just started the drops..Easter day...will keep you posted on how it effects me or not..thx for all the info.Its helped tremendously..",
            "post_id": "5535977",
            "timestamp": "1270402191",
            "user_id": "user_1268683",
            "user_link": "/personal_pages/user/1268683",
            "votes": "0"
        },
        {
            "answer": "I started taking the HCG shots two days ago.  Just completed the third day (1st day on the 500 calorie diet).  Since this morning, I woke up with a slight headache.  As the day has progressed its grown worst and now almost 10 pm, still have the headache and pain in the back of my neck.  I read somewhere that its possible to get blood clots from the injections.  The first two days I injected myself on the stomach and today on my belly.  Is it possible I could have given myself a blood clot and this is the cause of the headache?  I drank 2 aleves today, and each time it relieved the pain a bit, but not completely.",
            "post_id": "5548102",
            "timestamp": "1270691850",
            "user_id": "user_1272706",
            "user_link": "/personal_pages/user/1272706",
            "votes": "0"
        },
        {
            "answer": "I have a friend who has been using the hcg shots, but I have a couple of questions, I can't seem to find the answers to.  I am a diabetic and would like to know if anyone using this diet is diabetic or knows of anyone who has done the done that was a diabetic.  Also, I had a partial hystrecetomy and have my ovaries, is there any reason why I can't do the shots?",
            "post_id": "5548426",
            "timestamp": "1270697658",
            "user_id": "user_1272808",
            "user_link": "/personal_pages/user/1272808",
            "votes": "0"
        },
        {
            "answer": "I took the 30 day diet drops and had great results. I started 2 days before Ash Wednesday. Yes the first part of the week I had headaches, a side affect for some, but once I took an Advil the headache went away. After about 4-5 days I did not have any more headaches. I stuck with the diet and drank my liquids and lost 26 pounds in the 30 days. I also stuck to the maintenance plan and lost another pound. You have to follow the diet in order to be successful. My metabolism is set at a number on the scale and if I gain 2 pounds I follow the directions to get it back down. This is something that does take determination -knowing that in 30 days you will be 25-30 pounds lighter. I do not feel like eating as much. I did not exercise while on the diet, but know that I need to do some walking or exercises to firm up- this does not magically happen by itself.  Drops to me are better than getting shots everyday....",
            "post_id": "5561750",
            "timestamp": "1271043673",
            "user_id": "user_1277080",
            "user_link": "/personal_pages/user/1277080",
            "votes": "0"
        },
        {
            "answer": "I know quite a few diabetics both Type I and Type II that have used the protocol successfully. Many have been able to reduce the need for hypogylcemics inthe long run after the protocol ended for them. A hysterectomy does not precude the use of the protocol. However, these are questions for teh doctor that would be following you on the protocol.To Josy77, the small sq shots of the hCG would not cause a deep vein clot. Howver, this does not mean there is not one becuase of other reasons not related to the hCG shots. See your doctor asap to discuss your concerns.ALL: Common reasons for headaches on the protocol include dehydration, hCG purchsed on line that is questionable, a stavation state that exists because of improper dosing of hCG or antibodies in your system to the hCG. Those are a few of the many reasons for headahces that can persist on the protocol. If you get a headache that just does not go away or is very different from ones you have had in the past or if you just plain have a concern and need advice or reassurance, go see your docotor!",
            "post_id": "5563405",
            "timestamp": "1271089813",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I have read in a couple places on the net that if your HGC has alcohol it is no good...that real HCG does not have alcohol and that alcohol kills the HCG.What do you know about this...tyvm",
            "post_id": "5563611",
            "timestamp": "1271093612",
            "user_id": "user_1268683",
            "user_link": "/personal_pages/user/1268683",
            "votes": "0"
        },
        {
            "answer": "hCG comes in a powder form and requires a dilutent of sterile water and benzoyl alcohol. This does not make the hCG ineffective. It is a standard dilutent. The issue with the alcohol only applies when hCG is used in newborns for certain medical conditions. Prpoerly sourced hCG from a legitimate pharmacy or physician is important. I do not suggest buying hCG from the internet or from anyone who says you do not need a prescription.",
            "post_id": "5566890",
            "timestamp": "1271170249",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I started my hcg and did it for 4 days..had to stop..Im getting ready to start again and want to know if I have to do the LOAD DAYS over again.Ive stuck to the 500 cals since I started the first time...",
            "post_id": "5580718",
            "timestamp": "1271468514",
            "user_id": "user_1268683",
            "user_link": "/personal_pages/user/1268683",
            "votes": "0"
        },
        {
            "answer": "I have been on the HCG \"diet\" for 10 days and have lost 10 pounds. My goal is 30 pounds total...well for now. My side effects are I believe is a UTI....that started on the 7th day. I'm not sure if it is from HCG or not. I have no headaches, I am not grumpy..except when I pee (dr appt on monday). I have small bowel movements..if at all..when you don't put anything in ...not much is going to come out...right?  I love the weight loss!! I do not exercise, however I am very active (a lot of walking, badmitton (sp?) with the kids, HCG seems to give me more energy. I will fess up...I don't take the max dose. I follow the 500 calorie plan (for the most part. No sugars, no white anything) I eat a lot of greens (spinich, collard and turnip). I use the HCG 1-2 times a day...I'm better using it on the weekends (when I work). My stats are:Womanage 48weight at the begiining 187weight now 177Goal 157I will keep an eye oin the post..Good luck to all..God Bless!",
            "post_id": "5582869",
            "timestamp": "1271534162",
            "user_id": "user_1283524",
            "user_link": "/personal_pages/user/1283524",
            "votes": "0"
        },
        {
            "answer": "Congrats on the weight loss! The hCG does not \"give you\" a UTI. It is not a side effect of hCG. The UTI may be a side effect of being dehydrated or other issue that caused bacteria build up in your urine. Ensure you drink a lot of water during the protocol. Ensure you see your doctor for the UTI or go to an urgent care center sooner if you develop fever, abdominal pain or vomiting. Keep up the good work!",
            "post_id": "5585919",
            "timestamp": "1271626546",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I started taking the drops two days ago and for some reason I am having dirreah.  I am constantly thirsty and drinking lots of fluids, so I don't know if it's that or not.  I haven't read anywhere that it gives people diarreah. Has anyone? I feel kind of funny but I think that it is because of the hormone change.",
            "post_id": "5607878",
            "timestamp": "1272114669",
            "user_id": "user_1291062",
            "user_link": "/personal_pages/user/1291062",
            "votes": "0"
        },
        {
            "answer": "i dont know if anyone answered you. I have an 11 year old and we are doing the homeopathic drops together. He wants to lose about 20 pounds or a little more. is your daughter doing it? We are having great success...I do not agree at all that you need to be under a physicians care, that is ridiculous...if physicians knew so much about nutrition and curing people, well, we would be living in a different world. trust your intuition...and hers, your bodies will let you know! much blessings",
            "post_id": "5609244",
            "timestamp": "1272146016",
            "user_id": "user_1291450",
            "user_link": "/personal_pages/user/1291450",
            "votes": "0"
        },
        {
            "answer": "i dont know if anyone answered you. I have an 11 year old and we are doing the homeopathic drops together. He wants to lose about 20 pounds or a little more. is your daughter doing it? We are having great success...I do not agree at all that you need to be under a physicians care, that is ridiculous...if physicians knew so much about nutrition and curing people, well, we would be living in a different world. trust your intuition...and hers, your bodies will let you know! much blessings",
            "post_id": "5609248",
            "timestamp": "1272146084",
            "user_id": "user_1291450",
            "user_link": "/personal_pages/user/1291450",
            "votes": "0"
        },
        {
            "answer": "Are you certain that a powerful hormone such as hCG will not affect your child in a negative way? Do you know the pathophysiology behind the reason for the obesity in your child let alone someone else's child to give advice for using a hormone as a weight loss adjunct? Do you know how hCG affects the pediatric population differently than teh adult population? Do you really feel that \"intuition\" is the best way to ensure that there is no endocrine patholgy causing a child's obesity? I find it interesting that you do not agree that a physician should be involved in prescribing a hormone to a child for a medical condition. \"Intuition\" will not catch a hormone issue, diabetes, kidney disease, or worse, as what happened with my 12 year old nephew, a large tumor in his abdomen. A physician will catch that, not intuition. hGC is NOT a first line treatment for pediatric weight loss. See your doctor first!",
            "post_id": "5611019",
            "timestamp": "1272206421",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I OWN A WEIGHT LOSS CLINIC WITH MY  MEDICAL DIRECTOR AND I HAVE ALSO TAKEN THE INJECTIONS AND I HAD NO SIDE AFFECTS.  22 LBS IN 38 DAYS.  I HAVE ALWAYS EATEN HEALTHY AND EXERCISED SO IT WAS EASY FOR ME.   I CAN TELL YOU IN THE YEAR OF STUDIES ON PATIENTS FROM THOSE WANTING TO LOSE 5-100 LBS THE RESULTS WERE GREAT BUT THERE WERE THE 5% THAT WOULD EAT FURIOUSLY AND TRY TO LIE ABOUT IT AND YES THEY WOULD GAIN MORE WEIGHT THAN THEY STARTED WITH.  TO fightu35, IT JUST APPEARS THAT YOU ARE IN THAT 5% THAT IT DIDN'T WORK FOR.  I DON'T KNOW EVERYTHING BUT I DO STUDY ALOT WITH MY MEDICAL DIRECTOR AND IT APPEARS THAT YOU ALONE HAVE DONE MORE HARM TO YOUR BODY THAN ANY MEDS.  TO LOSE  12 LBS IN 5 HRS IS CRAZY.  WHY WOULD YOU WANT TO DO THAT?  NOT TO MENTION ALL THE SIDE AFFECTS FROM THE EPHEDRA AND YOU ARE STILL TAKING IT? IT IS A WONDER YOU STILL HAVE FUNCTIONAL KIDNEYS AND HAVE NOT HAD A MASSIVE CVA.  BUT TO EACH ITS OWN, JUST KNOW THAT PERHAPS IT'S YOU NOT THE HCG THAT CAUSED YOUR PROBLEMS.  NOT TO BE MEAN BUT MAYBE YOU SHOULD LEAVE THE WEIGHT LOSS ITEMS ALONE AND SEEK INNER PEACE WITH WHO AND WHAT YOUR ARE.  THERE IS NO PRESCRIPTION FOR THAT AND CERTAINLY NO COST.",
            "post_id": "5620450",
            "timestamp": "1272410741",
            "user_id": "user_1294903",
            "user_link": "/personal_pages/user/1294903",
            "votes": "0"
        },
        {
            "answer": "I have doen two rounds of the homeopathic HCG, the drops. This diet has been successfull for me. I just started my third 40 day round. My friends and I started a support/networking group in our town so we can talk about our experiences. This diet will be slightly different for everyone. My friends and I are approaching the diet as a lifestyle change. We are taking vitamins, adrenal support, mastergland support and collotrim. These all support the diet in a positive manner. It is important to get all the vitamins and nutrients while on the diet in order to keep up energy. My only suggestion about being tempted to cheat is to keep busy. Find something to take your mind off food. This has been a challenge for me but has also given me the opportunity to get my house organized. Focusing on the main goal is very important. I lost 35 pounds my first 40 day round and 15 my second 40- day round. THe second round, I was not as focused and felt like a failure, but I soon realized that I am only human and waited four weeks in order to get my commitment back to the diet. It works and if you are experiencing headaches, it is only normal and it is becuase your body is detoxifying from all the bad stuff you put in your body. Psyllium hulls are a huge asset to pull out toxins from your body. I take some every morning. I only had a headache one day and have not experienced it with the second or third rounds. I wish you luck and remember to follow the protocol. This diet works, but you must follow the guidelines and not deviate. Lastly, drink water and when you think you drank enough water, drink two more glasses. Best of luck.",
            "post_id": "5639885",
            "timestamp": "1272902095",
            "user_id": "user_1301478",
            "user_link": "/personal_pages/user/1301478",
            "votes": "0"
        },
        {
            "answer": "I am about to start the 40 day supply of the 125-150 iu hcg injections.  I need to lose 30 to 40 pounds.  Think this is a good idea for at least a quick start to a healthier lifestyle?  I am a picky eater and dont have much motivation from my boyfriend.  Any advice?",
            "post_id": "5643976",
            "timestamp": "1272988213",
            "user_id": "user_1302840",
            "user_link": "/personal_pages/user/1302840",
            "votes": "0"
        },
        {
            "answer": "The hCG protocol is good to use only if you have already been evaluated for or in the process of beeing looked at by a primary care provider for underlying medical issues such as pre-diabetes, hypothyroidism, vitamin D deficiency, PCOS, metabolic syndrome, multiple other hormone imbalance issues, or other subacute medical issues that may contribute to you being overweight. All that should be evaluated. The hCG protocol is safe but is not for everyone. It is simple but strict. Most traditionally trained doctors will disregard the protocol because they do not know the protocol and only see it as a \"500 calorie diet.\" It goes way beyond being a very low calorie diet. Find a physician who is either willing to learn about the protocol or already knows it. Do the things you already know are smart: wathc your portions, exercise (even if it is a little), eat whole foods, and ensure you get a full metabolic and nutritional evaluation!",
            "post_id": "5647376",
            "timestamp": "1273060308",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I've read some of these posts and frankly, I can see how can you can't believe anything.  People can and will make things up on these sites.  The fact is that my wife and I tried the HCG diet through a doctor who understands the how it works.  He required us to read Dr.Simeons paper which was helpful in understanding how it works and what to look for during the period your taking HCG.  We take the liquid not the shots.  My wife has lost 38 lbs in two 26 day sessions.  I've lost 45 Lbs in two session.  If you read what HCG does it boils down to two things. 1. you don't feel hungry on 500 calories and 2. It enables the body to eat the right kind of fat.  That's the third kind of fat, the \"locked fat\" which it burns first.  Dr. Simeon explains that there is three kinds of fat.  The fat around your vital organs, joints, etc. The stored fat which your body uses or burns for energy and third the locked fat.  This locked fat is normally the last to be burned and it's this fat that makes you obese.  This is the main reason why on other diets you can quickly gain the weight back. We noticed that we didn't gain any of the weight back between treatments or after.  Sure, you can gain the weight back if you go back to your old ways of eating, but what the diet does is helps you change your eating habits as well.  Go on a 500 calorie diet and see if you can last more than 7 days.  It's pretty difficult.  With HCG, we never felt hungry and even had trouble eating the 500 calories during the diet.So, is this true or fiction?  Maybe you'll never know unless you try it yourself.  But, I would say that everyone is different and has different health issues.  I would highly recommend you do this through a knowledgable doctor who can monitor your progress and your vitals. The other reason is that you need to be careful where you get the HCG.  It has to be kept dry and cold.  The Doctor we use get's it in powder form and we mix it and put it in the frig during use.  By the way, I use to take blood pressure medicine and now I don't. My blood sugar was just about 124 and now it's below 100 and going down.  That makes me feel pretty good.The bottom line here is we've had a great experience with HCG so there it is, believe it or not.",
            "post_id": "5656679",
            "timestamp": "1273263669",
            "user_id": "user_1306678",
            "user_link": "/personal_pages/user/1306678",
            "votes": "0"
        },
        {
            "answer": "Congratulations miker45! Very cool. Keep smart with your after-protocol habits! The oral form is not as effective as the injection but it still is to many and obviously is to you and your wife. That is awesome! You are an inspiration to those who are struggling.",
            "post_id": "5658682",
            "timestamp": "1273326838",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "Hi, I heard about hcg from my friend who let the cat out of the bag, because she lost a lot of wt in like three months about 34lbs. She told me all the logistics and I read the ebook. I am 32 and wt 140. I had a surgery in june 08(was 124lbs), I had abdominoplasty(to fix a hernia and spacing of 1+\"), breast lift(since I was already there), and a small amount of lipo (Dr insisted). Right after the surgery I had an panic attack because my body was going into shock. The docs said my heart was fine even though I felt tightness and SOB. Sometimes if I do too much my heart feels strained. I gained twenty pounds because I coundn't exercise for two years. I have started an routine (BFL) every day now for 15-20 mins for a month now, and have tol well (lost 9lbs). Although for mothers day my hub helped me have three orgasms (bless his soul!) and I have been having some feelings of a strained heart again, today I felt tingling in my left arm and heat in my chest, which lasted 20mins, and went away after I drank H2O. The surgeon says my symptoms are unrelated to surgery, even though I have never had this prob before. Anyway I have no Insur so I can't even check. I wanted to start the hcg, within the next three weeks, given my history should I not? I heard it could strenghten my heart and help with healing, I have had five children and remember how good I felt dur preg.",
            "post_id": "5670452",
            "timestamp": "1273619777",
            "user_id": "user_1310787",
            "user_link": "/personal_pages/user/1310787",
            "votes": "0"
        },
        {
            "answer": "I was on it for 4 weeks. after 2weeks I could not sleep also, I lost no weight at 500 cal a day",
            "post_id": "5691199",
            "timestamp": "1274123212",
            "user_id": "user_1316772",
            "user_link": "/personal_pages/user/1316772",
            "votes": "0"
        },
        {
            "answer": "I just purchased HCG from buyhcg.com and after the first dose my entire body is covered with a rash, from my neck to my ankles!I do NOT recommend this product!",
            "post_id": "5731316",
            "timestamp": "1275055920",
            "user_id": "user_1328448",
            "user_link": "/personal_pages/user/1328448",
            "votes": "0"
        },
        {
            "answer": "Unfortunate you experienced that.  My friend also experienced a rash after 2 weeks of the same drops I took with no side effects ( not the drops you took). She lost 13 pounds and I lost 17. I am going for round 2.  I think there will always be those that will have allergic reactions. That's true with any food.  I am nervous, trying a new brand because I could not get the other.  Any one try the DNA labs HCG?Thanks,",
            "post_id": "5732897",
            "timestamp": "1275087300",
            "user_id": "user_1325557",
            "user_link": "/personal_pages/user/1325557",
            "votes": "0"
        },
        {
            "answer": "I agree with you not to recommend purchasing a medication on line and using it without a physician's direction. I think that is what you meant. You never know what you get when you purchase a prescription medication online. You have no idea what fillers are used or the lack of quality of the medication. It is not clear if you had an allergic reaction to hCG or a filler/impurity compound in your online purchase.I am not a fan of the oral hCG drops. They just are not as effective as the injection form.  It is well known that the bioavailability (blood levels AND medication affect on cells) of the oral drops are not as consistent as the injection. There is a dissolvable tablet that is being developed that shows promise as an alternative to the injection. It has been shown to have a similar bioavailable profile as the hCG injection. Whatever the case, NEVER get a medicaiton online without a physician's direction and ALWAYS be under a physician's care when doing the hCG protocol.",
            "post_id": "5737450",
            "timestamp": "1275232716",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I am a 39 yr old male and have been taking the oral drops for 5 days now and have broken out all over with acne, my joints feel so sore in my legs and feet that it hurts to walk, I am extremely tired, hungry all the time even though i am trying to stick to the 500 cal. and I have had headaches for the 5 days. I need to loose about 50 lbs and wanted something for the appetite control. Any suggestions",
            "post_id": "5745134",
            "timestamp": "1275430853",
            "user_id": "user_1332944",
            "user_link": "/personal_pages/user/1332944",
            "votes": "0"
        },
        {
            "answer": "The oral hcg drops are not working for you. You should not be having those symptoms. an appetite suppressant is not a good thing to do if the hCG is not being effective. See your doctor who is helping you with the protocol.",
            "post_id": "5747570",
            "timestamp": "1275493682",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I've been on HCG injections for 6 weeks and am down 32 lbs :-))  This is the ONLY weightloss program I have ever been on that has worked for me! Its strange though, my doctor who is prescribing me, would like too see me keep going with the shots. His thoughts: whats the worst that can happen?? That it stops working?? He says he has other clients who have continued to lose weight after the 26-40 days. So, I'm going to keep going. Has anyone else powered through and kept this up? I'd like to hear your thoughts.",
            "post_id": "5776179",
            "timestamp": "1276139069",
            "user_id": "user_1342102",
            "user_link": "/personal_pages/user/1342102",
            "votes": "0"
        },
        {
            "answer": "Hi, I am new here.  Hdman, I think you got a bad batch.  I have been on hcg now for just under 3 weeks and have lost 14 lbs without too much trouble.  I do have a rash, and it does make me wonder if mine is all that pure.  I am getting mine in Mexico, where I live most of the time.  The other thing I would say, is re-read Dr. Simeons' book.  It is free on line.  Many people have changed this protocol, added what seems like no-brainer foods, made recipes mixing the types of vegetables...make sure you are doing it 100% the right way.  I made a mistake that cost me.  I added amino acids (Braggs) as a seasoning, and the next day and a half I was starving and craving!  I have to think that the amino acid was good for my digestion, but not for this diet!  Myla",
            "post_id": "5779303",
            "timestamp": "1276207831",
            "user_id": "user_1343005",
            "user_link": "/personal_pages/user/1343005",
            "votes": "0"
        },
        {
            "answer": "What does \"bad batch\" mean? It could mean anything from simple worthless and ineffective  saline solution to hCG of unknown concentration, to a solution with, as you mentioned, \"impurities.\" This is not good. I jsut saw an ad in a helath magazine selling 'homeopathic hcg.\" That would be truly worthless to use in the protocol yet they are selling it as a weight loss hcg protocol! Not good. You will get 'stories' of people who did 'great' on the homeopathic hCG but it is truly worthless on the majority of patients. hCG is a medication that must be prescribed and obtained from a legitimate pharmacy and used as directed in the hCG protocol. You must be followed and evaluated by a physician. It scares me to hear that people are buying hCG via internet or through pharmacies that are not legitimate.",
            "post_id": "5782619",
            "timestamp": "1276283824",
            "user_id": "user_237405",
            "user_link": "/personal_pages/user/237405",
            "votes": "0"
        },
        {
            "answer": "I am wondering how much this should cost? I have looked into this at a weight-loss clinic they wanted $1450.00. Then I go on line and I see it for $100.00 I know you shouldn't go by money alone but I don't want to get ripped off either.Please advise somebody???",
            "post_id": "5783839",
            "timestamp": "1276305748",
            "user_id": "user_1344255",
            "user_link": "/personal_pages/user/1344255",
            "votes": "0"
        },
        {
            "answer": "I have the MTHFR genetic disorder which causes blood clots with birth control pills, shots and pregnancy.  Will the HGC protocol copy the mimic those conditions and cause clotting?",
            "post_id": "5810968",
            "timestamp": "1276900204",
            "user_id": "user_1351990",
            "user_link": "/personal_pages/user/1351990",
            "votes": "0"
        },
        {
            "answer": "I have heart disease and have had several heart surgeries.  I am on Plavix and several blood pressure medications.  I need to lose about 40 pounds.  I do walk everyday and do light exercise.  Would it be a problem for me to take the HCG?  I have several friends and family members who have (and are taking) the oral HCG.  They have had no problems at all and have had wonderful results.  I know I need to be under a doctors care for this, but I do not live close to a doctor that would help me with this diet.  I don't think my cardiologist would like this at all.   Any comments would be appreciated.  Judy-RN",
            "post_id": "5825211",
            "timestamp": "1277234413",
            "user_id": "user_1356067",
            "user_link": "/personal_pages/user/1356067",
            "votes": "0"
        },
        {
            "answer": "I agree with Craig up further on the line. Read his comments they are very good. I initially found this thru Trudeau's book but I don't agree with all his steps. I went with the original diet like Craig did . I am on my fourth course but I am under doctor care.  He compounds it for at the pharmacy and it is a cream not a shot.  I pay $120 for a course of 40 days.  I have lost 87 lbs since last August. Read the material Pounds & Inches several times like Craig said.  Those with health issues should definitely use doctor treatment.  I know the BiKi clinics are probably expensive because that's what they want to make money on and they monitor you. It is very important to be off between the courses what they doctor states.  It regulates you weight.  I continue to lose inches in between but not pounds.Judy where do you live?  If anyone wants to talk to me personally for more information you can email me at ***@****",
            "post_id": "5849021",
            "timestamp": "1277768504",
            "user_id": "user_1363107",
            "user_link": "/personal_pages/user/1363107",
            "votes": "0"
        },
        {
            "answer": "Great string of posts and very helpful.  I searched side effects of HCG this evening and found this.  Read everything and started drinking water while reading!!!!!  Guilty of not liking water and not intaking recommended amount by the clinic.  Drank almost 48oz sitting here -- making up for what I didn't drink today:)Started multiphase weight loss program through UniqueU weight loss clinic Cincinnati on 5/17.  HCG Rx daily injections of 10ml began 6/20, but had to stop 6/24 due to period.  Began again 6/30 and July 4th weekend had many symptoms but not sure they are related to HCG.  Receptionist at clinic said my symptoms were likely due to dehydration from the heat.  Had significant swelling in my feet.  Thought maybe it was from swimming and kicking the dang lane divider a few times?  I also developed extreme tiredness.  I live on 3rd floor and had to stop on 2nd floor landing a couple of days to rest before taking the last flight.  I spent July 1-5 every day at the pool though.  I had itching and minor rash all over my body but attributed it to the new suntan lotion and having sensitive skin -- not the first time something new made me itch.  Have had very bad sore throat since Thurs, but thought I finally managed to catch the germ my boyfriend has been fighting for weeks.  Leg cramps but again thought it was adding the swimming laps to my routine (I take Chelated potassium every morning on this program).  Headaches of course, but who wouldn't have a headache cutting the calories and exercising for 1-4 hrs a day?I stopped all supplements, Adipex, and HCG on July 6th to get it out of my system and see if the hormone was causing the extreme tiredness and edema in my feet (only the HCG was a recent addition).  Anything that makes my body feel extremely bad can't be good for me is what I've always lived by. Felt better and swelling disappeared in couple of days.  I restarted all supplements and HCG July 11th (yesterday).  I know HCG works and will finish the program using some of the tips here to hopefully avoid any side effects.Can't say the HCG has been in my system long enough to give me results.  I've lost 20 lbs in 8 wks; 2.5 lbs a week.  I exercise a lot at the gym sometimes 3 hrs on the elliptical + walking + weight lifting.  Looking at your stories here, I'll relook at the diet plan because I'm pretty sure mine is only limiting calories and to 600/day vs. 500.  I want to improve my results.  I avoid all white (bad) carbs.  Protein, fresh vegi's and fat is where my 600 are coming from.  My worst cheating is with wine or grain alcohol in diet drinks over the past 8 wks.Thx for the water tip and the excellent success stories!!  I'm 5'8\" female, 47 yrs old, started at 199.9 lbs per the clinic and goal is 125.  Have lost on many programs over the years and then regained.  This program has completely changed my diet and exercise habits so am fairly certain I'll keep it off this time when I reach my goal.",
            "post_id": "5903553",
            "timestamp": "1278988683",
            "user_id": "user_1216234",
            "user_link": "/personal_pages/user/1216234",
            "votes": "0"
        },
        {
            "answer": "after reading all the bad and good comments I've decided to try it and will be starting it in a couple days but i don't have the book and as i understand you have to have the right amount of cals per day so if anyone would be willing to send me a book that would be great.Thank you",
            "post_id": "5933972",
            "timestamp": "1279649542",
            "user_id": "user_1386981",
            "user_link": "/personal_pages/user/1386981",
            "votes": "0"
        },
        {
            "answer": "I am a convinced HCG user.  Started just over 3 weeks ago and have lost 27.4 lbs.  Have 3 friends that just started and they are well on their way.  I have had no problems and can't believe the loss in pounds and inches.  I started at 286.6 (can't believe I just admitted that).  Today at 259.2.  Plan to go to 140.  I am 46 years old and previously thought I was getting to old to ever succeed at weight loss.  I now know I will succeed.  I have followed plan perfectly and plan to continue to do so on the off cycles so I can truly change my body and my life.Good luck to all.",
            "post_id": "5949705",
            "timestamp": "1279984989",
            "user_id": "user_1391366",
            "user_link": "/personal_pages/user/1391366",
            "votes": "0"
        },
        {
            "answer": "Thank you for posting all of your results on here, it seems HCG works.I have 2 questions, if anyone cares to opine, please do:1) My doctor has lost 9 lbs in 3 days on the Homeopathic HCG from myfatcure.com...  anyone else use this?  it is the product I am considering.2) I have had to stop taking the pill due to debilitating migraines, since many of you complained of headaches, did they go away and were any of them migraines?Thanks again!",
            "post_id": "5993150",
            "timestamp": "1281008760",
            "user_id": "user_1403831",
            "user_link": "/personal_pages/user/1403831",
            "votes": "0"
        },
        {
            "answer": "I just started the HCG injections and I'm on my 3rd day - the first 500 calorie day. I don't have issues with the diet being 500 calories - I'm at a point where food is not a good thing to me because I feel so unhealthy - so no worries there or with hunger. I did wake up this morning with some swelling in my forehead and around my eyelids - my tongue is slightly swollen as well. I've got the jitters - and I have a headache. I read here to drink plenty of water - so I've increased my amount and will continue to drink heavily. I am going to back down on the dose tomorrow and go and sit in the ER after I inject (I work at a hospital and told them of my issues) - if I swell again or it gets worst - I'll have to stop and go back to the doctor who is helping me with the diet. He did lots of blood work before we began and found I had an underactive thyroid (on meds for that) and I was low on vitamin D.I really want this to work - I hope I'm not allergic to it. Tomorrow will tell....",
            "post_id": "6054319",
            "timestamp": "1282438803",
            "user_id": "user_1421125",
            "user_link": "/personal_pages/user/1421125",
            "votes": "0"
        },
        {
            "answer": "I done the hCG drops for 21 days.  Yes i lost some weight, maybe only 10lbs.  Was my first real diet, I stuck by the guidelines but when it was over i was so happy to eat anything except lean meat and veggies! Anyways my question is i feel like my boobs have gotton much bigger (i am a female, so no man boobs here) lol.  And like when i was breastfeeding (a year ago) im having a little leakage?  And believe me, i dont want bigger boobs at all.. now im just thinking since this stuff is some pregnancy hormone or something, could it have been the hCG that made them bigger?",
            "post_id": "6062507",
            "timestamp": "1282635980",
            "user_id": "user_1423553",
            "user_link": "/personal_pages/user/1423553",
            "votes": "0"
        },
        {
            "answer": "HELLO ME AND MY WIFE IS FIXIN TO START THE HCG DROPS AND WAS WONDERING IF THE NO OILS IS REALLY TRUE AND WHAT CAN YOU USE TO SUBSTITUTE FOR TOOHTPASTE AND DEODERANT AND SHAMPOO....... GOT ANY IDEAS AND I NEED TO KNOW ABOUT THE CLEANSE START CLEANSER OR ANY OF THE CLEASNER THATS OFFERED",
            "post_id": "6163651",
            "timestamp": "1285029415",
            "user_id": "user_1451978",
            "user_link": "/personal_pages/user/1451978",
            "votes": "0"
        },
        {
            "answer": "I am planning to have surgery ( I will have been on drops for 33 days)  can I stil finish my 40 days with out any problems?  Is that safe?",
            "post_id": "6206395",
            "timestamp": "1286054765",
            "user_id": "user_1463499",
            "user_link": "/personal_pages/user/1463499",
            "votes": "0"
        },
        {
            "answer": "I have tried this diet twice - about 1x per year.  I have lost 20 to 26 pounds over an 8 week period.  I feel much  better while on the shot.  I have energy, I just feel great.  I maintain my weight after the program by eating sensible and exercising.  I have never heard of some of the things people are saying here.  The dosage of the hcg I use is not high enough to cause some of those side effects.  It is a much lower dosage than what they give females for fertility reasons.   I have no idea who this Kevin is that one person keeps talking about.  I only seek advice from Dr Simmons, the original doc of HCG.  Just be smart.",
            "post_id": "6228512",
            "timestamp": "1286589023",
            "user_id": "user_1469446",
            "user_link": "/personal_pages/user/1469446",
            "votes": "0"
        },
        {
            "answer": "Hello, I am 25, 5'00, and weight 150lbs, and I would like to try hCg injections. I live in Miami, Florida and don't know of anyone to has done it before. Can someone give me advice? I have the shots already, but don't know how to take it? Do I not inject myself while I have my period? Also, I have 30 days worth of injections. Please someone help me. I got the HcG from my trainer at the gym.",
            "post_id": "6244036",
            "timestamp": "1286996464",
            "user_id": "user_1474103",
            "user_link": "/personal_pages/user/1474103",
            "votes": "0"
        },
        {
            "answer": "Hi Lou,Did you read Pounds and Inches? It is free online and will give you all the information you need for this diet. Good luck, this diet works! :o)",
            "post_id": "6248391",
            "timestamp": "1287086633",
            "user_id": "user_1475286",
            "user_link": "/personal_pages/user/1475286",
            "votes": "0"
        },
        {
            "answer": "I have Graves Disease (Hyperthyroidism) and have been on Synthroid for about 5 years now.  I have started the HCG drops and wondering if anyone knows if this will be a problem.  Also, I wanted to start my husband on the drops as well, but not sure if this is a diet for males also.  One last thing, has anyone lost weight who did the drops but did not completely follow the 500 calorie diet?",
            "post_id": "6248643",
            "timestamp": "1287091990",
            "user_id": "user_1475376",
            "user_link": "/personal_pages/user/1475376",
            "votes": "0"
        },
        {
            "answer": "I just wanted to say that I did the hcg diet 21 years ago in San Diego.  I was losing weight fast and made it almost a challenge to make sure I drank my water and lost at least a pound a day.  I was never hungry and also had to try to force myself to eat my 500 cals/day.  Then one day, I was starving, I not only ate my 500 cals, but a whole Whopper from Burger King, which I never did, and 3 huge pieces of pizza for dinner.  I found out that I was pregnant.  I had to stop the diet.  I was sad that I had to do that, but I do have a beautiful 20 year old daughter that had no effects of the hcg that I had while I was pregnant (unknowingly of course).  I moved away from San Diego and back to Idaho when she was 6 weeks old and I started looking for someone in Idaho that did it (when I did it 21 years ago, there was only injections and I had to go to a clinic Mon-Sat to get those, under a physicians care).  There was nobody in Idaho that even knew what I was talking about.Now 21 years later, I live in Alaska, and my husband and I are both overweight.  I went to a Nurse Practitioner for another reason and she mentioned the hcg diet.  I gave her the info that I could remember about the time I did it before and she said it was the same one.  I was so happy.  I told my husband that I know this works and I am going on it.  We started on the injections 6 days ago, with the 2 loading days after that, and I have already lost 8 pounds and my husband has lost 10.   Hopefully, we can get him down enough that he will be off his BP meds, his A1c with get lower, and he will be off his Bi-PAP for sleep apnea.The only side effect that I have noticed this time around is I getting flushing, not a rash, in my face and on my arms.  I don't know if this is a side effect or not.  I also had the headaches (and fatigue) for the first couple of days, but not so much anymore!!I am so excited to see that people enjoy this diet as much as I did and still do and hope everyone has continued success!!!",
            "post_id": "6250007",
            "timestamp": "1287125974",
            "user_id": "user_1475801",
            "user_link": "/personal_pages/user/1475801",
            "votes": "0"
        },
        {
            "answer": "Fight I have a question, I see that Hcg is not the way to got and that FDA is a joke, but after my generation and mind I am 34, that kids have gotten more obese. Also have you noticed that kids are maturing at a more earlier age and I mean physically, during my young years we didnt hit pubirty till later part of junior high like 8th grade. But now there is like a puberty boom at 5th and 6th, and correct me if I am wrong but doesnt this have to be linked to all the growth hormones injected in to our foods. What can you do to prevent from your kids hitting puberty so early so they can have a proper childhood and the stages afterword?",
            "post_id": "6259868",
            "timestamp": "1287411039",
            "user_id": "user_1478654",
            "user_link": "/personal_pages/user/1478654",
            "votes": "0"
        },
        {
            "answer": "I took 1 28 day round of hCG, lost 15 lbs and almost 8 inches. I loved it and i loved how i looked. I was unable to finish because about 3 weeks into the program i found a very large lump in my right breast (i am female). I had it biopsyed, and removed and it wasn't cancer. I am not convinced that it was directly related to hCG usage. My question is if anyone else experienced anything similar. I really want to do another round. I am not under a doctors supervision for the diet but my surgeon that removed the lump from my breast said that he'd seen side effects of hormones body builders used causing breast lumps but had NEVER seen it in hCG. I need help making this decision.",
            "post_id": "6260731",
            "timestamp": "1287426188",
            "user_id": "user_1478890",
            "user_link": "/personal_pages/user/1478890",
            "votes": "0"
        },
        {
            "answer": "Ok. So, I started the HCG, and I am on day 4, and as of right now, I have not lost any weight. Should I see results right away? Or when can I expect results? Please help.",
            "post_id": "6271229",
            "timestamp": "1287669443",
            "user_id": "user_1474103",
            "user_link": "/personal_pages/user/1474103",
            "votes": "0"
        },
        {
            "answer": "Both my husband and I both started showing weight lost on our second day after the two pig out days.  My husband has now lost over 23 lbs and is on the 16th day.  I had to stop 7 days in because again, I found out I was pregnant.  My husband follows the diet to the T, including making sure he drinks all his water.  He will not budge.  If you are following the diet and doing everything you should be doing, I would talk to your medical provider for any assistance.",
            "post_id": "6281949",
            "timestamp": "1287943869",
            "user_id": "user_1475801",
            "user_link": "/personal_pages/user/1475801",
            "votes": "0"
        },
        {
            "answer": "I have started HCG on my 7 day, i have lost 6.6 Lbs but i am so freaking hungry i want to eat the freaking table. Why am i so dang hungry please help i am about to give up.",
            "post_id": "6294992",
            "timestamp": "1288221816",
            "user_id": "user_1489074",
            "user_link": "/personal_pages/user/1489074",
            "votes": "0"
        },
        {
            "answer": "Are you drinking lots of tea, especially mornings?  Yerba Matte tea helps curb your appetite, among other things.  Also, if you exercise, that burns more calories...so you should either cut down on the exercise, or increase the amounts of the allowed foods.  I and my husband have done two rounds of the hcg diet.  He's lost a total of 37 lbs and me a total of 27 and we are very happy.  Drink lots of tea, water and lemonaide.  We usually had an apple about 1.5 to 2 hrs before our evening meal.  If you're hungry, drink lots of water and eat celery or some allowed veggie. This diet was soooo worth it.  We only felt weak a couple of times, then just had an allowed snack.",
            "post_id": "6295927",
            "timestamp": "1288242454",
            "user_id": "user_1489345",
            "user_link": "/personal_pages/user/1489345",
            "votes": "0"
        },
        {
            "answer": "This is my first time on Hcg.  During my loading days I gained 5 pounds to take me to 305 pounds.  By vlcd 7, was down 16 pounds.  I think I celebrated a little too much and ate a few more grilled shrimp than I should have so on vlcd 8, I had no change.  However, I have been experiencing pain in my legs and arms.  Almost feel like athrities pain, other than that, no realy hunger, just would love to have different recipe's than what I have.",
            "post_id": "6306218",
            "timestamp": "1288531166",
            "user_id": "user_1492224",
            "user_link": "/personal_pages/user/1492224",
            "votes": "0"
        },
        {
            "answer": "Happy Thanksgiving everyone.  I am doing the homeopathic drops.  6 drops 6 times a day except the 7th day.  Today is my 7th day of the diet.  I was seriously considering giving up yesterday.  I have been so so hungry.  I cheated on days 4, 5 and 6.  And today - Thanksgiving.  I didn't over do it drastically.  Fortunately the scale says I am down 6 pounds in 6 days as of this morning.I realized I was not drinking enough water.  I understand that certain teas are better than others.  I was thinking I was having bad side effects from this starting today - tremendous fatigue, needing to sit down almost as soon as I get up, dry mouth, constipation.  I think it goes back to needing more water.  I was not drinking half my body weight in ounces.  Dehydration is not fun.  It is dangerous.Tomorrow I start Day 8 or begin week 2.  I am not sure what the scale will tell me tomorrow but I think I will do my best to behave.  I just hope that this awful, gut wrenching hunger begins to subside.",
            "post_id": "6393747",
            "timestamp": "1290734223",
            "user_id": "user_1517375",
            "user_link": "/personal_pages/user/1517375",
            "votes": "0"
        },
        {
            "answer": "Hang in there girl.  The hunger will go away.  I found that (because I'm a grazer) it's best for me to have all my meals prepared ahead of time and that way I can eat a little here & there as I feel hungry.  There is no set order in which you have to eat the food they recommend.  I put meat on Melba Snacks and make myself little hor douvres.  When choosing fruit ... I choose the  largest I can find.  They recommend that as well. Then, I'll slice up the fruit, set it on a plate and nibble on that throughout the day.  9Be sure to try some of their recipes!!)  Since the HCG is utilizing body fat from my body, I usually don't get abnormally hungry.  That is how you can actually survive on the 500 CPD.  It's only for 21 days then you increase food intake to 1000CPD.  I've found that my face has cleared up, I feel more energetic during the day and sleep better at night.  The only side effect I have noted is dry skin.  Probably why my face cleared up. :)I'm using a homeopathic HCG, I wasn't comfortable with the injections from the doctors and I've lost a total of 20# in 3 wk.  This is even through Thanksgiving, which, admittedly, I was a very bad girl.  BUT ... I only went up 2 lbs and that came right back off when I returned to the diet.One important thing an exercise instructor stressed to me is that ... you should NOT exercise during the initial phase 1.  You are not consuming enough calories to support an exercise plan.  Wait until you've advanced to phase 2.  What's soooo cool about this is that it's homeopathic, once you've reached your goal weight and follow the instruction for resetting your Hypothalmus gland, you don't have to continue with the drops.  You will then maintain your weight with a regular healthy diet.  I've actually been able to stop taking my Thyroid medication, I no longer need it.  Now I'm waiting on Cholesterol & Triglyceride testing to come back.  Keeping my fingers crossed ... those have been my Albatross!But like I said ... keep your chin up ... find a HCG diet buddy, makes it more fun.  And remember to drink LOTS of water.  I have not been at my normal weight in 10 years ... I'm thrilled with the results.  This is where I get my product from and it's priced right:http://www.bathhousenaturals.comBest of luck to you ...",
            "post_id": "6412239",
            "timestamp": "1291262160",
            "user_id": "user_1522918",
            "user_link": "/personal_pages/user/1522918",
            "votes": "0"
        },
        {
            "answer": "i started hcg two days back. had terrible headache and i increased 2 kgs in weight which is very strange for me . i followed all the rules for diet , water, spray and so on. cn any one tel me hwy this happened. Nd i also want to know if it really effects periods. I am  not married nor do i perform sex..",
            "post_id": "6422941",
            "timestamp": "1291561227",
            "user_id": "user_1525781",
            "user_link": "/personal_pages/user/1525781",
            "votes": "0"
        },
        {
            "answer": "I have lost 54 lbs in 2 1/2 months on HCG.  Kevin Trudeau is the second source I heard it from.  It does work, and I know a lot of people whom are on it and getting great results.",
            "post_id": "6431027",
            "timestamp": "1291773390",
            "user_id": "user_1528156",
            "user_link": "/personal_pages/user/1528156",
            "votes": "0"
        },
        {
            "answer": "I am 20 yrs old and weigh 253 lbs. I had a child at the age of sixteen and while in labor I was 200 lbs. After the baby I dropped down to approx 160 and was happy with my weight. However over the past 3 years I have just been gaining weight! My blood pressure has gotten high and my doctor is concerned and telling me to loose weight. Ive tried many diets and excercise and nothing. I have a friend using the HCG oral drops and she has lost 7lbs in 3 days. I want to try it and plan on ordering it this week. I would like to go from 253 down to 200 at least for now. Does anyone have any reccomendations or helpful tips. Anything helps and thank you.",
            "post_id": "6490532",
            "timestamp": "1293580492",
            "user_id": "user_1545584",
            "user_link": "/personal_pages/user/1545584",
            "votes": "0"
        },
        {
            "answer": "I am currently using the HCG drops from *********.com and I am very happy with the results. Have been doing the protocal for 25 day and have lost 20lbs. There are no side effects that I can tell just losing weight and a rate that make you stick to the plan. So I say go for it.",
            "post_id": "6497766",
            "timestamp": "1293778773",
            "user_id": "user_1547813",
            "user_link": "/personal_pages/user/1547813",
            "votes": "0"
        },
        {
            "answer": "Wow am in the same position..... i read about HCG and i was wondering if i should try it i'm 20, 200 pounds with high blood pressure. i need to get my pressure down and i need to get my weight off..i have read some bad reviews but mostly good ones. I would like to know if it's safe and where can i purchase it",
            "post_id": "6498696",
            "timestamp": "1293815797",
            "user_id": "user_1548109",
            "user_link": "/personal_pages/user/1548109",
            "votes": "0"
        },
        {
            "answer": "I have had good results but I get major cramping in my legs. I've increased my potassium and water intake but still get the cramps. Any suggestions?",
            "post_id": "6501542",
            "timestamp": "1293918836",
            "user_id": "user_1548950",
            "user_link": "/personal_pages/user/1548950",
            "votes": "0"
        },
        {
            "answer": "This diet is completely safe with little to no side effects. I just started it (again) 3 days ago. I did the HCG diet last year and lost 25 pounds. My advice: DO NOT deviate from the 500 calories in any way! As in -- DON'T CHEAT! It's not worth it. If you cheat, you will gain weight the very next day, and spend the following day losing the weight you just gained. Don't be stupid and lose 2 days. I had 1 vodka tonic and gained 4 pounds overnight. Be strong! :)",
            "post_id": "6507040",
            "timestamp": "1294080196",
            "user_id": "user_1550868",
            "user_link": "/personal_pages/user/1550868",
            "votes": "0"
        },
        {
            "answer": "I say go for it.  I am over 40 and I completed the 40 day HGC drop diet, without cheating and lost 35 lbs.  I did have leg cramps a few times but found that adding potassium, magnesium and a good calcium plus d supplement to the multi vitamins and sublingual b; I had already been taking fixed that right away.  I feel great!  And I hear that I look great as well.  I been back to my normal diet for about 3 months now and have no re-gaining.  I still take the sublingual vitamin b drops, and the vitamins every day.",
            "post_id": "6518389",
            "timestamp": "1294335049",
            "user_id": "user_1554308",
            "user_link": "/personal_pages/user/1554308",
            "votes": "0"
        },
        {
            "answer": "Angry comments don't sink. I personally was trying to decide if I should use it but I couldn't even finish reading the post because it seemed like a passionate rage. It's ashame because if the information is right it won't help anyone because anger isn't convincing.  Guess I'll have to result to another site for my research. (by the way this was to fightu35 and no offense to you, while your intentions may be good your means of communicating can put people off)",
            "post_id": "6549766",
            "timestamp": "1295139386",
            "user_id": "user_1564172",
            "user_link": "/personal_pages/user/1564172",
            "votes": "0"
        },
        {
            "answer": "My husband and I started the HCG drops last Friday so we are approaching a week.  I have lost 10 lbs and he has lost 8.  The side effects we have experienced have been headaches, trouble sleeping and joint pain.  We found that all are common.  We spoke with our program director and were given homopathic options which helped with everything.  I had trouble sleeping before taken the HCG but was very happy to find a supplement that I could take instead of a prescription.  We are excited to get up every morning and see results.  I have no complaints and would recommend this as a very viable option for anyone who has a large amount of weigth to lose.  I weighed 257 when I started and am 5'5\" tall.   I am taken the liquid drops which is working much better than the shots which I had tried before.",
            "post_id": "6565487",
            "timestamp": "1295548939",
            "user_id": "user_1569287",
            "user_link": "/personal_pages/user/1569287",
            "votes": "0"
        },
        {
            "answer": "@Cutegagirl...My husband and I are also trying this HCG diet together as of Jan16 '11.  He has lost 8.5 lbs and I have lost 10.  Seems to be working relevantly ok, but we've been having splitting headaches.  What homopathic option was given to you by your program director that actually helped with relieving your headaches?",
            "post_id": "6568098",
            "timestamp": "1295616489",
            "user_id": "user_1570179",
            "user_link": "/personal_pages/user/1570179",
            "votes": "0"
        },
        {
            "answer": "My husband and I started the HCG diet a little over a week ago.  I have lost right at a 11lbs.and he has lost around 15lbs. I have heard many people say do not cheat on this diet because it will keep you from losing weight .  I have cheated on this diet twice by having a little chocolate and I actually seem to lose more after I eat it.  Maybe it's just me.",
            "post_id": "6584874",
            "timestamp": "1296061472",
            "user_id": "user_1575792",
            "user_link": "/personal_pages/user/1575792",
            "votes": "0"
        },
        {
            "answer": "I have been on HCG for two weeks and have cheated.  I exercised harder, out of guilt for cheating and did not gain.  I'm now following the diet and am losing 1 - 2 lbs a day.I have not seen any negative side effects yet, but I am going through one side effect that I really don't mind.  My breasts have gotten bigger!!!  So I'm assuming as soon as I get of the HCG, my breast will go back to normal.  Has anybody experienced this?",
            "post_id": "6595100",
            "timestamp": "1296327999",
            "user_id": "user_1579123",
            "user_link": "/personal_pages/user/1579123",
            "votes": "0"
        },
        {
            "answer": "I'm about to begin the HcG drops but have no gall bladder and am a migraine sufferer.  I also have extremely dry skin before starting.  Does anyone know if these will be issues that will cause me to not be successful?",
            "post_id": "6595426",
            "timestamp": "1296336444",
            "user_id": "user_1579244",
            "user_link": "/personal_pages/user/1579244",
            "votes": "0"
        }
    ],
    "post_id": "100471",
    "question": "Has anyone experienced any bad side effects from the hcg shots?  I am administering them myself and just want to know what to look out for.",
    "timestamp": "1181797200",
    "title": "Hcg- side effects",
    "user_id": "user_211067",
    "user_link": "/personal_pages/user/211067"
}