{
    "answers": [
        {
            "answer": "I have heard the same thing from many people, I asked my Dr about this when i went in for my pg confirmation. It sounds very good to me too, i will be 8 weeks tomorrow and can't wait for my early U/S next week. Congratulations on your PG, keep us updated on how your doing.",
            "post_id": "1103856",
            "timestamp": "1087794000",
            "user_id": "user_60455",
            "user_link": "/personal_pages/user/60455",
            "votes": "0"
        },
        {
            "answer": "I had a M/C when i was 17yrs, and this pregnancy which i'm hoping is going well. I can't wait to see the HB, do they actually do a count of how fast the HB is this early? what was your baby's HB at? The date i gave you is going by my LMP, the U/S should give us a better date.<a href=\"http://lilypie.com\"><img src=\"http://lilypie.com/days/050201/2/21/0/-8\" alt=\"Lilypie Baby Days\" border=\"0\" /></a>",
            "post_id": "1103861",
            "timestamp": "1087794000",
            "user_id": "user_60455",
            "user_link": "/personal_pages/user/60455",
            "votes": "0"
        },
        {
            "answer": "They can count the BPM with the u/s. OR at least my OB did. My baby's BPM have been around the 150 range each time. With the early u/s AND with the doppler later. Good luck girls!!",
            "post_id": "1103868",
            "timestamp": "1087794000",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "I wonder if your u/s is a newer one....my doctor said they couldn't do it with there's so they timed it....Did you have girls with a heart beat of 150- just for kicks!!!!Thanks!!!",
            "post_id": "1103875",
            "timestamp": "1087794000",
            "user_id": "user_69669",
            "user_link": "/personal_pages/user/69669",
            "votes": "0"
        },
        {
            "answer": "My doctor's ultrasound machine can tell the heartrate.  I wonder how old the machine is at your doctor.  With my current pregnancy the first heartrate was 150 and it is a girl.  My first child had a heartrate at 12 weeks of 170 and she is a girl.  But this baby has varied anywhere from 130 -160 and 3 times they have told me it's a girl.",
            "post_id": "1103878",
            "timestamp": "1087794000",
            "user_id": "user_57911",
            "user_link": "/personal_pages/user/57911",
            "votes": "0"
        },
        {
            "answer": "I can't believe how many of us have had m/c's it's sad! The doctor had to time the heart beats because your right the u/s doesn't tell you...he said the hear beat was around 140. Then he told me if we went off the old wise tale that the baby would be a boy! I laughed and said you told me that with my daughter and she was a girl! I guess if the heart beat is 140-150 the wise tale is a boy and anything above 150 a girl! But you can see the heart beating on the u/s! It's the neatest thing. Keep me updated with your progress our babies will be going through the same stages but a week apart!!!!",
            "post_id": "1103873",
            "timestamp": "1087794000",
            "user_id": "user_69669",
            "user_link": "/personal_pages/user/69669",
            "votes": "0"
        },
        {
            "answer": "I was told after my miscarriage that once you see a heartbeat via ultrasound the chances of miscarriage are lowered, and then they are reduced even lower after it is heard by doppler around 11- 12 weeks.  I can't remember the percentages, but I think the 5% is after it is heard by doppler.  It is more like 10% after just an ultrasound.  As I said, though, I'm not sure I remember the percentages right.  However, even 10% is pretty good odds.  Of course, all of that is assuming the hearbeat was at a normal, healthy rate.  I lost a baby that had a heartbeat around 6.5 weeks, but the hearrate was only around 90.  It should be 120-160.  I hope this helps.",
            "post_id": "1103857",
            "timestamp": "1087794000",
            "user_id": "user_57911",
            "user_link": "/personal_pages/user/57911",
            "votes": "0"
        },
        {
            "answer": "Thank you your comments were helpful!Cmn we are a week apart! Is this your first pregnancy? Thank you again for both of your comments I like to hear good statitics. We checked the heartbeat with u/s when I was almost 7 weeks and there was a good heart beat. I had an appointment last week which in the past was usually scheduled around 3 months but they told me to go ahead and go in earlier to get all the paper work filled out. This is the appointment they usually like to give you a pap smear well with 2 of my last 3 miscarriages I started to spot pink after the pap so with my fourth pregnacy I told the doctor I'd rather not have one and do it after I deliver and they let me and I had a healthy baby girl so this time around I opted for the same think - I know it probably doesn't mean anything but it was in my head so she didn't do the doppler because I was only 8 weeks so now I will have to wait until July 19 to do the doppler! I hate the wait!",
            "post_id": "1103859",
            "timestamp": "1087794000",
            "user_id": "user_69669",
            "user_link": "/personal_pages/user/69669",
            "votes": "0"
        },
        {
            "answer": "No my own OB's machine can't time it but he did it himself and counted it at about 150.When I was preg with DD, her HB was always about 165 and from the first time hearing it, the nurse said it was a girl and said she had only been wrong once in (I think) 20 yrs.With this baby the HB is 150, so I am hoping that since it is slightly slower that it's a boy! :) Will let you know in about 3 wks!",
            "post_id": "1103889",
            "timestamp": "1087794000",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "My last m/c, I heard the baby's heart beat at 6 1/2 weeks and it was at 125 and I had the m/c at 12 weeks.  Right before I m/c I had a u/s and it show that the baby stop growing at 7 1/2 weeks.  I thought it was a good heart beat but god had other plans for it.  Goodluck.",
            "post_id": "1103899",
            "timestamp": "1087880400",
            "user_id": "user_50804",
            "user_link": "/personal_pages/user/50804",
            "votes": "0"
        },
        {
            "answer": "So the wise tale does work! Well you will have to let us know if you have a boy this time! You decided to wait to find out I think that is great I did too with my daughter and I am waiting again with this baby! There aren't too many people that wait to find out these days.... Sonia I am so sorry to hear about your lose. Did they tell you at the time of the u/s that the heart beat was low and that it wasn't a good sign? See I had no idea they could tell that from the heart beat until I started reading some of the comments here.... It makes me very nervous not being able to hear the heart beat again until july 19th I'd just like to have some reassureance. The last time we heard it was at 6 1/2 weeks. Thank you for all of you comments....",
            "post_id": "1103940",
            "timestamp": "1087880400",
            "user_id": "user_69669",
            "user_link": "/personal_pages/user/69669",
            "votes": "0"
        },
        {
            "answer": "I was told that it was a very good heart beat at 125 at 6 1/2 week.  I read on here that from 120 up is very good.  I truly believe that its all up to god and what out destine holds for us.  Its not going to happen if its not the time.  Goodluck.",
            "post_id": "1103991",
            "timestamp": "1087966800",
            "user_id": "user_50804",
            "user_link": "/personal_pages/user/50804",
            "votes": "0"
        },
        {
            "answer": "When I went to the hospital at 11 weeks because i was spotting- they did an unltrasound and they said there was a heartbeat... 2 hours later i m/c and it was like my entire insides fell out of me...so how can that happen????obviously it was ME and not the baby that had a problem?would there still be a heartbeat right up to the point of m/c if it were something like progesterone levels? (I don't think they even tested that...)",
            "post_id": "1104205",
            "timestamp": "1088053200",
            "user_id": "user_70615",
            "user_link": "/personal_pages/user/70615",
            "votes": "0"
        },
        {
            "answer": "You know I would definately ask they also can give you a hormone that keeps your HCG level high (it is another hormone along with progesterone that helps support the pregnancy. The doctor told me that my body didn't produce enough on it's on so it was not nourshing the fetus and that is why I would miscarry....So far it seems to be working.The only thing is that I thought my doctor said that around 11-12 weeks they usually stop giving the hormone injections because the placenta starts to take over nourshing the fetus and it produces the progesterone. You were right at the 11 week mark....maybe there was something wrong with the fetus and not you???? I would ask your doctor to see what he thinks...My miscarriages without the progesterone were all early on like between 6-8 weeks....I don't know if the fetus could make it to 11weeks without the right hormones????But look into it! I am so sorry for your loss...I know it's hard.",
            "post_id": "1104240",
            "timestamp": "1088139600",
            "user_id": "user_69669",
            "user_link": "/personal_pages/user/69669",
            "votes": "0"
        },
        {
            "answer": "I also had a m/c this past april, I was 14 weeks when I found out.  When I went for my 12 week check-up my doc could not find the heartbeat with the doppler so he did and u/s and you could see the baby moving around but no heatbeat.  He said come back in two weeks and we will do the doppler again.  Well that was the day I found out that I miscarried.  It was a really difficult thing to go through after having a very healthy and easy pregnancy with my son.  I am now 11 weeks pregnant and every day is hard for me to get through because I am affraid of having another miscarriage.  I decided that because I was never able to hear my previous baby's heartbeat that I was going to rent a doppler.  I have to tell you it has been the best thing ever.  I have been spotting on and off since 6 weeks and just knowing that at 9 weeks I can hear our baby's heartbeat at home without waiting for my next appointment has been a blessing.  I have been able to hear it every day since.  I have yet to hear it at the doctors office so this has been a big comfort to me.  You can tell it's the baby because it's a very fast  not like our heartbeat.  I wish everyone a very healthy pregnancy.",
            "post_id": "1106659",
            "timestamp": "1090472400",
            "user_id": "user_73940",
            "user_link": "/personal_pages/user/73940",
            "votes": "0"
        },
        {
            "answer": "I also had a m/c this past april, I was 14 weeks when I found out.  When I went for my 12 week check-up my doc could not find the heartbeat with the doppler so he did and u/s and you could see the baby moving around but no heatbeat.  He said come back in two weeks and we will do the doppler again.  Well that was the day I found out that I miscarried.  It was a really difficult thing to go through after having a very healthy and easy pregnancy with my son.  I am now 11 weeks pregnant and every day is hard for me to get through because I am affraid of having another miscarriage.  I decided that because I was never able to hear my previous baby's heartbeat that I was going to rent a doppler.  I have to tell you it has been the best thing ever.  I have been spotting on and off since 6 weeks and just knowing that at 9 weeks I can hear our baby's heartbeat at home without waiting for my next appointment has been a blessing.  I have been able to hear it every day since.  I have yet to hear it at the doctors office so this has been a big comfort to me.  You can tell it's the baby because it's a very fast  not like our heartbeat.  I wish everyone a very healthy pregnancy.",
            "post_id": "1106658",
            "timestamp": "1090472400",
            "user_id": "user_73940",
            "user_link": "/personal_pages/user/73940",
            "votes": "0"
        },
        {
            "answer": "I am 12 week's pregnant and never heard the heart beat.I went for my u/s and saw the heart beat is was 167 and every thing is looking good. I am sorry for your loss and wish you all the best.I believe that it is all up to god so don't ever blame your self.....GOOD LUCK TO ALL.......",
            "post_id": "1434846",
            "timestamp": "1184848465",
            "user_id": "user_231892",
            "user_link": "/personal_pages/user/231892",
            "votes": "0"
        },
        {
            "answer": "I just had an u/s today. I don't know the day of my last menstrual period, but they guessed I am about 9 weeks pregnant from the first u/s I had a few weeks ago to confirm my pregnancy. Anyways, she said she couldn't see the heartbeat. They suggested a D&C. Do you think it's too soon to see the HB if some haven't seen it until 12 weeks?I have no cramps of spotting. I think i'm just being too optimistic. Maybe God has other plans...",
            "post_id": "1455512",
            "timestamp": "1185224746",
            "user_id": "user_233530",
            "user_link": "/personal_pages/user/233530",
            "votes": "0"
        },
        {
            "answer": "I am pregnant now and I had a miscarriage in February. I am so completely nervous. I am about 16 weeks along and I heard the bpm at 12 weeks. It was at about 160bpm and I am still nervous about my next apt.Best wishes to all",
            "post_id": "1532250",
            "timestamp": "1185831707",
            "user_id": "user_238435",
            "user_link": "/personal_pages/user/238435",
            "votes": "0"
        },
        {
            "answer": "WOW - my two little beans HR were 168 and 174.  Does that sound high to anyone?  By what I just read - It sounds like I'm having twin girls.I also started spotting and cramping very minimal yesterday.  I called my doctor and she said it was most likely the triplet (3rd sac) collapsing and that's where the spotting was coming from.  Should I be worried about m/c?  I had one at 5-6 weeks in 2004 so I am very cautious and nervous with this one.  What do you guys think?",
            "post_id": "1555595",
            "timestamp": "1185901592",
            "user_id": "user_220217",
            "user_link": "/personal_pages/user/220217",
            "votes": "0"
        },
        {
            "answer": "Hi, I totally sympathize with you and I am in the same situation.  I went to my OB today, was supposd to be the 8th week visit.  He did an u/s but didn't find a heartbeat.  He said I might be earlier in pregnancy than I think.  Sent me to the lab for more detailed u/s.  THey didn't find a heartbeat either.  Dr. told me it didn't look good and said I was having a m/c.   I just can't believe it.  I'd had 2 m/c before but in those 2, I had spotting very early on.  Also, after those 2 m/c's, I found out I had pre-diabetes and I had been keeping my blood sugar under control for this pregnancy.  I had no spotting in this pregnancy.  I am clinging to the hope that my baby is just early, maybe just turning into a 5-week pregnancy instead of an 8-week b/c on July 27th, the blood test showed I was pregnant with hcg level at 208.  Has anyone had a similar situation where no heartbeat was found with u/s but discovered to be a viable pregnancy anyway?  I have another visit in one week where he'll check again (but I get a sense he knows it's not viable and is doing it just to make me feel better).  Thanks.",
            "post_id": "1778682",
            "timestamp": "1187898970",
            "user_id": "user_258131",
            "user_link": "/personal_pages/user/258131",
            "votes": "0"
        },
        {
            "answer": "Hi, I need some advice.  I am 8 weeks tomorrow and saw a hearbeat at 7 wks 5 days.  Have a bad feeling throughout this pregnancy.  Could there still be a risk for miscarriage even after hearing the baby's  hearbeat.  So far I have no complaints during the pregnancy. Just have a fear something is going to go wrong. HELP!!",
            "post_id": "1949240",
            "timestamp": "1191454417",
            "user_id": "user_291637",
            "user_link": "/personal_pages/user/291637",
            "votes": "0"
        },
        {
            "answer": "I would like to make a comment I had an u/s at 6weeks and 2 days and the heart rate was 112, the doctor didnt even call me with any concerns but my 8th week visit she asked if I still had sensation in my breast? I said yes, why? she said she wanted a repeat u/s because the heart rate was low but not a concern just precaution. At 9 weeks I m/c! I called medical records and asked for a copy of my u/s and it said:prognosis poor for a normal pregnancy! I was sooo mad, I wish she told me the truth!",
            "post_id": "2494634",
            "timestamp": "1202734595",
            "user_id": "user_416299",
            "user_link": "/personal_pages/user/416299",
            "votes": "0"
        },
        {
            "answer": "Hi, I'll be 9 weeks pregnant in 2 days and I've been seeing a heartbeat since 6 weeks and heard the heartbeat by my 8 week ultrasound. Now, I'm not going for another ultrasound till I'm 10 weeks, and Im so nervous! I'm diabetic but have everything under control. Does anyone know what the percentage of misscarriage is now? I wake up every morning, thinking that Im gonna misscarry!",
            "post_id": "2628497",
            "timestamp": "1205249698",
            "user_id": "user_446791",
            "user_link": "/personal_pages/user/446791",
            "votes": "0"
        },
        {
            "answer": "I felt the same way. I know once a heartbeat is seen/heard on an ultrasound that is a very good sign. The percentage of miscarriage is very low. Try not to worry, I know that is easier said than done. Good luck to you.",
            "post_id": "2628587",
            "timestamp": "1205250482",
            "user_id": "user_15480",
            "user_link": "/personal_pages/user/15480",
            "votes": "0"
        },
        {
            "answer": "Hi, I am 9 wks prego today and had my first u/s yesterday. My husband and I went to the docs office. Well they ask me to pee in a cup. When I went to use the bathroom I had moderate bleeding so I kinda freaked out because this is the first time I had bleed at all. this will be our first baby. So the Doc did a pap and the routine exam and said the bleeding was caused by intercourse that me and my husband had Saturday. Doc said bleeding was not coming from my cervix but it was old blood. When they did an u/s everything fine, HR was 165 and baby was moving. Still makes me very nervous although I have never had a miscarraige I have known if plenty of people who have. My next appointment is not until the 27th of this month and my hubbys parents are coming in town the weekend of the 21st so make me nervouse to tell them before the next appointment. If anything simular is going on please comment back or email me ***@****",
            "post_id": "2628968",
            "timestamp": "1205254614",
            "user_id": "user_446893",
            "user_link": "/personal_pages/user/446893",
            "votes": "0"
        },
        {
            "answer": "Hi, I am 9 wks prego today and had my first u/s yesterday. My husband and I went to the docs office. Well they ask me to pee in a cup. When I went to use the bathroom I had moderate bleeding so I kinda freaked out because this is the first time I had bleed at all. this will be our first baby. So the Doc did a pap and the routine exam and said the bleeding was caused by intercourse that me and my husband had Saturday. Doc said bleeding was not coming from my cervix but it was old blood. When they did an u/s everything fine, HR was 165 and baby was moving. Still makes me very nervous although I have never had a miscarraige I have known if plenty of people who have. My next appointment is not until the 27th of this month and my hubbys parents are coming in town the weekend of the 21st so make me nervouse to tell them before the next appointment. If anything simular is going on please comment back or email me ***@****",
            "post_id": "2628971",
            "timestamp": "1205254643",
            "user_id": "user_446893",
            "user_link": "/personal_pages/user/446893",
            "votes": "0"
        },
        {
            "answer": "I have had 5 m/c and now am 5wks pg for the 6th time and hoping for good results so I can empathize with you. No one can tell you what to do or whom to tell but coming from my own experience telling those closests to you if in the event that the worst happens allows you to have a support system. I hope all is well with you and will be praying for you.",
            "post_id": "2630668",
            "timestamp": "1205274255",
            "user_id": "user_447280",
            "user_link": "/personal_pages/user/447280",
            "votes": "0"
        },
        {
            "answer": "I'll be 9 weeks tom. this is my first, and i have had no m/c but I am so nervous bec. I'm showing already! I already have to wear maternity! so I'm just so nervous that everyone knows, and then something is gonna happen! But i guess we'll just have to wait and see... It just feels like its taking forever to get to the \"safety zone\" (3 months) bec. I found out I was pregnant at 4 weeks!",
            "post_id": "2633938",
            "timestamp": "1205341042",
            "user_id": "user_446791",
            "user_link": "/personal_pages/user/446791",
            "votes": "0"
        },
        {
            "answer": "Hello!I have had 3 m/c.  The first two happene at 5 weeks.  The third was the worst.  I went in for my 3 month ob checkup just to get the news that the baby did no longer had a heart beat.  At 8 weeks he had a heart beat.  I felt find had no problems no bleeding.  They are running generic testing to see if they could come up with what happen.  This has been the worst expierence.  I had pictures of the ultrasound and I made the baby and angel box.  I am terrified of even trying again.  The emotional stress and pain you feel is just so unexplainable.  The 3 months you think your out of the miscarriage danger zone and than you get the news your babys heart beat stopped.  This has been a rough week for me I lost my angel on 4-4-08.Gatapr",
            "post_id": "2788175",
            "timestamp": "1208367481",
            "user_id": "user_482302",
            "user_link": "/personal_pages/user/482302",
            "votes": "0"
        },
        {
            "answer": "I was almost 12wks when I found out that my fetus didn't make it.  I saw that heartbeat 3wks earlier.  Baby was moving around and everything.  We were possitive that everything was fine.  I started some very light spotting at 11kws, 2days.  Called my DR's office and spoke with the nurse.  They didn't seem concerned.  I guess alot of woman have spotting during the 1st trimester.  They told me to keep an eye on it.  I had no more spotting the following day, so I thought all was well.  Then the next day, I had VERY light spotting again, along with VERY minimum cramping.  I called the DR again.  I went in for an ultrasound, and saw a lifeless baby.  No movement, and no heartbeat.  I was completely devistated and unprepared.  I have to choose whether I want the baby to pass on its own, or have a d&c.  Its been a few days now, and still, nothing has passed.  I'm not even spotting anymore, but I do have some minor cramping.  This is my 2nd pregnancy, and the 1st with my husband.  I had a healthy baby girl the 1st time around, but had preeclampsia with that pregnancy.  I'm wondering if anyone has any advice for me on trying to concieve again.  Has anyone had this or anything close happen to them after they had a birth with preeclampsia?  We want to try again as soon as possible.  How long does it take to pass the miscarraige?",
            "post_id": "3242416",
            "timestamp": "1217949406",
            "user_id": "user_580867",
            "user_link": "/personal_pages/user/580867",
            "votes": "0"
        },
        {
            "answer": "I am 11 weeks and 3 days today...or so I thought. I was so excited to be close to the end of my first trimester and to see my little one's heart beating away. When given the u/s my doc could not find the heartbeat. I saw the little baby looked fine, but was motionless. I feel so sad and heartbroken. How does one go on after this? And do I just wait for it to pass or does the doc take care of it? I am not bleeding or cramping at all.",
            "post_id": "3306895",
            "timestamp": "1219303597",
            "user_id": "user_596212",
            "user_link": "/personal_pages/user/596212",
            "votes": "0"
        },
        {
            "answer": "the last time I was pregnant I had a miscarriage at 10 weeks. I went to the hopsital because I had been bleeding ( more clots than spottin )so I firgured something was wrong. When I went to the doctor it was actually my second appointment so I went in and the doctore gave me my due date and then prepped me for an ultrasound so ew could hear a heartbeat. Unfortunatly we never heard the heartbeat, so he did a transadominal ultrasound but he didn't see anything. So he sent me for a vaginal ultrasound and still nothing. The news came back that I had miscarried. I'm now pregnant again. i'm about 4 and a half weeks and everyday anything that i'm feeling I worry that it's bad. everyone says i'm setting myself up for disappointment which I kind of am just because I want to be ready this time if the doctor tells me somethin bad. I haven't had the chance to be excited about this pregnancy yet even though my husband and I have been trying for 2 years to get pregnant. I'm just too worried.. and i'm not feeling ANYTHING at all. No symptons.. for about 2 weeks I had that nagging feelin in my stomach but after that nothing.. I'm bloated.. but that could be because my nerves are making me eat like crazy. I dont know what to do.. I cannot shake the feeling that something is wrong this time to. no matter how much I try to be positive-Jessica",
            "post_id": "3372999",
            "timestamp": "1220752143",
            "user_id": "user_612260",
            "user_link": "/personal_pages/user/612260",
            "votes": "0"
        },
        {
            "answer": "hi ive had 4 misscarriages and all have had heartbeats confirmed and were lost between 10 to 12 weeks x x i dont think anyone can guarantee anything just need to take extra care x x  oh yeah my last misscarriage was 2 days ago x x",
            "post_id": "3445972",
            "timestamp": "1222269690",
            "user_id": "user_630026",
            "user_link": "/personal_pages/user/630026",
            "votes": "0"
        },
        {
            "answer": "I can relate to many of your stories and your pain.  I was pregnant this year and heard the heartbeat at 8 weeks and again at 12 weeks and thought everything was ok.  I had had some spotting and was scared at first but the doc did u/s, saw the heartbeat and told me everything was ok.  I was prescribed progesterone to help with the spotting early on, but stopped at about 9 weeks.  I had a feeling that something was going to happen but I attributed it to a miscarriage I'd had 2 years ago at 9 weeks.  I thought I was just being paranoid and that everything would be ok.  Well, at 17 weeks I went in for my monthly visit with my husband, who was there at the docs for the first time, and she couldn't find the heartbeat with the doppler. I thought that was odd since last month it had been loud and strong.  So she said let's go get an u/s and I'll bet the baby's just hiding in there.  She still couldn't find the heartbeat and showed us where the heart was but there was no activity at all.  It was devastating.  I knew right away when she showed us the u/s because I had seen them before, because fortunately we have 2 healthy kids so I knew what the u/s was supposed to look like.  Another doc came in to confirm what had happened.  It was so hard walking out of there in tears among all the pregnant patients.  I decided to have a d/e, which was not so bad physically but emotionally I wasn't prepared for the wallop I would feel a few days later.I am still recovering, feel better but still sad sometimes.  I have talked to a lot of friends who have been through it too.  Then I had a call this week from the nurse who told me that there were no structural or chromosomal abnormalities.  This actually made me feel worse because I feel like it was somehow my fault.  Now I am on a mission to learn as much as I can and try to find out of I can prevent this from happening again.  I'd like to have another child but my husband is afraid to try after being through this twice now.",
            "post_id": "3447478",
            "timestamp": "1222289724",
            "user_id": "user_621347",
            "user_link": "/personal_pages/user/621347",
            "votes": "0"
        },
        {
            "answer": "I was told by my doc that everything looked great at 6 weeks 1 day.  We saw embryo and it's heart was beating at 140 bpm.  Two weeks later I started bleeding and doctors found no heartbeat.  We checked again the next day - nothing.  I don't know what happen, but you can miscarry after seeing a strong heartbeat.  Same thing happened to my best friend at 8 weeks.",
            "post_id": "4421972",
            "timestamp": "1241370328",
            "user_id": "user_269787",
            "user_link": "/personal_pages/user/269787",
            "votes": "0"
        },
        {
            "answer": "It is very interesting to hear about your stories. thanks for sharing it all.My wife have had two misscarrieages in the past two years. last one was 260 days ago, or nine months. Today we had a positive test at home. I sure hope it works out fine. the second misscarriage was particularly devastating for both of us. at 12 weeks we had the ultra sound and the doctor said the baby is dead. And that s/he stopped growing at 8 weeks. It was hard and painful for both of us. The first misscarriage, we took whatever came out of her and buried in box on our backyard. we could'nt through somewhere. the second we gave to the doctor.It particularly hard over the last 9 months as all my brothers' wives (three of them) have had healthy babies.Any ways, the experience taught us a lot about life. and now she is relaxing and taking it easy.",
            "post_id": "4735591",
            "timestamp": "1249489101",
            "user_id": "user_993883",
            "user_link": "/personal_pages/user/993883",
            "votes": "0"
        },
        {
            "answer": "I have had an ultrasound just 4 weeks ago.. (my 8 week mark) and saw and heard heart beat at about 150bpm. Today I went in and there was nothing. I don't know what to expect. I have an ultrasound schduled for Monday but I have to go thru the weekend wondering. If the baby has died, what is next? Do they do a procedure or just let the baby miscarry on its own? This is my 3rd pregnancy. I have never m/c b4. I am scared.thanks.tina",
            "post_id": "4855530",
            "timestamp": "1252553457",
            "user_id": "user_1034188",
            "user_link": "/personal_pages/user/1034188",
            "votes": "0"
        },
        {
            "answer": "I had a m/c a year ago and am now at 11 weeks. I have a Dr. appointment in two days for an u/s, but my nerves are shot. The only hope that I can cling to is that with my m/c I didn't have any pregnancy symptoms at all, no morning sickness, no sore breast, ect. and with this one I do. I miscarried at seven weeks, though the Dr. said that the baby stopped growing around five weeks. I had spotting but no cramping. They sent me home to miscarry on my own, and it was the worse choice I made. Nothing happened for over a month then the pain and bleeding were intolerable. I ended up having to need a d/c anyway. I'm trying to be positive, but some days are definitely harder than others. I just can't seem to relax.",
            "post_id": "4871428",
            "timestamp": "1252971834",
            "user_id": "user_1039620",
            "user_link": "/personal_pages/user/1039620",
            "votes": "0"
        },
        {
            "answer": "I am now 8 weeks along. However, I had a miscarriage in May, 2009.  That was my first pregnancy, miscarried at 7 weeks.  I am nervous that it is going to happen again.  I went to the Dr. on Nov. 4th and he said I was 6 weeks then and they did an us due to the last m/c and we saw and heard a hearbeat.  Didn't time it though......so hopefully all is well.  I wish everyone the best and please pray for me and my little bean!  :)",
            "post_id": "5090964",
            "timestamp": "1258513354",
            "user_id": "user_1111893",
            "user_link": "/personal_pages/user/1111893",
            "votes": "0"
        },
        {
            "answer": "I am so scared of trying again. I live in a part of the world where m/c is thought of something that is wrong with the woman who's had it. I had a m/c in June 09 at 7weeks. My husband & I saw the h/b at around 6 weeks. It was devastating. Now I'm 10dpo and feel breast soreness and lightheaded. I did have a HPT this morning that as -ve. I'm not very strong emotionally. I am so afraid that if I'm preggers, its gonna be another non-viable one. In my country, they just do the D&C and then throw the fetus away. So I don't know what happened, if there;s sumtin wrong with me.. I'm not sure. 1 OB said I've PCOS but another said I don't. I'm so confused. I really don't know what to do...",
            "post_id": "5128338",
            "timestamp": "1259564188",
            "user_id": "user_1123556",
            "user_link": "/personal_pages/user/1123556",
            "votes": "0"
        },
        {
            "answer": "I went to the Dr with severe cramping and bleeding at 13 weeks and was told Aug 1 st at around 7am I had a perfect heartbeat and perfect location for baby. I returned to the ER at 8pm that same night and miscarried waiting to see the Dr in the waiting room. I have no clue how in 12 hours so much could change but it did for me. This is my first preg and we are very eager to start trying again. This happened just a week ago so I am still very distraut but knowing I can try again and hearing your stories also gives me hope. I wish you all healthy beautiful babies and send some baby dust and prayers my way as well.",
            "post_id": "6010138",
            "timestamp": "1281411939",
            "user_id": "user_1405312",
            "user_link": "/personal_pages/user/1405312",
            "votes": "0"
        },
        {
            "answer": "When your doctor tells you your baby no longer has a heartbeat PLEASE go for a second opinion no matter what!!!!I WANT TO SHARE MY STORY WITH EVERY WOMAN OUT THEREThis is my first pregnancy and I am 28 years old. My husband and I went for our first u/s at 7.5 weeks we saw and heard the heartbeat and we were sooo happy and excited.At 10 weeks 3 days we went for our second ultrasound on September 27th Monday night.  The baby had no heartbeat, we had \"lost\" the baby.  My husband and I were devastated and we couldn't believe it.  My doctor told us to set up a D and C for the upcoming Friday  October 1st.After crying for 24 hours straight I decided to get a second opinion just in case and I also wanted to see the baby one last time.  We scheduled our appointment for Wednesday September 29th with a different doctor.We had the ultrasound done and the doctor told me I was pregnant with TWINS.  There were two yolk sacs with fetal poles and baby number two was hiding behind baby number one (the one with \"no\" heartbeat).We were told there are three scenarios.  #1 There is a chance that baby number two (the one that is directly ehind baby one) could still be alive #2 The babies will grow and separate a bit so we can see them both and its a longshot but they both may be alive #3 They are both dead.needless to say I canceled my D and C and learned a very very important lesson, always trust your instinct and always get a second opinion!!!!!!!!We go back for another ultrasound next week to see if there is any growth.  Please pray us.",
            "post_id": "6202620",
            "timestamp": "1285951870",
            "user_id": "user_1462529",
            "user_link": "/personal_pages/user/1462529",
            "votes": "0"
        },
        {
            "answer": "Hey! Just wantin some info :) I'm 8weeks pregnant tomara.. I started bleedin lightly and they sent me for a scan,I was 7weeks 4days at it and heard strong heartbeat! The bleedin stopped and then started heavier the next day again,I went to hospital and they said everything seemed fine 2them and ave booked me in for another scan tomara! The bleedin turned like a browny colour and I had a few wee clots :( Have I miscarriaged??",
            "post_id": "7426927",
            "timestamp": "1321800968",
            "user_id": "user_1905308",
            "user_link": "/personal_pages/user/1905308",
            "votes": "0"
        }
    ],
    "post_id": "1055490",
    "question": "I read on one of the forums that once a heart beat is dedected you have only a 5% change of miscarriage is that pretty much a true statistic? I know I have read that some mom's have miscarried up to twelve weeks but sometimes I think the fetus dies early on but it's not detected until later. I think I miscarriaged at 10weeks one time and 12weeks a seperate time but when the doctor did the ultra sound they were only the size of 6 weeks which meant the pregnancy hadn't been viable since 6 weeks. Does that make sense? I'm just so nervous I am started my 9 week this week and we have seen the heart beat and I just want everything to be okay....I just thought the 5% was a good statistic and wanted to know if anyone else heard that..thank you, Niki",
    "timestamp": "1087794000",
    "title": "Heartbeat Heard and Miscarriage Percentage",
    "user_id": "user_69669",
    "user_link": "/personal_pages/user/69669"
}