{
    "answers": [
        {
            "answer": "Well, the one thing I have learned from being on this site for several years is.... Nothing is normal or abnormal during an IVF.A lot of women on here have bled during their 2ww and ended up with a BFP, and a little bundle of joy. or 2, at the end to hold. And of course, a lot of women had no bleeding at all.A lot of women had a ton of symptoms during their 2ww and some had absoultely nothing... both ending in a BFP. (big fat pregnant or positive)Also, a lot of women have had period like crampin during their 2ww and some have none...both have ended up with BFP'sI personally had NO symptoms until I was about 10 wks.  I also bled lightly during my 2ww, and I bled heavily at about 5wks pregnant.Did you have a 3 day transfer or a 5 day transfer?Either way, you did test early.  When is your beta? (blood test)I would think a good sign is that it has pretty much stopped.Sending tons of positive thoughts your way!!!!!!!!",
            "post_id": "8478871",
            "timestamp": "1351868035",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "thank you much for the reply i feel better now. i had a 5 day transfer and my blood test is due this coming monday. my period had stopped this morning. my abdomen feels a bit funny that i get shooting pain but it goes away and abdomen not bloaded anymore.  did you had heavy bleeding on 2ww? thank you for your support!",
            "post_id": "8481572",
            "timestamp": "1351935243",
            "user_id": "user_4259595",
            "user_link": "/personal_pages/user/4259595",
            "votes": "0"
        },
        {
            "answer": "I had a small amount of bleeding 6 and 7 days past transfer which I thought may have implantation bleeding....but I had not 1 symptom. .  I kept telling everyone that if I hadn't seen the RE put the embryos in, and have a sono pick of them....I would swear he hadn't put them in at all!  I felt absolutely nothing!!!  Even after my positive beta and first u/s showing 2 fetuses, I felt nothing.Do you think you will another home pregnancy test?  I never did I was always to chicken.",
            "post_id": "8483447",
            "timestamp": "1351990777",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "you only probably had spotting? they said that wasa good sign but i had full on period. it's my 11th day post transfer and had tried preg test again but it was negative again :( i guess i'll just have to wait 'till tomorrow for my beta. we still have 4 embryos frozen i guess we'll just have to try again if it doesn't work.",
            "post_id": "8483648",
            "timestamp": "1351995168",
            "user_id": "user_4259595",
            "user_link": "/personal_pages/user/4259595",
            "votes": "0"
        },
        {
            "answer": "It was a little heavier then spotting, and it was pretty heavy for a day or so when it started at 5 weeks.  I spotted/bled for weeks with my pregnancy.  I would have to look back  at my pregnancy tracker to see for sure, but I believe it was up to week 14 or so....it seemed like forever!!!I am glad to hear you have 4 totcicles :).    I will keep my fingers crossed for you!!  Hang in there my friend!!!!",
            "post_id": "8483899",
            "timestamp": "1351999883",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I started bleeding yesterday at 10dp2dt. This was my second cycle. I know I'm out now as the bleeding is the same as last time and full flow",
            "post_id": "8484350",
            "timestamp": "1352020463",
            "user_id": "user_3092035",
            "user_link": "/personal_pages/user/3092035",
            "votes": "0"
        },
        {
            "answer": "i got my beta result today and it's negative.",
            "post_id": "8487688",
            "timestamp": "1352104871",
            "user_id": "user_4259595",
            "user_link": "/personal_pages/user/4259595",
            "votes": "0"
        },
        {
            "answer": "im so sorry to hear that ,this is my 2nd IVF and its my 11th day post transfer and im having most likely \"my period\" im so depressed after all the pain and suffering i went through .. i wish i could lie to my self and have some little hope until my blood test due this wednesday , but unfortunatlly the blood i see makes me face this ugly reality :(",
            "post_id": "8850790",
            "timestamp": "1361013245",
            "user_id": "user_4918149",
            "user_link": "/personal_pages/user/4918149",
            "votes": "0"
        },
        {
            "answer": "Hi ,I got my last periods on the 29th of Jan. However when I went to see the Gynec few days later, she test she said that there is 1 good sized egg and that we can try IUI. So we did the IUI on the 05th of Feb 2013. But today i.e 17th feb 2013 ,since morning had severe stomach cramps and then the bleeding started. Looks like periods.I am still in my 2ww. What does this mean ? Should I go for my test on 19th Feb",
            "post_id": "8853314",
            "timestamp": "1361089158",
            "user_id": "user_4923535",
            "user_link": "/personal_pages/user/4923535",
            "votes": "0"
        },
        {
            "answer": "Hi,Just wanted to say that I understand what you are all going through. Isn't it so upsetting to bleed (more than spotting) during the 2ww? It's like why can't we at least have hope until the blood test? Why do our hopes have to be shattered so early on :(Sorry for being depressing lol, I'm on my 3rd IVF (2nd fresh cycle) and what DH and I have decided will probably be our last, just for the physical and emotional stress/risks it has on me and I started spotting 2 days ago and my blood test is only Thursday! I too was hopeful for implantation spotting, but it's that horrible feeling that each time you go, there is more and it is redder :(I'm sorry I'm not helping anyone with their questions...just need to let off some steam. thanks for listening :)",
            "post_id": "8876397",
            "timestamp": "1361722531",
            "user_id": "user_4968573",
            "user_link": "/personal_pages/user/4968573",
            "votes": "0"
        },
        {
            "answer": "Hi, I wanted to see if this thread would keep going. I am experiencing some of the same early bleeding and was wondering if anyone else had the same? I had two 5 day blasts transferred on Friday (feb 22), and yesterday, I started bleeding. It started out a rusty colour, then was brown mid morning. I wasn't super concerned because during my last fet I spotted around the same time and it stopped by the end of the day and resulted in a BFP (miscarried at 9 weeks however). But this time the bleeding got heavier and darker, then redder. It's never been as heavy as a period. I didn't have any bleeding at night or much in my panty liner, but every time I go to the washroom, it dripps into the toilet and its there when I wipe. I was also really crampy last night, like pulling on my uterus, and a little today. And I can feel my heart pounding when I stand up to go to the washroom...which was often yesterday.I am taking Crinone and estrace. I never took Crinone before I used the other suppositories for progesterone, and now I am worried that my body didnt agree with the Crinone? Did this happen to anyone else, and did it still result in a BFP?",
            "post_id": "8889082",
            "timestamp": "1362061068",
            "user_id": "user_4994414",
            "user_link": "/personal_pages/user/4994414",
            "votes": "0"
        },
        {
            "answer": "i have sex with my boy friend with condom,now i miss period 4 days and now small bleeding done and every day small amount of blood come to last 3 days its period or any other",
            "post_id": "8909842",
            "timestamp": "1362662260",
            "user_id": "user_5036882",
            "user_link": "/personal_pages/user/5036882",
            "votes": "0"
        },
        {
            "answer": "I had my transfer on Easter and now blood test isn't until Friday and have bad cramps and now bleeding :( this te around I have been trying not to stress and been relaxing !! Been through this for over 3 years and this is my second IVF transfer. But it completely feels like a bad period and now blood does this mean I am not pregnant :( !?",
            "post_id": "9007934",
            "timestamp": "1365515828",
            "user_id": "user_5244079",
            "user_link": "/personal_pages/user/5244079",
            "votes": "0"
        },
        {
            "answer": "I did my transfer on easter also (30/03/2013), felt some cramping last week, now its mild cramping, pregnancy test negative this morning and blood test on friday. im  getting depressed",
            "post_id": "9010914",
            "timestamp": "1365588417",
            "user_id": "user_5250765",
            "user_link": "/personal_pages/user/5250765",
            "votes": "0"
        },
        {
            "answer": "Hang in there ladies.  I know how hard the 2ww is.  I never had the guts to do a hpt.  I have seen woman e sure the cycle failed,only to find out they were successful.  I will send baby dust your way, and please let us know how things turn out.",
            "post_id": "9011777",
            "timestamp": "1365613365",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Got my result on friday and the Dr said the HCG was too low for him to confirm pregnancy and told me to go again today, Saturday had some redish brown spotting and since yesterday it has turned into period. I did my test anyway as the clinic said i should still go. Im sad and confused",
            "post_id": "9025226",
            "timestamp": "1366022460",
            "user_id": "user_5250765",
            "user_link": "/personal_pages/user/5250765",
            "votes": "0"
        },
        {
            "answer": "I am sorry you didntget a definite answer.  It isso hard to go through these treatements.  Sending you big hugs!! Do you have any frozen embryos?",
            "post_id": "9025462",
            "timestamp": "1366030957",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "i had my ET on 5th April.and started bleeding on 14th (9dpt) its getting heavier day by day. My blood test is on 19th. And im hopeless",
            "post_id": "9027838",
            "timestamp": "1366087182",
            "user_id": "user_5293415",
            "user_link": "/personal_pages/user/5293415",
            "votes": "0"
        },
        {
            "answer": "No frozen embies, they transfered the only 2 which seemed viable",
            "post_id": "9028040",
            "timestamp": "1366095196",
            "user_id": "user_5250765",
            "user_link": "/personal_pages/user/5250765",
            "votes": "0"
        },
        {
            "answer": "I have been there, but now have a healthy 1 year old after five failed IVF attempts. I also had very heavy bleeding in my first trimester with my son that scared me a lot though they could never find a problem. Sending you positive thoughts. It's so easy to feel hopeless. Good luck.",
            "post_id": "9028303",
            "timestamp": "1366111399",
            "user_id": "user_5290667",
            "user_link": "/personal_pages/user/5290667",
            "votes": "0"
        },
        {
            "answer": "Many women are not successful on their first ivf cycle.  No one knows why, or can give any explanations.  I used to compare it to roulette.  You have a 50/50 chance of it working.  I have seen \"perfect\" embryos Fail, and \"crappy\" embryos turn into beautiful children.  The only advise I will give you, is please, do not give up!!  I have been on this site for many years, and have seen 90% or better of the people  find success, if they didn't give up.  You are in my thoughts!",
            "post_id": "9029236",
            "timestamp": "1366136238",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "thanks for sharing...these are a bit hopeyesterday 12dpt the bleeding got more heavier with big clots with pain...still on progestrone...till my blood test on coming friday",
            "post_id": "9031616",
            "timestamp": "1366191817",
            "user_id": "user_5293415",
            "user_link": "/personal_pages/user/5293415",
            "votes": "0"
        },
        {
            "answer": "Thanx for giving us some courage. I got my second results and the Dr says the HCG has gone a bit higher although im having my priods. Send back for more blood tests. This is frustrating, but im not losing hope. Thanx guys",
            "post_id": "9038350",
            "timestamp": "1366367269",
            "user_id": "user_5250765",
            "user_link": "/personal_pages/user/5250765",
            "votes": "0"
        },
        {
            "answer": "I'm thinking of you today.  Please let us know how it goes.",
            "post_id": "9038569",
            "timestamp": "1366376823",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I know that waiting stinks.  Look at It as its  not over yet. did they give you your numbers??   I will keep you in my thoughts.  When's your next bloodtest?  Have you been doing hpt's?",
            "post_id": "9038576",
            "timestamp": "1366377011",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Sorry for responding late. Its officially negative, we are preparing for the next IVF in June. Another R25000.00, im not complaining as i believe its money well spent. God will answer our prayers",
            "post_id": "9114231",
            "timestamp": "1368626494",
            "user_id": "user_5250765",
            "user_link": "/personal_pages/user/5250765",
            "votes": "0"
        },
        {
            "answer": "Your right...worth every penny!!!!",
            "post_id": "9115742",
            "timestamp": "1368659964",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi,I had 2 embryo's transfered  after a 3 day, one at 6 cell the other at 7, its now being 7 days and am starting to get some light bleeding its red & brown No cramping as of yet, But my boobs are still really tender, Im now worrying thinking that it hasn't work again, this is my 2nd cycle as I had iui last time but it didn't work,  I have no eggs frozen,:( any 1 know if this is a good sign or bad? I have 4 days til test.",
            "post_id": "9180374",
            "timestamp": "1370658206",
            "user_id": "user_5599266",
            "user_link": "/personal_pages/user/5599266",
            "votes": "0"
        },
        {
            "answer": "**this is what happens in a 3dt :Here is a timeline as to what is going on.  Maybe you are experiencing implantation bleeding?  Sending baby dust your way!!1dpt ..embryo is growing and developing2dpt... Embryo is now a blastocyst3dpt....Blastocyst hatches out of shell on this day4dpt.. Blastocyst attaches to a site on the uterine lining5dpt.. Implantation begins,as the blastocyst begins to bury in the lining6dpt.. Implantation process continues and morula buries deeper in the lining7dpt.. Morula is completely inmplanted in the lining and has placenta cells &fetal cells8dpt...Placenta cells begin to secret HCG in the blood9dpt...More HCG is produced as fetus develops10dpt...More HCG is produced as fetus develops11dpt...HCG levels are now high enough to be immediately detected onHPT",
            "post_id": "9181914",
            "timestamp": "1370714659",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "hi All, im new to this site, and I've found it  really interesting... this is my first ivf cycle, I had my transfer on 8/9 now im waiting to be tested on Wed 8/21.  yesterday I found I was bleeding it feel that I have my period. I called my dr. she told me to hang in there until Wed. that feeling is annoying cause I want to know what's happening.... does anyone had this feeling in the past and still get pregnant?",
            "post_id": "9398821",
            "timestamp": "1376829328",
            "user_id": "user_5926236",
            "user_link": "/personal_pages/user/5926236",
            "votes": "0"
        },
        {
            "answer": "I have posted on this site several other times, that I have found that tree is nothing normal or abnormal during the 2ww.  I have seen ladies have period like bleeding still go on to a normal pregnancy.  As for me, I had bleeding after my confirmed bfp.  It started at week 6 and lasted till week 16.  It was pretty much every day.  Brown, red, heavy, light.  It drove me crazy, but I had a successful pregnancy.Did you see the breakdown of what happens day by day after your transfer?  It was the post right above yours?Are you going to do a home pregnancy test or wait your bloodwork?  I never had the guts to poas...Hang in there!!!  How many embryos did you transfer????",
            "post_id": "9399697",
            "timestamp": "1376854798",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I am going for my pregnancy test tomorrow - 8/20.  Very nervous.  I have not had any bleeding, but have had cramps like I was going to get my period.  Good Luck to you!!  This is my first go at IVF too.",
            "post_id": "9403734",
            "timestamp": "1376968328",
            "user_id": "user_5935102",
            "user_link": "/personal_pages/user/5935102",
            "votes": "0"
        },
        {
            "answer": "Let us know howmitmgoes today.  Sending tons of baby dust!!! Hoping for a positive test!!!",
            "post_id": "9405588",
            "timestamp": "1377025785",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi this is my first post on any forum, and also my first attempt at ivf after three failed iuis. I had my et on Wednesday the 21  and started bad cramping immediately after only to start a light spotting a couple days ago which has been on and off since. Although tonight the cramps are almost unbearable and the light spotting now looks like a full flow period with clotting. I get my beta tomorrow so hoping this is all normal for a 2 embryo 5day transfer, any and all feedback is more than welcomeImpatiently waiting for tomorrow :/",
            "post_id": "9435949",
            "timestamp": "1377830358",
            "user_id": "user_5984746",
            "user_link": "/personal_pages/user/5984746",
            "votes": "0"
        },
        {
            "answer": "Looks like I am hopeless. :(",
            "post_id": "9450114",
            "timestamp": "1378250088",
            "user_id": "user_5962844",
            "user_link": "/personal_pages/user/5962844",
            "votes": "0"
        },
        {
            "answer": "Do you count the day of transfer as day one?  If so im on day 8 and have spotting again is that good or bad to have spooting twice with cramps. The first time was on day 5 with really bad pains and thid time mild pain. Can you help put my mind at rest.",
            "post_id": "9456889",
            "timestamp": "1378424128",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "Did you do a 5 day transfer???  The list I posted above shows 1dpt...ect.  So, look at it, you are 7dpt, and your cramping could be your lil one snuggling in :)",
            "post_id": "9457430",
            "timestamp": "1378433507",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I had a 3dt and I hope it is lol this is my 3rd time :)",
            "post_id": "9457707",
            "timestamp": "1378439860",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "I hope so too!!  :). Here is the info for what happens after a 3 day transfer :)3 Day Transfer:1dpt... Embryo is growing and developing2dpt... Embryo is now a blastocyst3dpt... Blastocyst hatches out of shell on this day4dpt... Blastocyst attaches to a site on the uterine lining5dpt... Implantation begins,as the blastocyst begins to bury in the lining6dpt... Implantation process continues and morula buries deeper in the lining7dpt... Morula is completely inmplanted in the lining and has placenta cells & fetal cells8dpt... Placenta cells begin to secret HCG in the blood today!9dpt... More HCG is produced as fetus develops10dpt... More HCG is produced as fetus develops11dpt... HCG levels are now high enough to be immediately detected on HPT",
            "post_id": "9458792",
            "timestamp": "1378483428",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thanks for that mhv I think its 9dpt today I still have spotting and a bit of pain.iv been in bed for 2 days just cant kerp awake. Iv been feeling sick and been sick as well. Don't know what to think at the minute my head is somewhere else at the moment :) I have to do my hpt on the 15th so far away lol",
            "post_id": "9462267",
            "timestamp": "1378584346",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "Thats terrible you are not feeling well :(.  I know the 15th seems like a lifetime away, but I am hoping it is worth your wait!!!!  Hang I there.",
            "post_id": "9462311",
            "timestamp": "1378585981",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Im trying im just hopping its all sings :)",
            "post_id": "9462350",
            "timestamp": "1378587119",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "HI ALLI AM ON DAY 13 AFTER TRANSFERHAVE HAD CRAMPING SUNDAY THEN WENT.YESTERDAY WENT I WENT TOILET I HAD PINKISH BLOOD ON TISSUETHIS MORNING DARK RED ON TISSUE AND SINCE THEN BROWN DISCHARGE WHEN I WIPE - AND SOME CRAMPINGALL SIGNS OF MY NORMAL PERIOD.MY BLOOD TEST IS THURSDAY BUT AM IN BITS AS FEEL IT HAS MOST DEFFINITLY NOT WORKED.???????",
            "post_id": "9469606",
            "timestamp": "1378811554",
            "user_id": "user_6060868",
            "user_link": "/personal_pages/user/6060868",
            "votes": "0"
        },
        {
            "answer": "I am on the same boat. I did IVF August 31,2013. I  started light and now bleeding medium dark red with clots. I am suppose to get blood test tomorrow. This ***** after 8 failed iui's. I have heard that other people had success IVF and they where also bleeding. Still a little hope, but don't believe I am. Good luck to you.",
            "post_id": "9472208",
            "timestamp": "1378872292",
            "user_id": "user_6067082",
            "user_link": "/personal_pages/user/6067082",
            "votes": "0"
        },
        {
            "answer": "the wait is crazy isn't it.have you had blood test yet ?",
            "post_id": "9472661",
            "timestamp": "1378897354",
            "user_id": "user_6060868",
            "user_link": "/personal_pages/user/6060868",
            "votes": "0"
        },
        {
            "answer": "I hope your bloodtest today tuns out positive.  Hang in there, I know how tough it is.  You are in my thoughts.",
            "post_id": "9472727",
            "timestamp": "1378900086",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "have you had your BT ?",
            "post_id": "9472877",
            "timestamp": "1378904004",
            "user_id": "user_6060868",
            "user_link": "/personal_pages/user/6060868",
            "votes": "0"
        },
        {
            "answer": "Im on 13th day as well iv been bleeding since last Thursday so s week tomorrow its only light blood not like a period. I went to my doctors and she said its nothing ti worry about my serviks(think thsts how its spelt lol) is still looking strong. I do my hpt on Sunday and hopefully its all good. And good look to you all having your bloods done :)",
            "post_id": "9473241",
            "timestamp": "1378911836",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "I am not sure what bt is, but if this helps, I am not ttc.  I have 1 yr old g/b twins.  I tried for 7 1/2 yrs.  you can read my profile for the whole story.  I am just here to support others.",
            "post_id": "9474122",
            "timestamp": "1378929708",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I did a hpt todsy 3 dsys early and it came up not pregnant but it still doesn't mean its all gone downhill dose it. As im still being sick and brests are a bit uncomfortable and im still bleeding a bit. I just want this to work.",
            "post_id": "9476328",
            "timestamp": "1378995791",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "How did you go with bt? hope its good news for you  x",
            "post_id": "9476343",
            "timestamp": "1378996156",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "Good luck with your bt today x",
            "post_id": "9476347",
            "timestamp": "1378996248",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "Nope, it does not mean you are out.  Keep the faith :).",
            "post_id": "9476434",
            "timestamp": "1378999055",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thank you xx",
            "post_id": "9476461",
            "timestamp": "1378999841",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "my BT was negativefeel distraught",
            "post_id": "9478620",
            "timestamp": "1379059509",
            "user_id": "user_6060868",
            "user_link": "/personal_pages/user/6060868",
            "votes": "0"
        },
        {
            "answer": "I am really sorry to hear your news.  I hoped it would be positive.  I now haw draining this whole process is.  Will you've able to try again??",
            "post_id": "9478934",
            "timestamp": "1379075961",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Im really sorry to hear that. Do you have any left x",
            "post_id": "9482044",
            "timestamp": "1379168392",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "Well I did my hpt this morning and it was a big fat no. I cant begin to tell you how we are feeling right now ; (",
            "post_id": "9484324",
            "timestamp": "1379258261",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "I m new to this forum. had  pgd and embryo transfer 11 days back .today it started bleeding a few clots and blood .I  am so much depressed. tomorrow going for my hpt . Friends wish me luck",
            "post_id": "9484900",
            "timestamp": "1379275718",
            "user_id": "user_6133416",
            "user_link": "/personal_pages/user/6133416",
            "votes": "0"
        },
        {
            "answer": "Baby dust coming your way hun :)",
            "post_id": "9484987",
            "timestamp": "1379278279",
            "user_id": "user_6023644",
            "user_link": "/personal_pages/user/6023644",
            "votes": "0"
        },
        {
            "answer": "HiI had 2 embryo's transferred late the afternoon of the 16th, one was grade2 and one grade2-3.  I have low AMH and this is my second ivf with a new gynae.  I can try a home test tomorrow morning but I am nervous and afraid. I am feeling the same pains and aches before a period.  I really hope there is a chance",
            "post_id": "9515137",
            "timestamp": "1380187090",
            "user_id": "user_6305264",
            "user_link": "/personal_pages/user/6305264",
            "votes": "0"
        },
        {
            "answer": "Hello , I did my 5day frozen embryo on 28/9/2013 . To day is my 8 day I after transfer . That is if we are counting transfer day as day zero.My worries is I spotted on Friday and Saturday as well and it was red and light, I had a Bach ache as well.Am worried. It's my first icsi .Please help. Tell me how yours went.",
            "post_id": "9545243",
            "timestamp": "1381060531",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "The light spotting could have been implantation bleeding.  The embryo embedding into your uterus.  Fingers crossed!! :). When is your bloodtest?  How many did you transfer??",
            "post_id": "9545522",
            "timestamp": "1381070698",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thanks for your feedback. My blood test is on 11/10/2013. I did one transfer.",
            "post_id": "9545546",
            "timestamp": "1381071506",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "I started spotting on Friday! I saw blood for few minutes then it stopped. On Saturday the same. And now have just seen blood few minutes ago. Am loosing hope. Have cried and cried as I do not want to go through it again.",
            "post_id": "9545558",
            "timestamp": "1381071736",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "Don't lose hope!!  It could be the embryo(s) implanting.",
            "post_id": "9545597",
            "timestamp": "1381073331",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Have lost my dear, today is my 12th day post embryo transfer. For the last 3 days have been bleeding very heavy than ever plass a server stomach cramp. I called the clinic and they said to me that my period came early o may be it dint work. But they still need me for blood test.  I had a urine test this morning and it was negative . All the hopes and dream I had have gone with wind. Am so disappointed. Will let you. Have cried and cried. Have lost appetite can't eat am depressed. I still have 3 frozen embryo might try ones more. Not sure though.",
            "post_id": "9554000",
            "timestamp": "1381315345",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "First time doing ivf I have a daughter but she was naturally conceived I had an egg transfer on the 2nd slight cramping on the 2nd and 3rd day and really tender boobs but all that seems to have gone and this moring was some blood very dark red brown in colour blood test is Monday and I will ssy its the longest 2 weeks ever",
            "post_id": "9555623",
            "timestamp": "1381356682",
            "user_id": "user_6445416",
            "user_link": "/personal_pages/user/6445416",
            "votes": "0"
        },
        {
            "answer": "I wish you luck have you had a blood test yet",
            "post_id": "9555930",
            "timestamp": "1381364322",
            "user_id": "user_6445416",
            "user_link": "/personal_pages/user/6445416",
            "votes": "0"
        },
        {
            "answer": "Am going for my blood test tomorrow 9.30am. May your dream come true.",
            "post_id": "9557271",
            "timestamp": "1381411935",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "Hello, thanks for the encouragement you gave me. I had my test this morning and it was negative, am going to book the next appointment with my doctor to discuss about the next cycle. Will never give up.",
            "post_id": "9559896",
            "timestamp": "1381488608",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "So sorry to hear mine was a negative as well which I thought as I did end up having a period.  We have one frozen so not so much drugs and crap next round glad to hear your going to keep on trying I have frozen transfer is a lot less stressful and some say higher success rate so here's hoping",
            "post_id": "9566975",
            "timestamp": "1381725117",
            "user_id": "user_6445416",
            "user_link": "/personal_pages/user/6445416",
            "votes": "0"
        },
        {
            "answer": "Oh dear yours was negative as well. Am sorry to hear that. Don't give up just try again as you have frozen embryo.I have three frozen embryo as well. Am praying for you and you do the sama for me. Our dream will soon come true. Believe and trust in God. I wish you all the best. Keep me updated, I will do the same.",
            "post_id": "9569047",
            "timestamp": "1381785185",
            "user_id": "user_6337531",
            "user_link": "/personal_pages/user/6337531",
            "votes": "0"
        },
        {
            "answer": "Just to let you no I think you are great helping every one the best you can.its been a week since my transfer and to day I have cramping and a little blood very scared.its my first ivf after the eggs where taking out I was not doing good really sick I just hope for the best thanks.",
            "post_id": "9613472",
            "timestamp": "1383094648",
            "user_id": "user_6624019",
            "user_link": "/personal_pages/user/6624019",
            "votes": "0"
        },
        {
            "answer": "Thank you :). I try.   Sometimes I drop the ball, but I think I have a pretty good excuse...15 month old g/b twins.  After 10yrs of ttc, and 3 yrs on here.  You bleeding could be implantation bleeding.  When is your blood test?",
            "post_id": "9613721",
            "timestamp": "1383098759",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I am sorry you both received a bfn.  I know how hard it is.  I am so glad you both have totcicles :).  I pray your lil miracle is in them :)",
            "post_id": "9613731",
            "timestamp": "1383098917",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi I am new to this site I am 8 days past and been bleeding since last nite I think it's my period it's not that heavy yet but the pains feel like my period pains very upset",
            "post_id": "9617849",
            "timestamp": "1383225889",
            "user_id": "user_6635583",
            "user_link": "/personal_pages/user/6635583",
            "votes": "0"
        },
        {
            "answer": "I am sorry about the bleeding.  Is it still happening?  When is your bloodtest?  Did you do a 5 day transfer or a 3 day??",
            "post_id": "9618719",
            "timestamp": "1383245020",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi it's still happening but it's very light but I'm sure it will get heavier I had a 5 day transfer nurse said to be positive it may not my period but I can feel it =-(",
            "post_id": "9618743",
            "timestamp": "1383245385",
            "user_id": "user_6635583",
            "user_link": "/personal_pages/user/6635583",
            "votes": "0"
        },
        {
            "answer": "I had a little bleeding on day 6 and 7 after transfer, maybe it's implantation bleeding??  I hate the 2ww!  It always has to be so brutal!  I hope you get news.",
            "post_id": "9618943",
            "timestamp": "1383250891",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Sorry have not got back been really upset did not work out .i have hope for the fet.I have 2frozen will do the end off dec.this time I won't be so sick .is there any thing that you no off that I should do thanks anything would be great",
            "post_id": "9646343",
            "timestamp": "1384071769",
            "user_id": "user_6624019",
            "user_link": "/personal_pages/user/6624019",
            "votes": "0"
        },
        {
            "answer": "That's ok :). We all need to take a break now and then.  I don't have a lot of advice, just drink a lot of water, and be positive :). FYI, I did donor embryos, so my twins are from an fet :). Good luck, and keep us up to date through out the month to come :)",
            "post_id": "9646561",
            "timestamp": "1384087958",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thank you and I will",
            "post_id": "9647388",
            "timestamp": "1384110597",
            "user_id": "user_6624019",
            "user_link": "/personal_pages/user/6624019",
            "votes": "0"
        },
        {
            "answer": "Hi, i am new to this forum, i had 1 natural baby a long time ago then had 3 ectopics and 2 failed IVFs, i waited 5 years and decided to try another IVF we had 2 x 3 day embryos put in on 19/12/13 today is blood test day but i am very upset as i have had brown watery bleeding since last night... Sitting around waiting for the doctor to call, but have a bad feeling",
            "post_id": "9797084",
            "timestamp": "1388400077",
            "user_id": "user_7134317",
            "user_link": "/personal_pages/user/7134317",
            "votes": "0"
        },
        {
            "answer": "I am sorry I am just seeing this.  Wanted to see how things turned out for you.  I am really hoping you received wonderful news!!",
            "post_id": "9802575",
            "timestamp": "1388545383",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi Noona27,What did you end up doing after this? I ask because the same exact thing happened to me and I don't know where to go from here",
            "post_id": "9873929",
            "timestamp": "1390587743",
            "user_id": "user_7320516",
            "user_link": "/personal_pages/user/7320516",
            "votes": "0"
        },
        {
            "answer": "Hi. I am also new to this site. Just wondering if anyone has had a successful pregnancy after heavy bleeding 7dpt? I had 2x 3det on Jan 19 and only had slight cramping and tender boobs. On 7dpt I had very heavy bleeding with clots and it is still heavy today. Mr Dr. said to stay on the progesterone and estrogen until my blood test on Feb 4 but feels it probably didn't work. Any luck with other situations like this? Thanks",
            "post_id": "9881711",
            "timestamp": "1390797674",
            "user_id": "user_7433671",
            "user_link": "/personal_pages/user/7433671",
            "votes": "0"
        },
        {
            "answer": "Hi, I am new too. I had ivf and had2 embryos transferred on the 22nd January. I had spotting for about just under two days, which I've heard could have been implantation bleeding. On Friday I had a quite heavy bleed from about 6am - 10am and then it went light again. I have completely stopped bleeding and had my blood test yesterday and waiting for the results which u should hopefully get tomorrow. Just want to know, have you had your blood test and Did you get positive results?Good luck and thank you xxx",
            "post_id": "9906138",
            "timestamp": "1391339911",
            "user_id": "user_7495851",
            "user_link": "/personal_pages/user/7495851",
            "votes": "0"
        },
        {
            "answer": "Hi what was your test? I just did ivf for the first time after doing 6 iui's in the last 2 years, I am on day 10 and bleeding its a weird bleeding, I am also injextion Crinone which is progrestrone, this is so frustrating it makes you want to give up",
            "post_id": "9964999",
            "timestamp": "1392579027",
            "user_id": "user_7609809",
            "user_link": "/personal_pages/user/7609809",
            "votes": "0"
        },
        {
            "answer": "Hi there, I am new to this community. I had my ET on last Sunday and today is my 9th day and I had bleeding and I am going for my blood test on this Friday.Is there anyone here got positive result after having heavy bleeding with clots..please help me..so stressed...Thanks, PS",
            "post_id": "10004921",
            "timestamp": "1393321414",
            "user_id": "user_7681883",
            "user_link": "/personal_pages/user/7681883",
            "votes": "0"
        },
        {
            "answer": "Hi there, I am new to this community. I had my ET on 3RD DAY  bleeding and 11th day , blood test is next 3days . Any chance.Is there anyone here got positive result after having heavy bleeding with clots..please help me..so stressed...",
            "post_id": "10201425",
            "timestamp": "1396844359",
            "user_id": "user_8169922",
            "user_link": "/personal_pages/user/8169922",
            "votes": "0"
        },
        {
            "answer": "Hello everyone Iam very new to this site but been reading your post and would sure love the support. Had my transfer 8 days ago one single embryo on day three. They retrieved 3 but my one blessing turned to a six so they decided to transfer they assured me it looked great! On day three I stated to feel some mild cramping through the night it continued for two days with light tan looking blood then stopped. Has this happen to any of you?? Does it seem normal??? Today is day 8 and I feel nothing!! Also taking vaginal inserts could this b all the cause? I just need some hope can't take the wait",
            "post_id": "10281852",
            "timestamp": "1398279433",
            "user_id": "user_8104791",
            "user_link": "/personal_pages/user/8104791",
            "votes": "0"
        },
        {
            "answer": "I had embryo transfer on 7th may 2014 and was spotting 2-3 days later and yesterday and today bleeding quite heavy and its gone light now and also having cramps. I am 6 days after egg transfer i am getting blood when going to the toilet but hardly anything on my santitary pad. I test in 8 days. Does anyone have anything similar and got a positive result. My period is normally very heavy and I dont think its a period I don't know what to think.",
            "post_id": "10392776",
            "timestamp": "1399992329",
            "user_id": "user_8811259",
            "user_link": "/personal_pages/user/8811259",
            "votes": "0"
        },
        {
            "answer": "This is my 5th transfer and my goodness it hasn't been easy , I starded bleeding just two days after transfer some brownish then turn to pink and then red and heavy now with clots....God have mercy on our souls cos this is not an easy task.hmmmm someone pls help me......",
            "post_id": "10490222",
            "timestamp": "1401514691",
            "user_id": "user_9070220",
            "user_link": "/personal_pages/user/9070220",
            "votes": "0"
        },
        {
            "answer": "So I'm new to this site... I've read lots of posts but never commented.  I'm working on my first IVF cycle... from having 4 viable ovum's I ended up having only 3 harvested.  1 turned out to be too immature, 1 fertilized abnormally so they \"discarded\" that one, and only one little survivor fertilized and was ready for a 3d transfer. Needless to say I was crushed that my odds have dropped dramatically.  ET happened on Thursday May 22, by Saturday May 24th I was cramping.  I had cramps all week long with mild sharp pains from time to time.  I ended up getting my period that was a brown color on Friday May 30th, 8 days after my transfer.  It's a heavy flow, full blown period.  I've taken pregnancy test during the camping week and all turned out negative.  Now I have to go in to have blood drawn on Friday June 6th.  Needless to say I'm so disappointed, felt like I was set up for failure since my retrieval..  How do I come back from this? Only a huge miracle from God can make this turn into a BFP... Has anyone had this? Please help.",
            "post_id": "10514366",
            "timestamp": "1401902837",
            "user_id": "user_9137362",
            "user_link": "/personal_pages/user/9137362",
            "votes": "0"
        },
        {
            "answer": "Am new here, today is my day 8 of the transfer.  I see very light brown blood on the pad, I don't know what this mean. ..I need help",
            "post_id": "10515339",
            "timestamp": "1401914341",
            "user_id": "user_9139232",
            "user_link": "/personal_pages/user/9139232",
            "votes": "0"
        },
        {
            "answer": "I'm very curious about ivf so I've now read this whole post....I have 4 children, conceived naturally....but now my youngest is 3 and my husband and I have been wanting another. But we've tried for 8 cycles and nothing! This cycle I took clomid. But I'm getting negatives on hpt. Ivf is the next step I want to pursue ....I don't want my husband to loose faith in me. :(    but I have lots of questions....I'm in central Texas... where would I go? Is it just fertility clinics or are there other types of medical professionals too. What is the approx out of pocket cost and how quickly could I get started? Thank yall for the help.",
            "post_id": "10520231",
            "timestamp": "1401989570",
            "user_id": "user_8755374",
            "user_link": "/personal_pages/user/8755374",
            "votes": "0"
        },
        {
            "answer": "It could be implantion bleeding. Did toy have a 3 day or a 5 day transfer?",
            "post_id": "10521088",
            "timestamp": "1401999764",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Good day Dr, it's  5 day transfer.",
            "post_id": "10555276",
            "timestamp": "1402544161",
            "user_id": "user_9139232",
            "user_link": "/personal_pages/user/9139232",
            "votes": "0"
        },
        {
            "answer": "It could be implantation.. I had 2 days of implantation bleeding day 6 and 7Good luck!!!  When do you do your blood test??",
            "post_id": "10558864",
            "timestamp": "1402602205",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hello Dr, I did the test and it came low. My dr told me to come back on Monday. I feel very light, not like a pregnant woman.  Well I hope God help me.",
            "post_id": "10604500",
            "timestamp": "1403338721",
            "user_id": "user_9139232",
            "user_link": "/personal_pages/user/9139232",
            "votes": "0"
        },
        {
            "answer": "I'm new to this site, but encouraging words help.  I had twin pregnancy 3 years ago and give birth at 24 weeks due to severe preeclampsia, and lost them NICU to infections after 2 wwk, have lots of frozen  left...Had transfer on 6/27 waiting for preg test on the 9th but getting all period like systoms..  I'm praying... Good luck to all who can't afford to give up",
            "post_id": "10676952",
            "timestamp": "1404577963",
            "user_id": "user_9566744",
            "user_link": "/personal_pages/user/9566744",
            "votes": "0"
        },
        {
            "answer": "Hi im new to all this and going through ivf as a surrogate, I had a 3 day transfer on friday but im due my period on tuesday and I am quite confused to what is going to happen if I get my period is that a sign it has not worked. Thanks",
            "post_id": "10807735",
            "timestamp": "1406455720",
            "user_id": "user_9880005",
            "user_link": "/personal_pages/user/9880005",
            "votes": "0"
        },
        {
            "answer": "Been reading through all the posts as I am currently 10 days post transfer (had transfer on 29th September) am supposed to be doing at home pregnancy test tomorrow morning first thing.  While at work today had major cramps come on very suddenly followed by period like bleeding :(I'm trying to stay busy and just get through this evening so we can test in the morning but having been feeling so positive through this whole process today has really changed that! Not feeling so positive now, this feels like a period and all my symptoms I had been having (tender breasts, headaches, tiredness  and thirsty all the time etc) stopped yesterday so I think they may have been a side effect of my progesterone only? Still on my progesterone twice a day. I had a 5 day blastocyst transfer of two embryos, I've read that bleeding could be implantation but I think I'm past the days that should have happened...I've also read it could be one embryo miscarrying but who knows! Just waiting the night through for the test in the morning...",
            "post_id": "11310870",
            "timestamp": "1412873397",
            "user_id": "user_10797466",
            "user_link": "/personal_pages/user/10797466",
            "votes": "0"
        },
        {
            "answer": "I had a 5dt, transferred 1AA quality egg and 1BB quality egg. Day 5 I had pinkish/brownish discharge, I called the doc they confirmed nothing to worry about. Day 6 lots of blood clots. Has anyone had a successful pregnancy even with heavy blood clots? I have my first beta tomorrow and Im feeling overwhelmed! How can I remain positive?",
            "post_id": "11706684",
            "timestamp": "1419152765",
            "user_id": "user_11539057",
            "user_link": "/personal_pages/user/11539057",
            "votes": "0"
        },
        {
            "answer": "Hello, I wander how are you doing now ? My period-like cramp and bleeding brings me to this site and reading more let me hold on to my hope. I am 11 day post transfer, can understand the wait seemed forever. Though I think everyone is different, besides sharing, the site provides us a platform to vent out Our stress and gain support",
            "post_id": "11775140",
            "timestamp": "1420322067",
            "user_id": "user_11673199",
            "user_link": "/personal_pages/user/11673199",
            "votes": "0"
        },
        {
            "answer": "This is an old thread from 2012, so you many not get a lot of responses. Did you do a 3 day transfer?  Or a 5 day?  When is your beta?",
            "post_id": "11781088",
            "timestamp": "1420409692",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Wondering how your beta went? Hoping you got wonderful news!!!!",
            "post_id": "11781106",
            "timestamp": "1420409875",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm day 9 after transfer. Started having light irregular bleeding day 8. It turned dark red and this morning there is a little more with gloopy clots.  I'm due my pt on weds and just so worried it's not working.  It's our first time and what an emotional roller coaster it is! Fingers crossed for just embryo implanting x",
            "post_id": "11930503",
            "timestamp": "1422860924",
            "user_id": "user_12003716",
            "user_link": "/personal_pages/user/12003716",
            "votes": "0"
        },
        {
            "answer": "Hi,I didn't know if I should write in here or not but it seems it helps so:1 did a day 3 transfer on the 8th feb. On the 18th á started to bleed heavily! And did for 4 days :( very stressed and sad as I was hoping it would work.Did a blood test came back as an 8. The nurse told me to do another one a week later. To everyone's surprise it was 450. 2 days later ........ 850 hug.They think it's ectopic due to the bleeding. A scan is to be done on the 10th.How am I supposed to wait so long. Can't they see if it is now?Just like you I bled ....a lot and still a positive.Good luck. I hope you have good news.",
            "post_id": "12097404",
            "timestamp": "1425208577",
            "user_id": "user_12421463",
            "user_link": "/personal_pages/user/12421463",
            "votes": "0"
        },
        {
            "answer": "Hi,You have a similar experience to what I had.I would love to know how it went. Fingers crossed.",
            "post_id": "12097413",
            "timestamp": "1425208847",
            "user_id": "user_12421463",
            "user_link": "/personal_pages/user/12421463",
            "votes": "0"
        },
        {
            "answer": "I'm about a week past embryo transfer and started to heavy bleed yesterday, I'm scared to do a test but am convinced it's gone, have you got any advice? It would be much appreciated.",
            "post_id": "12213439",
            "timestamp": "1426937146",
            "user_id": "user_12730022",
            "user_link": "/personal_pages/user/12730022",
            "votes": "0"
        },
        {
            "answer": "I had 2 frozen 5 day blasts transfered on the 20th of March and a few days later had shooting pains and cramps localised on both sides and since every 12 or so hours I get them for roughly 10 to 15 minutes one side then the other, however today the 29th of March I have started bleeding it is a pink blood at the moment but I feel it is getting darker and the ache is getting worse but I still have the pulling pain on my left side. I honestly do not know what to think. I do know that after my last transfer I feel this will end the same way in a BFN..Good luck to everyone who is in the TWW.",
            "post_id": "12270263",
            "timestamp": "1427599311",
            "user_id": "user_12872054",
            "user_link": "/personal_pages/user/12872054",
            "votes": "0"
        },
        {
            "answer": "I found this site really helpful and everyone sharing their experiences and feelings is really amazing. I had my FET on last 23rd and my test is due on 3rd. Today i had some brown spotting and some burning feeling just like before my periods. It is really hard to be positive and relax as we are trying for a baby for years now. This is really frustrating and i can' t sit tight but there's  no help other than wait and see. Fingers xeD. And again thanks everyone, i know im not alone.Dil 22",
            "post_id": "12298163",
            "timestamp": "1427896060",
            "user_id": "user_12946527",
            "user_link": "/personal_pages/user/12946527",
            "votes": "0"
        },
        {
            "answer": "Hi! I am new to this website. I was so worried as I started bleeding a little bit today and tomorrow is my blood test. I am trying to stay positive but it is very hard as you can all imagine. I have also had bad back pain, nauseous and a burning sensation in my tummy. This is my first ivf cycle.",
            "post_id": "12400818",
            "timestamp": "1428975426",
            "user_id": "user_13207023",
            "user_link": "/personal_pages/user/13207023",
            "votes": "0"
        },
        {
            "answer": "Hi! I am new to this website. I was so worried as I started bleeding a little bit today and tomorrow is my blood test. I also had bad back pain, nauseous and burning sensation in my tummy. I am trying to stay positive but it is very hard as you can all imagine. This is my first ivf cycle.",
            "post_id": "12400865",
            "timestamp": "1428975721",
            "user_id": "user_13207023",
            "user_link": "/personal_pages/user/13207023",
            "votes": "0"
        },
        {
            "answer": "I'm new too. This is also our first cycle.I had a 5 day blastocyst implanted on the 14th, things didn't go to plan and i had to go to theatre for the implantation procedure (due to a tight cervix). I noticed a little bit of blood on the end of my Crinone on the 19th, which has now become almost full-blown period-like bleeding, both bright and dark red. I'm still taking the Crinone and have my test on the 24th.... I did a hpt last night (whilst hubby wasn't home) which was very negative. Finding it difficult to stay positive for another 4 days until i do the test.",
            "post_id": "12456192",
            "timestamp": "1429579483",
            "user_id": "user_13352337",
            "user_link": "/personal_pages/user/13352337",
            "votes": "0"
        },
        {
            "answer": "My heart goes out to you both.  A little bleeding can be a good sign...it could be implantation bleeding.  However, it shouldn't be like your period...when you need to change a pad every hour.I had some bleeding the first 5 months, and my twin girls are now 13 months old.I know that it's hard but try to think positive.Good luck! :)",
            "post_id": "12469058",
            "timestamp": "1429721283",
            "user_id": "user_5837857",
            "user_link": "/personal_pages/user/5837857",
            "votes": "0"
        },
        {
            "answer": "I am so sorry......",
            "post_id": "12698853",
            "timestamp": "1432690371",
            "user_id": "user_14053394",
            "user_link": "/personal_pages/user/14053394",
            "votes": "0"
        },
        {
            "answer": "I am new also. I am currently I n my 2ww. The longest wait ever!!!! I transferred a 5d single embie. Today is 7dpt for me. I have experianced light spotting since transfer and yesterday morning had heavier bleeding (bright red in color and a small amount of brownish discharge). As positive as I have tried to remain, I couldn't help but break down yesterday morning. The bleeding stopped and it seemed as if my symptoms weren't as strong anymore. I did cheat. Started to take HPT's after day 5. They have all been negative so far. My reasoning to continue is so I can prepare myself if that is the final outcome. At this point I can't even stop myself from doing them if I tried. Really wish I listened to to my husband and waited till the bloodtest. My first blood test is this Friday. Even after all the pain from progesterone injections, symptoms, and emotions I'm hoping my lucky embie is inside of me handling business. I want to feel like it was all worth something. This is my first Ivf cycle, and I commend all of you ladies that have gone through this multiple times. I am barely making it, but you owe it to yourself to do this. It's so much and life changing. I hope that God can bless us all with positives. With happy healthy deliveries and children. The things we do as women and sacrifices we make takes some serious discipline. God sees that! Please stay hopeful and strong ladies.",
            "post_id": "12736566",
            "timestamp": "1433265266",
            "user_id": "user_14179628",
            "user_link": "/personal_pages/user/14179628",
            "votes": "0"
        },
        {
            "answer": "I am also new.  This is my first IVV cycle, and I did the 5 day transfer on June 23rd. I started light bleeding on Tuesday the 30th, and since then have had a full period.  My doctor tells me that bleeding is not always a bad thing, and to go for my scheduled test tomorrow.  I don't feel pregnant anymore and I feel so discouraged. I have read all your stories and I am being a realistic and feel that it has failed.  My husband is telling me not to read and to keep hope alive, but this is my 3rd day of heavy bleeding.  It is hard for me to be positive.  I am already thinking of how much more money it will be to try again.  It took me so long to save for this even if Insurance is picking up the majority.  I feel like everything is against me.  I wish everyone well and I pray that God helps us understand and keep pushing forward and have beautiful blessings.",
            "post_id": "12898469",
            "timestamp": "1435845610",
            "user_id": "user_14678951",
            "user_link": "/personal_pages/user/14678951",
            "votes": "0"
        },
        {
            "answer": "I am from the United Kingdom, Northern Ireland.  We got a free go at IVF and I felt as though i have been on a conveyor belt, I had extreme pain after my egg collection and transfer, like severe cramping like I have never experienced in my life, went to the RE and they did a blood test said that I had an infection, never heard another thing about it.  Pain continued up until several days before my 2ww was to be over and then everything just stopped and my period came two days before I was due to take a home pregnancy test. Now they havent even bothered calling me to find out the result.  I havent bothered either. Very bad experience.",
            "post_id": "13047596",
            "timestamp": "1438352676",
            "user_id": "user_15088177",
            "user_link": "/personal_pages/user/15088177",
            "votes": "0"
        },
        {
            "answer": "Hi all,This is my first IVF cycle and i had one blast transfered on day 5.On 2dpt i had some dark brown discharge which got lighter and spotted on 3dpt.Now today 4dpt im bleeding red blood like my usual period.I am so worrried as i am still early in my 2ww and already loosing hope after everything! Im currently on 4 pesseries a day n the clinic said that they cannot do much as it is too early! This is very devastating. my period is due next week.I dont know what to think anymore and i dont want to convince myself that this is implantation bleeding because it looks so much like my period.Had anyone bleed early in their 2ww and what was the end result?",
            "post_id": "13137213",
            "timestamp": "1440018366",
            "user_id": "user_15352050",
            "user_link": "/personal_pages/user/15352050",
            "votes": "0"
        },
        {
            "answer": "HI everyone, am new on this site too, I had my egg collection on 27th of sep 2015 and on d 29th I had my Et,  I made 8 eggs after retrival and the 8 were all grade A respectivelly and dey  all made it to 8cells, my doctor congratulated mi and gave mi 4embie and reseved the remaing 4,And on my 12th day I  started having cramps and den brown discharge and dis morning I noticed a brown /black blood, not heavy though but dont knw what to think, tomorrow monday is my  blood test, am being hopeful that God will give mi a goodnews tomorrow cos I dont want to go through dis though procedure and not have  good result. Can anyone tell mi if  dey ever have such experience cos this is my first ivf, tank you and I wish all of us grace of God.",
            "post_id": "13354472",
            "timestamp": "1444551947",
            "user_id": "user_15996173",
            "user_link": "/personal_pages/user/15996173",
            "votes": "0"
        },
        {
            "answer": "Hello everyone, I'm 8 days after 3 day transfer,  have AF pains since 3 days,nervously checking if it arrived! promised not to POAS to not to \"kill the dream\" and just patiently wait for my beta on Monday...very nervous with those abdominal pains...",
            "post_id": "13526626",
            "timestamp": "1449695403",
            "user_id": "user_16604945",
            "user_link": "/personal_pages/user/16604945",
            "votes": "0"
        },
        {
            "answer": "Hi, I had my ET on the 24th, 8 days ago. I had sharp pains on my right side yesterday, and today I'm spotting. Fearing the worst, I looked up this site. Now I'm hoping my 2 little embryos are still in there. Our other embryos didn't make it. If this doesn't work, we'll have to apply for another loan and do it all over again. My bloodwork begins on Tuesday. Please pray, somebody.",
            "post_id": "13645786",
            "timestamp": "1454274770",
            "user_id": "user_17169261",
            "user_link": "/personal_pages/user/17169261",
            "votes": "0"
        },
        {
            "answer": "Hey ladies,I'm currently on day 11 of my 2ww, I started heavy bleeding today very scared and tearful, I called the clinic who said to carry on with the progesterone and still go for my blood test which is on Thursday but she also said that if it is a period I'm having its very unlikely that my little embie has made it, I feel so numb! Not very hopeful now! I still have 4 frozen embies to try again if it hasn't worked, is all so draining! I wish all you ladies luck with your goes x",
            "post_id": "13646985",
            "timestamp": "1454320965",
            "user_id": "user_17175010",
            "user_link": "/personal_pages/user/17175010",
            "votes": "0"
        },
        {
            "answer": "I'm on my 12th day after a 3d 2 embrios transfer and had no spotting and no symptoms yet. My blood test is in 3 days and I don't know what to expect because the 2 times I got pregnant naturally I had very sore breasts and was peeing a lot very early,before I tested. I'm still hoping that no sign is a good sign. I lost the other 2 prenancies and I only have 1 embrio left. Please pray.",
            "post_id": "13871883",
            "timestamp": "1464741227",
            "user_id": "user_18421236",
            "user_link": "/personal_pages/user/18421236",
            "votes": "0"
        }
    ],
    "post_id": "8478284",
    "question": "Hi, I'm new to this site and I'm on my first ivf cycle. I had my embryo transfer on 17/10/12 and i've been taking theprogesterone. I'm on my 9th day now and wed evening i had spotting like brownish pink blood. then yesterday(thusrday) morning still same then it turned to a heavy period. I spoke to my doctor and he said it should be a good sign that my period came it means that the embryo is starting implanting however he said my period came earlyand its not due in 5 days. So he's not sure if it really works or not but to wait on my blood test this.coming monday.I'm still bleeding a little bit right now but it's not heavy anymore. I'm now worried that it didn'T work coz  actually had heavy period. Also i tried home preg test and it came up as neg i know its too early but I just hate this feeling of wondering if its all good or not.is there anyone had similar experience and still got pregnant despite having heavy period just before their blood test? also i have no symptoms of pregnancy right now except for cramps probably period pain only. Hoping someone cannhelp or give anlittle bit of advice.",
    "timestamp": "1351845428",
    "title": "heavy bleeding on 8th day after embryo transfer",
    "user_id": "user_4259595",
    "user_link": "/personal_pages/user/4259595"
}