{
    "answers": [
        {
            "answer": "I had never heard of it so I looked it up. Here is what I read:HELLP syndrome is a group of symptoms that occur in pregnant women who have:H -- hemolysisEL -- elevated liver enzymesLP -- low platelet countSymptomsHeadacheNausea and vomiting that continues to get worseUpper abdominal painVision problemsTreatmentThe main treatment is to deliver the baby as soon as possible, even if premature, since liver function in the mother gets worse very quickly. Problems with the liver can be harmful to both mother and child.CausesHELLP syndrome occurs in approximately 10% of pregnant women with preeclampsia or eclampsia. HELLP syndrome is associated with more serious cases.Many women have high blood pressure and are diagnosed with preeclampsia before they develop HELLP syndrome. However, in some cases, HELLP symptoms are the first warning of preeclampsia and the condition is misdiagnosed as hepatitis, gallbladder disease, idiopathic thrombocytopenic purpura, or thrombotic thrombocytopenic purpura.Tests & diagnosisDuring a physical examination, the doctor may discover upper abdominal tenderness, especially in the right upper side. The liver may be enlarged.Liver function tests (liver enzymes) may be elevated. Red blood cell and platelet counts may be low.PrognosisWhen the disease is not treated early, up to 25% of women develop serious complications. Without treatment, a small number of women die. The death rate among babies born to mothers with HELLP syndrome varies and depends on birth weight and the development of the baby's organs, especially the lungs. (See also: Prematurity)Please keep us posted. This sounds pretty serious, so hopefully you do not have it! Good Luck!!!",
            "post_id": "4856833",
            "timestamp": "1252594362",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "Jen- hope everything is ok.   Did you have an appt and they are sending you to L&D or what happened?",
            "post_id": "4856840",
            "timestamp": "1252594457",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "Had low platelet count last Tuesday. That, combined with all of a sudden upper right quadrant pain that started Saturday, new nausea and headache. Not to mention, they now know that my elevated liver enzymes, dangerously high BP, severe edema and neck pain WAS HELLP syndrome after I had Brody. I may not have HELLP, but they want me to go to Labor and Delivery to monitor me, my BP, baby and draw more blood. My drop in platelets is a concern. I hope it's nothing. I really, really do. I want a healthy, FULL TERM baby!",
            "post_id": "4856855",
            "timestamp": "1252594707",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Jen,  I hope all goes well today at your appointment!  praying that it isn't HELLP!",
            "post_id": "4856868",
            "timestamp": "1252594964",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "Please update us as soon as you can.  We will be thinking of you.",
            "post_id": "4856874",
            "timestamp": "1252595092",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "I am so worried now! I hope everything is okay.",
            "post_id": "4856889",
            "timestamp": "1252595416",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "OH Dang Jen! Let us know what you find out.  Praying for a FULL TERM!!",
            "post_id": "4856893",
            "timestamp": "1252595471",
            "user_id": "user_121828",
            "user_link": "/personal_pages/user/121828",
            "votes": "0"
        },
        {
            "answer": "Me, too. Which won't help with the BP, so trying to stay calm. I go at 2, since it's not a serious emergency and I want to finish up some things here at work just incase they don't let me come back. I don't want to get in trouble for being a slacker! ;)",
            "post_id": "4856896",
            "timestamp": "1252595542",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "There are a few people that have my cell number so I can text or they can text if you haven't heard from me. I'm sure it's fine though!",
            "post_id": "4856899",
            "timestamp": "1252595579",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "lol....omg, I can't even imagine if my employer had to walk up to my desk and handle things if I suddenly had to be absent lol It is always good to try and make things organized and finished up lol",
            "post_id": "4856901",
            "timestamp": "1252595615",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "LOL...yeah Cheyenne, I've been waiting for my nesting instinct to kick in at work but it hasn't happened yet! I guess I will get as much done as I get done and then I'll ask my coworker whom I am close with to cover my a$$ with the rest (if need be)!",
            "post_id": "4856916",
            "timestamp": "1252595844",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Oh my gosh, Jen! I hope all is well with you and baby Stam! You're in my thoughts and prayers today! I'll have my phone on me all day long....feel free to text me! (((((hugs))))))",
            "post_id": "4856925",
            "timestamp": "1252595969",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "lol...it is always good to have a coworker backing you up! I would do the same thing with my office mate :-) Just handle what you can, and once you step out of that office to go to the doctor, forget about work and just focus on you and a healthy baby. Everything will fall into place :-)",
            "post_id": "4856929",
            "timestamp": "1252596030",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "K, got your text Jess so when I do go I'll send you updates (:",
            "post_id": "4856942",
            "timestamp": "1252596217",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Yours too, Tator ;)Of course, I can't get a hold of Ben! He NEVER answers his phone and it's royally pi$$ing me off right now! I'm sure I'll get a call back from him before 2 though and I have to keep reminding myself that it's not an emergency. Not immediate anyhow.",
            "post_id": "4856955",
            "timestamp": "1252596359",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "So as I'm reading about Jen looking like a slacker my boss comes in to see what I'm working on.    Luckily he has a sense of humor and knows I spend alot of time on the internet.",
            "post_id": "4856968",
            "timestamp": "1252596514",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "Jen,  I had high BP with both kids,  Tommy wasn't allowed (per my docs instructions) to go out of town for the end of both pregnancies, and my doc didn't let me go past 37 weeks because of it...  he said I was so high I could have had a stroke at any time... SO...  I actually had to talk to one of Tommy's students (his student helper for his basketball team) and tell the kid,  you carry Coach Green's phone with you at all times, and if I call you answer it....  got it...  Tommy thought that was funny-  but it worked-  Taylor came 4 weeks early unexpected-  I was able to get him on the phone right away!  :)",
            "post_id": "4856983",
            "timestamp": "1252596716",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "LOL!  that is why I set my office up where I am facing my door and my computer's back is to the door!  :)  and my actual boss is in Missouri...  I am in Texas....  so that helps too!",
            "post_id": "4856989",
            "timestamp": "1252596780",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "I finally got a hold of Ben and he has Brody. We aren't sure how they would feel if we brought him up there so I think I'm just going to go alone and then call him if he needs to be there.Oh, and I have a screen glare cover on my computer so to see what's on it you have to be right in front of it. It just looks like a black screen to anyone entering my office (: It works!",
            "post_id": "4857049",
            "timestamp": "1252597779",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "It's probably better if Brody isn't up there.  A toddler in a confined space can be stressful for all of you!    Are they planning to keep you for only a few hours and see how things look or do they want you to stay overnight?",
            "post_id": "4857089",
            "timestamp": "1252598450",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "I will keep you in my prayers! Please keep us posted or have someone that has your cell keep us updated! I am worried about you! Stay safe and God Bless",
            "post_id": "4857093",
            "timestamp": "1252598578",
            "user_id": "user_290867",
            "user_link": "/personal_pages/user/290867",
            "votes": "0"
        },
        {
            "answer": "Hope everything is Ok!!",
            "post_id": "4857099",
            "timestamp": "1252598737",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "I'm not sure. My doctor just called me because they told her about it. She wanted to make sure I was going up there. I'm sure they will draw my blood, take my BP and urine and if my BP and urine are okay they will probably just let me go home until the blood test results come back. If those come back elevated of if my platelets have dropped any I'm sure I will have to go back and possibly talk about delivery or bed rest. My doc told me I may have to do bed rest anyhow. I've never had bed rest and don't think I would do well at all. Especially with a 2 year old and I am a person that never, ever sits still!",
            "post_id": "4857108",
            "timestamp": "1252598841",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "how far along are you?i didn't find out til this delivery that my preeclamsia progressed into HELLP last time. the anesthesiologist said \"i see you had HELLP with your last pregnancy.\" my ob scheduled a c-section for that very day ,but i was 36 weeks exactly.honestly, it sounds like you may have it based on your symptoms. hope everything is OK...",
            "post_id": "4857356",
            "timestamp": "1252603310",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "I'm 30 weeks tomorrow. I didn't find out I had it after I delivered Brody, either, until today! I want to know why they didn't tell me when I was absolutely MISERABLE after I delivered him, and had severe neck pain, dangerously high BP, a pulse in the 30's, elevated liver enzymes and severe edema! I have been trying to get them to listen to me and now all of a sudden I am being taken seriously with my low platelets and these new symptoms I have. They told me I am more likely to have it this time since I had it last time. I am sure things will be fine, but I'm glad they're finally taking it seriously and testing me now based on these symptoms and finally bothered to look at what happened last time!",
            "post_id": "4857384",
            "timestamp": "1252603723",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Well Jen, if they do have to deliver early, Ashtyn was born at 31 weeks and did pretty well. He was 3 lbs 15 oz and was in the NICU for 6.5 weeks. I hope that everything is okay, but just take it an hour at a time :-)",
            "post_id": "4857774",
            "timestamp": "1252610082",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "i was actually thinking about you yesterday... I remembered you had posted about platelet counts and was wondering if they figured it out. The reason I thought of you was because I had my follow-up incision check yesterday, and my OB was outlining what we were going to do at my next appointment. In addition to flu shots and such, he wants to do a blood count because apparently my platelets dropped during this pregnancy as well. I am normally over 200, and during the pregnancy they dropped to under 140. The day after delivery, they had dropped to below 100. I had no clue. He wants to make sure they have come back up. Anyways, that made me think of your post. By the way, he didn't seem too concerned, and obviously this pregnancy wasn't affected by the drop in platelets. Probably why he did so many darn blood tests, especially towards the end, in addition to seeing me every 2 weeks throughout the entire pregnancyanyways, wanted to let you know it may not be serious, but i'm glad they're listening to you. the other symptoms are alarming. hope everything went well.",
            "post_id": "4858050",
            "timestamp": "1252614584",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "Hi girls! I just got a text from Jen! Her BP is looking fine so far and she is still waiting on the labs to come back, but has a good feeling that they'll be ok other than the platelets. She also said it looks like they will be reducing her hours at work.Fingers crossed all goes well for her!! I'm sure, after the complications with Brody, all she wants is a perfectly normal, healthy baby and pregnancy!",
            "post_id": "4858109",
            "timestamp": "1252615805",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "We are all pulling for her! Glad her BP is good today, which helps :-) Hopefully the blood work comes back okay!",
            "post_id": "4858116",
            "timestamp": "1252615868",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "Only just checking in on this one. Pass my best wishes on to Jen. I think she needs to slow down a bit so she can enjoy the final weeks of her last pregnancy.Jen when you see this I am thinking of you.XX",
            "post_id": "4858417",
            "timestamp": "1252621691",
            "user_id": "user_127529",
            "user_link": "/personal_pages/user/127529",
            "votes": "0"
        },
        {
            "answer": "Thanks everyone! I went home and put my feet up. My platelets had dropped some, but still not alarmingly low. So, other than that everything else looks fine. SO RELIEVED! I was there for about 3 hours and it was a quick reminder that I will be there again soon. There were mothers giving birth and it got me very excited for that day when I can hold my baby! Of course, my FULL TERM baby! They are going to be doing regular bloodwork and watching me closely. I am bothered by how I am feeling but if they say everything else is okay then I will go with that. Still having upper right quadrant pain and just a general unwell feeling. Nauseous, headache, general malaise. I was nearly in tears last night because even though I DO NOT want HELLP, I would really like to know why I feel so uncomfortable. I was whining about it last night and Ben simply said \"You're pregnant.\" Ugh...yes, obviously...I just never felt this yucky. I shouldn't complain though...I have had a very easy pregnancy so far with no morning sickness or really any symptoms early on. I guess they all waited until the end. Maybe I am one of those women who gets morning sickness at the end of their pregnancy. I have had some pretty severe sciatic pain as well and for that they gave me oxycodone. I've never taken this before and didn't take it last night because I was afraid to. Sounds like they will reduce my hours at work here soon. The chair sitting is making it worse. I feel fine in the morning and as the day progresses it gets bad.Anyhow, just wanted to thank everyone for their concerns and comments. Thanks Jess for updating everyone. I'm so glad everything came out fine!",
            "post_id": "4860108",
            "timestamp": "1252672756",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Glad to hear things are ok for now-  make sure you take it as easy as possible, or it sounds like things could progress to bedrest at some point....",
            "post_id": "4860524",
            "timestamp": "1252681202",
            "user_id": "user_184342",
            "user_link": "/personal_pages/user/184342",
            "votes": "0"
        },
        {
            "answer": "I'm glad things are ok.  I didn't get a chance to comment but I'm sure you were stressed.  Keep us posted.",
            "post_id": "4860580",
            "timestamp": "1252682212",
            "user_id": "user_145992",
            "user_link": "/personal_pages/user/145992",
            "votes": "0"
        },
        {
            "answer": "I am glad that things are going okay for now :-) Hopefully those platelets don't drop anymore!",
            "post_id": "4860590",
            "timestamp": "1252682362",
            "user_id": "user_193609",
            "user_link": "/personal_pages/user/193609",
            "votes": "0"
        },
        {
            "answer": "I am glad to hear everything is ok for now! I will continue to pray for you... God Bless",
            "post_id": "4860878",
            "timestamp": "1252687559",
            "user_id": "user_290867",
            "user_link": "/personal_pages/user/290867",
            "votes": "0"
        }
    ],
    "post_id": "4856816",
    "question": "I am headed up to Labor and Delivery in a little bit to monitor my BP, the baby and do some bloodwork. I might have HELLP syndrome??? Little bit worried...anybody dealt with this before?",
    "timestamp": "1252594035",
    "title": "HELLP!",
    "user_id": "user_167",
    "user_link": "/personal_pages/user/167"
}