{
    "answers": [
        {
            "answer": "The doctor usually doesn't call unless you have it in your system when baby is born. It stays in your system 30 days and amount DOES matter.",
            "post_id": "8673899",
            "timestamp": "1356916303",
            "user_id": "user_4372583",
            "user_link": "/personal_pages/user/4372583",
            "votes": "0"
        },
        {
            "answer": "The drug test came back clean.. meaning the THC is no longer in your system. if it were, the test would have showed the THC. So if it's not in yours it wouldn't be in your baby's system or the placenta. Just focus on the here & now don't worry too much about it.",
            "post_id": "8673914",
            "timestamp": "1356916510",
            "user_id": "user_4122185",
            "user_link": "/personal_pages/user/4122185",
            "votes": "0"
        },
        {
            "answer": "I've never heard of going to the doctor and them doing a drug test on you. That's a first to me. \"my friend told me that it doesn't matter if you smoked once or a thousand times, marijuana will show up in the placenta and in the babies poop\" I have NEVER heard of this. It is not true. A friend of mine smoked A LOT before she knew she was pregnant and is still continuing to smoke it. She has had 4 different ultrasounds and it does not show marijuana in the placenta! Idk where your friend got that info from but its wrong.",
            "post_id": "8673928",
            "timestamp": "1356916602",
            "user_id": "user_4385387",
            "user_link": "/personal_pages/user/4385387",
            "votes": "0"
        },
        {
            "answer": "Well an ultrasound wouldnt reveal drugs & chemicals anyhow.. i have heard of drug tests given on occasional basis of prior history of abuse, but never as a mandatory requirement..",
            "post_id": "8673956",
            "timestamp": "1356916865",
            "user_id": "user_4122185",
            "user_link": "/personal_pages/user/4122185",
            "votes": "0"
        },
        {
            "answer": "No, not ultrasounds, when they pull the afterbirth and send it to pathology I'm worried about it being tested. I googled this question and got many conflicting responces. One site said that the placenta is like the \"motherboard\" and keeps all traces of anything the mother has ingested. Another site said that the babies poop also does this. I don't think the 30 day THC rule applies here, though I wish it did.",
            "post_id": "8673969",
            "timestamp": "1356917099",
            "user_id": "user_4591862",
            "user_link": "/personal_pages/user/4591862",
            "votes": "0"
        },
        {
            "answer": "This is my friends 3rd child. She smoked through all of her pregnancies. I'm sure if the tested anything, they would've confronted her about it but they didn't. I honestly wouldn't be so worried about it. Focus more on your baby and just enjoy being pregnant. Also didn't ask, how far along are you?",
            "post_id": "8673980",
            "timestamp": "1356917287",
            "user_id": "user_4385387",
            "user_link": "/personal_pages/user/4385387",
            "votes": "0"
        },
        {
            "answer": "I was going to ask the same thing..cuz i smoked up until i was 16 weeks and a lady from social services came and told me that my drug levels was high.. i got scared and quit..but the last week of November..i slipped up and smoked a little bit and haven't touched it since..and im due on the 11th..im hoping that everything comes back negative cuz i haven't seen her in a while..this is my first baby and i don't want cps coming to my house..",
            "post_id": "8674015",
            "timestamp": "1356917853",
            "user_id": "user_2135841",
            "user_link": "/personal_pages/user/2135841",
            "votes": "0"
        },
        {
            "answer": "Im 24 weeks along and wasnt worried about this at all until my friend told me abour the placenta thing. I dont want cps coming to my house either. I wish it didnt cost so much to ask a doctor this question so we could know for sure.",
            "post_id": "8674198",
            "timestamp": "1356920446",
            "user_id": "user_4591862",
            "user_link": "/personal_pages/user/4591862",
            "votes": "0"
        },
        {
            "answer": "I don't think they automatically test everyone..But I can tell you (kinda more of a cool fact) that some people get \"false positives\" when tested for marijuana use even if they smoked it months earlier. Some of the THC can be stored in fatty tissues. When you work out, and you happen to work off the fatty tissue the THC is stored in then it can show up in your system. To what extent you'd need to smoke, gain weight and work out I'm not too sure.You'll be just fine! :D",
            "post_id": "8674262",
            "timestamp": "1356921267",
            "user_id": "user_4544384",
            "user_link": "/personal_pages/user/4544384",
            "votes": "0"
        },
        {
            "answer": "Dani: you're fine just don't do it again.Missdale: when I had my first child (before I was a minister) I smoked weed until I was 6 months pregnant. It showed up on all my drug tests but they didn't tell me. After 3 or 4 months, the thc will stay in your babies meconium (poop) anyways they didn't tell me my drug tests were positive and when my baby was born a nurse came in and told me that I couldn't change his first diaper but didn't tell me why so I got mad and when he pooped I changed him anyways and they had put a small little pack with some kind of stuff in it in his diaper. Since they didn't tell me what it was I assumed it was nothing and threw it away. Turns out they were drug testing his poop and didn't tell me so I wouldn't try to tamper with it, but I didn't know what it was and threw it away so long story short, the nurse was really upset with me but there was nothing they could do. I spent the next month at home terrified that someone was going to come take my baby away... DO NOT smoke weed with your baby... They WILL try to harass you about it! After about 3 or 4 months, it WILL show up in babies system! Please listen to me this is no joke.",
            "post_id": "8674275",
            "timestamp": "1356921460",
            "user_id": "user_4396810",
            "user_link": "/personal_pages/user/4396810",
            "votes": "0"
        },
        {
            "answer": "Also not all doctors drug test you, but if you have medicaid be prepared for them to test you. They can and will. Sadly to say people on medicaid usually get treated differently than people with insurance.",
            "post_id": "8674294",
            "timestamp": "1356921619",
            "user_id": "user_4396810",
            "user_link": "/personal_pages/user/4396810",
            "votes": "0"
        },
        {
            "answer": "This really doesn't have anything to do with the actual post.. But as to what Mamacita said that is true.  I weigh a normal amount so I can pass a drug test within 20-30 days, my husband on the other hand is a bigger guy and it takes hime atleast 60 days or more to pass one.  I have no idea about the placenta testing, I have heard they can test it and see ANYTHING for any amount of time but I don't know if that is a myth or not.  I also don't know how many hospitals drug test it, some say it's only if you are on state medicaid, others say it's only if you have a past of drug use and others say all of them do it.  I would just enjoy my pregnancy and not worry about, theres nothing you can do if they do decide to do it.  I have also heard that they wont just take your baby like that even if you do fail for thc because they don't want to break families apart.  I do on the other hand think it is a good thing that hospital test (if they do) because some women will do meth and all kinds of bad stuff while pregnant and a baby deff does not need to be around that.  Good luck though, I am sure everything will be just fine.",
            "post_id": "8674303",
            "timestamp": "1356921725",
            "user_id": "user_2863077",
            "user_link": "/personal_pages/user/2863077",
            "votes": "0"
        },
        {
            "answer": "Des92 is right also they usually won't take your baby away for testing positive for marijuana but you will have to go to classes and be tested weekly in order to keep baby. And state medicaid is the one who tests... I know first hand...",
            "post_id": "8674317",
            "timestamp": "1356922076",
            "user_id": "user_4396810",
            "user_link": "/personal_pages/user/4396810",
            "votes": "0"
        },
        {
            "answer": "If you're on state insurance they test automatically after baby is born, if they suspect it they'll test, and a lot of l&d's will do random drug tests. I've never done marijuana in my life and was a paranoid freak about everything with my 1st so they knew I wouldn't have done anything like that while pregnant, and my son was still tested randomly after birth.",
            "post_id": "8674346",
            "timestamp": "1356922479",
            "user_id": "user_2020005",
            "user_link": "/personal_pages/user/2020005",
            "votes": "0"
        },
        {
            "answer": "@ashley gibson...thank you soo much for that information..i do have medical assistance through the state..it is a shame..i didn't even know they was testing me until that happened..i know soo many other girls who have smoked the entire time..Im trying not to panic waiting until i have my daughter..i know the next time i decide to have a baby..im not smoking at all..",
            "post_id": "8674354",
            "timestamp": "1356922633",
            "user_id": "user_2135841",
            "user_link": "/personal_pages/user/2135841",
            "votes": "0"
        },
        {
            "answer": "It's very very unlikely that they'll test the placenta, that costs a lot of money I'm sure, much more than a simple blood test or meconium test.",
            "post_id": "8674363",
            "timestamp": "1356922787",
            "user_id": "user_2020005",
            "user_link": "/personal_pages/user/2020005",
            "votes": "0"
        },
        {
            "answer": "yeah they usually wont test the placenta but they will test the babies poo.  just honestly keep baby with you the whole time and make sure YOU change the first diaper.  They wont usually take the baby for weed but you will have to go to classes and be tested weekly.  Just make sure you DONT do it again... and when you go to the hospital to have baby make sure read EVERY word of every paper you sign.",
            "post_id": "8674432",
            "timestamp": "1356923809",
            "user_id": "user_4396810",
            "user_link": "/personal_pages/user/4396810",
            "votes": "0"
        },
        {
            "answer": "Oh...i will after reading this..she will be with me the entire time..",
            "post_id": "8674457",
            "timestamp": "1356924064",
            "user_id": "user_2135841",
            "user_link": "/personal_pages/user/2135841",
            "votes": "0"
        },
        {
            "answer": "Honestly i wouldn't worry...yes marijuana is bad to smoke during pregnancy but I think when they do those tests they are looking for more hardcore drugs and im sure they also test levels which indicate how recently it was ingested. I know a girl whos baby tested positive for thc and she didn't get taken away because they didn't feel the baby was at risk being sent home with the parents....I dont think she was using her whole pregnancy tho I think she just slipped up torwards the end and smoked. Dont stress and if the subject comes up tell the truth so they knoe what to expect chances are theyd cut yy a lot more slack for telling the truth",
            "post_id": "8674493",
            "timestamp": "1356924561",
            "user_id": "user_3588173",
            "user_link": "/personal_pages/user/3588173",
            "votes": "0"
        },
        {
            "answer": "Im just nervous now..lol...i could see if i was on some hardcore drugs..thank god I'm not..after my last slip up...i drank sooo much cranberry juice..and tons and tons of water..i was told that the baby could come at Christmas..she still isnt here yet..hopefully everything goes smoothly..cuz honestly im not trying to take any classes and be tested every week..",
            "post_id": "8674509",
            "timestamp": "1356924900",
            "user_id": "user_2135841",
            "user_link": "/personal_pages/user/2135841",
            "votes": "0"
        },
        {
            "answer": "I sent an email to DCFS and this is what I got in return-Hi Danielle,I sent your inquiry to **********, senior supervisor for Intact Family Services. She stated the following “she will not lose her baby after smoking marijuana. DCFS does not accept hotline calls for infants when the mother is positive for marijuana only, and it is not usually true that the marijuana will stay in the baby’s system, placenta or meconium for that long, especially if her initial drug test was negative. It would be true of cocaine, however, if she used cocaine during the last 4-5 months of her pregnancy. I think that is true for heroin, also. She could get a hotline call if she used either of those.  I would, however, encourage her to enter a drug treatment program if she is open to that and really concerned, since  it is not a good idea to use any type of mood-altering substance, alcohol or drugs, when pregnant. And of course, we have programs to treat for drug abuse. If she is really only using marijuana, and has stopped, she might only qualify for a drug education program.”",
            "post_id": "8683582",
            "timestamp": "1357155166",
            "user_id": "user_4591862",
            "user_link": "/personal_pages/user/4591862",
            "votes": "0"
        },
        {
            "answer": "I had alot if blood work done after my first appointment and they drug tested me also but the little bit of marijuana I had smoked didn't show on the drug screening. They did all kinda of tests on me because of preeclampsia with my first baby. But my neighbor smokes cigarettes and marijuana and I haven't seen cps bother her. She has a baby ((almost a year old)) and is due soon with another child. Soo idk. I guess it depends on your dr., state laws, etc.Good luck!",
            "post_id": "8683844",
            "timestamp": "1357159076",
            "user_id": "user_4381292",
            "user_link": "/personal_pages/user/4381292",
            "votes": "0"
        },
        {
            "answer": "My cousin smoked threw her 2 pregnancy nd the bby is super healthy nd she never got told nothin from her doc",
            "post_id": "8683870",
            "timestamp": "1357159588",
            "user_id": "user_4193766",
            "user_link": "/personal_pages/user/4193766",
            "votes": "0"
        },
        {
            "answer": "anyone know about the rules/law in Scotland/Uk???please update",
            "post_id": "8683883",
            "timestamp": "1357159781",
            "user_id": "user_3075809",
            "user_link": "/personal_pages/user/3075809",
            "votes": "0"
        },
        {
            "answer": "**bump**",
            "post_id": "8683889",
            "timestamp": "1357159917",
            "user_id": "user_3075809",
            "user_link": "/personal_pages/user/3075809",
            "votes": "0"
        },
        {
            "answer": "hi I have a quiestion thats just been bothering me iam currently 7 months and 2 weeks pregant. back in november I took a pregancy test afkund out I was pregnant.two months before that I had been smoking weed not knowing that I was preggo when I found out in November 25 2012 I stoped on dat date having smoked since. with dat being said I new that I had to wait to go to the doctor so I wouldn't be dirty.. so I waited intil january I believe the 16 2013 to go to the docotor took drug test an everything doctor never told me anything. last week I ask her about it and she said that I was positive for marijuana and I was shocked.and was like it caint be havint smoked anything since november 2012 den she said dat they were gonna test me at delivery. I was like ok  so when I go back next week I told her to do me another drug test she said ok. my question is when they drug test me in delivery date and iam negative will they still test my baby and if they do will thc still be in his system please help because iam really going crazy about this",
            "post_id": "9129954",
            "timestamp": "1369132768",
            "user_id": "user_5518048",
            "user_link": "/personal_pages/user/5518048",
            "votes": "0"
        },
        {
            "answer": "hi I have a quiestion thats just been bothering me iam currently 7 months and 2 weeks pregant. back in november I took a pregancy test afkund out I was pregnant.two months before that I had been smoking weed not knowing that I was preggo when I found out in November 25 2012 I stoped on dat date having smoked since. with dat being said I new that I had to wait to go to the doctor so I wouldn't be dirty.. so I waited intil january I believe the 16 2013 to go to the docotor took drug test an everything doctor never told me anything. last week I ask her about it and she said that I was positive for marijuana and I was shocked.and was like it caint be havint smoked anything since november 2012 den she said dat they were gonna test me at delivery. I was like ok  so when I go back next week I told her to do me another drug test she said ok. my question is when they drug test me in delivery date and iam negative will they still test my baby and if they do will thc still be in his system please help because iam really going crazy about this",
            "post_id": "9129973",
            "timestamp": "1369133526",
            "user_id": "user_5518048",
            "user_link": "/personal_pages/user/5518048",
            "votes": "0"
        },
        {
            "answer": "hi I have a quiestion thats just been bothering me iam currently 7 months and 2 weeks pregant. back in november I took a pregancy test afkund out I was pregnant.two months before that I had been smoking weed not knowing that I was preggo when I found out in November 25 2012 I stoped on dat date having smoked since. with dat being said I new that I had to wait to go to the doctor so I wouldn't be dirty.. so I waited intil january I believe the 16 2013 to go to the docotor took drug test an everything doctor never told me anything. last week I ask her about it and she said that I was positive for marijuana and I was shocked.and was like it caint be havint smoked anything since november 2012 den she said dat they were gonna test me at delivery. I was like ok  so when I go back next week I told her to do me another drug test she said ok. my question is when they drug test me in delivery date and iam negative will they still test my baby and if they do will thc still be in his system please help because iam really going crazy about this",
            "post_id": "9130013",
            "timestamp": "1369134927",
            "user_id": "user_5518048",
            "user_link": "/personal_pages/user/5518048",
            "votes": "0"
        },
        {
            "answer": "hi I have a quiestion thats just been bothering me iam currently 7 months and 2 weeks pregant. back in november I took a pregancy test afkund out I was pregnant.two months before that I had been smoking weed not knowing that I was preggo when I found out in November 25 2012 I stoped on dat date having smoked since. with dat being said I new that I had to wait to go to the doctor so I wouldn't be dirty.. so I waited intil january I believe the 16 2013 to go to the docotor took drug test an everything doctor never told me anything. last week I ask her about it and she said that I was positive for marijuana and I was shocked.and was like it caint be havint smoked anything since november 2012 den she said dat they were gonna test me at delivery. I was like ok  so when I go back next week I told her to do me another drug test she said ok. my question is when they drug test me in delivery date and iam negative will they still test my baby and if they do will thc still be in his system please help because iam really going crazy about thisok",
            "post_id": "9130022",
            "timestamp": "1369135244",
            "user_id": "user_5518048",
            "user_link": "/personal_pages/user/5518048",
            "votes": "0"
        },
        {
            "answer": "hi I have a quiestion thats just been bothering me iam currently 7 months and 2 weeks pregant. back in november I took a pregancy test afkund out I was pregnant.two months before that I had been smoking weed not knowing that I was preggo when I found out in November 25 2012 I stoped on dat date having smoked since. with dat being said I new that I had to wait to go to the doctor so I wouldn't be dirty.. so I waited intil january I believe the 16 2013 to go to the docotor took drug test an everything doctor never told me anything. last week I ask her about it and she said that I was positive for marijuana and I was shocked.and was like it caint be havint smoked anything since november 2012 den she said dat they were gonna test me at delivery. I was like ok  so when I go back next week I told her to do me another drug test she said ok. my question is when they drug test me in delivery date and iam negative will they still test my baby and if they do will thc still be in his system please help because iam really going crazy about thisok",
            "post_id": "9130026",
            "timestamp": "1369135367",
            "user_id": "user_5518048",
            "user_link": "/personal_pages/user/5518048",
            "votes": "0"
        },
        {
            "answer": "ok im gna be 29 weeks tomorrow \"Wednesday\" I stopped smoking the 2nd week of my 2nd trimester.... November 30 2013 I took 2 very small hits, haven't touched it since... Im due March 18th 2015, will me and my son be ok, will it be in his poop?",
            "post_id": "11791351",
            "timestamp": "1420548653",
            "user_id": "user_11708180",
            "user_link": "/personal_pages/user/11708180",
            "votes": "0"
        },
        {
            "answer": "As long as you quit by 4-5 months it won't be in your system. My friend smiled until 4 months w both her daughters and it was out if her system by the time they were born.",
            "post_id": "11791387",
            "timestamp": "1420549337",
            "user_id": "user_11216963",
            "user_link": "/personal_pages/user/11216963",
            "votes": "0"
        },
        {
            "answer": "I'm scared and nervous, I haven't smoked pot since my 2nd trimester and on November 30th 2014 I had 2 small hits, haven't touched it since, is it gonna come up in my babies placenta or poop by March 18th when he is due?",
            "post_id": "11791402",
            "timestamp": "1420549628",
            "user_id": "user_11708243",
            "user_link": "/personal_pages/user/11708243",
            "votes": "0"
        },
        {
            "answer": "I'm 19 weeks pregnant today, I have smoked pot up till this point. I'm extremely terrified that it will be in my baby's system, and I will lose my son. Someone please tell me if it's gonna be In our systems. This is my first kid, and I don't want to lose him...",
            "post_id": "12008949",
            "timestamp": "1424010082",
            "user_id": "user_12200986",
            "user_link": "/personal_pages/user/12200986",
            "votes": "0"
        },
        {
            "answer": "@mrsohana in the UK they don't drug test you unless they have reason to Ie previous drug convictions, they seem to be so much more relaxed here! My midwife even told me a small amount of marajuana is good for the baby although I didn't and would never smoke while pregnant",
            "post_id": "12009129",
            "timestamp": "1424012470",
            "user_id": "user_12174958",
            "user_link": "/personal_pages/user/12174958",
            "votes": "0"
        }
    ],
    "post_id": "8673890",
    "question": "I smoked marijuana UNTIL I found out I was pregnant, in fact I smoked such a small amount that it didnt even show up at the required drug test at my first appointment. I am now terrified because my friend told me that it doesn't matter if you smoked once or a thousand times, marijuana will show up in the placenta and in the babies poop. Does anyone know if this is true? Will DCFS be contacted?",
    "timestamp": "1356916104",
    "title": "How long does marijuana stay in the placenta?",
    "user_id": "user_4591862",
    "user_link": "/personal_pages/user/4591862"
}