{
    "answers": [
        {
            "answer": "They can grow very quickly.  Mine more than doubled in a few weeks.  I should add, however, that my cyst was likely four or possibly more months 'old' before it was discovered.  Also, you will know if it is growing as the pressure and pain will increase.",
            "post_id": "1354394",
            "timestamp": "1142488800",
            "user_id": "user_80516",
            "user_link": "/personal_pages/user/80516",
            "votes": "0"
        },
        {
            "answer": "Can these cysts be in the ovary?",
            "post_id": "1354395",
            "timestamp": "1142488800",
            "user_id": "user_124296",
            "user_link": "/personal_pages/user/124296",
            "votes": "0"
        },
        {
            "answer": "what if it is behind the uterus? could it be on the uterus?  will they hve to remove it?",
            "post_id": "1354413",
            "timestamp": "1142575200",
            "user_id": "user_122942",
            "user_link": "/personal_pages/user/122942",
            "votes": "0"
        },
        {
            "answer": "I just had my post-op today.  Had an endometrioma removed on my left ovary.  It had been around 6cms and then grew to around 7cms over the pd of a few days a few months back.  Then it held steady as I was getting tests for hypertension - I had it scanned a bunch of times over the pd of 4 mos (from time I discovered it to when it was removed - I know it was there before they saw it on a scan).  I had it scanned less than a month before my surgery to remove it and it had grown quite a bit bigger by the time they removed it.  It was around softball sized.Yes, endo can be in the ovaries and they may not pick it up as a cyst on a scan, but just say one ovary is larger than the other or something like that (if it is in one ovary and not the other).  That's what happened to me years ago when I had an endometrioma.  The other ovary had endo cysts w/in it and it was also removed.  That extent of the endo didn't show up on the scans I had.  It was an ugly surprise during surgery.I had also been scared b/c they were doing doppler for blood flow on the thing when I was getting scanned and it was obviously showing something.  They kept telling me that that's normal, but you know you always think of cancer making its own blood supply.  I found a couple of articles talking about how endo can set up its own blood supply, so I kept trying to take small comfort in that.  Then today at the post-op, the Dr had pictures showing the endometrioma w/ its own blood supply.  Just wanted to share that in case anyone else is freaking out about the blood supply thing being a bad sign.",
            "post_id": "1354410",
            "timestamp": "1142575200",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "We will have to add the bit about endo making it's own blood supply to the 99% speech!  But yes, these things can grow very fast.  Behind the uterus, the dr should be able to move the uterus to get to the polyp.~Tascha",
            "post_id": "1354416",
            "timestamp": "1142575200",
            "user_id": "user_117289",
            "user_link": "/personal_pages/user/117289",
            "votes": "0"
        },
        {
            "answer": "It can be on your uterus, behind your uterus - it can be all over that area.  I had it connecting my uterus to my bowel and the tubes were adhered and my renal artery was adhered - everything was stuck together and it was all over the place.They don't *have* to remove anything that you don't want them to remove.  Remember you are in control of that.  You just make your wishes clear before surgery and consent only to what you want to consent to.I consented to have both ovaries and my uterus removed ahead of time in the event that endo was all over the place (which turned out to be the case) because I am done having children, I'm 44, and I had other health problems which I hoped killing off the endo for good (by taking away estrogen) would help.  This was the best decision for me at this time.  My uterus was only left in b/c it was so involved w/ my bowel that I would have had to have my bowel resected to get it out.When I was younger and had endo, I only agreed to removal of the ovarian endometrioma - not even the affected ovary.  I wanted to have children and I wanted my fertility preserved.  So it's all really up to you and the factors in your life that would influence your decision.  The Drs can give their advice and you can weigh it and get 2nd and 3rd opinions etc.I like to ask Drs what they would do in my situation (if they are a woman) or if it's a man, what they would advise their wives or daughters to do.  It sort of gets them to approach it more personally and think about you as a person w/ a life instead of \"a case of endometriosis\" or other problem.  Then they also are less apt to take your questioning personally b/c they know you are thinking of it on a personal level instead of rejecting or questioning their advice.",
            "post_id": "1354500",
            "timestamp": "1142661600",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "i have bowel problems as well and i am very scared that it is there too.  So if it is what do they do?    I had surgery on my small intestine when i was 10, would the scar tissue attatch to that area?  I am also 28 and have one child and maybe because all that i have been through with this and the whole FMS and CFS i am not sure if I want anymore kids and i guess i can always adopt, should i if they ask to remove everything do it?",
            "post_id": "1354521",
            "timestamp": "1142661600",
            "user_id": "user_122942",
            "user_link": "/personal_pages/user/122942",
            "votes": "0"
        },
        {
            "answer": "JGmom when i was pregnant i felt fine but i really done remember because of the situation i was in , but i can tell you that since my daughter has been born and she is almost three it has gotten worse.  expesually since November.Cornpatchi understand your chronic pain as well i have lived it for almost 13 yrs now.  I dont care what it takes at this moment i want it all gone so that i dont feel like this anymore",
            "post_id": "1354754",
            "timestamp": "1142748000",
            "user_id": "user_122942",
            "user_link": "/personal_pages/user/122942",
            "votes": "0"
        },
        {
            "answer": "Whether to remove everything is a personal decision.  You are so young though.  I don't think personally I would get everything removed at your age unless I was absolutely sure I didn't want any more children.  You are also so young to be in surgical menopause.   I'm 16 yrs older than you, so my decision was different.Also I think the CFS etc can be related to your endo and so there is hope there that getting the endo under control could help with the symptoms of these other problems.Since you are not trying to have children right now, you could always opt to try simulating pregnancy or menopause w/ either BC pills (where you never get your pd) or something like Lupron where you trick your body into believing it's in menopause.  I found the Lupron to be really tough - hot flashes and sweats.  But maybe you wouldn't and you could stand to do it for a few months (they recommended 4-6 for me).  At least that's reversible - you can stop it any time and don't lose organs you can't ever replace.ALso, you may find that once you get surgery, things get better.Did your endo improve as far as you can tell after you had your child?  Many people see a significant improvement after pregnancy, but some people end up w/ a worse case (just like other autoimmune diseases during pregnancies).  I was thinking if you saw an improvement after pregnancy, maybe that would be a clue to try the simulated pregnancy route after you get surgery?",
            "post_id": "1354654",
            "timestamp": "1142748000",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "Just got home from having surgery. I had a 7 cm. mass which was suspicious for ovarian cancer. It thank God turned out to be an endometrioma. It completely took over my left ovary, had started in the right, was in my peritenium and next would be the uterus. I had it all taken out because I am done having children. I am only 38. So that was a hard decision, but you just don't know what you are going to find until you get in there.It can grow VERY fast. My doctor told me mine was there probably no longer than 6 months, most likely only a couple.Hope it helps.Michele K.",
            "post_id": "1354673",
            "timestamp": "1142748000",
            "user_id": "user_125667",
            "user_link": "/personal_pages/user/125667",
            "votes": "0"
        },
        {
            "answer": "Hello , I just signed up for this forum. I have just had surgery for a prolapsed bladder. My Dr. said my ovary had grown to my vaginal wall. (I had uterus removed 2 years ago). I also have fibro,cfs,ibs, and diverticulitis throughout my whole colon. He mentioned I had a lot of adhesions that he removed. sooo painful! I had 2 c-sections over 20 years ago. Anyway, I was wondering is there a differance between endo and adhesions. Especially to that magnitude. I've been bounced from dr to dr for a long time. I've thought that I,ve had endo before, but my dr says no. I'm very depressed and confused. I live a life of pain. If anyone has a comment on this I would so appreciate it. Thanx, Cornpatch",
            "post_id": "1354745",
            "timestamp": "1142748000",
            "user_id": "user_127987",
            "user_link": "/personal_pages/user/127987",
            "votes": "0"
        },
        {
            "answer": "Hi Anyone who wants to listen:I am 38 years old and have two beautiful daughters, 19 and 15. I had my wound taken out at age 29, due due to Endo. I wasn't home a week when I would fall to the floor in pain, they told me it would get better, its takes about 6 months to get over the surgery. I waited patiently, in 6 months I was no better. I switched doctors and the surgery removed my tube due to Endo. The doctor cleaned up my two ovaries because he wasn't willing to take them. I was to young to go through Menopause. At age 32, I asked for another second opinion, It took 5 hours to clean up the bowels and remove both ovaries. She never before in all her years as a doctor scene such a mess. I am now 38, I still have chronic pain daily, when my bowels move I have extreme pain. Twice a month I end up at the hospital, 10 times in worst pain like I am going to start my menstral flow. I can not have sex because of  the pain and I also for the last 6 years have been having yeast infections when the pain onsets. (never before have I had so many). Is this all normal?  Last ultra sound they said was fine. Can Endo be in the bowels and not be seen on the ultra sound. Whats wrong with me?   Blue",
            "post_id": "1897062",
            "timestamp": "1190084975",
            "user_id": "user_279018",
            "user_link": "/personal_pages/user/279018",
            "votes": "0"
        },
        {
            "answer": "",
            "post_id": "1967008",
            "timestamp": "1191953524",
            "user_id": "user_296145",
            "user_link": "/personal_pages/user/296145",
            "votes": "0"
        },
        {
            "answer": "I just signed up for this forum and I read your message of what you are going through.   I'm also 38 and have 4 boys.  I went to the dr. today and was told I have a 4cm endometrioma on my one right ovary.  It hit me hard, because I haven't had any problems in the last five years.  10 years ago I had fibroid tumors removed.  After, a year passed I was told it was endometriosis because of the heavy bleeding and pain.  I just want to know could this disease become cancer?   Now, my options are very small in what to do about this situation.  Can anyone give me some advice.",
            "post_id": "1967071",
            "timestamp": "1191954237",
            "user_id": "user_296145",
            "user_link": "/personal_pages/user/296145",
            "votes": "0"
        },
        {
            "answer": "I realize now most was posted a year ago, are you still looking or listening Blue.  Please someone respond?",
            "post_id": "1967088",
            "timestamp": "1191954480",
            "user_id": "user_296145",
            "user_link": "/personal_pages/user/296145",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with a 4cm endometrioma in July 2007. I had symptoms (indigestion, bloating, pelvis pain etc.) so I consulted with Gyn-Onc for fear of Ovarian Cancer (OvCa).He advised complete hysterectomy for cure of endo and indicated the endometrioma (endo in ovary) will not go away on it's own, but does not turn into cancer.Gyn-Onc did surgery and determined mine was borderline tumor or low-grade cancer/pre-cancer along with endometriosis.So my point it they cannot determine if it is an endometrioma before surgery and pathology.If the endometrioma is causing pain etc., it probabaly needs to be removed.Odds are it is not cancer, but if you are experiencing any symptoms of OvCa, have Gyn-Onc do surgery.Good luck.",
            "post_id": "1967333",
            "timestamp": "1191958112",
            "user_id": "user_224821",
            "user_link": "/personal_pages/user/224821",
            "votes": "0"
        },
        {
            "answer": "Thanks for responding to me.You have settle me down some.  My Dr. called and want to do surgery on Nov. 7.  I'm going to get my last ovary removed along with the endometioma.  Hopefully, everything will go good; eventhough, I'm scared.  I have been cut on three times already, but with prayer things will be okay.Will keep in touch.",
            "post_id": "2006648",
            "timestamp": "1192937140",
            "user_id": "user_296145",
            "user_link": "/personal_pages/user/296145",
            "votes": "0"
        },
        {
            "answer": "From Endo Blue,I have went through the same things has you. Because of Endo and excessive bleeding, they removed the wound, the tubes, and last the ovaries. I hope everything went well for you. My prayers are with you.  I still have excessive pain dailly. My back, sides. I don't know what to do anymore. But I will not stop until someone helps find the answers and cures. I am waiting patiently for answers. I have to have a light put in my bladder now. I am still looking and listening.Blue Endo",
            "post_id": "2382213",
            "timestamp": "1200765215",
            "user_id": "user_279018",
            "user_link": "/personal_pages/user/279018",
            "votes": "0"
        },
        {
            "answer": "Hello All,I found this forum while I was searching for information on colorectal surgery. Here's my story:I'm 48 (my birthday was Tuesday while in hospital) and have two wonderful daughters.I knew I had fibroids and assumed that was causing my abdominal pain, discomfort, bowel changes,etc. I went to an interventional radiologist to see if I was a candidate for fibroid embolization. They did an MRI and found that I had an ovarian cyst 7cm. I contacted a GYN-ONC (my research told me if I was going to have it taken out get a gyn/onc because if it's cancer, they know what else to look for)After doing a CA-125 blood test (slightly elevated at 107-endometriosis can cause this) and after a transvaginal ultrasound he told me he wanted to \"get it out of there.\" 1 1/2 weeks later I had surgery(Jan.25)When he opened me up according to him--he saw a \"big mess.\" The cyst turned out to be an endometrioma. It , and I suppose the related endometriosis ,was attached to my left ureter, and the upper part of my rectum (sigmoid/colon) He ended up calling in a colorectal surgeon to assist and they did a resection with re-enastamosas of the rectum. My surgeons expressed to my family that I must have a very high pain tolerance(I do) to not have been in greater pain/discomfort. I'm not saying I wasn't hurting........All in all things seem to have gone well. They also did a cystoscopy since at one point in the 3-4 hour surgery my urine output decreased. All my female organs were taken out, I am on the mend and taking ibuprofen during the day for pain and percocet at night.I think a few things have helped me with all this: a. I discussed with anesthesia my postop pain control and told them I wanted an epidural. It worked beautifully, and I wasn't gorked out on the morphine pump.b. I'm a nurse and have good connections so I was able to ask for recommendations from friendsc. education/research--find out as much as you can about what you haved..prayer and support from friends and familyI hope this has helped some of you in some small way. If you feel a need to e-mail me with any questions please don't hesitate to contact me at ***@****",
            "post_id": "2456141",
            "timestamp": "1201914784",
            "user_id": "user_406888",
            "user_link": "/personal_pages/user/406888",
            "votes": "0"
        },
        {
            "answer": "about the question how fast endometrioma grow??? i have also endometrioma in my left ovary the size is 8cm x 9cm and it was found last feb 2005 and I dont believe that I have cyst. But when I went to another doctor  last week feb 4,2008 just for a infertility  check up, the doctor says that i need to undergo transvagina ultrasound to determine why it is difficult for me to become pragnant. But the result of my ultrasound is the same in my last ultrasound 3 years ago. I have a endometrioma in my left ovary in the same size...  and I need to undergo surgery this coming march... but i am scared, coz it my first time to undergo surgery.",
            "post_id": "2490650",
            "timestamp": "1202630603",
            "user_id": "user_415265",
            "user_link": "/personal_pages/user/415265",
            "votes": "0"
        },
        {
            "answer": "Reading this column has freaked me out a bit to be honest.  Been having pain since April 2007 (now Feb 2008) and went for a scan yesterday.  Been told I have a 14cm x 8.5cm x 12cm endometrioma (probably right ovary as the radiologist couldn't actually SEE my avary at all).  This seemed very large yesterday and now I have read all of your posts, I am shocked at how large mine is :o(  The radiologist said mine contains blood, with a section of old (solid) blood at the bottom of it.I guess the strong liklihood is that I will have it removed but what is the liklihood of having to have my ovary removed as well?Also, what is the surgical process for removal?  Small or big incision?  Cut out?  Sucked out?  How long would I be in hospital for?  How long is the recovery time?  I know this is a lot of questions, and I am sure that a lot of the answers will be 'it depends', but just an indication would be very useful to me right now.I am seeing my GP again this afternoon and I guess I'll be referred to a Gynae specialist.",
            "post_id": "2504032",
            "timestamp": "1202898819",
            "user_id": "user_418494",
            "user_link": "/personal_pages/user/418494",
            "votes": "0"
        },
        {
            "answer": "Hi.  I had exactly your issue, exactly the same size of endometrioma.  My bowels were becoming blocked, and that is how I knew I had something wrong.  The surgeon told me that likely the ovary could not be saved, and in fact it was not saved.  Because of the size of the endometrioma, and because they could not exclude cancer in my case, it was a mid-line incision about 9 inches long from the top of the pubis to above the navel.  I was in hospital 4 days, including the day of surgery.  I was off of work a total of 10 weeks, because mine was major surgery, during which I was allowed no heavy lifting.  The tumor had adhered to all my internal organs, and had to be scraped off.  Recovery time was approximately 9 months before I returned to my old self.  I had alot of issues with pelvic pain post-op, but this did gradually subside.  I tried to go back to working out at the gymn etc, but this took several months longer than I expected!But your situation may be vastly different.  I was diagnosed with a lump which turned out to \"only\" be an endometrioma.  May you be blessed with a clear diagnosis and an easy time.Jody",
            "post_id": "2507741",
            "timestamp": "1202953429",
            "user_id": "user_419312",
            "user_link": "/personal_pages/user/419312",
            "votes": "0"
        },
        {
            "answer": "Hi thereThanks for your reply - much appreciated even though it sounds pretty horrendous...I have the same feeling that my R ovary will have to be removed.  With something this size, I don't see how it could be saved to be honest.  There seem to be plenty of women who have had smaller ones and they lost their ovary/ies as well.That's a much longer recovery time that I thought it would be, but it's a major op isn't it - like a hysterectomy almost.I had pelvic pain (lower right quadrant) and thought it was gas, grumbling appendix, stress or something til a doc finally prodded me and told me she thought it was fibroids before sending me for a scan where I was told I have a probable endometrioma.I'm tired all the time (probably from the painkillers I'm on) and my skin is a mess.  I feel grossed out by having something that big inside me that shouldn't be there and just want it out!  No wonder I have a pot belly ;o)  At least I can blame it on that now hahaha...  I'm pretty skinny otherwise and have been losing weight for the past year - wonder if it's related...",
            "post_id": "2509156",
            "timestamp": "1202988610",
            "user_id": "user_418494",
            "user_link": "/personal_pages/user/418494",
            "votes": "0"
        },
        {
            "answer": "Yes, the only advice I can give is don't shave yourself before surgery.  I thought I'd \"clear the area\" for the surgeons only to then have a post-op infection that took IV antibiotics to cure.  They told me that shaving causes small micro-abrasions of the skin that let bacteria flourish.  They claim I infected myself.That is why I think I felt so poorly afterwards for 9 months.  The scar tissue (or what ever) would get so sore at the end of the day that I couldn't walk, but that went away, too.  I bought some generic vitamin E creme, and massaged the healed scar with that, and it faded pretty well.I'm out here, psychically holding your hand and rooting for you.Best Wishes, Jody",
            "post_id": "2512991",
            "timestamp": "1203047556",
            "user_id": "user_419312",
            "user_link": "/personal_pages/user/419312",
            "votes": "0"
        },
        {
            "answer": "Very useful advice!!!  Thanks!  Interesting that they didn't warn you of that beforehand...Thanks for your messages, advice and thoughts, I really appreciate it.:o)",
            "post_id": "2523774",
            "timestamp": "1203284554",
            "user_id": "user_418494",
            "user_link": "/personal_pages/user/418494",
            "votes": "0"
        },
        {
            "answer": "I found out I had a R ovarian cyst in 2/04.  My Gyn wanted to do a follow up transvaginal in 4/04.  Seemed OK.  In 8/04 while on a crusie back from NC on our 24' Bayliner I had unbelievable pelvic pain that sent me to the hospital the following morning with other boaters helping us to find the nearest hospital that was closest to the marina we had to go to.  Turns out it was that R ovarian cystagain.  My Dr. has been watching it.  In 12/06 I had another transvaginal done and even asked the technician if she saw any cysts and she said, \"if there were any, I would be describing them to you\".  With that and the fact that I did not hear from my Gyn, told me everything was OK.  Almost a year later during my GYN visit my Dr. said \"I see your mamogram was fine bt I don't see that you had your pelvic exam.\"  I said I abosulely did and the damn place never sent her my report.  I thought \"oh, great\"  this is when I find out I have cancer after all this time I thought that no news was good news.  I can't really blame my Dr. because she didn't knw exactly when I was having my appt. done.  My Dr. called for them to fax her my report. Turns out it looks like a chocolate cyst.  But she wants me to have another pelvic exam since my other was a year ago and if its still there, she suggests a laparoscopy procedure.  Says she most likely can save the ovary and I would be out of work for only a week.Whatever you do, when your GYN orders you to go somewhere for tests or scans.  Please follow up for the results.  Do not assume no news is good news.",
            "post_id": "2589170",
            "timestamp": "1204514508",
            "user_id": "user_437850",
            "user_link": "/personal_pages/user/437850",
            "votes": "0"
        },
        {
            "answer": "I just had my endometrioma removed last week. You have to be proactive about watching your symptoms. I had noticed mine around Christmas. It felt to me like a bladder infection, and we had been tryign to get pregnant. This wasn't working, so I became suspicious. I went into the doctor on Jan.11th because of lower abdominal pain. He said it felt like my uterus was enlarged, but pregnancy tests came back negative. He just sent me home with an antibiotic. i took it for two weeksand the pain subsided. But it gradually came back. The pain increased, and I started to feel the mass in my lower abdomin. By the first week in march when i went back in because I knew somethign wasn't right..... it had grown to 16cm x 15cm. And could be seen and pushed on. It was found on a Friday and I saw a specialist on Tuesday and had laparoscopy preformed wednesday morning. It had grownso fast that it had crushed  my left ovary and falopian tube and attached itself to multiple places. it had also parcially crushed my right side. They had to reconstruct and shoot dy through to see if it was still open, and then wrap my ovary in a protective coating. Thank goodness, as I am only 28 years old, and was just married 6 months ago. We really want more children, and by waiting so long letting it grow, I almost ruined my chances. They said that the mass was the size of large cantalope. My best advice is to stay on top of your symptoms!!!! they can cause other problems!",
            "post_id": "2655847",
            "timestamp": "1205776977",
            "user_id": "user_452949",
            "user_link": "/personal_pages/user/452949",
            "votes": "0"
        },
        {
            "answer": "I'm happy to hear any of your stories, some make me feel better, others make me worry more!  I'm a chronic worrier as it is....I stopped nursing my daughter in August 2006, and that's when my periods started becoming weird.  I had my period while nursing, so it was strange to me that they suddenly would be different, but i just chocked it up to crazy hormones.  About 2 months ago, i had sudden abdominal pain, and thought my IUD was misplaced or something.  The doctor took me that day, did an ultrasound and thought i had a ruptured cyst.  The next day i had a more formal u/s, and they revealed an endometrioma with \"fluid\" on the u/s as well.  They thought it was a bleeding cyst, the blood would reabsorb after a few days and i would feel better.  i did feel better.  After 6 weeks i went for a f/u u/s, and the stuff remains the same.  The cyst is only 2.5 cm, small compared to some i'm reading about!  I go see the MD again on Monday to have my yearly exam and to discuss options.  I think i may go ahead and get a laparoscopy, I'm not concerned about saving the ovary, we're done having kids.  I just worry about this \"fluid\" they see, is the the endometriosis?  I have been reading tons of stuff on the internet, but for some reason it isn't all clear to me!    I'm terrified that it's cancer.  I've had some other medical issues lately, poor circulation in my toes, GERD (which i've had for years), and just constant worry.  Any encouragine words would be appreciated!  BTW, i'm 33 and have 2 kids.",
            "post_id": "2758871",
            "timestamp": "1207764845",
            "user_id": "user_475575",
            "user_link": "/personal_pages/user/475575",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Endometriosis at age 17 when I stopped having my period for 4 months.  At the time I had a 5CM endometrioma that consumed my left ovary and they removed it.  Afterwards I was on BC pills until age 32 which kept any more cysts from forming.  I stopped taking the pill after I got married because my husband and I are trying to have a baby.  We tried unsuccessfully for over a year and I have been recently diagnosed as having an 11 cm endometrial mass with 4 independent cysts growing inside it.  The mass is attached to my remaining right ovary and is behind my uterus.  401 MRI images later they still can not tell how involved my uterus is.  Additionally, I have 3 small endometioma in my cervix and a 4 cm endomitrioma growing at the site of where my left ovary was removed.  Since April 24 the pain has been so excruciating that most days I am unable to walk, and I sit and cry and cry.  Obviously, I have been unable to work and I am out of sick days, and vacaton days.  I've already been told that to stimulate my right ovary prior to surgery is too risky as they don't think I'll make the next 4 weeks, and because they think there is a chance that the endometriosis could be cancer and stimulation would only accelerate and spread cancer should it be there.  I'm devasted knowing that there is now almost no chance of me ever having children.  I'm going to a new Oncology Gyno on Monday, as the current Oncologist I was referred to doesn't even return my calls.  I appreciate reading all your posts and knowing that I am not alone.",
            "post_id": "2770363",
            "timestamp": "1207982744",
            "user_id": "user_478086",
            "user_link": "/personal_pages/user/478086",
            "votes": "0"
        },
        {
            "answer": "just found this site as a couple of weeks ago i was diognosed with endometioma, i had my scan done and they said it was 10-15 cm x 4-7cm. I've had my appointment today and they've said that they won't be able to save my right ovary, but i'm in two minds whether to ask for a full hysterectomy as although i'm quite young i definately won't be having anymore children, i'm quite scared to be honest, we was supposed to be going on holiday in july and i said couldn't i wait till i come back but they said definately not as a probably be rushed in as an emergency case if i left it for much longer.Thanks for listening and if you have any afvice or something i'd be very grateful.Claire",
            "post_id": "2847656",
            "timestamp": "1209567748",
            "user_id": "user_495143",
            "user_link": "/personal_pages/user/495143",
            "votes": "0"
        },
        {
            "answer": "Hi ClaireYours sounds about the same size as mine (15x13x8cms) - also on my R ovary.  Unluckily for me I am in the UK so I am w.a.i.t.i.n.g. for a op date having been diagnosed in early February this year.  I have a max of 16 more weeks to wait for my op but will hopefully not have to wait that long!I am 30 by the way and have no children, so I don't want to have a hysterectomy.  Perhaps it would be unwise for you to have one if its not needed because of losing those valuable hormones and having to go on HRT at such a young age.  maybe some of the other ladies can advise you.  have you spoken to the doctor about the liklihood of recurrance?  If the liklihood is very low then would you still want a full hysterectomy?Can I ask you what kinds of symptoms you have?  I created a post herehttp://www.medhelp.org/posts/show/461615but no one has replied yet :o(  I just want to know if some of my symptoms might be caused by other things?Hope this helps!G",
            "post_id": "2851316",
            "timestamp": "1209629074",
            "user_id": "user_418494",
            "user_link": "/personal_pages/user/418494",
            "votes": "0"
        },
        {
            "answer": "i have endometrioma right now..its less than 3cm but im kinda worried b/c i want to have children...i want to know if its safe to get pregnant while having endo...",
            "post_id": "2895191",
            "timestamp": "1210595035",
            "user_id": "user_505652",
            "user_link": "/personal_pages/user/505652",
            "votes": "0"
        },
        {
            "answer": "i had my only child 1988 by a c-seaction and later on a year later i was in so much pain in my abdominal pain and pelvic pain by 1992 they had to take my tubes burn them and a mess of endometriosis and then regrown back by 1994 and had to do a laparoscopy and i never stop hurting and in 2006 came back again and had to do surgery again and by 2007 i had a hysterectomy cause endometriosis was so thick and all over my insides and then same year had to take out my appendix endometriosis was cover over it same year had to have my gallbadder taken out two weeks after that one and went to my bowels next now 2008 i have endometriosis again at my abdominal area again and it has already regrowing back again i stay in pain most of my life now and cry alot cause they can't find a cure for it they have been looking for a cure since 1920's that i have research the only thing they know to do is to be cut open over and over and i found out that it can go to your eyes and to your brain so please research this as much as yall ladys can i am so scared cause now i have blood running down my throat and they are going to  have to go do and esophagus hope it is not in my throat too so please keep a book and write down evey where you hurt and the date thats what i do the doctors said that helps alot to keep up with your pain so before you take that pain pill write down where you are hurting at that could save your life  just a thought that i do but i stay so deppressed and cry alot cause i am so scare that it is going to get to my brain then it don't say if you live or not guess they don't want to write that part   thanks for letting me write my true and sad story",
            "post_id": "3142600",
            "timestamp": "1215756321",
            "user_id": "user_558527",
            "user_link": "/personal_pages/user/558527",
            "votes": "0"
        },
        {
            "answer": "I have had a complete hyst due to endeme but heres the problem they found a new growth where my ovary was I have gained so much weight and I have done everything to take it off but nothing works someone told me that they had the same problem and had it taken out and they went back to normal is that true and do I have to worry obout cancer I have to go see a tumor specialist im scared half to death please any onecallie",
            "post_id": "3220616",
            "timestamp": "1217461202",
            "user_id": "user_575790",
            "user_link": "/personal_pages/user/575790",
            "votes": "0"
        },
        {
            "answer": "Endometriosis : what is endometriosis?  check this site out it might help on some things that are going on in your body i read everything i can on endometriosis cause i have had so many surgrey's since 1992 to 2008 and still have it regrowing again Doctor said just read as much as you can on this and please anything you know that might help me please let me know  living in pain with endometriosis",
            "post_id": "3249814",
            "timestamp": "1218080004",
            "user_id": "user_558527",
            "user_link": "/personal_pages/user/558527",
            "votes": "0"
        },
        {
            "answer": "I had endometriosis and a partial hysterctomy in oct of 2002.  The doctor removed all but my left ovary, b/c he felt he had gotton all the endometriosis removed.  However in Jan of 2003, we discovered that it now was on my left ovary.  Today, the mass is 13cm (grown by 5 cm) and on the last visual (2006) it was attached to my colon, bladder and small intestines.  Now they are worried about cancer.  I am worried about how difficult the surgery will be to remove all the endometriosis without damage to other organs.  I am not sure if I should have surgery or not.  Has anyone elso been faced with the same situation and can share the outcome of their decision.",
            "post_id": "3258076",
            "timestamp": "1218251232",
            "user_id": "user_584538",
            "user_link": "/personal_pages/user/584538",
            "votes": "0"
        },
        {
            "answer": "HI thereI've just had a large endometrioma removed, plus removal of ovary and endometriosis scraped off.  Mine was stuck to my bladder and uterus (though I didn't know that at the time).   I just wanted to let you know that I am well on the mend.  I'm only young so there was not a high risk of cancer for me.I know this is probably not a very helpful answer for you.  I am sure that there are lots of ladies here who have more similar stories.Good luck :o)",
            "post_id": "3258760",
            "timestamp": "1218275397",
            "user_id": "user_418494",
            "user_link": "/personal_pages/user/418494",
            "votes": "0"
        },
        {
            "answer": "i just had a full hysterectomy for endo - i had only one ovary left after having one ovary and an endometrioma removed a couple of years ago.i had extensive endo which was also on my ureter, bowel and alot of adhesions.i had a laparotomy so a bigger incision than one done w/ a laparascope since i had so many adhesions etc and this enabled the doctor to see everything and get as much of the endo as he could w/o organ damage.the only way your doctor is going to know how extensive the endo is is to take a look surgically.  what is it about your situation that makes them worry about cancer?  in term of whether or not to have the surgery..........you know my answer by my history....absolutely esp if they're questioning cancer",
            "post_id": "3259398",
            "timestamp": "1218296237",
            "user_id": "user_454203",
            "user_link": "/personal_pages/user/454203",
            "votes": "0"
        },
        {
            "answer": "i would like to know if any one of yall have drawed disability or s.s.a. that was not able to work with the pain that we all are in  just wondering can some one answer this one for me i have had endometriosis since 1992 and still now in 2008 and still in bad pain can anyone anwer this for me and i thak you for listen",
            "post_id": "3261083",
            "timestamp": "1218339899",
            "user_id": "user_558527",
            "user_link": "/personal_pages/user/558527",
            "votes": "0"
        },
        {
            "answer": "I have had endo, since 1992 to 2008 and have lost most of my insides due to this and still having more surgrey's to this day it just seems like there is nothing left inside of me now and I stay in pain everyday and night is there a ending to this cause I have hunted and hunted and all I can find is they have not found a curr since 1920's but being cut open and removing it and the inside body part , I am trying to get on S.S.A  now has anybody else got on it yet just wondering .  anyone that can help me with this please write me back thank-you all",
            "post_id": "3438689",
            "timestamp": "1222130655",
            "user_id": "user_558527",
            "user_link": "/personal_pages/user/558527",
            "votes": "0"
        },
        {
            "answer": "I am 27 and have stage 4 endo.  I had a right oophorectomy in Jan 07 when i was 26.  it was an emergency surgery; we had it planned for february, but my ovary decided to take matters into its own hands and the endometrioma ruptured.  my dr originally tried to go in laparoscopically, but ended up doing the laparotomy due to all the adhesions, all the organs being stuck together and the size of the cyst (they said it was cantaloupe-sized).  i didnt have children at the time, and since my left ovary also had a softball-sized cyst, they couldnt promise i would wake up with any ovaries left.  naturally, this freaked me out along with my mom and fiancee, but the dr didnt know until she got in the abdomen.  i ended up keeping my right ovary and thank god i did!  after my surgery, i went on Lupron for 4 months and it sucked terribly.  i am not looking forward to real menopause!  after the lupron, i immediately began an in-vitro cycle, this being the only way my drs thought i would get pregnant and not knowing how long my left ovary would hold out.  i was the youngest person at my infertility drs practice going through in vitro!  we had 2 embryos implanted, both took at first, but the 2nd only made it 6 weeks.  i had a really rough pregnancy, with preeclampsia and oligohydramnios (low amniotic fluid).  i ended up being induced at 37 weeks and lcukily, we had a healthy 7 lb girl!  she was born may 9th, and since then i have been on the pill.  i had never takne the pill before, so i was skeptical, but it is incredible how pain-free i have been!  for the first time in 13 years!  now we are getting ready to try to get pregnant naturally, which my gyn says is possible, but not definite.  we will be doing another round of ivf in february if im not pregnant by then since we dont know how much longer ill have my left ovary intact.  it has been a loooong hard road, and it is so hard to have your fertility hanging by a string when youre 27, but just believe there is always help out there!  endo is not the end of everything; it may seem like it when it gets rough, but it will get better someday!  hang in there everyone and good luck to you all :)",
            "post_id": "3446264",
            "timestamp": "1222274159",
            "user_id": "user_630079",
            "user_link": "/personal_pages/user/630079",
            "votes": "0"
        },
        {
            "answer": "WELL MY ENDO, HAS GOTTEN SO BAD NOW I HAVE HAD IT SINCE 1992- AND STILL NOW . WELL THE DR'S HAS SAID THEY CAN'T DO NO MORE SURGERY'S NOW CAUSE IT WILL PARALYZATION ME  THEY GAVE ME A 98% THAT IT WOULD SO NOW I AM GOING TO A PAIN CENTER TO TRY TO GET THE PAIN UNDER CONTROL THEY SAID IT WOULD TAKE A WHILE TO GET THE RIGHT MED'S TO TREAT THE PAIN AND I HAVE TO LIVE WITH THAT IN MY STOMACH LIKE A HALF OF A BASKETBALL NOW CAUSE THEY CAN'T CUT ME OPEN NO MORE NEVER THOUGHT IT WOULD COME TO THIS BUT IT HAS AND IT IS SO HARD FOR ME NOW AND I JUST GOT MARRIED AUG. AND I CAN'T EVEN DO MY WIFLY DUTY'S NOW I CAN'T BEND OVER OR LIFT THINGS I CAN'T EVEN CLEAN HOUSE LIKE A MOM CAN DO I CRY SO MUCH NOW CUASE I JUST FILL SO LOST IN THE WORLD NOW I CAN'T EVEN WALK IN A STORE NO LONGER THEN 15 MINUTES OR SO AND I START HURTING SO BAD ............WELL I WISH ALL OF YALL THE BEST OF LUCK AND HOPE AND PRAY THAT THEY FIND A CURR ONE DAY FOR THIS SO WE ALL CAN BE OUT OF PAIN ONE DAY ......THANK YOU ALL FOR READING MY LETTER      AND THE BEST OF LUCK TO YOU ALL AGAIN",
            "post_id": "3597459",
            "timestamp": "1225416923",
            "user_id": "user_558527",
            "user_link": "/personal_pages/user/558527",
            "votes": "0"
        },
        {
            "answer": "A related discussion,/posts/show/1463905was started.",
            "post_id": "6659534",
            "timestamp": "1298011878",
            "user_id": "user_1608060",
            "user_link": "/personal_pages/user/1608060",
            "votes": "0"
        },
        {
            "answer": "Ive had endometriosis since i was 16. I am now 39 and had to go through surgical cleanup before getting pregnant with both of my kids. Which, by the way, the drs say they are miracle babies. Both were born early but are 13 and 15 now. I had my uterus removed when i was 26 because it was diseased and connected to my bowel and bladderNow i still get endometriomas on my ovaries after all these years. One even ruptured and hemmoraged and had to be repaired. I have a 3 cm one encompassing my right ovary. I have one on my left ovary that was 3 cm but now has leaked onto my bowel and is growing adhesions. The pain at times is unbearable. Yet, i really dread another surgery. It always comes back and i am so tired of dealing with it. I wouldnt mind losing the ovaries but dr says im too young for that. What should i do?",
            "post_id": "7092508",
            "timestamp": "1311513767",
            "user_id": "user_1746448",
            "user_link": "/personal_pages/user/1746448",
            "votes": "0"
        }
    ],
    "post_id": "1337038",
    "question": "Just wondering if anyone can shed some light on how fast an endometrioma cyst can grow.  I have surgery in May and the cyst as of Jan 21st was 10.20cm can it grow alot more?",
    "timestamp": "1142488800",
    "title": "How fast can an Endometrioma grow??",
    "user_id": "user_122942",
    "user_link": "/personal_pages/user/122942"
}