{
    "answers": [
        {
            "answer": "My doctor told me that you can get pregnant immediately after getting off Mirena but it may take a month or two for your uterine lining to build back up.  Since Mirena suppressed the lining from building up.",
            "post_id": "167772",
            "timestamp": "1160629200",
            "user_id": "user_115438",
            "user_link": "/personal_pages/user/115438",
            "votes": "0"
        },
        {
            "answer": "I had mine out Nov 7th, we waited one cycle for our own reasons, had a chemical pg at Christmas, got my last af on Jan 22nd and am now due Oct 28th : )Andi",
            "post_id": "167777",
            "timestamp": "1160629200",
            "user_id": "user_93532",
            "user_link": "/personal_pages/user/93532",
            "votes": "0"
        },
        {
            "answer": "Congratulations! Did you get AF when IUD was in place? When did your get your first AF after IUD removal?  And did you have any spotting?",
            "post_id": "167779",
            "timestamp": "1160629200",
            "user_id": "user_162948",
            "user_link": "/personal_pages/user/162948",
            "votes": "0"
        },
        {
            "answer": "Hey missy, I've had the IUD in for about 3 1/2 months now. Although we have not taken it for a 'test drive'... still... um, I'm getting spontaneous spotting. Sometimes red and sometimes brown. I dont understand why I'm getting these strange spotting..Sorry to origional poster, I didnt feel it was necessary to open another post. :-)Jen",
            "post_id": "167802",
            "timestamp": "1160715600",
            "user_id": "user_104632",
            "user_link": "/personal_pages/user/104632",
            "votes": "0"
        },
        {
            "answer": "Hey - you're back! How's your little girl?? She must be getting big!",
            "post_id": "167826",
            "timestamp": "1160715600",
            "user_id": "user_99827",
            "user_link": "/personal_pages/user/99827",
            "votes": "0"
        },
        {
            "answer": "Some women will spot throughout the first year with it, but most will see that drop off and will see lighter periods as well. I was nursing for the first full year I had my IUD in, which helped contribute to not having an af. Once I weaned, my period returned, but was extremely light, literally a few days of spotting. When I got it removed, my cycle stayed the same.Andi",
            "post_id": "167840",
            "timestamp": "1160715600",
            "user_id": "user_93532",
            "user_link": "/personal_pages/user/93532",
            "votes": "0"
        },
        {
            "answer": "Girl, take that thing for a test drive! I had sex 3 days after I got my IUD in and it's been a blessing except for the occassional spotting that makes me think its implantation bleeding. I recomend an IUD to everyone!",
            "post_id": "167841",
            "timestamp": "1160715600",
            "user_id": "user_163100",
            "user_link": "/personal_pages/user/163100",
            "votes": "0"
        },
        {
            "answer": "Yep, I'm back! Been super busy with my 4month old and school. :-) Shes doing wonderful. Getting so super big and such a pretty lil thing. Its funny, but she is very polite and well mannered for a little baby. She wakes up with little sweet sounds and is always smiling. :-)And Andi, Congratulations. :-) YAY! any girls yet?I got the IUD in fear of having another baby, but I actually have NO desire to have sex anymore...I think I'm just flat out unattracted to the boyfriend...anyway. thanks. :-)",
            "post_id": "168035",
            "timestamp": "1160802000",
            "user_id": "user_104632",
            "user_link": "/personal_pages/user/104632",
            "votes": "0"
        },
        {
            "answer": "hi everyone i just got the iud put in about 3week ago and my period been on for 2 weeks now...do you know how long it will be on? if i go get it taken out will my period do right off?",
            "post_id": "199176",
            "timestamp": "1183316410",
            "user_id": "user_223575",
            "user_link": "/personal_pages/user/223575",
            "votes": "0"
        },
        {
            "answer": "Hi Umm I didnt do any research before geting the mirena iud... now  am scared because I see that a lot of women have not been able to conceive after the mirena IUD removal... pls help!!! I have had it for 18 months and after all the crazy stories, I am thinking of having it removed :(.",
            "post_id": "1688687",
            "timestamp": "1186368248",
            "user_id": "user_244929",
            "user_link": "/personal_pages/user/244929",
            "votes": "0"
        },
        {
            "answer": "Hi, Angie - there's nothing wrong with the Mirena for most women. I had mine for two years and took it out only because my BF and I are trying to have a baby. The Mirena was the best birth control I ever had in my life!  This is also true of several of my friends. You can technically conceive immediately after the removal, but it may take a little longer than that. Much less time than w/the pill, though. Hang in there.",
            "post_id": "1851590",
            "timestamp": "1188774922",
            "user_id": "user_267539",
            "user_link": "/personal_pages/user/267539",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed in July 2007 and since then my body has not been the same. I noticed that I have a strong odor that smells like old blood and a clear jelly-like discharge whenever I wipe myself. This did not occur immediately after I got my IUD removed. This just started happening.  I went to the doctor ran ever test on me imaginable and they all came back negative. Is this normal? Is it normal my body to go throught this......Please advise.  Thank you!!",
            "post_id": "1905946",
            "timestamp": "1190317520",
            "user_id": "user_281312",
            "user_link": "/personal_pages/user/281312",
            "votes": "0"
        },
        {
            "answer": "I had my Mirena IUD for 2 1/2 years and LOVED it.  I had a only a rew days of spotting the whole time.  However the next thing I knew it fell out.  I took a test the day after it fell out to see if I was pregnant and it was neg. ( I thought maybe that is why it fell out)  How soon can u get pregnant after removal? I had spotting for a couple of days, and now it is the waiting game :) How long should I wait to take another one?  Thanks for any comments I would love that :0)",
            "post_id": "1949602",
            "timestamp": "1191460366",
            "user_id": "user_291721",
            "user_link": "/personal_pages/user/291721",
            "votes": "0"
        },
        {
            "answer": "I had mine removed 7/25/07 and up to now 11/21 I have not been able to conceive and every doctor tell me somthg different the last time they told me it could be up to a year.",
            "post_id": "2128060",
            "timestamp": "1195616878",
            "user_id": "user_339984",
            "user_link": "/personal_pages/user/339984",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed about a week ago and for the last couple days I have had heavy bleeding with clots. My question is if that is normal once it has been removed and how long does it last. I had it in for over a year but wanted it removed because my husband and I are planning for another baby. So I have one more question, how long could it take to conceive once it is removed? and is it safe to try the first month that it has been removed?",
            "post_id": "2137399",
            "timestamp": "1195871604",
            "user_id": "user_342411",
            "user_link": "/personal_pages/user/342411",
            "votes": "0"
        },
        {
            "answer": "I had the mirena in for about 13 months & had it removed end of august to try to get pregnant. I had thought it was more immediate. I found out it can take 3-6 months for your cycle to return. my husband and I are pretty bummed because we would have removed it earlier (or never had it put in).Anyway, I bled a few days after removal (probably due to the removal) & then nothing until a couple days of brown spotting at the beginning of this month. then I had what appeared to be ovulation signs mid month (ewcm for 2 days, pain on right side that felt like an air bubble, not cramps, for 4 days), but then after the signs, a day of nothing, then days of heavy bleeding. that is where I am now, day 4 of bleeding & my cycles before were only 2-3 days. is this normal? if this is my cycle returning, I am at 3 months post iud removal. is it normal to bleed heavier with your first cycle back?any feedback would be great. Thanks!ps- took a couple pregnancy tests along the way, all negative.",
            "post_id": "2153215",
            "timestamp": "1196253891",
            "user_id": "user_346545",
            "user_link": "/personal_pages/user/346545",
            "votes": "0"
        },
        {
            "answer": "i had an IUD put in may of 04 and i had it taken out in the begining of october and i still have not had a period? i want to get pregnant but i am afraid that the IUD messed my body up. am i just impatient? can i still get pregnant even with not having a period??",
            "post_id": "2162652",
            "timestamp": "1196409202",
            "user_id": "user_348753",
            "user_link": "/personal_pages/user/348753",
            "votes": "0"
        },
        {
            "answer": "I just had the I.UD put in yesterday, it hurt pretty bad, the doctor told me that my cervix was unusually tightly closed? Any how, I was wondering how long the cramping will last, it has calmed down, but not gone away. Also I have a thick mucus discharge since insertion and old blood....it's only been a day and a half, but is this normal? Should she have not forcefully inserted it. My mother has me freaked out.",
            "post_id": "2180662",
            "timestamp": "1196803556",
            "user_id": "user_352927",
            "user_link": "/personal_pages/user/352927",
            "votes": "0"
        },
        {
            "answer": "when i had mine put in i had bleeding the next day and spotting the next month then my periods went away completely. the cramping would come and go for the first couple of weeks or 1st month.i posted my last bulletin asking about the pregnancy thing and how long it would take for me 2 get pregnant...well i found out on dec. 1st that i am pregnant so i guess u can get pregnant without having a period.",
            "post_id": "2211830",
            "timestamp": "1197273002",
            "user_id": "user_348753",
            "user_link": "/personal_pages/user/348753",
            "votes": "0"
        },
        {
            "answer": "Congrats!!! How exciting :) And that is good to know!!",
            "post_id": "2220540",
            "timestamp": "1197428432",
            "user_id": "user_352927",
            "user_link": "/personal_pages/user/352927",
            "votes": "0"
        },
        {
            "answer": "i just had the iud out 1 wk and im really want another baby how long will it take before i can get pregnant .. ??  also i heard lol i think its kinda wierd but if u had sex right the day before or the of ur removal u can get pregnant right away .. so how true u think that is..",
            "post_id": "2240986",
            "timestamp": "1197862027",
            "user_id": "user_363842",
            "user_link": "/personal_pages/user/363842",
            "votes": "0"
        },
        {
            "answer": "hey Carrie....I too have an IUD and want to get it removed and I have wondered the same thing...after reading up on it I heard that sperm can survive in your body for 5 days so I guess it would be possible to get pregnant before you ever really had a normal period...let me know what happens.",
            "post_id": "2275595",
            "timestamp": "1198648724",
            "user_id": "user_370379",
            "user_link": "/personal_pages/user/370379",
            "votes": "0"
        },
        {
            "answer": "I had my copper IUD removed Nov. 26th and we're trying to get pregnant...I got what I think was my period on Dec. 22 (4 days later than what I had expected) light spotting and lasted only 3 days...I took a hpt and all three were negative...I'm wondering how long will it take before I come out pregnant...We rae very anxious to have a baby... Any advice will help...Thanks!",
            "post_id": "2282632",
            "timestamp": "1198807618",
            "user_id": "user_368105",
            "user_link": "/personal_pages/user/368105",
            "votes": "0"
        },
        {
            "answer": "I just recently had a baby girl on 20 November 07, I go in for my 6wk postpardom (sp?) checkup next week.  I'm trying to decide what type of birth control method to use and I'm considering the IUD but I just want to make sure its possible to get pregnant afterwards and how long it takes.  I was on ortho tricyclen for 7years straight and the month I got off and started ttc I got pregnant so we were pretty excited.  I just dont want to use an IUD and get it out and it take forever to ttc afterwards.  Any thoughts or advice?",
            "post_id": "2290801",
            "timestamp": "1199009150",
            "user_id": "user_373567",
            "user_link": "/personal_pages/user/373567",
            "votes": "0"
        },
        {
            "answer": "I HATE Mirena!  I must be the \"rare\" side effects group expect now I'm finding tons of people like me.  After insertion, I bled for the first THREE months straight, which after a month I called the doctor and he said it sometimes happens.  From then on it's been an on going mess.  I will have a period then not again for a month or two, then twice in one month!  I have to carry supplies with me all the time.  Now MY STRINGS are gone and I have to have the stupid thing SURGICALLY removed!   I was one the pill for 10 years no problem and got talked into this stupid thing by my OB who I no longer go to.",
            "post_id": "2311057",
            "timestamp": "1199402015",
            "user_id": "user_377513",
            "user_link": "/personal_pages/user/377513",
            "votes": "0"
        },
        {
            "answer": "i had my iud out in the last part of november and been trying for a baby and i still dont know if i am or not but i am bleeding black stuff could i be pregnant? jan i started bleeding for one day and stoped i need help and someone help me try and figure this out i had iud for 4 years. but i dont now if i am pregnant or not",
            "post_id": "2355853",
            "timestamp": "1200242638",
            "user_id": "user_386744",
            "user_link": "/personal_pages/user/386744",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed at the end of August and i got pregnant in October but, i recently lost my baby. After my doctor check me i started to spotting brown or old blood. I was wondering if this early check like had with the insert effected me having a miscarriage. I had four other children and i got check with the heartbeak monitor, to check the baby heartbeat and the finger check, to see if the cervix was closed and then i got check at about 5 months with the insert. so, if someone can explain to me if i was checked wrong or if the insert affected me, let me know.",
            "post_id": "2362042",
            "timestamp": "1200362078",
            "user_id": "user_388248",
            "user_link": "/personal_pages/user/388248",
            "votes": "0"
        },
        {
            "answer": "hi, i had the mirena in for nearly 3 years and although my periods were alot lighter, i had a pain on the left which i put down to the position of the ius etc.having decided i want baby number 3 it was removed in july 07. i conceived immed with baby 1 and 2 (7 and 4 years ago) but we are struggling. each month i feel pregnant and each month i have had an implantation bleed i think but it is as though the fertilized egg can't implant properly.does anyone have experience of this? does anyone know how long the effects of the hormone last on the endometrium?i'm panicking that if i do conceive, i'll miscarry too.any thoughts?",
            "post_id": "2425275",
            "timestamp": "1201613333",
            "user_id": "user_402929",
            "user_link": "/personal_pages/user/402929",
            "votes": "0"
        },
        {
            "answer": "I had the Mirena for 4 years. I had it out 01/07 it is now 02/08... I think that the Mirena IUD has totally messed my cycles and body up. Before the Mirena I had normal periods, now they are 1-3 days if that. I had surgery to clean out my tubes and uterus 07/07. I have also been on Clomid 9'ish months. I have also had 2 ai's. We decided to take the last 2 months off, so my lining doesn't become too thin. I go to the Dr. this week to see what to do next...Has anyone had anything like this happen because of Mirena?Also, like \"Babynumber3\" I feel like my lining is too thin to have an egg implant... Anyones else?Thanks!",
            "post_id": "2446882",
            "timestamp": "1201748486",
            "user_id": "user_404927",
            "user_link": "/personal_pages/user/404927",
            "votes": "0"
        },
        {
            "answer": "I just had mirina removed last week and my husband and i really want another baby soon. I had sex like 3 days after the removal and right after i was bleeding and i had a big blood clot. has anyone ever experienced this?",
            "post_id": "2469581",
            "timestamp": "1202227107",
            "user_id": "user_410288",
            "user_link": "/personal_pages/user/410288",
            "votes": "0"
        },
        {
            "answer": "Hi All:I had my minena removed Jan 23 2008 and am VERY eager to get pregnant.  After reading all the posts it seems like it is common to have irregular bleeding and some clotting post removal.  Some people get pregnant right away even without experiencing a \"real\" period, for others it seems to take months or longer.  I had three days of bleeding the day after removal when I expected to ovulate.  Some light spotting since,  and have been checking ovualtion with no sign so far.  I will keep you posted.  Good luck to you.  I am worried that if it is hard to know what is a period, how do I know when the lining is thick enough??",
            "post_id": "2470114",
            "timestamp": "1202233510",
            "user_id": "user_410407",
            "user_link": "/personal_pages/user/410407",
            "votes": "0"
        },
        {
            "answer": "yea i dont know either, i mean i am not really trying to get pregnant at the moment , i am just not protecting myself from getting pregnant..im hoping and good luck for you as well, maybe we will be prego soon:)",
            "post_id": "2481962",
            "timestamp": "1202438296",
            "user_id": "user_410288",
            "user_link": "/personal_pages/user/410288",
            "votes": "0"
        },
        {
            "answer": "HI! I'm Angela and I had the mirena IUD in for 3 1/2 years and had it removed in December 2007 to try to conceive again. I just found out yesterday I am pregnant about 3 weeks along, so it only took me about 2 months to get pregnant. I got a real period on January 9th and Feb. 9th, so I was regular pretty fast, but I had a lot of pregnancy symptoms immediately after removal and a lot of spotting and brown discharge, which the doctor told me was normal. So now I'm very happy we got pregnant so fast, but I'm also worried.... I hope all will go good!!",
            "post_id": "2611061",
            "timestamp": "1204904403",
            "user_id": "user_442741",
            "user_link": "/personal_pages/user/442741",
            "votes": "0"
        },
        {
            "answer": "I had a Mirena IUD put in after my first child.  I kept it in for a year.  After removal, I got a heavy period about a week later.  I successfully became pregnant on the second cycle.We are now ttc#3.  I had the IUD removed on February 25th.  I got an EXTREMELY heavy w/ lots of clots period 3 days later.  I am currently temping and taking OPK's.  Since this is my first cycle ttc #3 - I don't have any outcomes yet :-)",
            "post_id": "2638114",
            "timestamp": "1205419461",
            "user_id": "user_449005",
            "user_link": "/personal_pages/user/449005",
            "votes": "0"
        },
        {
            "answer": "HAS ANYONE HAD TROUBLE HAVING THEIR IUD REMOVED?!I went in yesterday to have mine removed (implanted for 2 years) and the doctor said she couldnt get it out. She told me that I had to see someone else more experienced.Does anyone know what methods they may use to get it out and will it cause complication later down the road? Should I be worried?",
            "post_id": "2644507",
            "timestamp": "1205522611",
            "user_id": "user_450349",
            "user_link": "/personal_pages/user/450349",
            "votes": "0"
        },
        {
            "answer": "Ok, my husband and I got pregnant three times in 2003, the first 2 ending in miscarriages. The third worked out perfectly. So, we got pregnant with no problem. After we had her, I had the mirena put in in Dec. 04. Had it taken out oct 07, so it was in for about 3 years. No period whatsoever the entire time (thank god). After I had it removed, I had a period the following month, and have had a regular one since. My husband and I have done nothing to prevent pregnancy, both secretly wanting another, but have had no luck. Period still comes like normal. I am now starting to worry that I won't be able to have another? And with my track record, maybe even if I do become pregnant, will I miscarry? I desperately want my daughter to have a sibling close in age, and had I known this would happen, I never would've gotten it in the first place. Any advice, words of wisdom, would be highly appreciated. Thank you",
            "post_id": "2646497",
            "timestamp": "1205553909",
            "user_id": "user_450720",
            "user_link": "/personal_pages/user/450720",
            "votes": "0"
        },
        {
            "answer": "I have had the Mirena in for almost 3 years. My fiance is in the Marine Corps. He will be home for 10 days in April in which we are getting married and wanted to ttc. I am not moving with him til my son gets out of school the end of May. I concieved both my kids on the pill and patch. So obviously i am fertile mertile. I got it put in at my 6 week checkup and bled for about a month. Have not bled at all since then. Everyonce in awhile a few drops when i wipe. I know your period is the lining in your uterus which the mirena keeps it thin so obviously keeps mine to nothing since i dont bleed. I am really concerned now as to how long it is going to take me to concieve. I had a friend who got hers pulled out and got pregnant the next day. Now I really wonder when I should get it taken out. Now or when hes here so we can have sex right away.",
            "post_id": "2657691",
            "timestamp": "1205804254",
            "user_id": "user_453414",
            "user_link": "/personal_pages/user/453414",
            "votes": "0"
        },
        {
            "answer": "I got my mirena in 8/2004 6 wks after my daughters birth ( never had a period) just had it taken out a 3/18/2008.. but the cause of removel  was I've had other health problems that docs couldn't find out whats causing dizzness, legs swealling up, bad acne, excess weight gain and loss. 5 in a day to week 25 lbs.. getting a secon opion on uturin pain she said I had cysit rupture, a bit odd between 3 ob visits had several pregnacy tests done.My concern is on 3/6/08 intercouse lead to a cyst rupturing, the timing of that to lenth of firtlization, implating to removel of Iud 3/18/2008 and having light pink spotting for a week now I am  wondering could I be pregers.....  the tests from the docs were neg but I am very liree, saspisous of them, the timing has the fromula of Posiblities of Pregnecy.. I am just over thinking this..ak2008 off in wondering land... If i am then let it be if not phew but letting my body breath..",
            "post_id": "2677080",
            "timestamp": "1206181039",
            "user_id": "user_457562",
            "user_link": "/personal_pages/user/457562",
            "votes": "0"
        },
        {
            "answer": "I HAD MY MIRENA FOR 4 YEARS I LOVED IT SPOTTED ABOUT ONE DAY A MONTH RECENTLY REMOVED IT 3 WEEKS LATER HAD A NORMAL PERIOD IM NOW 2 DAYS LATE  FEEL PREGNANT BUT 2 TESTS ARE WERE NEG I REALLY WANNA BE PREGNANT ANYONE ELSE WITH SAME PROBLEM WISH ME LUCK AND GOOD LUCK TO ALL",
            "post_id": "2732525",
            "timestamp": "1207238870",
            "user_id": "user_469736",
            "user_link": "/personal_pages/user/469736",
            "votes": "0"
        },
        {
            "answer": "i took mine out myself didnt hurt i didnt feel a thing",
            "post_id": "2740161",
            "timestamp": "1207365817",
            "user_id": "user_469736",
            "user_link": "/personal_pages/user/469736",
            "votes": "0"
        },
        {
            "answer": "How did you take it out yourself? Is that dangerous? I went to the doc and it was difficult to take out. And it hurt.",
            "post_id": "2760579",
            "timestamp": "1207790185",
            "user_id": "user_475957",
            "user_link": "/personal_pages/user/475957",
            "votes": "0"
        },
        {
            "answer": "I recently had my IUD removed, and started to get discouraged after several negative tests. I did a little bit of research, since my doctor never told me what to expect afterwards. It is normal to bleed heavy clumps after it is removed. The IUD works a couple different ways. It does reduce your uterine lining, blocking fertilized eggs from implanting on the uterus, or by creating a mild inflammation which prevents sperm from fertilizing eggs. Some women can get pregnant right after having it removed, but there is a good chance that it wont implant properly, and you will miscarriage. You have a much better chance if you wait a cycle or two, and by your third cycle, your lining should be back to normal. (Not that it hurts to try from day 1!)I read somewhere that several women got pregnant right away, but it wouldn't show up on the pregnancy tests until they were about 3 months pregnant. I asked my doctor about that and she said the IUD didn't have anything to do with the false negatives. Sometimes I feel like maybe they don't really know that much about the IUD, and how it affects a person once it is removed. It does appear to be common to have pregnancy symptoms once it is removed, but I feel (in my case) that it may be due to my lining still too thin, and the pregnancy doesn't last long. Hopefully in another month or so, I'll get my positive sign. =)To all of you out there in \"pregnancy limbo\", it will happen when it happens, and it's best not to stress about it. Just pay attention to your body signs, and keep trying!",
            "post_id": "2818547",
            "timestamp": "1208979584",
            "user_id": "user_488987",
            "user_link": "/personal_pages/user/488987",
            "votes": "0"
        },
        {
            "answer": "I have had the mirena since august 2004 i was sure that i did not want anymore children and actually wanted my tubes tied but due to being 26 my ob/gyn convivnced me to wait the 5 years and if i still felt strongly about not having more kids get my tubes tied. Well my husband and i split up about 2 months after baby # 3 was born and i have been with a new man for nearly a yr now he has no children and adores mine I really want to be able to have a child with him and I am now wanting the iud out to make that happen Crazy to want baby # 4 probably but feel strongly about doing it. This week I had a cyst rupture on my ovary and discovered several on my other ovary which doing research has told me the mirena is probably to blame for this. I am scared to have the mirena removed cuz it hurt so damn much getting it in. I am hoping somone can tell me if it will hurt as much coming out there are just too many side affects from having it in and i cant wait for another baby I have not had any cycles since having it in i'm tolf this is isnt really normal i just assumed it is hopefully someone can tell me if this is ok if this will impact me having another baby and if having it removed will hurt just as much as going in please help! and wish me luck",
            "post_id": "2849173",
            "timestamp": "1209587818",
            "user_id": "user_495468",
            "user_link": "/personal_pages/user/495468",
            "votes": "0"
        },
        {
            "answer": "hi i had an IUD marina in july of 07 until march 31/08 so about 8 months. i had my period when i got it taken out... and i would usually get my period every 28days when i wasnt on an iud. but i got my period a could time within the time i had the iud in.so i'm 2 weeks late now for my period i was wondering if u would get ur period right away or could i be pregnant?",
            "post_id": "2855483",
            "timestamp": "1209698931",
            "user_id": "user_496780",
            "user_link": "/personal_pages/user/496780",
            "votes": "0"
        },
        {
            "answer": "I'm not sure about the cysts, but I do know that it is not nearly as bad having it removed. Basically, you lay on the table, they pull out several scary looking tools, in she goes and literally, a second later, it's out. It did hurt a little bit, but not as bad as having it put in and it was much quicker. I'm sorry you are having to go through this, but if it's causing you problems, it's best to get it out asap. Good luck!",
            "post_id": "2855634",
            "timestamp": "1209702023",
            "user_id": "user_488987",
            "user_link": "/personal_pages/user/488987",
            "votes": "0"
        },
        {
            "answer": "I got the iuc put in dec 05 and just had it removed not to get pregnant just didnt want it anymore on april 1st no joke. I had a period immediatley afterwards that lasted 1 week. On april 21 and 25th i had unprotected sex and now i feel pregnant. I havent yet had another period and went online to find out if i could be pregnant and the mirena website stated you can get pregnant right after having it removed. I am scared and nervous that i am pregnant and will be getting a pregnancy test asap. I was just wondering how long it would take to have a period after the first one.",
            "post_id": "2881536",
            "timestamp": "1210260063",
            "user_id": "user_502555",
            "user_link": "/personal_pages/user/502555",
            "votes": "0"
        },
        {
            "answer": "after the marina IUD for 5 years I am having it taken out tomorrow and really want to have baby #4 i have always get pregnant fast with all my baby's and i get  morning sickness so badly i know i will know when i am pregnant but since my IUD was up in march and it is may i wonder if in theses few months if the hormones are all out of my system and if i can conceive right away? I Pray i do me and my husband are in agreement and are leaving it in Jesus's hands so i know it will all be OK and Levi Rason (thats what we will name our son) will be well on his way =)",
            "post_id": "2896326",
            "timestamp": "1210613371",
            "user_id": "user_505932",
            "user_link": "/personal_pages/user/505932",
            "votes": "0"
        },
        {
            "answer": "I had my Mirena removed last week (8th May) after a year as we are trying for our 1st baby.  During that year I had no periods but v light brown discharge on 20th March for a few days and 19th April for a few days.  I presume these were periods?After having it removed I thought I would be due on around 18th but instead I started getting the same kind of light brown discharge I'd had before on Saturday night (10th May)Does it sound like I could have a 23 day cycle?  is it a period? (it is v v light but my lining would be thin so I guess it could be) or is it just caused by the coil coming out?  Do I count towards my ovulation from that date?  I am worried as everyone else seems to have had heavy bleeding after removal.Any advice would be much appreciated.  x",
            "post_id": "2901480",
            "timestamp": "1210710764",
            "user_id": "user_507084",
            "user_link": "/personal_pages/user/507084",
            "votes": "0"
        },
        {
            "answer": "My son was born 5/17/06, I had my IUD put in at the end of July 06.  I spotted a little after having it put in and my abdomen was a little sore, but I have not have any spotting or bleeding of any kind since.  It has been almost 2 years (about 22 months) since I had it put it and now my husband and I are wanting to have another baby.  Part of me wants to have it taken out now in case it takes a little longer to conceive (we are not wanting to get pregnant right away), but if I take it out now I could get pregnant the first month too....I was on the pill for several years, didn't take it for 1 month and got pregnant.  If I had the IUD taken out now could I go back to the pill until we are ready to get pregnant again?",
            "post_id": "2905155",
            "timestamp": "1210780570",
            "user_id": "user_507843",
            "user_link": "/personal_pages/user/507843",
            "votes": "0"
        },
        {
            "answer": "hello i had the mirena iud fit on 29th of feburary 2008 this year after discomfort on being on deprovera for under a year  my last injection being november 14th 2007...i recently had the iud removed 3 weeks ago to try and concieve baby no 3,sorry if tmibefore i removed the iud i was having brown  and pink discharge within an egg white consitancy.when i had removed the iud i had a light \"fresh\", being that it was red not brown, bled  for five days then nothing for about 9 days later  then got normal  egg white discharge no blod with it which would say im ovulating followed by slight uncomfortable cramps where my ovaries would be and light back paini am still waiting for another bleed if it does not come in another 2-3 weeks im going to give myself a home test just to check if i have not fallen already",
            "post_id": "2923345",
            "timestamp": "1211203811",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "btw i am only 24 years old",
            "post_id": "2923386",
            "timestamp": "1211204674",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "I got my Merina IUD early 03 or 04 (dont remember which) I went into Dr. on April 21 to get checked cause i thought i might be pregnant on it, she did tests, sent me for blood work...and NO pregnancy...which was a relieve to me cause of all the problems you can have with a pregnancy with a IUD in place.  I was lightly spotting on April 18-22....i thought it was my period.  When i went back on May 2nd i was spotting again and she said that it was heavier than on the 21st when she did my pap...i got the IUD out, and bled pretty heavy with clots (i NEVER had clots during the few periods i had with the IUD) and only reason got it out was cause for the last 3 months i had been spotting every week for about 3 days....now everytime i orgasm whether with intercourse or masturbation i spot..just a lil...shows when i wipe and is done. or when i have sex the bleeding returns and then is gone before morning...is this part of the IUD removal, or should i be worried?  Fiance' and i had sex 2 days before removal..and several times after without protection...i think we both secretly want a child.  i have 3 from other relationship...we will be getting married before end of summer, any suggestions as to why the bleeding after orgasm?The side effects i had are; mood swings (would cry over everything and nothing), acne (bad), hair loss(slight, but enough to notice-a brush full every other time i brush hair),the feeling that everyone hates me(i guess that would be anxiety)...and the list goes on and on.  Most of these have cleared up in the 3 weeks it has been out.Although i have had several early pregnancy symptoms i am not gonna do the hpt until after i should miss a period...i am gonna assume that the bleeding at the IUD removal(was bleeding before it was removed)was my period. so if i do not have a period by June 5th...then i will go get a hpt...Wish me luck all, and good luck and god send to all of you...Blows BabyDust to all who want one....",
            "post_id": "2937617",
            "timestamp": "1211399373",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "to answer your question about if you can take the pill between getting IUD out and planning a pregnancy.  From what i understand Yes you can.  I went in on May 2nd to have my IUD removed and she gave me a script for the pill Alessa, sounds more like a name of a person than a BC pill...lol...anyhow i decided to not fill it....so it is my understanding that as long as it works, you CAN use BC Pills until you are ready to conceive....babydust to all.....",
            "post_id": "2937694",
            "timestamp": "1211400541",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "I got mirena removed on april 18th(after only 3 months cuz I hated it) on the 20th I had what it seem like a period that lasted 3 days nothing since then, My cycles used to be 28 days before mirena so I took a tes but it was negative, could I stil be pregnant?",
            "post_id": "2950531",
            "timestamp": "1211665971",
            "user_id": "user_514574",
            "user_link": "/personal_pages/user/514574",
            "votes": "0"
        },
        {
            "answer": "well ive been on the mirena twice now and never had a period whilst having it...when i had it the first time i had it in for about a year and was on deprovera for 2 years prior to that so i did not have a period at all.when i had the mirena removed < more like it fell out into the toilet  after dislodging itself we ttc right away i had no bleeding at all not even after removal... and about 2 months later i concieved my son when he turned 6 weeks  i went back on deprovera from 31st of jan last year till november 14th 2007 which was my last injection ....29th of february 2008 i went on the mirena once more and  27th of april i had it removed to try to concieve no periods again whilst i had the thing inside me however i had light brown spotting 2 days before removal and bled for five days after removal and nothing since then....appart from cramping like ovulation pain ...past 2-3 days i have been peeing alot,breast's sensative but not tender but darker around the nipples and i am feeling very tired i did a pregnancy test last week and it did not show up at all that i was pregnant .it was not till today that my memory was jogged and that i had a feeling of being pregnant with my son but it took another 3 weeks of cramps and feeling sleepy to show that i was pregnant on the home pee on the stick clear blue pregnancy test....it was very very light to begin with you could just make it out then i tried a week later and it kept getting darker till a true definite positive, so yes its possible to be pregnant without ever receiving your period...my advice is to try a week later do not wait for a period ...keep an eye on faint positives",
            "post_id": "2951899",
            "timestamp": "1211706560",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "wow that's crazy! thank you so much for your response. I haven't had my period yet, I feel very quezy and crampy, my lower back is killing me also, so I definately feel pregnant but test keep coming up neg except for one yesterday that showed a very very faint positive line that only I could see, my husband says there is no line whatsoever lol. I guess I'll wait antother week. This is making me so anxious but your response helps a lot so thank you! and congratulations!!!!",
            "post_id": "2955564",
            "timestamp": "1211808789",
            "user_id": "user_514574",
            "user_link": "/personal_pages/user/514574",
            "votes": "0"
        },
        {
            "answer": "...i don't think im pregnant yet :si am however getting the same symptoms too aswell as some of these symptoms  from feeling quezy...my symptoms are peeing allot....cramps..back ache my temperature fluctuating allot...feeling very tired even though i go to bed early....and very thirsty and about 10 mins after having a drink wanting to go again...and a bubbly feeling in my stomach not like butterflys or the feeling of gas but more kinda like electricity,i have not tested yet >.< but i wanted to test in about 2 weeks time to hopefully get a better result....though on a lighter note don't know if this is good or bad but its now been a month since i had the mirena removed and still no bloody sign of a period i within 4 weeks i have done 7 opk tests all seven comming back negative though above the control line theres a very light line....and i had just the same with the hpt i did 2 weeks ago...i think i am due to test again.....will give an update in 2 weeks time baby dust to those trying",
            "post_id": "2956225",
            "timestamp": "1211822344",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "Well I guess we will have to keep waiting.  Good Luck to you'all!!!",
            "post_id": "2957322",
            "timestamp": "1211842636",
            "user_id": "user_514574",
            "user_link": "/personal_pages/user/514574",
            "votes": "0"
        },
        {
            "answer": "I took a pregnancy blood test at the dr' s ofice and it came up negative. No AF stll though. I guess mirena messed me up. I need to see the dr next week to get some pills that will help start my period. Hopefully after that I will gte back to normal.",
            "post_id": "2968056",
            "timestamp": "1212033475",
            "user_id": "user_514574",
            "user_link": "/personal_pages/user/514574",
            "votes": "0"
        },
        {
            "answer": "sorry to hear about the bfn, but hopefully the doc can get ya fixed up and you will have a bfp soon.  Good Luck and keep us posted.",
            "post_id": "2968179",
            "timestamp": "1212035523",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "okay its been a month past removal of the iud for two weeks ive had weird symptoms ...the kind you get during pregnancy.....i want to test but my husband says its too early .....should i wait?",
            "post_id": "2968445",
            "timestamp": "1212043376",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "I had my IUD taken out on May 6 2008. I only spotted very lightly. I have not saw any signs of my period starting. I have a lot of mood swings all the time. But back on March 29th I was in a very bad car wreck that broke my C-2 bone in my neck and my right heal. My heal is a lot better but my neck doesn't seem to be. As anyone just had a few days of just spotting after the removal of the IUD??",
            "post_id": "2969838",
            "timestamp": "1212076957",
            "user_id": "user_521807",
            "user_link": "/personal_pages/user/521807",
            "votes": "0"
        },
        {
            "answer": "I had my IUD taken out on May 6 2008. I only spotted very lightly. I have not saw any signs of my period starting. I have a lot of mood swings all the time. But back on March 29th I was in a very bad car wreck that broke my C-2 bone in my neck and my right heal. My heal is a lot better but my neck doesn't seem to be. As anyone just had a few days of just spotting after the removal of the IUD??",
            "post_id": "2969841",
            "timestamp": "1212076979",
            "user_id": "user_521807",
            "user_link": "/personal_pages/user/521807",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed May 23, 2007 after I had weeks of spotting off and on for about 3 years. Before I had the IUD put In when you looked at me I got Pregnant but it has been year and nothing. My periods come every 28-34 days now  I have pains in my legs when it's time for my montly cycle which I never had before. Let me give you ladies some fact on the IUD. Even though they say that you can become pregnant fast right after removal thats for women who has had it in less then a year. Here what i found out the longer you had the IUD in the longer it can take to become pregnant it can take anywhere from 18-39months to conceive. 90% of women conceived by the 39month just so you know this can be a long waiting game. Because I just found this website and may not beable to find it again you can e-mail at ***@**** with any questions please put IUD in the your subject line .",
            "post_id": "2978875",
            "timestamp": "1212240949",
            "user_id": "user_523565",
            "user_link": "/personal_pages/user/523565",
            "votes": "0"
        },
        {
            "answer": "can i please say that it depends on what iud you have to how long it takes... after doing alot of blooming reaserch i have this fact to be true , it also depends if you were on another form of birth control before an iud as this can also make it harder to concieve...but everyone is diffrent just because one persons body takes a while to concieve that does not mean it will happen to you in the same way.....it also goes down on age also the older you are the harder it gets to concieve.",
            "post_id": "2981806",
            "timestamp": "1212323118",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "i had the mirena in for about 13 months i had it removed april 7th 2008 i had what i thaught was a period april 9th for 7 days like normal i have yet to have another period i am 23 days late ive taken numerous tests which all come back negative .... i dont get it  i have been pregnant 2 other times and concieved very easily the first ended in abortion and the 2nd is now almost 2 years old i am despratly trying to concieve and still no luck . i have pregnancy symptoms all the time though nausea heart burn increases in urinating just about all of them and still no baby what is going on????",
            "post_id": "2981910",
            "timestamp": "1212326582",
            "user_id": "user_524323",
            "user_link": "/personal_pages/user/524323",
            "votes": "0"
        },
        {
            "answer": "maybe you are trying to hard and thats why your period has not come it could be stress , stress can do that....also and i know this for a fact as this happened to me march of 2006 when i found out i was pregnant with my one year old  i had negative tests on cheap hpt's the cheaper ones only pick up the higher amounts of hcg where as if you pay the extra it picks up from 10 rather than 20ml of hcg it could be that you have a low dose of hcg and it is not picking it up try getting a blood test, if the blood test is negative then put it down to stress.",
            "post_id": "2983383",
            "timestamp": "1212356017",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "* update since the 1st*well it is 12/06/2008 i have done 3 test and still all negative on the hpt.....still got heartburn had it for the past 2 weeks urinating more than usual....alot of cramps , ive been feeling tired alot also sore breasts but nothing seems to be comming up on the tests",
            "post_id": "3028900",
            "timestamp": "1213274531",
            "user_id": "user_512054",
            "user_link": "/personal_pages/user/512054",
            "votes": "0"
        },
        {
            "answer": "When my daughter turned about 6 months I had the mirena inserted. I had it in for 2 years and  I had it removed last month (no bleeding adter removal) - 2 weeks later i had a period and then started trying to concieve.  I am now pregnant with baby #2 (2nd cycle after mirena).  So yeah it did not take me long to get pregnant I think how quickly you fall depends on how fertile you were before.",
            "post_id": "3066819",
            "timestamp": "1214077115",
            "user_id": "user_542225",
            "user_link": "/personal_pages/user/542225",
            "votes": "0"
        },
        {
            "answer": "I HAD MY IUD TAKEN OUT ON JUNE 6, 2008. HAD ONE DAY OF BLEEDING AFTER, BUT NOTHING SINCE. MY DOCTOR TOLD ME I COULD GET PREGNANT BEFORE I EVEN GET A PERIOD. MY SISTER IN LAW AND A FRIEND OF HERS BOTH HAD IUD'S AND BOTH GOT PREGNANT RIGHT AWAY AFTER GETTING IT REMOVED. BOTH WITH TWINS.",
            "post_id": "3086669",
            "timestamp": "1214500335",
            "user_id": "user_546623",
            "user_link": "/personal_pages/user/546623",
            "votes": "0"
        },
        {
            "answer": "update....it is now june 26,08...i had merina out may 2,08...started bleeding day i went in to have it removed and a total of about 4-5 days.  i didnt have much other spotting aside from after orgasm (first week or so) until june 9th when i had a little bit of brown spotting and then later that night a little bit of pink...june 10th af full swing.  lasted til about 3 pm on june 12th and then bled for a few hours on june 14th...other than that nothing.  i am now CD 17 and have had no real signs of ovulation aside from wet cm...in may i had ewcm on cd 20...so maybe the IUD extended my cycle days...from a normal 28-30 day cycle to a 38-40 day cycle...which would stick completely.  anyhow good luck to all of you and hope you get lucky with a bfp soon.",
            "post_id": "3086804",
            "timestamp": "1214502362",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "i had my iud removed on jun 24 and when i did cm showed signs of ovulating so my husband and i tryed.  but then on the 25 i started to bleed!  Then i stoped on the 27 but toady i ahve started back.  we have been going at it since the 24.  i don't know if i was ovulateing or not. i have been preg 5 times ( i had 2 miscarges)  i never tryed for a baby so this is new to me so please help.",
            "post_id": "3095337",
            "timestamp": "1214701999",
            "user_id": "user_548480",
            "user_link": "/personal_pages/user/548480",
            "votes": "0"
        },
        {
            "answer": "I'm a little concerned about trying to get pregnant now. I'm 38 soon to be 39 and have been dating the greatest man I have ever met for the last year and a half and want to have a child with him something bad. I have 2 children from my previous marriage and my bf doesn't have any kids and he would be a wonderful dad. I was thinking about having my IUD taken out in August in hopes to get pregnant by December, but I'm scared that it will take too long to get pregnant and I don't want to get pregnant after 40. Are there any other older moms here?",
            "post_id": "3104978",
            "timestamp": "1214926648",
            "user_id": "user_550537",
            "user_link": "/personal_pages/user/550537",
            "votes": "0"
        },
        {
            "answer": "I had mine IUD removed on 20May 2008 and it happened my period comes aft a few hrs n it last fr 8days. I been using IUD fr all 7yrs aft my first child n she is now 8yrs old. For all the yrs my mensus has been norml n I dont hv any cramps or wat so ever so I thk IUD is safe for most women. I am now tryin fr a second child n hoping to get conceive as soon. Im hvg my following period aft my IUD removed which start 1st July so its my forth day. I will let u knw if Ive a good news. My adv dont give up n pray to God as He knws wat is best fr u. tc",
            "post_id": "3118119",
            "timestamp": "1215194704",
            "user_id": "user_553124",
            "user_link": "/personal_pages/user/553124",
            "votes": "0"
        },
        {
            "answer": "I had my iud taken out on june 6th. I didn't get my period after and on Friday July 4th I found out I am pregnant. I don't know how far along I am since I didn't get my period,",
            "post_id": "3127523",
            "timestamp": "1215458490",
            "user_id": "user_546623",
            "user_link": "/personal_pages/user/546623",
            "votes": "0"
        },
        {
            "answer": "I had my Mirena removed on June 6 after having it in for approximately 10 months (put in at 6 week PP appt and my DD just turned 1 on 7/6).  I had bleeding for about a week following and have not had anything since.  I noticed some EWCM about a week and a half to two weeks ago.  We aren't exactly trying, yet.  We're not using protection, but he's not \"staying inside\" either.  I had a pregnancy test run during my physical earlier this week but am assuming that it was negative without a call.  Still waiting on my first true period and am very anxious to start TTC.  Good luck to all!",
            "post_id": "3135671",
            "timestamp": "1215626932",
            "user_id": "user_557082",
            "user_link": "/personal_pages/user/557082",
            "votes": "0"
        },
        {
            "answer": "Well no sooner than I posted that message did I go to the restroom to discover that low and behold, SHE'S HERE!  So my AF returned 33 days after removal (excluding the bleeding that lasted about a week afterwards which would be about a 26 day cycle which is where I was pre-baby.  Looks like I need to get the hubby ready :)",
            "post_id": "3135691",
            "timestamp": "1215627257",
            "user_id": "user_557082",
            "user_link": "/personal_pages/user/557082",
            "votes": "0"
        },
        {
            "answer": "CONGRADULATIONS JAIMIE. It's my first time posting. I do have some questions and would appreciate any comments. I had my IUD removed on May 27th, have not gotten a full period since ( i've had spotting, but no period) I tought i was pregnant did 3 pregnancy tests done, all negative, plus, one blood test, negative as well. I really do wan to become pregnant soon, i purchased the ovulation kit, has anyone used it before? Any advise? Wish me and all of the other ladies trying to conceive luck. Best wishes to all.",
            "post_id": "3140276",
            "timestamp": "1215715145",
            "user_id": "user_552383",
            "user_link": "/personal_pages/user/552383",
            "votes": "0"
        },
        {
            "answer": "this is the first time i have visited this site and i have a few questions. i am very confused about the abbreviations used here could someone clear them up for me.i had mirena inserted in April of 07 and my hubby pulled the string (no pain what-so-ever) July 6 08. ever since lots of bleeding with several clots. i guess from reading the prior posts this is norm for a while. i hope we don't have to wait a year to concieve baby #7, that would be very depressing. i have noticed that my sex drive is back in full force already, maybe because im so relieved that it is no longer in my body!!!! there are so many conflicting answers out there about return to fertility that i dont know what to believe> even the doctors don't know. i wish i had never had it in and used different birth control. but in mirena's defense i did enjoy not having a period for a year or so. but the weight gain *****.",
            "post_id": "3146536",
            "timestamp": "1215834786",
            "user_id": "user_559255",
            "user_link": "/personal_pages/user/559255",
            "votes": "0"
        },
        {
            "answer": "Thank you Brooke for giving me hope...I've had the IUD for a year and a half and will be getting it removed in 3 weeks...I will try for baby #2..I am 37 (turning 38 in 2 months) so we are in a bit of hurry...I am curious about other older mothers out there...any issues with the IUD?",
            "post_id": "3188855",
            "timestamp": "1216778896",
            "user_id": "user_568496",
            "user_link": "/personal_pages/user/568496",
            "votes": "0"
        },
        {
            "answer": "hey all. i had my IUD inserted in Dec/06 after my daughter was born, and it worked out great for the 21 months i had it.. until i went to the bathroom last week and noticed the string hanging out of me.... fell out.. its been a week without it and ive had bleeding on and off the whole time. nothing that i would definetly say is my AF. like two days os heavy bleeding... nothing for a day.. then another day of heavy bleeding then another day of nothing... now. my Dh and i had sex last night, a week after it fell out... we used pull n pray.. but i could tell he pulled a milisecond too late...ive always been a fertile mertile.  concieved my son 3 months after the shot. without getting a period and concieved my daughter 2 months after the pill.. pretty much the ONLY two times ive NOT been on BC since i became sexually active.. i got pregnant within a few months.im just rambling.. there is answer for me. since i have NO idea where in my cycle i was when it fell out.  and i dont know if ive had a AF since it came out. my Afs have never lasted more than 2 days in my life.. so any one of those could have been it...but i do have to say.. while im very mad and bitter and upset that my iud fell out.. im noticing that im calmer lately.. and for the first time in 4 years i was the one wanting sex... and i REALLY wanted it. so my sex drive is back. no weightloss yet.. im hoping i get that too...im just really nerous about getting pregnant.. we really dont want another child right now.. we wouldnt like freak if we got PG, but we wouldnt be dancing in the streets. DH hates condoms, we have no ins at this point and hormonal BC and i dont get along... the iud was really perfect. but my OB wont give me another one. she said that once one falls out you stand a much higher risk of another one falling out and thats risking too much damage...",
            "post_id": "3246814",
            "timestamp": "1218034098",
            "user_id": "user_581933",
            "user_link": "/personal_pages/user/581933",
            "votes": "0"
        },
        {
            "answer": "I had mirena for less than a year, got preg. 3 weeks after removal (could feel ovulation pains), ended up being twins that never developed a yolk sac, etc, miscarried at 11 weeks.  Almost 4 months later, I am still waiting and am having crazy 2 t0 3 week cycles with definite ovulation dates and no pregancies.  We have been trying, it is hard.  We have 2 children who were conceived VERY easily, so I think mirena messed what was a perfectly healthy reproductive system up. It is not what it's cracked up to be.  We are pushing our luck with a contraceptive that singlehandedly can prevent pregnancy for 5 years.  I advise you NOT to get on it, and if you have, HAVE IT REMOVED at least 4 months before you try again, at least that will be 4 months of semi-getting back to normal.V",
            "post_id": "3261159",
            "timestamp": "1218342230",
            "user_id": "user_585323",
            "user_link": "/personal_pages/user/585323",
            "votes": "0"
        },
        {
            "answer": "I got the IUD in 2004 after my daughter was born.  Had it taken out May 7 2008 and was pregnant by the end of the month.  Unfortunately I miscarried at 8 weeks.  I am 36 and we will probably wait until December, when I'll be 37 to try again.  Best of luck to you!",
            "post_id": "3277710",
            "timestamp": "1218680822",
            "user_id": "user_589228",
            "user_link": "/personal_pages/user/589228",
            "votes": "0"
        },
        {
            "answer": "I got the IUD in Oct 2005, 6 weeks after my son was born. I had regular periods while on it. I got it removed March 2008 after having it for 29 months. I've been ttc for 5 months with no luck so far. My periods are basically normal- with it being a couple days early/late. I like Mirena, as long as I end up getting pregnant soon! Getting it inserted & removed was a breeze.. no pain, just uncomfortable, but who says a doctor working between your legs in comfortable?My best friend had her IUD in for 14 months, and has been ttc for 6 months now. She hates Mirena! When she got it removed she bled so much she had to be taken to the ER. They gave her pills to stop the bleeding & said if the bleeding didn't stop within 36 hours to come in & perhaps get a blood transfusion. Her periods are so messed up right now- she's had to resort to an ovulation kit.I can't believe this thread/post/blog has been going for almost 2 years! Good luck ttc peeps",
            "post_id": "3298123",
            "timestamp": "1219151592",
            "user_id": "user_594052",
            "user_link": "/personal_pages/user/594052",
            "votes": "0"
        },
        {
            "answer": "I had problems with my first iud.I also had problems with the iud i had taken out on monday. The IUD went almost all the way into cervix and just a tiny little piece was poking out. So they had to remove it because it would have gone all the way in. When i had sex with my husband on the Friday and Saturday before removal it hurt him and me so thats why i went to get it checked and they had to remove it.So The IUD is good for some people and bad for others. My opinion.",
            "post_id": "3303699",
            "timestamp": "1219251582",
            "user_id": "user_595442",
            "user_link": "/personal_pages/user/595442",
            "votes": "0"
        },
        {
            "answer": "I'm wanting to get pregnant again but now i'm scared after reading all og these stories. I haven't spotted or started bleeding so we will see i guess. GOod Luck to all!",
            "post_id": "3303730",
            "timestamp": "1219251885",
            "user_id": "user_595442",
            "user_link": "/personal_pages/user/595442",
            "votes": "0"
        },
        {
            "answer": "I was terrified to become pregnant again after my daughter was born 1/07 so my OB/GYN talked me into Mirena 8wks pp. I bled for a month post-insertion then had extremely irregular, very heavy periods with severe cramping for the 13 months that I had it. I had tried to have it removed sooner but my OB/GYN refused. I had it removed 4/08, my cycles have become regular (28-30 days) with ovulation on CD19 but my LP is only 9 days.  This is the 3rd cycle that we've been ttc, with the two prior I had what I believed was implantation spotting 8&9DPO but then my period would start. We easily became pregnant with our first 1 cycle post BCP. The very heavy periods with PMS that I had with Mirena have continued. I never had any problems before. So, we too are in limbo, ttc and having problems after Mirena.",
            "post_id": "3305400",
            "timestamp": "1219274199",
            "user_id": "user_595848",
            "user_link": "/personal_pages/user/595848",
            "votes": "0"
        },
        {
            "answer": "I had my IUD taken out 7/1 and had all the pregnancy symptoms... took the test negative.I had a spotting on 7/5 then on 7/10 and now it was like a period on 8/11 lasted til the 15th. We really want our third. Sending baby dust all your ways.",
            "post_id": "3305590",
            "timestamp": "1219276512",
            "user_id": "user_595884",
            "user_link": "/personal_pages/user/595884",
            "votes": "0"
        },
        {
            "answer": "I had my Mirena removed on Aug. 20th. Have had it for right at 1 year, almost to the day. Just very very light spotting for 1 day, nothing at all yesterday. My husband and I are both wanting another baby, and hoping to conceive by the end of october. After intercource, just the real light spotting that has been normal over the last year. Well... this afternoon, I believe i started my 1st period. Very heavy bleeding like before IUD. I am keeping my fingers crossed that I am back on cycle. We desperately are wanting our 4th child. From what i have read, it varies for each person. I enjoyed the mirena while i had it. Aside from the occasional pain during intercourse, that was easily remidied by moving positions, the lighter and less frequent periods were welcomed! I have always had horrible periods, that at times were over a week long, extremely heavy, and even more painful. From what i can tell, what started today, was just like before.  I will keep this posted with the way this plays out.",
            "post_id": "3313653",
            "timestamp": "1219441981",
            "user_id": "user_597783",
            "user_link": "/personal_pages/user/597783",
            "votes": "0"
        },
        {
            "answer": "I'm hoping to be one of the ladies with good luck!   I am new here and will write out as many of the abbreviations that I have figured out so far, for the gal who asked for help... I am 39 and ttc (trying to conceive).  I had the Mirena inserted after my last miscarriage in March 2005.  On August 18th, I had the thing removed.  It hurt coming out bor a split second but hardly felt it going in...in fact the doctor who inserted it had to do so 3 times because it kept falling out.  Now, birth control and I have never gotten along well and I conceived all of my pregnancies (but one) while practicing some form of birth control.  Anyway, I did not feel very well at all on Monday (after the removal).  I had cramps, body aches and extreme fatigue.  In fact, I fell asleep at 6pm!!  I had some type of AF (Aunt Flo, a saying for menstruation) the whole time I had the Mirena and very inconsistenly with a lot of pain for the first two years.  The last year of the Mirena was the worst!  It was not until I started reading everyone's post that I realized all of the problems that I've been having were probably from the Mirena (acne where I've never had it, Horrible PMS, funky cycles ranging from 25 -31 days apart and lasting from a couple of days to a week and a half), inexplicable weight gain despite regular exercise and strict food intake management and on and on...).  I began my last cycle on the August 14th and it was mostly gone on the day I had the Mirena.  I spotted for 2-3 days.  I just started charting temperatures in an effort to know what my body is doing.  My son has Autism and we are really wanting to try for a girl to improve our odds of escaping more Autism.  I digress once more, I felt as though I had ovulation pains on Wed. (which could be true considering my fluctuating cycles) and have felt increasingly pregnant as each day passes!  It's too early for me to test and I bought the cheap ones, wanting to wait until my AF was due in hopes to see a BFP (BIG FAT POSITIVE...just figured this one out  :)  )  I am hoping my cat is right once more as he has been kneading me like crazy and more affectionate than usual and I am one of the lucky ones who get pregnant right away!! (My cat told me I was pregnant before I even had strong suspicions.  I know that sounds crazy but you don't know my cat!   We call him \"Dr. Mo\".  GOOD LUCK EVERYONE!!!",
            "post_id": "3325444",
            "timestamp": "1219720068",
            "user_id": "user_596891",
            "user_link": "/personal_pages/user/596891",
            "votes": "0"
        },
        {
            "answer": "i have had my coil in for 3 years now, i had it removed today, it didnt hurt at all, im ready for another baby, i have had no bleeding or spotting today, is it okay to have sex tonight and start now for my baby?",
            "post_id": "3364619",
            "timestamp": "1220566280",
            "user_id": "user_610222",
            "user_link": "/personal_pages/user/610222",
            "votes": "0"
        },
        {
            "answer": "I had the IUD mirena removed on the 3rd of september,today on the 6th I woke up to find heavy bleeding...thinking it was my period back I put in a tampon-well it bleed through QUICK.a half an hour ago I changed it again and found a clot come out with it.I really want another baby-and it ***** that my body is tricking me.I too have been having pregnancy like symptoms...and I hate that they are fake",
            "post_id": "3372957",
            "timestamp": "1220751368",
            "user_id": "user_612250",
            "user_link": "/personal_pages/user/612250",
            "votes": "0"
        },
        {
            "answer": "I am wanting to have another baby. which would be my second. I do have a hormonal IUD. I want to have it removed. But, I do Not know what to except from the removal.... I wish I new how long it would take me to get pregnant. With my first baby it was very fast for me to get pregnant... Thanks..",
            "post_id": "3378288",
            "timestamp": "1220887584",
            "user_id": "user_613599",
            "user_link": "/personal_pages/user/613599",
            "votes": "0"
        },
        {
            "answer": "I had my IUD put in Feb 08 and I had it removed Sept 2, 08My boyfriend and I want to conceive right away, what is the rate that everyone go pregnant on this? Did anyone get pregnant right away, as in less than one month? I was told it would be a few months for my periods to come back and it was in fact only 2 days. I had it removed on a tuesday and started my period on Thursday. We really would like to get pregnant as soon as possible...I would like to have an late spring or early summer baby...Thanks!Brandi",
            "post_id": "3394335",
            "timestamp": "1221173020",
            "user_id": "user_617362",
            "user_link": "/personal_pages/user/617362",
            "votes": "0"
        },
        {
            "answer": "Hi, Im new here. Im getting my Mirena removed tomorrow morning to ttc. I just had my appendix out the end of July, so I am a little worried about getting preg right away because of my muscle still healing from where they cut in. But my hubby wont be home from a training academy until Thanksgiving so i figure that gives my body more time to continue to heal and for my cycle to get on track before we try. I had my Mirena inserted Jan 2007 after my little boy was born. I had bleeding for 3-4 months straight. I called my dr and talked to her about getting it removed and she told me i needed to take some hormone pills to thin the lining and the bleeding should stop, so i tried it for 30 days and it worked. I had occasional spotting and never knew when it was going to happen. My periods pretty much stopped all together. I did get the acne after it was inserted also but its managed. As for weight gain, I was able to lose the weight from the pregnancy. I currently have a little girl that will be 4 in november and a little boy that will be 2 in november and I want 1 more baby and finally got my hubby to want one more.",
            "post_id": "3422830",
            "timestamp": "1221782515",
            "user_id": "user_624479",
            "user_link": "/personal_pages/user/624479",
            "votes": "0"
        },
        {
            "answer": "I have been off Mirena 7 months . And a week before every period I will start lactating and my breast will be sore. My husband and I have been trying for 7 months and took Ovaluation tests trying to get pregnant and no luck. How long does it take to get pregnant after being off the Mirena?",
            "post_id": "3460757",
            "timestamp": "1222562983",
            "user_id": "user_633561",
            "user_link": "/personal_pages/user/633561",
            "votes": "0"
        },
        {
            "answer": "Hi, I had my mirena put in 5 years ago nov 03, I bled for 2 months straight, and than hardly had any periods. NO PROBS!! About 3 months ago in june 08 started having heavier bleeding which was caused because the mirena hormone was nearing its end. I had it removed(no pain) a week ago sept 08 and have had some cramping and heavy bleeding which hasn't stopped so far. Regardless I was told by my gyno to be careful bc I am ovulating and can get pregnant right away. He showed me my ovaries and said i should have a period in 2 weeks, than he showed me my egg, which is why he said to be careful, I'm relieved to have seen my ovaries ok and just think some people worry to much, remember mirena does have some hormones, so everyone's body is different. thanks !!!",
            "post_id": "3485984",
            "timestamp": "1223060723",
            "user_id": "user_639731",
            "user_link": "/personal_pages/user/639731",
            "votes": "0"
        },
        {
            "answer": "I had my iud put in feb 08 and had it removed in aug 08, so i didnt have it very long, my periods have been normal and we have been ttc. i have been tracking ovulaton  and still no luck, we will see, but i hope it happens soon!  wish all of you luck!!!!!!!!!!!",
            "post_id": "3506474",
            "timestamp": "1223499894",
            "user_id": "user_644933",
            "user_link": "/personal_pages/user/644933",
            "votes": "0"
        },
        {
            "answer": "I also have the mirena iud. I got it at my 6 weeks pp appt. Got it in May of 2006. My husband and I are talking about having another baby and I always thought that you could get pregnant right after IUD removal. Now I am worried that it is going to take even longer to get pg. I feel like I should remove it now and then wait a couple of months before trying.....just not sure. I have loved having the mirena as I really don't have a period at all.",
            "post_id": "3537056",
            "timestamp": "1224167631",
            "user_id": "user_652728",
            "user_link": "/personal_pages/user/652728",
            "votes": "0"
        },
        {
            "answer": "I had the mirena put in October of 2005 after my 5th child. I decided to try something different being I had conceived on the pill and the Depo shot. Now with this I didn't conceive but I had it removed in December of 2007 because it was causing pain with or without sex. Since then I decided I want another child, hopefully another boy because I have 3 girls and 2 boys and haven't had any luck. I somewhat feel like the mirena plays a big part in this because conceiving has never been a issue for me. Hearing some people have actually conceived since the mirena I think it's the insertion of it, because some people I noticed said it didn't hurt much. Mine hurt not much but it hurt for about 3-4 days and I bleed. After having it removed my period is actually more regular than it was before I got it. Before it came on anytime and stayed on for 10-13 days. Now 5-6 days,but I haven't seem to be able to get pregnant. I'm puzzled.",
            "post_id": "3544554",
            "timestamp": "1224305208",
            "user_id": "user_654563",
            "user_link": "/personal_pages/user/654563",
            "votes": "0"
        },
        {
            "answer": "I just had my mirena IUD removed on the 26th of September and afterwards had very lite brown (old blood) for maybe 2-3 days.  Ever since then I have had pregnancy signs such as tender breast, tired, extra hungry etc.  And I definetly know that I am not pregnant because I haven't had sex since my husband just got back.  And the other day I had a egg white discharge as if I was ovulating.  I did love my IUD but hope that it doesn't hender me ttc.  I will wait a couple months before returning to my doctor to see what's going on.  BTW I had my IUD in for 3 1/2 years before having it removed.",
            "post_id": "3549555",
            "timestamp": "1224453246",
            "user_id": "user_655922",
            "user_link": "/personal_pages/user/655922",
            "votes": "0"
        },
        {
            "answer": "I had the Mirena placed in fall of 2005, periods dissapeared, but terrible side effects. Had it removed middle of July 2008, immediately had period, lasted about 5 days, then nothing until September 2nd. Then AF visited again on Oct. 6th. OPK was positive 18th and 19th of this month, did have unprotected intercourse with DH on the 17th and on the 19th, so now the waiting game. Each person is different, some people do have decreased fertility after the Mirena, and I have always been a\"fertile Myrtle\" my other 3 children were concieved without trying. Hopefully....BTW, Kudos on keeping this thread going for so long- years even!just shows we women have longer attention spans LOL!!",
            "post_id": "3551860",
            "timestamp": "1224513539",
            "user_id": "user_656523",
            "user_link": "/personal_pages/user/656523",
            "votes": "0"
        },
        {
            "answer": "Hi, there...I had my Paraguard IUD removed on 10/3, had Intercourse on 10/2 and was actually supposed to ovulate the date of the IUD removal.  I bled real heavily for 7 days and was told by the dr that it's normal.  I am 36, have had 2 IVF/ICSI with two healthy deliveries and then after I stopped BF the 2nd conceived naturally but then miscarried at 10 weeks.  I had the IUD in for 1 year and my dr. says that it's a low percentage that I would conceive naturally due to my age, high-risk, etc.  However, but I would like to know if any of you had similarities and were able to conceive and how long it took.  We want another one, just curious if you could possibly conceive so soon after the removal, etc.  Any comments are welcome.",
            "post_id": "3553301",
            "timestamp": "1224533182",
            "user_id": "user_656893",
            "user_link": "/personal_pages/user/656893",
            "votes": "0"
        },
        {
            "answer": "Hi ladies I had my mirena removed on tues 30th sep 08.Wanted to keep a little diary of my progress for anyone going through the early stages of removal like myself. I did not have much bleeding at all more like very lightspots for maybe 3 days.The first week was painfull cramping and extreme headaches.(much the same as when mirena was still in) Extreme mood swings. Extreme backache.Kept waiting for AF to start as many others have but still show.Week 2 :I was so bloated that honestly you would think i was 4 months preg. I really lived in track pants as that was all that would fit.The pressure in my lower stomach from this was terrible.Still very moody(like when i first quit smoking) very agitated.still no bleeding.Took a HPT but showed a neg. bummer. I was waiting for the CRASH that you hear about and for me it was about day 10 and 11. wow was this horrible. lasted probably 2 days(most of the above mentioned but x10) and then my head was clear like it hasn't been in years.I had mirena in for 2 1/2 years and NEVER had bleeding or spotting from day 1.Week 3 :Visited my doc today, had pap smear,When i had my last visit he said i had signs of \"fibroids\" (which is also a direct link from mirena's hormones)Fingers crossed they are small with no harm to conceiving.He thinks AF should arrive in the next 2 weeks. So i am playing the waiting game.On a brighter note this week I feel more like my old bubbly self.which is a huge positive.I will update regulary as I am trying to get pregnant like most of us.A big thank you to all ladies who have posted previously I have read all the stories about 5 times. It gives me comfort to know I am not alone.Good luck ladies and baby dust to all.",
            "post_id": "3555016",
            "timestamp": "1224557061",
            "user_id": "user_653519",
            "user_link": "/personal_pages/user/653519",
            "votes": "0"
        },
        {
            "answer": "I just wanted to update my last posting. After five or six months after my IUD was removed, I was able to get pregnant. I just had my baby girl a little over a week ago on the 14th. Good Luck to all!",
            "post_id": "3569989",
            "timestamp": "1224849194",
            "user_id": "user_346545",
            "user_link": "/personal_pages/user/346545",
            "votes": "0"
        },
        {
            "answer": "Hi again ladies.Week 4: This week has been so much better. really do feel like my old self. Still no AF.Very frustrating its been 29 days.(since removal)No spotting either. very sore boobs this week maybe im actually ovulating.Been keeping busy in the bedroom just in case.(sore boobs could be a few things) but the test was neg.everyday i wait for AF to arrive just so i feel like im not trying in vain.I know its all about patience but it definantly consumes my daily thoughts.CONGRATULATIONS (waiting around)on your baby girl.Its so nice to be reminded of whats around the corner.",
            "post_id": "3583039",
            "timestamp": "1225150934",
            "user_id": "user_653519",
            "user_link": "/personal_pages/user/653519",
            "votes": "0"
        },
        {
            "answer": "hi there, im new here just wanted to ask a question. i had my mirena removed on the 23 oct had no spotting, but then two days later very heavy bleeding with clots and still going but getting better, is this my period or is it just beacuse of removal. thank you and good luck to all of us trying to concive.",
            "post_id": "3584644",
            "timestamp": "1225190204",
            "user_id": "user_664624",
            "user_link": "/personal_pages/user/664624",
            "votes": "0"
        },
        {
            "answer": "Hi there!I got my IUD (Mirena) taken out on the 13th of this month. I didn't bleed right after like they said I would, but, I did bleed lightly for 3 days a week later. Not sure if that was my period... I am trying to conceive and not sure to think of that as a period and take pregnancy tests based on that? Anyone else go through that and conceive without any problems?? Thanks, and congrats and good luck to all!!",
            "post_id": "3586364",
            "timestamp": "1225218280",
            "user_id": "user_663849",
            "user_link": "/personal_pages/user/663849",
            "votes": "0"
        },
        {
            "answer": "Hi.  I'm new to the forum.  I've got 2 daughters.  4 & 16 months.  I had the mirena inserted in Aug/07 at my 6week pp exam.  After doing research i learned that the Mirena probably is the cause of some pretty annoying symptoms.  As in: acne, weight gain, mood swings(horrible ones), headaches, back pain, nausea, etc.  All of which made me feel prego all the time.  I wasted so much money on pregnancy tests while on the mirena b/c i always felt pregnant and i never had a period or spotting in the last 6 months of being on it.  Anyways, I had the mirena removed on wednesday of last week.  It was virtually painless.  I've had a little spotting here and there but nothing heavy at all.  no cramps or anything like that.  i'm still waiting on the \"crash\" i've read about.  not looking forward to that one.  I have noticed that just this morning my breast, especially nipples, are very tender.  I haven't felt that since pregnancy.  The hubby and I had sex yesterday.  2 days after the removal of the mirena.  We are anxious to conceive again soon as we are hoping for a little boy.  I'm just a little concerned about how long it will be before i start my first cycle.  I've never looked forward to having a period like I am now!  Wish me luck!  Best wishes to all!!!!",
            "post_id": "3603570",
            "timestamp": "1225565096",
            "user_id": "user_668962",
            "user_link": "/personal_pages/user/668962",
            "votes": "0"
        },
        {
            "answer": "I to had a iud removed surgically as threads were unable to be seen 1 month ago light spoting for 4 days after then I ovulated  then had a rush of light colour blood  on day 7 .since then nothing .WAITING FOR A PERIOD  BUT HAD NEG PREG TEST! i also have complex  cyst on left ovarie want a baby should I be worried about the affects of merina may have caused and the cysts affect on fertility?",
            "post_id": "3605304",
            "timestamp": "1225610599",
            "user_id": "user_669421",
            "user_link": "/personal_pages/user/669421",
            "votes": "0"
        },
        {
            "answer": "Hi to all. I'm new also. So i have a 8yr old & a 6 yr old., My husband and I are ttc now. I just had my mirena removed on 10-9-08. I think I had a period on 10-2 for about 1/2 day. I had some spotting/ bleeding on the 13th and 14th. (sorry if tmi) so my husband and i have been having sex just every other day since then. WE ARE REALLY TRYING!! I just feel so confused because while i was on the mirena i would go months without AF and now I dont know when to expect her. I've taken a hpt and a blood test (neg) but i think they were way to early to take. I still havent got AF as of today. Any suggestions? should i wait to retest. GOD DO I HATE WAITING!!!! thats the worst part.",
            "post_id": "3620024",
            "timestamp": "1225913053",
            "user_id": "user_672934",
            "user_link": "/personal_pages/user/672934",
            "votes": "0"
        },
        {
            "answer": "I also had my mirena removed recently to ttc #2. I had it put in after my son was born in jan 07 and had it removed on sept 27th. I had seven days of heavy bleeding with clots that started about 2 days after removal. We were planning on waiting about 1-2 months to ttc but we also were not preventing pregnancy. we found out nov 1 that i was pregnant. so yes it can happen right away. now i am just worried that something is going to go wrong with the pregnancy after heaaring about many miscarying when cancieving so soon after removal.",
            "post_id": "3627822",
            "timestamp": "1226068529",
            "user_id": "user_674822",
            "user_link": "/personal_pages/user/674822",
            "votes": "0"
        },
        {
            "answer": "Hi ladiesWell I have some news.Last week at (week 5 since removal) I took a HPT as I had really sore heavy boobs and sure enough I had a faint positive.I was so scared this wasn't real that I waited 5 days to re test.I re tested on the weekend and had a BFP. To be honest i really can't believe it but I'm am so happy and excited.Now on the flip side I like you weeze85 am so so scared of having a miscarriage.So its one day at a time.I have had no periods since removal and it does scare me alot.I would love to hear from anyone else who is in later stages of pregnancy or who has delivered full term with a similar senario.Good luck to everybody(inc myself) babydust is in the air",
            "post_id": "3641098",
            "timestamp": "1226358305",
            "user_id": "user_653519",
            "user_link": "/personal_pages/user/653519",
            "votes": "0"
        },
        {
            "answer": "Hi Im new to this so bare with me. My husband and I are contemplating to have baby# 3 ! Im so excited. So it takes a year to get pregnant after the mirena. Ive had it in for exactly a year yesterday. I love how i dont have to worry about it. but the first three months i had a very heady flow straight three months. reading all these posts scare me, i hope i can get preg again! with my first i was on the depo got off then three month late got preg..the second preg i was on the pill got off then three months later i was preg! so im hoping this will be the same way but i doubt it! wish me luck for a boy!",
            "post_id": "3652677",
            "timestamp": "1226588562",
            "user_id": "user_681433",
            "user_link": "/personal_pages/user/681433",
            "votes": "0"
        },
        {
            "answer": "I had mirena in march 06 - october 08. i had very light bleeding after removal then my first real period came mon 10th Nov. this pleased me as although i wasnt pregnant i atleast could try to work out when i could conceive. if u have a period does this necessarily mean u are ovulating??",
            "post_id": "3653910",
            "timestamp": "1226604217",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "wow im shocked after reading all your posts not many success stories out there. i had my IUD inserted 6wks after my daughter was born she is now 3yrs old and i had my IUD removed 3wks ago in the attempt 2 have another baby. during the 3yrs i had the IUD in i had occasional spotting and the odd period tha would last a day or 2 i thought it was great at the time not thinking of the lasting effects it might be having on my body! since having the the coil removed me and my bf had sex straight away i havent had even 1 spot of blood i've had a few cramps, sore nipples in the moning and needing the toilet alot more but im very confused as to what could be going on down there!! like so many of you out there i was also told i could get pregnant straight away. im going to wait another wk or 2 before doing a test really hope its positive. wish me luck and good luck to all out there who is as desperate as me!!",
            "post_id": "3692748",
            "timestamp": "1227439935",
            "user_id": "user_691553",
            "user_link": "/personal_pages/user/691553",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,I am new to the post and I want to let you know how helpful everyone's comments have been. Also want to say congrats on the long duration of the forum. I had been on the Mirena from Jan. 02- Dec. 07. I had minimal cramping after insertion but no major issues. Throughout the entire time of being on Mirena I had very light spotting about every 3 months. I did have headaches, fatigue, acne and some moodiness but will not say that they were caused by Mirena. I was very satisfied with this form of BC. I had it reinserted in Feb. 08 after deciding that I wasn't quite ready for another child  and I had enjoyed not having to experience my monthly visits from AF. My children are currently 10 and 7. Once again I didn't experience any problems and had pretty much the same response as previously. I removed it on Nov. 18 in hopes of ttc soon. I had very light brown spotting on the day of removal but nothing since. The week prior to removal I believe that I may have begun ovulating due to slight cramping but it is hard to tell with not getting a regular period throughout the use of Mirena. We have not used any protection thus far and are hopeful. I have to admit thought that I am a little nervous now about having trouble with conceiving and miscarriage. I will keep you posted of our journey.",
            "post_id": "3695814",
            "timestamp": "1227502111",
            "user_id": "user_692280",
            "user_link": "/personal_pages/user/692280",
            "votes": "0"
        },
        {
            "answer": "I just had my IUD removed last week after having it in for 20 months.  While I had the Mirena, I had fairly regular periods (usually 22-28 days apart) - lighter than before I had the IUD.  I got the IUD removed the day after my AF stopped.  The next day I had heavy, dark red bleeding for about 12 hours.  After that I have had some rust colored, milky discharge.  We are ttc baby #1 - never been pregnant before.  I'm a nurse, and I'm tempted to get really technical in this whole process (you know - flow charts, basal temps, home ovulation kits, etc).  I'm trying not to let myself do these things because I could go nuts with the whole process.  AAGGH!",
            "post_id": "3696564",
            "timestamp": "1227539321",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "7 months after removal",
            "post_id": "3696665",
            "timestamp": "1227541135",
            "user_id": "user_638080",
            "user_link": "/personal_pages/user/638080",
            "votes": "0"
        },
        {
            "answer": "and my doctor told me that was because the mirena can still work for up to 9 months after the removal of it cause the hormone from it can still be in ur system",
            "post_id": "3696672",
            "timestamp": "1227541233",
            "user_id": "user_638080",
            "user_link": "/personal_pages/user/638080",
            "votes": "0"
        },
        {
            "answer": "hi smiling, its lovely to know that i am not the only one who is impatient lol!!! i have spent a small fortune on ovulation kits to no sucess, had my mirena out on 20th oct this year. i dint believe wot somebody said about 9 months for your body to get back to normal - my doc said u can get pregnant straight away",
            "post_id": "3698534",
            "timestamp": "1227565619",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "Thanks for the support.  I'm very confused about spotting versus having my period.  It's reassuring to hear  stories from the women who got preggers just a few months after IUD removal.  My OBGYN says her sister got pregnant within 3 months of getting the Mirena out.  I should be ovulating soon if my last period was actually a period and not some weird Mirena bleeding.  Took an ovulation test this afternoon - negative.  BOO!  Once I know that I am ovulating again, I'm going to quit with the tests/calendar marking, etc. and just let nature take her course for a few months.",
            "post_id": "3702650",
            "timestamp": "1227650854",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "Also, I am having all of these crazy hormaonal changes since Mirena removal.  My normally dry, frizzy hair is now silky smooth - almost oily.  I have been dizzy and nauseaous every afternoon since removal.  I had horrible mood swings over the weekend - my poor hubbie.  We'll never make a baby if I keep acting like that!  Anyone else experiencing these symptoms?",
            "post_id": "3702659",
            "timestamp": "1227651088",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "Ha so funny cause i have felt very nauseas late afternoon/early evening lately - which is very unlike me as i am not a sicky person. i have bought ANOTHER ovulation kit but all through the time that i am supposed to be ovulating it has come up negative!!! so confused. i had a proper AF 3 weeks after removel so surely i should be ovulating!!!x",
            "post_id": "3702748",
            "timestamp": "1227652812",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "My OBGYN said that during the 3 months after removal, ovulation can come at any time.  I'm guessing that this means that my period and when I ovulate may not be related as closely as during a regular cycle.  Hum, just an idea.....I'm really trying to kick my nuerotic tendencies and just let nature take her course (thus far I have completely failed at this goal).  I'm such an efficient person.  I like for things to happen when they are suppose to happen so this crazy, whacked out menstrual cycle post-Mirena is driving me bonkers.  Oh well, so is life....",
            "post_id": "3702893",
            "timestamp": "1227655440",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "hi smiling, great news!!! im ovulating - took a test and said i am ovulating - atleast i know i am ovulating yay!!! hope this month is my month!! xx",
            "post_id": "3706311",
            "timestamp": "1227731993",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "Fabo news!!  There is hope.  Best of luck - it's wonderful to know that you ddn't have to wait 9 mo.s to ovulate.  I spent the better part of the afternoon dizzy and nauseaous again.  Stayes horizontal on the couch to keep the room from spinning.  Hopefully these symptoms mean that my body is working overtime to get back into regular cycles.  I have hope now that I know you are ovulating.  Thanks for sharing.",
            "post_id": "3707504",
            "timestamp": "1227756552",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "have now been 'in the bedroom' as much as i can as i know i am ovulating. i really hope that as i know that i am ovulating (and my husband has super-sperm) that it will be this month that i fall pregnant. - iam so impatient!!!",
            "post_id": "3709471",
            "timestamp": "1227826096",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "I had my last period on November 13th while I still had the IUD in.  IUD was removed Nov. 18th (or was it the 19th?), and I ovulated on the 28th of November.  I know I probably don't have enough uterine lining to have implantation this month but have hope for yourself.  Ovulation can occur soon after IUD removal!!  Also, good luck allenbabby007!!",
            "post_id": "3716449",
            "timestamp": "1228052597",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "I had the Mirena IUD inserted since Jan on Dec 25th of 2007 I gave birth to a little girl and I had the Depo than in Jan I was switched over to Mirena. While on Mirena I had a period every month. I had my IUD removed on Oct 30th of 2008 and my husband and I are trying to conceive. The day after my IUD removal I began to have heavy bleeding which took me to the hospital the Doctor said it was because of the IUD my OB/GYN doctor said that the IUD was infected. Around Nov 14th I had like brownish show coming down for 2 days. I took a 5 day early pregnancy today but it came up as negative may I be pregnant? As all of you I am also anxious and hoping to conceive. Good Luck To All :)",
            "post_id": "3719245",
            "timestamp": "1228107272",
            "user_id": "user_698438",
            "user_link": "/personal_pages/user/698438",
            "votes": "0"
        },
        {
            "answer": "hi smiling, hows the ovulation going. i am now hoping this is my month.was wondering, because i didnt ovulate on the 14th day after the first day of my period does that mean my cycle is longer?? never tracked my cycle before.",
            "post_id": "3724919",
            "timestamp": "1228235617",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "after reading all of the coments it makes me nervouse that i wont get pregnant. i got the iud after giving birth to my daughter in 06 i just had it out oct 08 and i had a period of so i think i did and think i ovulated but im now a week late with extreme exsastion! i have also experienced cramping but not the kind that make me feel like blah, along with nausea, heartburn, and tender brest. is this normal after removal stuff or could i be prego? my husband and i are hopeful and want to have baby #2. any advice",
            "post_id": "3728842",
            "timestamp": "1228312318",
            "user_id": "user_700890",
            "user_link": "/personal_pages/user/700890",
            "votes": "0"
        },
        {
            "answer": "i got my iud taken out end of Sep 08 i had it in since march 07, we are trying to get preg. i had my cycle after i had my iud taken out it started on Oct 4th, its now dec 3rd and i just took a test and there barley a line in the second window, noone else sees it i can see it, maybe i am a little anxious, what do you think? i have cravings, tender breast, i urniate alot lately and have mood swings, also a little weird my hair on my legs have been growing really fast, what's up?",
            "post_id": "3729457",
            "timestamp": "1228323019",
            "user_id": "user_701028",
            "user_link": "/personal_pages/user/701028",
            "votes": "0"
        },
        {
            "answer": "Ive read most, if not all, of the comments here and I have not heard anyone mention the following... I had my mirena for 16 months, just had it removed on the 1st of Dec. YESSS!!! I hated it! Too many negative symptoms to list but the crazy thing I experienced is : For the last 5 months that I had my IUD in, everytime me and my fiance had sex I would bleed ALOT afterward, Im talkin a heavy-heavy period like bleed. I couldnt take all of the sypmtoms (sore boobs, moodiness, headaches, ACNE, the list goes on and on) as it was and then when the bleeding after sex happened I was just like \"get this thing out\". The nurse at my OB said to go to an urgent care because the IUD could have punctured my uterus... no puncture, just annoying messy bleeding they all said would stop, but didn't.Has anyone experianced heavy period like bleeding immediately after sex with the mirena iud in?So here I am 2 days after removal and feel a little better already. I started bleeding a deep red/ brownish color discharge this am and have had a very bloated stomach, no gas, just bloated =].  My fiance is away for work so no worries on getting pregnant now, but we would like to ttc when he gets home in 2 weeks. I dont want to go all crazy with ovulation kits or anything... if it happens it happens, I'll just take care of myself and avoid anything that wouldn't be \"pregnacy kosher\",lol. I want another baby and so does he so we'll see.Wafting in all the pregnancy dust that has been thrown my way =]",
            "post_id": "3732315",
            "timestamp": "1228367098",
            "user_id": "user_701722",
            "user_link": "/personal_pages/user/701722",
            "votes": "0"
        },
        {
            "answer": "hi all im so happy!! i just got my first positive opk! had my coil removed on the 23rd oct 2008 so hoping that this is my month to get pregnant! keep you all updated, good luck to all trying to conceive! :)",
            "post_id": "3741203",
            "timestamp": "1228568170",
            "user_id": "user_664624",
            "user_link": "/personal_pages/user/664624",
            "votes": "0"
        },
        {
            "answer": "It looks like you have plenty answers here but I had to share my experience with you....21 years ago I had my IUD out when I realized that it was a form of abortion and had it in for about 5 years. I went to the doctors and said I was having cramps.  I really wanted it out because I wanted another baby, was going through a little mid life crisis and wahlah. I was pregnant the very next month! Well, it may have taken a month and a half but I used to joke that we barely used the same soap and I was pregnant. (Please don't worry... to ya younger readers... you can't get pregnant by using the same soap. LOL.)After that I always thought.... if someone had trouble getting pregnant. Get an IUD and then get it taken out... instant pregnancy! But after reading this thread it doesn't seen that way. My daughter is now 20 and the apple of my eye... so whatever it was, I am blessed!",
            "post_id": "3741695",
            "timestamp": "1228581299",
            "user_id": "user_648272",
            "user_link": "/personal_pages/user/648272",
            "votes": "0"
        },
        {
            "answer": "hi everyone just an update ....im due on on the 8th dec - not seen AF yet - hope not to!! hope that i get pregnant this month!!",
            "post_id": "3741759",
            "timestamp": "1228582507",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "I just posted above but wanted to give hope to you all. I was 30 years old when I got pregnant with my daughter and was really surprised how fast it happened. No one told me that I had to wait to get pregnant. I had a 7 year old when I had my second baby and had basically no problems with my IUD when I had it. This was a fcouple of decades ago! So I am rooting for you all. I reeeeally do think that getting an IUD out makes you more fertile than if you had never had one. I don't know how scientific that is or how it would hold up in the medical community but it is my belief and I am sticking to it! :) I am blowing more pregnancy dust out there to you all. I think that all of you here are really one step ahead of your normal gal trying to get pregnant out there because I think that there really is something to the post IUD pregnancy, fertile theory!",
            "post_id": "3741764",
            "timestamp": "1228582592",
            "user_id": "user_648272",
            "user_link": "/personal_pages/user/648272",
            "votes": "0"
        },
        {
            "answer": "Hello All!!I am 24 years old, I got the Mirena in 06 after the birth of my daughter. My husband and I are really excited to have baby #2, so we got the IUD out on 12/8/08.........just yesterday. I am SO EXCITED to become preggo again, I'm hoping that I will fall preggo this month! I know, keep dreaming......... :) So I had the Mirena for a little over 2 1/2 years, no bleeding what so ever! The removal was a breeze!! It felt just like a pap to me, I didn't believe my Dr. when she said it was out!! I ran right out and bought OPK, I am so impatient!! So you all will have to keep me posted, I will do the same. I hope you all achieve your dreams of babies!!!Good Luck!!",
            "post_id": "3753701",
            "timestamp": "1228854097",
            "user_id": "user_706526",
            "user_link": "/personal_pages/user/706526",
            "votes": "0"
        },
        {
            "answer": "Hi babydreams i am also 24. I got married in May this year and after looking after children all my adult life (in my career) i am desperately trying for baby no1 with my hubby. Not sure how long my cycle is as  i never tracked before but was due AF 8th Dec - (providing i have a 28 day cycle) but still no show tried taking test but NEG. just want to no either way. the waiting is the worst!!! AAAAHHHHHH!!!!!",
            "post_id": "3758753",
            "timestamp": "1228951280",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "Hello everyone, I got my IUD in nov. of 2004 when my daughter was 3.  I never had any problem with it. My periods were short, if I was lucky 3 days. But I wanted to have another baby.. So i got it remove in October 2008....I bleed for almost 2 weeks straight, i started the next day after it was removed.... Like everyone else I got upset when I did get pregnant after that first month....Started my period right on time...So I started watching my cervical fluid to see when I was ovulating.... apperentally it was a good thing and now I am 4 weeks along....I was reading over all the entrys from before and just wanted to let you guys now that it is possible to get pregnant that quick after it was removed and dont get disscourged...it will happen when the time is right for you! I had my IUD for awhile if any one has any questions I would be glad to try and answer what I can or help.....Good luck everyone !!!!!!!!!",
            "post_id": "3770056",
            "timestamp": "1229264801",
            "user_id": "user_710295",
            "user_link": "/personal_pages/user/710295",
            "votes": "0"
        },
        {
            "answer": "So I wrote just a few days ago after getting my IUD out (Dec. 8th), just thought I would give a little update. I started my (.) on 12/13, it has been a SUPER heavy flow with blood clots, sorry if that's TMI, but I wanted to let others know that it is normal. I can not wait to have baby #2, it's all I think about! So over this weekend I went home to see my family, where my brother proudly announced that he and his new wife are having a baby. I was super excited for him, it will be his first, but I couldn't help but feel upset..........I want it to be me! haha I guess I can look forward to our kids being the same age!! Whenever the time may come.",
            "post_id": "3771339",
            "timestamp": "1229295831",
            "user_id": "user_706526",
            "user_link": "/personal_pages/user/706526",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies.To those of you who read my story so far.Well i am now 9 weeks along and in full swing of morning sickness.(actually lets call it what it really is ALL DAY SICKNESS,) I have had 3 ultrasounds now, because i fell within 2 weeks of removal.I have had plenty of ups and downs since my BFP. I have been very scared of miscarriage and truth be told it still scares me falling pregnant so quickly. At week 5 and 6 I was cramping so badly that i was positive that i would loose him/her.In the early weeks it was hard for me to connect with my new little joy out of so much fear.I am just starting to let my excitement creep in and cant stop smiling and rubbing my new little bump.We saw  the little heartbeat last week and have now told family and a few close friends.Ladies please keep up your faith I know my prayers are being answered.My heart truely goes out to each and everyone of you going through this journey.And just remember it can and will happen.All of our babies have us as their destiny.Keep your hearts full of love.",
            "post_id": "3772306",
            "timestamp": "1229329672",
            "user_id": "user_653519",
            "user_link": "/personal_pages/user/653519",
            "votes": "0"
        },
        {
            "answer": "I like abi02 told my story of conception right after removal. We are now 10weeks prego and i too am beginning to relax and not worry so much about misscariage. It's funny abi02 because i too have had all day sickness and was cramping badly for many weeks. things are finally starting to subside and the sever fatigue is setting in. i too had to have an unltrasound because there was no way of knowing when i concieved. they had pushed back my due date one week from what they originally thought, bummer. makes this pregnancy even longer. after they told me this i realized that this meant i tested positive at 10 days post ovulation. crazy!! I wish everyone else the best of luck in concieving and pray that everything turns out all right for our babies concieved so soon after iud removal.",
            "post_id": "3773490",
            "timestamp": "1229363415",
            "user_id": "user_674822",
            "user_link": "/personal_pages/user/674822",
            "votes": "0"
        },
        {
            "answer": "I am the same also as you they pushed may date back by a few days which meant i tested positive at a crazy 7 days past O. so technically i found out at 3 weeks.I am really glad to hear things are going well with you because i have thought of you a few times as we are going through this at the exact same time with the same concerns.Does your morning sickness wake you in the night? I wake up at about 3am everynight and just can't get back to sleep for usually 3-4 hours.its pretty uncomfortable just laying there trying not to wake my partner.It feels like heartburn but just above my belly button.I hope like they say it will all pass within the next few weeks otherwise this will be a long 7 more months.",
            "post_id": "3775016",
            "timestamp": "1229390646",
            "user_id": "user_653519",
            "user_link": "/personal_pages/user/653519",
            "votes": "0"
        },
        {
            "answer": "Holy Cow,I am pregnant!  I got the IUD out on Nove 19th, ovulated on Nov 28th, and I had my BFP on the 1st day of my missed period - December 13th.  This means that I got pregnant 8 days after IUD removal.  Although I had some bleeding the day after I got my IUD out, I never had a period from when I got the IUD out to when I got pregnant.  I have had my HCG level dranw twice since I tested positive.  The number is rising appropriately.  I had a great progesterone level last week.  Things are looking good so far : )!",
            "post_id": "3784417",
            "timestamp": "1229609968",
            "user_id": "user_692543",
            "user_link": "/personal_pages/user/692543",
            "votes": "0"
        },
        {
            "answer": "Hi smiling CONGRATULATIONS!!!! After tracking Ovulation and waiting for AF on day 28...it didnt come then on day 31 of cycle it came!!  but am ok with it as at least my body is getting back to normal. How far gone r u?? x",
            "post_id": "3785080",
            "timestamp": "1229620217",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "if i removed my mirena on the 10th got my period on the 12th and had unprotectedsex on the 16th, can i come out pregnant?",
            "post_id": "3791003",
            "timestamp": "1229746931",
            "user_id": "user_715110",
            "user_link": "/personal_pages/user/715110",
            "votes": "0"
        },
        {
            "answer": "HI,I'm new to this community. I just had my Mirena removed on the 10th of Dec. had really heavy bleeding and clotting on the 12th. It's now the 19th and it's lighten up. I have had some unprotected sex in hopes to come out pregos right away. I am really trying however I am really nervous. With my first child which is now 6yrs old I came out pregnant right away. My hubby and I started in Jan 02 and found out I was pregnant in Feb 02. I am hoping that it's the same this time around. I will keep you posted on our journey.",
            "post_id": "3791016",
            "timestamp": "1229747211",
            "user_id": "user_715110",
            "user_link": "/personal_pages/user/715110",
            "votes": "0"
        },
        {
            "answer": "There is hope for you all out there!! i just found out that i am PREGNANT!!!i had coil out on 20th October had first cycle on 10th Nov second on 10th December and now i am pregnant so didnt take very long!!!Babydust to u allxxxxxxx",
            "post_id": "3839051",
            "timestamp": "1231192565",
            "user_id": "user_681695",
            "user_link": "/personal_pages/user/681695",
            "votes": "0"
        },
        {
            "answer": "hi everyone,am new to this, but will give it my best...had mirena removed mon 5/1/09 and have been feeling tired and lethargic since, had light brown discharge yesterday 6/1 and started bleeding heavier last night hopefully my first AF although i know that would be be quick... my period stopped completely while had mirena except an odd few days of spotting... am TTC #2 soon... fingers crossed and good luck to everyone xx",
            "post_id": "3844234",
            "timestamp": "1231288060",
            "user_id": "user_728627",
            "user_link": "/personal_pages/user/728627",
            "votes": "0"
        },
        {
            "answer": "Hi I had my IUD out 3 months ago, I had no bleeding until my ususal cycly date 18th of the month, bled for three days, then again the following month on the 18th for three days and the same in December, my cycle seems to have returned to normal very quickly, my partner and I are trying for a baby and I fell very quickly with my little girl but this time seems to be different, am I being impatient?",
            "post_id": "3845778",
            "timestamp": "1231321826",
            "user_id": "user_729065",
            "user_link": "/personal_pages/user/729065",
            "votes": "0"
        },
        {
            "answer": "first of all..huge congrats to allenbaby...that's awesome!  I kept checking back to see if you were able to get pregnant..and am so happy for you!  I must say, I feel somewhat better to know that other women are going through the same thing I am.  I had my Mirena taken out Aug 12th.  Had a period..or at least some decent bleeding..a couple of days after I had it removed, then another period about 36 days later.  Course that's where the complications started.  My doctor wanted me to wait at least through 2 cycles before I tried actively to get pregnant with my second child.  And I did, I waited after that second cycle and never had another period.  I thought for sure that I was pregnant. I had all the symptoms...tired, nausea and all that.  But now, I am almost 2 months late on my period, with a collection of pregnancy tests all negative.  I wasn't sure if that was normal or if others had experienced the same thing...with the lack of a period for several months after a couple of initial cycles.  But after reading here, I see that a couple of women have gone through the same thing.  I was wondering if anyone else had gone through the same thing, not having a period for several months, and then gone back to a regular cycle after that?  And more than that, has anyone been able to conceive after having such irregular cycles? Thanks so much for any help anyone can give me...and good luck to each of you!",
            "post_id": "3846274",
            "timestamp": "1231339067",
            "user_id": "user_729188",
            "user_link": "/personal_pages/user/729188",
            "votes": "0"
        },
        {
            "answer": "My sister's mirena fell out this morning and for the last week she felt something poking her and she checked it and she thought the string/wire was longer than it had been but she didn't give it much thought. this morning she took a shower checked it and the wire was touching her leg. so she called the doctor's and they were on lunch and were going to call her back and in the meantime she went to the bathroom and when she wiped it was on the tissue..and now she is worried that she may be pregnant..she got the mirena dec 3rd and today it has been a month she had it..her and her husband had sex daily sorry for (TMI)..so she is a wreck about bein pregnant. she has 2 children already and the baby will be 4 months old on the 8th...does anyone have any idea what the chances are she could be pregnant? also she went to doctor's and they said wow this is rare! the last 2 days now she is bleedin heavy but only when she goes to the bathroom and she has been passin clots(TMI) sorry..we did do a test and it was negative... any thoughs would be greatly apperciated",
            "post_id": "3852963",
            "timestamp": "1231460241",
            "user_id": "user_730837",
            "user_link": "/personal_pages/user/730837",
            "votes": "0"
        },
        {
            "answer": "Last post correction. My sister's mirena fell out monday morning",
            "post_id": "3852979",
            "timestamp": "1231460401",
            "user_id": "user_730837",
            "user_link": "/personal_pages/user/730837",
            "votes": "0"
        },
        {
            "answer": "I had Mirena fitted July 06 and removed Nov.26.08.  For two and half years I had spotting everysingle day with periods that were light.  I spotted for two days post removal. Dec. 1.08 I had a heavy period for five days.  I beded Dec.19. with withdrawel method. Given a 28 day cycle which is normally what I am, I am 12 days late, on a 35 day cycle im five.  I have not come back on my period as of yet. I did  a HPT on the 31rst of Dec. with a negative result.  Could I be pregnant?? Has anyone ever had this happen to them, should I do the test again??  I have no sign of the period coming whats so ever.  Anyone have any suggestions, ideas.Thanks .. confuzzled.",
            "post_id": "3855926",
            "timestamp": "1231529213",
            "user_id": "user_731563",
            "user_link": "/personal_pages/user/731563",
            "votes": "0"
        },
        {
            "answer": "hey there. i cant say that i had morning sickness that woke me up but when i was up it was horable. if anyone is having problems with nausea suck on sperimint candies i am a nurse and i sware by them. Other then that the nausea has since subsided around 9 weeks. which then after losing 5pounds i got the flu three days later and have since lost 4 more pounds also due to prior stomach issues i have had. my biggest problem now is TRYING to gain weight. sounds stupid. i spent the last 2 years getting rid of my sons baby weight. well since i am finally at 14 weeks the fear of miscarriage is fadeing away. to everyone trying to concieve i have 2friends who are also pregnant immediately after mirena removal.so good luck to you all in babymaking, just remember to enjoy the process, almost wish it would have lasted a little longer for the fun reasons...hehe",
            "post_id": "3868041",
            "timestamp": "1231818256",
            "user_id": "user_674822",
            "user_link": "/personal_pages/user/674822",
            "votes": "0"
        },
        {
            "answer": "My story is not much different that many of you...Had mirena put in in april 05 and had it removed in Oct 08.  Loved it - never had a period.  Now i'm concerned that maybe that wasn't such a good thing.  My cycles have varied from 24 to 31 days.  I've tried OPK's twice and I don't get a positive at all.  I realize I could be using them at the wrong time, but uuuggghhh.  I just want to get pregnant so bad.  I'm going to use an OPK daily from the end of this cycle until the beginning of the next.  If they are all still negative, I'm going to the DR for help.Congratulations to the ladies with pregnancies after removal...I pray to be preggo with you soon!",
            "post_id": "3869222",
            "timestamp": "1231854877",
            "user_id": "user_734941",
            "user_link": "/personal_pages/user/734941",
            "votes": "0"
        },
        {
            "answer": "Hi I am new to this thread, but very interested. I have read most of them but still have a question that I don't think has been answered.I had my Mirena in March 05 just 6 weeks after our 4th baby died of Sids. At the time we were unable to make any permanent decision and were advised this was our best option. Up until this time I had not had any other forms of contraception so unable to compare coming off them. Prior to this I also did not have any regular AF's so unsure of cycle, and have had no spotting or bleeding since the day it went in.Today I finally made the decision to have the mirena removed and wait and see what happens, deep down I REALLY want a baby but keep saying that what will be will be.Anyway back to my question/query I am currently 35years old, with no idea as to my cycle and trying to act all blase but am wondering if there is something/anything I can do that might help to see if this will happen sooner or never. I don't want to hang around for the next 12 months to two years wondering and waiting only to admit that I am too old.Is it worth asking for fertility treatments? Can this help? At my age is there any hope?",
            "post_id": "3877292",
            "timestamp": "1232018918",
            "user_id": "user_736896",
            "user_link": "/personal_pages/user/736896",
            "votes": "0"
        },
        {
            "answer": "OK I am new to this and I am so very Thankful that this thread is still going.. I am so confused though...I had my IUD in for 5 years had it removed for a week (Dr couldn't get it back in on the same day) had the second one in from Feb. to Aug. My Dr told me that I was due to ovulate soon and that it would be fine to start trying right away... got it removed on friday and starting what i thought was my period on sunday...was fairly normal like.. then nothing for alittle over a month- then when i did get it i got it BAD!!! I mean I went through 18 tampons and pads on day one!! Bleed through them all - was changing them every 1/2 hour- thought maybe it was my let down bleed...then 34 days later AF visits...now I am on day 57 since my last visit and still negative test results...I have been taking my temp and this month I have been pretty steady - no real highs and lows...After reading all of this thread I am concern yet hopeful at the same time..I think I am going to call my Dr this week - the waiting and wondering what is going on is driving me batty...My whole life I have wanted nothing more then to have a family- hubby not so much-now he is on board and I am scared that I have messed up my body and we can't...",
            "post_id": "3887454",
            "timestamp": "1232252635",
            "user_id": "user_739315",
            "user_link": "/personal_pages/user/739315",
            "votes": "0"
        },
        {
            "answer": "I had my IUD fitted in august 08 and it was because I did not think it was time for baby number three.  After being miserable this past six months I called my Dr. to make an appointment and see if there is reason to why I have had so much pain especially after intercourse with hubby but the nurse kind off try to tell me that I was basically acting like a baby with made me cry (another wonderful side affect of the mirena)  so after I cried she told me she would call me Monday morning with an appointment.  I know my Dr. is going to try to talk me out of having it removed but My husband and I are doing really well in life right know and would love to have another baby.  I need to be strong when it comes to the Dr.  I will keep you all posted.  Good luck to all off you ttc!",
            "post_id": "3937033",
            "timestamp": "1233364130",
            "user_id": "user_751242",
            "user_link": "/personal_pages/user/751242",
            "votes": "0"
        },
        {
            "answer": "Hi all, first time poster, but I've read every single comment, and started reading this site about a month ago.  I had my mirena inserted on 4/12/05.  LOVED IT!  I had the typical spotting, cramping, etc, but nothing bad at all.  I think it's the best form of bc, for me anyway.  Well, today, I had my mirena removed.  It was easy!  I actually didn't realize the doc had done it, I was asking what I would feel and thought she was doing the pap, but all of a sudden, there it was.  No problem at all.  Now, it was taken out today- so not much to report so far.  Because of this site, I did go out and purchase $20 worth of maxi pads and super plus tampons....so we'll see.  My hubby and I will ttc starting maybe in April.  Want a few months to get back to normal.  I'll post more as time progresses and let y'all know how things go.  But removal itself, that was so easy- not painful, no bleeding or cramping yet.",
            "post_id": "3971797",
            "timestamp": "1234219519",
            "user_id": "user_760632",
            "user_link": "/personal_pages/user/760632",
            "votes": "0"
        },
        {
            "answer": "I had the mirena IUD in for 1 year. I had it removed in October of 2008. My doctor said I could go ahead and try, so we did! I got pregnant Jan, I went to the doctor because I just didn't feel right about the whole pregnancy and they said they only saw a sac. They thought it might be too early to see anything, I went home and miscarried 4 days later. When I went back to the doctor to follow up, I asked a few questions, but never got stright answer. I believe it is from the IUD, but I am not sure. I want to try again, but I am scared. I am not sure what caused this. Any suggestion would be helpful.",
            "post_id": "4005650",
            "timestamp": "1235019794",
            "user_id": "user_770086",
            "user_link": "/personal_pages/user/770086",
            "votes": "0"
        },
        {
            "answer": "Hi i'm new here also.  I find myself reading this thread alot seeing if i'm like everyone else I guess.  The Dr. just nodded and said be paitient and don't try for a few months.  I asked if I would be getting my AF right away and she told me probable not since I had mirena in for 2+ years and never had a period.  Two hours after removal on feb 16  which I didn't even feel I was bleeding everywhere.  I figured it was the post removal bleeding that everyone was taking about.  We are TTC are 1st together I already have a five year old and he was very excited to try I stopped bleeding on the 17th practiced that night but have been bleeding very heavy scince.  Would this be the start of my period???  Any help or answers would be great.  Should I test for ovulation next week?",
            "post_id": "4007515",
            "timestamp": "1235071078",
            "user_id": "user_770592",
            "user_link": "/personal_pages/user/770592",
            "votes": "0"
        },
        {
            "answer": "I got my mirena IUD removed Oct. 29 in hopes of conceiving in Dec. Well it is now going on March and no luck. It makes me frustrated to hear some of you getting prego so fast. About 1 month after having it removed, it seems my periods have been back to normal.  I don't know what the problem is. I have one little girl 21 months and I SWEAR it took me less than one month to conceive her.  I loved it while it was in (cause no periods) but now almost regret it. Any advice??? Am I just tooimpatient??",
            "post_id": "4039556",
            "timestamp": "1235811810",
            "user_id": "user_779372",
            "user_link": "/personal_pages/user/779372",
            "votes": "0"
        },
        {
            "answer": "Hello again, I posted earlier - I'm the one who had the mirena for 4 years and loved it- best bc method I could imagine.  Had it removed on Feb 9th.  Based on the postings earlier, I was armed with three bags of pads and tampons ready for weeks of horrific bleeding.  Instead, I waited until yesterday, when I finally got my first period in 4 years.  It has been, so far, entirely normal.  No cramping at all (I typically would have bad cramps) and not unusually heavy or chunky at all.  I'm going to wait to have another period next month, hopefully that will also be normal and then ttc in April or May.  Right now, we're just not fooling around and we're fine with that.  We want to wait until things normalize (which everything already appears to be normal) and then start trying.  I do want to say, to gbj819, that I think 1 in 3 pregnancies result in a miscarry.  It's so common, so please do not worry unnecessarily.  If you have several miscarriages, definitely speak with your doctor and see what the issue could be.I'll post again in several months to give an update, or if anything bizarre happens, I'll be sure to note it.  But so far, so good - nothing at all out of the ordinary.",
            "post_id": "4040434",
            "timestamp": "1235844076",
            "user_id": "user_760632",
            "user_link": "/personal_pages/user/760632",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed and was pregnant with in 3 months!!",
            "post_id": "4040600",
            "timestamp": "1235847803",
            "user_id": "user_779672",
            "user_link": "/personal_pages/user/779672",
            "votes": "0"
        },
        {
            "answer": "I have the same concerns as you.  I had my Mirena out in August.  I had an irregular period in October (was about 2-3 weeks late, but had negative hpt and blood test).  After that, I became pretty regular (28 days +/- one or two).  We continued ttc.  This month, I was supposed to start on Feb. 18.  Now (45 days later), still haven't started, but have negative hpt and blood tests.  It's very disappointing, but I think I'm just not regular yet.  I thought I would at least be regulated within six months.  I was prepared for it to take a while to concieve, but did not plan on it being so hard to track my cycle in order to concieve.  BTW - I'm about to turn 29 and this is our first time ttc.",
            "post_id": "4055588",
            "timestamp": "1236196156",
            "user_id": "user_783558",
            "user_link": "/personal_pages/user/783558",
            "votes": "0"
        },
        {
            "answer": "hi, first time posting. i don't know how totally on topic my question is, but it's worth a try. I had my son jan 05, i was 17, and had the mirena iud put in 6 weeks after that. I still have it in, but started having semi-normal periods again around oct 08. I had a 4 day light period last mthe iud still in, but this is frusterating. any advice would be awesome. thanks.onth (feb 09), then about 2 weeks ago started noticing some crazy things happening. My breasts got very sore and started to grow, i started getting dizzy and light headed everytime I stand up, i get nauseous by smelling certain strong odors, and i've had very very light spotting for a couple hours a day for the past 6 days.... I feel pregnant, but all the tests are coming back negative. I should have started my period today, and haven't. does anyone know what's going on? I'm 21 now, and we want to have another child, but i'm not sure what's happening. I know it's possible to conceive with the iud still in, but i'm starting to get frusterated. any advice or comments would be appreciated.p.s. i'm going to an OB on tuesday to have the mirena removed.",
            "post_id": "4063900",
            "timestamp": "1236366904",
            "user_id": "user_785758",
            "user_link": "/personal_pages/user/785758",
            "votes": "0"
        },
        {
            "answer": "I posted earlier in feb.  saying that I was having lots of pain well this is what happened.  I went to see the normal nurse at my ob office who check the IUD it looked normal then but she felt some lumps so she sent me for an ultrasound which came back pretty normal jusy a couple of small cysts.  I was told to come back if I still had pain which i did so I went back.  I saw a specialist this time and he gets me up on the table to check the IUD and he couldn't find it.  Just want I wanted to hear!!!  So he did an ultrasound and it was all in side of me so now I have to have a procedure to have it removed.  The dr. had the nerve to ask me what day I would like to scedual to have it put back in.  AHH no thanks Doc but I will be going back to the pill. I about six months to a year we wil ttc but for now just waiting to have my procedure which is march 16 I will let you all know how it goes.",
            "post_id": "4068005",
            "timestamp": "1236477935",
            "user_id": "user_751242",
            "user_link": "/personal_pages/user/751242",
            "votes": "0"
        },
        {
            "answer": "Wow, what a great website! All your stories were very informative, so here's mine...I am 31 and had my mirena iud inserted 2/05. It stopped my periods completely, immediately. I would have maybe 2 days of very light brown spotting every few months at most. Never had any difficulty with it. I did begin to have the brown tinged jelly like discharge in 9/08, the docs said it was just d/c that accumulated around the strings and eventually it gets heavy enough to fall off. No biggie. I had it removed 2/9/09. Next two days had moderate spotting, but not enough to be considered a full on period. Nothing since...am waiting 4 months to ttc. will post again when there is a change. :)",
            "post_id": "4069528",
            "timestamp": "1236535059",
            "user_id": "user_787317",
            "user_link": "/personal_pages/user/787317",
            "votes": "0"
        },
        {
            "answer": "First of all these stories are very informative. Here's my story maybe someone can help me. i had my mirena inserted 6/05. i bled irregularly for about 3 months then stopped all together. i had it removed the beginning of november 2008. i bled heavily (extremely) for about 5 weeks then stopped. i didnt bleed again until the beginning of feb. and have bled ever since. it is heavy and then gets lighter (not much) and then heavy again. i have an appt with my gyn but i wanted to see if anyone else had a similar problem. i was told i could get pregnant immediatly but obviously not. i guess what im asking is if anyone else has had the heavy clotty bleeding since having the mirena removed.",
            "post_id": "4070311",
            "timestamp": "1236553115",
            "user_id": "user_787559",
            "user_link": "/personal_pages/user/787559",
            "votes": "0"
        },
        {
            "answer": "Hello I wrote earlier and to day is the day I get it removed with the scoope and the \"pintchers\" (I don't know what to call the :pintchers\")  I will let you all know later how it went.",
            "post_id": "4097536",
            "timestamp": "1237232742",
            "user_id": "user_751242",
            "user_link": "/personal_pages/user/751242",
            "votes": "0"
        },
        {
            "answer": "It's me again! Just got home that was pretty scary I got the biggest shot up in my cervix with lanocain and epenepherin (don't know how to spell) that made my heart race and made me shake all over.  then he went poking around till it made me bleed every where. then he used the pintchers and got the IUD and removed now it's out and I am bleeding pretty bad. The moral of the story is always check for the strings of your IUD or they might go missing. LOL",
            "post_id": "4098801",
            "timestamp": "1237254095",
            "user_id": "user_751242",
            "user_link": "/personal_pages/user/751242",
            "votes": "0"
        },
        {
            "answer": "In january of 2006 I had my first son, and a month later (a day before my birthday) i got the mirena iud put in. now almost three years later; Feb 12 2009 i got it taken out. i read that you were able to get pregnantright away, but from reading other sites and other women's experiences it could take anywhere from 4 days to 2 years all depending. A day after getting it removed, i got my period and it lasted about 4 days; and it was very heavy. now it's march 16th and no period.. i know im not That late but i have taken a test, along with a couple others due to being impatient. I have been feeling icky lately, and im really bloated. my breasts are very tender and hard to touch, also the aereola looks larger on each breast.My question is...is it possible to be pregnant with a couple negative tests?? I mean when i got pregnantthe first time, my body felt all the symptoms and i took three tests that were negative, and i ended up being about 3 months prego.Any help would be awesome. Thank you.",
            "post_id": "4100677",
            "timestamp": "1237308183",
            "user_id": "user_569730",
            "user_link": "/personal_pages/user/569730",
            "votes": "0"
        },
        {
            "answer": "4 days after my period would have come i saw one red spot when i wiped. nothing more for that day. then today (the following day) it's brown but a lil more than just a spot. not heavy... but could it be the start of my period/ is it impossible to have implantation bleeding AFTER your period?",
            "post_id": "4100795",
            "timestamp": "1237309891",
            "user_id": "user_569730",
            "user_link": "/personal_pages/user/569730",
            "votes": "0"
        },
        {
            "answer": "Hello all,This is my 1st post. I am so glad I found this site it has been nice to know I am not going crazy. I had my IUD put in 6weeks after 2nd child was born in Aug 06. i just had it removed Feb 19th. I started bleeding on Feb 21st then stopped Feb 26th then started back on Feb 27th and have been bleeding ever since very heavy and clotty. i called my OB today waiting on a call back.Me and my husband or wanting to have another baby. But after reading all the stories I am scared and now wish i never got the IUD in the 1st place. Also wanted to know if any one has had a pap done since removal of IUD and did it come back abnormal. Mine did. never had that happen before. The doc said i have to come back for another pap in June. I will post again with results. Any help is greatful.",
            "post_id": "4103927",
            "timestamp": "1237387376",
            "user_id": "user_796536",
            "user_link": "/personal_pages/user/796536",
            "votes": "0"
        },
        {
            "answer": "Just wanted to up date on my call back from my OB about the no stop bleeding. They said sometimes women do bleed along time but its not this long. They want to but me on birth control for one month. And that should stop the bleeding and get me back on track with my cycle. So then i can try to get preg. This stinks I really wanted to get preg soon. Will keep yall up dated.",
            "post_id": "4103980",
            "timestamp": "1237388386",
            "user_id": "user_796536",
            "user_link": "/personal_pages/user/796536",
            "votes": "0"
        },
        {
            "answer": "it is VERY possible to be pregnant and get a negative result..happened with both of my kids..took 5 tests with the first before it showed up and 8 tests with the second...you could be preggers!",
            "post_id": "4149515",
            "timestamp": "1238466174",
            "user_id": "user_810480",
            "user_link": "/personal_pages/user/810480",
            "votes": "0"
        },
        {
            "answer": "I have had my Mirena in place since july and I have had nothing but problems. I bled for a whole 5/6 months and I had to go on estrogen to thicken the lining of my uterine wall to stop bleeding. I have not bled a day since and that was about 2 months ago. I also developed a low grade lesion on my cervix and i have had extreme pain, does anyone know if this is normal, has it happened to you? I am not ready to ttc yet but i am debating wether or not to take it out becuase I know we will be ready soon and it seems like it takes some people a long time.",
            "post_id": "4149762",
            "timestamp": "1238470083",
            "user_id": "user_810551",
            "user_link": "/personal_pages/user/810551",
            "votes": "0"
        },
        {
            "answer": "I had mirena for 5 years after my 2nd child. And just recently had it removed on 02/26/2009. I bleed very lightly for 8 days. Not sure if that was my period. Had intercourse with my man for March 6,7,9,10,11, 16, 17,30 . Yesterday on 03/30/2009 my breast felt really tender from the moment I woke up, I was exhausted all day, urinated frequently throughout the day and extremly thirsty.  Not sure what to make of it yet.  We want another baby so I will keep you posted. A friend of mine has some medical background and said if you count the day after you stop bleeding out 28 days the on the 28 days for approx. 5-7 days you should ovulate.  Your temper will be a little warmer so keep track of your normal temp then during that time take your temper and if it's warmer than you could be ovulating.  PS.  I LOVED MIRENA  no problems, just bleed a little for a couple months then nothing WONDERFUL.",
            "post_id": "4227869",
            "timestamp": "1238520173",
            "user_id": "user_822406",
            "user_link": "/personal_pages/user/822406",
            "votes": "0"
        },
        {
            "answer": "I'm new here as so many of you are.  i found this website after having my mirena removed hoping to find people like me and I did.I had mine put in in August 05, pretty painful procedure having it put in and for a couple days after  but I loved the IUD and would do it again in a heartbeat.    It basically stopped my periods, just a bit of spotting and PMS about every 3 months or so.  I had it removed on March 25 09.  I had a couple days of light bleeding and then on the third day, I had bleeding like I would have for a first period day, but nothing to follow.   I am now day 9 post removal and have been very fatigued for the last couple of days, not sure if its related to mirena removal or not but I am also cramping off and on since removal.  Is this normal?  Was the post removal bleeding my period or the end of it since I may have had it removed during a very light spotting period??  So many stracge things that noone warned me about.  Thought you just got it removed and thats it.  HAHAMy husband and I are TTC, but now Im scared of miscarriage after reading all of these posts.  I am 34 going to be 35 this December and dont really want to wait a long time to conceive.  I have 3 children from a previous marriage (all delivered via c section), something else that concerns me about another pregnancy.  My youngest is 9 so its been a while since Ive had a baby.I would love to hear some more success stories from women who have conceived right away and carried past miscarriage point.I love this forum and am so happy to have found it.  I am glad to know that I am not alone and have experienced the things you have!Thank you to everyone who has posted and helped so many of us out here who would have been scared and lost without you!",
            "post_id": "4244329",
            "timestamp": "1238783536",
            "user_id": "user_849225",
            "user_link": "/personal_pages/user/849225",
            "votes": "0"
        },
        {
            "answer": "Im 31 yrs old and have a 14 yr old son. I had Mirena inserted on 3/12/09 has not been a month yet . I got my period 3/14/09 which was right on time and it lasted for 4 days but have been spotting since.  At times its light pink and others dark brown to light brown but most of the time its only when i wipe.. This week i had a break from spotting for about 4 days and low and behold the sec i think its over \"SURPRISE SURPRISE\". My ob said the spotting is normal for the fist month or so, and i am also suppose to stick my fingers \" you know where\" to feel for strings but i feel nothing im a little worried. Was anyone told to check for strings too? I have an appt on 4/9/09 to make sure its inserted properly. So far the only problem is the occasional spotting which i hope stops SOON! I am so greatful for this sight i thought i was alone with the spotting situation im very glad that im not. Will be checking in on occasions and hope to hear that some of the people who are ttc have gotten preg. GOOD LUCK GIRLZ!",
            "post_id": "4251073",
            "timestamp": "1238978602",
            "user_id": "user_851268",
            "user_link": "/personal_pages/user/851268",
            "votes": "0"
        },
        {
            "answer": "*My last post was Mar 31, 2009.Ok so I started my \"real\" period yesterday 04/05/09(heavy but not too heavy).  This is the real deal.  Post removal was very light for 8 days,but now seems to be normal. no clotting.  just slight cramps. Sleepy.  (the normal effects of being a women with a cycle).   We are wanting a baby so lets see what happens next.   PS. I have been taking prenatal vitamins to give my body a little boost since the day of the mirena removal 02/26/2009 :-)To wabs09- I had strange things happening post removal . My breasts were extremely sore, fatigue, nauseated, slight cramps but not too bad, bloating, a little moody, thirsty and a little more hungry than normal.  Today 040609 I really don't have all those symtoms any longer only the PMS symtoms :-)My OBGYN said the day of the removal that I could get pregnant the very next day depending on my body. She has had many cases like that.",
            "post_id": "4324182",
            "timestamp": "1239024591",
            "user_id": "user_822406",
            "user_link": "/personal_pages/user/822406",
            "votes": "0"
        },
        {
            "answer": "Hi, it is normal to have cramping following removal of the mirena.  When I had mine removed I had really bad cramping and bleeding for about 10-12 days.With regards to conceiving after a mirena you really shouldn't be any higher risk for miscarriage at all.  When I had my first mirena removed I conceived within 3 months and had a healthy baby girl - that was 7 years ago now :-)I always think it is sensible to give your body time to adjust to going back to nature and not try and rush things.  Once you've had a couple of natural periods then start your \"trying\" with gusto, lol.Good luck",
            "post_id": "4324289",
            "timestamp": "1239026929",
            "user_id": "user_479798",
            "user_link": "/personal_pages/user/479798",
            "votes": "0"
        },
        {
            "answer": "** Hello Ladies**I am 26, and have an 18 month old son. I had mirena out almost 1 week ago. It was fast & easy getting it out. My doctor said it's fine to conceive right away but I will wait till after normal AF. I didn't bleed the day I got it out but the next day I gushed all day, then stoped, then a couple times the next day and now just spotting here and there. I really didn't like like the iud experience but it was nice not having to take a pill. I am excitedly waiting for AF to try for #2... I love this group and will keep u posted :)",
            "post_id": "4328974",
            "timestamp": "1239128822",
            "user_id": "user_863419",
            "user_link": "/personal_pages/user/863419",
            "votes": "0"
        },
        {
            "answer": "I had my IUD in for about 3 years or a lil more. Me and my husband both were sure that we were done having babies...being that we already had two... and then we both came up with the bright idea that we needed just one more! I had my IUD removed on March 3rd, 2009...I found out I was pregnant on April 5th,2009! So there is no telling how fast I got pregnant. I had a period for 2 days after removal and ovulated 2 or three days after that. I may be 2 weeks pregnant...I may be almost a month pregnant! I just don't know! I am having slight cramps as if I were going to have a period...is that normal?",
            "post_id": "4333060",
            "timestamp": "1239218968",
            "user_id": "user_864648",
            "user_link": "/personal_pages/user/864648",
            "votes": "0"
        },
        {
            "answer": "hi ladiesI had my mirena fitted 3 1/2 yrs ago - at the time i was sure i didnt want anymore children but my doctor said he felt i was still too young to be sterilized (spelt wrong??) so to have this fitted for 5 yrs and if i still felt the same after this time he would put me forward to the hospital.Haha well i've proved him right in the fact of yes i was far to young to say no more babies as now i would adore a 3rd! I've finally talked my husband round and are hoping to plan to have another little one by August 2010.I've read alot about the mirena over the last couple of weeks as i'm trying to work out when i should have it removed - how quick can i expect to fall pregnant?I've had alot of miscarriages in the past and i'm alittle worried this is going to happen again before another baby arrives - has anyone experienced this?I've never actually had my coil checked in the whole time its been in and i'm worried alittle that i'll have so problems having it removed - is it painful?Also i've had alot of side affects whilst on this bc, ance (very very bad on face) alot of weight gain although eating habbits havent changed, alot more facial hair, mood swings and a bad hormonal inbalance (which i've been treated in hospital for) - has anyone else experienced anything like this or am i totally on my own lol??Natalie x",
            "post_id": "4334130",
            "timestamp": "1239237570",
            "user_id": "user_864973",
            "user_link": "/personal_pages/user/864973",
            "votes": "0"
        },
        {
            "answer": "Hello all! Had my iud in Oct 05 and had it removed Jan 2 09, no afs at all while having it. Had my first af 3 weeks post removal, i tried to chart from the day i had it removed but i founf the opk strips worked for me. upon using those i found out that i had my ovulation days completly wrong, The egg is only avail for 12 to 24 hrs to be fertilized so the opk are very helpful. i was also told to BD no more then once a day and better off to go every other day.it take sperm 24 hrs to mature again something else i didn't know. I'm glad to report that after 2 mo of trying and using the opks (that are extreamly cheap on ebay search LH test strips) that i'm preggers not only with my 4th but also a 5th.. twins whew! So dont give up and Good Luck to all those trying and Loads of BABY DUST to all that want it!!",
            "post_id": "4335871",
            "timestamp": "1239289423",
            "user_id": "user_865487",
            "user_link": "/personal_pages/user/865487",
            "votes": "0"
        },
        {
            "answer": "Loving this site as well!!  I had my mirena removed in march and considering pregnancy.  Haven't had a period yet, but some spotting on a couple different days.  I am however having alot of discharge that is very un-normal for me.  Anybody else have this after the removal of Mirena?   We are praying for twin boys and hope to add baby #6&7 by May of 2010.  Love reading all your stories and advice.  Keep up the good work!!",
            "post_id": "4336834",
            "timestamp": "1239305844",
            "user_id": "user_822411",
            "user_link": "/personal_pages/user/822411",
            "votes": "0"
        },
        {
            "answer": "I had my IUD removed on February 16th.  Conceived March 25th.  Congratulations me!I enjoyed the mirena the entire time I had it, 2.5 yrs.  I spotted for months after having it inserted, but then had short but regular periods following.I had my mirena removed during my period due to the fact I was told it was the best time because it would ensure I was not pregnant.  I spotted for a couple days after removal, but boy, my period came with a vengence and on time the following month.  It was clotty enough to raise suspicion, but nothing I was too morried about because I knew to expect some changes.There were obviously some changes after insertion and after removal... duh!  This is a hormone, your body will be doing some adjustments.  Energy levels, mood, intensity of period, spotting varies from person to person.  If there is one thing I know now from reading a million blogs is that it's unpredictable for any individual.  Don't fret, nothing is permanent... mirena did not destroy your body.  If you take good care of yourself, your body will work for you.  If you don't take good care of yourself, your body may not adapt to changes well.I planned on having my mirena taken out a few months before trying.  I have seen on more than one site that women would occasionally miscarry because their uterus was not fully prepared after months and years of an IUD (and its hormones) to sustain pregnancy.  I told him (the man)  to be careful or stay away for at least the first two ovulations after removal.THE GOOD NEWS: After playing it safe for a month and a half, I came back from a trip and BAM, we got a little excited... NOW I'M PREGNANT!As the vendor and doctors say, you can get pregnant immediately, so be careful because you should take the precaution of waiting a month or two rather than taking on the risk of miscarriage.Don't be niave either, you potentially could take several cycles to conceive.  There is such a thing as trying, that's why it's called trying... no one can guarantee success on the first, second, third, forth or even tenth try.  Everybody is different and if you're not in a condition to conceive, you won't.  Take immaculate care of yourself pre- and post-mirena removal with exercise and a healthy diet.  And by all means if you're overweight, lose some weight.  Fat cells (generally storage fat cells- adipose and visceral fat) release estrogen which in excess can prevent you from conceiving for several reasons.  Take care of youself and listen to your doctor... in time it will happen.",
            "post_id": "4341834",
            "timestamp": "1239420451",
            "user_id": "user_867255",
            "user_link": "/personal_pages/user/867255",
            "votes": "0"
        },
        {
            "answer": "Hello everyone!!! This is my first post and I have read almost all them. I have two boys ages 3, and 4. When my second son was just 3 months old my husband left for iraq so i went off birth control. He was scheldualed to come back for two weeks on leave. so idecided to have the mirena fitted. We recently decided we were ready for a third.I personally would not have it placed again. I broke out all the time, and had severe headaches. Mirena was tolerable.   just had it removed March 24, had what I think was a normal period for 7 days normal bleeding normal cramps. I have been very tired, and smells are stronger but nothing else. hopefully at the end of this week the test is positive.My main concern is not waiting long enough. I just started to research and I am reading alot of stories about women who having misscarriages. My doctor, the most wonderful woman, told me otherwise.I am hoping that I can bring good news to all, and maybe give hope that we can have a successful pregnancy after the iud is removed.GOOD LUCK TO ALL!!!!!",
            "post_id": "4357073",
            "timestamp": "1239816007",
            "user_id": "user_872041",
            "user_link": "/personal_pages/user/872041",
            "votes": "0"
        },
        {
            "answer": "Hi, you'll have to keep me posted.  We have decided we want to expand on our little family too.  I had the Mirena IUD for 4 years and had it removed on the 10th of March.  The home preg. tests keep coming back negative but I have yet to have a period.  Just some slight pink spotting on a couple different days.  Defenatly not a normal period at all.  A friend suggested implantaion bleeding but like I said, the last test was negative.  I have no way of knowing if and when I might have ovulated as well. I read some pretty horrific stories as well.   My doc told me the same thing.  Not to worry, mirena was not associated with miscarriage.   So anyway, good luck and props to you and your husband for serving our country.  (It must be really hard to be without him for such long periods, what a sacrafice for you both.)",
            "post_id": "4360498",
            "timestamp": "1239891533",
            "user_id": "user_822411",
            "user_link": "/personal_pages/user/822411",
            "votes": "0"
        },
        {
            "answer": "Hi! I had the Mirena for almost five years (inserted Apr 04, removed Feb 09).  I am not actually trying for a baby but not trying to avoid a lil one either. My thing is...my periods have been \"normal' but extremely heavy with a lot of clotting.  I have never had this before.  I am  concerned because of the heavy bleeding and the fact that I KNOW I had sex with my fiance at the right time of fertilization (everyday the past month) and still am not pregnant.  I know I am anxious and this may play a part but I have children already and never had a problem conceiving....I am worried that Mirena has made me sterile or just messed up my body enough that I can't get pregnant.  This is so damn frustrating!!  Help, anyone???",
            "post_id": "4372505",
            "timestamp": "1240184019",
            "user_id": "user_876735",
            "user_link": "/personal_pages/user/876735",
            "votes": "0"
        },
        {
            "answer": "All the docs swear that mirena is the best and really has no adverse effects on conception later.  But it does seem like alot of people have trouble afterwards.  I guess though it's true what they say about getting your self all worked up and how it messes with your ability to concieve sometimes.   So like you, I am waiting and wondering what is normal, but still waiting to get over the first hurdle..... my period.  I have yet to start since the removal of the Mirena.",
            "post_id": "4374092",
            "timestamp": "1240233693",
            "user_id": "user_822411",
            "user_link": "/personal_pages/user/822411",
            "votes": "0"
        },
        {
            "answer": "ohiomama: Maybe yuor body is taking a little longer to adapt. If I were you I would give it one more month and see how your periods are then. I know it's frustrating, and reading all the horror stories don't help, but if you really are concerned see your ob.  I had my first period 2 days after it was removed and  i had some clots as well but normal bleeding, and I figured my body was just cleansing itself.momof5grlz: I have been really tired especially this past weekend, and really hungry. This could be pms symptoms as well, but I am getting anxious to see if my husband and I were successful. Part of me wants to be prego now, but part of me feels that waiting one more month would be better in the long run.  I am due to get aunt flo thurs. so we will see if she is absent. I will keep you posted.I want to give you both some advice. This is something I read. If you are trying to get prego start taking prenatal vitamins asap. Do not quote me on this, but I believe I read it on the mirena website.  Mirena thins the lining of your uterus, but if you take baby asprin it will help to build it back up faster. Like I said don't quote me on that and google it if u have to.",
            "post_id": "4374474",
            "timestamp": "1240240109",
            "user_id": "user_872041",
            "user_link": "/personal_pages/user/872041",
            "votes": "0"
        },
        {
            "answer": "Thanks for the advice and good luck on whatever happens Thursday.  I have been on vitamins now since I had the IUD taken out.  Don't feel like I can afford to take the chance being that I am not getting any younger.  My body has already shown signs of age in other ways, don't want my reproductive system to get crazy too.  Also been trying to eat a little better and exercise more.  Will keep you posted.",
            "post_id": "4374727",
            "timestamp": "1240244322",
            "user_id": "user_822411",
            "user_link": "/personal_pages/user/822411",
            "votes": "0"
        },
        {
            "answer": "I FINALLY got AF!!!  I think anyway,  hopefully this time it will be a full period and not just spotting and disappearing again.  But it was definalty more than the last time already.  It will be nice to have a normal cycle again and try to figure out my body!  I have  a little cramping but not much at all.  Certainly nothing to complain about!!!  How are you gals doing?",
            "post_id": "4378057",
            "timestamp": "1240316510",
            "user_id": "user_822411",
            "user_link": "/personal_pages/user/822411",
            "votes": "0"
        },
        {
            "answer": "Congrats!!!  I really hope that it is a normal cycle for you. This brings you one step closer. Now that you have a piece of mind you can throw all your worries away and try to expand your family.  Well good luck to you and enjoying ttc.",
            "post_id": "4378670",
            "timestamp": "1240326403",
            "user_id": "user_872041",
            "user_link": "/personal_pages/user/872041",
            "votes": "0"
        },
        {
            "answer": "** Hello again ladies...I poasted at the begining of April. I had Mirena removed & had a lot of bleeding from the removal. Just to let you know that the bleeding after removal is NOT your period. I just got my normal period 28 days from my last one, which I am very surprised from how much blood I lost a few weeks ago. Now we are going to try to get preggo with #2. I am so excited and I love reading all of your similar stories.Hopefully I can come back on soon with preggo news.Good luck to all TTC....",
            "post_id": "4382705",
            "timestamp": "1240410381",
            "user_id": "user_863419",
            "user_link": "/personal_pages/user/863419",
            "votes": "0"
        }
    ],
    "post_id": "124152",
    "question": "Has anyone had the Mirena IUD and had it removed to ttc. I am just curious how long it took you to conceive after Mirena IUD removal?  How long until your menstrual cylces were regular? I got my IUD out on Aug 5th and am ttc. I have had lots of spotting and maybe a period but nothing regular.  I called my doc and they said that it takes 3 months before the hormones are out of your system. The mirena website makes it sound as though you can get pregnant anytime after removal.  Any advice/stories would be appreciated.  Thanks.",
    "timestamp": "1160629200",
    "title": "How long did it take you to conceive after Mirena IUD removal?",
    "user_id": "user_162948",
    "user_link": "/personal_pages/user/162948"
}