{
    "answers": [
        {
            "answer": "A few friends of mine have had a miscarriage and a D&C.  They both got pregnant either with the first cycle or the second cycle (depending on when they tried, one tried after  the first and the other after the second).  They both went on to have healthy babies.I was told to wait 3 cycles due to emotional reasons.  After doing a lot of research and talking to friends who've had D&C's found that you really should wait one cycle (although many women have gotten pregnant before the first cycle and have had healthy babies from what I read).From what I read, by giving yourself one cycle that allows your body to make sure it expels anything extra that was in the uterus and also gives you a LMP to help determine due date.  Also I read that fertility monitors aren't accurate before the first cycle because you could still have hormones in your body from the miscarriage.As of now, my husband and I plan on waiting a cycle before trying, because emotionally I couldn't bare not to be pregnant and have another child.  Also, I made an apt to meet with a midwife this time around to see If I want to use her as a dr this next time around, I plan to ask her opinion on when to TTC as well.  That apt is on the 23rd.When I asked my last dr (OB) why 3 cycles and what if we tried before he basically said that if I did for some reason have a miscarriage that I would blame it on not waiting long enough to try.Honestly, if you are healthy and had no other miscarriages (this was your first) then I've heard that it's not as big of a deal, however some women have other health issues and do need to wait longer to try again.  Also if its past the 12 weeks that the baby passes then I've heard you do need to wait longer as well.",
            "post_id": "5166098",
            "timestamp": "1260563510",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Hi, I had a miscarriage 3 wks ago, they told me to wait until 2 cycles as the 1st one is always not a true period and waiting for the 2nd one can determin the due date better. I had a natural miscarriage and after the scan they told me everything looked bk to norm. I am hoping my period will be here nxt wk and we are not waiting for 2 cycles we are going to try as soon as I  have had my 1st cycle as I know I will only be happy again once I am pregnant. However it is different for each person, it depends on if your miscarriage was natural or not, whether everything has passed and is bk to norm and abut you as awhol i.e. how you are coping etc so I suppose only you know how you feel emotionally but physically is all back tonormal inside after the scan?",
            "post_id": "5166103",
            "timestamp": "1260563612",
            "user_id": "user_1127390",
            "user_link": "/personal_pages/user/1127390",
            "votes": "0"
        },
        {
            "answer": "I'm okay I think. I haven't cried in 2 days which seems silly to some people but I have cried so much lately. I feel fine. I am now just spotting. I know I passed the sac on the first day b/c I actually saw it. It was mortifying but then again, I was glad to know that part had passed. The doctor said I needed to come in for weekly HcG tests to make sure my levels are dropping properly & the day after the sac had passed my levels had gone down more than half. I am hoping next Monday when I go in they'll be down even lower. I don't want to wait if it's only due to emotions. I have been more than ready. We weren't actively trying when we last got pregnant but we weren't using precautions either. Now that this has happened, we are more than ready to try again. I was just curious to what others have gone through. Again, this was mt only miscarriage with no warning signs until the ultrasound showed an empty sac. The only thing I worry about it the lasting effect of the Misoprostol that I was prescribed to induce contractions. I didn;t have a D&C so I don;t know how much \"healing\" my body would need.  I;'m so sorry for your loss. I know how hard it is. Most people have been wonderful but I really appreciate hearing from people who actually experienced it as well. I keep trying to tell myself it could be worse but I want so badly to speed up time so we can be pregnant again. Good luck. Keep me posted. And thanks for replying.",
            "post_id": "5166268",
            "timestamp": "1260567050",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "I just thought I would update you on the past week of what I've learned etc.  I meet with a midwife and she said that after a D&C you should wait 2 cycles (I'm sure it's different if you didn't have the D&C since they scrape out the lining during the D&C).  so far I've heard three different stories from three different dr's.  The first said 3 cycles, the second said 2 cycles, and the third said to wait one normal cycle (Told by the dr who did my follow up apt).My husband and I feel comfortable waiting to try once I get my next period as It should be here some time this week due to when I believe I ovulated.  That would put us at one normal cycle.I'm glad your feeling better and I understand the need/want to just try again.  Did you like your dr?  I guess after the past few weeks I think the best advice that I got and took to heart was to talk to a dr (if it's the last one or a new one) and see what they'll do to help me feel better during the next pregnancy.  Since you had the miscarriage I'm sure you'll be worrying the entire time, try to find a place that helps make you feel more comfortable.  The midwife (A certified nurse midwife) that I meet with I have decided I really like.  Once I find out I'm pregnant I'll be seeing her as soon as they get me in.  She has evening hours so they work with my work schedule.  She also does an ultrasound at every apt if she doesn't hear the heartbeat (that's the gold ticket item for me!).  She also has the first visit an hour, and every other one 30 min so that way she gives you more personal time.  After meeting with her I'm not as scared about the next pregnancy (don't get me wrong, I'm still scared to death, but feel safer I guess).Also, after talking to the dr's it sounds like if you miscarry naturally there really is just an emotional reason to wait.  They give at least a little time due to in a D&C they actually scrape the lining, so after one cycle it flushes out anything left behind as well as starts to give a new plush lining.  After two or three cycles it gets more plush.",
            "post_id": "5214704",
            "timestamp": "1262113752",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "I have gotten the same run around from various people as well. Its so hard to get a straight answer but I guess that's partially due to us all being different. My doctor originally said one cycle. I was okay with that at first because at the time, I felt so overwhelmed. I talked to my sister in-law who happens to be a nurse & she said, with a natural miscarriage or one using the medication to induce labor, they recommend a month but that's usually only to better date the new pregnancy as well as for emotional reasons. I wasn't sure how I felt then. My doctor has been having me come in weekly for HcG blood draws to monitor the levels. The day after the initial passing of the sac (sorry for graphics) my HcG levels was already down to the 2300s, The following Monday, my HcG was already to 36. Last week it was at 6 and then this past Monday, I was finally at 0.  The nurse who called me to give me the final blood results asked if I had had a period yet, which I haven't, and then said I should expect one soon. That was two days ago. I am kind of nervous for my period only because I have heard the 1st one following a miscarriage can be more intense than ones we have become accustomed to having.  But I am excited to have it come so I can feel normal. The nurse also said \"Good luck, you can go ahead & try again!\" knowing that I still haven't had a period. So I don't know. My husband is really nervous & wants to wait until the period because of the medication that I took to induce labor since I was unable to miscarry on my own. He's afraid that there might be lingering effects of the medication in my body that could potentially cause harm to a new baby should be get pregnant again quickly. I have been having my blood monitored so I know there's not but it's hard for us both, emotionally I guess. I don't know what we're going to do. Part of me wants badly to get pregnant again to move on but then part of me is worried & scared. I don't want to get all hyped up & actively start trying only to be disappointed if it doesn't happen right away but it's so hard to not chart my ovulation. I never had trouble conceiving in the past but this time, I'm just more nervous. I don't have an actual appt with my doctor until January 21st so until then, I'm just going to see what happens & hope for my period to come.Keep me posted Cocacolapanda on your progress & success. I wish you the best!!!",
            "post_id": "5217349",
            "timestamp": "1262183847",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Well I hope you get it soon!  Mine just started this morning!  So far it's exactly like what I normally have.  This first \"real\" cycle seems to be exactly like mine should be except I've been having more PMS mood issues.  As far as the rest my cycles are pretty hard to begin with, lots of painful cramps and lots of blood, so far it's exactly the same.Now that it's returned I do plan to TTC now, YEAH NO MORE CONDOMS, lol.  I am scared of getting pregnant too, I just don't want this to happen again especially since there isn't anything I can do to prevent it.  Since I had the D&C we needed to wait for the first normal cycle before we could try.  Now that I've had my cycle back It just feels like it's bringing new hope.As for the meds in your body that they gave you, I wouldn't worry about it too much most meds get out of your system pretty quickly.  The longer you take them the longer it takes to get out of your system though.  Waiting for your cycle to return SHOULD be long enough.  Although if your really worried you can always call your dr's office and ask.I really hope that everything turns out well for you, keep me posted!",
            "post_id": "5218147",
            "timestamp": "1262200810",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Hey! Great news on having your period again. Sorry that it arrived just in time for the new year which hampers your festivities. I wondered though, when was your D&C?  I just wondered how long it took before your period came. Still no sign of mine coming even though the nurse said it would be here any day.Hopefully, just like you said, this is bringing you a new beginning. I am always excited to hear peoples success stories so please keep me posted. A woman I work with had a D&C in late October, & is already 6 weeks pregnant so basically, she got pregnant immediately following her D&C. That gives me hope too.I can't believe I am excited for my period as normally I would be dreading it but I just hope it gets here soon!  I will be checking here these next few weeks to see if you've success has progressed. I've got my fingers crossed for you.Happy New Year!Jessi",
            "post_id": "5220713",
            "timestamp": "1262268805",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "You wonderful ladies are all so strong & give me hope.  I have my D&C scheduled for wed & am so nervous.  I am 37 & have to conceive thru IVF due to a clogged tube & just hope that this doesn't interfear with anything.I am so nervous & scared!!!!!!",
            "post_id": "5221905",
            "timestamp": "1262296643",
            "user_id": "user_1084048",
            "user_link": "/personal_pages/user/1084048",
            "votes": "0"
        },
        {
            "answer": "Hey just thought  i would update you aswel, I got my 1st period on Xmas day would you believe!! I am on day 8 of my cycle and we have already started trying, I am praying to god that we will conceive this month as it would make us so happy! I am beginning ovulation testing on day 10 which is Sunday and then it's every other night loving required from then til about day 20 ha ha wish me luck :O)",
            "post_id": "5224191",
            "timestamp": "1262384095",
            "user_id": "user_1127390",
            "user_link": "/personal_pages/user/1127390",
            "votes": "0"
        },
        {
            "answer": "I'm sorry to hear that you have a D&C scheduled. I understand your pain & range of emotions.  This may seem like the hardest time of your life.  It does get easier. I hated when people said that to me but from someone who went through it, I gotta say, I believe things happen for a reason. You will overcome this & bounce back ready & stronger to support a healthier pregnancy.  Good luck to you!! Keep us posted!",
            "post_id": "5225616",
            "timestamp": "1262441758",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Congrats to you as well about a period! I am still waiting. My miscarriage was on Dec. 6th, so mine  hasn't been a month yet & my cycles are usually around 29-30 days so maybe this next week I'll have one but who knows, it could take weeks. I hope not though!  I tried to track my ovulation after the miscarriage b/c they say you're more fertile after one but then I've also ready that its very decieving b/c the tests might say you are ovulating & your not really. Since I haven't had my period, I might just focus on trying to lose some more weight. That's what I think is most unfair about the miscarriage b/c since it was my 2nd pregnancy (I have a beautiful 5 yr old daughter from a previous marriage) my body took on pregnancy weight real quick. It was hard for me to hide being pregnant b/c as my doctor explained, my uterus went into pregnancy mode from remembering when I was pregnant before so it explanded & I started gaining weight. Now that I have lost the pregnancy, I still have the weight. Not fair at all. So I think I will put all my energies into losing that so I don't drive myself crazy waiting for a period.  How many weeks did it take before your came?  6-8?  Just wondering since I'm not as far along in this process as you are. Good luck to you!  Please please keep me posted as your success stories are still helping me with my grievance & giving me hope.Jessi",
            "post_id": "5225643",
            "timestamp": "1262442488",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "I came on within about 30 days of my m/c and I normally a 28-29 day cycles so I got bk  to normal pretty quickly!! You will feel miles better once you get period as then you can focus on conceiving again. I am feeling alot better now with trying again however I still feel sad that I lost the baby we had. xx",
            "post_id": "5226068",
            "timestamp": "1262454812",
            "user_id": "user_1127390",
            "user_link": "/personal_pages/user/1127390",
            "votes": "0"
        },
        {
            "answer": "hi,i have pcos and recently misscarried at 15 weeks. i really want to start a family but i dont want to replace the little boy we have just lost. i dont no why im feeling this way but there is all sorts of things running through my mind things like, he was such a perfectly formed baby from what i could see (we got to spend an hour and half with him) why had he been taken away from us the thing we had wanted for so long (ttc for 3 years) and most of all i dont feel im ready to start ttc again yet but there is something telling my that the spirit of our little one is still inside me waiting to be born again. do all this sound silly?we had a minister visit the hospital to name (Alfie Lee)our little one and bless a chritstian which really helped us to let go and say my goodbyes.i would like to thank all you strong ladies who have been sharing your experiences in this forum i no its hard but together we will all get by  xxHUGSxx",
            "post_id": "5228214",
            "timestamp": "1262519837",
            "user_id": "user_418703",
            "user_link": "/personal_pages/user/418703",
            "votes": "0"
        },
        {
            "answer": "I am so sorry for your loss, I cried when I read your story. I think it is early days for you at the moment, it used to drove me crazy to hear people say time is a great healer but it's true, it's 2 half months now that I had my miscarriage and we have started trying again as this is the one thing I want most a baby and to delay that makes me miserable. I hope you get stronger soon but by having another baby when you are ready won't be replacing Alfie, you will never forget him. xxxx",
            "post_id": "5228684",
            "timestamp": "1262536645",
            "user_id": "user_1127390",
            "user_link": "/personal_pages/user/1127390",
            "votes": "0"
        },
        {
            "answer": "thank you for your reply, wishing you all the best in ttc xx",
            "post_id": "5228977",
            "timestamp": "1262543120",
            "user_id": "user_418703",
            "user_link": "/personal_pages/user/418703",
            "votes": "0"
        },
        {
            "answer": "I too, was sad reading your posting & want you to know that you can chat on here as often as you like. These postings have helped me so much with dealing with my loss. Hearing other women & what they've gone through has kept me going & become more determined to get through this. I realized that I am not alone and neither are you. Keep us posted on your journey as I hope the other women will do too.As for me, still no period.  I am still waiting for it so w can start trying again. Its almost been a month since my miscarriage so I am hopeful to have it this week or next week. Keep you fingers crossed for me!",
            "post_id": "5231547",
            "timestamp": "1262615180",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Jessica -My D&C was Nov 30th.  AF started Dec 30th, so about 4 1/2 weeks.  I had ovulation cramps on Dec 17th.  When I had the D&C the baby had been dead for 5 weeks and I'm pretty sure that my hormones were down to zero right after the D&C because I didn't really bleed after the D&C (only for like 12 or 24 hours).  I also after a week of no bleeding/spotting I had about 4 or 5 days of bleeding starting on (I think) Dec 8th or 9th.  At my follow up my dr said that that bleeding \"COULD\" have been an AF but no real way of knowing.  I REALLY wanted to wait until I had my first AF to start trying because I wanted to make sure I had at least a little more of a lining, and also wanted to make sure they got everything out, etc.  I hope everything goes well for your co-worker!  Happy New Year to you too!  Also I saw you mentioned that you put on weight from the last one.  It's funny because I lost about 10 lb!  It was my second pregnancy as well and I just couldn't eat because I was always so sick and felt full after a bite or two.  I did, however really start to show as well, I was trying to hide it from work because I didn't want to tell them yet.  I was actually going to tell them the week I found out about the miscarriage.Kricket -I'm sorry for your loss!  I was so scared for the D&C but it wasn't as bad as I thought it was going to be.  I really hope that everything goes well for you!  Just remember that you did everything you could.  So many women have miscarriages every year and most go on to have a healthy baby.  A friend recently told me that at some point in there lives every women is most likely going to have a miscarriage, not all will know about it though.  It's things like this that truly do make you a stronger person!Wishing -I'm so glad you got AF, I hope this cycle is the lucky one!  I'm on CD6 and we've already started trying :)  Most of the time I have ovulation cramps, but other than that I really don't \"try\" my husband and I just have fun.7821shopperholic -I'm so sorry for your loss, it's so horible to loose a child!  As everyone else said, it really is sad when reading about anyone loosing there baby.  I'm glad you were able to spend time with your little one, I didn't even know what gender mine was :(.  When you have another, it's never going to replace your little one you lost.  I have found it very helpfull to talk to women on this board as well as other friends who also had miscarriages.  Many women who loose there babies early on will do things to remember the baby and have found that helps them heal.  Mer personally all I wanted to do was try again, I'm going to be so worried until I can hold my baby in my arms.  The child I lost will never be forgotten, it was a little angle of mine that has helped me be a stronger person and helped me realize what is truly important in my life.  2009 was a hard year for me, but I know I'm a stronger, better person thanks to all that happened.",
            "post_id": "5231864",
            "timestamp": "1262622230",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Well, I still haven't received my period after the miscarriage & its been 34 days. I decided to take a pregnancy test just to see. Sure enough there was a light second line. Its not leftover from the pervious pregnancy b/c I had been testing throughout the month & had negative results around Christmas. I'm not sure if I believe I'm pregnant yet plus I'm not sure it's okay since its so recent since the miscarriage. DH is freaking out. I haven't done anything & don't plan to for awhile. If it stick, it sticks. I'm not running to the doctor b/c I did that the last time & almost drove myself crazy.  Just wanted to update you. Keep your fingers crossed!!",
            "post_id": "5248926",
            "timestamp": "1263003937",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Hi,I've read this type of post so many times since I've discovered this forum.  I was told by my OB to wait 2 cycles - he said that if I got pg to soon then the chances of another m/c were higher.  Then after my 2nd m/c - which was 6 months after - he said I could start ttc after one cycle.  That beign said , I 've met many women who got pregnant soon after a m/c - some started even before the bleeding finished.   And they have or are about to give birth.  I read a couple times that the doctors say that to let you heal emotionally and physically.  good luck - I hope you're blessed soon !",
            "post_id": "5249217",
            "timestamp": "1263010579",
            "user_id": "user_674725",
            "user_link": "/personal_pages/user/674725",
            "votes": "0"
        },
        {
            "answer": "well its been 12 days since my m/c and strangly im getting heartburn like i was during my early stages of pregnancy could it be im pregnant again or something to do with my hormone levels? is it too soon still? me and my partner have had intercourse twice since.congrats on your news jessica keeping my fingers crossed for you xx",
            "post_id": "5254638",
            "timestamp": "1263177799",
            "user_id": "user_418703",
            "user_link": "/personal_pages/user/418703",
            "votes": "0"
        },
        {
            "answer": "well I took another test this past weekend & I am in fact pregnant again.  DH & I have decided not to tell anyone until later this time since we miscarriage at 8 wks last time. Basically though, I got pregnant 2 weeks after miscarrying previously so I am not sure this is going to be okay. I don't plan on going to the doctor until after I make it past the 8-9 week mark just to be safe. Good luck everyone!!!",
            "post_id": "5255797",
            "timestamp": "1263219253",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Jessica79LM - Congrats!  I'm so excited for you!  If you don't mind me asking, why don't you want to go to the dr till 8-9 weeks?Personally as soon as I get a positive test I'm going to be in as soon as they can get me so I can have an ultrasound and blood work.  We won't be telling family, etc till 3 months though.I hope everything goes well!",
            "post_id": "5256882",
            "timestamp": "1263237721",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Hi!i'm in the same boat as you... Miscarriage started on 20th Dec and finally passed the sac (it was empty) on 1st Jan (miscarriage date?).Now 11 days or so on  i woke up with heartburn and my boobs are tender at the sides. My husband and i have been having intercourse since the 5th Jan, a day after the bleeding stopped.Just wishful thinking or ovulation maybe??Jessica, big congratulations on your news i hope all goes well and i'm sure everything will be fine..well done xx",
            "post_id": "5256988",
            "timestamp": "1263239354",
            "user_id": "user_1168661",
            "user_link": "/personal_pages/user/1168661",
            "votes": "0"
        },
        {
            "answer": "jessica congratulations i guess my crossed fingers worked for you im so happy for you xxlounic i guess im kinda happy that iv found someone who is in the same boat as me isnt it strange that were feeling this so soon? please keep in touch i hope everything works out for you xx",
            "post_id": "5259153",
            "timestamp": "1263286065",
            "user_id": "user_418703",
            "user_link": "/personal_pages/user/418703",
            "votes": "0"
        },
        {
            "answer": "JisiThis is an awesome sight, I joined recently and learned so much. All of you are such inspiration. And reading this forum...eish, shows you how little I actually know.I had a m/c on new years day(what a way to start a new year right), anyways, my doc told me to wait atleast one cycle, I would have, if I didnt discovered this forum, I in fact started to ttc right after the bleeding stopped. I want to be a mommy so badly, I didn't want to wait. I've read so much that people actually get pregnant almost straight after a m/c as you are them most fertile and many woman say that they either delivered healthy babies and had normal pregnancies and stuff.Although we started to ttc I am not telling anyone or going to the doc, I would like to just find out by suprise if or when I am pregnant, also staying away from pregnancy test as it feels heavy stressfull to get a negative all the time.I am taking things easy day by day, taking vitamins, cutting out on the caffiene ect.Thanks to all of you!!!xx",
            "post_id": "5259199",
            "timestamp": "1263288524",
            "user_id": "user_1162021",
            "user_link": "/personal_pages/user/1162021",
            "votes": "0"
        },
        {
            "answer": "I thought I'd wait until 8-9 weeks just to make sure I make it that far along. Last time, I went in at 6 weeks for an ultrasound to date the pregnancy (which they can be off by 2 weeks either way because we're all different) and from that point on I felt like I was being jerked around a lot. I had appt. after appt. & test after test & 2 weeks later it was over. I was a wreck after all of that so I figured if I make it to 8-9 weeks w/o any bleeding or abnormalities, I'll then make an appt. to go in. I'm kind of nervous to go in too since they originally recommended that we wait until after 1 cycle to try again & we didn't. Honestly though, we didnt use protection twice. More times we used protection so the fact that we actually got pregnant amazes me.  I want to get excited but I'm afraid to let myself. I'll keep you updated though & I hope you do the same. All of you guys on here. We need success stories to keep us going!  I know chatting with all of you has helped me a great deal.Lounic & 7821shopperholic - keep us posted on your symptoms!  I am curious if you succeeded as well. I don't think I had any symptoms that early but y'know after miscarrying, our hormones may react sooner thus making you have symptoms sooner as well.Uptowngril, sorry for your loss. No one understand how hard it is unless they go through it. You too keep us posted on your success. Best of luck to you!I can't wait to see another pregnancy success story on here!  Good luck ladies, again, keep us all posted!!!",
            "post_id": "5259556",
            "timestamp": "1263303841",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "just to get my things straight here, you ttc before your first cycle and might be pregnant? this is awesome!!!!!! please oh please keep us updated!! hope all goes well!my doc to said to wait one cycle, but i just could, we started to ttc right after bleeding stopped. i am very nauseous, getting heartburn, feeling tired all the time, maybe its just like things coming right after the m/c or maybe other good news. i am not getting my hopes up, still going to ttc until next month, then ill go buy a pregnancy test, if i dont get my period. I suspect that its way to soon after the m/c to be preggies, but who know, miracles do happen right!!!xx",
            "post_id": "5259624",
            "timestamp": "1263305315",
            "user_id": "user_1162021",
            "user_link": "/personal_pages/user/1162021",
            "votes": "0"
        },
        {
            "answer": "Jessica79LM -I guess that makes since.  See for me if I went to a dr that actually did ultrasounds and/or blood work in the begening then they would have noticed that I was having a miscarriage.  I found out 5 weeks after the baby stoped developing, so for me going to the dr as soon as I find out will help put my mind at ease.The midwife I'm seeing said to wait 2 cycles, we waited one (that is if we get pregnant this cycle).  And I'm not scared to go in if I get pregnant before that, after meeting with her I know she'd be disapointed if I didn't go in right away.  I guess it all depends on your dr.I can't wait to see how you are all doing!  I really hope everything goes well!  I should know in about two or two and a half weeks if were pregnant :)  I'll keep you all posted!You know what's weird, last time when I got pregnant it was more of a I just want to be pregnant and get it over with (I've been pregnant and don't really like it).  This time that were trying it just feels different.  My husband even said that.  When we first found out we were pregnant this last time he said he just didn't feel right about it, like it happened too soon or something.  We both are feeling MUCH better about it this time, and it's starting to feel more like my first pregnancy when we were trying :).",
            "post_id": "5259700",
            "timestamp": "1263306697",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "yes, I got pregnant before my 1st cycle but it wasnt intentional.  We planned on waiting just because thats what we were told to do by the doctor. I have talked with other people who say that they only reason they suggest that you wait it for emotional reasons & to better date the pregnancy but I still decided to wait until after a period. I had been getting my blood levels checked weekly so figured I would be getting my period soon as thats what the nurse told me. But we got a little careless on Christmas day & again on New Years Eve. The rest of the times we used protection. I am still in shock that one of those 2 times made a baby again. I am scared & nervous though b/c of it being too soon. I do not want to go through what we went through before. It feels different this time.Cocacola - same thing, we felt last time happened almost too quick, never felt right from the beginning. This time it does feel different.  We are being more cautious though, not telling people until after we see a heartbeat. I guess I could go in early but I just don't want to risk anything.  I want to wait it out just to make sure I'm okay but I see your point too. I'll talk to DH & see what he says.Keep me posted guys!!!",
            "post_id": "5260607",
            "timestamp": "1263322375",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Well either way I hope it goes well for you!  most miscarriages can't be helped, and going in early could cause more grief.Do you have a history of blood clots?  Or a clotting issue with any family members?  I was told if so that you can take some baby aspirin to help with it.  I don't so my dr told me no need.Also, you are correct about when to TTC after a miscarriage, however if you had a D&C or D&E you should wait at least one cycle as they scrape the lining out and having a cycle will help put it back to normal.",
            "post_id": "5260772",
            "timestamp": "1263324819",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "HiJust for interest sake, how soon can someone use a home pregnancy test, how long after you think conceived can it be positive.xx",
            "post_id": "5262738",
            "timestamp": "1263367028",
            "user_id": "user_1162021",
            "user_link": "/personal_pages/user/1162021",
            "votes": "0"
        },
        {
            "answer": "This is so good, Jessica congratulations!!! I'm hoping it turns out the same for me this month and AF does not arrive !!An update for me... i've been using OPK's since CD10 (Sunday) and got negatives until yesterday when I got a smiley face CD12!! I guess the tender boobs etc may have been ovulation? Anyway i'm not sure how reliable the OPK will be but i'm just going with it and we are ttc.fingers crossed everyone and keep us updated xxx",
            "post_id": "5263037",
            "timestamp": "1263381343",
            "user_id": "user_1168661",
            "user_link": "/personal_pages/user/1168661",
            "votes": "0"
        },
        {
            "answer": "Uptowngril - I've heard 10 days past ovulation, although many get \"false negatives\" until at least 14 days past ovulation.louNic - Good Luck!  I hope everything goes well for you this cycle too!  Also hope the OPK is accurate for you!",
            "post_id": "5263295",
            "timestamp": "1263389867",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Congrats jessica. I'm in the beginning stages of my m/c. On 1/15/10 I started spotting. I was 4wks and 3 days. On 1/16/10 it felt like a ball or glob pass through. All that day I passed small clots. On Sunday I had less bleeding. Monday 1/18/10 I had hcg level and it was 3. <5 is considered negative. I had spotting that day. The dr. want me to wait a cycle, but I think they just say that in general not on a case by case basis. My dh feels the same as I do. We want to start trying right away. I feel like if my body isn't ready then I guess I won't ovulate. I was only 4 weeks along so there wasn't  a lot of tissue to get rid of. I have 2 daughters ages 10 and 7. I've never had a miscarriage before. I just hope this was that one unlucky time. Hearing everyone's story give me hope and puts my mind at ease. I'm ready to try again. Everyone please keep me posted and I will do the same. It really helps to read the posts.",
            "post_id": "5282964",
            "timestamp": "1263887552",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "7yrslater - if you had a natural miscarriage, go for it!  I only waited one cycle because I had a D&C and needed at least one cycle to help replace the lining that got scraped out.  If you had a natural miscarriage then your body can handle it.I'm about 8 DPO (not sure as I had O cramps twice this cycle, could be as late as 12 DPO) on my second cycle post D&C.  I've been feeling \"different\" I don't have PMS (which usually starts the week before), but I do have other \"signs\" that could be early pregnancy symptoms (or it could be PMS).",
            "post_id": "5296503",
            "timestamp": "1264193804",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "I really hope this is your time. Hope the symptoms your having are early pregnancy symptoms. Baby dust to you. I haven't O'd yet. This is right after the miscarriage and my OPK showed that LH is rising so maybe I will ovulate right after. If its like my other cycles it will turn + in about 2 days which would be an early O cycle for me if this happens. I will keep you posted.BABY DUST",
            "post_id": "5298048",
            "timestamp": "1264224984",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "ok ladies, I need some good news out there so anyone have any new updates?  I went in to have my HcG levels checks since I wasn't ready to go to the doctor to have ultrasounds b/c last time I went in for an early scan & then they made me come back 2 weeks later & the 2 week wait was agonizing. I wasn't even going to have my HcG levels tested but I have been feeling under the weather with a cough & cold so I called the dr. office to find out what, if any cold medications I could take while being pregnant. So, needless to say when they found out that I was pregnant again they wanted me to come in for blood testing & ultrasounds. I asked to have the scan put off just because I didnt want to go too early & then be told that I have to come back again like last time. So I went in on Monday to have my blood checked & it was 3112 & then Wednesday I went in & it was 5507.  The #'s didnt double. The doctor's office didn;t seem to be concerned wioth it & even said that I don't need to come in for more testing until after my ultrasound on February 3rd. I'm trying hard not to worry but I keep reading that HcG levels need to double & mine rose 76% but then didnt double. Does anyone have any experience with this?",
            "post_id": "5298775",
            "timestamp": "1264257441",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "The only goog news I have at the stage that I'm at is that ovulation looks like it may happen right after the m/c so that's a good sign to me. I haven't had my surge yet but the opk keeps getting darker each day so I should ovulate Monday or Tuesday. My surge should be today so we'll see. Jessica again just try to stay positive. This is our year",
            "post_id": "5301062",
            "timestamp": "1264312496",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Jessica79LM - Your numbers are going up so that's great!  Even if they didn't double, there going in the right direction.  I've never had my levels checked in pregnancy.  The first time I was pregnant they took blood work once, the second time (miscarriage) They never once drew blood.76% isn't bad, and not everyone will rise exactly the same, that's probably why they aren't worried.My only news is that I've had constipation, I've been tired, boobs sore, a little morning sickness/nasioua.  I also went out to eat last night because I was really looking foreword to some Chips and Salsa (I LOVE the salsa at this place) and I felt like I was going to get so sick when i ate it.  I'm not sure if any of this is PMS type symptoms (as sometimes it could be for me) but I haven't had my PMS cramping and the like and AF should be here no later than Wednesday.  Normally I cramp like nothing other for a full week before.  I REALLY want to test early, but I'm going to hold out and test Thursday when I get home if AF hasn't come.",
            "post_id": "5304964",
            "timestamp": "1264426707",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "ooh, I have my fingers crossed for you!!! Thursday won't come soon enough!  Those are all good signs. Have you continued to take your prenatal vitamins?  My doctor suggested that so I had been even though we weren't even trying yet. I am just hoping to get through this week & then next week I'll have my ultrasound & a better idea of what is going on. I'm relieved that I don't have any more blood draws but the uncertainty will probably wear me down by the time February 3rd comes around. I got online & bought pregnancy tests from xxxxxxxxxxxxxxxxxxx.xxx b/c they're super cheap & easy to use. I totally recommend them if you are thinking about taking more than one test.Keep me posted!!!!",
            "post_id": "5305242",
            "timestamp": "1264432602",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Yes, I have been taking them, my dr also told me to.  I've always gotten them at least a month before we started trying and took them early that way I'd be taking them when I didn't even know I was pregnant :).  The first time I was ready to TTC I set up a pre-pregnancy visit with my dr to go over some things, and get the prenatal vitamins, the second time around I just called the dr to ask them to fax a prescription to the pharmacy.  I want to make sure I do everything right, you know!I have a test left over from last time, one of the clearblue digital ones.  I tried a few different ones from past times of being pregnant and decided the digital ones are MUCH easier!  I also followed the pee in a cup directions last time (I HATE peeing on the stick!, Makes such a mess!).I've had a few friends who've been in this situation, and warned me that the hardest part is getting past the point where you lost the little angle.  They've also mentioned that they didn't even come close to stop worrying until they actually delivered there babies.Just try to relax till Feb 3rd, try looking for projects to work on or other things that can keep your mind off of it!  lol, and here I am waiting for Thursday and I'm playing around on medhelp.",
            "post_id": "5305525",
            "timestamp": "1264437358",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Ok, another update, tonight I just got a BFP!  I'm calling tomorrow to set up a dr's apt.  How is everyone else doing?",
            "post_id": "5315647",
            "timestamp": "1264645462",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "CONGATULATIONS!!!!!!! I hope stays well for you this time.",
            "post_id": "5316714",
            "timestamp": "1264680918",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "OMG!  Congratulations!!!! I was waiting for today to see if you took a test!  I am excited & hopeful that we can go through this together & both have better outcomes than the last time. Make sure to keep us all posted after your doctor appt. So based on your last period, how far along are you?  Oh, again, congrats. I hope to keep logging on here to see more posts like that.  You guys have all been such a great support to me & I hope we can go through the next battle together to share pregnancy stories instead of miscarriage nightmares.Keep me posted!!!",
            "post_id": "5317034",
            "timestamp": "1264688040",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "I'm 4 weeks 1 day today.  I have my first apt on Feb 10th, I think the'll do a scan then, I should be 6 weeks.  I'm so excited to have you (and even a few others) in the same boat as me.  In another community there were 3 of us this past week who got a BFP!  It's so scary, and hubby just doesn't understand.When were you going to see the dr?",
            "post_id": "5317982",
            "timestamp": "1264702623",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "ok ladies, here's my update....I went in to have my scan, more nervous that ever since the last time I had an ultrasound was when I was told that I was miscarrying. I couldn't sleep lastnight & was worried how today would go. So I went in today & they 1st did the transabdominal ultrasound. It was harder for her to see anything considering that I am not very far along but she explained everything she was seeing. I don't know if I heard anything she said until she said \"Oh did you see that flickering? Thats the baby.\"  I think it was the 1st time I took a breath while laying on the table. She told me to empty my bladder & get undressed so she could do the transvaginal ultrsound. There she took a lot more pics, checked my ovaries to ensure there was no eptopic pregnancy & then showed us a more clear picture of the gestational sac, yolk sac & baby. She then turned on the machine & we heard the heartbeat!  It was 161.  I am still very nervous & won't feel better until after I make it past the 13th week. But this does make me feel some what better. Due date is 9/17/10.  Good luck everyone!! Make sure to keep us all posted!!!!",
            "post_id": "5339521",
            "timestamp": "1265242746",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "That is such great news. I'm so happy. And excited for you. I hope you do feel some relief with all the great news of your appt. But I know its still not easy to not stress or worry. Just keep thinking positive for you and your baby. My only update is I did ovulate this cycle right after the m/c. I'm on DPO 7. Yesterday I had some cramping/pain on the right side just below the ovaries. Last cycle I had the same type of pain at 6 DPO and was preggo but m/c'd. I don't like to look into all the symptoms but this seems promissing. If this is all true then I will be able to test early. Did you have any implantation cramping.Congratulations again and do keep us posted. I'll do the same.",
            "post_id": "5340634",
            "timestamp": "1265273531",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Congrats Jessicca!  I\"m so glad the scan went well and you heard the heartbeat!  Your about two weeks ahead of me.  I'm going to have my first apt (and scan I believe) at 6 weeks (on the 10th), I'm SO excited.  I am a little scared, but I just know it's going to survive this time!7yrslater - Sending some baby dust your way!  I hope that was implantation cramping!  I don't think I have ever had any.  Good luck!  I hope you get your BFP!As for me, nothing new, just feeling sick as a dog still.  Last night I slept really well finally, I guess I need to force myself to get out of bed to pee in the middle of the night if I want to fall back asleep!  So far everything feels right, and hubby is VERY excited to tell family.  I want to wait till after my apt next week for sure.  I'll post more on the 10th or 11th.",
            "post_id": "5341089",
            "timestamp": "1265292182",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Congrats again. I know you will have a successful appt on the 10th. Hey just look at you having to get up and pee at night as your little one letting you know who runs this lol. You and your husbands intuitions are probably very correct in the way you feel. I wish you all the luck and success on your upcoming appt. My temp went up even more which mimics last cycle. But I don't want to get too excited. I've looked into that type of cramping. Even though some BFN came out of it, there were a lot more BFP when they felt implantation cramping.",
            "post_id": "5343923",
            "timestamp": "1265345611",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Oh and on the 8th I have an appt with maternal fetal medicine. This suppose to be a consultation because my OB/GYN considers me high risk this time around because I have a specific type of arthritis and I would be more at risk for preeclampsia, kidney issues and gestational diabetes because I have to take prednisone to manage the pain. My normal meds for arthritis aren't safe. So maybe they may be able to do hcg blood test by then. I'll keep you updated.(I'm a nurse also)",
            "post_id": "5343946",
            "timestamp": "1265346222",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "lol, thanks!  they let you set up an apt before a positive HTP?  wow!  Well I hope you do get pregnant and have a very safe pregnancy!  I hope your apt goes well!  From your page it looks like that puts you at 11 DPO.  It's so exciting!  I wish I had my levels drawn early and stuff, but I'm not high risk and even though I had a miscarriage I've already had a baby so the dr's say my chances are very slim this time around.  That's why I wanted to look around for a dr/midwife that normally does ultrasounds and stuff early, regardless of the risk factor.",
            "post_id": "5346442",
            "timestamp": "1265406746",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "That's really the only reason I'm excited about being high risk is because I will have scans more often, but when my OB said he wanted me to be seen by the high risk docs also that kind of caught me off guard. My first 2 pregnancies were picture perfect from beginning to end. So only because of having arthritis and the effects it can have on other organs they consider me high risk. Nothing could go wrong or I could have those potential problems. That appt was set up back in early January so its been along time coming. 1 m/c in between that time and possible another pregnancy. I feel really lucky to have the OB I have. When I went in for a consultation with him back in Jan he didn't rush me, didn't sugar coat anything, and reassured me of some of my fears about trying again(body going through so many changes in the past 3 yrs with the arthritis, being alittle older approaching 30 and just a feeling like its not going to be as easy as it was the first 2 times)",
            "post_id": "5347808",
            "timestamp": "1265438603",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "I saw the high risk docs today. It was just a consultation. Just told me about the risks when taking prednisone and having arthritis. Ask me a bunch of questions about my history and family history etc.Well I had a BFN this morning at 11 DPO and CD 24. AF due this Saturday",
            "post_id": "5355393",
            "timestamp": "1265658638",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "I tested yesterday and BFN. I have internet cheapies so the temptation is there to test as often as possible. I tested today. Unsure of BFP or evaporated line. It said to read after 5 minutes. I read it after 8/9 minutes. It did fall on the floor as I went to pick it up. I don't know. DH was able to see the very very faint line. Last cycle on 11 DPO I had very very faint line and DH couldn't see it. The next day(last cycle) DH was able to see the very faint line, so used a digital and there was no mistaking that. So I will test again tomorrow and if the line shows up then I will use a digital. I hope I really am seeing what I'm seeing. This would be the cycle right after the m/c no break in between",
            "post_id": "5359298",
            "timestamp": "1265747350",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "OMG!!!!BFP!!!! I can't believe what I'm seeing. With the same internet cheapie brand the line showed up alittle darker and within the 5 minutes. I'm going to go buy a digital one just to make sure. I'm 13 DPO now. Last cycle I m/c at 4wks and 3days. AF is due this Saturday. I plan on calling my OB on Monday to schedule confirmation and hopefully they will let me get blood levels done. That will put my mind at some ease seeing the levels.SSBD to everyone that's next in line.",
            "post_id": "5361170",
            "timestamp": "1265785171",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "YEAH!!  I'm so excited for you!  That's the danger of testing too early, sometimes it's a false negative.  I usually test 13-14 DPO, since AF is due 13 DPO.  I hope that you have a very safe 8-9 months!I'm so excited, my dr's apt is at 5:15 today, I'll post more after the visit!",
            "post_id": "5361692",
            "timestamp": "1265809222",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "CONGRATS!!!! That is so exciting! Make sure to keep us all posted on the digital reading & your OB appt. I knew 2010 would be our year!  Congratulations!!!!! We'll all get to swap pregnancy stories & details. I am so glad to be a part of this & have you guys to lean on as I go thru this again. Best of luck!!!Cocacolapanda - make sure you keep us posted after your visit today too!I went in for my nurse visit this past week & had more blood drawn, I was at 91,000s so my HcG is still progressing very normal but my blood draw also showed that I am slightly anemic so I have to start taking added iron pills with addition to my prenatals. I have another appt on Feb. 23rd to have a pap & go over more things. I should be about 11 weeks by then so I am hoping to be able to hear the heartbeat via doppler eventhough we were able to see it on the screen. I think I'll feel even better once I hear it again.Again ladies, congrats!!! Can't wait to hear how your appts & pregnancies are progressing!Jessi",
            "post_id": "5361900",
            "timestamp": "1265813822",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Ok, Yesterday was my Dr's apt, and it seemed to go good.  I'm not sure of my numbers yet, my midwife will be calling me today (So I'll post them later).  I did have an ultrasound (she gave me the option and I just had to!).  We didn't see a lot (as I expected), but she said everything seems to be looking good.  It does look like I did ovulate late this cycle as it didn't look like I was the full 6 weeks yet.  We saw a flicker on the screen and she thought that could have been the heartbeat but it was too hard to know for sure.She also said that if I freak out and need to see the baby that I can stop by and she'll do an ultrasound for me :)  I'm going to try and relax and take it easy till my next apt.  Unless my symptoms go away I'm not going to worry about it.  My next apt is March 3rd (3 weeks 'cuz she's on vacation for 2 weeks starting when I would have had my 4 week apt), so I think having it at 3 weeks instead of 4 is going ot make me feel a little better.  I could have had it with a different dr but I was a little freaked out, I just feel more comfortable with her.HUGE sigh of releaf!  My son also enjoyed himself, playing with the other little kids, he kissed 3 girls while I was in with my midwife!So, Everything is going good :)  I feel so much better after the apt.",
            "post_id": "5365368",
            "timestamp": "1265896231",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Oh good, I'm glad things seem to be progressing. So after you get these test #'s will you go in again to have a duplicate test to see how fast they are rising?I know its hard to not freak out. I find myself doing it b/c I feel like getting to the 12 week mark is taking a ridiculously long time.So when you go in on March 3rd, are you having another scan?I am so glad things are good & you feel better. You really give me hope & remind me that I need to just chill out. Keep us posted!!!",
            "post_id": "5365477",
            "timestamp": "1265898446",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "I just got the numbers, they were 10,486!  They said that's good for where I'm at, I think I may have been 5 wks 5 days when they took the blood, but that number falls in the 6 week range (so that's good I guess!).  They don't need to take any more blood work, seems everything is fine and they aren't putting me in high risk so we should be fine!They didn't have all the blood work done, but everything looked good so far.It's hard, but after seeing the numbers I'm feeling a little better since they are defiantly high!I will have another scan on March 3rd, I'm going to ask for one or make sure I get one every apt we don't hear the heartbeat.  I'll be about 8 wks 5 days (I think), then my one after that should be 12 wks 5 days.  After my second one I want to tell family and a few friends, after the third I think I may tell work.I'm trying to find more information about the hCG levels and what they mean, and what it means to have that high at 5 wks 5 days, etc.  I feel so much better now!As long as the next 3 weeks stay as crazy as I feel then I'll be fine!  This week's going to be hard because I'm going to keep second guessing if my symptoms are really there or if I'm just imagining them, since I lost the baby at 6 1/2 weeks, about half a week and that's where I'll be.I agree, the 12 week mark isn't going to get here fast enough!",
            "post_id": "5365760",
            "timestamp": "1265904510",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Congratulations ladies!!!!  I am so incredibly happy for you both!  Please continue the updates because it gives us all hope!I literally am in the process of completing my miscarriage right now.  This was our first pregnancy.  Randomly started bleeding while in the gym on 2/8 (we were 8 weeks 4 days no symptoms other then bloodloss).  Went to the ER only to find that I had passed our child while on the treadmill and all that was left was the gestational sack.  I t took misoprostol the next day and passed the sack that evening.  Now I just seem to be finishing out the rest of the bloodloss.  The only symptom throughout my entire pregnancy was breast tenderness which actually disappeared  over night at 7 weeks.  I knew something wasn't right, and now believe that must have been when our baby died.  We too had a 6 week 1 day ultrasound, heard and saw the heartbeat at 101.89 so you can imagine the grave disappointment.So I am so happy to see that there is hope with both of your situations.  I too feel like I won't get past this until we are pregnant again.  We really do not want to wait at all and are anxious TTC as soon as possible.    My periods before were pretty long (35 days) and typically O on D 22-25 in the past.  Can you offer any advice as to if you would advise waiting for the first cycle or going for it again?  Thank you so much!!!!!",
            "post_id": "5367314",
            "timestamp": "1265934277",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry for your lost and understand completely how you feel. If you reas my post you will understand my story. Two of us here were able to get BFP the cycle right after m/c. I had a natural m/c. If my body wasn't ready then it would not have happened. This time things feel different. Its so early on and I am having more symptoms than last cycle's pregnancy. I wish you luck and keep us updated. It really helps to post about what you're going through.SSBD",
            "post_id": "5368084",
            "timestamp": "1265952990",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Oh My Gosh your Preggo again already Congrats!!! I just read through your posts :)  That is so incredibly exciting I will be thinking of you :)  You have to keep us posted on how your appointment goes and what the doctor says.Thanks for your response I really do appreciate it.  The support is very needed.  My husband has been so wonderful these past few days but its just not the same as talking with another woman who has experienced your same feelings.I have a followup appointment with my doctor on 2/23 to make sure everything has totally passed, bleeding has stopped etc.  I know she is going to tell me to wait 1 full cycle as she and every other doctor I spoke with in the ER said the same thing.  I just have a hard time waiting.  My body may not even give me an option though.  Who knows?  I will be 33 at the end of next month and my DH is 38.  We do not have any children and really wanted a couple so I feel and immense amount of pressure and saddness that it didn't work out the first time.  Being the oldest of 5 children and my mother not having any problems until the very last pregnancy (#6 eptopic) I just assumed I would be okay.  The thought of problems never crossed my mind and here we are in the middle of a miscarriage.  The thought of having another miscarriage becuase I tried to soon is unbearable, and the thought of waiting is just as bad.  I just wish there was a steadfast answer....and guess there just is not right?",
            "post_id": "5368752",
            "timestamp": "1265981640",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "ttcagain1977 - I\"m SO sorry for your loss!  Since you passed it naturally there is no medical reasion to wait other than to help date the pregnancy (which really isn't that medical is it?)  I had a D&C so I waited for AF before TTC and got pregnant the first try :)  I'm scared to death, but my midwife is amazing!  (She said If I freak out and need to see the baby to stop by and she'll do an ultrasound).My biggest advice for TTC is try to figure out when you ovulate, look for EWCM or ovulation cramps, etc.  Also, try not to stress, with just having a miscarriage I know it's stressful to begin with so try to enjoy TTC.  DH actually didn't want to TTC the first month anyway because he wanted to make sure I was ok and ready to move on.  I'm not sure if waiting the one cycle really helped but it made sure the hormones were out of my system when we decided to try.If you decide to wait, I'd suggest to find something to keep yourself busy, it's hard, and it seems like time is standing still (Even now when i\"m pregnant), but finding stuff to read up on, working out, etc.I can tell you this much right now, you will be freaked out while your pregnant, so to help sooth those emotions talk to your dr to see what they suggest see if they can help offer any piece of mind.  My piece of mind is getting an ultrasound done at every apt we don't hear the heartbeat and if I feel like something's off I can go in and she'll do an ultrasound as well.  Just knowing I have the option makes me feel a million times better!",
            "post_id": "5368761",
            "timestamp": "1265981949",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Ladies,Its so refreshing to hear your stories, I wish you all the best of luck!! I had a natural m/c at 5wks in Nov 09 and then I got pregnant straight away but miscarried again last week, I was 8 weeks, had to have a d&c... So its been a tough couple of months!!  Id love to try straightway but Im afraid and think maybe I should leave it for a few cycles?? May sound stupid but I dont even know when your allowed to have intercourse after a D&C, bleeding has just stopped!!So happy for those of you that are pregnant, Im sure your over joyed!!  Hopefully the rest of us will have your good luck!! :-)",
            "post_id": "5368819",
            "timestamp": "1265983367",
            "user_id": "user_1095404",
            "user_link": "/personal_pages/user/1095404",
            "votes": "0"
        },
        {
            "answer": "So sorry to hear about your loss, as you know, we've all been there. Its probably the most heartwrenching experience to go through. I feel like life kinda came up & kicked in the gut out of no where. I never saw it coming. But it did & I poured myself into research. I looked on line at various stories, I wanted to make myself more knowledgeable so I was better prepared the next time around. I decided that doctors are wonderful but its still called a \"practice\" for a reason. I wanted to make sure I knew my body better so when ANYTHING happened, I would be in the best position. And that's the advice I want to extend to you. Its okay to grieve, but try not to let it get the best of you. Once you feel emotionally ready & physically ready then focus on getting your body prepared to handle another pregnancy. Try not to look back at what you did before or didn't so, the past is the past & focus on the future & how to get a healthy baby. It will make the grieving process so much easier.",
            "post_id": "5368845",
            "timestamp": "1265983793",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "Cocacolapanda & JessicaThank you guys soooo much for your responses.  You guys are right :)  I will try to focus on getting this gosh darn bleeding to stop, it just seems to keep flowing!  There isn't much on the pad, but seems to always flow out after using the restroom (sorry TMI).  Did you have a similar experience?  If so, how long did your bleeding last?Cocacolapanda- that is so great that you found a wonderful midwife!  I am not so sure my doctor would consider allowing me to drop in for ultrasounds which would be WONDERFUL!  That is really fantastic!  What exactly does EWCM mean?  I haven't got all the abbreviations down yet. I have only used ovulation kits in the past.  Not sure if they will actually work this time since I have misscarried.  Although I would imagine that I will not ovulate unless my HCG is down to below 5.What day did you ladies start counting as day 1?  Was it from the day you literally started to miscarry?Yes, we are both anxious to try again actually so as long as my doctor doesn't overly insist me may jus go for it as soon as the bleeding stops.THANK YOU SO MUCH FOR ALL YOUR ADVICE!!!!",
            "post_id": "5369941",
            "timestamp": "1266008270",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "Hi Crystal02I am so sorry to hear of your losses!  That must be very very difficult for you.  I did not have a D&C so am not sure what the instructions would be for intercourse after.   Maybe since you have had 2 so close together giving your body and mind a rest for a month may help you out?  Gosh honey, its so hard!  My heart goes out to you!How long did you bleed for, if you don't mind me asking?",
            "post_id": "5369947",
            "timestamp": "1266008544",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "I only bled for 3 days. But then again I was only 4wks and 3days. I used the opk and it did give me a + right after the m/c. I'm counting the day I passed the sac as the first day of my menstrual. When I went in 2 days later for blood work my level was already down to 3.Crystal02-I'm sorry for your losses. We all know how you feel. Since you had a d/c this time it may take your uterus longer to recover since they scrape your uterus. Usually the recovery time before you can start to have sex again is 2weeks. But I'm not a doctor. I always say you know your body better than anyone else. Listen to it. If your ready to have sex again then do it. But as for ttc you should try to wait one cycle to give your uterus a chance to heal. But I know how hard it is to have to wait. EWCM=extra white cervical mucousSSBD",
            "post_id": "5371205",
            "timestamp": "1266040880",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "hey girl im so happy to hear that you have succeeded with the preg... congrats to you all..well i had my miscarriage on jan 7th n we started TTC the day after! may sound crazy but we r desperate. 2 days ago i took a test n the 2nd blue line was very faint but it was there.. could it be positive from previous preg?? i am having some symptoms that im not sure of.. im nausious n the morn till around lunch n i crave certain foods. ive also gained a few pounds n past week. i also get real hungry n when i go to eat i feel sick. could this be signs of preg??  congrats again to you all n happy valentines day",
            "post_id": "5376076",
            "timestamp": "1266212191",
            "user_id": "user_1195411",
            "user_link": "/personal_pages/user/1195411",
            "votes": "0"
        },
        {
            "answer": "Hi!Congratulations on your possible pregnancy!  Did you ever get another period?  Im am jealous you were able to TTC the day after.  I miscarried at 8 weeks and have bleed for 8 days and today I think may be my last day of bleeding after the miscarriage.  I took a pregnancy test yesterday just to try to figure out my own HCG levels and they are still high as I got a postitive pregnancy test, and know for sure I am not pregnant as my HCG is still left over from my miscarriage 8 days ago.I really hope you are pregnant!  Maybe go to the doctor and have them check your blood levels and do an ultrasound :)",
            "post_id": "5376639",
            "timestamp": "1266238865",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "ttcagain1977 - EWCM is egg white cervical mucus.  Day 1 was the day you passed the baby, for me it was the day I had the D&C.  I bleed for 12-24 hours very light (and yes, it was always more when I went to the bathroom for some reason), then after a week pluss I bleed for a full week, it was like a regular cycle for me.  About two or three days after that bleeding stopped I believe was when I ovulated.  I think my numbers were down to zero after the D&C because I was acting normal before we even figured out I was miscarrying (And I'm CRAZY when I\"m pregnant).  Also, if you had a D&C it's best to wait for at least two weeks AND for the bleeding to stop, otherwise you could get an infection that could cause you wait even longer to start trying.  Also, If you had a D&C waiting one cycle is best because they scrape out your lining pretty good, waiting for AF will replace it so the baby won't have issues attaching.  It's SO hard waiting one cycle, but its necessary.  If it's natural then waiting isn't really necessary.   Good luck on getting those hCG numbers down so you can move foreword!ambercuevas - Thanks, I did send you a message this morning as well before reading this board.  If you passed everything, then it's hard to say.  Everyone has different signs of pregnancy, my friend know's she's pregnant because she snores. I know I'm pregnant because of smells make me sick, an I crave foods I don't normally eat.  I also am usually very sleepy.  I felt pregnancy type symptoms up until about 3 weeks after my D&C, about the time I ovulated I believe.  Since it's been over a month since you miscarried and got the positive, unless you didn't pass the baby or something, it seems that the faint line could be for a new pregnancy.  Most women have there levels back to zero by at least 4 weeks past the miscarriage unless it was a later pregnancy, then I\"m not sure.  Since your numbers should double every 3 days, wait 3 days from the test and test again.As for me, I've lost 1.5 lb so far, I'm still sick as a dog and crazy!  I keep asking DH if I haven't been as crazy and he looks at me like I'm insane.  I'm trying not to be, but it's not easy I guess, lol.  It's good though, I'm about where I was when I lost the baby and I feel SO much more pregnant then I did that time.  My next apt is March 3rd, I'm going to try to focus on something else to help the time go faster.",
            "post_id": "5376806",
            "timestamp": "1266243665",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "i stopped bleeding 3 days after mc. i was only 3 wks pregnant. i never got another period after i had mc. my bff told me she had a mc n tried rite after n now she has her baby boy. im hopin n prayin that im pregnant n that my eyes werent playin with me beins that im wanting to be so badly. thanksfor writing bk n plz let me kno how you rdoin ttylcocacolapanda- im hopin that im pregnant gurl n am very anxious to take another test but i dnt want to be too soon n pregnancy n it be neg again.. if the test was faintly pos n i wait 3 days would it b clearly pos??",
            "post_id": "5378720",
            "timestamp": "1266282399",
            "user_id": "user_1195411",
            "user_link": "/personal_pages/user/1195411",
            "votes": "0"
        },
        {
            "answer": "EEEEEEEEKKKK I am so excited for you!  I can imagine that you are very anxious but we all know there is only one reason that 2nd line shows up on the pregnancy test!!!!  :)  You either have the hormone or you don't :)    Being that you were only 3 weeks pregnant when you mc, you could very well be on your way to having that beautiful bundle of joy!!!!  If the test was faintly positive in 3 days it should be very positive, at least that was my experience when I found out that I was pregnant for the first time.  Ohhhhh Good Luck!  Keep us posted!!!  The good news is so wonderful to hear :)  Gives me hope!",
            "post_id": "5379890",
            "timestamp": "1266318558",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for your reply!!!  That was really very helpful :)  I actually mc on my own (but with help from misoprostol). I stopped bleeding 2/15 so am hoping and praying that my levels will drop quickly so we can start trying again.  We do not have our followup with the doctor until 2/23 and will ask her to draw blood then to make sure everything is okay.  This waiting game is awful!  Since I didn't have the D&C I am hoping that she will give us the ok to start trying ASAP.How are you feeling?  Please keep us posted on how things are progressing with you.  I hope to hear from you after your appointment on March 3rd!",
            "post_id": "5379896",
            "timestamp": "1266318943",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "ambercuevas - For most pregnancy tests they require 25-50 levels for hCG, if the test was 25 and you got a very faint test, then after three days they'd be 50, so if you use the same brand (or another that gets levels of 25, you can google it to find the hCG levels for HPT), then you should get a very clear line because you defiantly have the 25 + hCG they'd require.  Also when you see that a test is up to 25 for hCG, they usually detect a lesser amount, but at least 25.  And yes, miscarrying at 3 weeks, there's a good chance your cycle could be back to normal and get pregnant very early.  Good luck!  Hope it really is positive!  Let us know how it turns out!ttcagain1977 - yeah, natural is the way to go if your body will do it.  Some dr's will say you need to wait, but since it happened naturally, your body will be ready to get pregnant when ever.  Since you stopped bleeding 2/15 (yesterday) then keep an eye out for ovulation, it can help you know if and when.  Look for Egg White Cervical Mucus, and the like.  If you ovulate, then your levels will be down to where they need to be.I'm feeling OK, I'm finding it hard to eat much early in the day.  I'm dizzy a lot, and very tired.  The cravings have been pretty weird too.  I've been wanting a lot of fried chicken, Well chicken in general, and I\"m not a fried chicken kind of person.  I also can't eat sushi, even the smell of it makes me sick.  Overall It's been a pretty normal pregnancy.  Oh, the mood swings have been HORRIBLE!I did have a nice relaxing time yesterday after work.  I was going to go to the gym with a friend, but she got sick, and DH and DS were at my mother in law's, so I just stayed home, had a nice healthy supper and went on the treadmill for a little bit.  Not too fast, because I didn't want to get out of breath.  I decided to try walking bare foot because I read it's better for the body (you need to start out slow though).  And it was actually more comfortable.  I got a good workout for my leg mussels, and didn't get too fast.  Also, my knees didn't hurt at all.  Anyway I need to get to work, I'll try to keep an eye on this form, but defiantly post about my next apt on the 3rd!",
            "post_id": "5380308",
            "timestamp": "1266330328",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Just an update. I'm 4wks and 3days now, which last cycle this is the time I m/c'd. My temps are still elevated so that's a great sign. This time just feels different. I am still peeing like crazy. My breast are bigger and heavier. Not that much tingling in my breast anymore. I still get cramps off and on. I had a b-ball game yesterday and I just felt heavy. I don't feel tired only when I work out I feel alittle exausted and I work out 3-4 times a week. I have lost 1.4lbs which is great for me. I don't want to gain 50+ lbs like I had with my 2 daughters. Even though I lost all that weight with them. I'm older now and I know it would be hard to lose that much. Good luck to the ones that haven't gotten their BFP yet. Happy and healthy 9 months to those of you who have",
            "post_id": "5380569",
            "timestamp": "1266334791",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Wow its so great to hear that you are having so many pregnancy symptoms!  I don't think any of us on this board will ever complain about having symptoms ever :)  Glad you had a nice holiday.  And wow!  Walking barefoot on a treadmill....i have never tried that before.  Interesting, I might have to try that out sometime.Thanks again for your feedback.  I noticed some EWCM today but am pretty sure its my body playing a mean trick on me.  I took a few ovulation tests and they were all over the place.  Then I thought what the heck, let me see if I am still showing a positive pregnancy test....and as I had expected it was positive.  It was lighter then before, but still clearly positive.   I guess I am not surprised because this is only Day 8 after my miscarriage. Well see...Do you know if it is possible to ovulate before your HCG levels got to normal (under 5)?  I am guessing not, but thought I would ask your opinion you seem to be so well versed in all this stuff!  Its great!",
            "post_id": "5381664",
            "timestamp": "1266354007",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "ttcagain197 - Yeah barefoot walking is better on the knees!  From what I read you won't ovulate until your HCG levels go down to normal, because your body thinks your pregnant and won't release any eggs.  Since it's just day 8, you may need to wait till day 14 to be sure it'd all the way down.  On average it seems that if you add a week onto your normal cycle, that's what it might be.",
            "post_id": "5381969",
            "timestamp": "1266359631",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "well it turns out i wasnt pregnant.. very sad past few days. i guess my eyes were playin with me since i wanted to be so badly. i went n got an ovulation kit n i have been taking them every day. on the 19th i was ovulating. im not too sure what that means. should i be trying harder rite now?? well we are still ttc n will let you guys kno whats goin on good luck to everybody tryin and congrats to every body that has their precious gift",
            "post_id": "5398301",
            "timestamp": "1266787522",
            "user_id": "user_1195411",
            "user_link": "/personal_pages/user/1195411",
            "votes": "0"
        },
        {
            "answer": "If 19th was your ovulation day, that's when you needed to BD the most, then also on the 20th, and MAYBE the 21st.  Normally the egg only lasts for 24 hours, so your best window is the day before, day of, and day after.  Since you got a positive on the 19th, then 2 weeks from then is when you should be able to test.  Ugh, I remember the two week wait, it *****!I'm SO sorry about the false positive, it could have been a little hormone left over from the miscarriage.Good luck!",
            "post_id": "5398885",
            "timestamp": "1266801563",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "I am so sorry about the false postive :(  its stinks to have that happen.  I agree with cocacolapanda.  My hubby and I BD a few days in a row before the 1st day of Positive ovulation, that day, and the day after.  I did get pregnant that very first time, although that pregnancy did end in  miscarriage a few weeks ago :(  But the good news is that you found when you are ovulating!  Thats awesome! I hope that you did conceive this week that would be such great news!I have my first followup appointment tomorrow with my obgyn after the miscarriage.  I have stopped bleeding and seem to be pretty recovered.  Just hope my levels are normal which would be really nice!  I know she is going to tell me not to TTC until after my first AF though.  Ugggg We dont want to wait!  Its so frustrating.",
            "post_id": "5400342",
            "timestamp": "1266849446",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "To ambercuevas--sorry to hear about false +. I agree with the above ladies about ovulation. Also listen to your body. Maybe you get hints of pending ovulation. For me I would have O pains 2 days b4. Sex would also hurt.Today I am 5wks and 2days. I had my confirmation appt which of course was +. They want to do hcg levels today and Wednesday to see where I'm at and to make sure I'm progressing. Once my levels are in the range for me to be about 6 wks they want to do an ultrasound to determine the due date and see the heart beat and to reassure me. After that then I will have my first official visit in 5 weeks. My symptoms are still the same. I'm constipated, bloated, peeing all the time. My breast tingle alittle and are getting bigger. I've put on 3 lbs. But I hope its just from being constipated and retaining some fluid. SSBD to all",
            "post_id": "5400491",
            "timestamp": "1266851938",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "So I had my first followup appointment after the miscarriage on 2/8/10.  All the bleeding as stopped and my doctor did an ultrasound and looks as though my body is back to prepregnancy measurements.  I asked her about waiting to conceive and she said that \"officially\" she suggested waiting until after the AF, but that really was mostly for dating reasons.  She sad that I would not be the first to come back pregnant before the first AF.  She did not push us to use contraception before the first AF or anything.  I thought this might be helpful information for those who are considering TTC before their first AF.  I also did miscarry naturally (with the help of misoprostol).  Hope this helps",
            "post_id": "5404699",
            "timestamp": "1266945433",
            "user_id": "user_1209025",
            "user_link": "/personal_pages/user/1209025",
            "votes": "0"
        },
        {
            "answer": "ttcagain1977 - I'm glad your follow up went well!  I'm glad your dr's being honest with you about when to TTC as well, I've had the run about with several dr's who wouldn't even tell me why I needed to wait x amount of time.  My midwife I meet with finally told me, that if you have a D&C you need to wait at least one cycle to help replace the lining, as they scrape most of it out, and the baby might have a hard time attaching to the wall if there isn't much of a lining.  Other than that, yes, it is mostly for dating.  Although if you do know when you ovulate, then dating isn't THAT big of a deal.  Either way, an ultrasound can tell you even if you get pregnant right away :)Good luck with Trying!  I know a few of the girls on this thread got pregnant before they got AF!",
            "post_id": "5405054",
            "timestamp": "1266950882",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "I'm glad your appt went well.  You know your body better than anyone else. If you feel ready then go for it. I wasn't sure my body would be ready right after the natural m/c but it was and I became pregnant. So far so good. Good luck ttc again right after m/c. It is very possible.",
            "post_id": "5407424",
            "timestamp": "1266998131",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "I just thought I'd pop in & let you guys know that things are still going good. I'm now 11 weeks pregnant after miscarrying & not getting my 1st AF. My ultrasound at 8 weeks showed a healthy baby with a heartbeat of 161. I had a regular appt yesterday with a doctor I had never seen before b/c my doctor was on vacation & he attempted to hear the heartbeat using the doppler. I knew it was kind of early considering some people don't hear it until up to 14 weeks & he couldn't find it. I think my face showed my worry so he took me back to the ultrasound room & it was there that we saw the baby & the heartbeat beating away. My 5 yr daughter was with me & she got to see the baby move around. It was exciting. So, everyone, good luck!  It can happen!  I hope everyone has a great outcome & happy healthy babies!  I will feel sooo much better next week when I make it to the 12 week mark.",
            "post_id": "5407687",
            "timestamp": "1267010783",
            "user_id": "user_1134841",
            "user_link": "/personal_pages/user/1134841",
            "votes": "0"
        },
        {
            "answer": "I'm glad your apts went well!  I was SO worried when we couldn't hear the heartbeat at my 11 week apt last time, I wish my dr had let me have an ultrasound so I could have figured it out sooner.  I'm SO glad you've made it this far with no issues!I've got my apt's at 9 weeks and 13, I'm glad it worked out that way because at my week 13 apt if everything is going good I can tell work, as I'm sure I'll start to show some by then (as my pant's aren't even fitting the best at the moment, and I even lost weight!).  I'll update more in a week after I have my next apt!",
            "post_id": "5407915",
            "timestamp": "1267019184",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "It's so nice to hear from you. Congratulations on a successful appt. Be happy your almost there to the 12 week mark. I know how much that mie stone means. I'll update on Friday after my ultrasound",
            "post_id": "5408233",
            "timestamp": "1267024982",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "I had my ultrasound yesterday. We got see the heart beating and hear it alittle. It just started beating. 97 bpm. It measures 5mm. My due date was pushed up from Oct. 23rd to Oct. 20th. The ultrasound tech said everything looks good so far. I have a 3cm cyst on my left ovary which is normal. That tells that that's where I Ovulated from, which is weird b/c my O pain was on the right side. Implantation pain was on the right side also. The cyst is what feeds the pregnancy until the placenta takes over. Now I wait til 3/29 for my intake appt. I will be able to really hear the heart beating then, by doppler.My symptoms are still the same. No nausea.",
            "post_id": "5418980",
            "timestamp": "1267270641",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "That's great!  I'm glad your ultrasound went so good!  I'm getting VERY excited for mine in just a few days.",
            "post_id": "5424583",
            "timestamp": "1267451455",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "My Dr apt went really well!  We didn't hear the heartbeat yet, but I'm only 9 weeks and most of my fat is in my belly area from when I had my first child.  We did an ultrasound instead on an old machine so we couldn't get a clear idea of when my due date is actually, but it's looking like I'm right on track for the 9 week mark!  We saw a 160 heartbeat!  It was so amazing!  We also saw my little bean move around a lot!  I almost cried, it was so amazing!  My Midwife was amazed with how my my little one was moving!  When I told DH, he was like \"Oh Great, another Active one!\"  Lol, my first was just as active (not sure early on or not, but DEFANTLY didn't stop moving towards the end), and he still dosen't stop moving too often, lol.I did get a few pics, but because of everything else going on I haven't had a chance to scan them in yet, but I will try to get that done tonight or tomorrow.Oooooo, One last AMAZING thing to add.  So, In my pregnancy binder I got from the hospital, it mentioned 3D/4D ultrasounds.  I asked my midwife about them and she said that all (Except the few old ones, like the one she uses) is the 3D/4D and that they do those for the 20 week ultrasounds!!!  :)  I am SO excited, I can't wait to see it, I think DH is a little excited as well!  When it gets a little closer I may see if other family wanted to see it as well, and see how many can join us.",
            "post_id": "5435790",
            "timestamp": "1267712052",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "That's wonderful. I'm glad your appt was a success and a reassuring one. Tell them to get rid of those ancient machines. Lol",
            "post_id": "5438757",
            "timestamp": "1267783284",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Okay ladies, I finally had my intake(official) appt. My weight nis down which is good for me. I got to hear the hb. It was 169. That was so reassuring. Even though I have all these symptoms I still can't believe I'm pregnant. Its been 8 yrs. I guess once my belly pops out then I'll feel pregnant. My next appt is in 4 weeks. Keep posting ladies.",
            "post_id": "5517275",
            "timestamp": "1269874544",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "Hello,I am having mix feelings of trying to start again. Feb.14 2010 i miscarried. I was told it was a normal one and did not require a d&c  because my body will pass it out on its own. I spotted everday with only 4 days of no spotting from the time of the m/c to March 23. each time i didn't m/c hubbie and I had sex and each time i spotted the next day.march 23 i started to clot. i called the doctor and he told me it was normal and I could be exericing my first period. then on March 24-27 the clots were getting bigger and bigger from a peanut size to larger then a plum and i am not kidding. I started to take photos of each clot so when i called on friday March 26 to my doctor he called me in his office. I showed him the photos of the clots and he was just shocked..he did an u/s and there was alot of stuff in there (including one fibriod) he then did an physical exam and pulled out so much clot i almost died looking at it. he said i was hemergin and to get to the ER for an emg. d&c. I was just in shocked.today he called me to make sure i was ok. he said everthing should be in order now. he did a suction d&c and did a scope to see what kind of fibroid i had. he gave me a name for forgot but it was the kind that is between the tissues of my uterious and on the right side.I really wanted to have more kids. i am 35 and i have one son age 17. my hubbie has no children and we both wanted to have at leaset 2 or 3 more...by the looks of things it looks kind of dim... anyone out there in the same boat of heard anything like my situation? I never received an d&c when i m/c back in Feb. so does that mean I will ov or have a period now? anyone know when? I was 7 wks when i m/c and my cycle was always 28 days. as of Monday 22 my HcG was at 7 and I did a test today to see if i am down to 0. I woudn't know until tomorrow for that result. I am so confuse of what to experct anymore!",
            "post_id": "5519485",
            "timestamp": "1269915955",
            "user_id": "user_1228485",
            "user_link": "/personal_pages/user/1228485",
            "votes": "0"
        },
        {
            "answer": "I am so sorry to hear about what you had to go through in the past month. I haven't heard of this happening but I'm sur eit probably has. I didn't have a period after the natural miscarriage and I was able to get pregnant right away. You had a d/c so your body needs time to recover and build the lining back up so another pregnancy will stick. Is this your first m/c? I think since you were able to get pregnant before then it shouldn't be an issue again and miscarriages are so common and a lot of times happens one time for many people. I think in your situation your symptoms didn't present as being serious in the beginning of your m/c so your doc thought you would m/c on your own. It's unfortunate that it did linger on for so long which made things more complicated and difficult. Don't give up hope. Listen to your body. When you feel ready then try again. Take care and keep us posted.  SSBD",
            "post_id": "5520032",
            "timestamp": "1269938188",
            "user_id": "user_1177493",
            "user_link": "/personal_pages/user/1177493",
            "votes": "0"
        },
        {
            "answer": "7yrslater - Congrats on the great apt!  I've got my next one at 13 weeks tomorrow, I'm so excited we should hear the heartbeat too!Chunk_Fat - Do you know for sure if you passed the baby naturally in Feb?  To me it sounds like either you didn't pass the baby or you didn't pass all the tissue.  It's pretty common for natural miscarriages to take a while, and not un-common to not pass everything.  I'd say try not to worry too much, You've had a live birth so your chances of another miscarriage are the same as they were before you miscarried.  Since you had a D&C, I'd say wait until you get AF then you should be able to start trying if you want to.  You will want to wait at least one cycle though because during a D&C they scrape out the lining pretty good and if you do get pregnant before AF your chances of the baby sticking are defiantly lower.  AF will bring a nice new plush lining for your baby to attach to.  I had one son, then a miscarriage, I waited till AF then got pregnant and I'll be 13 weeks tomorrow.  At my 9 week apt/scan everything looked just right!  As for when AF should arraive, anywhere from 4-8 weeks is what most people fall into.  My cycle is typically short so I got it about 4 1/2 weeks later.  Once your levels go down to zero you'll have a chance to ovulate.  I'd say since your levels were 7 on Monday the 22nd, you should expect AF in 2-3 weeks hopefully.Good luck!",
            "post_id": "5520439",
            "timestamp": "1269953497",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "Thank you both for you encourgements!Feb.14.2010 was my first m/c. Yesterdays results March 29th my Hcg is 3. My doctor did a suction d&c and not scrape to my uterus. I look forward to the new period.As for trying again...we will see....who knows I might change my mind reading this site is soo helpful to me \"its god sent\"!Good luck on your pregnancy!",
            "post_id": "5521621",
            "timestamp": "1269976752",
            "user_id": "user_1228485",
            "user_link": "/personal_pages/user/1228485",
            "votes": "0"
        },
        {
            "answer": "hi, the docs said i am 7 weeks today and there was no heartbeat so she said i had a miscarriage. i hadnt had a period since useing depo 2 years ago, so i didnt know i was even pregnant until 3 weeks ago. i honestly dont think i am 7 weeks. my husband and i werent romantic for a whole month and we estimated conception around march 1st-6th. I haven't been spotting, i have cramped since before i knew i was pregnant. did i lose my baby??",
            "post_id": "5522819",
            "timestamp": "1270002307",
            "user_id": "user_1261223",
            "user_link": "/personal_pages/user/1261223",
            "votes": "0"
        },
        {
            "answer": "newmommyjones - The babies heartbeat starts between 5 1/2 and 6 1/2 weeks.  7 weeks is pretty close, if I were you I wouldn't do much yet.  What is your dr doing for follow up?  Has he/she checked your hCG levels to see if they are rising or falling?  Will he/she have a ultrasound in a week or so to see if there is any new growth?If you think you may not be the full 7 weeks I'd say stick with your gut and hope for the best at this point.  At my 6 week apt we did an ultrasound and saw a flutter on the screen but my midwife wasn't sure what it is, she said it's not clear enough to say if it was a heartbeat.You don't actually miscarry until you pass the baby, since there's no bleeding and no real sign that your loosing the baby try to talk to your dr and see if there going to do the hCG numbers and/or another ultrasound in 1-2 weeks.Good luck!",
            "post_id": "5523923",
            "timestamp": "1270039682",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        }
    ],
    "post_id": "5165620",
    "question": "I recently suffered a miscarriage at 8 weeks. I induced the expelling of the tissue by getting a prescription for Misoprostol to help speed the situation. My body was not recognizing that the pregnancy wasn't viable. I cried for 2 days straight before deciding on taking the medication vs. the D&C. My doctor said we could start trying  1 month or after my first AF.  Has anyone gotten pregnant before them & had success?  I am wondering if they recommend that you wait for medical healing reasons or if it's due to emotional issues. Does anyone know?",
    "timestamp": "1260555398",
    "title": "How soon can you TTC after miscarriage?",
    "user_id": "user_1134841",
    "user_link": "/personal_pages/user/1134841"
}