{
    "answers": [
        {
            "answer": "I gained exactly 30, but had Brody at 34+6 weeks, so I might have gained a little more than that. I am now down to my pre pregnancy weight by 3 months. Don't worry about weight gain so much if you're eating healthy. Comparing yourself to others you will always be a little more or a little less. Everyone is different. Your weight gain sounds within range. You're almost there!!",
            "post_id": "1996706",
            "timestamp": "1192713315",
            "user_id": "user_167",
            "user_link": "/personal_pages/user/167",
            "votes": "0"
        },
        {
            "answer": "Bops, you sound fine to me!  Believe me, if you weren't the Dr would mention it! haha  I gained way too much with both of my girls.  So with this one, I have been eating really really healthy.  I am 22 weeks and have only gained 3lbs.  Which is great for me because I am a really heavy girl and the dr only wanted me to gain 10-15lbs at the most, if anything at all.  Anyhow, as long as you continue to eat healthy, etc I think you'll be fine.  Plus you are at the point where you start to retain a little bit of water too!  woohooo!  =)",
            "post_id": "1996718",
            "timestamp": "1192713582",
            "user_id": "user_205473",
            "user_link": "/personal_pages/user/205473",
            "votes": "0"
        },
        {
            "answer": "Oh, your good :) I gained 50 and was already 155 when I started. I went up to 205 right before delivery.  I lost 20 immediately after birth and another 10 during her first 3 months.  I've lost 5-7 since I've been working (2 months) I'm struggling to loose the last 15 or so. Anyway, I did eat healthy things and not so healthy things.I think that if you are eating healthy, then you shouldnt be so concerned about how much you gain.  As long as you dont induldge in bad foods like I did.  There is a reason why your gaining more and it could be lots of reasons.  A lot of times, swelling holds alot of weight. Maybe this baby will be bigger than your last.  Also, I've always heard that when your smaller, you should gain more than 30.  That's just my take on the situation.",
            "post_id": "1996741",
            "timestamp": "1192714062",
            "user_id": "user_161608",
            "user_link": "/personal_pages/user/161608",
            "votes": "0"
        },
        {
            "answer": "I gained 45-50 lbs with my dd...I was a blimp! I norm weigh 145-150.This time around (currently 23 weeks on Saturday) I gained 15 lbs. I weigh 11lbs less then I did at this point in my last pregnancy. I am SUPER happy about that!I'd have to say that I was one of the lucky ones and lost all the weight in 4 months. I nursed my dd...and that helped tremendously!I see that I gain the weight in my BUTT and in my face....I feel like I have a blimp in my pants...lol....so sad!Just try to eat healthy and 'try' not to give in to the cravings all the time..",
            "post_id": "1996780",
            "timestamp": "1192714492",
            "user_id": "user_220298",
            "user_link": "/personal_pages/user/220298",
            "votes": "0"
        },
        {
            "answer": "I have gained 50 lbs and I'm almost 37 weeks.  Bops you are lucky to have only gained 20 lbs.  I started at 156, I'm 5'8\" and now I'm 204.  It's so depressing.  I gained all over but now in the last month I see my face is blowing up.  My lips are like Angelina Jolie's, I love them.  The weight is awful, my feet hurt so much that I can't even stand for long periods of time.",
            "post_id": "1996823",
            "timestamp": "1192715061",
            "user_id": "user_145992",
            "user_link": "/personal_pages/user/145992",
            "votes": "0"
        },
        {
            "answer": "i'm the same height (well, technically 5'1 1/2\") and gained 35 lbs. i had her 4 weeks early, but a lot was from swelling (preeclampsia so i figure it would've been the same had it been a healthy, term pregnancy.). it was all gone by 4 weeks pp. i think pumping helps me lose more weight than nursing since i produce so much more than dd needs. all i eat all day is chocolate, cookies, and ice cream and i'm still slowly losing.",
            "post_id": "1997008",
            "timestamp": "1192717812",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "i gained 56lbs with my dd katie, lost most of it after her birth, then 9 months later fell preg with my ds thomas, i gained about 42lb with him. lost most of that again and 8 months after him got preg again, am 24w 6d now and have gained about 28lbs. i try not to worry i am 5'9 tall and have a large frame but i do intend to get to 12 1/2 stone once this next baby is born.",
            "post_id": "1997025",
            "timestamp": "1192718188",
            "user_id": "user_60890",
            "user_link": "/personal_pages/user/60890",
            "votes": "0"
        },
        {
            "answer": "I don't know if I count but I'm 14 weeks pregnant and I haven't gained an ounce.  I lost a pound!  I'm freaking out. I'm not trying to lose weight.  I haven't even exercised like I did before this pregnancy.  I swear I ate a couple of pizzas by myself in the first 10 weeks and nothing.  My doctor hasn't said anything but I'm sure if things continue like this, he will.  Everytime I go to the doctor I hope I have gained something.  It's the weirdest thing.  The women in my family don't really gain a lot of weight during pregnancy so maybe that's why.  My mom lost a pound during her pregnancy with my brother and my cousin lost a total of 17 throughout the course of her pregnancy.  Both babies born healthy and over 8 pounds.  I guess I'll have to wait and see.",
            "post_id": "1997068",
            "timestamp": "1192718812",
            "user_id": "user_126454",
            "user_link": "/personal_pages/user/126454",
            "votes": "0"
        },
        {
            "answer": "I'm 5'5\" and my pre-preg weight was 123 lbs. I gained 19 lbs with my son, and he was born at 7 lbs 2 oz, 20 in. and very healthy! I was back down to 123lbs again within three weeks, but I have horrible stretch marks and wider hips now!",
            "post_id": "1997074",
            "timestamp": "1192718894",
            "user_id": "user_184674",
            "user_link": "/personal_pages/user/184674",
            "votes": "0"
        },
        {
            "answer": "*hanging my head in disgust and shame*...60lbs",
            "post_id": "1997080",
            "timestamp": "1192719038",
            "user_id": "user_138725",
            "user_link": "/personal_pages/user/138725",
            "votes": "0"
        },
        {
            "answer": "I'll be 18 weeks tomorrow and have gained 4 lbs so far (least that's what it was last time I went to my doc 2 weeks ago).  I know that will increase!",
            "post_id": "1997117",
            "timestamp": "1192719553",
            "user_id": "user_16045",
            "user_link": "/personal_pages/user/16045",
            "votes": "0"
        },
        {
            "answer": "i gained 53  pounds ryan is 17w old and i have lost 41pounds.  I am losing 1-2pounds a week am i am not breastfeeding!! WILL POWER",
            "post_id": "1997176",
            "timestamp": "1192720410",
            "user_id": "user_142722",
            "user_link": "/personal_pages/user/142722",
            "votes": "0"
        },
        {
            "answer": "I'll just say \"Too much!\" You're fine bops.Hang in there.",
            "post_id": "1997253",
            "timestamp": "1192721592",
            "user_id": "user_185599",
            "user_link": "/personal_pages/user/185599",
            "votes": "0"
        },
        {
            "answer": "I actually lost 11 pounds during my first pregnancy. I had horrible morniing sickness but it wasn't just in the morning it was all throughout the day I couldn't even drink water without feeling sick. But the first few months I lost about 25 pounds and then the last three months I gained 14 pounds so in the end I weighed 11 pounds less than before I was pregnant.",
            "post_id": "1997269",
            "timestamp": "1192721895",
            "user_id": "user_233562",
            "user_link": "/personal_pages/user/233562",
            "votes": "0"
        },
        {
            "answer": "",
            "post_id": "1997301",
            "timestamp": "1192722242",
            "user_id": "user_123759",
            "user_link": "/personal_pages/user/123759",
            "votes": "0"
        },
        {
            "answer": "oops....I am 17 weeks today and have gained about 11 pounds. I am 5'3 and was down to 120 lbs when I got pregnant. I have been stressing big time about having gained too much weight, I'm trying to eat healthy but we are remodiling our kitchen so we have to eat out most of the time and its hard to get your fruits and veggies or healthy stuff I'v been trying though.",
            "post_id": "1997314",
            "timestamp": "1192722398",
            "user_id": "user_123759",
            "user_link": "/personal_pages/user/123759",
            "votes": "0"
        },
        {
            "answer": "I gained 26 total.......and lost it right away. But for some reason I still am looking half pregnant. Ugh",
            "post_id": "1997331",
            "timestamp": "1192722689",
            "user_id": "user_177465",
            "user_link": "/personal_pages/user/177465",
            "votes": "0"
        },
        {
            "answer": "hey bobs, this last pregnancy i weighed 110 when i got pregnant, and 137 when i delivered, so 27 pounds, with the last i gained 60 lol, i did a little better this time,only thing is i came home and had only lost 4 pounds, weird i had a 7 pound baby and lost a bunch of fluid, but apperently that hospital food fattened me up before they sent me home lol, im down to 125 and its been 7 days, so hopefully in a few weeks ill be back to normal,i almost died the other day, a maintance man came to fix my fence and he said \"oh 2 kids and one on the way\", i almost killed him.....he probably thought i was nuts when i  snapped \"SHES ONLY 5 DAYS OLD!!, IM NOT PREGNANT\"",
            "post_id": "1998038",
            "timestamp": "1192732124",
            "user_id": "user_174483",
            "user_link": "/personal_pages/user/174483",
            "votes": "0"
        },
        {
            "answer": "Men are stupid.  Why do men expect women to give birth and all of a sudden have this flat belly as soon as the baby is pushed out?  What an idiot.",
            "post_id": "1998058",
            "timestamp": "1192732335",
            "user_id": "user_145992",
            "user_link": "/personal_pages/user/145992",
            "votes": "0"
        },
        {
            "answer": "I gained about 35, lost around 25 with the birth, and put back 5 or so with nursing, for a total gain of 15 lbs. now at 9 months past birth, ugh, most on my belly too. :(",
            "post_id": "1998070",
            "timestamp": "1192732498",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "I've gained 25 pounds already at only 23 weeks.  I was 5'6\" and 135pnds before, which I think is pretty average, so this is just depressing.  At work the other day I was helping one of my normal clients and he said to me, \"boy you are getting bigger and bigger every day aren't you\"My back is always hurting and I've gone up 2 bra cup sizes!",
            "post_id": "1998092",
            "timestamp": "1192732817",
            "user_id": "user_253198",
            "user_link": "/personal_pages/user/253198",
            "votes": "0"
        },
        {
            "answer": "Well I guess I win, I gained 80 at my last appt the day of delivery I offically hit 80.  I was sick during pregnancy and limited very little activity but still 80lbs.  I did not really eat junk but I was very fit when I became pregnant so all that muscle turned into fat fast.I lost 30 within 2 weeks after delivery.  Then another 20 in the past 5 months.  The last 30 are hanging on and the funny think is my belly is flat again.  The weight is in my arms, butt and legs.",
            "post_id": "1998097",
            "timestamp": "1192732920",
            "user_id": "user_165078",
            "user_link": "/personal_pages/user/165078",
            "votes": "0"
        },
        {
            "answer": "I gained 37 pounds this time around.  I was just fighting in those last few weeks not to hit 40!  If you are eating healthy and are healthy, I would say not to worry too much about it.  I know it is no fun to watch those numbers creep upwards, but what else can you do?  I'm sure your dr. would let you know if something were unhealthy.  My second dr. said he recommends 25-30 pounds of weight gain during pregnancy-sounds like you're right in that range.",
            "post_id": "1998559",
            "timestamp": "1192738334",
            "user_id": "user_176741",
            "user_link": "/personal_pages/user/176741",
            "votes": "0"
        },
        {
            "answer": "I gained between 50-60lbs with both of pregnancies, but like most of you I lost it very quick after birth and just barely lost the last 15lbs.  Go figure that i'm prego with #3, i'm really hoping not gain as much weight.  What's funny is i don't gain anything and I don't even look prego until i reach 4-5 months then during those months i gained 10-15 lbs ouch and it steadily goes up from there.  If any of you have any tricks to stay in a healthy weight gain i'm all ears. :o)",
            "post_id": "1998621",
            "timestamp": "1192739189",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "I'm 36w4d and I've gained 28 pounds so far.  My doctor freaked when I had gained 20 pounds in five months.  (But we were eating out every night due to a kitchen remodel.)  He said at that rate I'd gain over 40 pounds, which he only likes his patients to gain no more than 35.  He told me to walk a couple times of week, which I did.  Plus once the kitchen was done it was back to eating healthy.  So that's helped.  I read somewhere that in the last few weeks, some women only gain a few pounds and some actually lose weight.  So I may make it under his 35 pound rule.",
            "post_id": "1998677",
            "timestamp": "1192740184",
            "user_id": "user_182140",
            "user_link": "/personal_pages/user/182140",
            "votes": "0"
        },
        {
            "answer": "During my most recent pregnancy, I gained about 20 lbs but lost 15 of it within the 1st week after delivery.  So, I still have 5 to go until I am back at pre-pregnancy weight, but I have turned into a milk factory and I'm wondering if that isn't that extra 5...?  :)  Every woman and pregnancy is different, and it sounds to me that what you've gained thus far is very ok. I've read the last few weeks you don't gain much anyway- that wasn't true for me, but maybe it will be for you :)",
            "post_id": "1998718",
            "timestamp": "1192740848",
            "user_id": "user_111333",
            "user_link": "/personal_pages/user/111333",
            "votes": "0"
        },
        {
            "answer": "I gained 55lbs!!!!! But my son was also 9lbs at birth, I have lost 30 so far and am 5 1/2 weeks PP.",
            "post_id": "1998727",
            "timestamp": "1192740962",
            "user_id": "user_223520",
            "user_link": "/personal_pages/user/223520",
            "votes": "0"
        },
        {
            "answer": "I am 31 wk and have gained about 27 lbs.  I will probably be about 35lbs once I deliver.  The weird thing is I have been sick for the past two weeks and havent really ate much and I am still gaining weight.  How does that happen?!?!?!  Oh well.  As long as I dont pig out on things I feel good about myself.",
            "post_id": "1998800",
            "timestamp": "1192742452",
            "user_id": "user_180619",
            "user_link": "/personal_pages/user/180619",
            "votes": "0"
        },
        {
            "answer": "I gained around 40 - 45 pounds with my DD.  Ten before I even saw the doc at 10 weeks!  I'm small (5'3'', 112 or so pounds not preg), so my doc wasn't too concerned.  I lost all but 5 pounds like in 3 weeks, and luckily the rest came off after I stopped breast feeding.I'm currently 8w5d and have gained about 4 pounds.cantwait4baby, that is impressive!I think we all stress out too much about weight gain.  Like there's not enough to stress over during preg.",
            "post_id": "1999208",
            "timestamp": "1192748984",
            "user_id": "user_161782",
            "user_link": "/personal_pages/user/161782",
            "votes": "0"
        },
        {
            "answer": "Thank you all! I feel better. I am trying to be as healthy as I can, I feel that is so important and not to give into all the junk cravings. Weight gain in general is a struggle for me, I was an overweight child,(My brother and I were indulged in weekly weekend trips to Mcdonald's, Burger King, etc. by my Aunt who thought she was spoiling us) and struggled with weight gain in my early teens. I adopted a healthier life style by age 15, and cut out red meat, soda, fast food, margarine, sugary snacks and bumped up the healthy food, and was able to get to a healthy figure in about 2 years.(the right way!)..Because I was teased so badly, weight is a sensitive thing for me, even in pregnancy. But as long as I am eating healthy and doing everything right, I guess I have nothing to worry about. 2nd baby-it is so tough to see those numbers creep, even if it is for a good reason...thanks to all for sharing their experience!",
            "post_id": "1999437",
            "timestamp": "1192752519",
            "user_id": "user_189100",
            "user_link": "/personal_pages/user/189100",
            "votes": "0"
        },
        {
            "answer": "bops im 31 weeks and now im gaining like a mac truck! well im swelling so maybe im a few pounds less but i have gained about 20 pounds.  ugh!  i wanted no more than 25, doesnt look like that is going to happen.  but  i plan on losing it immediatly and becoming a skinny hoochy lol.  i think weight is sensitive for most of us.  i wasnt small to begin with, so im up there.  you know i have finally figured out there is nothing to stress about right now.  i have to admit, the weight has been coming on faster since dh came home!!! darn him!!!!",
            "post_id": "1999860",
            "timestamp": "1192759742",
            "user_id": "user_166855",
            "user_link": "/personal_pages/user/166855",
            "votes": "0"
        },
        {
            "answer": "At the last couple weigh-ins, I would not allow the nurse to tell me the number.  I just couldn't bear to hear it out loud.  But I would always sneak a peek at my chart to see what she wrote down, just so I knew :)  And I know exactly what you are saying as I, too, was an overweight child.  And a slightly overweight adult until about a year after I had my first child.  I finally managed to achieve a weight I was very happy with and maintained it for four years.  So gaining during this pregnancy, despite what I ate or how much I exercised, was very hard for me to handle.  I had to tell myself-like you said-that it was for a terrific reason, and that I had lost weight before and could do it again after I had a healthy baby.  Hang in there!",
            "post_id": "2001204",
            "timestamp": "1192802798",
            "user_id": "user_176741",
            "user_link": "/personal_pages/user/176741",
            "votes": "0"
        },
        {
            "answer": "I am very thin normally, always have been and I have struggled for years to put ON weight.  I gained 26 pounds in my first pregnancy and loved the way I looked filled out!  I lost all of it quickly though after and actually began this pregnancy at a lower prepregnancy weight than my last.  My daughter is 15 months old and I am 16 weeks.  I have gained 6 pounds so far and hope to gain 30 this pregnancy.  I think I have the opposite problem from a lot of you.  I spent years saying, I am sure I will fill out after I have kids :)  I am only 24, so maybe I will hold on to a little of this baby weight after.  My breasts could sure use it anyway!",
            "post_id": "2001211",
            "timestamp": "1192802927",
            "user_id": "user_292250",
            "user_link": "/personal_pages/user/292250",
            "votes": "0"
        },
        {
            "answer": "Hi there lovethebops!I'm beating you! I'm almost 35 weeks and have gained roughly 28lb. I actually have only gained 2lb since week 27. I've currenly got a craving for raw cauliflower :S which may have something to do with it!!Ruth xx",
            "post_id": "2001419",
            "timestamp": "1192805845",
            "user_id": "user_169867",
            "user_link": "/personal_pages/user/169867",
            "votes": "0"
        }
    ],
    "post_id": "1996668",
    "question": "I know this is a pretty frequently talked about topic, but I was wondering how much weight everyone gained w/ their pregnancies. I am at the point now where I am rapidly gaining weight (1-1 1/2 lbs a week) and it is taking a toll. I am only 5'2'', normally 115 lbs. (at most) and all the weight gain is killing my back and hurting my knees(worse than my first). I am 32 1/2 weeks and have already gained over 20 lbs., and will probably hit 30 lbs. by the end (gained 28 lbs. with Maddy)..does that sound about right? I feel like 30 lbs. is a lot for my petit frame, and when I talk to some women who are about my size, they say they only gained 20 lbs. in the whole pregnancy...I've got 7 1/2 weeks left and have already gained that. I am eating really healthy, and have tried to cut down a lot on the sweets and sugar in general (eating more fruit and salads, helping w/ the constipation at least, sorry,tmi) How should I be eating at this point? I feel like I should be eating really healthy and not giving into to all the junk food cravings, as I don't want to get in the habit of eating whatever I feel like. Thanks for your thoughts!~bops",
    "timestamp": "1192712711",
    "title": "How much weight did you gain in pregnancy/open forum",
    "user_id": "user_189100",
    "user_link": "/personal_pages/user/189100"
}