{
    "answers": [
        {
            "answer": "Wow I can't belive a lot of you are still working, dollchina, wow, you're very strong and daring, you go girl!  I am exhausted and have no strenght for anything, i'm telling ya'll, i'm so lazy, all I want to do is sleep and just lay around anywhere, lol.. ahaha!   HR (human resources) wants me to work til Dec. 15 only because that's what FMLA approves, they did not approve me leaving Nov. 17.  I mean I know it's quite a while to take off but i'm tired and I reall don't feel like working anymore.  I wish I could go longer but I just can't.    Thanks so much for all your replies, dollchina, wish you the best luck, i know your baby will come anytime now, :) .   Harley girl, what's going on girl, how are you doing?",
            "post_id": "1210617",
            "timestamp": "1162360800",
            "user_id": "user_118040",
            "user_link": "/personal_pages/user/118040",
            "votes": "0"
        },
        {
            "answer": "HR/FMLA will be approved the weeks prior if a dr says medically you need to be off.You won",
            "post_id": "1210620",
            "timestamp": "1162360800",
            "user_id": "user_159354",
            "user_link": "/personal_pages/user/159354",
            "votes": "0"
        },
        {
            "answer": "I am 38 weeks and I am still working.  My last date is Nov 10th and my EDD is Nov 15.  I know what you mean about being tired.  I just chosed to work as much as I can because it will drive me crazy sitting at home waiting for labor to happen.Good Luck!Dolly",
            "post_id": "1210637",
            "timestamp": "1162360800",
            "user_id": "user_118074",
            "user_link": "/personal_pages/user/118074",
            "votes": "0"
        },
        {
            "answer": "It really depends on you. Are you planning to go back after you have your baby? How much of leave can you take?With my first DD I worked till the day she was born no problem. I am now 30 weeks and am planning to work till the day I have this DD2, but I will be off during THG for 5 days, (we get extra days of since I work for University) and I will be off the whole X-mas break Dec. 15-Jan. 3rd, so I will be returning to work just to get everything set up before I go on my 2 months maternity leave. My boss is very supportive and is giving me extra time off, but I will be working some from home to make sure everything is going the way it woiuld be if I was not on leave.Your employer sounds a bit more strick. As I said above, if you are planning on keeping this job, try to go as long as possible, if you are not coming back and don't need the money...quit now! Good luck",
            "post_id": "1210638",
            "timestamp": "1162360800",
            "user_id": "user_129291",
            "user_link": "/personal_pages/user/129291",
            "votes": "0"
        },
        {
            "answer": "Why does your work insist you have to work until when they say?? That does not seem too fair.",
            "post_id": "1210640",
            "timestamp": "1162360800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "I'm taking leave starting Mon. My dr. wrote a note for me due to my high bp and it is getting unstable. I'm 26 weeks. If your dr. approves you going on leave then i can't see how they can make you stay. That is a mj libility risk they are taking. What does your dr say? Will he write a note for you?",
            "post_id": "1210645",
            "timestamp": "1162360800",
            "user_id": "user_160058",
            "user_link": "/personal_pages/user/160058",
            "votes": "0"
        },
        {
            "answer": "How high has your BP been??? I stopped working at about 24 weeks due to mine.",
            "post_id": "1210653",
            "timestamp": "1162360800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "With my first child I worked until 1 week before my due date.  With my second I owned my own business and worked until I went into labour, then I had to be back in my office when he was four days old!!!  Luckily I had moved my office home.  I have no idea how I did it.HOw long do you get for maternity where you live?  I think it's great to have as much time with the baby as possible before you have to go back to work.",
            "post_id": "1210663",
            "timestamp": "1162360800",
            "user_id": "user_164559",
            "user_link": "/personal_pages/user/164559",
            "votes": "0"
        },
        {
            "answer": "First of all, you should be protected under FMLA",
            "post_id": "1210668",
            "timestamp": "1162360800",
            "user_id": "user_159354",
            "user_link": "/personal_pages/user/159354",
            "votes": "0"
        },
        {
            "answer": "I know the USA isn't great for pregnant women...other countries get like 6months to a year off after.I had a wonderful boss when I was pregnant...let me come and go as I please as long as I put in my hours....the 5am shift helped...I was more comfortable in the day and hubby and I slept different times so me being as big as a house and uncomfortable in the end didn't bother him to much.This new job...not so wonderful...they don't understand family/work balance and I had 3 m/c this year...heartbreaking...then being told 'not to bring it to work'....ugggh... I hate politics in the office",
            "post_id": "1210641",
            "timestamp": "1162360800",
            "user_id": "user_159354",
            "user_link": "/personal_pages/user/159354",
            "votes": "0"
        },
        {
            "answer": "I know, I tried getting the disability insurance but of course they denied me since I waived it when I first got hired, but I do get to use FMLA leave,  eventhough I won't get paid for leaving.  That's another thing that makes me upset, I just don't see how they treat pregnant women like this, I really don't want to come back to this job after the baby is born, I want to find a new job and next time i'll get the disability insurance, lol.",
            "post_id": "1210675",
            "timestamp": "1162360800",
            "user_id": "user_118040",
            "user_link": "/personal_pages/user/118040",
            "votes": "0"
        },
        {
            "answer": "I am doing good. 30w2d I cannot believe I am already in the third trimester. I have not worked for quite some time due to being on bed rest for high blood pressure. They are talking of inducing when I am at 37 weeks so the BP will stabalize. Quinn is doing great, measuring a week ahead and likes to kick the crud outta me. :) I love being pregnant but cannot wait to have her so I start feeling like myself again.",
            "post_id": "1210676",
            "timestamp": "1162360800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "I know time's flying.  I'm glad Quinn is doing great (that's such a cute name).  How long have you been on bedrest?  My sister had her baby last monday, a little boy, 7 lbs 9 ounces.  She was 37 weeks pg too and the reason why she was induced was only because she couldn't breath and her baby hardly moved so the dr got worried and induced her last Monday Oct. 23.  You'll be find and so will Quinn!  We're naming her Kenadi Raeanne, and I just can't wait to see her!",
            "post_id": "1210678",
            "timestamp": "1162360800",
            "user_id": "user_118040",
            "user_link": "/personal_pages/user/118040",
            "votes": "0"
        },
        {
            "answer": "Love your little ones name as well....I have been on bedrest for about 6 weeks.  Bored outta my mind but it is for a good cause. I also cannot wait to see the little one.",
            "post_id": "1210682",
            "timestamp": "1162360800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "whoa. i'm moving to the Czech Republic! :o)i worked in the office as long as i could, though i got stuck on bedrest around 31 weeks due to a preterm labor scare. fortunately, we just got all this new equipment in our office, so now i can work from home...which is AWESOME since we don't have cable, and i think i'd go totally crazy if i had to lie around all day with only jerry springer to keep me company. :)in related news, another little scare today...started contracting at 3 AM and just kept going. doc has upped the procardia, keeping fingers crossed that it will work and the little ones won't try to make another break for it...we've only got 9 days til that magic 36 week mark!",
            "post_id": "1210862",
            "timestamp": "1162360800",
            "user_id": "user_149720",
            "user_link": "/personal_pages/user/149720",
            "votes": "0"
        },
        {
            "answer": "So what is the typical maternity leave in the US?  IN Canada it is 12 months and can be split between mother and father.  You can also have family leave if you adopt, but I am not sure how long that is.Unfortunately I don't qualify as I am self-employed, wiht our last baby my dh had just changed jobs and did not qualify either.  But we had some help and it all worked out fine.",
            "post_id": "1210690",
            "timestamp": "1162360800",
            "user_id": "user_164559",
            "user_link": "/personal_pages/user/164559",
            "votes": "0"
        },
        {
            "answer": "We get in the US a total of 12 weeks.  6 paid for vaginal delivery and 8 paid for c-section...but it is not always paid in full...it depends on the company.",
            "post_id": "1210697",
            "timestamp": "1162360800",
            "user_id": "user_159354",
            "user_link": "/personal_pages/user/159354",
            "votes": "0"
        },
        {
            "answer": "My sister who lives in Europe (Czech Republic) gets 3 years of paid maternity leave and as long as she returns by the end of the 3rd year, she is guaranteed her job. If she chooses to stay home the 4th year, she only gets 50% paid and no job guaranteed.Talking about a nice Maternity leave! LOL",
            "post_id": "1210711",
            "timestamp": "1162360800",
            "user_id": "user_129291",
            "user_link": "/personal_pages/user/129291",
            "votes": "0"
        },
        {
            "answer": "Thanks again for all your comments, hope everyone here continues to have such great pregnancies.  Steph, wish you luck too, maybe he'll come earlier than that.  I'm hoping this little lady bug decides to come out at least a week earlier than my expected due date.  Ya'll take care and i'll be back on here reading your posts everyday!  Sorry I hadn't been here in a while, I was just lazy typing, lol..   Well ya'll Stay healthy and take care of them bellies, :)",
            "post_id": "1210722",
            "timestamp": "1162360800",
            "user_id": "user_118040",
            "user_link": "/personal_pages/user/118040",
            "votes": "0"
        },
        {
            "answer": "My due date is today and I worked up until Friday (Oct. 27th).  I'm a pharm tech and stand on my feet all day. But its really up to you.",
            "post_id": "1210741",
            "timestamp": "1162360800",
            "user_id": "user_104730",
            "user_link": "/personal_pages/user/104730",
            "votes": "0"
        },
        {
            "answer": "My most recent BP was 148/90....  I just do not want it to get any higher. They said they will be real concerned if it hits 150/90, ummm hello how much closer can I get than I already am. If it gets much worse they said she could be born as early as 35 weeks and should not have to be put into NICU. I really want her to stay put until I am 37 weeks though.",
            "post_id": "1210750",
            "timestamp": "1162360800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "I'm stunned....most women still feel like a truck hit them 8 weeks after a c-section....It must be heart wrenching to go back to work when your babies are so young.  I am amazed that the US, a world leader, doesn't give families adequate time.  I would have thought you guys got at least six months.Here it is not your full salery, I believe it is 67%, however, many employers will top you up.  My husband is a civilian working for the navy and he will be topped up if we are ever so blessed to have another child.We do pay lots of taxes though...lots and lots of taxes.",
            "post_id": "1210704",
            "timestamp": "1162360800",
            "user_id": "user_164559",
            "user_link": "/personal_pages/user/164559",
            "votes": "0"
        },
        {
            "answer": "Iv'e been on med. since day one...now taking atenol every 6hrs. My bp had been in check but lately it climbs during the day...last week 141/93! I'm a HS teacher and the job is high stress...I teach Eng. and we are always under the gun concerning TAKS scores...our district is tops so the pressure is even greater...anyway, the b/p is much better on weekends when I'm not at work...last week I went in for tests to make sure I wasn't going into preeclampsia like I did my last preg. The tests were normal so my dr. agreed to write me a note for restricted activity...no work...thank God...I really want to hold on to this job as I live where I teach and the school is 1 mile from my house and my son goes to school here also. We are small so all campuses are on the same lot which make it nice to me able to check on my son if needed and the comfort it provides him knowing that I'm near if needed. Otherwise, I would quit and stay at home with my 2 yr old and this one till they start school. How has your bp been? My dr. also thinks I'll deliver early prob. in Jan. I'm due Feb 5th.",
            "post_id": "1210705",
            "timestamp": "1162360800",
            "user_id": "user_160058",
            "user_link": "/personal_pages/user/160058",
            "votes": "0"
        },
        {
            "answer": "With DS#1 I worked up until the day I had him.  I went home on Friday for the weekend and I went into labor Sunday nite)!!  I worked in a storeroom at that time lifting heavy boxes and this and that too.  But I wanted more time after I had him to be home.  We only get up to 12 weeks off for FMLA!  I took 9 weeks after I had him.  This time I am scheduling a c-section (March 6th) so I think the 5th will be my last day.  I hope to work up until then anyway.  Who knows, he may come early just like my first DS did.  I had him at 38 weeks.  My section is scheduled at 39 weeks this time.  So I guess we shall see.  But I think its all your personal preference on how long to work.  If you are tired then take off when you want to.  Good luck!!",
            "post_id": "1210713",
            "timestamp": "1162360800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "I understand...my daughter was born at 34 weeks and weighed in at 4 lbs 10 ozs but she is just a small boned little person anyway. She was totally fine no NICU at all!! A NICU nurse told me recently that when your body is under stress such as hypertension that it makes the baby develop quicker and that is why DD did not have any problems. Are you on any meds? Last time, my dr put me on meds when my bp got high and I stayed on them until I delivered. I was in the hospital a week before she was born. The meds help keep the bp in ck for a while then I went into full blown preeclampsia and was induced. Maybe your bp isn't high enough yet to warrant meds? I don't know, but yes if you can make it 34 -35 weeks the baby's lungs will be more developed. You never know my sister develpoed hypertension way before me and made it longer till 36 weeks, guess it depends on your body. Good luck and rest...as long as I was down my bp stayed down.",
            "post_id": "1210833",
            "timestamp": "1162360800",
            "user_id": "user_160058",
            "user_link": "/personal_pages/user/160058",
            "votes": "0"
        },
        {
            "answer": "OMG deanne, sorry to hear about your mc's and your job being like that.  I hope everthing gets better for you, thanks for your comment!over40club:  i'm sorry to hear about your hb pressure, the good thing is that you'll be home at least not stressing much about work.  My dr wrote a letter to me stating that due to fatigue and not able to breathe  that \"I decide to take leave starting Nov. 17\"\" .  I was so mad when I read that cause they made it seem like I wan to leave, I mean, I wanted them to say that they agree with me leaving but oh well.  I guess i'll have to wait to see what HR says to that.  The only thing that really bites is the not getting paid part but, I just don't have the strenght to work, othwerwise i'd stay and get the extra pay you know.",
            "post_id": "1210686",
            "timestamp": "1162360800",
            "user_id": "user_118040",
            "user_link": "/personal_pages/user/118040",
            "votes": "0"
        },
        {
            "answer": "i am 24 weeks- going on 6 months - am not due till march 1-but by my measurments which were good i can go feb 20-i work two part time jobs 7 days a week so i plan on working the one with benefits up to due date well at least try because i get 6 weeks maternity leave and the other begining of feb probably-which is the daycare center-i hope it works out",
            "post_id": "1211013",
            "timestamp": "1162447200",
            "user_id": "user_143370",
            "user_link": "/personal_pages/user/143370",
            "votes": "0"
        },
        {
            "answer": "I don't know how you ladies are working this long!!! I am 7months, just hit my 3rd trimester, and I have already told my boss I don't know how muchlonger I can do it!! My back kills me when I get home, I am so uncomfortable, tired all the time (I just got dx with anemia...go figure)...I dread going to work. It takes so much out of me!!",
            "post_id": "1211192",
            "timestamp": "1162447200",
            "user_id": "user_131073",
            "user_link": "/personal_pages/user/131073",
            "votes": "0"
        },
        {
            "answer": "I worked a week past my due date, finally they got sick of me coming in and were a little freaked out that I could go into labor at any time and sent me home to rest on a Wed., went in to be induced the following Monday.  I had nothing better to do though and they were really nice about it.  We are only given 12 weeks total, and if you are unlucky like me, my little one was 11 days late.  I didn't want to waste anytime before my baby came, but some businesses are nicer.  If you have less than 50 employees in your business though, they don't have to give you any time at all.  My sil had this happen, they only had 3 employees, and she felt bad during her pregnancy and decided to take time off by 10 weeks (put herslef on bedrest, not on the Dr.'s advice).  They did not keep her around, but did allow her to come back after the baby.  I would stick it out as long as you can, it gets to drag at the end and staying home gets old, by the time I had been home for 2 days, I was sick of it and bored.  All I did was eat and feel sorry for myself.Hope I make it till the end with this one too, I'm on my feet all day long too, but am having a harder time dealing with the other 2 pregnant gals who think they need to sit on their butts all day, I'm worn out from picking up their slack.  My Dr. did offer to write me a note to get out of working with them, she flet that I did not need to be around their attitudes.  How sweet of her, not sure if she was kidding or not, but one of the gals is trying all she can do to induce labor, started at 24 weeks when she hit the \"safe\" zone.  She feels that her baby is too big to carry.  At 26 weeks for her now I feel like I may snap if I have to hear any more whining.  Anyone who has 6 lb. babeis full term (twice) should not be trying to go early just to feel better.  The other just like to be pregnant so she can get out of doing stuff, as she said.  I'm further along and running circles around them both, and I have moring sickness still, they are both sitting on their butts eating junk food.  In their cases, I hope they both leave early, just depends on the person.  Soory to vent gals.",
            "post_id": "1211193",
            "timestamp": "1162447200",
            "user_id": "user_141622",
            "user_link": "/personal_pages/user/141622",
            "votes": "0"
        }
    ],
    "post_id": "1066368",
    "question": "Hi ya'll !  I haven't really posted anything in a while, just wanted to say hi to everyone, hope everyone is doing great!I have a question, when are ya'll leaving work for maternity leave?  I've been so tired and lose my breath a lot and I am planning on leaving Nov. 17 as my dr already approved (i'm almost 32 weeks pg), anyways, my job told me that i have to work til Dec. 15 (i'm due the last week of Dec), anyways, what ya'll think?  I mean I can try working til then but i'm so exhausted and just not feeling up to it since i've gotten so lazy.Your answers are very much appreciated..   Thanks in advance, :)",
    "timestamp": "1162360800",
    "title": "How long are ya'll working til?",
    "user_id": "user_118040",
    "user_link": "/personal_pages/user/118040"
}