{
    "answers": [
        {
            "answer": "Hi, welcome to our community .. not sure if others have an answer .. I wanted to let you know I read your post but I don't know enough about your condition to help.  You may want to repost on one of the physician expert forums as an idea.Let us know what you find out and I hope you feel ok and stay free of reactions.C~2 children anaphylactic to nuts, latex, plums & bees",
            "post_id": "4763558",
            "timestamp": "1250165800",
            "user_id": "user_168348",
            "user_link": "/personal_pages/user/168348",
            "votes": "0"
        },
        {
            "answer": "hi just started on this site ive been suffering from idopathic andioedema same as you also urticara which is the rash when i get an attack i mostly get the swelling and rash together, whatever you do dont use any madication with asprin or ibuofen this makes it worse the doctors ive seen so far dont seem to know much about these reactions or what caused them to start ive just had to beg the clinic at the hospittal to give me a blood test just because i wanted to rule out some illnesses like c1 deficency which is heredatory and i think is linked to artheritas my mum has had this since i was little and as this is an auto immune system problem same as the urticara and the angiodema  they all came back clear but i also now have bowl problems and a stomac which yesterday swollen 3.5inches verry painfull my docs say its IBS im not that convinced im beggin to feal like its all linked did see one  website somthing new some experts have found called none rhumatriod artheritas but cant find it again its kinked with the swelling please if you find anything out or just wana chat write bk a good tip for swollen feet soke in warm water with epsom salts co-op chemist have it",
            "post_id": "4770151",
            "timestamp": "1250299365",
            "user_id": "user_1004830",
            "user_link": "/personal_pages/user/1004830",
            "votes": "0"
        },
        {
            "answer": "I also just started this site its very interesting. I have a doctor's appointment next week and also an appointment with an allergist i am very much looking forward to it. I want to know what it is, I've stopped eating nuts and berries, chocolates i'm off the birth contol pill and gravol i've been episode free for two weeks. Not sure if its just coincidence or not but i'm also taking Vitamin C which keeps the histamines on a lower level. Its very frustrating not knowing what triggers it, I will let you know what both the doctors come up with..take care guys..cfn..",
            "post_id": "4801103",
            "timestamp": "1251138451",
            "user_id": "user_1015350",
            "user_link": "/personal_pages/user/1015350",
            "votes": "0"
        },
        {
            "answer": "I have idiopathic angioedema and type 2 diabetes.  Thus far all the diabetes medication the doctor has tried has increased the size and frequence of my attacks.  Anyone else with angioedema and type 2 diabetes haviing this problem?",
            "post_id": "4879669",
            "timestamp": "1253159783",
            "user_id": "user_1042451",
            "user_link": "/personal_pages/user/1042451",
            "votes": "0"
        },
        {
            "answer": "Hello,I have recently been diagnosed with HAE Type III and am trying to learn as much about it as I can. I have been undiagnosed for the last 12 years, typically having severe swelling at least once a month.My main triggers are stress and minor trauma, I have done my best to eliminate those things from my day to day, but estrogen levels are constantly effecting my likeliness to swell.I am starting Danazol this week and am wondering if anyone else out there has any experience with this.Please, tell me anything, everything you've experienced with HAE Type III (or types I and II if you think it might help!)THANK YOU!Ayrn(also I will be attending the HAE conference in Florida in a couple weeks and would appreciate any names of doctors, people attending or good questions I should be asking.)thanks again!",
            "post_id": "4970407",
            "timestamp": "1255445355",
            "user_id": "user_1072128",
            "user_link": "/personal_pages/user/1072128",
            "votes": "0"
        },
        {
            "answer": "Hello,I know the tests I've had that have finally gotten me to a diagnosis were blood test that included my C1 and C4 levels (type I would have lower than normal C1 levels and type II your levels may be normal but the C1 molecule or whatever is mutated and doesn't work properly within your system.)I have also had tests for lupus, thyroid things and other tests that I can't remember off the top of my head but can post later when I get home and look at my lab results. Mostly these other tests were just ruling out any other condition that may cause Angioedema.The reason I got diagnosed with Type III is because my C1 and C4 levels are normal but my swelling looks and acts exactly like HAE Types I and II. Taking birth control will trigger swelling and stress is a very big trigger for me... both of these leading my doctor to believe that I have Type III (where the upregulated Factor xii is one of the reasons for swelling, as opposed to C1 levels)I hope this helps, it's what I know so far. Like I said, I am trying to figure out the most I can about Type III... since I have been called Idiopathic for 12 years and have finally just got this diagnosis.If you're diagnosed as Idiotpathic, I suggest you don't give up looking for an answer, I know how insane it can make you feel to not know why you are having swelling attacks.Hope to hear from you.thanks!Ayrn",
            "post_id": "4970463",
            "timestamp": "1255446419",
            "user_id": "user_1072128",
            "user_link": "/personal_pages/user/1072128",
            "votes": "0"
        },
        {
            "answer": "My daughter has been diagnosed with idiopathic but now they are saying it appears to be III. She has had this issue for 3 years but the last month she has been in the hospital, ICU and regular floor for about 98% of the time with continuous swelling of the voice box/throat/tongue with few periods of relief. They are treating her with benadryl and anti anxiety medicines since she has no true diagnosis.If anyone can give me any help with what works for them I would appreciate it. Aryn, seems like she mirrors you completely.We are scared to bring her home as each time we do we end up back at the ER then admitted.",
            "post_id": "5161438",
            "timestamp": "1260457760",
            "user_id": "user_1134408",
            "user_link": "/personal_pages/user/1134408",
            "votes": "0"
        },
        {
            "answer": "They have my daughter starting this. Has it worked for you?",
            "post_id": "5161449",
            "timestamp": "1260457969",
            "user_id": "user_1134408",
            "user_link": "/personal_pages/user/1134408",
            "votes": "0"
        },
        {
            "answer": "I have idiopathic angioedema too. I have had it for about 2.5 years and had more tests done then I can remember. I am seeing Dr Gordon Sussman and he suggested Danzanol but I am trying to get pregnant so I am not taking anything right now....just fighting through the reactions on my own.  I am interested in anything anyone finds out. My test results are all normal but I do have elevated alkaline phosphates ( which I have had for years) and I think that it may be connected.  I am interested in any feedback.",
            "post_id": "5526235",
            "timestamp": "1270085462",
            "user_id": "user_1265452",
            "user_link": "/personal_pages/user/1265452",
            "votes": "0"
        },
        {
            "answer": "I have Idiopathic angioedema I had it for 4 mouths I am looking for help I have been to Dr. and they dont know what do I just some help",
            "post_id": "5612538",
            "timestamp": "1272241524",
            "user_id": "user_1292518",
            "user_link": "/personal_pages/user/1292518",
            "votes": "0"
        },
        {
            "answer": "I started having regular analphlyctic type episodes (sometimes every three days or so) and after 18 rushes to the Ed and 8 ICU admissions where my face/tongue/lips/gums swelled to the point of splitting open I was taken by ambulance to a tertiary level hospital under the care of a Professor of Immunology. After yet again numerous blood tests and Ct scans looking for Lymphoma (a known cause of angioedema) I finally got a doagnosis of Idiopathic Angioedema. His immediate acute treatment was a type of speudo chemo. I took 5 antihystemines and 2 autoimmune medications 4 times a day for a month (the idea was to wipe out my receptors and shock the hypersensitivity of them) and now I take a maintainence twice daily dose of a reduced number of the same medications. So far has been 15 weeks sympton free. As much as I hate the patient sick role, It has kept me with an airway and out of ICU so I am going to continue.  It was very interesting to hear him say that 50% of people who get this diagnosis, the condition dissapears in 2 years. I didnt get any symptons until I was 41 and our collective beleife is that my case was triggered by something happening in my body (i had lived overseas for a number of years and a few night before returning to Australia I had a bad dose of food poisioning) I then took aspirin which created that whiole salicilate binding triad thing creatying an allergy to all of those sort of medications that are known to aggrivate angioedema (aspirin, ibprofen, ace inhibitors and estrogen based meds). So I have an salicilate low diet, dont take estrogen in any form and stay away from those meds which aggrivate it and so far so good.My current concern is what antibiotics can I take in the event of needing them?",
            "post_id": "5662707",
            "timestamp": "1273442736",
            "user_id": "user_1308479",
            "user_link": "/personal_pages/user/1308479",
            "votes": "0"
        },
        {
            "answer": "I was diagnosis with idiopathic angioedema four years ago and it has change my life tremondously.  The first two years were very difficult to me because of all the chronic swelling and not understand where this came from all of the sudden.  Now I have learn to deal with the situation on a daily basis if needed.  I have swelling & hive all the time but I try not to take any medication unless it is really severe.  I do carry an epipen for emergency and I recommend everyone with idiopathic angioedema too.  Everyone situation may be different but THIS is a LIFE THREATENING situation that could shut off your airway at any given time when a major episode occurs. I also wear a medical ID tag that identify that I have idiopathic angioedema and that bendaryl must be given be any surgery or operation.  The ID tag is very IMPORTANT especially since WE ALL DONT KNOW WHAT WE MAY REACT TO AT ANY GIVEN TIME!!!!!!",
            "post_id": "5870096",
            "timestamp": "1278256628",
            "user_id": "user_1369194",
            "user_link": "/personal_pages/user/1369194",
            "votes": "0"
        },
        {
            "answer": "I was just finally diagnosed with Idiopatic Angioedema after having 4 episodes in the last year and a half.  It is frustrating not knowing specifically what causes my reactions. So far I have only had lip and face swelling that are severely disfiguring- no throat or tounge swelling. After about 3 days the swelling subsides and my face looks normal. My allergist gave me something called Zyzal or Zyzol to take when I have another reaction. So glad to see this community for support.",
            "post_id": "5920116",
            "timestamp": "1279322726",
            "user_id": "user_1383060",
            "user_link": "/personal_pages/user/1383060",
            "votes": "0"
        },
        {
            "answer": "Hi I have angioedema too and am possibly Type III HEA like you aryn. What drugs do you take and is there a test avaiable?",
            "post_id": "6051463",
            "timestamp": "1282357676",
            "user_id": "user_1420280",
            "user_link": "/personal_pages/user/1420280",
            "votes": "0"
        },
        {
            "answer": "I have had AE for 35+ years and have learned to live with it.  I have yet to determine any specific cause, but I have found that my attacks(4 or 5 per year) usually follow a similar course of events.  First, I notice an onset of general fatigue.  This is usually followed by stomach- fullness sensation and then about 3 to 5 events of diarrhea.  Swelling occurs in the lips and adjacent tissues, and sometime, just one side of the tongue (happens on either side with no specific regularity).  Some time throughout the episode of about a week to 10 days of the above manifestations, I usually experience a few days of what I believe is tendonitis in my ankles or wrists.  Sometime I have small, hard sub-cutaneous welts on the soles of my feet or palms.  But, I don't get a rash or hives.  I use hydrocortizone cream on these areas with good success.I say that I have learned to \"live with it\".  I keep a supply of Epi-Pens and inject myself when the swelling starts.  While the epinephrine does not reduce the swelling, it does keep the swelling from increasing in size and causing a potential threat to my larynx...which has happened in the past.  Depending on the amount of swelling, the condition usually resolves itself in 12 to 24 hours.  Taking Benedryl seems to speed up the reduction of swelling, but I'm one of those people who gets really drowsy taking it.  I'm not sure if this helps or if it's just the diuretic effect of the Benedryl which aids in eliminating the excess of the fluids in the swelling.  I have read in some articles that one might consider taking Zantac(ranatidine) in supplement to the Benedryl.  Taking both affords both an H-1 and H-2 antihistamine.  I take both, but I'm not really sure if I am getting any benefit from pairing them.  Actually, these are taken \"after the fact\" of the onset, so they may be of little use, once the swelling is in progress.So life goes on and I have learned to consider my AE just another \"speed bump\" of life.  Go figure, huh?",
            "post_id": "6066035",
            "timestamp": "1282707484",
            "user_id": "user_1424543",
            "user_link": "/personal_pages/user/1424543",
            "votes": "0"
        },
        {
            "answer": "Has anyone found out that epi pens don't work for them?  My daughter has had this happen several times and usually ends up on an IV in the E.R. with benadryl being pumped into her after two epi pen tries.",
            "post_id": "6194047",
            "timestamp": "1285764845",
            "user_id": "user_1460276",
            "user_link": "/personal_pages/user/1460276",
            "votes": "0"
        },
        {
            "answer": "I have had swellings for the past 4 years. They are at best disfiguring and at worst life threatening.I was treathed first for anaphalatic shock, with epin pens, steriods and anti hist, But within a year it showed as not being affective. I would feel worse.I was then diagnoised with idiopathic angiodema. I get no hives just a serve swelling. mainly of my face, neck, throat, stomach. Which can be painful. It gets worst when stress, un well, tired, but regular with certain times of the months.I have borrowed the tratment of HAE type III since march this year, as i have many of the syptoms of HAE type III but no familay link. They think i may be a muntaion, after having my child. I am on stanosolol which has helped (same family as danozol) and i take a progestrone hormone to lower my estrogen levels. This has taken the rountine out and i only get them now at times of strss, etc.When i have a major swelling i have used ICATIBANT which reduces it by a third in 45 mins and in 4 hr i am nealy back to noraml.Problem is getting it funded as it is very expensive.",
            "post_id": "6207733",
            "timestamp": "1286100300",
            "user_id": "user_1463895",
            "user_link": "/personal_pages/user/1463895",
            "votes": "0"
        },
        {
            "answer": "Hi, welcome to the forum, C4 and C1 inhibitor antigenic levels are recommended as initial screening tests in the patient. Type I HAE involves 85% of cases; it has basically low levels of a functional C1 inhibitor. Usually the level will be less than 30 percent of normal in most patients.Type II HAE, there will be presence of a dysfunctional C1 inhibitor protein, which is present in normal or elevated amounts. Upon testing, functional levels are low as in Type I, but with normal or elevated antigenic levels.Type III HAE, the levels of C1 inhibitor will be normal but a defect in the gene for coagulation factor XII (Hageman factor) has been described. As type III is a genetic defect, it can be passed on to the offspring.Treatment options are same for all and depend on the symptoms. Treatment options available for the acute attack are C1-inhibitor [C1 esterase inhibitor replacement protein (C1INHRP)], Plasma and Antifibrinolytics against prescription.I suggest you to consult immunologist for further evaluation. Take care and regards.",
            "post_id": "6208811",
            "timestamp": "1286131609",
            "user_id": "user_1355118",
            "user_link": "/personal_pages/user/1355118",
            "votes": "0"
        },
        {
            "answer": "I've had the severe angioedema for years now. prednisone with an antihistamine works to plateau the swelling but the cause of attacks is unknown. I believe it's stress. the allergist won't ride along with me on that because it's not \"in the literature\". however I don't think he rules it out and he admits he has patients who occasionally call some time later and report that it has gone away usually after some \" life change\".as for the posters question, I believe now there is a very new drug for HAE, which doesn't treat idiopathathic angioedema.",
            "post_id": "6277106",
            "timestamp": "1287796146",
            "user_id": "user_1483678",
            "user_link": "/personal_pages/user/1483678",
            "votes": "0"
        },
        {
            "answer": "I want to throw this out there. My daughter was diagnosed as idiopathic angiedema 3.5 years ago. Approximately 1 year ago we found out that she had been misdiagnosed completely. This is more for the people who only have the \"throat\" episodes, not those with facial or abdominal issues.She was diagnosed with Paradoxical Vocal Cord Dysfunction or (Motion). PFCD or PFCM. As with many of you, you are looking for treatment and trigger. Although we are still looking for the \"reason\" this happens we find that IV benadryl calms down her vocal cords, usually 150MG, in 50 MG doses at a time.I wanted to share this as an alternative to a diagnosis that may be wrong but only because of the severity of throat and life threating reasons is this the first path you usually go down.I don't fault anyone and am grateful that this was found. This isn't life threatening as angioedema.",
            "post_id": "6278243",
            "timestamp": "1287838959",
            "user_id": "user_1134408",
            "user_link": "/personal_pages/user/1134408",
            "votes": "0"
        },
        {
            "answer": "I have been dianoised with idiopathic Angioedema after 15 years of suffering. I am currently being treated with high doses of zurtec about 4 times the normal dose. It is working great. It's not a cure but at least it keeps the swells at bay. I have suffered from stomache, face, and full body swells most of my life not mention a list of other sytoms very similar to HAE. All I can say is don't give up and persist until you find help.",
            "post_id": "6368019",
            "timestamp": "1290049515",
            "user_id": "user_1510223",
            "user_link": "/personal_pages/user/1510223",
            "votes": "0"
        },
        {
            "answer": "I am the spouse of an Idiopathic Angioedema patient of approx. 5 years, who has swellings of the throat, lips , tongue, stomach, usually with some tongue pain even if no swelling and a one-sided raso of sorts along the side of his back.  Now we think the ears are swelling and this is new and he has ear bleeding - has anyone else had this or know anything about it???  Thanks...",
            "post_id": "7040559",
            "timestamp": "1309822478",
            "user_id": "user_1726858",
            "user_link": "/personal_pages/user/1726858",
            "votes": "0"
        },
        {
            "answer": "Good afternoon,Am new to this forum. I've had idiopathic angioedema since I was a teen (am now 55) and had always thought I had allergies to what I could not figure out. Nothing seemed to make sense to me and antihistimines never worked. Five years ago I went to a specialist and he diagnosed it very quickly. I was prescribed a combination of 3 medications to be taken all at once with the onset of swelling - Ranitidine ( 1 x 150 mg), Reactine (1 x 20 mg) and Prednisone (3 x 5 mg). This combo has worked extremely well since. I also keep an epi-pen handy as well. Hope this helps,Thanks, gerry",
            "post_id": "7094042",
            "timestamp": "1311558375",
            "user_id": "user_1746940",
            "user_link": "/personal_pages/user/1746940",
            "votes": "0"
        },
        {
            "answer": "Hi,I've experienced swelling of pretty much every part of my body - feet, legs, throat, lips, face, in fact on one occasion my entire body on my left side had swollen, right down the centre line. My swelling generally starts with a painful itch and have had it happen so many times you just know what it is coming on.  Although my ears have swollen in the past on occasion, I have never experienced ear bleeding, so am not sure about that.Thanks, gerry",
            "post_id": "7094092",
            "timestamp": "1311559999",
            "user_id": "user_1746940",
            "user_link": "/personal_pages/user/1746940",
            "votes": "0"
        },
        {
            "answer": "I have idiopathic angioedema, and was diagnosed over 11 years ago. Just within the last year I have also been diagnosed  with Mastocytosis, that makes my allergic reactions very severe. For both I carry 4 epi-pens, one does not give me much time. It takes 3 to get me to the ER (less than 10 miles away), were I need, by IV Benadryle, steroids and possibly Epinephrine Hang in there as time goes on, I learn my triggers, my swellings from Idiopathic Angioedema lessen in numbers. In addition to 4 Epi-pens I carry claritin reditabs, primatene mist,  Prednisone, and Benedryl liquid caplets. I also take, daily by prescription, H1 and H2 blockers (Zantac, doxipen, Singular, Claritin x4, & Hydroxizyne), these meds have helped tremendously to keep the episodes down to only a few a year! Keep your head up, it does get better with time, patients, great doctors and great support. Explosive70",
            "post_id": "7302424",
            "timestamp": "1317976969",
            "user_id": "user_1831559",
            "user_link": "/personal_pages/user/1831559",
            "votes": "0"
        },
        {
            "answer": "I'm really sorry To hear that there is a lot of people out there with this idiot decease.I just got diagnosed with Idiopathic Angeodema actually I have it since 2000 but no one could tell what it was. I have lost a job,party's and parent conferences due to swelling of either face,feet it's embarrassing going out looking like shrek.When my hands swell I can't even cook for my kids.I had a housekeeping Job at a hospital wich I had to quit because my absences were getting ridiculous because of my swelling(I rather quit than get fired)But lately my swelling it's been geting more ridiculous than than ever.I have been looking for another job but afraid of finding one because I know my illness will interfere with it.Another big problem that I have (I hate this about all this)I can't wear any high heels,boots or nice shoes because my feet will swell to the point that I will cry of the pain.it's been 7-8 yrs that I don't wear a nice dress with nice shoes.I'm on jeans and tennis shoes all the time.Well friends it was nice to talk or text with people that know what I'm going throu. I don't when this will end f but I hope it happens soon for all of us.;)",
            "post_id": "7346380",
            "timestamp": "1319305570",
            "user_id": "user_1850489",
            "user_link": "/personal_pages/user/1850489",
            "votes": "0"
        },
        {
            "answer": "The medical profession still do not have any answers but I might be able to help. I have suffered from idiopathic angioedema for 25 years, undertaken every allergy test and not found the cause. I have been taking 2 prescribed antihistimines Loratadine & Telfast every day which has helped to reduce the attacks to 2-3 per month. By sheer luck & perserverence I think I have found my solution, I started taking Sertraline 50 mg/day in November 2011 and have only had 1 attack in 10 months. The sertraline has reduced my stress and I guess the angioedema. Hope this helps any other desperate & frustrated sufferer.",
            "post_id": "8406005",
            "timestamp": "1349809363",
            "user_id": "user_4102562",
            "user_link": "/personal_pages/user/4102562",
            "votes": "0"
        },
        {
            "answer": "First time on this site- I'm looking for support not about treatment options, but just to check-in with people trying to shape their lives around living with this condition. I was diagnosed with HAE III in 2008 after a lifetime of unexplained and misdiagnosed symptoms. Fortunately, my cousin was diagnosed first and had advice that helped me- including seeing an allergist who vonsulted directly with her doctor to find out what worked for her. So I've been on Danazol 600 mg per day and that has lessened the frequency and intensity of the episodes. She loses her airway and gets injections of the latest drug in the ER when needed. My throat, tongue, neck and stomach swell, but not life threatening so far. What brought me to the ER was a peculiar set of symptoms that included swelling, but also mental status changes- really slowed down thinking, slurred speech, chest pain, vertigo, and spacial distorions. They thought it was basilar migraine, ot a TIA, a neoroligist said I had markers for MS but no confirmed diagnosis, my pulse also slowed to 50, and I had trouble breathing- like I was breathing through ash in a fire. Prednizone lessened the symptoms over time- it took about two months to be functional- though I went to work with shorter dats and a lot of fatigue. After I found an allergist and was diagnosed, I improved with Danazol, Benedryl and Pepcid occasionally- that's what my cousin found helped some with the trouble eating I was having.Episodes are still pretty bad with fatigue, difficulty thinking, stomach pain, chest pain, weight gain overnight, minor throat swelling and pressure headaches- which I take to be swelling of the neck muscles like you get with whiplash, and joint pain. Doctors don't see the thinking and head pressure as part of HAE but it all happens together, and my cousin experiences the same symptoms, only hers can still be life threatening.Triggers include dental work, physucal trauma (I was in a fender bender that triggered an episode), prolonged computer work, stress and not enough \"horizontal time\" compared with physical strain like moving, gardening, etc.I can tell when one's coming on by a few things- fatigue, joint pain, and having trouble completing an easy sudoku when I normally finish hard ones in less time. When the symptoms get incapacitating, I use a three day course of Prednizone which doesn't help the swelling, but does jump start my brain and reduces the fatigue and joint pain.It's difficult when there is so much emphasis on the swelling, because for me the other symptoms are incapacitating, hence my need for support. Sometimes I think maybe I don't have HAE but another autoimmune disorder but I've been tested for RA, MS, Lupus. Another common symptom in my family in general is vitamin D deficiency, which a lot of us take 50000 per week for.Anyine else out there have these other CNS symptoms?",
            "post_id": "8469284",
            "timestamp": "1351609267",
            "user_id": "user_4243501",
            "user_link": "/personal_pages/user/4243501",
            "votes": "0"
        },
        {
            "answer": "Allow me  a moment to walk you through my journey with angioedema. My journey began to rapidly increase in 2009.  I remember in my early twenty’s that a small area on my nose would swell. It was very noticeable just uncomfortable, I never thought anything of it. I was a server at a local restaurant in town and I remembering coming home and not being able to walk on my feet once I took my shoes off because my feet hurt so bad.Fast forward, in my late twenty’s…. I became pregnant with my first child, I was approximately 7 months along and sitting at home alone and my tongue swelled up. I specially remember eating a ham lunchable and drinking a bottled water. I went to the doctor and they had no clue what had caused it. They administered benadryl and prednisone. The swelling went down with in about 15 minutes. I began having more swellings, feet, fingers, hand, etc….. I ended up delivering about 6 weeks early due to preeclampsia that turned into full blown toxemia . After I delivered, I was hospitalized for 9 days due to health. It first started out that they couldn’t keep my blood pressure down but once they got it under control, my swelling kicked in. It was my tongue again =[My swellings began happening sporadically; I would have an episode then would go months while out any. Some months I would have swellings that would range from minor finger to tongue. I would have a 2 or 3 then go a week have another then month with no symptoms….. Then BAM, I would have another large swelling.Slowly after time, the swellings went from months in between, to monthly, weekly and now daily. Yes, that’s right, DAILY!  These swellings would occur in my fingers, hands, arms, lips, checks, eyes, nose, feet, tongue, throat, and even by butt.I have had testing:skis test & blood test= only allergic to cats (low)Thyroid=normalLymphoma & lupus= negativeI have tried a series of medications, Zantac, Pepcid, Benadryl, prednisone, z-pack, AllegraThey recently started my on 2 other meds that I don’t even know how to spell, but they are stronger than bendryl.They are wanting to start me on Plaquenill……… but it scares me.I was told there is new medicine that they are trying to get approved for allergies/angioedema…..maybe Zolzar?I felt I wasn’t getting anywhere, what was wrong with me? So I adventured out to the Cleveland Clinic.  Unfortunately, they couldn’t help either. They didn’t know anything more than what I did and prescribed me the stronger meds.It is hard to have two small children at home, work 40+ hours a week and takes these meds. It causes me to miss a lot of work. I try to work through my swellings but it is very difficult and I can’t seem to stay awake.  By the time I get home, I can’t stay awake…my girls ask: Mommy why do you have a pumpkin face? Are you sick again? It breaks my heart =[The doctors say that I might go my entire life and never find a cure. So, in the meantime, I have to learn to manage it. But, how am I to manage an intermittent disease? Even when I am trying to prevent the swellings, they still keep coming on.We went to Disney world and I spent two days at the resort with a swollen tongue. I have changed eating habits, laundry detergents, change of scenery, perfumes, eliminated caffeine, and still no change.The swellings now take longer to go down. Only bendryl and prednisone will reduce/eliminate the swelling. Before it would take 15 mins-1 hour. Now it takes 4 hours- 48 hours to go down.My worry is….will it attack my organs? No one has an answer for that yet…so I have been told.Yesterday, my right eye, tongue, throat, hand and lips swelled. This was one of the most server episodes that I had. I constantly tired, feel spaced out sometimes, and very stressed out.",
            "post_id": "10129165",
            "timestamp": "1395598234",
            "user_id": "user_7940101",
            "user_link": "/personal_pages/user/7940101",
            "votes": "0"
        },
        {
            "answer": "I also have idiopathic angioedema. I was diagnosed with angioedema when I was 16, in 2009 when I had chronic, random, severe swelling come up all over my body. In 2010 I saw an angioedema specialist in Dallas, Texas, who verified that it was idiopathic angioedema. At the time my symptoms started I had just gotten the depo birth control shot, which triggered my angioedema. The specialist I saw in Dallas told me to steer clear of all birth control as well as any medicines that end in 'plir'  (blood pressure meds) because they tend to cause outbreaks in angioedema patients. My hands and feet stay swollen, usually with little pain. However, for the first time in nearly 3 years I can hardly walk because the swelling is so bad and I am in much pain. My lips have also been swelling up lately, which makes me very uneasy because I do not want my throat or face to swell up again. I'm wondering if it is something to do with the change in weather? I wish there was medicine that angioedema patients could take! Zyrtec and Zantac (H1 and H2 blocker) is what I've always been told to take, but it has never seemed to help. I've heard of plasma infusions they do in Europe that eliminate most or all symptoms, but it is not FDA approved for the U.S. Anything would be worth trying! Does anyone else know of any treatments?",
            "post_id": "10134404",
            "timestamp": "1395688538",
            "user_id": "user_7950780",
            "user_link": "/personal_pages/user/7950780",
            "votes": "0"
        },
        {
            "answer": "I also have angioedema & urticarial and have not figured out whats causing it yet.  Is it true that Vit C keeps the histamine levels down?  I am sure willing to try that if it works!   Thank you!   Nikki",
            "post_id": "11067933",
            "timestamp": "1409948624",
            "user_id": "user_10412914",
            "user_link": "/personal_pages/user/10412914",
            "votes": "0"
        },
        {
            "answer": "A lot of what I have read sounds all to familiar. I have acid reflux and stomach pain with mine.. Feet are swollen as I type. If you find out anything that makes yours go away please let me know!",
            "post_id": "13920995",
            "timestamp": "1467228688",
            "user_id": "user_18715874",
            "user_link": "/personal_pages/user/18715874",
            "votes": "0"
        }
    ],
    "post_id": "4761443",
    "question": "What is the current practice or tests that are requested for patients who suffer from Idiopathic Angioedema, but have all of the same symptoms and charateristics of those who have been diagnosed with HAE type I or type II??  Is there a concrete set of lab tests to determine whether or not an individual with Idiopathic angioedema has HAE type III ???Also, even if one is diagnosed with type III, would that change how they were treated?  What is the current practice in preventitive medicine of attacks and also what is the current practice of treating indiviudals with accute attacks??Can type III be passed on to offspring?Thanks!",
    "timestamp": "1250111458",
    "title": "Idiopathic Angioedema",
    "user_id": "user_1002382",
    "user_link": "/personal_pages/user/1002382"
}