{
    "answers": [
        {
            "answer": "Hi, my name is Dakota. I have been with med help since the last year. i am currently 30wks pregnant with my first child and i turn 20 this year. Technically this is our 3rd if you think of my siblings who live with my fiance and I. I raised them since they were born and they still stay with me. i have full custody. We are so excited for our little girl to get here! I work full time at a clinic in the next town over. I love my job and working but will be a stay at home mom after my baby is born. We can afford it and I don't want to miss a moment of anything. i plan on having an all natural birth, but i do know things dont always go as planned. I hoping to meet my goal. My family isn't much supportive of it. They all say \"oh, you'll see. You'll give up\" etc. My fiance is supportive though which i am very thankful for. I am due May 2 but have been having trouble with my blood pressure being high. They are thinking i might develop pre-eclampsia. Can't wait to meet new friends and learn more about all of you.",
            "post_id": "6673702",
            "timestamp": "1298418426",
            "user_id": "user_1510919",
            "user_link": "/personal_pages/user/1510919",
            "votes": "0"
        },
        {
            "answer": "Dakota, that is just so sad they're not supportive! I wouldn't talk with them about it anymore. Surround yourself with positive people (like us and your husband!). Use their horrid words to drive you to prove them wrong. They think you'll give up so make them proud of you! That ultimately isn't what it is about but take the negative and make it good.While things don't always go as planned remember that the less interventions you have the more likely your plan will play out. I think what is important to know about birth plans is that they are more like Birth Wishes, which is what I'll call them here. A plan suggests that you will put down, \"I will only feel pain as strong as menstrual cramps\" and \"My labor will only last 3 hours\" and \"I'll push my baby out on the first push\". Those are plans.But to put down, \"We wish to delay cord clamping\" and \"I wish to be free to move around during labor\" are wishes and guidelines to your care provider about the type of birth you want. Again, the less interventions the more likely you'll have that natural birth.",
            "post_id": "6674104",
            "timestamp": "1298426977",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Hi I'm Marisa.  I have a 16 month old daughter who is just wonderful and such a happy little girl. I wanted to have a completely natural birth with her but it did not go as I planned. I was a little upset that I gave in and got the epidural especially because I gave birth literally 1/2 hour later but it's ok and I was so nervous being that it was my first. I am pregnant again and due Sept 15th and I will try to go natural but we'll see. I had a fairly easy delivery and I am hoping for the same again.",
            "post_id": "6674433",
            "timestamp": "1298434571",
            "user_id": "user_768015",
            "user_link": "/personal_pages/user/768015",
            "votes": "0"
        },
        {
            "answer": "Hi I am Chantal and have been a part of medhelp for 4 years now. Had 2 miscarriages but I have had 2 children so far, Jeremiah who is almost 3 and our sweet Jesse who passed away in Aug. 2010 at 10 months old. I am now preggo with #3 and finally expecting a girl this time. I am due July 7th 2011. I enjoy being a SAHM (stay at home mom), taking care of my family, and learning about pregnancy.I have had 2 amazing births, all natural and drug free. First labor was 13 hours, it was pretty intense as my son was coming down crooked but I had a good support system around me. Second labor was 4 hours and I pushed him out in 4 pushes. I am hoping that this time around I can be more focused as the pain intensifies and stay calm. I have a tendency to freak out the last hour or 2 of labor and lose all concentration. I would love to learn how to better cope with the pain as pushing time approaches.I choose natural birth because I think it's the best and safest decision for me and my baby. There are so many benefits to giving birth naturally and I am so thankful that I have been able to accomplish this twice so far. I have a very low tolerance for pain, so I still can't believe that I was able to do it both times! My husband is the best support I have, without him, I'm not sure I would have been able to do it.",
            "post_id": "6674467",
            "timestamp": "1298435633",
            "user_id": "user_280369",
            "user_link": "/personal_pages/user/280369",
            "votes": "0"
        },
        {
            "answer": "Marisa - welcome! We're pregnant together again! I'm due Sept. 21!!!Chantal - that is transition; most women lose it at that point! But you know what to expect so perhaps it won't be so scary for you this time. ;-)",
            "post_id": "6674480",
            "timestamp": "1298436049",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Okay time to introduce me! I'm Joy, mom to three little girls. Elaina is 5, Abigail will be 4 next month and Zoë is 16-months. I've also had two miscarriages so this is our 6th pregnancy and as I stated directly above I'm due September 21. Tomorrow I'll be 10 weeks!My first two daughters were born with OBs at the hospital. I had epidurals with each of their births. My first daughter had meconium in the water so I didn't get to hold her right away. My second daughter's collarbone broke during her delivery (you'll hear me say this many times- pushing on your back is a no-no! It narrows your pelvis up to 30% and causes broken collarbones, shoulder dystocias and you can even break your tailbone).With my third I wanted something different. I did a whole lot of research and made the switch from my OB to a group of midwives when I was 37 weeks. Three days past my EDD my water broke at home and I went to the hospital to have my natural birth (these midwives deliver at the hospital). My midwife, husband and MIL were the only ones in the room. I pushed in a side-lying position because that is where I was when the urge to push came and I couldn't move. I pushed her out in under 60 seconds because I KNEW the 'ring of fire' would stop once she was out!My husband thought I had lost my mind but after her birth and after watching The Business of Being Born (which he watched after she was born) he finally GOT it. He got why I was adamant about having our baby as safely and peacefully as possible.We're considering a birth center or home birth. But we may stay with the midwives at the hospital. I'm not totally opposed to the hospital but I feel a home birth would be nice. Just stay home in comfort, have a baby and snuggle and relax! No nurses coming in every couple hours, no groups of people staring at my girly bits when I give birth. Mainly I want a water birth, whether it is at home or the birth center or wherever. I'm hopeful!",
            "post_id": "6674506",
            "timestamp": "1298436489",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Hi my name is Brandy. I have 4 children and all were born naturally. I was still in a hospital, but no drugs were given. It is made easy by the fact that I have babies in about 2 to 3 hrs after my water breaks. I am currently expecting #5 and if everything goes the same as the others will have this on naturally as well. I would also be willing to answer any questions you other mom's might have since I have some much experience in this area.",
            "post_id": "6674610",
            "timestamp": "1298438924",
            "user_id": "user_1561668",
            "user_link": "/personal_pages/user/1561668",
            "votes": "0"
        },
        {
            "answer": "My name is Corinne. I am 25 years old and have been TTC for about 4 months now. I have not yet conceived, but I would love to learn more about the pros & cons of delivering natural vs. having epidural/other pain medications. I want to try and be as knowledgeable as possible.DH and I have been married for 2 1/2 years, and have been together for 7 years. We would love to start a family asap, and are really hoping this is our month! I am a hairstylist and he is a graphic/web designer working from home. We have 2 dogs and a cat, so right now those are our babies!",
            "post_id": "6675654",
            "timestamp": "1298473467",
            "user_id": "user_1486020",
            "user_link": "/personal_pages/user/1486020",
            "votes": "0"
        },
        {
            "answer": "My name is Heather, I'm 26 years old and have 1 little boy who is currently 16 weeks old. I'm not currently pregnant but plan to have more kids and plan to do it naturally like I did with my son.I was very determined to have a natural birth and did a lot of \"homework\" to prepare myself for it. I had no idea what a contraction felt like so I didn't rule out epidural just in case. Many people were quite annoying when I said I wanted to do it naturally and said many things about how I wouldn't be able to do it. I didn't like that at all but it just made me feel more proud to be able to do it.What helped me was reading about the Bradley Method. I really enjoyed it and really understood about having to relax during contractions instead of tensing up. I truly believe that medical interventions and inducing labour slows the process down and inevitably makes for more interventions and problems later on.From first contraction to birth I was in labour for about 9 hours. Hard labour for about 4 and had a 9lb 3oz baby with a perfect round head! LOL I had many stitches but he's worth it!",
            "post_id": "6675691",
            "timestamp": "1298474041",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "My names rebecca, I'm 22 years old, I'm 33w3d along with my first baby, it's been a relatively easy pregnancy, I have been a member on this site for just over 8 months and have found people to be extremely supportive.I'm hopeing that I cope with the pain and manage to deliver my baby naturally! Can't wait to experience that feeling and bond with the baby.  I've had to leave work early due to high blood pressure which is ok all these appointments and everything will be worth it when I have baby in my arms :) x",
            "post_id": "6675860",
            "timestamp": "1298477124",
            "user_id": "user_1420648",
            "user_link": "/personal_pages/user/1420648",
            "votes": "0"
        },
        {
            "answer": "My name is Tiffany I have one little girl that is 20 weeks old. I am not currently pregnant but my DH and I have talked about a 3 year gap between kids. I went naturally with Naomi for 6 1/2 hrs before the Ob I had came in an told me it would be about 6 more hours so I got an epidural so I could rest. Not even an hour after he  came back in and said she wasnt going to fit and I would have to have a c section. I felt awful for the longest time after she was born that I was defective and incapable but after doing some research to learn about VBACS I learned that he did it for his time and not by my wishes. He just didnt want to wait for me to progress. When I came in  I was only 3 maybe 4 cm and he broke my water and stuck me in the bed which all but stopped my labor and I was then put on pitocin.  I have since decided that I am going to try a different practice that has midwifes with a high VBAC rate with a hospital that supports VBACS and has a high success rate at like 80%. I would love to learn all I can between now and the next pregnancy so that I am ready and more confident in voicing my opinion and what I want done. I am a stay at home mommy right now and I cant wait to watch Naomi grow up.",
            "post_id": "6675957",
            "timestamp": "1298478456",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "My name is Carly. I don't have babies as of yet but me and my other half cant wait for the day to come when we are finally blessed with one. We have been ttc for about 4-5 months now (kind of lost track a little, since we have decided to stop 'trying' and just go with the flow). The fun was going out the window for us, so were trying not to think about it too hard and trying to take the attitude that itl happen when its meant to :)When it comes to child birth I have the view that the most natural is the best way, the other half agrees too. Him and myself are not too keen on the whole taking medicine when in labour to help with the pain and that the pain is there for a reason. Who knows how I will feel WHEN its my turn to do so though :)",
            "post_id": "6676368",
            "timestamp": "1298485275",
            "user_id": "user_1527510",
            "user_link": "/personal_pages/user/1527510",
            "votes": "0"
        },
        {
            "answer": "Hello. Im Julia. I am pregnant with baby#2 (BOY) and really hope to go into labor naturally. I really want to see my body do its own thing, like nature intended. I dont want to use pain meds, specifically the epidural. With my first daughter I was induced at 37.5 wks. and i had the epidural, labor was really intense where I was howling in pain at only 2-3cm! My contractions were about 3 min long and one min apart the entire labor. I AM SURPRISED my DD didnt go into distress. And I had to push flat on my back....WIth this baby I really want to try labor as naturally as possible. I want to labor for the most part at home, then when contractions are about 5 min together then Ill go into our birthing center here. Also my boy is due May 19th.... and DD Bday is May 23!!!!",
            "post_id": "6676422",
            "timestamp": "1298486123",
            "user_id": "user_920871",
            "user_link": "/personal_pages/user/920871",
            "votes": "0"
        },
        {
            "answer": "My name is Clysta, I'm 21 and have a 24 week old baby girl. I'm not currently pregnant, but wish to learn more about natural labour and birthing. When I was pregnant I had strong intentions to having a natural labour and water birth, but kept an open mind since she was my first. I didn't get the birth I wanted though. I had never counted on back labour and the agonizing pain it brought with it. I got the epidural at 5 cm's, and by then time I went to push it wore off and I pushed her out with complete feeling. I was in labour for around 24 hours unmedicated, and an additional 5 hours with the epidural.",
            "post_id": "6676974",
            "timestamp": "1298496000",
            "user_id": "user_1194973",
            "user_link": "/personal_pages/user/1194973",
            "votes": "0"
        },
        {
            "answer": "Hi I'm Ola..I tried to have a natural birth with my son. 11hrs into it I just wasn't dilating, my canal was too narrow, JJ was face up his poor heartbeat was dropping and dropping fast. So I had to have a C-sec. I'm hoping to go natural once again when we conceive our next \"bundle of Joy\".",
            "post_id": "6676991",
            "timestamp": "1298496358",
            "user_id": "user_1530342",
            "user_link": "/personal_pages/user/1530342",
            "votes": "0"
        },
        {
            "answer": "I'm Manda.  I have one daughter who just turned 6 months and we're ready to start trying for number two.I had hoped to have my daughter without any medications but I was induced due to preeclampsia (using two different drugs) and I had an epidural as well as antibiotics for group B strep.  So it ended up being pretty far off from what I had envisioned.I feel like I could have done it without the epidural if my body hadn't been hijacked by the pitocin (that stuff is pretty evil in my opinion!).So I'm hopeful that we'll be expecting soon and that when labor starts it will be on baby's terms, not the doctors.If we can start off with fewer interventions I'm sure we can prevent them from snowballing and taking over in the delivery room.",
            "post_id": "6680279",
            "timestamp": "1298581851",
            "user_id": "user_1616133",
            "user_link": "/personal_pages/user/1616133",
            "votes": "0"
        },
        {
            "answer": "I'm Carla, i have a 3 yr son and expecting #2 due may 5th, I'm hoping to have a natural birth if all goes to plan due to not having it with ds #1 who i ended up having a epidural and pitocin due to my contractions not being regular, But i'm sure i'll end up being induced due to having gestational diabetes, but hoping i go on my own",
            "post_id": "6725233",
            "timestamp": "1299824361",
            "user_id": "user_136689",
            "user_link": "/personal_pages/user/136689",
            "votes": "0"
        },
        {
            "answer": "Wow, lots of women who want to VBAC!!! (Vaginal Birth After Cesarean) Niiiice! We'll definitely cover that topic here. Feel free to post questions on the forum or share any blogs or information on VBACs ladies!!!",
            "post_id": "6744914",
            "timestamp": "1300410867",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I'm Lauren.  I am 20 weeks pregnant and have two children already.  My daughter is 4 and my son is 2.  I have had one MC between my two children.  I have had both my children by c-section - 1st I was in labor for 8 hours and then after getting an epi things slowed and was then given pitocin which caused fetal distress and was told either a c-section or risk an emergency.  I am very unhappy about this situation as by the time I was prepped I was fully dialated and things had setteled down with bub.  Second was a planned c-section mostly due to bad PND i had with first and wanting to have as mcuh controlled as I could this time around and also becuse my doc just assumed this would be the case due to prior birth.  This time around I have changed doc and done my research.  I will be going VBAC2 and am well on my way to seeing this happen.  Doc is happy as long as 38 week scan showns strong lining and baby is in a good position and good size.I am worried as doc said he prefers not to use epi due to the fact is can slow labor and nothing can be given to start it up again.  I am not sure if this is a scare tactic or truth but am a bit worried I will not be able to handel it and it will end in a bad experience and PND again.Look forward to hearing everyones experiences and thoughts - good luck.",
            "post_id": "6745779",
            "timestamp": "1300444347",
            "user_id": "user_342647",
            "user_link": "/personal_pages/user/342647",
            "votes": "0"
        },
        {
            "answer": "I'm Audrey, I have 2 boys who are the light of my life--Trevor is 6½ and Greydon is almost 14 months. Currently, I am NOT pregnant or trying to conceive, but would like to plan for another child with a natural birth in about 3 years from now.☺ I'm married to my wonderful husband, Brandon.My hobbies are taekwondo (1st degree level 2 black belt) and having pet birds. I have 7 birds currently; 2 parakeets, 2 diamond doves, a society finch and a Gouldian (rainbow) finch, and a Senegal parrot.My 2 previous births: both were elective inductions for 2 different reasons. While I don't regret a single thing with either, I do strive for an all natural birth with my 3rd and this is extremely important to me now. I feel it's an experience I need an opportunity to have because I wanted it so badly for my 2nd birth but was unable to get it the way I wanted it.With my 1st birth, I had an elective induction for convenience. I had just turned 20 years old and I'd had a very emotionally difficult pregnancy because of my son's father (long story) and I was a college student. Trevor's due date was the week before my finals, so I wanted the induction for 2 reasons: I didn't want to miss my finals and have to reschedule them during my winter break because I wanted that time uninterrupted to bond with my baby, and I didn't want my child's father at the delivery because he knew the EDD, so I anticipated him showing up to harass me around that time. I just didn't want to deal with all that stress at once--having a baby, rescheduling finals, AND dealing with my mentally-unstable-at-the-time ex boyfriend. So I scheduled the induction at 39 weeks. It was a textbook induction and delivery; I had Stadol, an epidural, an episiotomy, and a baby...no complications whatsoever. I didn't know much of anything about giving birth and was completely trusting of my OBGYN who was fantastic in every way.I look back on it all now and it's a bit fuzzy. I remember that I didn't get to hold my baby right after he was born and when they did bring him to me swaddled up, I only got to hold him and attempt to breastfeed him for a few minutes before they took him away from me again to take me to recovery. I don't remember many other details because I had been doped up on Stadol and exhausted by the time I delivered my baby after 9 hours of labor and having had NO food since the day before. I was so weak and dizzy by the time I was taken to recovery that when I was stood up and taken for my first bathroom break, I passed out on the toilet. Because of that, my visitation with my son was further delayed because they wouldn't bring him back to me until a couple of hours after I was \"stable.\"It wasn't necessarily a bad experience as I knew nothing different at the time, but looking back on it now, I know of so many things I'd never want repeated with birthing future children.With my 2nd son, I went into preterm labor at 33 weeks on December 23. That landed me in the hospital until the afternoon of Christmas Eve; I received a major dose of Procardia and didn't respond, then a dose of turbutaline and didn't respond, and ended up on magnesium sulfate through the night. That stuff is HORRIBLE; it feels like lava runs through your veins and it makes your body so weak that it's difficult to breathe. I was sent home the afternoon of the 24th after a steroid shot for my baby's lung development, only to have my husband rush me back at 2 a.m. the 25th in full blown labor again, which landed me on a second dose of mag sulfate. I honestly thought I was going to die. The mag sulf made breathing so difficult and painful, I thought I'd die and my baby would be born via c-section just before I passed. I've never been so scared and in so much pain in my life. That pain that hurts far worse than labor because so much intervention is being made to stop a natural process that is happening too soon. I've experienced no other pain that compares to stopping preterm labor.Once I was stablized 2 days later (the 27th), I was sent home on Procardia and bed rest. However, the labor did not stop, it was just two weak to make any progress. Everyone thought I'd have my baby after stopping the Procardia at 36 weeks, but he hung in there until 38 weeks (with one other hospitalization at 36½ weeks for false labor). At that time, my OBGYN offered to induce me. I was in so much pain from 5 weeks of labor, an induction was a welcome offer! I still wanted to make it as natural as possible. I wanted to seek a midwife, but apparently they are hard to come by in AL because the state Health Dept. does not grant permits to CNMs.Anyway, knowing I'd be confined to the bed with an induction, I opted for the Nubain because I knew I wouldn't be able to walk around or move through my pain. Originally, the Nubain was all I wanted. But since I'd been in labor for 5 weeks, my labor was kinda halfway there. I easily started at just under 2 cm and progressed to 6 cm with great control. Then I got to 6 cm, a contraction came, I went to 8 cm and lost all control.This is where I wish things could have been different. The nurses and doctors kept asking me if I wanted the epidural, and I kept refusing it, making my intentions for a natural birth clear. But once I reached 8 cm and was screaming my head off, none of them offered any support, guidance, or encouragement to stay true to what I wanted, and when I asked for the epidural, they called the anesthesiologist without hesitation.They told me to sit up to have it placed. I wanted to lie on my side and curl my back out--they said, \"You don't sit up, you don't get an epidural.\"I sat up, leaned against my husband, had a contraction and felt my son's head crown. I began screaming uncontrollably. I had just gone from 8 to 10 in one contraction and my baby's head was being held in place by the mattress instead of coming out so the pain was excruciating. NO ONE except my husband believed me when I screamed he was coming out; they said I was only feeling pressure. One nurse screamed at me to stop screaming (I couldn't help it). It felt like my stomach was being ripped open from my vagina.The epidural was finished and they laid me on my back. An on call OB came in, took one leg and tried to hike it up into a stirrup. I screamed to let go of my leg. At the moment he lifted my leg, the nurse who had screamed at me, told me I was \"only feeling pressure,\" exclaimed, \"Oh, wow--you ARE crowning!\"My OB made it in to deliver my baby just as his head was about ¾ of the way out. I delivered lying on my back in a reclined position with my legs down on the lowered bottom half of the bed. I wanted to deliver lying on my side, but there was no time for that once I was laid down after the epidural. I got a 2nd degree tear and my baby's head was bruised and I'm certain that's because I was lying on my back and he came out so fast (2-3 pushes).My baby was placed on my stomach immediately after birth for about a minute and I delivered the placenta during that time. He was left with me in L&D for 2 hours to bond and breastfeed until we were taken to recovery together, after which they took him to the nursery.So, knowing that I want to have a 3rd child, I want to be sure I have more control over this so I can get what I want next time, without nurses screaming at me or doctors putting me in positions that hurt and injure me and my baby. Knowing now that I'll probably have another speedy labor, I know I can keep better control of myself, and my husband will be a better advocate for me--I think with our last child, we were both in a bit of shock and therefore not in the best position to defend what we wanted for our birth experience. Knowing now what my body is capable of doing, I feel better equipped to try to achieve what I want in a birth. ☺",
            "post_id": "6746880",
            "timestamp": "1300471749",
            "user_id": "user_184674",
            "user_link": "/personal_pages/user/184674",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm Jessie. I have a 3.5 year old Daughter and I'm currently 30 weeks 6 days pregnant with another little Girl. With My first daughter I went for a regular OB appointment and fount out i was 4 cm dialated with high blood pressure. The Doctor HAD given me the choice to go home and wait and see if I would go into labor naturally but not Five minutes after that he said he was sending to to the hospital to be induced, he basicly took my choice away. anyway I got to the hospital and they broke my water and gave me meds to start contractions (I was only 17 1/2 years old) so I didnt know I had Actual Choices. I was induced at 1pm and was in labor for 5 and a half hours about half way through I started yelling i wanted something to take the edge off the pain so the doc gave me a little bit of morphine and 47 minutes of pushing. Kira was born at 6:17 pm the same day. I had really bad \"gushing\" so I didnt get to hold my daughter until the Doc got Most of the clots out of me. I clotted too fast.This Time I'm really hoping on going into labor naturally and having an all natural labor and delivery as well, I just hope i will be strong enough not to take any meds.",
            "post_id": "6747741",
            "timestamp": "1300492897",
            "user_id": "user_1486435",
            "user_link": "/personal_pages/user/1486435",
            "votes": "0"
        }
    ],
    "post_id": "6673646",
    "question": "To start off the group let's go around and introduce ourselves. You do not have to be pregnant to join the group. Whether you have 10 kids or none ALL are welcome to learn more about natural birth. Preparing for birth can happen long before you get that BFP (big fat positive, as in a positive pregnancy test).Tell us your first name, how many kids you have, if you're pregnant and when you're due, hobbies, likes and dislikes and what your goals are for your birth!",
    "timestamp": "1298416949",
    "title": "Introductions",
    "user_id": "user_376739",
    "user_link": "/personal_pages/user/376739"
}