{
    "answers": [
        {
            "answer": "Congrats, how exciting it seems there are a lot of us right now due in Jan and just finding out the sex.",
            "post_id": "1186512",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "CONGRATS!!!!....",
            "post_id": "1186514",
            "timestamp": "1156222800",
            "user_id": "user_150847",
            "user_link": "/personal_pages/user/150847",
            "votes": "0"
        },
        {
            "answer": "Great news!  Congrats!",
            "post_id": "1186515",
            "timestamp": "1156222800",
            "user_id": "user_143603",
            "user_link": "/personal_pages/user/143603",
            "votes": "0"
        },
        {
            "answer": "As you all know I am having problems at work and have given notice. Well DH is off today and decided to stop in for the first time. Well here comes this loud Harley pulling in and a big muscled, tattooed, Harley guy walking in. Everyone freezes in fear and I yell out Hi Pookie!!! They are like you know this guy and I am yes that is my husband...  DH just stared them all down and asked why his wife comes home upset from this place. All the stupid upper mgmt scrambled back to their offices. Made me smile I am gonna have to go home and give him some lovin'.He sure hates to see his woman upset.",
            "post_id": "1186536",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "GO HARLEYGRLS HUSBAND!!!!! GIVE HIM PROMPS FOR ME! ;P",
            "post_id": "1186538",
            "timestamp": "1156222800",
            "user_id": "user_106633",
            "user_link": "/personal_pages/user/106633",
            "votes": "0"
        },
        {
            "answer": "That is so great!  Good for him sticking up for you like that!  BTW what kind of harley does he have?",
            "post_id": "1186539",
            "timestamp": "1156222800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "Right now he has an Ultra Classic and I had a Fat Boy...He is wanting to get a Springer to tool around town on.",
            "post_id": "1186540",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "Wait a minute, YOU had a fat boy?  that is so cool!  I would love to learn how to drive one myself.  My dad has a panhead and a custom one that he just got a couple years ago.  Its pretty cool, its got ALOT of chrome on it and boy does that baby shine when he cleans it (of course its ALWAYS clean)!!  You would swear that thing was his baby!!  LOL!!  I told him he was leaving them to me when he dies and he said that he is getting buried with them...HA HA!!  He's crazy!!  But I tell ya, to me it just isnt a motorcycle unless its a harley!!  Am I right??",
            "post_id": "1186547",
            "timestamp": "1156222800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "I love Harley's they are the best. Yep, I had my own actually I have owned 3 of my own Harley's a Sportster, Super Glide, then the Fat Boy.   I am going to get a Road King and be done after that. This current one is DH's 8th Harley.",
            "post_id": "1186552",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "That's cool!  i cant believ your DH has had 8 of them.  My dad always buys my DS Harley clothes.  My step-mom got him this really cute jacket that is either leather or the other side is like that slippery stuff that repels the rain and stuff.  Its really cute!!",
            "post_id": "1186557",
            "timestamp": "1156222800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "I am sure that at my baby shower in Oct I will get a lot of Harley outfits.Luv Babies has already bought the baby a cute outfit with a matching orange skull cap!!!  Too cute.",
            "post_id": "1186559",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "Aw, how cute.  I like the skull caps for the little ones, they are so cute.  What state are you from??",
            "post_id": "1186560",
            "timestamp": "1156222800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "I am in Illinois. Where are u???",
            "post_id": "1186561",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "I am in PA!  Although I am from Louisiana!",
            "post_id": "1186563",
            "timestamp": "1156222800",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "Southern Gal!!! What are you doing away from that beautiful state? We would love to move South. We could get more riding time in.Why don't you learn to ride??? I got my motorcycle license back in 1997.",
            "post_id": "1186567",
            "timestamp": "1156222800",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "No I called the doc around 11 pm and he sounded tired and all but he said that it was normal...",
            "post_id": "1186572",
            "timestamp": "1156222800",
            "user_id": "user_152059",
            "user_link": "/personal_pages/user/152059",
            "votes": "0"
        },
        {
            "answer": "Congratulations!!",
            "post_id": "1186577",
            "timestamp": "1156222800",
            "user_id": "user_90957",
            "user_link": "/personal_pages/user/90957",
            "votes": "0"
        },
        {
            "answer": "***update***I had a baby girl (Cali Alexis) July 20th at 12:03 pm she was 7lb 8oz 20 inches...ultrasound had showed me at 37 1/2 weeks but her lungs weren't fully developed so the docs figure she was 35 weeks when she was born but we got to come home a week after she was born would of been home sooner but i got re-admitted w/ fluid on my lungs doc said if i would of waited a few more hours i would have died so ladies if you have preeclampsia and notice that the swelling hasn't gone down in ur legs, hands and face a few days after the baby is born tell your doc to check you out again and have him listen to your lungs! the nurses just kept telling me i was getting a cold so i went down to the er! and sure enough so if you think something is wrong keep on ur doctor and nurses bout it!!!",
            "post_id": "1186580",
            "timestamp": "1156222800",
            "user_id": "user_77035",
            "user_link": "/personal_pages/user/77035",
            "votes": "0"
        },
        {
            "answer": "Congrats! that great. I get to find out on Sept 8th.",
            "post_id": "1186583",
            "timestamp": "1156222800",
            "user_id": "user_144395",
            "user_link": "/personal_pages/user/144395",
            "votes": "0"
        },
        {
            "answer": "CONGRATS!!!  It is cool that there are so many of us due around the same time!!!",
            "post_id": "1186591",
            "timestamp": "1156222800",
            "user_id": "user_140785",
            "user_link": "/personal_pages/user/140785",
            "votes": "0"
        },
        {
            "answer": "congratulations!",
            "post_id": "1186599",
            "timestamp": "1156222800",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "Congratulations!I like Blane CarsonEthan NathanialZane joshuaBlake ?Just a few to think about!  I can't wait to find out what i'm having! Good luck on baby name hunting!!!! :)",
            "post_id": "1186601",
            "timestamp": "1156222800",
            "user_id": "user_106633",
            "user_link": "/personal_pages/user/106633",
            "votes": "0"
        },
        {
            "answer": "I would think the watery discharge could be your bag of waters, the baby may be acting as a cork so it isn't happening alot.  Didn't they want to check you for that?",
            "post_id": "1186609",
            "timestamp": "1156222800",
            "user_id": "user_127124",
            "user_link": "/personal_pages/user/127124",
            "votes": "0"
        },
        {
            "answer": "Congrats on you baby boy!!!!  It is so cool to see your little one on u/s,  they grow so fast!  Good luck to you.",
            "post_id": "1186647",
            "timestamp": "1156222800",
            "user_id": "user_122649",
            "user_link": "/personal_pages/user/122649",
            "votes": "0"
        },
        {
            "answer": "girliegrl- Congrats on the good news!!  That will be so exciting for you to share on your wedding day!! :)harley-  So glad you got some revenge for all the mean things your co-workers have done. :)  I bet that made your day!!  Maybe they'll think twice before treating you like that again!",
            "post_id": "1186638",
            "timestamp": "1156222800",
            "user_id": "user_148735",
            "user_link": "/personal_pages/user/148735",
            "votes": "0"
        },
        {
            "answer": "i wish i could have seen the look on their faces when pookie went in their telling them a thing or two! HOORAY! so you gave your notice im happy to hear. are you having a boy ? like you said i cant keep up with everyone.  dh pissed me off tonight so no luvin for him!! lol. im oing and i am a moody bioooootch. i think im long overdue for a girls trip. that is the problem i am cooped up with 2 males in this house and they gang up on me lol. ya a weekend of relaxing, tequilla, and no men!",
            "post_id": "1186642",
            "timestamp": "1156222800",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "Hi all just an update... I am 38 weeks as of Sunday, and I think I may be in prelabor now. I went to doc on Friday and had an exam I was 1 cm 80% effaced and -1 station. I know that it could still be a while... But since then I have lost my plug... I have had really strong pressure, and really strong but not patterned contractions... A Watery discharge every so often, and her movement as slowed a bit. My hubby checked me lastnight and said that he felt her head about 1 1/2 inches in... He said that it just felt like a really thin tissue between her head and his fingers. He could not find the whole in cervix to try and check dilation so I do not know on that. I called doc lastnight about the discharge and he said it was completely normal and that I will probably go in the next week. What do you all think?",
            "post_id": "1186608",
            "timestamp": "1156222800",
            "user_id": "user_152059",
            "user_link": "/personal_pages/user/152059",
            "votes": "0"
        },
        {
            "answer": "Congratulations on your baby boy.  I was unable to post a new question and just wanted to ask.  I'm eight weeks pregnant with my first child and already appear to be showing.  Is this normal?  A couple of my friends are further along and still don't even look pregnant.  Thanks.",
            "post_id": "1186646",
            "timestamp": "1156222800",
            "user_id": "user_151216",
            "user_link": "/personal_pages/user/151216",
            "votes": "0"
        },
        {
            "answer": "Congrats on the little boy, they are so sweet!For KandDCowan, I am pregnant with my second baby, so it may be different I guesws, but I am 7 weeks 5 days and look like I'm showing already too, I think a lot of it at this stage is bloating though, at least that's what it feels like to me.  I didn't have this with my first baby though, but each pregnancy is different and everyone shows differently, so don't be surprised...congrats on your baby!",
            "post_id": "1186627",
            "timestamp": "1156222800",
            "user_id": "user_141622",
            "user_link": "/personal_pages/user/141622",
            "votes": "0"
        },
        {
            "answer": "oh my how exciting!!! hopefully he/she wont turn their little butt away and hide the goods! which do you think ? when i was pg with my son i wanted meat meat meat and sandwiches. my sis pg with a girl wanted fruit and asparagus lol. what cravings are you having>? im going to guess!",
            "post_id": "1186664",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "Well, all of my dreams have been of a baby girl. But DH are kind of hoping for a boy just because there are none in my family. There has only been girls born in the past 2 generations. DH and I want to break the \"girl-curse\". :) Of course if it is a girl she will be just as loved.I crave fruit!!!!",
            "post_id": "1186668",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "Thats what happen to me.  I had super imposed preeclampsia with HEELP Syndrome.  My protein was at +19 and thats not a typo it was confirmed by three 24 hour urine 2 which where done in the hospital.  I was hospitalized and after 3 days I keep telling the nurses that I couldn't breath.  Well they keep saying you are fine.  One nurse keep telling me that nothing was wrong with me and she didn't understand why I was getting my self all worked up.  It got to the point where I just couldn't lie down (I now know this was the sign of Heart failure).  I litterally felt like I was drowning just without being in water.  Finally they decided to take the baby (I was 32 weeks)  and I woke up 5 days later on a ventulator.  I had devoloped pulmonary edema, my kidneys where going into failure, and I had developed Congestive Heart Failure.  The thing that I really regret was about 2 months before all this I had questions about the Medical Assistance at my Dr office.  I just knew she wasn't taking my BP right.  She always got 130/70.  So I decided that at my next visit I would say something to the DR.  I had brought my BP machine in with me.  My BP was running around 170/100 at home.  So I took my BP that day just before going to the Office.  I had mention to my DR that my Bp was higher at home and I try to demonstrate with my BP well It just wouldn't work.  I thought that she would take my BP well she didn't and she even seem a little put out so I didn't push it.  Boy I wish I pushed it.  Finally at my last visit before being hospitalized my DR wasn't availabe so the NP saw me and she ask why my shoes weren't tied.  I said my feet are to swollen.  She just stood up took my BP and it was 200/110 where as just 1/2 hour before it was only 130/70 taken by the medical assistance.",
            "post_id": "1186721",
            "timestamp": "1156309200",
            "user_id": "user_75143",
            "user_link": "/personal_pages/user/75143",
            "votes": "0"
        },
        {
            "answer": "Yea I am a southern gal!  I always will be too!  I didnt really have a choice in the matter I was only 14 when we moved here.  I loved with my dad and he said we're going and that was that.  Unfortunately my mom still lives down there and now my little sis lives there too!  :-(   Believe me I wish I was still in the south where its HOT and NO SNOW!  That is the only part about PA that I dont like is the snow and cold cold weather!!Anyway - that would be so cool to learn to ride.  Someday maybe I will give it a shot.",
            "post_id": "1186729",
            "timestamp": "1156309200",
            "user_id": "user_118430",
            "user_link": "/personal_pages/user/118430",
            "votes": "0"
        },
        {
            "answer": "Dana, I actually find out the sex of the baby tomorrow!!!!",
            "post_id": "1186732",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "Where the heck are you??? I am waiting for your baby predicition. ;)",
            "post_id": "1186823",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "HAHA i read it like you were yelling! sorry i got sidetracked with laundry and cereal and regis. are you carrying low, high? you know its funny there is an old wives tale that if you are pg with a boy and you hold a baby boy he will cry. when i was pg my girlfriend had just had her baby boy and he couldnt stand me! just cried and cried and i had a boy- whats funny is after he was born her son loved me! ya go grab a baby boy out somewhere and see if he cries. lol.",
            "post_id": "1186829",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "To funny, I have not been around any baby boylately. Little girls love me though.Anything good on Regis today? I know u are self-empl what is it u do??I am carrying very low.",
            "post_id": "1186831",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "jimmy kimble was on he is a funny motha! i was a registered dental asst. for 16 years. i couldnt take it anymore. the other girls were lazy and i had to do my job plus theirs (i couldnt let the patients suffer) and a boss that is crazy so i quit! i went to school and now i am a certified massage therapist. for now anyway lol im thinking of going back to school again but who knows. much more fun in my 30's than in my 20's. i cant seem to guess. lol. of course its just going by the old tales id say a boy lol. the carrying low and all. but it is just a guess, i only have a 50% chance right? lol. have you done any of the chinese gender calendars?",
            "post_id": "1186847",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "I have done 3 and all say boy.  I am counting down the hours until we get to \"meet\" our boy or girl.",
            "post_id": "1186850",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "either way you will love your baby so much! my ex used to say he wanted to squeeze him till he disappeared inside him. i love having a boy, get to get dirty, and listen to him talk about farts and butts lol. of course my niece is fun to paint nails and braid her hair. my next one would be fun to have a girl just so i have one of each but little boys.....",
            "post_id": "1186855",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "Yes, I agree I am going to love the lil' bugger so much regardless of the sex.Not sure what is worse a little boy that is going to act like his nutty Daddy or a little girl that acts like her crazy Mommy.",
            "post_id": "1186862",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "well not to offend anyone but girls (i know i am one lol) are so emotional from very early on! i dont know if i could handle the whining and crying. i liked your dh idea of the dog chewing the cord haha. my sis had her 2 babies vaginally and she said with her second she had  them bring a mirror and she said being able to see the progress made her push harder. just a thought. HOWEVER lol when they brought the mirror she looked and said oh god its not supposed to look like that! haha you swell and look oh so pretty.",
            "post_id": "1186885",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "i ended up having a c section after pushing for hours and using the vacuum. i have a couple cool pics of them pulling his head and then p;ulling all of him out! i begged my ex to take pics of the whole surg i wanted to see my guts! lol but he said no it was too gross. i begged to watch but they dont let you. my gf had her first her sil was head admin at a hosp here. so when she gave birth she got the vip room. it was a damn suite! the hubby had beer in the fridge with a couch and tv and vcr(pre dvd lol). it was 2 rooms. have you visited your hospitol yet to see what its like? maybe you can peek in on the nursery! love the little ***** that are fresh and wrinkled",
            "post_id": "1186903",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "you know i typed ***** and it blocked it. thats funny. you young 31 miss thang! well off to get the boy, early release day. hope no accidents this time. every day i go out and there are accidents galore everywhere. and this city i live in is going nutts!",
            "post_id": "1186920",
            "timestamp": "1156309200",
            "user_id": "user_15575",
            "user_link": "/personal_pages/user/15575",
            "votes": "0"
        },
        {
            "answer": "Good talking w/ you again. Fetch the young un'. I go for my baby class on Oct 21 and hope we get a tour. DH would love to bring a 6-pack of beer with him but I put my foot down.Wow, sounds like u had a pretty intense delivery experience.31!!! I feel so damn old. :)",
            "post_id": "1186926",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        },
        {
            "answer": "Ewwww, gross....  No mirrors for me. :)",
            "post_id": "1186970",
            "timestamp": "1156309200",
            "user_id": "user_136500",
            "user_link": "/personal_pages/user/136500",
            "votes": "0"
        }
    ],
    "post_id": "1063919",
    "question": "good afternoon ladies! sorry to use up questions space for this, but i am soooo happy to finally know what the little one is! feel free to use this as an open forum after i am done bragging! i had my level II ultrasound today and the tech knew right away it was a little boy! everything is soooo good and right on target. they confirmed my due date as january 10th and my fiance and i couldn't be any happier. we are getting marries Sept. 2nd and can't wait to share the good news with everyone there! so, what's everyone's thoughts on boys names? i haven't even begun to think about it yet!have a great day everyone!",
    "timestamp": "1156222800",
    "title": "Its a boy!/Open Forum",
    "user_id": "user_146191",
    "user_link": "/personal_pages/user/146191"
}