{
    "answers": [
        {
            "answer": "Hello i will be a part of the journey. How exciting to know someone else will be going through this at the same time! Yay!",
            "post_id": "7083666",
            "timestamp": "1311215189",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "I am with you both. am 33. first IVF cancelled in may 2011 due to poor response.after a cancelled cycle; my AF started yesterday after 50 days. and i start my BCP from tomorrow and egg retrieval planned in August. hope i respond better this time. this is a flare protocol this time i guess. good luck to both of you.will keep you posted.",
            "post_id": "7084908",
            "timestamp": "1311260915",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Wow! I am wishing you luck. If my u/s goes well the beginning of aug. Then i will start the meds by the end of aug. Im so excited,but nervous too. My first ivf/icsi. Praying all goes well!",
            "post_id": "7085258",
            "timestamp": "1311268426",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "I will be doing a FET, and received my transfer date today!!  Aug 30th!  So, I'm in girls!! : )I didn't want to join a group until I got my actual transfer date....We will be using donor embryos : )   Transferring 2 5 day blasts!Here we go Girls!I hope each and everyone of us receives a BFP!!!~*~*~*~*~*  Baby dust!!!! ~*~*~*~*~*~*~",
            "post_id": "7085489",
            "timestamp": "1311273920",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Omg! Praying all goes well! Keep me posted!Kim :0)",
            "post_id": "7087589",
            "timestamp": "1311338033",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Hey everyone,I start meds on August 5 and if all goes well, transfer around Aug. 20.  I am doing ivf with icsi along with assisted hatching.Sending baby dust to all,Risa",
            "post_id": "7091065",
            "timestamp": "1311449511",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Welcome Risa :). Our dates will be close together :).    I am excited for you!  Sending you tons of baby dust!!!",
            "post_id": "7091889",
            "timestamp": "1311477177",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi Risa, I am wishing you lottsa luck! I start my meds around the end of Aug. it will be interesting. :)",
            "post_id": "7093015",
            "timestamp": "1311528651",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Hi ladies,I will be starting ivf late august and i am so excited to start again.  I wish all of you ladies luck and I can not wait to hear all the updates.",
            "post_id": "7095045",
            "timestamp": "1311600823",
            "user_id": "user_258734",
            "user_link": "/personal_pages/user/258734",
            "votes": "0"
        },
        {
            "answer": "I am on BCP right now. will go for BW and mock transfer this friday. and will start lupron this 11th August. this micro flare low dose lupron protocol sounds strange and unusual to me. my first cancelled one was longer on lupron.",
            "post_id": "7096284",
            "timestamp": "1311629778",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "I am doing a fet in sept!!! Was going to start a forum to see if anyone else was in the same boat! So glad to see that others are!I am on day 5 of a long protocol so I think the transfer with be a couple weeks into sept.Can't wait to begin this journey!Also I did a fresh ivf cycle in fall of 08 and had twin girls in april 09.",
            "post_id": "7096494",
            "timestamp": "1311634130",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Sounds like we have similar cycles. I am going for a mock transfer tomorrow and a sonohystogram. I will start lupron shots on aug 10.What is a BW?",
            "post_id": "7096957",
            "timestamp": "1311645278",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Hi there. I will be calling this morning to find out when they will do my Mock transfer as I just started my period yesterday evening. This is so nice to know that there is someone going through IVF as me!  yay!",
            "post_id": "7097813",
            "timestamp": "1311680222",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "My transfer is scheduled for 08/04/2011.  We are using a frozen blastocyst.  First attempt I miscarried in April.  Fingers crossed this time.  My acupuncturist is also coming with me the day of the transfer.  I will have treatment immediately before and after the transfer.  It's supposed to help with implantation.  I have been using acupuncture twice a week for almost four months.  Hopefully it pays off.  Success rates are 60% higher for those going through IVF with acupuncture rather than doing it solo.Lots of baby dust for all!",
            "post_id": "7098595",
            "timestamp": "1311700519",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "wow...i did not know that about acupuncture... That's really interesting.I had my mock transfer this morning as well as a sonohystogram. Everything looked good.  Pretty crampy afterwards, but feeling normal now. just waiting for aug 10 so I can start my lupron shots.I followed a forum when I was going thru ivf in 08 and throughout my pregnancy...it was so great to be able to keep in touch with all the girls and see how everyone was doing.  There were 5 of us who went thru ivf around the same time and all of us got pregnant and had babies.  I think there were 8 babies total!I am hoping this will be the same sort of things with you girls. I am ready and excited to get this underway!",
            "post_id": "7098714",
            "timestamp": "1311703473",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I hope that is the case for all of us.  It is such a long journey!Acupuncture seems to be worth it.  There is a lot of research with success.",
            "post_id": "7098836",
            "timestamp": "1311706403",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Wow! That is soon. :) I have my Mock on next tues. early am and the sonohystogram. then the 15th of Aug. I will have a mid luteal and if all looks good there then I order my meds that day. I am sure praying and hoping we all have Positive results!What a great support!",
            "post_id": "7099024",
            "timestamp": "1311711000",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "do any of u already have kids?Nichole- how far along were u when u miscarried? Sorry...if I am asking too much..",
            "post_id": "7099467",
            "timestamp": "1311722387",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I hope to be doing either an FET (i have 4 frozen from a previous fresh cycle) or doing another fresh cycle at the end of August. I will know for sure the week of August 8.",
            "post_id": "7099701",
            "timestamp": "1311728465",
            "user_id": "user_1129232",
            "user_link": "/personal_pages/user/1129232",
            "votes": "0"
        },
        {
            "answer": "I am doing acupuncture too and you are correct, before and after does have an increased rate.  I go once a week, but will increase for the 10 days I am on meds.  This is my first IVF. I am also doing ICSI.Sending baby dust to all,Risa",
            "post_id": "7100293",
            "timestamp": "1311744677",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Lots of luck to you.  Hopefully the acupuncture pays off for the both of us.",
            "post_id": "7100730",
            "timestamp": "1311768618",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "I had my baseline checked yesterday, which was day 3 because I'm taking DHEA pills.  My fsh came back 17.  In June it was an 11.  My fsh has never gone down, so I'm pretty sure next month it will be the same or higher.  So, I'm a little depressed and I don't know if it's worth spending a lot of money to do another cycle.  So, I might be out next month, but I wish all of you luck.",
            "post_id": "7101383",
            "timestamp": "1311783625",
            "user_id": "user_258734",
            "user_link": "/personal_pages/user/258734",
            "votes": "0"
        },
        {
            "answer": "Will it just depend on if they thaw nicely?We have 8 frozen and will be using one to do FET in sept.",
            "post_id": "7101604",
            "timestamp": "1311787939",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Hope everyone is doing ok. Am still on BCP. received meds today. lupron to be started from 11th august and stims from 13th august. this time too am using gonal F pens. fat pens :(. taking lots of fruits; protien also helps i guess. should quit coffee soon. and should switch to green tea. mock transfer on friday also blood work for complete blood picture.",
            "post_id": "7101832",
            "timestamp": "1311796989",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "how did you mock transfer go? was it easy like hysteroscopy? did you take ibuprofen? nurse wanted me to drink lots of water and also told to eat my breakfast before i go.",
            "post_id": "7101835",
            "timestamp": "1311797037",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Mine is ICSI IVF too. sperm issues observed. good luck to you. spermies have been waiting in  the lab from april and my last cycle was cancelled. so by september if i dont use them i have to pay again for sperm freeze :(",
            "post_id": "7101837",
            "timestamp": "1311797116",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Good luck for your mock. hope i respond well this time. i have been having so much stress and pressure about the entire cycle :(i met with a car crash last evening; thank god nobody is hurt though.",
            "post_id": "7101846",
            "timestamp": "1311797229",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Kris!  Yippeee!!!! We're cycling together! : ) Can you believe it!?!?!  It's a great sign I think!I am still on BCP and hubby and I are taking our anti-biotics now.  Meds are getting delivered tomorrow, and I start lupron on Saturday.. I know it will all start to seem more real then.  I am really starting to get nervous! ugh!  I started acupunture last week again, and will start going more frequently as time gets closer..Please God, be with each of us on this journey, and please bless each and every one of us with a positive pregnancy test, and a bouncing baby (or 2) at the end.  Amen!!It's nice to see that there are several people to cycle with! yay!!!!!",
            "post_id": "7102136",
            "timestamp": "1311803698",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi! the mock and the sono went well. They said that everything (my uterus and tubes) look great. It was pretty uncomfortable and I feel really crampy afterwards.  They had given me an antibiotic pill (Zithromax) to take the morning of the tests. I didn't take any ibprofren...but I'm sure you could to help with the cramping.How are your meds going? do you have a transfer date yet? will this be a fresh cycle so you will have a retrievel date too?",
            "post_id": "7106639",
            "timestamp": "1311947055",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I dont' know much about the fsh....what is a good number and what does it tell you?Try not to get down...all of this process is so complicated and emotions always do run high.Just know that we are all here for support when you need it!Hang  in there girl!",
            "post_id": "7106644",
            "timestamp": "1311947284",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I had my ivf transfer on 7/18 so I believe today is considered day 11 post transfer?  I took a hpt yesterday and it showed negative.  It was a 99 cent store brand and unsure if it might not be as accurate as other more expensive brands?  Today I used a 1st response early results test and it showed a very faint 2nd line.  This gives me hope.  I'm scheduled to do my blood test on Monday 8/1.",
            "post_id": "7106748",
            "timestamp": "1311950186",
            "user_id": "user_1750956",
            "user_link": "/personal_pages/user/1750956",
            "votes": "0"
        },
        {
            "answer": "I am also starting IVF cycle in August.  Right now I am on BCP will take my last pill on Tuesday and if everything goes well I will start with Lupron on 8/5.  My meds get delivered on Tuesday.  I am starting to get nervous and cannot believe it is here.Good luck to very one lets all pray we all get our BFP!",
            "post_id": "7106945",
            "timestamp": "1311954550",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "Great, I am a little ahead for you, I stop bcp on Sunday and Lupron August 3.  Here we go!Risa",
            "post_id": "7107063",
            "timestamp": "1311957744",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "I am wishing Everyone well!! :)",
            "post_id": "7107073",
            "timestamp": "1311958081",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Been off the site for a while.  Don't really see any of the familar names from two years ago.  Anyway had my FET done yesterday at 11:00am.  I am on aspirin 81 mg, Heparin two shots a day, and progesterone once a nite.  We have a blood clotting disorder which we researched and found out all on our own.  Asked the doctor to run the test and he did against his better judgement but what do you know we were right!  All these years of heartache and miscarriages to find out aspirin and heparin will do the trick.  Anyway we put three embryos in.  One was a grade 1 the others were grade 2!  Feel fine today, just on bedrest and taking it real easy!  Had a miscarriage in 2006, failed IVF/FET in 2007, many rounds of clomid and femara, many IUIs.  Keeping my fingers crossed! And in deep prayer!  Many Blessings to all!",
            "post_id": "7107180",
            "timestamp": "1311960614",
            "user_id": "user_658287",
            "user_link": "/personal_pages/user/658287",
            "votes": "0"
        },
        {
            "answer": "Thinkingpos- I'm thinking it might be a little early fr a hpt..that is why the 1st one showed neg. Also my siste is pg right now and had a very faint 2nd line too when she teste an every day it got darker and darker....so u probably will get a BFP!!! Yay for u! Will be praying for u!Pinktootie- that is crazy that u researched all of that on your own. Do u have any other children?When will your beta test be?Take it easy on bed rest today. Will be praying for your BFP too!",
            "post_id": "7107208",
            "timestamp": "1311961581",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "By the way...kimmiecle and I have been talking and we actually go to the same dr's office! Isn't that crazy! ....small world!",
            "post_id": "7107213",
            "timestamp": "1311961750",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I'm getting ready to start the process again with FET but this time I am not using birthcontrol pills or Lupon I will be using only Estradiol valerate and Progrestrone shots only starting day 3 of my period. And my transfer will be 3 weeks after I start shots. Has anyone else done it this fast. In the past I've used birth control pills and Lupon.I will be taking Lovenox starting the day of transfer which is a blood thinner shot.Looks like if all goes as planned my transfer will be around Aug 30th.",
            "post_id": "7107319",
            "timestamp": "1311964998",
            "user_id": "user_1725396",
            "user_link": "/personal_pages/user/1725396",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for the feedback and positive vibes.  I will remain hopeful.I'm new to this forum as a posting member but have been reading for a while.  All the experiences and feedback have been very helpful.As a point of reference for folks, I am 43yrs old and after 3 failed iui's we turned to IVF. I had to halt my first cycle in June because of poor response to my initial protocal (bcp, lupron 5U am's, 2 powders menopur pm, 300 gonal pms) didn't work well for me.  I only produced 2 follicles.  After they changed my protocol to (20U micro lupron am/pm, 4powders menopur pm, follistim 450 pm - which replaced gonal, Saizen .4 pm) I responded much better and they were able to retrieve 8 eggs.I wish everyone much luck with your individual ivf/iui experiences.",
            "post_id": "7107406",
            "timestamp": "1311967794",
            "user_id": "user_1750956",
            "user_link": "/personal_pages/user/1750956",
            "votes": "0"
        },
        {
            "answer": "Sending you baby dust! The first time I did injectables with iui, only had 2 follies.  Tried a few months later with more meds and twice a day, and got 5 follies, but iui didn't work. Now I am hoping since I have been on bcp, that I will do well with ivf.  Sounds like you are on your way to a bfp, good luck!!!Risa",
            "post_id": "7108311",
            "timestamp": "1311996488",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Hi there,I just read your story. I pray that all goes well and you have a BFP!!! I have met so many lovely ladies on here and it sure does help to have the support from others that are going through this Journey with you. Sarbear11 and I have been chatting back and forth and as she had mentioned we found out we go to the same fertility office. :) So Good Luck Lady!We are all here for one another.Kim",
            "post_id": "7108796",
            "timestamp": "1312022426",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Hey girls!!!  Your list is growing! : )  Yay!  Tons and tons of support! : )I started lupron this morning, and will stay on birthcontrol until next Saturday.Kim, Its awesome you and Sarbear11 go to the same clinic!  Maybe you can meet sometime, that would be the bet support ever!  : )Hopeful703-  I have done the natural cyce FET before, It's alot less meds :)  Anyway, I was successful, unfortunately, I m/c'd.Thinkingpositive- Sounds like a BFP to me!!  What a great way to start off this thread!   Please test again, and let us know! : )Risa- Here's to hoping this round is very successful, and that you have some snowbabies at the end!  We are going to be close in our transfer dates!!  That is awesome!Pinktootie- I have been aroud about 2 years, glad your on board again!  I am so glad you did your own research!  I am a true believer that we have to be our own advocates, and cannot leave our fate in the hands of our doctors.  We are not their only patients, and we know our bodies better then anyone.  I also m/c'd 2 years ago.  I have had 3 uterine corrective surgeries.Please keep us updated on your symptoms!  When is your Beta???MyYuynin-  Good Luck!  Your on your way!  We are going to be close! : )Kris71-  I am praying your bloodwork comes back normal, and that you are able and ready to move forward!  I know it will! This is our time girl!  It just has to be! :)rghkah38- When do you start?  Do you have a timeline yet?Hopeful- Where are you?  We miss you!  How is the thyroid doing?babyhope40527 -How is the bcp going?  I've been on mine for 2wks today.  1 more week.... then hopefully an AF!Girls, this is far from my first time at this, and boy, I am getting nervous! It's starting to kick in!!!!Question-  what kind of progesterone is everyone on?  If you are on the progesterone in oil, who is going to administer the shots?  I am really freaking out about this dang shots! ugh!",
            "post_id": "7109054",
            "timestamp": "1312034455",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "During my 2ww, I'm taking the progesterone (Endometrim) vaginal suppositories am/pm.  Each has 100mg so 200mg a day.  Aside from that I'm doing the estrogen (Estradiol Valerate) every 3rd day via a shot to the hip.  I usually have my sister do it for me since my husband is so squeamish.  I've been lucky in that she's been available on most of my shot days.  If I am a BFP I beleive you do this through week 10 or 12.",
            "post_id": "7109184",
            "timestamp": "1312038093",
            "user_id": "user_1750956",
            "user_link": "/personal_pages/user/1750956",
            "votes": "0"
        },
        {
            "answer": "Hi ladies,I joined this site when in April when I was going through my first IVF cycle.  Sorry, I don't know all of the acronyms, so I just type it all out.I am 42, got re-married last April.My first round, in April, I was on Menopur, Brevelle....many meds, to use my own eggs and my husbands sperm.  They retrieved 12 eggs, did the PGD and gender selection for a girl, there were only 2 girls out of 4 decent eggs, but not good quality and of the 2 girls, there was only 1 that was sufficient to transfer.  We used the 1.  Got a BFN.  25k and out of my mind thinking that was my one and only try.I decided to tap into my 401k and go 1 round with an egg donor.  I am a bit miffed my Doc didn't tell me my odds of using my own eggs compared to using a young donor, but it is over, money is spent, gone, never coming back.So we started this new round in early July once we picked our egg donor and I share the eggs with another lady.  So we split the eggs that are retrieved.We go in tomorrow for my Husbands TESA (sperm aspiration) and I believe the donor is going in sometime tomorrow for the egg retrieval, then we do PGD, 5 day blast and Friday Aug 5th, I go in for transfer.  So I will know Monday how many eggs were fertilized, just won't know how many girls until the day I go in for the transfer.I am on Estrace 3x a day and a Vivelle patch every other day.  Start progesterone oil shotstomorrow.  I have gained 5 lbs with these meds, is anyone else on these.I am nervous.  Doc will only transfer 2 since the donor is 23 years old.  So this is my last chance.Best wishes to you all.",
            "post_id": "7109713",
            "timestamp": "1312052996",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Congrats on your donor cycle! : )  I wish you much success.  We seem to learn alot along the fertility journey, it's definately the road of hard knocks!  It's bumpy and very curvy, but hopefully, in the end, we will all be successful!!!!I have 1 question.... what happens if they are all boys??? Im sure that won't happen, but I just wondering what would happen if it did???Twin girls would be awesome!  Please keep us updated on your journey! : )  Here's to a boatload of girls!!!!",
            "post_id": "7109924",
            "timestamp": "1312061103",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "hi everyone, I'm new to this forum ....Well, I'm going for my 9th IUI next week and if that fails, I will go to IVF.Has anyone been thru IVF before? How does it feel and what will I expect.I'm kind of scared........",
            "post_id": "7110056",
            "timestamp": "1312065650",
            "user_id": "user_1736172",
            "user_link": "/personal_pages/user/1736172",
            "votes": "0"
        },
        {
            "answer": "My day 1 will be around the 24th of August.  If my fsh comes back high again I don't know what we will do for this cycle.  Probably it will get cancelled.  If it comes back normal then I will be doing a fresh cycle.  Just not too sure if I am going to do Braville with Repronex or follistim with repronex.  We will see.I had to do the oil shots for all my cycles and my husband usually gives it to me.",
            "post_id": "7110234",
            "timestamp": "1312072659",
            "user_id": "user_258734",
            "user_link": "/personal_pages/user/258734",
            "votes": "0"
        },
        {
            "answer": "My hubby has refused to give me the shot.  It's ironic, I give him a testosterone shot every 2wks with that size needle, he said he just can't do it....I really hope your levels are low this time.  The 24th will be here before you know it!",
            "post_id": "7111322",
            "timestamp": "1312123481",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Welcome!!!!!  9 IUI's?  You are a trooper!  I hope this is the one for you!!!  How wondeful would that be?!?!  I will be thinking about you and hoping for a BFP for you!!!!!!!",
            "post_id": "7111337",
            "timestamp": "1312123626",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Wow! How many people are we up to on this forum now? I tried to count and I think I was t 8..and now there a few more! How exciting! I love the support!My lupron shots will start next week...I wish it was sooner! I'm getting really excited!Ladydi- just curious...was it the gender selection that made your cycle so pricey?",
            "post_id": "7111609",
            "timestamp": "1312133030",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Hi everyone.  I too will be on the IVF/FET journey with you.  This will be our third transfer.  1st IVF in Feb, 2nd in June, both unsuccessful.  This time we will be doing a FET on 8/15.  Transferring 1 blast.  This one has a better grading than our last (this one AA, last one AB), but our RE said our chances are lower since it is a frozen cycle.  I'm a bit bummed about that.",
            "post_id": "7112577",
            "timestamp": "1312164289",
            "user_id": "user_1358758",
            "user_link": "/personal_pages/user/1358758",
            "votes": "0"
        },
        {
            "answer": "We went in this morning at 9am and it was the strangest thing.  The donor was in there and the other couple that is sharing the eggs with me.  We didn't see eachother, but knew we were all there.  I waited in the waiting room while my husband was have the aspiration done and I ended up talking to the donors best friend.  She told me what a wonderful person the donor is and what a great family she has.....So the question, if they are all boys?????? Well hopefully odds will allow some girls, BUT if they are all boys, we will go for having a beautiful baby boy.They are being fertilized right this moment as I type.  Tomorrow I will get the call of how many eggs were mine and then how many of them fertilized.  They will start the PGD and gender selection testing, which they send off to NY.  Then I will get scheduled for Fri. Aug 5th to go in for the transfer and they will first tell us how the quality of the eggs were and how many were of each sex.  Then we make the decision and I get taken into the room for the transfer.Doc said there were plenty of eggs and the sperm count was extremely high.  The scary part is the transfer and the embryo attaching.  I know sooooooooo many on here have been through this and know what I mean.  I don't want to get my hopes up, but I also do not want to down play it and take the excitement away.  Just don't know how to feel right now.I am gaining weight on all of the meds that I am so distraught over that and I am not even pregnant.    Stink!!!!Sarbear, PGD is 5k.  My meds were 5k and 15k for all of the procedures/sperm aspiration, dr. visits, ultrasounds.....were 25k.  This round they gave me for 15k, so geeeeeeee what a break eh?  My meds were much less using a donor so that helped.Will let you know the breakdown when I get the results tomorrow.  Very nervous, what if very few fertilized?  I am so scared to have spent all of that for nothing as an end result.",
            "post_id": "7112581",
            "timestamp": "1312164375",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Don't be to worried!  There are a lot of ladies that have been succesful with fets! Schroderheather has a son from frozen, jessting is preggo with twin boys, beanandsprout is preggo with twins, and I know there are others I am forgetting... Don't let that bother you, ok?  I will also be doing a fet, so we will both have faith, alright?   I actually got pregnant from a fet, but I m/c'd.",
            "post_id": "7112648",
            "timestamp": "1312166107",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "How exciting!  I hope you end up with lots of healthy embryos :).   It's cool that you got to speak to the donors bf.  That was awesome!  I understand 100% you thoughts on the implantation that part is out of our hands. I did a donor route with a known donor 2hers ago. We were successful on the first transfer, but I m/c'd.  We then found out that the re didn't retrieve the eggs as soon as he should have, then he froze them on day2, and then we pretty much had poor quality embryos that didn't work....long story.  We are now using donor embryos that someone on this site donated to us.  We have 10 very high quality embryos, and are very hopeful that they will be successful for us.   I'm sure you'll have some girls in there! Then you can freeze the boys for use later :). Let us know tomorrow what happens ok?? I will be watching for your update!",
            "post_id": "7112673",
            "timestamp": "1312166711",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "how much does IUI and IVF cost in your states? just wondering. and also for the meds",
            "post_id": "7113161",
            "timestamp": "1312183065",
            "user_id": "user_1736172",
            "user_link": "/personal_pages/user/1736172",
            "votes": "0"
        },
        {
            "answer": "I take cronine (progesterone) it's a cream that you insert, but you have to walk around for it to work ...",
            "post_id": "7113164",
            "timestamp": "1312183268",
            "user_id": "user_1736172",
            "user_link": "/personal_pages/user/1736172",
            "votes": "0"
        },
        {
            "answer": "That is so awesome that someone donated their embryos.  I am so confused about that part.  I searched online for embryos and all I could find out and all of the places I called, was that you had to adopt them.  It would have been a lot less for me if I could have figured that out or had that option.I wonder if I could donate mine if everything goes well and I don't need them?  Only problem is I have donor eggs, so would I have to get permission from the donor?This whole thing is confusing and a lot of pieces to the puzzle.When will you do the transfer?  Do you currently have children?  Your one round really sounds like a mess and the Dr. didn't do the right things, so sorry for that.  It is hard enough what we go through, but to have that happen and out of your hands is wrong.  I hope he did something for you or gave you your money back.",
            "post_id": "7113465",
            "timestamp": "1312200775",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Hey ladies,I was told something yesterday that I feel I have to share.  I know we all look for reasons why things didn't work out or go our way and what could we have done different or have added........While in the recovery room yesterday, my husband asks the nurse when we could have sex.  I hit him and said \"honey, why in the world would you ask her that\".  He said \"well I think it's a great question\".  Anyway the nurse said 2 weeks.  He was like are you kidding me and I was like, there are more things on my mind than worried about when I can have sex.SOOOOO, she explained that research has been done, and it is best that the uterus does not contract a week or a couple of weeks before transfer.  She said that it helps to have a calm uterus and free of tightening......which helps the embryo attach.  I said that I was willing to do anything I heard to help the embryo attach better.  So, there you have it ladies, tell those men to leave you alone while you are in the most important time of this whole thing.JUST a bit of info.",
            "post_id": "7113478",
            "timestamp": "1312201190",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Well as you will tell reading here, costs vary a lot.I am in A2 Michigan and I paid my clinic 20k for my first IVF round using my own eggs and sperm aspiration for my husband.  Then the meds were about 5k.  There is a place to get your meds overseas that costs about half.  It is IVFMEDS.COM and I got my first round from them and then the 2nd time I only needed the Depot Lupron shot and got it from them too.  The depot was $900 here, but $400 from them.  You could check that out.My second round was using a donor for eggs, so that round I am paying 15k plus meds.  So this will be it for me, I am completely tapped financially.Hope that helps.",
            "post_id": "7113504",
            "timestamp": "1312201912",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "There are alot of clinics that have donor embryo programs. You just have to call clinics and see if they do.  They are much cheaper then \"adopting\" embryos.  When someone \"donates\" their embryos, there is much less paper work,and alot less legal stuff.    Donor embryos are definately much much,much cheaper! (it has cost us under $3,000 for legal fees and transfering them to OH, and storage at the clinic here).Once a female donates eggs, they have relequished any rights to them, so you do not need anything from the donor... they do have to have blood work done before, and after, but I am almost positive that is FDA standards anyway.  You could ask your clinic about that.  I can tell you from one very grateful person... donating your embryos is a wonderful wonderful thing!!!!My hubby and I do not have children.  We have been trying for about 8 years now, but only 2 yrs w/ RE's.  We were \"older\" when we got married, and are going to be anchient by the time they arrive! haha! : )Our embryos were in TX, and we had them transported to OH.No, our RE did nothing to compensate us... he just \"wished me luck\" as I hung up the phone with him the last time, when he refused to thaw our embryos and see if they could get to day 5.  It was a hard lesson learned on our part for sure!We were going to do a 100% percent $ back shared risk program with donor eggs before our lovely angel donated her embryos to us.We are fortunate enough to have fertility coverage right now, so our transfer is covered.  That has been a blessing!  We have 10 day 5blast embryos (all high quality).  The person that donated to us, has twins.  She got pregnant on the first round.Well, let us know how it goes today!!!!!!!!!  Fingers and toes are crossed!!!! : )",
            "post_id": "7113642",
            "timestamp": "1312205703",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "OMG, I am sooooooo upset right now.  They just called and said we got 7 eggs (keep in mind I share with another lady) and of my 7, 6 fertilized.  I'm sorry, I picked a 23 yr old in the hopes to have many eggs.  So my question is they allow these ladies to do up to 6 rounds of donating their eggs.  She did her first round last month, both ladies got pregnant.  One with twins and a single.  BUT back to my question, does this affect her on how many they produce when they do this month after month?  I can't imagine she only got 14 or 15 eggs.  C'mon, I am 42 and they got 12 from me.I just yelled at the lady and said with all I spent, how in the world does she think 6 eggs are a good number for me.  I get we can not predict, but I feel something isn't right.Now my odds have dramatically reduced.  I really was expecting about 12 at the least to work with.  Now I have 6, they will do the PGD and genetic testing, and what are my chances of all 6 being good quality and then what are my chances of having 2 of the females?Sorry, I just am so angry at the numbers.",
            "post_id": "7113668",
            "timestamp": "1312206357",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "I am so sorry you are upset. But, try and just remember... quality over quantity.  They retreived 18 from my first donor... but should have retreived sooner... You want the Best quality embryos possible.  You do not want to end up with crappy, useless embryos and have 10 or 15 of them.   I think the most I have seen on here with high quality embryos and young donors is KristyinGeorgia.  She had 20 embryos, and has twins, and 18 are frozen (these are her own eggs).  But, again that is unusual.I know some ladies on here have only had 2 or 3 embryos from their donors, and they are pregnant now... actually Marianna101 only had 2 embryos from her donor.  She is pregnant with twins.With my donated embryos, their were 12 to start with.  The donors were 26 and 27.  But, again, all 12 were high quality embryos,and there are 10 left.  So, don't get down just yet!I can understand your concern about the girls.  It does reduce your chances, but lets have faith that there will be 2 or maybe even 3... How long do you have to wait until you know?I will be thinking about you!  And praying for girls!!!",
            "post_id": "7113722",
            "timestamp": "1312208006",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Now I just called the clinic back and left a long message.  I asked how her last cycle went and they told me about both ladies being pregnant.  Then I asked how many eggs did they retrieve and they said they can't share that number.  Hmmmmmmmmmmmmm that leads me to believe that there numbers probably go down each time OR my contract says that they consider 12 eggs from a donor good and each will get 6.  So would they use a third person and cheat us?  I mean really, 15 eggs total from a 23 year old who was on meds to produce eggs?  No way, I am not buying it at all.I am so angry I feel like calling the office over and over until I get someone.  I just do not think something is right.",
            "post_id": "7113738",
            "timestamp": "1312208402",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Yeah, I used the crinone on my last transfer... it wasn't bad, but boy, that build up was different! : )   I would much rather be taking the progesterone pills (inserted vaginally) but, no such luck.  I just hope and pray I can get up the nerve to give myself my the shots on the weekend! ugh!  I did have a nurse agree to give them to me here at work during the week... so that make me feel much better.... Oh, how I HATE Needles!!!!! Ugh!",
            "post_id": "7113752",
            "timestamp": "1312208728",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I am sorry to hear that you received bad news - however its not necessarily bad.  Out of the 21 retrieved from me only 3 were actually good quality.I am sure that if this girl is a regular donor she produces high quality eggs - that is better than throwing 18 away like I did.It will all work - I know that it is extremely frustrating.I have my transfer this Thursday at 7:30 am.  I cannot wait.On my way to acupuncture - smiles and hugs!!!!",
            "post_id": "7117010",
            "timestamp": "1312307960",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Hey Nicole! : )    I think your message was actually for ladydi03Your transfer is on Thursday?!?!  That is Awesome News!!!  Congrats!!!!!!!!Have fun at acupunture!  I never could find the wheatgrass shots... unless I bought them online and they were big $$.  Oh well, hopefully, I'll be ok without it.  I have acupunture on Monday 8/8... I stop birth control on Friday, and hopefull will start af within the week.",
            "post_id": "7117039",
            "timestamp": "1312308618",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I was just checking in to see how your doing today.  I am still praying for your lil embies!  When will you know any information?  We are really rooting for you!!!",
            "post_id": "7117043",
            "timestamp": "1312308743",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hey girls,lady di- I'm glad that you are able to vent to us.  It's hard trying to stay up beat about everything all the time. When I was going thru ivf a couple of years ago, I took all the meds and followed instructions to a tee...and then the weekend before my transfer, the office moved across town. I got there on my transfer day and they told me they didn't know if the incubators were working properly and there may be a chance that my embies didn't stay good...I was soooo frustrated, but I decided to go through with ivf anyway (dr. even told us we could stop the process now and they would pay for my next cycle) ...it worked and we now have twin girls....anyway--- just want you to know that we are here to listen and support you. Keep your head up. :)also, where is A2 Michigan? I am in Michigan (Grand Rapids) as well and my dr. office is the cheapest around. I LOVE my dr.  At my office the cost of basic IVF is $5879 not including any ICSI, assisted hatching, meds. You can check out their website for more info... www.michiganivf.comThe office also has a donor program.My total cost was very close to that when I did my fresh cycle but I had to add on assisted hatching and ICSI.This time around with a FET the cost is around $1800 (not including meds).I picked up my meds today. I am especially thankful for my rx insurance... only had to pay $39. Makes me super excited to get started! Hope I remember how to give myself injections! Its been a while! Just glad I don't have to take as many this time because of it being a FET.Hope everyone is doing well.Ladydi- let us know what happened with the transfer!",
            "post_id": "7117112",
            "timestamp": "1312310105",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Thanks so much ladies for the encouragement.  I was so angry yesterday, I couldn't even sleep much.  I kept dreaming and woke up mad.  Doing much better now, you are right, I can't change what the outcome will be, I can only hope I have 6 solid embryos and a couple of girls.  I am following things to a tee too.  I am on Estrace 3x a day, Vivelle Patch every other day and the Progesterone oil shots every morning.I go in Friday for the transfer.  They will first tell me of the 6 fertilized embryos, how they rate and then which ones are boys/girls and what they would transfer depending on what comes of the testing.  So that is what I am sooooo nervous about.Mhv, you are so right, my donor is 23 and hopefully produced quality eggs.  I was told she had 24 last month, but then only 15 on my month, figures eh?  But yes, quality is what counts.  So I am being VERY hopeful.  Sounds like you will be right behind us.  You were so fortunate to have such high quality embryos given to you.  WHat a TRUE blessing.Nichole, OMG we are transferring a day apart.  My transfer is Friday.  So you got 21 eggs on your own?  3 of them are good?  How many will they transfer?  Did you do PGD?  When did you go in for retrieval?  That is awesome, not to sound dumb, but what is the accupuncture for?Sarbear-I would have lost it if that had happened to me.  WOW, what a trooper for keeping your head on and going through with it and then look, it all worked out.  Unbelievable.Sorry, A2 is Ann Arbor.  Guess you GR people don't use that acronym, lol.  My clinic isIVF Michigan.  I think I called your clinic, but I got so confused with searching for an egg donor and calling around and trying to get pricing/timing....that I ended up back at my clinic.  Not sure my gut is telling me it was the right move.  When is your transfer of FET?  I doubt I will get any to freeze, but Mhv sure did so I am hoping I will just in case.Trying to stay calm, thanks sooooooo much all of you, I feel more at ease and am just trying to wait it out til Friday and keep my chin up and hope for the best!  I am wishing the best for you tooooooooooo:::::))))))))",
            "post_id": "7117319",
            "timestamp": "1312314915",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Hi, my mock transfer went good. they just called with lab results and said that i am low on vitamin D and i got to start taking vitamin d pills and multi vitamins without miss from today. i am still on bcp and transfer date is so far 8/26. which could tentatively change. all i hope is i respond well this time. thats all. i am 33 and craving to be mommy :(",
            "post_id": "7117329",
            "timestamp": "1312315099",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Hi All,I start Lupron tomorrow and injectables Thursday. Next week will be lots of blood work and ultrasounds, they do them daily! I just hope taking bcp helped increase my follie count. I am going to pray hard. I am going to see in endocrinologist Friday since my tsh went up a lot in a month. I am pretty sure it was the bcp, but my RE does not agree.Anyway, my DH is afraid to give me progesterone, but he will have to after transfer which should be around Aug 16 if all goes well.Sending baby dust,Risa",
            "post_id": "7118771",
            "timestamp": "1312355206",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "I'm going for my final IUI tomorrow the 9th one.  If this is not sucessful, I will go into IVF. I'm still nervous, I don't like the thought of going under for egg retrieval I'm scared.I can't believe how much it cost for meds and IVF and that it differs all over.I want to share with you how much the cost is for me, I'm so thankful.doctor's visit only or IUI only - $15sperm wash - $15meds-covered by insurancedoctor's visit with u/s $15 + $11vitamins - less than $201 IVF is covered per policy per lifetime, so if you use your policy (but must be married) it's $2000 for IVF if you have dual coverage only $500-$600......me too I'm tired of taking shots but I do it myself, just poke and press .. LOLGood Luck everyone .... baby dust to you .....",
            "post_id": "7118784",
            "timestamp": "1312356022",
            "user_id": "user_1736172",
            "user_link": "/personal_pages/user/1736172",
            "votes": "0"
        },
        {
            "answer": "I Am feeling a little discouraged right now.  went for my mock yesterday am nd my ovaries looked great my labs came back great but low and behold the Dr. finds a polyp on my uterus!! so now we have to push things back to have surgery to remove the polyp. I am glad that it was found . just wondering if any of you ladies experienced this bump in the road??  Thanks  Kim",
            "post_id": "7119090",
            "timestamp": "1312373576",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "I already went through one fresh cycle with 2 embyros that failed.  I have 1 frozen to use tomorrow - it only takes one though, right?????The acupuncture is supposed to calm the uterus to assist with good implantation.  Last cycle in April I started bleeding 3 days before my beta test so obviously no implantation.Good luck to you Friday.",
            "post_id": "7119135",
            "timestamp": "1312375296",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Kim-Sorry to hear about your polp.  Hopefully it won't slow things down too much.  Let us know what the plan is.Nichole, yep, It only takes one! We are all here supporting you!  Tomorrow is the big day! You must be so excited!!!!Iheart,  Here's to hoping the 9IUI is the charm!  Yes, IVF can be daunting... but you have a whole group of women to help walk you through it if it comes to that.  : )   Thank goodness you have some insurance coverage!  What a blessing!  So many ladies don't.  Every little cent helps!babyhope- I take a Vitamin D3.  It is in my Citrical.  You could get 2 plus's for the price of one!  I actually take the Citrical every other day (as it causes constipation for me), and then D3 every other day.Risa615- My hubby refuses to give me my progesterone shots.  I have a nurse here where I work that has agreed to do it during the week, and I guess I wil just have to give it to myself : (",
            "post_id": "7119207",
            "timestamp": "1312377845",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thank you... I will keep you posted. I am waiting to here when the surgery date it. then we go from there. :)",
            "post_id": "7119302",
            "timestamp": "1312380092",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Risa:  Our IVF's cycle will be very close.  I took my last BCP yesterday.  I am starting to cramp today so should see AF soon.  I have my teaching class tomorrow for my meds, and on Friday I have my BL ultrasound and blood work.  And if everything goes well I start with Lupron on Friday.  OMG I can nt believe it is actually here.  I have been on BCP since May and have only taken active pills.  So it has taken some time for me to get here!  Good luck to you.Kim: I am sorry to hear you have a polp.  I know how we get discouraged when we have to wait.  But I am sure it is all for the best.  Good luck with your surgery and keep us posted.Iheart: You are definitely blessed with insurance coverage.  I am in Texas and I have had a total of 3 IVF's and they have all been out of pocket.  I am going on my 4th IVF and I am blessed that a new insurance will cover the medication.  I will have to pay all the labs, doctor fees, and hospital fees.  It is a BIG help that I do not have to pay the meds!  Good luck to you.mhv:  I am right there with you my DH did not want to give me the progesterone shots either.  But I am lucky that this time around I will NOT be doing progesterone shots I am going to do the suppositories.  I am glad because I hated the shots they HURT!  Good luck to youGOOD LUCK TO EVERYONE!  Everyone here is blessed to have this site for support!  Ladies you are all wonderfull and I hope and pray that we all get our BFP.  I know for me this is my last time trying.  I can no longer take the pain when it does not work out.  So everyone lets pray for all those empty hands.",
            "post_id": "7119365",
            "timestamp": "1312381452",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "WOW!! Looks like we have quite the group going for Aug/Sept cycles!!! Can't wait to hear how everyone is feeling..... Any 'special' things anyone is trying to make this next cycle a success?",
            "post_id": "7119368",
            "timestamp": "1312381490",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "Hope- Yep, you have quite a group going here! : )   I hope your appt today goes perfectly!  Update us when you get back ok??MyYuyin-  Here's to a great cycle and a BFP!!!  And, I'm with you for the empty arms prayer!~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Here is what I am doing now... I take my prenatal vitamins, and a Vitamin E tablet daily (for uterine lining), I take Citrical with Vitamin D3 in it, a baby asprin, and 2 Raspberry LEAF Tea tablets daily up to transfer date (it is for uterine health also).I am doin acupunture 1 a week now, and will probably start going 2x's a week after my AF shows up.  I don't know how long I will do it if I get my BFP... Ok I mean, AFTER I get my BFPMy RE told me that my 1 can of cola is ok for after transfer, I will probably keep that bad habit.I am probably going to eat the pinapple core for the 5 days after transfer this time, it seems to work for some....",
            "post_id": "7119455",
            "timestamp": "1312383486",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Totally agree with you. this is the fastest thread i saw ever. appreicate you on starting it. :)",
            "post_id": "7119499",
            "timestamp": "1312384277",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "Tell me about eating pineapple core 5 days after transfer.  What is that supposed to do?",
            "post_id": "7119504",
            "timestamp": "1312384365",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "You are suppose to buy a whole pineapple and cut it into 5 sections.  Then starting on the day of your transfer, you are suppose to eat 1 section of the pineapple core only ,a day, for 5 days.Here is some info I found:For IVF [in vitro fertilization] cycle: one pineapple core, divided into 5 portions - consume one portion each day, over five days, beginning on the day of your embryo transfer.IUI [intra-uterine insemination] cycle: one pineapple core, divided into 5 portions - consume one portion each day, over five days, beginning on the day of your IUI.Timed intercourse cycle: one pineapple core , divided into 5 portions - consume one portion each day, over five days, beginning on the day afterPineapple contains bromelain. Bromelain is a proteolytic enzyme that breaks up proteins that inhibit embryo implantation. Consuming a whole pineapple (focusing on the core as it has the highest concentration of Bromelain) during a fertility cycle can be beneficial.*****Note: Be careful not to start consuming pineapple core too early in the cycle. Beginning to consume pineapple core BEFORE the recommended days above can actually affect your vaginal and cervical mucus PH, making it more acidic.",
            "post_id": "7119562",
            "timestamp": "1312385508",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Sounds like a lot of you are doing acupuncture- how much do you pay if its not covered? I've been debating whether or not to go. I've gone in the past- first ivf round, got a bfp then m/c shortly after... did it again and got a bfn. So I'm not sure if I want to invest the $85/session to go again. Any thoughts?",
            "post_id": "7119592",
            "timestamp": "1312386235",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "so if I go to Meijer, (grocery store) and get a pineapple that has already been peeled, do I cut the soft part around the pineapple to get to the center?  So the center of it is all you are saying to eat?  Dividing it in to 5 parts?  Interesting, but I will give it a try.  I have been trying to research what to help improve chances.Thanks for that, I will go get one tomorrow for my transfer.I just got the call.  I go in at 10:45a on Friday for the transfer.  Obviously results first.Yikes......",
            "post_id": "7119649",
            "timestamp": "1312387703",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Here is my IVF statistic, it might help some of you.1first IVF @37yo:5eggs, transfer 3=BFN2second IVF@36yo: new RE, 8eggs,transfer 5 +eating pineable=BFP, work so hard on restaurant, over 12hrs/day-->MC3rd IVF@38yo:12eggs, transfer 8 + eating pineable=BFP, etopic4th IVF@38yo: 8eggs,acupunture including before/after transfer session -->less eggs, very very low quality (4-5 cells no 8 cells-->transfer 5 +eating pineable=BFN5th IVF@39yo:new protocol, new medicine, same RE, 18eggs, transfer 8=my son is just turn one year old last week.My sister:with 3 IVFs+acumpunture on 3 yr long even on the break time since insurance cover -->2-3 eggs each times, last cycle 3 follicle with no egg+eating pinable each cycle=BFNSo I have no idea, acumputure or pineable would help or not, but I refer to eat pineable since it's almost free.....and yummy, since my insurance does not cover acuputure and I paid about $1000 extra on top of IVF cost.Both REs said \"I do not recomment acuputure, since it does not help much, however, If you are willing to pay an extra, then go ahead, it does not hurt....but I'll recomment you some good ones\".  This is just my story.Good luck to all ladies.",
            "post_id": "7119650",
            "timestamp": "1312387712",
            "user_id": "user_354244",
            "user_link": "/personal_pages/user/354244",
            "votes": "0"
        },
        {
            "answer": "MyYuyin2005, mhv, Hopeful4aBlessing,babywanted556MyYuyin2005- Hurray, glad things are so close for us! I am waiting for AF, started Lupron today.  I think my proctol is different then most since I have ovulated early some months.  I start Bravelle and Menupor Thursday which I have tried twice. The second time in May results were good, but didn't get prego, but the results helped talk my dr into letting me try IVF.mhv- Sorry DH isn't comfortable with the needle, but I can understand.  My DH has a mother who is a nurse, so he is going to suck it up and do it, but he wishes his mother were in town.Hopeful4aBlessing - I am going to do acupuncture. I have been for a year.  I found a great gal who is $65, but if you buy 3 at a time, 4th one is free.  So each cost about $48. I have to pay out of pocket, but at least my iui's were covered, so I wasn't paying anything else. Of course IVF is a different story.babywanted556- Wow, they let you transfer 8 and you got your son. I hope I get at least 3 to transfer since I will be lucky if I have 8 to start with since I am older with elevated fsh.Sending everyone baby dust!Risa",
            "post_id": "7119767",
            "timestamp": "1312390276",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Risa:  I am also taking different meds from last time.  I took menopur shots and this time around I am taking Lupron and Menopur.  I am also takeing DHEA 25mg 3 times a day.  I hope I get more eggs this time.  I think I only got 6 last time and transferred 2 8 cell eggs.mhv:  YES I think we can all use some prayers!  Hey what is the 2 Raspberry leaf for?  How is it going to help with IVF?",
            "post_id": "7119989",
            "timestamp": "1312394489",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "ladydi-Yep, they have the one's that are already cut  up, with the core still in the center.  Just remove the ring, give it to hubby : )  and eat the core.MyYuyin- Raspberry Leaf Tea (Tea or tablet form) are for uterine health.  It help to make the uterus healthy.",
            "post_id": "7120285",
            "timestamp": "1312400133",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Well you go in today or this morning for the FET.  I am thinking about you.Did you get the pineapple MHV mentioned?  I am going today to get one and will cut the center in 5 pieces just like she said and give it a try.Let us know how you did today.I will follow you and I go in tomorrow at 10:45am for my transfer.REMEMBER what you said, it just takes one::::::))))))  Big hugs to you and sending you positive everything.",
            "post_id": "7122145",
            "timestamp": "1312460365",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Nicole!  We are wishing you luck today!  Bring home that BFP!!!   I am so excited for you!",
            "post_id": "7122199",
            "timestamp": "1312462016",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "nichole754:  Good luck on your FET today I will say a prayer for you.ladydi03:  I hope yours goes GOOD tomorrow.  I will also say a prayer for youmhv:  Thanks for the info on Raspberry Leaf Tea.  I am considering taking.  How have you been taking it and how many pills do you take?  Do you think it is too late for me to take it?Update on me:Today is my 1st day of AF and OMG I am cramping.  I have a appointment this afternoon for my teaching visit on the medication.  Tomorrow I have another appointment for BL US and BW.  I am on my way.  My possible ER is August 18th and my transfer is 21st and my pregnancy test should be Sept 4th.  I pray that everything goes as planned.Baby Dust to everyone!",
            "post_id": "7122298",
            "timestamp": "1312464809",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "Anyone else nervous about the outcome????? I'm so ready to move forward and looking forward to POSITIVE results.... feeling a lil' alone at the moment... even though you gals are great and I know I'm not ;)",
            "post_id": "7122446",
            "timestamp": "1312468459",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "Hope-OH girl!  I once said, I think I like the Idea of doing transfers better then doing the actual transfers.  At least then, I can still \"think\" it wil come out positive.  If I actually do the transfer... I have no control over the outcome... It's absolutely crazy the way it makes you think.I have already chewed the inside of my lower lip raw!!I keep saying... there's no reason it shouldn't work... the embryos are hight quality, my uterus is good to go, but, we all know that means notta!!!That's why we need to lean so heavily on each other!  Because, here, no matter what the outcome is, there are going  to be a whole bunch women here to support us.  I just pray like crazy that each and every woman on this site gets a positive, and we're all delivering our babies next spring.  That is my prayer!MyYuyin- I take 2 tablets a day, or if you get the tea, drink 3 or 4 cups a day.  Yes, it can help now, the first day of your af is a great time to start!!... just don't take it after your transfer.  You can find it on the pharmacy side of your supermarket, or in the organic section.  Just make sure it say Raspberry LEAF tea, and not just rasbperry tea.It says on the box that is supports the female system, by aiding healthy menstruation as well as toning the uterus.   It helps with menstrual cramps too!!  So, go get some : )",
            "post_id": "7122548",
            "timestamp": "1312470445",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I'm doing FET on August 17th.  I would love to join this group. I go in for a blood draw tomorrow to make sure my estrogen shots are doing the trick. :D",
            "post_id": "7122589",
            "timestamp": "1312471229",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Good to be back in this thread again. Wish everything works for us this time.",
            "post_id": "7122608",
            "timestamp": "1312471749",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "I've been reading but it's going to take me a bit to catch up....Background on me:3 IUIs, 2 IVFs, one fresh donor cycle1 chemical pregnancy, 1 ectopic pregnancy, 1 blighted ovum, 1 miscarriage after heartbeatI had a D&C on July 8th from my fresh egg donor cycle and went right into a new cycle.  Since my cycle is \"shut down\" I don't have to Lupron shots.  Yay.I've done my 2 weeks on BCPs and am currently on prenatal vitamin, baby aspirin and doing Estrogen shots twice a week.I have 3 frozen embies from egg donor and this is it!  My last shot.  I think someone else said this was their last too.",
            "post_id": "7122618",
            "timestamp": "1312472005",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "MustangSally14:  Good luck to you lets pray that you get your BFP.  Our transfer dates are going to be close mine is August 21st (I hope).  I have also decided this is going to be my last try.  I am 37 yrs old I have had a total of 3 IVF's and going on my 4th.  I do not think I can do a 5th it is too much emotionally and financially.  So this is it for me one LAST try.  I pray that I get my BFP but I know that \"Faith is not about everything turning out OK, Faith is about being OK no matter how everything turns out.mhv:  I am going to go get some Raspberry LEAF not sure if tea or pills during lunch today.  Thanks for that info good to know.  Thou I do have a question why is not good to take after transfer?",
            "post_id": "7122757",
            "timestamp": "1312474510",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "I am doing acupuncture this cycle.  I did it last year with my IVF and got the furthest I ever have with a BFP.  We saw the heartbeat but then M/C.  Still, that was as far along as we'd ever gotten!This last cycle was egg donor and I did not do acupuncture.  I had a blighted ovum/missed miscarriage.  I will be doing acupuncture with this cycle.  The guy I go to (he was highly recommended by an infertility counselor) is $100 a session. I can write that off of my taxes because of the medical costs this year being over $10,000.  We wrote it off last year too.  Only this go around, since it's donor eggs, I only need to get my lining ready to receive a baby, so he said I only need to come 3 times.  Once the week before and then twice on the day of transfer (before and after).  My doctor also said that acupuncture wouldn't matter; but if it made me feel good, go ahead and do it.I've never done the pineapple thing, just may try that this go around.  You start it after (on your day of) transfer, right?My DH hates giving me the estrogen shots, but he does them.  Last week I had the nurse give it to me since I was there anyways.  One time, last cycle, I just did it myself (in the butt).  They aren't so bad.  I don't think I could do the ones in the thigh to myself though. Thankfully I am not on those.",
            "post_id": "7122763",
            "timestamp": "1312474585",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "MyYuyin2005, I am so glad to meet you.  I totally get the last time due to finances and emotions.  I went straight from this past cycle and D&C into this cycle because we have been TTC'ing for over 6 years now and I just want it done one way or another so I can move on with my life.  I'm tired of the constant everything to do with IF.  Even when we weren't in the middle of a cycle with the clinics I was still focused on when I'd ovulate etc. etc.  The whole roller coaster ride every.single.month.My beta is the day before our anniversary.  I so hope to get a BFP.  I pray that you get your BFP too.  I am trying to forget all of my past cycles and focus only on this cycle and it's potential.  Each egg is unique to itself and just might be the one!!!I am so glad that I found all of you who are going through this the same time I am.  And surprised to find a few of you who are where I am, at my last attempt.",
            "post_id": "7122801",
            "timestamp": "1312475131",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "I go in the morning for the results of the PGD/gender selection results then right in the room for the transfer.  I am anxiously awaiting the results of the 6 embies I have waiting for me.  My DH played the \"what if\"game today and I told him I didn't do it at all today and I won't have him doing that.  I will deal with the actual thing when the time approaches us and hopefully there will be nothing that surprises us OR gets me so sad or distraught.  Just happy thoughts right now.I have my pineapple core ready.  Funny thing, I was on a mission to get a pineapple today that I went to Kroger, NO pineapples in the entire store, I go to another grocery, NONE, I thought oh hell know, not stopping now, go to the third and there were 20 + pineapples waiting for me.  So I have that ready.I baked and cooked all day so I didn't think about tomorrow and could stay calm.  Now I am just starting to think about when I get that BFP.  Single, twins......Thank you for such a great group supporting eachother and will check in tomorrow when I hit the couch and take it easy for 2 whole days.  My laptop sits right next to me.Best wishes to you all and happy dreams.",
            "post_id": "7124151",
            "timestamp": "1312507346",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "I am sending you a truck load of baby dust!  Tomorrow is going to be an amazing day!  Whatever the outcome, know that you are exactly where you are suppose to be, and so are those embies!  No getting upset or distraught...just wonderful thoughts of motherhood :).  This is your journey, and I truly believe God will not do you wrong  :). I am so happy you found the pineapple!  I pray that is the only speed bump you encounter!  We will be here're to keep you company for sure!  Please update as soon as you get home!!!!!  Super sticky Ooey gooey baby dust coming your way!,",
            "post_id": "7124379",
            "timestamp": "1312513039",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Good morning, I am up and ready to go.  Well I couldn't sleep well, I was working in my flower beds last week and my neighbors vines are growing in my pine trees, so I started pulling them out and cutting them off.  Welllllllllllll it had some poison ivy around it and i now have poison ivy all up my arms and starting to come out on my stomach.  I have never had it before, so it is a real pain.  I hope it doesn't get much worse and I have to go in and get meds for it.  I have heard some have to take steroids to get rid of it.BUT however, I am ready for the hour and a half drive to the clinic.  There is a local office, but they only do transfers at this one location.  Have my water ready, which I will not start drinking until 9:45a.  I am not good with a full bladder.  My secret is I drink all that I am suppose to, then I go to the bathroom just a little to relieve the pressure, then I drink just a bit more and it gets me through it.  cheating, but it works for me.  Otherwise, I am miserable.I have so prayed that these embies, all 6, will be great.  That I will have 6 to choose from and there will be 50/50 boys/girls or more girls.   One thing I am soooo nervous about is that we only get one girl.  If that is the case, I want to transfer 1 boy also.  I am not comfortable with just 1 transferred.  TOoooOooooooo much money for smaller odds.  My DH absolutely refuses to transfer the boy.  I can go in to our children later, but he has 4 boys and I have 3 boys, that is why my need for a girl is so high.  I feel alone a lot, the boys go off and I am alone and I have desperately wanted a girl.  I always thought it just wasn't meant for me to have a girl.  So, I will be so sad if we get there, there is only 1 girl and he refuses to add a boy in.  He said we were doing this for one reason, a girl.  But really, yes, a girl, but if a boy is what I am meant to have, then I say I transfer him too.  Soooo we will see.  Guess I will be letting you know after 2p or so.Going to get my pineapple piece right now.  :::::::)))))))))))))))It's unbelievable that your life could be changing dramatically in the next 6 hours.  What happens in the next 6 hours could mean, a baby, twins, no baby with sadness, but this will be a life changing day.Hugs to you all.",
            "post_id": "7124982",
            "timestamp": "1312543123",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Well, alot makes sense now : )   I see why you so badly want a girl!  : )  But, I with you, think what is meant to be is meant to be.  You will have at least 2 girls, I am sure of it!! : )   But, I, like you, would transfer a boy to if it came to it!  I have do doubts of that!!!   A boy, girl, twin set would be so cute!!!! : )   Once  your in there, and the RE suggests 2... your hubby will be on board.  Even if it does mean transferring a boy.  You just wait and see!  You have spent way to much $$  not to!I cannot wait to see how it goes today!  My dh and I also travel 1 1/2 hrs 1 way to our clinic too!  He is the best in the state... so there we must go!  Anyway, I am thinking of you!!!!!!Come on Girls!!!!!!!!",
            "post_id": "7125055",
            "timestamp": "1312546605",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "OH...btw... sorry to hear about the poison ivy! ugh!!",
            "post_id": "7125058",
            "timestamp": "1312546675",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Welcome!  The 17th is right around the corner!!! : )  I am so excited for you!  It sounds like you have had quite the journey.My DH and I are using donor embryos.  A wonderful lady on here donated her 10 remaining embryos to us, so we are very hopeful they will work.  I have had 1 m/c from a donor cycle, and several bfn's from fets.  (We discovered our RE hadn't retreived the eggs soon enough, pretty much rendering them usless) Anyway, we are very hopeful about the future!! : )  Our transfer will be on Aug 30th, God willing.  We will transfer 2.Don't you worry about those 3 snowbabies!  They are going make you parents for sure!!!! NO WORRIES : )Let us know how your bloodwork goes today!",
            "post_id": "7125066",
            "timestamp": "1312547023",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hello everyone!I had my transfer yesterday and everything went perfectly.  My lining was much thicker than last time and there were no complications with the actual procedure.  Last time they had to try four times due to a curve in my uterus.  This time it was a straight shot.My estrogen level is wonderful and I am doing two crinones a day - ewwwwwww.Now we play the waiting game.  Monday I have blood work to check my levels and then Monday the 15th I have my beta bloods.  Unreal.  This is going so fast..........Our blastocyst was already developing into a 6 day it is that strong - the embryologist said that it is a AAA and the best that you could get.Lots of prayers for a BFP this time.",
            "post_id": "7125131",
            "timestamp": "1312548845",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "I will be following your same time line, so keep me posted.  I am getting ready to drive in to my transfer right now.  Then I go in Monday for US and the Beta test the 15th.  Same days as you.  Sounds like your chances are excellent.Rest easy and I will be back on later after I finish.  Lots and lots of nerves surrounding me right now.  Crazy, but life changing eh?",
            "post_id": "7125162",
            "timestamp": "1312549691",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-             8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15Ladydi03-                    8/5   IVF   Beta 8/16Sarbear11-                  ?  TransferMustangSally-             8/17  FETHopeful4aBlessing-      ?   FETMyYuyin2005-             8/21 IVFRisa615-                     ? TransferKimmiecle-                  On Hold due to polypTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVF",
            "post_id": "7125229",
            "timestamp": "1312551790",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Thank you!! Was going to stat writing this all out on pen and paper to figure it all out!!It sure is getting exciting with everyone starting and waitin...etc!My FET will be mid-sept...not sure of exact date yet.Just called the dr offce to see if I could do the injections class. I did it last time, but think I may need a refresher! Lupron shots start Wednesday and I'm starting to get nervous that I won't remember how to do them! I can do the easy ones in my stomach...but dh or my mom do the butt shots :) I am lucky I don't have to try to do those by myself!Anxiously waiting to hear from ladydi about the embies and transfer!!....btw... 17 of us!!!! Crazy!",
            "post_id": "7125540",
            "timestamp": "1312559447",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "@mhv... thank you for listing that out for us.  Sounds like your transfer went great and I am so excited to hear that your embryo was already developing into a day 6.  Donor embryos are awesome!  I know someone who just donated hers anonymously.@ladydi03..... how did it go? I totally understand your wanting a girl.  I'm glad you got the pineapples.  I'm going to try them this go around too.  Can't wait for an update on your embies and transfer.@nichole...  Sending goodvibes your way too. :D@ALL..  Had blood-work done this morning. Estrogen was at 265, so we are increasing the amount of my shot starting Monday.  DH was out of town so I had the nurse go ahead and do my shot this morning; otherwise we would have increased it today.6 days to the U/S, 12 days to transfer, 17 days to HPT (giggle), 21 days to beta test.  It's gonna be a long 3 weeks.",
            "post_id": "7125804",
            "timestamp": "1312565072",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Sara~~~ Your Welcome!!  I thought it would make things easier to track : )The lupron shots are the easy part, I think.  I am scared of those progesterone shots!  haha!  I did get the nurse to ok using a smaller needle for my progesterone shots though (1 1/2 inch needle down to an inch one).  That makes me feel much better!!!!Mustang~~~ No, I don't do my transfer until Aug 30th. I think that was Nichole you were meaing on the transfer yesterday!  Go Nichole!!!!    That is awesome about your friend donating! I just love to hear stories like that!!!Nichole~~~Your embryo sounds absolutely perfect!  I see you holding a lil one in 9 months!!  May I ask what your lining was?  I always struggle with that one...I just pray that this time it all goes perfectly, and is nice and thick like yours!*~*~*~*~*~*~*~*~*~*~*~~*~*~*~*~Baby Dust~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~~**~",
            "post_id": "7125922",
            "timestamp": "1312567945",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Yay on the transfer and the wonderful quaity of the embryo!!! That is so exciting!Hope u are doing ok on bed rest. Take it easy and let ur body do its thing!What is crinones??Prayers....",
            "post_id": "7125927",
            "timestamp": "1312568057",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Ok, I am home and on the couch.  Here is the outcome:Out of the 6 embies, Doc said that there was ONLY 1 girl and she is a 4AA, then the rest were boys and the best was a 5AB.  He said the girl couldhn't have gotten any better and the boy was good, but was coming out a bit and he said by transferring both, the boy could push the girl out of the way.NOW, this is all a bit for me to understand, I don't understand all of the grades, numbering and all. Doc jus said they were both good, Girl was the best and of excellent quality.  Just wish I could better understand.So needless to say, he transferred the 1 girl and the 1 boy.  Maybe the plan is that having one girl would require a brother to look after her??????   Not sure, but I was quite shocked that out of 6 embies, 5 boys and only of the 6, 2 were worthy of transferring.  Especially with a 23 yr old donor.But I feel good that I had 2 good quality transferred.  Now it is just the wait.I was told that I have to stay out of the sun/heat for 2 weeks.  That embryos do not like the body temp to rise, so he said to put my air on, stay in the house or inside and out of the sun.  I worship the sun so this will be hard for me.But I will do anything to help the process.Does anyone have a better understanding of the rating of the embryos?  I would love to try and understand what they transferred.",
            "post_id": "7125935",
            "timestamp": "1312568146",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "I knew your husband would cave and let them put in the boy!!!  I just knew it!!!  Yay!  A boy and girl for you!!!!Well, all clinics grade different.They usually start with the highest being 5AA or 1AA. and go down from there.Like with us, the clinic that our embryos were created at, graded from grade from 5AA and the lowest being 1AB.We have :4 embryos are 5AB4 embryos are 3AA2 embryos are 3ABIt sounds like your clinic grades the same.  So, as you can see, you have 2 very high quality embryos!!!!It sounds like your boy was already starting to hatch.  (Just think of a chick coming out of the egg)... That is awesome!I am not sure what he means by the boy could push the girl out of the way, but it sounds like he thinks it will help her attach in some way???Here is a chart of what is going on:  (AS YOU WILL SEE YOUR BOY IS AHEAD OF SCHEDULE):5-DAY TRANSFER:-1dpt ..embryo is growing and developing0dpt... Embryo is now a blastocyst    - TRANSFER DAY -1dpt....Blastocyst hatches out of shell on this day2dpt.. Blastocyst attaches to a site on the uterine lining3dpt.. Implantation begins,as the blastocyst begins to bury in the lining4dpt.. Implantation process continues and morula buries deeper in the lining5dpt.. Morula is completely inmplanted in the lining and has placenta cells & fetal cells6dpt...Placenta cells begin to secret HCG in the blood7dpt...More HCG is produced as fetus develops8dpt...More HCG is produced as fetus develops9dpt...HCG levels are now high enough to be immediately detected on HPTGood to know about the staying out of the heat/sun part!  My RE never mentioned that!  I, too, like the sun, so That is great to know!!!!CONGRATS ON YOUR TRANSFER!!  GROW BABIES GROW~~",
            "post_id": "7125982",
            "timestamp": "1312569181",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "That is sooooo helpful to know.  I can't believe my Doc never explained that to me.  So as long as I know I have 2 great embies transferred, now I just have to baby the babies.  I am happy to know it is all done and now I just wait it out.  Hope I feel symptoms soon.I was so shocked that 5 were boys and 1 girl.  I think in the back of my head I wasn't counting on a lot of girls,but I sure was hoping.  THANK GOD for one almost perfect one.Sure wish I had some to freeze, but now nothing can go wrong.Yes, remember the heat and sun.  I think that is huge to know.  I would have been in it Sunday.  My 13 year old has travel baseball tryouts this weekend, Sat and Sun. and I knew I couldn't go Sat. but planned on going Sunday.  He said absolutely not.  He does not want me in the sun, raising my body temp for minimum of 2 weeks.  I can do this, it is worth everything.The Doc actually told my DH that the ethical thing would be to transfer both.  He said they were both good and 1 wouldn't make it through freezing.  He just wanted me to know that the male may be stronger because he is further ahead and may push the girl out of the way from attaching.  Just a possiblility, but no guarantees on anything as we can't predict nature.  It is all so crazy to understand and comprehend. It is all so magical to me.Can't wait til your day!!!! It is soooon.",
            "post_id": "7126087",
            "timestamp": "1312571408",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Oh an excellent way to describe my boy.  So I guess my concern is, if he is already hatching, what if he hatches before he attaches?  Obviously that will leave me with the hopes of 1.  If he is already hatching, Is that bad?  On your list, it says on 1dpt it hatches,the 2dpt it connects to uterine lining.  So that leads me to believe they do hatch before attaching?I feel so oblivious to all of this.  lol.",
            "post_id": "7126105",
            "timestamp": "1312572041",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "NO IT's Great that he is already hatching!!!!!   We all Dream of that! : ) That means he is an excellent embyo!  Have you ever heard of assisted hatching?  That's what people pay for, and your lil one is doing it for free! haha!   That means, he is going to attach quicker!  Then, the lil girl will attach right after him!  It's ALL Good!!  You have to picture perfect embryos there!  Did they give you a picture of them???I knew your hubby would listen to the RE!  They always do : )Girl, I would have been right there with you!  I think I'll post something to see what other's are told....",
            "post_id": "7126120",
            "timestamp": "1312572423",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hey Girl,LadyDi's RE told her to stay out of the sun during her 2ww.  That got me to thinking... what instructions has your RE given you?Mine told me**No baths or Hot showers during the 2ww**No sex until confirmed heartbeat on u/s**Bed Rest only the day of transferThat was it pretty much~~~  How about you ladies????maybe we can compile an awesome list of what not to do, and it will help lead us all to our BFP's : )",
            "post_id": "7126127",
            "timestamp": "1312572580",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Well then that sounds great.  It's unbelievable I did this with how little I really know and understand.Just watched a horrible movie on lifetime.  I am so bad I had a Big Mac and fries on the drive home.  I am sitting here feeling like I am so fat and out of shape, but yet I had a big mac. Go figure.",
            "post_id": "7126133",
            "timestamp": "1312572691",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-             8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      ?   FETMyYuyin2005-             8/21 IVFRisa615-                     ? TransferKimmiecle-                  On Hold due to polypTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVF",
            "post_id": "7126135",
            "timestamp": "1312572698",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Great idea Mhv-Mine said:Bed rest 2 full days.  He said these are the most critical and just get up to go to the bathroom, walk around a short bit to re-circulate, but back down.No sun or increasing body temp for 2 weeks.  No swimming for 2 weeks, NO hot tubs if pregnant.No lifting for 2 weeks, then light lifting if pregnant.No sex until after the beta test.NO orgasms or contracting your uterus, 1 week before transfer and 2 weeks after.There is my list.  Would love to hear what else we have out there.  We will be pros and baby hatching machines doing all the right things.",
            "post_id": "7126151",
            "timestamp": "1312573104",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "@mhv.... Sorry I got confused.  It's not hard for me to get that way. Ha.  Your list should help straighten me out, I hope.  :D@ladydi03, that is AWESOME that he is already hatching!  Very strong embryo there.  I'm hoping for twins for you. :DI had all the same type stuff.... no baths, no hot showers, no sex, no running (so I have to get all of my jogging in over the next 12 days, lol), no lifting anything over 25 lbs., no swimming... then I do all the other stuff too.... no seafood, no turkey (unless I've heated it up), no hot dogs, no alcohol, no caffeine, etc. etc. etc.  My RE said that I can go for walks, although our heat indices are well over 100 degrees each day, so that's out unless I hit the treadmill which is soooooo boring to me.",
            "post_id": "7126171",
            "timestamp": "1312573612",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "I have a question for you all too.  Do any of your work, and if you do, did you tell your boss what you're doing?I had a boss a few years ago (I've been going through this for over 6 years now) who was absolutely horrid about my being out of the office so much going through IUIs, ectopic, etc. etc.  I wound up leaving my position because it was so stressful.  My last boss was awesome, he has triplets from IVF and was absolutely wonderful about all of it.  Unfortunately after 2 years of working for him corporate closed the office down and so here I am at my current position.  I have not told my boss I am going through IVF/egg donor.  He knows I was pregnant and that I had to have a D&C on July 8th; but I've not told him that I am going through IF stuff.  I work by butt off and am willing to work (and do work) after hours and on weekends and pretty much anytime he needs something.  If he asks, I will tell him the truth; but I've not divulged that I am trying to get pregnant.Have you told your boss if you work?",
            "post_id": "7126191",
            "timestamp": "1312573925",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "I...about work...I am a teacher (kinergarten). The last time I did ivf I was able to get my transfer done in august, just before I went back to school(actually hadmy beta on the1s day of school!) This time around AF didn't come forever so it puts my transfer in sept...which is not good timing...as school will have just started. I will have to get a sub if my transfer falls during the week. Taking a couple of days off right at the beginning of school (especially with 5 yr olds who have never been to school before) is definitely not ideal...its actually not good at all. I'm not going to tell my boss because she is one of those people who are all about themselves..and I don't believe for a second that my secret would be safe with her.I'm hoping to get thru all of this without telling my co-wokers/boss.I think its totally up to u...if u don't feel like sharing-don't! Its your personal life an others don't have to know if u don't want them to.Just my opinion :)Or maybe just tell him/her that u have a lot of stuff going on in your personal life and leave it at that if you don't feel comfortable telling him. If he hasn't gone thru it himself (wife) he probably won't get it and all that it entails.Take care ;)",
            "post_id": "7126636",
            "timestamp": "1312584922",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "I have told my boss.  Actually, I told our secretary (a female) or proceeded to tell my boss eventually.  I knew my boss wouldn't keep it quiet, which was a concern of mine at first, but now I don't care.  He of course didn't keep it quiet, told his assistant and she has shared with others.  However, a good thing came of that.  I met another lady who I work with going through the same difficulties.  So, now we have each other to lean on.  I don't particularly care that they know.  I actually am glad they do.  As you said, you miss a lot of work for treatment and it is easy not having to explain.  They are understanding.  Also, if I break down at work, they know why.  Of course, you have to figure out if you are concerned that it gets out, perhaps you shouldn't say anything.  But if you are worried that your frequent absences could affect your employment, maybe it is worth the risk. Best of luck.",
            "post_id": "7127075",
            "timestamp": "1312597681",
            "user_id": "user_1358758",
            "user_link": "/personal_pages/user/1358758",
            "votes": "0"
        },
        {
            "answer": "My FET is Aug 15.  I've been taking Estrodiol every three days intramuscularly since end of July.  I'm trying to figure out what this is doing and in the process have discovered that many FET med protocols involve something to prevent ovulation (i.e., Lupron).  I'm concerned why I'm not on something like that. Should I be? has anyone done an FET (or in process of) and NOT been on something to supress ovulation?",
            "post_id": "7127078",
            "timestamp": "1312597856",
            "user_id": "user_1358758",
            "user_link": "/personal_pages/user/1358758",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone,Started injectables today and first u/s Monday.  This is a big day as I will find out how many follies are growing!  I usually take meds for 8-10 days, so I am curious how it will change starting them earlier with bcp prior. I hope to do Transfer the week of Aug15, probably towards the end of the week. My office does 2 day, 3 day, and 5 day transfers so it all depends on what we get.  I am lucky that next week I don't have work, I am a teacher who is on special assignment, president of teacher union, but we do go back the week of the 15.  So, I may work from home during the days after transfer to really help my eggs take. I made sure to not plan any meetings the whole week.Sending baby dust to all,Risa",
            "post_id": "7127219",
            "timestamp": "1312601175",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Hello Everyone! My surgery date is aug.11th. dr. wants to stay on track with U/S on the 15th and then they will decide if we continue to move forward and order my  fertility meds for the following week! I pray all will be good and we can continue as planned!I am thinking of you all!Lots of love,Kim",
            "post_id": "7128031",
            "timestamp": "1312639730",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-            8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      ?   FETMyYuyin2005-             8/21 IVFRisa615-                     Aug TransferKimmiecle-                  8/11 SurgeryTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVFThings we have been told do or to avoid during the 2ww:+1-2 days bedrest,+Do not increase body temp.~Stay out of the heat, No Baths, No Hot Showers+No sex until beta~ some say until heartbeat is detected+No lifting over 25lbs, until negative test, or until RE says if positive.",
            "post_id": "7128085",
            "timestamp": "1312641158",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Alot of RE's do natural cycles, and do not put their patients on bcp/or lupron.  They call it a natural cycle.  My old RE did those.  It was when I first started the fertility journey.  I didn't understand either.  But, what they are doing is trying to \"catch\" your normal ovulation cycle.  That way, your body will be \"expecting\" the embryo, if that makes sense?  The estrace can delay but not prevent your ovulation.  They are probably checking your bloodwork alot to make sure you haven't ovulated correct? You lining will thicken on it's own just like it normally would every month on its own... and that's what the estrace is for also... to help the lining thickness. This gives them a certain window to work with, and if things don't look picture perfect, they may decide to delay transfer until next month.  But, if you don't usually have an issue with your lining, this most likely won't happen.Other RE's like to have a \"controlled\" enviroment.  They like to have control over the cycle, and mimic ovulation.  They want to make sure everything is \"perfect\" before transfer, ie: lining thickness.  That's why the lupron.  They shut down your ovaries so there is no chance of ovulation.  They want to create their own cycle.  It gives them more flexibility on the transfer date and the conditions of transfer (ie again lining.)Anyway, Good News!  I did get pregnant on my first natural cycle fet.. but unfortunately m/c'd, so they do work!!!  : )",
            "post_id": "7128103",
            "timestamp": "1312641851",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I had my transfer yesterday at noon.  I have been on bed rest completely.  I am having slight cramping.  Very mild, but I feel something different.  Not sure why that would be, anyone else feel that the day after transfer????????",
            "post_id": "7128624",
            "timestamp": "1312655607",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Well, if you look at the chart above.... since you lil boy was a little ahead... maybe he is attaching himself to the lining today!?!?!?How exciting! : )  Now, you lil girl will attach tomorrow, later today!!!!!!!   Girl, you are so gonna have twins!!!  I just know it!*~*~*~*****~*~*~*~*~*~*****~*~*~*~**~Sending you super sticky baby dust!!!!!!",
            "post_id": "7128705",
            "timestamp": "1312657789",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "So, now I'm hoing that on day 2 my baseline levels will be normal, so I can start in August.  My thyroid resusts came back and it's a little off.  The nurse said she is going to call in my medicine to my pharmacy.  Well, when I went there the next morning they had told me no one called it in.  I was so aggaravated at tis point.  I did call the fertility clinic and they told me that I had to wait till the next day because the nurse already left.  I did have a phone conference with my dr. that evening because I had a few questions.  I did mentioned what had happened and it sounded like he was upset that it was not called.  He called it in after I got off the phone with him  I'm glad I said something to him beause he is the main dr. at that clinic.",
            "post_id": "7128767",
            "timestamp": "1312660097",
            "user_id": "user_258734",
            "user_link": "/personal_pages/user/258734",
            "votes": "0"
        },
        {
            "answer": "What is your tsh? Mine went from 1.77 to 4.84 because of bcp, so they increased my meds. Thyroid is so important. Everyone should keep an eye on their levels. I am praying my levels are going down and will retest again Monday.Risa",
            "post_id": "7129750",
            "timestamp": "1312700529",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Out of curiosity, what meds to they give you?  I just stopped my bcp on Friday, should I get my tsh rechecked?",
            "post_id": "7130182",
            "timestamp": "1312723913",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "The doctor told me that my level was 2.7.  So, now I'm on thyroid medicine 1x a day.  He said he likes to see the #'s at least at a 2.0.  Not really sure what all this means.",
            "post_id": "7130321",
            "timestamp": "1312728086",
            "user_id": "user_258734",
            "user_link": "/personal_pages/user/258734",
            "votes": "0"
        },
        {
            "answer": "@Trusting77... I am doing FET on August 17th and I am not taking anything other than Estradiol either.  No Lupron this cycle..... nothing to suppress.  My dcctor said that since I just had a D&C my body is shut down; but I would think that it goes right into normal mode and I would ovulate; so I am wondering the same thing.@Risa615... How exciting that your almost there.  You will transfer shortly after Trusting and myself.  I'm glad that you have days of rest during that time.@Kimmiecle.... sending prayers and goodvibes your way that you can continue to move forward.@mhv.... Thank you for the information on the natural cycle; but now I am totally nervous.  What if I ovulate?  They did bloodwork last week on Friday and are increasing my estradiol; but no more bloodwork is listed on my protocol.  I usually ovulate late; but every 3-4 months I have a really early ovulation (I've been tracking this stuff for 6 years now).  I've never had lining issues.  Oh wow. I so hope I don't ovulate and \"ruin\" this cycle.  It is interesting that I am doing a natural cycle.  It is good news that you got pregnant on your first \"natural FET cycle\".@ALL....I'm hypothyroid and on levothyroxine once a day.  I'm also on metformin.  Fun times, lol.  Thyroid is important in early pregnancy until the placenta can take over.I agree that different doctors have different protocols.  I think the most pressure relieving thing for me is that my doctor told me that once they put the embies in (transfer) it's up to them.  They are either good ones and will make a baby, or they are not and won't make a baby and that there is not a whole lot you can do to make it happen or not happen.  Obviously, follow the guidelines of no alcohol and caffeine, not heavy lifting etc. etc.  But really she said, there isn't a whole lot that you can do, it's up to the Embies.",
            "post_id": "7130890",
            "timestamp": "1312741835",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "@ Sarbear11, Trusting77....  Thank you for your feedback and your situations with work.  I do worry about my boss getting disgruntled with me for being out so much.  I think that stems from my first boss being really annoyed with me.  I was a manager and when I was out (I had 17 direct reports at the time) it would never fail that they would do stuff and he would have to handle it.  Seriously, I would be gone for an hour and half total and something would *always* start up while I was away.  I don't think it would have been so bad if it were one cycle and that was it.... but it was continuous and then I would have to deal with bloodwork and the ectopic etc. etc., so that it became a continual thing.  This is my 2nd cycle back to back in my current role and if I do get pregnant and there are complications again I am going to have to tell him.  I am praying that this works and that I can just go on about my merry way.  :)",
            "post_id": "7130902",
            "timestamp": "1312742092",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Well just a waiting.  Today I was off bed rest and decided to venture out of the house.  I went to my sons baseball tryouts for a bit.  It was 85 degrees and humid, but I didn't feel my body overheating, so I felt ok with it.Hope everyone is doing great.  Nothing new to report. Just waiting the 10 days out.  8 more to go.",
            "post_id": "7131151",
            "timestamp": "1312749999",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Melissa,It sure doesn't hurt to have your tsh checked.  I am taking synthyroid which most people take.  I used to take one a day, now two a day with the resent increase due to bcp. The goal is to between 1 and 2 for ttc.  My levels were fine until bcp and now I found out Lupron will increase levels as well, but mostly in people like me who already have issues.  If you read my journal from last week, you will see that a girl on here had a raised tsh due to ivf protocol, but she was on meds prior to ivf and she knows wishes she would have watched her tsh while on Lupron.Risa",
            "post_id": "7131247",
            "timestamp": "1312754019",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Hi , i am new to this forum , but i really wish from the core of my heart to all those ladies try to conceive  ALL THE VERY BEST : )Its soo nice to know that ladies are  supported by the ppl to go for   such procedures,  treating them normally in everyday life.Hope it works for all of you out their coz it didn’t for me ....",
            "post_id": "7132052",
            "timestamp": "1312803990",
            "user_id": "user_1741068",
            "user_link": "/personal_pages/user/1741068",
            "votes": "0"
        },
        {
            "answer": "My transfer on 08/04 went wonderful - no issues.  I feel great.  I went camping this weekend with my husband, and sister and brother in law.  Just relaxed a lot.  I was nauseated quite a bit and my boobs are killing me.I went for blood work this morning to check my progesterone and estrogen level.  I'll have the results this afternoon.  They increased my crinone to twice a day on Thursday to be cautious.  I feel different this time than I did the last so hopefully its taking!My beta is 08/15 only a week away!",
            "post_id": "7132150",
            "timestamp": "1312807607",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Crinone is a progesterone suppository - rather than the shot.",
            "post_id": "7132153",
            "timestamp": "1312807774",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "-Just a few more days ladies!!!  Hang in there! : )  I hope the tww is treating you well...",
            "post_id": "7132243",
            "timestamp": "1312810717",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "It is good to know what others have been told. I would not of thought of staying out of the sun or heat could make a difference.  But I guess it does make sense since NO hot baths are allowed.*****************************************************************************************************Update on Me:I started my shots on Friday.  I am taking 20u of Microdose Lupron in the morning and at night.  I am also taking 150iu of Menopur with 300u of Follistim at night  I am also still on DHEA 3 times a day.  On Wednesday I go back to the doctor for US and BW.ladydi03: I am so happy your got your transfer done!  How exciting Good luck to you and make those babies stick.mhv:  Thanks for making the list it is so hard to keep up with everyone here.  As always you are great at doing that!mustangsally14: Last year when I did my IVF I did tell my boss and she was OK with me taking time from work to go to the doctor.  But I do not think I am going to tell her this time around.  I only have 2 or 3 doctor appointment before the trigger shot.  Once I do the trigger shot and I know when I am going to do the retrieval I plan to take vacation for one week.  That way I do not have to tell her.  My plan was NOT to tell many people the less people that know the better.  I guess I am just preparing for everything.  Last time I told my mother, in-laws, sister, and 4 every close friends.  Even thou they know how hard the whole thing was for me they truly can never understand unless they have gone through it.  So this time around I only told my Mom, Mother in law, and a close friend.  So good luck to you.Kimmiecle:  Good luck on your surgery I will keep my fingers crossed for you and pray everything goes well.",
            "post_id": "7132276",
            "timestamp": "1312811756",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "@Nichole754... excellent news on a good transfer!   My prayers are with you.@iheartforababy, ladydi03, Hang in there!  I know this is the hard part! Are any of you going to do a hpt?@MyYuyin2005....  We are coming down the home stretch!!!  I am so excited.3 days to last U/S, 9 days to FET.I've taken a paid day off on the day of my transfer.  :)",
            "post_id": "7132374",
            "timestamp": "1312814267",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Thank you soo much!  :)",
            "post_id": "7132407",
            "timestamp": "1312814750",
            "user_id": "user_1722331",
            "user_link": "/personal_pages/user/1722331",
            "votes": "0"
        },
        {
            "answer": "Well girls, AF showed today! : )   Seems like everything is moving right on track!  22 more days!  Can I tell you, I am getting soooo nervous!!!",
            "post_id": "7132428",
            "timestamp": "1312815180",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Well Girls,My AF showed today!!  It looks like things are right on track for my Aug 30th transfer!Another hurdle jumped!  Fingers and toes crossed!!",
            "post_id": "7132470",
            "timestamp": "1312816420",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "So happy to hear!  Congrats!  Little steps......",
            "post_id": "7132605",
            "timestamp": "1312819969",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Thanks Nicole!  It's hard for me to believe this is actually going to happen!  I have waited so long!  How are you feeling?",
            "post_id": "7132626",
            "timestamp": "1312820424",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Ladies, I'm in pure shock to hear how many of us are on this journey in the next few weeks! Here I thought I was going at the next time alone! FET is currently scheduled for 9/12 with beta on 9/24. My 6th wedding anniversary is 9/16 so.... hoping since I won't be having any 'fun' that this will be our time! It's so great beyond words to have such support of others who know and understand the frustration and struggle of infertility! I wish us all sanity through this journey and MANY BFPS along the way!!! Without you gals, I'd still be in the fetal position balling my eyes out wondering what I did to deserve such emptiness! So to each of you, I thank you for being here supporting not only me but each other through this!!!! MOUNTAINS OF BABY DUST TO ALLLL!!!!!!!!!!!!!!!!!!!!",
            "post_id": "7132671",
            "timestamp": "1312821373",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "@ ALL... TMI here.  I went to the bathroom and had a ton of CM just now.  I am kind of freaking out like I am about to ovulate.  I'm not on Lupron or anything else to suppress.  My transfer is not for another 9 days!  Ack!!@mhv...  Congrats on getting AF.  One more step along the way.   The only time I am glad to see her is when I am just going into an IF cycle. ;)",
            "post_id": "7132724",
            "timestamp": "1312822597",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-            8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      9/12   FETMyYuyin2005-             8/21 IVFRisa615-                     Aug TransferKimmiecle-                  8/11 SurgeryTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVFThings we have been told do or to avoid during the 2ww:+1-2 days bedrest,+Do not increase body temp.~Stay out of the heat, No Baths, No Hot Showers+No sex until beta~ some say until heartbeat is detected+No lifting over 25lbs, until negative test, or until RE says if positive.",
            "post_id": "7132733",
            "timestamp": "1312822767",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Mustang-When was the last time they did bloodwork to check your estorgen level?  If it would make you feel better, why don't you call your RE's office, and let them know you would like it checked again.  I remember driving home from one of my doctors appointments once, when I was doing a natural cycle, crying because I thought for sure I was going to ovulate before my transfer.  But, they had checked my estorgen levels that day, and I was far from ovulation.Hang in there!  I am sure things are fine : )Hopeful- Yep, we have quite a group here! : )  Thanks for bringing us all together!  It sure beats worrying, and feeling all alone! That's for sure!These women have been a ton of support, and I have a great feeling for all of us!!!!!",
            "post_id": "7132747",
            "timestamp": "1312823112",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I just left a message at my RE office.  I hate it that I feel like I am bugging them with my silly questions. LOL.  But all that CM made me nervous.  I just looked at my protocol and it looks like I start with the endometrin again on Friday. Yuck.I am so thankful for all of you on this site!!!  I promised myself I was not going to get all worked up this cycle and have done good so far.  But now that it's getting close, I don't know if I can hold out.",
            "post_id": "7132809",
            "timestamp": "1312824533",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "mhv:  You are on your way.....  good luckQuestion:  Is anyone doing fertility massage therapy?  My RE recommends it and I was wondering if anyone else is doing it.  I know I am going to get a massage for sure this week to help with the stress! =)",
            "post_id": "7132933",
            "timestamp": "1312827079",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "How wonderful that you put a consolidate chart of all of us. so sweet of u. :)",
            "post_id": "7133006",
            "timestamp": "1312829675",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "@MyYuyin2005.....I am not doing fertility massage therapy; but I used to go to a group where a few of the ladies said that it's wonderful.",
            "post_id": "7133148",
            "timestamp": "1312832464",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "MyYuyin-  I have not heard of fertility massage.  I do get a massage regularly, but she doesn't know anything about fertiillty massage.  Do you know what it entails??Baby- Your welcome!!!  I just think it's easier to keep track this way : )",
            "post_id": "7133177",
            "timestamp": "1312833217",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "My RE office just called me back and said that the type of estrogen they are giving me builds up my lining but won't cause me to ovulate and that the CM is caused by the meds.  She all but promised me (because nothing is 100%) that I won't have follicles when I come in on Thursday for my U/S.  I hope not because they cancel the cycle if you do.  She said we'd know more then.  Now I am kind of wishing we'd done Lupron.",
            "post_id": "7133178",
            "timestamp": "1312833261",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Hello Everyone,had my first u/s today after starting meds on Friday, and I have a 9, 11, and a 13 already which it has only been 3 days on meds. Maybe one more on the right. I am a little disappointed that I didn't have more, but with the elevated FSH, and my age, 42, I suppose I am doing ok.  I go back on Wednesday.When we got home, found a little kitty on my door step.  We already have 3 cats, but couldn't help but want to feed the little one.  Left some food out and the kitty has eaten already.I am going to acupuncture today and I am still waiting for my tsh results.   I think my retrieval could be August 13 or August 14, Wednesday will give me a better idea.I am taking Lupron (10m) and  Bravelle (150) & Menupor (75) twice a day.Sending baby dust to all,Risa",
            "post_id": "7133568",
            "timestamp": "1312840680",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "I am going to start lupron from 11th August. and on BCP till tomorrow. I have been experiencing vaginal discharge odor and itchiness since a week. is this common? is it due to the hormonal tablets and changes. i hope this does not conflict with my coming up cycle. any inputs help.",
            "post_id": "7133624",
            "timestamp": "1312842192",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "MyYuyin-So you are on the meds, do you have any dates or a calendar yet?  Very exciting but nerve wracking at the same time.  This site is so wonderful to see what others are going through and to make some sense sometimes of what you are going through to compare or be put at ease.  Keep us posted........We are alllllll hoping for lots of babies.MHV, Yay, yay you have your transfer date.    EXCELLENT!  We will count down with you.  You have been so positive and refreshing for everyone.  You have wonderful sounding Embryos and I have a good feeling for you.  I truly believe your state of mind and positive attitude helps,so you have ALL of that going for you with everything else.  The mosquitos broke out last night out of nowhere and my 9 yr. old has over 200 bites on him.  Horrible.  So I am not going out much.  I went out to possibly moe the yard today, so I picked up the yard from the dog, and it was soooo hot and humid, that I came to realization that not only was it not a good idea to moe and bounce around, but surely do not need to get some virus from the scitos on top of this crazy poison ivy I have.Mustangsally, glad your mind was put at ease today.   I think I will probably do a test on Friday.  I know they say not to, and I know everyone on here takes multiple ones, but I did it the first IVF round and it was BFN, then I took another and another and it got me so worried and upset for the couple of days that unless I feel any symptoms of pregnancy, I may skip it.  Now I say that today, but bet me,I will hold off til Friday, not be able to take it any longer and run to CVS.  I don't really have a feeling one way or another of if it worked this time.  I think I am afraid to set myself up and get excited, but then I feel I should be aloud to let myself be excited until the truth reveals itself, it is just hard.  So, guess that really wasn't an answer, but I will post as the time gets closer.  lol.Does anyone else require a nap everyday?  OMG, about 3p everyday, I get soooooo tired, I have to lay on the couch and nap for about 30 minutes.  Not sure which med it is, Estrace, Vivelle or the progesterone shot, but gee, I am tired.  Plus I go to bed about 10p everynight.  I am really wanting to go out and walk, but now I have the mosquito problem out there and won't risk it.  It consumes us ladies, but in the end it is all worth our efforts no matter what the results.Sorry, a little windy today.",
            "post_id": "7133881",
            "timestamp": "1312847269",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Ladydi03: Yes naps are a necessity!!! HAHA!!! Mine were becoming daily and for about 1-1.5 hrs daily at one point.... enjoy it, could be a great sign!!!!Risa: WOW! That's great news!!!! Wishing you continued success for this cycle!!!Babyhope: don't worry- there's so many hormone changes, I'll pray for you that things are not a problem and your cycle continues!! :)MustangSally: Here's to hoping things are a-okay!! :)Big hugs to all - I'm low on time but promise to be back soon! Hoping all get BFP'S!!!! :)",
            "post_id": "7133930",
            "timestamp": "1312848768",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "Hey I just realized we are neighbors.  I live in the Ann Arbor area.  Crazy eh?",
            "post_id": "7134013",
            "timestamp": "1312851637",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Thanks Steph, trying to keep the faith, but it is so hard!  At least my tsh is now at 1.9, so I am so happy to see that it is coming down with the increased meds.  I will retest one more time in a week.Sending baby dust to all,Risa",
            "post_id": "7134626",
            "timestamp": "1312869268",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Risa:That's GREAT that your levels have come down! How are you feeling being on the increased meds?  I have my recheck on Friday but Lupron starts Thursday. I'm getting really nervous about this cycle- I'm anxious about getting that sticky bfp but I'm also concerned she might cancel it if my spotting doesn't stop and if the tsh levels aren't coming down.... oh so many things going on! When are you back in school/work? Do you start before Labor Day?LadyDi03: I know!!! We should get together! Let me know if you're ever on my side of town.. ;) It's a small world and I'm so happy to have met others who are going through the same hell I've been living in... makes it a lil' less intimidating.... and almost scary that SO many others are dealing wtih the same thing. It's like the new normal???Here's to all the ladies for the Aug/Sept cycles!!! BFPS!!!!",
            "post_id": "7135191",
            "timestamp": "1312895229",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "mhv: Fertility massage: I do not know much about it except that the massage they give is designed to help bring more blood to the uterus to help with implantation.  That is why I was asking if anyone here was doing a Fertility massage.  I will call them and get more information and I post it.Risa: Good luck on your appointment on Wed I also go in on Wed for my 1st US and BL.Ladydi03:  Yes I do have a calendar so my schedule is as follows: Aug 18th is my possible ER and depending on how my embryos develop if I have a 3 day transfer my date is 8/21 if I have a 5 day transfer it will be 8/23.  I am so nervous I cannot believe how fast the process is going.To All:  I had 2 IVF's done in Mexico because it was SO much cheaper.  The instructions I got after transfer were as follows1. No spicy foods (herbs)2. No caffeine3. No dark sodas4. No picante (hot sauce) of any kind5. No chocolate6. No cinnamonBasically nothing that will irritate the uterus.  As you can see ladies a bit different from the instructions you get here.Good luck to everyone!",
            "post_id": "7135226",
            "timestamp": "1312895988",
            "user_id": "user_1226401",
            "user_link": "/personal_pages/user/1226401",
            "votes": "0"
        },
        {
            "answer": "Risa, Hang in there!  It sounds like the most important things are coming together which is huge!!! I know you want alot of eggs, but remember... quality over quantity, and it only takes 1 : )lady- yeah, you've spent all of the $, don't overdo it! : )  Thanks for your kind words.  I am a kind of MedHelp addict.  haha!  You ladies have pretty much became my rocks over the past 1 1/2 years.  I would be lost without MH!!  I would have definately given up along time ago.  That I know for sure!Hope-Yeah!  come back more often!  We miss you!!!!  September is right around the corner my friend!!!!!  It will be here before you know it! : )Baby- You start your lupron the day I start my Estrace! : )Mustang- I am sure you are ok.  The doctors just don't seem to explain things very well, I don't think.  I am sure everything will be right on schedule with you!  You just wait and see.Is anyone else using the estrace patches?  I have always used the pills either orally or vaginally... so the patches will be new to me.~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~~*~*~*~*~*~*~*~*~*~*~*~*~**~*~*~*~*~*~*~*~**~*~*",
            "post_id": "7135299",
            "timestamp": "1312897775",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-            8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      9/12   FETMyYuyin2005-             8/21 or 8/23 IVFRisa615-                     Aug TransferKimmiecle-                  8/11 SurgeryTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVFThings we have been told do or to avoid during the 2ww:+1-2 days bedrest,+Do not increase body temp.~Stay out of the heat, No Baths, No Hot Showers+No sex until beta~ some say until heartbeat is detected+No lifting over 25lbs, until negative test, or until RE says if positive.+No spicy foods (herbs)+ No caffeine+ No dark sodas+ No picante (hot sauce) of any kind+ No chocolate+ No cinnamon",
            "post_id": "7135316",
            "timestamp": "1312898054",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hi All- Jumping in on this conversation.  Currently in the dreaded 2WW period.  Whoever says just relax and don't stress must be joking :)!!  Been a tough couple of days trying to keep my mind occupied - analysing each and every twinge and trawling the net for info - praying it is not AF on the way \"sigh\".Good Luck everyone!!",
            "post_id": "7135505",
            "timestamp": "1312902393",
            "user_id": "user_1758852",
            "user_link": "/personal_pages/user/1758852",
            "votes": "0"
        },
        {
            "answer": "I feel great - sore boobs and nauseated - the best signs in the world.  Hopefully its a good indicator.Only 6 days before beta........I'm such a chicken - I could take a pregnancy test on Saturday but I think I am going to wait.  I don't know though.So excited - I don't know what to do with myself.",
            "post_id": "7135778",
            "timestamp": "1312909408",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "@mhv, I did the Estrace patches with my IVF last year.  I kept them on even in the shower.  They left sticky marks when I changed them out and I had to scrape the stuff off, much like a bandaid, but worse.  My husband actually asked my doctor if I could have those patches instead of the shots and she said no.  lol.@Ladydi03.... I am like you.  I've had made myself crazy with those HPTs.  I will probably test anyway though.  I cannot help myself.  We'll see.  I've not even made it to transfer yet and I already know when I can start testing. LOL.  You do what is best for you.  This time around I am really trying to chill with the whole thing and not get all worked up.  I can't help but have a positive attitude that this is going to work.  Even if I didn't believe it was going to work, it would still be a letdown if it didn't, so I might as well enjoy the process and believe in it and have faith that this is it.  At least that is what is working for me this time around.@All... I wish I could nap.  Even without the meds I start to crash around 3pm. With the meds it's even worse and I have to work.  Right now on just the Estrogen is fine.  I start back on the progesterone suppositories on Friday and that really knocks me out and makes me feel pregger.  So here I go with the mini pads again. I've not missed those so much.  I was wearing them from mid May to the beginning of July.  Off of them for a week and then back on them for 3 weeks.  Oh well, this time it's all going to be worth it.",
            "post_id": "7135987",
            "timestamp": "1312914102",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "@Nichole754... those are great signs.  My prayers are with you.",
            "post_id": "7135993",
            "timestamp": "1312914223",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Thanks for the support! Really praying for good news tomorrow.Steph- I do feel better on the increased meds, but I know it was the bcp that did it to me, so I might need to go back down in a month. I will watch my tsh and see what my dr says.  I am feeling sleepy now, but I am sure it is the injectables. I was feeling fine until I stMelissa- Yeah, I really do need to think this is my cycle and not compare myself to other women who are younger who get lots of follies.  Maybe I will have a few more tomorrow, praying the right side wakes up!",
            "post_id": "7136120",
            "timestamp": "1312916637",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Alright ladies, I gave my speech on HPT, why I didn't want to do it again, blah blah, and I passed a CVS today and thought WTH, why not go get a pack.  So I got the Answer, 5 days early and there was 3 of them. So when I got home,  I figured, well there are 3 of them, I will just do one today for the fun of it.  I am 5dp5dt, I think I am counting right.  I had my transfer On Aug 5th, Friday at noon.  Saturday, Sunday, Monday and now Tuesday.  Oh maybe you call it 4dpt, anyway, got a BFN, but I really wasn't expecting it to be positive yet.  Just thought I would test to see.But all this talk about the tests made me do it anyway.  So my next one, I will wait til Friday.  I am not feeling anything, sore boobs, nothing.Hope everyone is doing fabulous today.",
            "post_id": "7136131",
            "timestamp": "1312916839",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "Here's a cheat sheet for everyo who wants to test early  : )5-DAY TRANSFER:-1dpt ..embryo is growing and developing0dpt... Embryo is now a blastocyst1dpt....Blastocyst hatches out of shell on this day2dpt.. Blastocyst attaches to a site on the uterine lining3dpt.. Implantation begins,as the blastocyst begins to bury in the lining4dpt.. Implantation process continues and morula buries deeper in the lining5dpt.. Morula is completely inmplanted in the lining and has placenta cells & fetal cells6dpt...Placenta cells begin to secret HCG in the blood7dpt...More HCG is produced as fetus develops8dpt...More HCG is produced as fetus develops9dpt...HCG levels are now high enough to be immediately detected on HPT3-DAY TRANSFER:1dpt ..embryo is growing and developing2dpt... Embryo is now a blastocyst3dpt....Blastocyst hatches out of shell on this day4dpt.. Blastocyst attaches to a site on the uterine lining5dpt.. Implantation begins,as the blastocyst begins to bury in the lining6dpt.. Implantation process continues and morula buries deeper in the lining7dpt.. Morula is completely inmplanted in the lining and has placenta cells &fetal cells8dpt...Placenta cells begin to secret HCG in the blood9dpt...More HCG is produced as fetus develops10dpt...More HCG is produced as fetus develops11dpt...HCG levels are now high enough to be immediately detected onHPT",
            "post_id": "7136177",
            "timestamp": "1312917827",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Went for BW and scan today. stopped BCP from today. my lupron and HSG are diulted by the nurse. i get call today with instructions. i will start lupron from 11th, twice a day. and i start stims from 13th. so far so good. wish this cycle works. godddd plsssss make this cycle workkkkkk. pls pls pls.give me my miracle baby. cant wait longer than 33 years. need a damn change in life.",
            "post_id": "7136236",
            "timestamp": "1312919033",
            "user_id": "user_1545464",
            "user_link": "/personal_pages/user/1545464",
            "votes": "0"
        },
        {
            "answer": "I've used the patches and they are GREAT!!! The major complaint that I have is the adhesive residue is kinda a pain to get off but it's nice to have the patches and not so many pills! I start off with 1-0.5mg then gradually go up to 4-1.0mg patches so here's to BFPS!!!Also for your cheat sheet, do those apply for FET's as well as IVF's.... the only reason why I ask is because I thought i was told/read somewhere that the FET's can implate later and therefore give lower hcg levels b/c they are off to a slower start... not too sure though. Anywys, here's to hoping Aug/Sept are great months!!! I'm not sure if mentally I can withstand another bfn,m/c, or just flat out no good news. It's time for a change!!! Hope, grow, love!! :)SSBD to all!!!",
            "post_id": "7136283",
            "timestamp": "1312920110",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "@ladydi03... You are early for even the early HPT test.  Tomorrow would be your 10dpo or 5dp5dt.  So yah, you are still really early yet.  If you can stand it, I'd wait a few more days.  :D@All, Hopeful4aBlessing... I would like to know that about FETs too.  This is the first time I am doing FET.  I've done 3 IUIs, 2 fresh IVFs, and one fresh egg donor cycle.  This will be my first time with FET.  I think I heard that they get off to a slower start somewhere too.  Does anyone know?Also, I am sooo glad I have kept my mouth shut at work about doing IF treatments.  I found out today there is a big re-org going on and a ton of people are losing their jobs.  I am staying on-board but with added responsibilities.  I know they can't discriminate against you one for doing IF treatments; but it would be easy to re-org me out during a big re-org.  Know what I mean?  I am so thankful that I still have a job!!!",
            "post_id": "7136866",
            "timestamp": "1312934512",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "so i just typed a long reply and then lost it just before i hit the post button!!!! ugggg!!!!Anyway,,,I'm not going to retype it alll..........But I do want to say that I start lupron tomorrow and I'm really excited for this journey to begin...HOpeful and Babyhope--you guys are starting right after me...but I have a long protocol...so I won't be transferring until after another AF arrives.The only thing that I am nervous about is the timing...school is going to be just starting and then my sister is expecting her first baby on sept 19....I would hate to be on bed rest when she has her baby!!! I just have to leave it up to God, right?Ladydi- I was also thinking that you tested WAY early. Keep your head up and stay positive...you wiill still get your BFP!Nicole- those are great symptoms!!!! I can remember when my boobs were terribly sore after I did IVF and got preg with my twin girls! can't wait til you tell us about your BFP!....here's to BFP for all of us!!!!!!!;)",
            "post_id": "7137105",
            "timestamp": "1312940959",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "Sarbear/Mustang Sally, yeah, I know it was waaaaaaay early, just figured I had 3 tests, so what the heck.  BUT, I am feeling NOTHING.  And I mean NOTHING.  So for some reason, I am now getting a bit nervous.  Nichole has sore boobs and we are on the same timing.  But it's Wednesday, I will try a test Friday or Saturday, but my bloodwork is Monday.  The stress of it all.  I guess now I am worried if it doesn't happen, and it was my last effort, I spent 40k and gambled.  I know for a great cause, but was that selfish of me in this economy to do that.  Being 42 is was now or never.  I just am worried if it doesn't come out BFP, then will that cause me a seperate set depression/sadness?Nichole-  How are you feeling?  Sore boobs but anything else?  I wrote above I feel nothing at all.  Other than weight gain from the meds.  Unpleasant!  Hope you are doing great.MHV- You should be getting so excited, it will come fast.  I know it won't feel like it on your end, it sure isn't on my end.Hope everyone is doing great.  DH just gave me the miserable PIO shot.  The patch is a mess, I can't get that stuff off my abdomen, and now I itch all around where I put the patch.  Feeling cranky today, maybe I should stay home.  lol.",
            "post_id": "7137947",
            "timestamp": "1312975282",
            "user_id": "user_1681451",
            "user_link": "/personal_pages/user/1681451",
            "votes": "0"
        },
        {
            "answer": "To All:ladydi03 - I just threw up - hopefully a good sign.  I did not have these symptoms the last time and everyone is totally different.  When my sister was preggo her boobs didn't get sore until her 3rd month.  Try to relax - I know its so hard - you need to keep your hormones in line.  Try to stay as busy as possible.  That is what I have been doing.  You are so brave to take a pregnancy test.  I am such a chicken!!!!!  Too  many negatives - I cannot handle it.sarbear11 - I hope its a good sign and not just meds - however it wasn't like this last time for me.  Hopefully - fingers crossed!!!!!mustangsally14 - thanks you much - my hubby is so excited - he doesn't know when I go for beta and its driving him nuts. I want to be able to surprise him somehow!!!!!mhv - Hope your doing well - thinking of you.",
            "post_id": "7138218",
            "timestamp": "1312983962",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "ugh!  I just typed a long list and lost it!!!  I hate it when that happens!Ok,Nichole!  That is fantastic news!  I was just asking if you felt different then you did last time!  Yippeee!!!Sarbear-Welcome to the lupron club!  I have a few bruises on my legs from them... but I don't mind them, its the PIO I dread!  I will do them though for my baby(ies).lady- it's ok! Hang in there!!!  I still see twins in your future!  I just have a gut feeling about this!!!  $ can be re-earned!  Don't feel selfish at all!  Look at it this way... we are keep the economy moving! :)Mustang- my supervisor knows what is going on, and 1 co worker and a nurse.  I told the nurse because i asked her to give me my shots... other then that, I keep it on the d/l.Hope-  I am so excited for you to get started again!  It is only a few short weeks away!!!!I start estrace tomorrow!!!!  man, that makes my heart beat fast just thinking about it! I cannot believe in just a few short weeks, I get to do my transfer! : )",
            "post_id": "7138284",
            "timestamp": "1312985943",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "I am so excited for you.  How many embyos are you going to transfer?",
            "post_id": "7138447",
            "timestamp": "1312988806",
            "user_id": "user_1661893",
            "user_link": "/personal_pages/user/1661893",
            "votes": "0"
        },
        {
            "answer": "Looks like I will trigger tomorrow or Friday.  My 3 follies on the left are growing at the same rate and together which is good. My dr is hoping Friday for trigger since he would like the extra day.  So, retrieval is this Sat or Sunday, which is great so I can just relax at home after.  My dr said we would do a 2 day transfer and that he has had a lot of success with it.  So, transfer Aug. 15 or Aug. 16.  Tomorrow is another big day!My thyroid antibody test came back, and it looks like my dr will probably tell me I have Hashimoto's thyroid disease, which I am not surprised.  I will learn more about that later today as I am sure my endo will email me.  I am already taking meds, so I don't think it will change anything.Hope everyone has a good day!Risa",
            "post_id": "7138675",
            "timestamp": "1312994463",
            "user_id": "user_1217293",
            "user_link": "/personal_pages/user/1217293",
            "votes": "0"
        },
        {
            "answer": "Thinking about coloring my hair with those 28day wash out hair colors... thinking of going a tad bit darker... plus I aboslutely LOVE the conditioner... makes the hair OH SO SOFT however, not sure if I should go for it or bail while ttc... any thoughts? FET 9/12",
            "post_id": "7138735",
            "timestamp": "1312996243",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        },
        {
            "answer": "Nichole-We will transfer 2. they are frozen in 2's, and are blast.  So, if one doesn't survive the thawing process, they will thaw 2 more... they said they are such good quality that they would only be willing to transfer  2, and then refreeze the other 1  if necessary.Risa- How exciting!!!  So it looks like Monday or Tuesday will be the big day!  : )  Keep us updated!",
            "post_id": "7138744",
            "timestamp": "1312996380",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-            8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      9/12   FETMyYuyin2005-             8/21 or 8/23 IVFRisa615-                     Aug 15th or 16th IVFKimmiecle-                  8/11 SurgeryTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVFThings we have been told do or to avoid during the 2ww:+1-2 days bedrest,+Do not increase body temp.~Stay out of the heat, No Baths, No Hot Showers+No sex until beta~ some say until heartbeat is detected+No lifting over 25lbs, until negative test, or until RE says if positive.+No spicy foods (herbs)+ No caffeine+ No dark sodas+ No picante (hot sauce) of any kind+ No chocolate+ No cinnamon",
            "post_id": "7138755",
            "timestamp": "1312996487",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Good Luck with your surgery tomorrow!  Please update us when you can ok?!?!?",
            "post_id": "7138762",
            "timestamp": "1312996661",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Hopeful-- I woulde wait...just to be safe. It is ok to do when u r preggo however. If it were me I would wait my the bfp and then go for it!Ladydi- everyone is different....so try not o stress over no symptoms. Some people don't have any symptoms at all! Again, it may still be early for symptoms even.Kimmi-good luck with surgery. Wat time is it scheduled for? And is your OB doing it or fert. dr?........................... 3 1/2 hrs til my first shot!   :)",
            "post_id": "7139017",
            "timestamp": "1313001310",
            "user_id": "user_461842",
            "user_link": "/personal_pages/user/461842",
            "votes": "0"
        },
        {
            "answer": "@Sarbear, I don't know about you; but once I've started with the shots I feel like I am finally really on my way.  :D@ladydi03.... you might not feel anything and still be pregnant.  No symptoms at all.  Let me say that again for you...  You can feel nothing and still be pregnant.  That is part of what is so hard about all of this... there is no way to tell except the HPTs (which aren't always accurate if you get a negative, as in could be too early) and then the Beta test.  I still have every single one of my fingers and toes crossed for you... even my eyes. :)I understand being 42 (because I am) and this being your last cycle (because this is it for me too).  I totally get it.  I already bought two books and found a website about dealing with having tried through IF treatments and being out all that money and still not having a baby.  I haven't read them yet and am staying positive for both you and I that this is finally our lucky break.  This cycle will work for us both.   However, *if* it were to come to that, you will find a way to deal, you are much stronger than you think.  I can give you the names of the books if you need them; but I am staying on the mindset that neither of us will.  Okay?@Nichole754.... I want to say I'm glad that you're feeling nauseous.  That sounds so horrible, but if it means you are preggers, then I'm glad.  lol@Risa, great news that your cycle is moving along and your transfer will be next week.  I am so excited for you.@mhv... Yay on starting Estrace.  Only a few weeks to go.  I hope these few weeks go by fast for all of us!!!Update on me:  RE called earlier today and said my tsh, thyroid is right where it's supposed to be. Ultrasound to check my lining is tomorrow.  If it's a go then I transfer 2 embies next Wednesday afternoon.  I pray that both embies make the thaw.OMG, it's down to 1 WEEK to the transfer.Today is huge at work, tons of people are being laid-off.  I've had to talk to people I know are going to be let go and I can't say a word.  Very stressful sad day at work.  I feel bad for those that are going.  And I selfishly am glad that it's today and not happening in the middle of my transfer next week or during the 2ww.   Gosh, I feel so selfish saying that.  I know how it feels though, I was in their shoes in my previous position.  I've only had this position for 6 months now.",
            "post_id": "7139039",
            "timestamp": "1313001715",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "@Hopeful on the hair coloring.  I would go for it.  I just colored my hair about a week to a week and a half before we started building up my lining.",
            "post_id": "7139046",
            "timestamp": "1313001791",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "Just wondering out of all you ladies for the AUG/SEPT transfers, who is doing a DE FET?Has anyone had already a failed  cycle?",
            "post_id": "7139052",
            "timestamp": "1313001868",
            "user_id": "user_1687881",
            "user_link": "/personal_pages/user/1687881",
            "votes": "0"
        },
        {
            "answer": "Hi redhead68, I'm doing a DE FET cycle.  My fresh cycle failed.  I had a blighted ovum/missed miscarriage.  My transfer is with two frosties next Wednesday if my lining is good at the U/S tomorrow.",
            "post_id": "7139060",
            "timestamp": "1313002030",
            "user_id": "user_1700345",
            "user_link": "/personal_pages/user/1700345",
            "votes": "0"
        },
        {
            "answer": "I Have to get my hair colored every 3 wks (well, the roots anyway) preggers or not! haha! My person that does my hair has assured me that it is completely safe.  There is No Way I could go without coloring my hair... that would be a disaster!!!",
            "post_id": "7139086",
            "timestamp": "1313002609",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "Ah!  You know I am beyond happy to see you  here! : )  I am smiling from ear to ear!  This is our time my friend!  OUR Time!!!  I won't bore you with my story, cause you already know it... but, so glad to have you here!!!",
            "post_id": "7139095",
            "timestamp": "1313002789",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "IHeartforababy-            8/3    IUI    Beta ??Nicole754-                   8/4   FET  Beta 8/15   1 embryoLadydi03-                    8/5   IVF   Beta 8/15    2 embryosSarbear11-                  Sept  TransferMustangSally-             8/17  FETHopeful4aBlessing-      9/12   FETMyYuyin2005-             8/21 or 8/23 IVFRisa615-                     8/15 or 8/16 IVFKimmiecle-                  8/11 SurgeryTrusting77-                  8/15 FETrghkah38-                    Starting 8/24MHV                           8/30 FETthinkingpositiveCA        2ww        Beta?Kris71                         Sept FETHopeful1703                 8/30 FETPinktootie                    8/28 FETBabyhope40527            8/26 IVFRedhead68                  Aug FETThings we have been told do or to avoid during the 2ww:+1-2 days bedrest,+Do not increase body temp.~Stay out of the heat, No Baths, No Hot Showers+No sex until beta~ some say until heartbeat is detected+No lifting over 25lbs, until negative test, or until RE says if positive.+No spicy foods (herbs)+ No caffeine+ No dark sodas+ No picante (hot sauce) of any kind+ No chocolate+ No cinnamon",
            "post_id": "7139105",
            "timestamp": "1313002968",
            "user_id": "user_961574",
            "user_link": "/personal_pages/user/961574",
            "votes": "0"
        },
        {
            "answer": "My RE recommends:-bedrest day of ET and taking it easy the next day if able-No lifting any more than 10lbs until beta (12 days post transfer)-Sex is allowed (shockingly because everything else I read says not to, she claims sex is good and can help with implantation)-Drinks plenty of liquids to stay hydrated-Light exercise; walking is great-Plenty of sleep-Keep stress to a minimum-Heatlhy diet; low sodium, plenty of fresh fruits and veggies, lean meats-Drink 100% juice daily to help avoid constipation issues-No baths, swimming, or hot tubsI know there are more at home but those are the ones I remember off the top of my head- will report more later when I'm home. ;)BFP's all Aug & Sept long!!! :)",
            "post_id": "7139153",
            "timestamp": "1313004094",
            "user_id": "user_1417531",
            "user_link": "/personal_pages/user/1417531",
            "votes": "0"
        }
    ],
    "post_id": "7082588",
    "question": "Who's on the journey of IVF/FET for Aug/Sept 2011?",
    "timestamp": "1311191383",
    "title": "IVF/FET Aug/Sept 2011",
    "user_id": "user_1417531",
    "user_link": "/personal_pages/user/1417531"
}