{
    "answers": [
        {
            "answer": "hi there.  i'm doing pretty good!  i get sick about once a day too although not always to the point of throwing up and its usually at night.  i'm also really tired!  i feel like i NEVER get any sleep (but i also have 3 little ones so thats probably the reason why!)i'm due on the 19th and i'm 11wks and 6 days.  i had my 12 week scan today.  they scheduled it too soon and now i have to go back in 2 weeks to do it again.  i got some u/s pictures though!  and i was also told i'm probably not going to be able to deliver at the hospital i've delvered my other 3 at b/c there is protocol for this baby to go through when its born and my usual hospital only has a level 1 nursery and the hospital downtown has a level 3 nursery.  i guess i want to be wherever will be better for my baby of course but that really bums me out b/c i LOVE the hospital i usually go to.sorry for blabbing... i guess i've just wanted to talk to someone today!  glad to hear you're doing good!",
            "post_id": "2185633",
            "timestamp": "1196892570",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "I work fulltime, go to school fulltime and have a 2 yr old so I know what you mean!  It sucks not being able to have caffine on those days you feel like your going to crash.  The semester is over in a couple of weeks and I can't wait for that much needed break.  I will take way less class next time LOL.Is there something wrong with the baby? Is that why they won't do it at the hospital you normally go to?  I would be so upset if i couldn't have this baby at the same place i had my daughter.  They pretty much saved her life and I completely trust them.I hope everything is ok with the baby.",
            "post_id": "2185721",
            "timestamp": "1196893972",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "our youngest was born with hyperinsulinism (the opposite of diabetes).  she got the gene mutation from dh.  they said w/ every pregnancy there is a 1in 4 chance of it happening and we have 2 other healthy girls and this will be #4...  but they don't know enough about it to rule out it happening again.she had surgery to remove a focal lesion on her pancreas at 4 months that was the cause of it.the protocol for the new baby is to monitor blood sugars before every feeding for the first 48 hours to ensure it remains above 70.  if at any time it goes below 70 it is to be treated w/ a feeding or give glucose through an IV.  if the blood sugar level goes below 70 after 48 hours of life then that is abnormal and will require further investigation.  and the baby will have to do a fasting test for 8 hours before being discharged if all else is well.its awful to think this baby will have to go through this right after being born...  but our dd went through so much.  before her surgery we were giving her 4 injections a day of a medicine to supress her insulin and checking her blood sugars before every feeding and it was still always going low.  now after her surgery she is completely cured!!!  :)  hopefully this won't happen again.  but if it does i know there is hope.  last time we went through it blind not knowing what the future held.  again, sorry this was so long!!!!!!!  and i guess i just have to get over the whole hopsital thing to do what's best and where the more experienced nurses are for my baby!!!oh, and its ok to have an occasional cup of coffee!!!  that's my downfall...  i can't live w/out it!!!",
            "post_id": "2185811",
            "timestamp": "1196895641",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "I'm from Los Angeles, CA and currently 12 weeks and 4 days due June 14th!! I just started having light morning sickness I'd say every other day at 10 weeks. I was a late bloomer =D. I heard the baby's heartbeat a few weeks ago and was told it is a strong heartbeat, I still haven't been given an ultrasound...my first one will be in 4 weeks, when I find out if it's a boy or girl. I am hoping for a BOY!!!",
            "post_id": "2185816",
            "timestamp": "1196895708",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": "Hi my name is Keri and i'm from PA. i'm 12 1/2 weeks pregnant. i go for a nuchal scan tomorrow morning. i'm very nervous. i can't wait to see the baby again though. i'm due june 14th. hey are we pretty much safe after 12 weeks or is it 13 weeks? 13 weeks is the start of of the 2nd trimester. i get so confused with that. i searched it online,but no luck. i know there really isn't a safe mark in pregnancy. i really don't feel as sick throughout the day anymore,thats good. i defineately have a bump, its my 4th. Kennedydp5 i hope everything works out for ya with your baby. also girls i have another question, tomorrow at my scan will they be able to see the sex? i'll be 12 weeks 5 days.",
            "post_id": "2185843",
            "timestamp": "1196896160",
            "user_id": "user_296999",
            "user_link": "/personal_pages/user/296999",
            "votes": "0"
        },
        {
            "answer": "Wow, i can't imagine going through all that, I hope the baby comes out perfectly healthy and glad your daughter is doing ok.",
            "post_id": "2185844",
            "timestamp": "1196896173",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "isn't hearing the heartbeat the most amazing sound in the world?!  I am currently looking into purchasing/renting a fetal doppler and found few websites just comparing prices....that and I have no idea how much a pound is compared to a dollar......one website was from the UK",
            "post_id": "2185850",
            "timestamp": "1196896275",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Aww we have the same due date!! Yes after 12 weeks, we have gone through the \"danger zone\"...I was so happy hitting my 3 month mark.  As for the start of the 2nd trimester I heard 14 weeks is the start, but I've also heard 13 weeks is the start...I actually thought the 2nd trimester was either at 12 weeks or 13....if you go to pregnancy.org, they show every week process and real live pictures of what your baby looks like and what is developing and what the baby can do...its pretty amazing because they show the actual picture of a fetus starting from the egg and sperm \"colliding\" and fetus at 6 weeks which looks really pale, all the way till birth...That's where I read that the first trimester is 14 weeks long...",
            "post_id": "2185860",
            "timestamp": "1196896468",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": "Definitely!!! When the doctor spotted the heartbeat, and when they told me that was the baby's heartbeat, I was like \"What?\" That's so crazy, my fiancee heard the heartbeat first I couldn't tell what that sound was until the doctor told me...lol but afterwards I felt so relaxed especially after they said it was strong! I still haven't had an u/s but hearing my baby's heartbeat was just as beautiful. It's crazy when you think about how we all started off like that, tiny from the size of a bean but still having a heartbeat and having life at such a small size...",
            "post_id": "2185872",
            "timestamp": "1196896756",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": "your sonographer might be able to tell you the gender...  they told me today if i would have been 13 weeks she might have been able to do it.  but she said at the point i'm at both girl and boy parts stick out a little right now so it would be hard to tell.  she said everything looked good though as far as what they were doing the test for...  she couldn't use the measurements she took b/c she said my baby was too small so that's why i have to go back in 2 weeks.  even a day or 2 off makes a difference for this test i guess.  the baby has to measure at least 45mm long and mine only measured 43mm.  good luck w/ yours tomorrow and let us know how it goes!",
            "post_id": "2185913",
            "timestamp": "1196897264",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Hello everyone! I live in Sparks, NV and I am due June 18th. This is my first baby. I go back to the ob on Friday for another u/s and I am so excited!! Congrats everyone!",
            "post_id": "2186122",
            "timestamp": "1196900396",
            "user_id": "user_274158",
            "user_link": "/personal_pages/user/274158",
            "votes": "0"
        },
        {
            "answer": "Hey everyone - I live in rural South Dakota and this is my first baby. Iam about 11 weeks 3 days (I think but have not had a u/s). I am due June 22nd. I'm kind of frustrated because since I live in a rural area I attend a clinic for my prenatals and then only go to the hospital for the month before and during delivery and once for an u/s. The clinic doesn't have an ultrasound, so I won't have my first ultrasound until 18wks. My doctor tried to find the heartbeat at 10wks, but their old doppler was broken, so I currently have no idea if everythings OK, except that I have had no bleeding etc and urine/blood owork was fine. I'm not sure I should wait until 18wks to have my first u/s - is this too late??. Anyways, I've had quite a few symptoms already,  but they only started around 8wks and are still going strong - nausea and throwing up, dizziness, fatique, seeing stars (especially after I throw up - please reference my other question on this forum), constipation and bloating etc etc etc. I hope it all diminishes soon!! I am very excited about being pregnant but I'm also pretty scared because I knew very little about pregnancy itself when I got pregnant and when I read about preeclampsia, HELLP and all the other possible complications it kind of freaked me out big time. Any advice to calm down? Thanks and congrats!!",
            "post_id": "2186211",
            "timestamp": "1196902123",
            "user_id": "user_38489",
            "user_link": "/personal_pages/user/38489",
            "votes": "0"
        },
        {
            "answer": "hey...  honestly the first time i was pregnant i didn't even know to be scared about anything!  i was the same in going through a clininc with my first 2 children and only having 1 u/s at 18-20weeks, and then seeing the delivery doctor only once before delivery both pregnancies.  you'll be fine...  don't worry!  it sounds like you are having a normal pregnancy.  good luck with everything!  :)",
            "post_id": "2186435",
            "timestamp": "1196905698",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Hello ladies =) I live in SE Ohio.. My first pregnancy, I'm due June 1st, I'm currently 14w4/5d [not sure anymore]  I heard my baby's heartbeat about two weeks ago, and i recorded it from a camera in my pocket :P All of my symptoms have loosened their hold on me, except the emotional/moodiness.. I get headaches every once in a while.. And i've only had 3 or 4 days of being really sick, and a few in between of just not feeling great.. hmm, I've had one u/s at 7.5 weeks...and I'm supposed to go back in.. Uhm, I think Dec. 13.. Not positive..i've got to take the test for spinal defects and stuff, because my partner had a baby brother die of spina bifida so we have to be sure. D:  the heartbeat at 7.5 weeks was 155 and at 11.5 was 165.. so everything seems fine so far. [:  so excited.Good luck to everyone and hope your pregnancy symptoms lighten up on you all a little. Hope everything is fine and healthy and all is well.=]",
            "post_id": "2186652",
            "timestamp": "1196908789",
            "user_id": "user_303803",
            "user_link": "/personal_pages/user/303803",
            "votes": "0"
        },
        {
            "answer": "hello i am also due on June 25th. my morning sickness is finally gone the only things that are bothersome are brest tenderness and slight cramping. Good luck to all.",
            "post_id": "2186872",
            "timestamp": "1196911802",
            "user_id": "user_290867",
            "user_link": "/personal_pages/user/290867",
            "votes": "0"
        },
        {
            "answer": "Ginny-  Its normal to be nervous in your first pregnancy, i am sure everything will be fine since you have had no bleeding or anything out of the ordinary.  I am on pregnancy number 2 and let me tell you......i am still nervous and paranoid LOLKstarr- My next appointment is on the 13th as well, it will be the first time we get to hear the heartbeat via doppler, so i am very excited.  I heard it for the first time at 8w2d via ultrasound and it was 163bpm.  I was sooo relieved.Miko-  I have been looking into buying a fetal doppler so that I can hear the baby's heart beat whenever I feel like it, and also to get rid of some of the nervousness I feel about wondering whether or not everything is ok.  Plus my fiance hasn't been able to hear it yet, b/c the appointment (my first) that he was able to get the time off to come to it was to early to hear it on the doppler.  This is his first so he has never got to expierence how amazing it is.Linzola-  Its so cool that we are due on the same day.  Is this your first?  I had horrible sickness for a good month and a half  and now i am down to throwing up once a day(which is a huge improvement) With my first my breast hurt so bad that i was in tears if i brushed them against something but this one has been very different they were only tender right after conception, I got symptoms right away and couldn't figure out what was wrong with me until a few weeks later I finally got a BFP, I got at least 10 BFN first and I was so certain I had to be prego.  I wonder if I will have a boy this time b/c its been so different.  With my daughter I was sick all day everyday for 4months and then on and off after that.....this one it was only like that for about 6 weeks.",
            "post_id": "2187916",
            "timestamp": "1196946669",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Thanks you guys - it definitely makes me feel better to hear that other people had the same anxieties and didn't get u/s until 18wks etc. I got a call from the doctor this morning saying that I can go in later today to hear the heartbeat as they got a new doppler, so fingers crossed! I'm very excited, although I'm hoping that there will only be one little heartbeat! :) Also - do you guys have any advice for feeling bloated/constipated (sorry if TMI)? Thanks!",
            "post_id": "2188265",
            "timestamp": "1196953338",
            "user_id": "user_38489",
            "user_link": "/personal_pages/user/38489",
            "votes": "0"
        },
        {
            "answer": "I feel bloated and constipated all the time I am not sure there is much you can do about it other then deal with it.  Wait till you hear that heartbeat! Its the most amazing sound in the world!  I just bought a doppler off ebay, brand new, $113.98, with free shipping, i can't wait till i get it!  I think i'll probably have it by monday I hope.  Everywhere else i look they were sooooo expensive and if i rented it off of one of the rental prices i would be paying more then i just did now to rent a used one for 6 months and now i will own this one brand new!  Now i will have it for all future pregnancies too!  As you can see i am VERY excited about this!",
            "post_id": "2188289",
            "timestamp": "1196953873",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Hi girls I'm in Utah and I will be 13 weeks tomorrow.  Due June 13th, which is Friday the 13th lol!  I still feel really crappy in the morning and at night. I am also tired all day.  This will be my 3rd baby and I'm hoping for boy but I think it's a girl.  Won't know for sure until January.  My dr also counldn't find the heartbeat, but my sister has a doppler and we found it the next day.  My next appt isn't until Dec 21. Good luck to all!",
            "post_id": "2188797",
            "timestamp": "1196960986",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "also are any of you feeling your baby yet.  I'm not sure if mine is gas or the baby.  I know I had to other pregnancies but they were 4 and 6 years ago and I can't remember when I felt them.",
            "post_id": "2188840",
            "timestamp": "1196961507",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "Friday the 13th, maybe that will be a good luck day for you now.  I just bought a doppler and i am so excited to try it when i get it!  Sometimes i think i feel the baby moving but i cant be sure, I am 11w1d, maybe its just gas.Does anyone else get killer heartburn?  I never had heartburn before until this pregnancy and it really hurts!  I wake up in the middle of the night with it and then have an even harder time sleeping.  I am soooo tired, but cant wait till next week!",
            "post_id": "2188880",
            "timestamp": "1196962002",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "this is my 4th and now that i know what i'm feeling the past 2 days i have started feeling little flutters (not many but a couple)!!!  i love it!!!  and i know its not gas this time!!!also, i haven't got heartburn yet but i know its coming!  i never get heartburn at any other time in my life other than when i'm pregnant.  it usually doesn't start for me though until late in the 2nd trimester.",
            "post_id": "2188988",
            "timestamp": "1196963361",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Im in california and 11 1/2 wks along due june 27th, this will be my first born I  have an appt on the 19th. and I cant wait to hear the heart beat and possibly see something.  I read that it is possible for you to feel the baby moving, but normally not with the first pregnancy. anyone having trouble sleeping, im tossing and turning all night, i just cant get comfortable, but i can nap during the day no problem. Im really happy i found this forum thanks everyone.",
            "post_id": "2189036",
            "timestamp": "1196963804",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "oh yes heartburn no matter what i eat!!!!!",
            "post_id": "2189043",
            "timestamp": "1196963878",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "Yea I am getting killer heartburn to, but i wake up at night with it, i dont usually get it when i am awake.  I cant sleep for c r a p!  It takes forever to fall asleep b/c I cant get comfortable and then i toss and turn alnight and wake up in the middle of the nigth with heartburn and cant get back to sleep.  I am sooooo tried, i hope i can sleep well tonight.  I need it.Jackie we are due only 2 days apart.",
            "post_id": "2189207",
            "timestamp": "1196966096",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "I never had heart burn before, and it sucks. and then trying to get back to sleep, forget it. Have you heard the heartbeat yet? I can't wait for that!",
            "post_id": "2189949",
            "timestamp": "1196976119",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "I felt my baby move last night. [=  and i didn't hear the heartbeat at the u/s but i saw it.. and no, i was wrong.. appt. on the 11th. i think it's funny when i get the two minute hiccups. or just a single hiccup.  any of you guys get it too?I really want a girl, but for some reason i have a feeling [even dream it] that it's a  boy.. but i'm still being hopeful. and what i do for heartburn at night is to put a pillow like, longways under my upper back, and one horizontally under my head, so that i'm propped up a little, it helps some sometimes.",
            "post_id": "2191303",
            "timestamp": "1197000498",
            "user_id": "user_303803",
            "user_link": "/personal_pages/user/303803",
            "votes": "0"
        },
        {
            "answer": "Wow there's alot of us June Mommas!! I'll be 13 weeks tomorrow and I thought I felt a very faint flutter coming from my stomach, but I'm sure it's too early to feel the baby at 12 weeks...but there are times at night when I'm lying down I can feel a faint feeling of the baby kick, but maybe it's just gas. But I don't ever remember feeling that way even before I was pregnant w/gas...who knows?  Maybe in a couple more weeks, what do you think??",
            "post_id": "2194571",
            "timestamp": "1197068242",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": "I felt mine at a little over nine weeks, of course i was pushing on my uterus and laying down, but still it's not too early. [: i've only felt it a couple times.",
            "post_id": "2194922",
            "timestamp": "1197075418",
            "user_id": "user_303803",
            "user_link": "/personal_pages/user/303803",
            "votes": "0"
        },
        {
            "answer": "I am 12 weeks and two day. I am so happy because so far everything seems to be going well after two misscariages this year. I have seen the baby and heard the heartbeat so I am little more realive. I have had baby bumps but I am not sure if that is the baby moving or is my imagination. I am stil not showing the sickness is gone thank god. Headeches have become and issue sometimes. My next appointment is December 17th",
            "post_id": "2194934",
            "timestamp": "1197075586",
            "user_id": "user_219836",
            "user_link": "/personal_pages/user/219836",
            "votes": "0"
        },
        {
            "answer": "well it wouldn't feel like bumps.. kind of like a small vibration at this point, really... if at all. but it's posible.",
            "post_id": "2195396",
            "timestamp": "1197085026",
            "user_id": "user_303803",
            "user_link": "/personal_pages/user/303803",
            "votes": "0"
        },
        {
            "answer": "i don't remember feeling movements this early w/ my first 2 but w/ my last one and this one (my 4th) i know its the baby.  its just a little flutter here and there, but its definately the baby!!!  :)my next appt is the 13th also (seems like a lot of appts that day!) and we have not heard the heartbeat yet either.  i've seen it twice but haven't heard it yet...  so this will be the first time... can't wait!also, yes... i have a bump (pooch) showing too.  i think with the more pregnancies you have the sooner you show!",
            "post_id": "2195462",
            "timestamp": "1197086560",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Jackie-  I heard the heartbeat at 8w2d via ultrasound, but i haven't heard it since.  My appoinment is the 13th as well so I should get to hear it then if I dont get the doppler I bought before then.  But i should have it today or tomorrow so i am looking forward to trying it out ASAP LOL.  I cant wait.I have a feeling I'll be using it alot LOL.  I'll be 12 weeks wednesday and i am now positive that it is not bloating, that i am actually starting to show, my pants are getting tight and uncomfortable at times.  So i am guessing that i will be in maternity clothes by the end of the month.  That seems about right actually, because I couldn't fit in my jeans with my first at 4 months and they say the more babies your have the quicker you show.Sometimes I am certian i feel the baby move but its so random, i cant wait till I feel it all the time, that is one of the best things about being prego.  I also can't wait till the heartburn goes away.  When does it usually go away, and do you think that it has anything to do with babies having a full head of hair?",
            "post_id": "2212240",
            "timestamp": "1197291199",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "I can't wait to hear the heart beat, i will feel so relaxed after that. I cant wait to feel the baby move, im so excited. I am also going today to get a doppler, although I dont think I'll be able to hear anything yet! but I know i'll be trying several times a day lol. yeah I am definatly showing, Its so crazy to see the change in m body, but im excited. Its amazing how everything you do changes once you know your pregnant.  I heartburn thing, i heard it depends some woman have it until 6 or 7 months and some it goes away a few weeks into the 2nd trimester. hopefully thats us lol, im having a hard enough time sleeping as it is without that.",
            "post_id": "2212704",
            "timestamp": "1197300792",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "Hey, how are you handling having a toddler and being pregnant! Im going craxy, i feel so tired all the time. and just drop after my tots in bed. I've been exercising everyday cause i heard that would help with the sleepness, but i dont think it does?",
            "post_id": "2212727",
            "timestamp": "1197301135",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "Its been tough, she just turned 2 friday and we had her party yesturday.....boy was I beat by the end of the day!  She is such a sweetie most of the time but the TERRIBLE TWO\"S are rearing their ugly head so that is making it a little more difficult.  Along with having a toddler I work fulltime and go to school at night, after dinner and bedtime, so i have just been EXHAUSTED.  Next semester i won't be taking as many classes LMAO.  I can't wait till its time for this one to come though, i am going to love matenity leave lol, I'll get to spend 8 weeks with my babes and it will be warm out LOL.  How far along are you?  you should be able to hear the heatbeat via doppler by weeks 10-12.  I would suggest looking on ebay and buying a brand new one as opposed to renting one or buying one from a babybeats or anything like that.  It is much cheaper through ebay.  I paid 113.98 after shipping it its brand new with a LCD screen that calcualates the heart rate and a speaker, gel, and you can ever hook up headphones or a recorder to it.  Most places that rent them are charging 25-30 a month, if you have it for 6 months that is 150-180.......for just 6 months.",
            "post_id": "2213244",
            "timestamp": "1197306600",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Wow, thats insane! I went to school full time and worked full time and finished thankfully, before we had our daughter, she'll be two in Feb. I was so exhasted then I cant even imagine doing all that now. Im a stay at home mom and im beat by the time she goes to bed at 7 then i just drop. I'm been working out everyday, thats supposed to help, and then chasing her around. I'm due June 27th, were so excited. I was going to check out this store over here that sales them, Im pretty excited about it! i can't wait, my drs appt is next wed. and they will do an ultrasound, I havent heard the heart beat yet, so. im trying to get out the door today to get the doppler. im Going to check online first though",
            "post_id": "2217853",
            "timestamp": "1197392583",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "I got mine in the mail yesturday.....its great and my fance was surprised and excited too.  I know i am crazy for doing as much as I do but someone has too. I want my kids to have a great life and I dont want to be stuck in a deadend job.  We are due on the 25th, only 2 days ahead of you LOL.  I was late with my first I am hoping that I have this one on time or a little early LOL I just want to meet him/her.  What are you hoping for?  I don't have much of a preference as long as its healthy but a boy would be nice even though i have all girl things.  Its crazy how close in age both are kids are going to be, the girls are only like 2months apart and our next ones will be a couple days to a week apart.",
            "post_id": "2217963",
            "timestamp": "1197394112",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Thats so exicting! I went to get mine, but they only had one that said hear between 20 - 21 wks, so im looking online now to buy one, i hope i can get express shipping, cause I just cant wait LOL. i think its great that you're going to school, I know how hard it is, It took me years to finish!  We are so excited as well and well be happy with either or boy or girl, as long as its a healthly baby!!!! but it would be nice to have one girl and one boy ya know, I'm pretty sure two kids is our max limit!!!!! so which ever one we are blessed. I know about the kids age, crazy!  i dont have any friends with young kids, my sisters kids are all grown the youngest are 9. having the toddler alone gives us so much in common lol, my daughter is the best desicion we ever made, she drives me crazy sometimes, but motherhood is so wonderful, I was actually planning on putting her in preschool so she could make friends, and i could go back to work, but then we found out about this one so we decided id stay home a few more years lol. can't wait for my doppler!!!!!!!!",
            "post_id": "2219603",
            "timestamp": "1197413879",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "LoL Skylynn will be enrolled in preschool for next year.  I should probably get on that because the waiting lists are rediculous.  She'll be just about three by then so hopefully it goes well.  Its definatly tough to do as much as i have been doing and be preggers but its so worth it.  And my daughter and I do all sorts of stuff together on the weekends.  She just met Curious George and Franklin the turtle at book readins we went to, SHE LOVED IT! She met Santa a couple different times and we went on a hay ride, and a little toy like train down main street, so even my weekends are crazy LOL.  This weekend I will be studing my butt off b/c i have exams Monday, tuesday, and wednesday....then i get a month off, which i am sooo excited about.  The doppler was the best choice, it gets ride of so much worry",
            "post_id": "2221629",
            "timestamp": "1197464035",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "update on my appt today...i heard the heartbeat for the first time but the nurse lost it after like 2 seconds!  they said the baby moved to the back of my uterus...  they did an ultrasound to see the heartbeat since they couldn't find it w/ the doppler again.  the heartbeat was 153!  and i got the see the baby once again.  :)also, when i am 24 weeks i have to transfer to another office and start seeing a new doctor b/c i am going to have to deliver my baby at the hospital downtown.  they said they just don't want to chance my baby being transported away from me again.  there is a 25% chance of it happening again (the hyperinsulinism), and w/ the protocol for the new baby i know its for the best.  but i wanted to cry when my doctor told me.  like i said he assisted w/ my 1st and delivered my 2nd an 3rd himself...  so we have come to trust him and the hospital staff there.... this really sucks!!!but anyways, my appt went good other than that news!!!hope everyone else's appt today goes well too!!!",
            "post_id": "2227688",
            "timestamp": "1197564205",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "I had my appoinment yesturday too.  I am 12w2d now, got to hear the heartbeat via doppler at first it was very faint and could almost not hear it b/c the baby was so far back, but then it moved and we were able to pick it up again and it had a strong heatbeat of 155-163bpm.  That was the quickest appoinment yet.  I peed in a cup, got weighed (which i lost more weight), heard the heartbeat and that was really it other then her asking how I feel.  took a whole 15minutes tops.  But she mentioned that when i come back next month we are going to schedule my ultrasound! So i am pretty excited about that.Glad your appointment went well!",
            "post_id": "2231601",
            "timestamp": "1197637552",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "i'm glad your appt went well too!  i went ahead and called my doctors office this morning and told them to go ahead and transfer my files to the new office b/c dh made me realize that it would be better for me to go ahead and start seeing him now to get to know him better before delivery and hopefully ease my nervouseness about delivering in a new atmosphere.  i know it will be fine it just still sucks!!!i am re-doing my 12wk scan next thrusday and hopefully we get to find out the sex of the baby...  she said she would probably be able to tell me...  i'll be 13wks 6d on that day...  i'm really excited.  but dh won't be there again :(     dang...  its like i always have good news then bad news!!!  but its ok...hope everyone else is doing good too!!!",
            "post_id": "2233109",
            "timestamp": "1197657480",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Hi everyone - I finally got to hear the heartbeat - 160 beats per min (doc said if I believe in old wives tales it could be a girl :)). I'm feeling better, and a little less sick, but still pretty constipated :( It was so cool though to think that there is another heart beating inside my body! Can't wait for my u/s which will be in about 5 weeks. Only thing that is worrying me is I went to a doctor for something unrelated and my blood pressure was up around 140/86 (norm is 120/78) but I was kind of feeling anxious that day. She took it again about five mins later and it was 136/84 so it was falling but it kind of freaked me out cause I really don't want to deal with high b/p this early in the game! Anyone else had an isolated elevated b/p reading? Should I be worried? Thanks and glad to hear everyone is hearing the heartbeat - what little miracles inside of us!!",
            "post_id": "2234300",
            "timestamp": "1197676190",
            "user_id": "user_38489",
            "user_link": "/personal_pages/user/38489",
            "votes": "0"
        },
        {
            "answer": "I had one highblood pressure reading and ever since then it has been normal.  I think it was because I was really nervous and anxious that day.  i think that you'll be fine, espeically now that you know there is a heart beat.  Congrats to everyone, I am glad that everyone is doing great.  I start my second trimester on Wednesday and I am soooo excited about it.  Time seems to be flying.  maybe its b/c its holiday time.  I get to schedule my ultrasound at my next appoinment which is jan 17th so if they schedule it for 4 weeks then I will find out the sex of the baby on Valentines day, how cool would that be.",
            "post_id": "2241785",
            "timestamp": "1197895904",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "Aww that would be so awesome. I cant wait to know!!!!!! My niece had a baby in October and they didnt find out what they were having and she had a girl and nothing pink to wear :(",
            "post_id": "2242244",
            "timestamp": "1197904962",
            "user_id": "user_354763",
            "user_link": "/personal_pages/user/354763",
            "votes": "0"
        },
        {
            "answer": "I live in Bridgeport, TX. I am 15 weeks this Wednesday, due June 11. Most of my symptoms have eased off. No more sore breast, nausea to a minimum (usually if I smell something yucky!) and I even seem to be getting my energy back. I still go to bed earlier, but I don't nap during the day like I used too. I would come home in the beging and go straight to bed and only wake up to eat. I am ready for the golden stage of pregnancy. I go to the Doctor tomorrow and we find out what were having! Hope everyone has a good pregnancy",
            "post_id": "2242938",
            "timestamp": "1197914151",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "awesome that you get to find out so soon!!!  hopefully i get to find out on thursday but i'll only be 13wks 6d that day.  but she told me she'd probably be able to tell by then.  if they hadn't have messed up my scehduling for my 12 wk scan i wouldn't be able to find out until my 18-20wk u/s would be scheduled.   oh i hope i get to find out this week...  i'm so anticipating it!!!!!!i think i have my moments when my enery level is getting higher but i can tell its definately not in the morning!!!  if i didn't HAVE to get out of the bed i wouldn't!  but when you have kids crawling all over you, you don't really have a choice, huh?  :)  i really need my energy to come back full force and soon!",
            "post_id": "2243025",
            "timestamp": "1197915432",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "LoL i don't think my energy has come back at all yet.  I am still so tired and wish I was able to nap, and sleep more.  No such luck.  I don't get a 12w scan b/c i had one at 8 weeks so i have to wait till my 18-20 week one before i can find out what we are having.",
            "post_id": "2243076",
            "timestamp": "1197916164",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        },
        {
            "answer": "So are you having a boy or girl?  My ultrasound isn't until Jan 15 what about the rest of the june mommies?",
            "post_id": "2304722",
            "timestamp": "1199307403",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "I will go Jan. 10 and get my ultrasound to see if it's a boy or girl.  I will be 18 1/2 weeks then, so hopefully they will get a good look.  I am due June 8.",
            "post_id": "2304815",
            "timestamp": "1199308270",
            "user_id": "user_297280",
            "user_link": "/personal_pages/user/297280",
            "votes": "0"
        },
        {
            "answer": "my next u/s is scheduled for Feb 1.  at my last u/s (13wks 6dys) the doc told me he was 80% sure it was a boy so we'll see what they say in a couple more weeks...  it would be really exciting though to have our first boy (we have 3 girls) b/c this will be our last pregnancy!",
            "post_id": "2314443",
            "timestamp": "1199462884",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Well, they postponed my u/s until Jan 10 due to the fact my insurance will only pay for two and I had one at my first apt. at 10 wks. So, next week is the big day. I will update everyone just as soon as we know. I'm so excited. I'm hoping for a girl, but will be blessed with either. How is everyone else doing?",
            "post_id": "2314633",
            "timestamp": "1199465115",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "its so exciting and nerve rackiing waiting for the u/s isn't it?!?!?!all in all, i'm doing pretty good...  i still get sick at night every so often still and that's pretty annoying.  and i'm pretty freakin stressed out right now, but not about anything pregnancy related...  just life!!!  i need to try and relax and have faith that God will take care of everything...  sorry for blabbing!!!if you're hoping for a girl have you picked out any names yet???",
            "post_id": "2314684",
            "timestamp": "1199465809",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "I sitll get morning sickness every now and again, but not as bad. Most of my symptoms have eased off. My breast aren't sore like they were, just HUGE....lol. I can relate to the stress thing. We have to have my deductible paid by my 7 mos, which is like a 2 1/2 mos away and I just found out that I will have to pay my Health ins. out of pocket while I'm off work. If I can get that under control I'll be okay.We have decided on a name if it's a girl...I'm so excited...We're going to name her after my Mom.Chere`e (after Mom) Desire`e (this is what I wanted for my 12 yr old, but ex-h said no)So do you have your son's name picked out yet? We haven't even thought too much about a boy name. I know Clark will be in there, after Grandpa.Keep me posted!",
            "post_id": "2314754",
            "timestamp": "1199466646",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "I am 4 months and just started to experience morning sickness constantly...So many ppl were like Oh it'll get better once you're past 3 months...HELL NO!! I started experiencing alittle bit of morning sickness at 3 months and now that I am 4, it's horrible...Well TODAY IS MY BIG DAY...I will be finding out the sex of my baby in approximately 5 1/2 hours, lol talk about a count down huh?As soon as I find out I will let you all know.",
            "post_id": "2314825",
            "timestamp": "1199467503",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": "yea... we have to have our's paid by our 7th month also.  that suck doesn't it?!?!  last time we had a HUGE mix up b/c i had switched docs offices in the middle AFTER we had paid our deductible and they were trying to tell us we owed more.  well, after many tears talking w/ the financial coordinator we did end up paying a little more but then got a refund check after delivery b/c we overpaid...  we told them so!!!  :)miko-  dude, that sucks!!!  i'm so sorry to hear that your morning sickness is just now on the rise when its supposed to be winding down!  i was sick w/ dd#1 and dd#2 for a really long time too.  but luckily dd#3 and my current pregnancy haven't been that bad.  do you have phenergan or somthing like it to take?  i hope you like ginger ale and crackers!!!  lol    i really hope you feel better soon...  and now i'm excited to hear what you're having so let us know what they say when you get back from the doc!!!!",
            "post_id": "2315089",
            "timestamp": "1199470457",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "How are you beautiful ladies doing? How many of us June Mommies know what were expecting? I found out on Thurs. were having a girl!!!Yeah! It's just what we both wanted...I just got a call from my nurse and she said my glucose test came back negative along with my urinalysis. She did say I need to push more fluids. I'm working on that right now.......Hope all of you are feeling beautiful today!",
            "post_id": "2359528",
            "timestamp": "1200323751",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "My u/s is tomorrow, but DH and I are disagreeing to find out or not. Some of have probably seen my post from a few days ago but I still don't know how to react to him.  Below is the post so I don't have get all upset again explaining what a jerk my DH has been.  I'm not mad anymore at him just confused on what to do.http://www.medhelp.org/posts/show/400693",
            "post_id": "2360478",
            "timestamp": "1200337907",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "I am 17 weeks tomorrow! Yeah! I find out the sex of the baby on January 22! I cant wait im so excited! I hope the baby is not shy! Good luck with your husbands and your decision! Men Are Pigs Sometimes!",
            "post_id": "2360614",
            "timestamp": "1200339360",
            "user_id": "user_290867",
            "user_link": "/personal_pages/user/290867",
            "votes": "0"
        },
        {
            "answer": "With my last baby, my sonographer, just sprung it on us at the u/s. Put on the spot, my husband said yes to finding out....Good luck!",
            "post_id": "2360639",
            "timestamp": "1200339707",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "I am now 18 weeks and 2 days...time flies...i remember just barely finding out that I was 4 weeks and 1 day...2 more weeks and I'm halfway through...how exciting...well I'm having a BOY!!! And I am very excited to meet my lil one. I still have my worries but I am hopeful!!",
            "post_id": "2360899",
            "timestamp": "1200343239",
            "user_id": "user_303706",
            "user_link": "/personal_pages/user/303706",
            "votes": "0"
        },
        {
            "answer": ":] I'm 20 weeks 1 day now, and i'm having a boy. Still due June 1st.congrats to all for making it this far. good luck, and good health, through the rest of your pregnancies, as well!!!",
            "post_id": "2361799",
            "timestamp": "1200358369",
            "user_id": "user_303803",
            "user_link": "/personal_pages/user/303803",
            "votes": "0"
        },
        {
            "answer": "i'm 17wks 4 days.  my u/s isn't until feb 1 so i have a little to confirm what we're having...  glad to hear everyone is well!!!",
            "post_id": "2361857",
            "timestamp": "1200359310",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "Just wondering how our June mommies are doing........It's not much longer. I'm so excited. A freind of mine had her baby Monday and I got to hold her yesterday. I just wanted to ball. That will be me soon. I can't wait.......",
            "post_id": "2635121",
            "timestamp": "1205355117",
            "user_id": "user_326590",
            "user_link": "/personal_pages/user/326590",
            "votes": "0"
        },
        {
            "answer": "getting more and more excited!!  It's only a couple of months away!!  I have to be a bridesmaid in a friends wedding may 19th.  Kinda worried about having the right dress size.  I am normally a 6, and ordered a 14, but I have popped out more than normal for me!!  Yikes!!",
            "post_id": "2635244",
            "timestamp": "1205356626",
            "user_id": "user_434240",
            "user_link": "/personal_pages/user/434240",
            "votes": "0"
        },
        {
            "answer": "I'm doing well, I have a dr appt this friday to do the 1 hour glucose test.  I can't wait to hold my little boy, I don't how to take care of a boy because I have 2 girls.  But we have waited so long for him.  If any of you have good ideas for names my ears are open, we can't agree on anything!!",
            "post_id": "2635477",
            "timestamp": "1205359715",
            "user_id": "user_278664",
            "user_link": "/personal_pages/user/278664",
            "votes": "0"
        },
        {
            "answer": "hi mommies...  i'm doing well, too...  just extrememly stressed out all the time!!!  but i am definately getting excited about june getting closer and closer.degriffdog- you know i've been telling my family the same thing you said...  i don't know waht to do w/ a boy after having 3 girls!!!glad to hear ya'll are doing good...",
            "post_id": "2636733",
            "timestamp": "1205378425",
            "user_id": "user_250155",
            "user_link": "/personal_pages/user/250155",
            "votes": "0"
        },
        {
            "answer": "After having one girl and then a boy my only advice is NEVER EVER leave ur mouth open while changing his nappy cause  even at 2 hours old my son had incredible aim!!! and my husband got it LMFAO!!! i cried so hard from laughing ... it took us about 3 months to work out ways to stop my son (cameron) from peeing all over us ... constantly ... hahahah boys r such a joy ... and girls r such angels .. oxoxox",
            "post_id": "2637381",
            "timestamp": "1205399666",
            "user_id": "user_313676",
            "user_link": "/personal_pages/user/313676",
            "votes": "0"
        },
        {
            "answer": "i am due 26th june still having very bad morning sickness , ive tried everything but it doesnt work, ive lost 1st 11lb upto now but my liitle girl is doing very very well(thats all that matters) im counting down now it wont be long before we meet her(im 24wks and 3 days) . im seeing my midwife this afternoon and i cant wait to hear my babys heartbeat and hopefully there will not be any protein in my urine again!. Ihope you are all doing well good luck to you all x",
            "post_id": "2637422",
            "timestamp": "1205401823",
            "user_id": "user_433680",
            "user_link": "/personal_pages/user/433680",
            "votes": "0"
        },
        {
            "answer": "hi everyoneI'm doing pretty well i just had another ultrasound yesturday...i was a test dummy for a bunch of students, but i got to see my little man again so it was worth it!  They made sure it was a boy, just in case and once again i was told \"he is a proud little boy\" he love showing off his stuff apparently LOL.  I recently found out i am anemic and i have to take iron everyday on top of the prenatals and calcium i take now, i feel like a pharmacy LOL.  Other then being exhausted, sore, and swollen i have been doing pretty well.  My sickeness lasted no where near as long with Isaiah(thats what we are naming him) as it did with my daughter Skylynn so i think thats why this seems to be going by so fast.Precious-I feel for you on the dress thing, i am getting married on May 17th, i'll be 35 weeks along by then LOL.",
            "post_id": "2637608",
            "timestamp": "1205409327",
            "user_id": "user_279415",
            "user_link": "/personal_pages/user/279415",
            "votes": "0"
        }
    ],
    "post_id": "2185597",
    "question": "hey i just wanted to see how everyone is doing.  Are your symptoms starting to go away, and others becoming more noticeable, andy baby bumps yet? What days are you due and where your from?I am due on the 25th and the my all day sickness has let up quite a bit, i am down to getting sick once a day.  The nausea still comes and goes, but i'd rather have that then getting sick ever 30 mins.  I have been super tired and been getting some pretty bad headaches but other then that i feel SO MUCH BETTER.  i am glad to be nearing the 12 week mark and cant wait.  I think that i am getting a bit of a bump but its kinda hard to tell.Anyway I hope everyone is good.",
    "timestamp": "1196891879",
    "title": "June Mommy's",
    "user_id": "user_279415",
    "user_link": "/personal_pages/user/279415"
}