{
    "answers": [
        {
            "answer": "Ess, it's pretty common for thyroid disorders to run in families, especially maternally. But I've never read of a significantly enhanced risk for MS as a result. There's just an association among family members for the thyroid autoimmunity.Someone else may have some different info.Bio",
            "post_id": "3081540",
            "timestamp": "1214405916",
            "user_id": "user_378497",
            "user_link": "/personal_pages/user/378497",
            "votes": "0"
        },
        {
            "answer": "Hi Ess,I did a quick scan of research articles and yes, there is a documented relationship of co-occurrence of autoimmune thyroid disease and MS.Specifically, MS and Graves disease (hyperthyroidism) have a strong correlation.  Hashimoto's disease (auto-immune hypothyroidism) have a weaker correlation.The reasons behind this are still not proven.  Some beliefs have to do with the activation of T cells in both MS and thyroid disease.    Others say that autoimmune thyroid disease occurs more often in MS patients who are on DMD's.  Other articles cite the fact that once the balance (homeostasis) of the immune system is altered, then the person becomes more susceptible to other autoimmune diseases.One study also mentioned that proximal muscle weakness (thighs), muscle aches, and fatigue, are common complaints in those with MS and thyroid disease.  So MS patients who complain of such symptoms should be tested for thyroid antibodies.Genetic susceptibility and environmental triggers are believed to be the cause of both diseases too.Also, there is a very strong documented connection between type 1 diabetes and MS!!!I could not find any mention of which disease comes first, only that autoimmune thyroid disease can occur together with MS in some individuals.Thanks for bringing up this correlation.  I will now be triple sure to take my D3 since I have Hashimoto's!!!!Elaine",
            "post_id": "3081675",
            "timestamp": "1214407821",
            "user_id": "user_251746",
            "user_link": "/personal_pages/user/251746",
            "votes": "0"
        },
        {
            "answer": "Thanks so much. This is very interesting. To me, and I'm sure to many others here.ess",
            "post_id": "3081704",
            "timestamp": "1214408141",
            "user_id": "user_315769",
            "user_link": "/personal_pages/user/315769",
            "votes": "0"
        },
        {
            "answer": "I have no first degree relatives with thyroid problems, but I do have two cousins (a brother and sister) that have had this since childhood.  No MS though.I have wondered generally about autoimmune diseases in families and about a genetic tendency to develop these kinds of conditions.  My mother has ITP - idiotpathic thrombocytopenic purpura - a condition of low blood platelets caused by antibodies of unknown origin.  I mentioned this to my neuro when he took my medical history but even though there is the commonality of both diseases being autoimmune, he did not find this to be significant in terms of any influence on my developing MS.I'd be interested if anyone knew of any research on this.  In fact I think I picked up a book on autoimmune diseases a while ago that I haven't gotten around to reading yet.  I'll dig it out and let you know if I learn of any interesting tidbits.db",
            "post_id": "3081760",
            "timestamp": "1214408934",
            "user_id": "user_382218",
            "user_link": "/personal_pages/user/382218",
            "votes": "0"
        },
        {
            "answer": "Interesting about the connection between MS and Type 1 diabetes.  There was a recent study that was mentioned on the news about the epidemiology of Type 1 diabetes.  It was the same as is said to be true for MS; that the farther away you are from the equator, the greater the risk of disease.  Thus the researchers feel that Vitamin D  seems to play a role in preventing Type 1 diabetes, as many think is true for MS.db",
            "post_id": "3081778",
            "timestamp": "1214409185",
            "user_id": "user_382218",
            "user_link": "/personal_pages/user/382218",
            "votes": "0"
        },
        {
            "answer": "Goodness, I forgot about my maternal grandmother, who had pernicious anemia (inability to absorb B12). I believe that was the ultimate cause of her death. I'm fairly sure that is an autoimmune disorder too. It's also an MS mimic. I've had my B12 checked several times and it's always been okay.Gosh, I guess we're just rife with this stuff.ess",
            "post_id": "3081993",
            "timestamp": "1214412486",
            "user_id": "user_315769",
            "user_link": "/personal_pages/user/315769",
            "votes": "0"
        },
        {
            "answer": "There was a piece on TV news just today about Vitamin D and its role in preventing heart disease. I'm thinking that the 400 IU/day thing will be rethought very soon.ess",
            "post_id": "3082003",
            "timestamp": "1214412601",
            "user_id": "user_315769",
            "user_link": "/personal_pages/user/315769",
            "votes": "0"
        },
        {
            "answer": "To clarify, there can be coincidence of thyroid autoimmunity and MS, but there is not a predictive correlation that if you have thyroid autoimmunity, you're at greater risk of MS, that I know. Autoimmunity or susceptibility to autoimmunity in general runs in families and especially in the women. That's why you'll find autoimmune disorders occurring as co-morbities or a flock of them in families.Bio",
            "post_id": "3082130",
            "timestamp": "1214414326",
            "user_id": "user_378497",
            "user_link": "/personal_pages/user/378497",
            "votes": "0"
        },
        {
            "answer": "You are right that pernicious anemia is an autoimmune condition and until you mentioned it I totally forgot that I was once told I had this!  I think it was my late teens/early 20's??  I was put on a high dose of iron and B12 and after a few months it was apparently rectified?  I wonder if it really ever was pernicious anemia since I don't believe I've ever had a problem since then.  My labs since have always been normal for this stuff.The old memory is sure starting to go.  Whoever thinks about getting copies of their medical records when you're young and overall pretty healthy?  It's a good idea though, never know what the future might bring and having documented history never hurts.db",
            "post_id": "3082313",
            "timestamp": "1214416984",
            "user_id": "user_382218",
            "user_link": "/personal_pages/user/382218",
            "votes": "0"
        },
        {
            "answer": "What an interesting discussion!  We have so many wicked-brilliant women on this forum!Thanks for your input, everyone!It would be interesting to hear from Siddy (?), because she has looked into the higher incidence of autoimmune diseases that tend to run in families.  I think it was Siddy!You may proceed.....I'll get out of your way,Zilla*",
            "post_id": "3082603",
            "timestamp": "1214420842",
            "user_id": "user_220917",
            "user_link": "/personal_pages/user/220917",
            "votes": "0"
        },
        {
            "answer": "Forward, MARCH!!Db, have you had your B12 checked lately? From what I recall, pernicious anemia isn't something you get over. (Is any autoimmune disorder?)My memory's going too. I now remember that pernicious anemia is rather highly correlated with hypothyroidism. Many people have both. So we're back where we started.ess",
            "post_id": "3082691",
            "timestamp": "1214421984",
            "user_id": "user_315769",
            "user_link": "/personal_pages/user/315769",
            "votes": "0"
        },
        {
            "answer": "I had it last checked several months ago, and it was fine.  I previously had it checked 2 years ago with the onset of the Lhermitte's.  GP said it is usually caused by MS, but sometimes a B12 deficiency.  Oh how I wish it had been the latter!  But no, B12 was fine.  That's why I wonder whether the original dx was even accurate, since my levels have apparently been fine since, and my intake of B12 and iron has been sporadic over the years.",
            "post_id": "3083555",
            "timestamp": "1214434893",
            "user_id": "user_382218",
            "user_link": "/personal_pages/user/382218",
            "votes": "0"
        },
        {
            "answer": "Great thread!My handbook of MS lists Thyroid disease, along with Type I Diabetes, Psoriasis, Sjogren's Syndrome, Inflammatory Bowel Disease and Hyperandrogenism.Now this is where I need the help of Biowham, Jen and anyone else who has a knowlegde of statistics, genetics and epidemiology.  I have never gotten all the terminology straight.  I am going to post sme statistics and statements.  I would like you guys to put it in clear EnglishTitle of Table - \"Co-Occurence of Multiple Sclerosis with Other DiseasesHyper-androgenism - Significantly more common in MS patients than in controlsInflammatory Bowel Disease - Increased Expression in MS patients (?) (small studies)Type I Diabetes - Prevalence (?) in MS subjects 3 X that in their healthy siblings(P=0.001)and 5 X the rate in the gneral population (P=0.0001)Note: the following are all different studies on co-occurence of MS and thyroid disease:Thyroid disorders (type not specified) - 3 X more common in MS (females only studied)Autoimmune Thyroid Disease (Grave's) - Excess risk in first-degree relatives of probandswith MSAutoimmune Thyroid Disease ATT (unpsecified) - Higher prevalence of ATT in male MSpatients (9.4%) than in controls (1.9%); P=0.03  no significant difference in femalesPresence of +ANA and Antithyroid autoantibodies (ATAbs) - Frequency of ATAbs inopticospinal (OSMS, neuromyelitis optica, Devic's) MS higher than that in non-OSMS(P=0.007), but that of +ANA similar in each group.Sjogren's Syndrome (SS) - 3 - 16 X (!!!) more common in subjects with MS.  SS canmimic MS (diagnoses may have been confused)Psoriasis - Subfroup of MS patients with a first- or second-degree relative had early (<16)MS onset.****************************I can provide the references for these if needed.  This book is a couple years old.So, you guys that understand prevalence versus incidence and P values are invited to interpret the findings above.Quix",
            "post_id": "3083840",
            "timestamp": "1214439747",
            "user_id": "user_147426",
            "user_link": "/personal_pages/user/147426",
            "votes": "0"
        },
        {
            "answer": "Hashimoto's and the antibodies were known about in the 70's.  I learned about them in med school.Q",
            "post_id": "3083841",
            "timestamp": "1214439812",
            "user_id": "user_147426",
            "user_link": "/personal_pages/user/147426",
            "votes": "0"
        },
        {
            "answer": "Hi, Quix--Quicky interpretation is that having MS means likelihood of other autoimmune comorbidities (are there any ORs given? because that would speak to risk) for having some of these other things, which I knew, but I can't recall reading any studies--and I just edited an ENORMOUS thyroid review--finding a greater risk of MS with these other things.Now, prevalence means how many you find at a given snapshot in time when you do a count. So, that could be people who had it two years ago, last year, and this year, all counted. Incidence means the ones who turn up with it at repeats of those moments in time, i.e., every year (or person-year), you check how many new cases of something there are, and that's the incidence rate over that period of years. Cumulative incidence are the new cases that arise during one increment of your time period, i.e., in a single year. If you just count the number of cases that exist that year, whether new or not, that's the prevalence. I'm closely involved with autism, and people consistently mis-cite the prevalence rate as the incidence.So, if you look at a population of 100 people and 10 of them have MS, the period prevalence in that population is 10%. But if \"only\" five of these are new cases for that time period, then the cumulative incidence for that year is 5%. If last year, the cumulative incidence was 3%, the incidence rate over two years has gone up 2%. But the period prevalence might have stayed the same, depending on whether or not some members of the population died or something.For the things in your table:Hyper-androgenism - Significantly more common in MS patients than in controls###--among an MS population vs a non-MS population, there is more hyperandrogenism. I could see why that would be, given possibly pituitary/adrenal involvements. The chicken (MS) precedes the egg (hyperandrogenism) here.Inflammatory Bowel Disease - Increased Expression in MS patients (?) (small studies)###--first, the little studies are always troublesome, but again, this means in a snapshot of an MS population vs a non-MS population, a larger percentage of the MS pop will have IBD compared to the non-MS pop. Again, given neurosignaling issues to the gut, I could see why this would be. Again, chicken precedes egg.Type I Diabetes - Prevalence (?) in MS subjects 3 X that in their healthy siblings(P=0.001)and 5 X the rate in the gneral population (P=0.0001)###--these P values are highly significant, meaning the probability that this is just an accidental random-act-of-nature finding is very small. This refers to prevalence, so that means just looking at diabetes in a population--not new cases, just overall--the MS pop has far more than the healthy-sibs pop, three times more; and it has 5 times more than the general pop, overall. Chicken/egg? I think these are probably both chickens--i.e., a tendency to severe autoimmune problems.Note: the following are all different studies on co-occurence of MS and thyroid disease:Thyroid disorders (type not specified) - 3 X more common in MS (females only studied)###--comparing an MS to a non-MS pop, there's more thyroid disorder among the MS pop. I'm seeing two chickens here, but this only means that when you look at MSers, you see more thyroid issues, NOT that thyroid issues are a risk factor for MS. Any studies on what happens when you look at a population of people with thyroid autoimmunity? What are MS rates?Autoimmune Thyroid Disease (Grave's) - Excess risk in first-degree relatives of probandswith MS###--here you seem to be looking at heritable autoimmune problems. A \"proband\" is the person being examined/investigated. So, a person who has a first-degree relative (mom, dad, sib) with MS is at a higher risk for Graves (the hyper- one, protruding eyes, etc., that the senior Bush family has). Again, this is a co-morbidity association, not a chicken-egg finding. I wonder what \"excess\" is. This one's kind of interesting to me because I have a *second-degree* relative with MS and no longer have my own thyroid because of autoimmune issues (Grave's).Autoimmune Thyroid Disease ATT (unpsecified) - Higher prevalence of ATT in male MSpatients (9.4%) than in controls (1.9%); P=0.03  no significant difference in females###--this is interesting because it differs in terms of women from the findings described above--i.e., in this second study, among women with MS, there's no more thyroid disease than among women without. And the study as found a significantly (any P value less than 0.05, which means a 5% chance it could just be random and not meaningful, is \"significant\" unless the stats are more complex)--found a significantly higher percentage of ATT in the male MS group compared to the male non-MS group, ~10% vs. ~2%, or about five times higher, which is similar to that 5X rate in the Type-1 diabetes group above. A co-morbidity finding, not a chicken-egg. I know that with autoimmunity, there can be comorbid manifestations of it.Presence of +ANA and Antithyroid autoantibodies (ATAbs) - Frequency of ATAbs inopticospinal (OSMS, neuromyelitis optica, Devic's) MS higher than that in non-OSMS(P=0.007), but that of +ANA similar in each group.###--again, some significant (or nearly so with p = 0.07) findings, and again, MS is the risk factor, rather than the other way around. Does anyone know of any studies of people with thyroid autoimmunity and incidence or prevalence of MS that develops later, or comparisons of the timing?Sjogren's Syndrome (SS) - 3 - 16 X (!!!) more common in subjects with MS.  SS canmimic MS (diagnoses may have been confused)###--again, MS is a co-morbidity with SS, much like the thyroid findings above.Psoriasis - Subfroup of MS patients with a first- or second-degree relative had early (<16)MS onset.###--I wonder what the subgroup was. Must have been age, given the \"early onset\" criterion. No further data?Bio",
            "post_id": "3087631",
            "timestamp": "1214513693",
            "user_id": "user_378497",
            "user_link": "/personal_pages/user/378497",
            "votes": "0"
        },
        {
            "answer": "Hmmm...I see you are looking at it more from a causal standpoint.  That's interesting.  My reading seems to indicate that the co-occurence of MS and AI diseases result from similar problems in the immune system and sometimes similar susceptibilities.  These susceptibilites may be genetic or environmental like Vit D.  So that is how I always looked at it.  If you were \"all set up\" for one of these, then you had the internal environment to have one of the others too.How does that sound to you?Quix",
            "post_id": "3087882",
            "timestamp": "1214517597",
            "user_id": "user_147426",
            "user_link": "/personal_pages/user/147426",
            "votes": "0"
        },
        {
            "answer": "Pernicious Anaemia also related to Celiac.  Celiac (gluten intollerance) is also more often found in people with other autoimmune conditions.It is also possible to have celiac without obvious GI (gastrointestinal symptoms).  Celiac can have neurological consequences and should be ruled out as a possible mimic for MS.All these things interrelated likely becuase they are all results of an immune system that is out of wack!S",
            "post_id": "3088120",
            "timestamp": "1214521878",
            "user_id": "user_231441",
            "user_link": "/personal_pages/user/231441",
            "votes": "0"
        },
        {
            "answer": "Hi Quix--\"My reading seems to indicate that the co-occurence of MS and AI diseases result from similar problems in the immune system and sometimes similar susceptibilities.  These susceptibilites may be genetic or environmental like Vit D.  So that is how I always looked at it.  If you were \"all set up\" for one of these, then you had the internal environment to have one of the others too.\"That's what I mean when I say some things are both chickens...if you're prone to autoimmune problems (either because of genetics or environment or both--I don't actually separate them into categories given the constant interaction between the two), then you're gonna have a lot of autoimmune co-morbidities (chickens, in other words; sorry for the bad analogy, but I started with it, dammit, and I'm gonna keep it). The only causal ones I see (where MS would be the chicken and the disorder would be the result of it, or the egg) might be the IBD or the hormone disruptions, given the neurological contribution to both systems. I mean, I could see disrupted signaling to the bowel becoming a problem in that regard, for example. Doesn't mean it would have to be that way, but if it were, then MS would really be a \"risk factor\" for those things. Right?This is just an anecdote, but it fits with what the literature (and you) say: I at least have (had) a thyroid autoimmune problem that came suddenly to a crisis a year ago. I've also had two episodes of preeclampsia/toxemia, which is AI related (they seem to think). I also have IBD (in addition to a nasty large adenoma that is now gone). I have RSD/CRPS1, which is certainly related to cytokine expression and immune response and thus next door to AI, at least. My paternal grandmother has MS (PPMS). My mother has asthma and thyroid issues; my maternal grandmother and great-grandmother have/had thyroid issues. Looks like I don't stand a chance, eh? Luckily, I have three boys and their sex makes AI troubles generally less likely. Obviously (or it seems so to me), we've got a bit o' the AI in the family gene pool.I do know, thanks to the GI problems, that I do not have celiac disease.Bio",
            "post_id": "3088301",
            "timestamp": "1214524552",
            "user_id": "user_378497",
            "user_link": "/personal_pages/user/378497",
            "votes": "0"
        },
        {
            "answer": "Somehow, I lost this thread.Inflammatory Bowel Disease is different from Irritable Bowel Disease.  They both go by IBD and that always got me confused.Inflammatory Bowel Disease is made up of diseases like Ulcerative Colitis, Crohn's Disease, and Celiac Disease, and a few others.  These are what would have a higher expression in persons with MS.  I think they are co-ocurrences rather than one having a causal relationship with the other.Sorry for the misunderstanding.Quix",
            "post_id": "3111527",
            "timestamp": "1215043613",
            "user_id": "user_147426",
            "user_link": "/personal_pages/user/147426",
            "votes": "0"
        }
    ],
    "post_id": "3081416",
    "question": "I know that people with one autoimmune disorder are more likely than the general population to get another, but I'm wondering if there are any recent studies on this. Specifically, of course, about MS, and also just about MS and thyroid diseases.I have been hypothyroid for many years, and back in the day, no one said diddly about Hashimoto's or autoimmune diseases. However, that may well have been before these labels were even devised. I know it's not possible now to find out whether my kind is Hashimoto's, because ultimately the antibodies stop producing.. 'Ultimately' occurred long ago for me.However, subsequent to my diagnosis by a lot of years, a surprising number of relatives have also been diagnosed with thyroid disease, in generations both above and below me. There are 3 with definite Hashimoto's, and one with definite Grave's disease. Two others are also suspect for Grave's. This clearly comes through my mother's line of descent.What I'm wondering is whether these family members, given this strong gene thing, are at a significantly greater risk than most for MS. As far as I know, no one else has or has had any other autoimmune disorder.This is just a question and I'm not alarmed or anything, merely curious. I know others here have family members with thyroid problems, and also, of course, they do too.ess",
    "timestamp": "1214404365",
    "title": "More thyroid stuff",
    "user_id": "user_315769",
    "user_link": "/personal_pages/user/315769"
}