{
    "answers": [
        {
            "answer": "Hello Beth, My name is Amber.  I was diagnosed with NCS when i was in the Army.  I know exactly what you are going through.  I did get pregnant (despite my cardiologist views) and did have a beautiful daughter.  Now there were complications.  I couldn't really take a large dose of medicine and it makes my syncope 4 times worse.  I always had the fear that I would faint and land on my side and hurt the baby.  First thing they will did is label me a high risk pregnancy and i delivered in Maternal Fetal Medicine in University of Colorado Hosp. in Denver.  They were a great team.  They really suggested that I get an epideral to keep me calm and to control the pain from exacerbating my condition.  My heart rate and blood pressure had some problems but both of us were able to pull through.  My doctor and OB now tell me that I really can't take a risk again and that I should be blessed with the one i have so i won't be having anymore (unless i'm stubborn enough to not listen again).  I hope this answered your questions.",
            "post_id": "2376694",
            "timestamp": "1200631249",
            "user_id": "user_391639",
            "user_link": "/personal_pages/user/391639",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with NCS when I was 16 and havent fainted since then But I know my limits. I got pregnant when I was 24 and have an 18 month old now. MY NCS got 100 times worse during pregnancy. I spent many times in the hospital with IV's because my blood pressure would get so low. I probably shouldnt have another one but my husband and I are going to try the end of the summer. The labor and delivery I was really worried about but that was the easy part. I did get dizzy towards the end of pushing but overall I did fine. My only advice is to make sure you are well hydrated drink drink drink drink drink. It was hard for me because I was so nauseous all the time but keeping hydrated is the best thing for u.",
            "post_id": "2600939",
            "timestamp": "1204732675",
            "user_id": "user_440452",
            "user_link": "/personal_pages/user/440452",
            "votes": 0
        },
        {
            "answer": "I  AM 29 YRS OLD AND I RECENTLY FOUND OUT THAT I HAVE NCS. I HAVE 3 CHILDREN AND DURNING ALL THREE PREGNECY I PASSED OUT AND HAD IVS FOR THE FIRST 5 MONTHS OF ALL PREGNECY.I HAVE BEEN DEALING WITH NCS FOR 10 TEARS NOW BUT NEVER SEEN A DOCTOR FOR IT TIL JUST RECENTLY.MY OLDEST WHICH IS 11 YRS OLD HELPED ME ALOT WHEN I WOULD PASS OUT. I THINK WITH  THE RIGHT DOCTOR EVERYTHING SHOULD GO FINE.GOOD LUCK!",
            "post_id": "2691395",
            "timestamp": "1206478704",
            "user_id": "user_460623",
            "user_link": "/personal_pages/user/460623",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with NCS after I had my daughter.  I have had it all my life (obviously), but only until my 20's have I experienced the symptoms of chest pain and shortness in breath.  My pregnancy though was symptom-free.  I felt my best when I was pregnant.  This is because you have \"more blood\" when you are pregnant, therefore your blood pressure increases naturally during that time.  You HAVE to maintain adequate hydration at all times.  The only thing I do at this point, is take salt tablets.  Could you tell me about those meds that you say help you the most?? I would be interested in trying them.  Good luck to you.",
            "post_id": "2760049",
            "timestamp": "1207781584",
            "user_id": "user_475850",
            "user_link": "/personal_pages/user/475850",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with NCS when I was 23.  I have never taken the beta-blockers that were prescribed to me because I know how to prevent the \"episodes\".  For me, getting at least 7 hours of sleep, staying well hydrated, and eating meals on time (I have hypoglycemia also) will prevent the episodes.  Now I am 27 and pregnant.  I also had major low blood pressure issues during the first 4 months of my pregnancy.  The issues resulted in my asking for a \"medical/maternity\" leave from work, hospital visits (IV), and working through dehydration all of the time.  I am 33 weeks along now and everything is going well though!!!  I was wondering if anyone would recommend the epidural during labor...considering that it lowers blood pressure...",
            "post_id": "2839575",
            "timestamp": "1209412441",
            "user_id": "user_493402",
            "user_link": "/personal_pages/user/493402",
            "votes": 0
        },
        {
            "answer": "Thank you for your comment.  I was wondering if you could elaborate on the statement, \"my heart rate and blood pressure had some problems\".   I think it is interesting that the medical staff thought it would be a good idea for you to have an epidural since one of the most common risk factors is lowering blood pressure.  Would you please explain this more to me?",
            "post_id": "2839608",
            "timestamp": "1209412928",
            "user_id": "user_493402",
            "user_link": "/personal_pages/user/493402",
            "votes": 0
        },
        {
            "answer": "I have had NCS since I was 3 but not diagonsed until I was 21.  They tried me on beta blockers with not luck so I quit them.  My triggers are nausea, vomiting and heat.  I have just finished my 1st trimester of pregnancy and have had 3 episodes of fainting and convulsing.  I'm deathly afraid of continuing my pregnancy and dread what delivery will bring.  My episodes in pregnancy seem random to me.  I was very encouraged by the fact that there are others of you with this condition, thought I was alone.  I would love to hear any other ideas as to try to prepare myself for what is ahead and maybe get to enjoy this a little.",
            "post_id": "3613166",
            "timestamp": "1225771731",
            "user_id": "user_671347",
            "user_link": "/personal_pages/user/671347",
            "votes": 0
        },
        {
            "answer": "My name is Heather and I am 35 years old.  I have a wonderful 38 month old daughter.  I have been diagnosised with NCS, after the birth of my daughter and I have a ton of other medical issues from a 10 year old car accident.  I was on 300mg of inderal (bata blocker) but have since stopped since that is a high dose for a person of a 100 pounds and my kidney and liver functions started to suffer.  Plus these drugs are not pregnancy approved.  I went to the OB to see if I could have a second  child and I was stunned by the response.....\"adopt.\"  The OB's reasoning was that I would be on bed rest and I was high risk the first time and deliveres 6 weeks early.  Plus, I sent additional 9 days in the hospital post labor.  Due to spinal swelling I am not allowed any labor drugs or epidurals.  I lost alot of blood and close to passing out a few times during my labor, which luckly was only 3 hours long from strat to finish.  I know there is dangers to the mother has anymone heard of the fetus getting lack of oxygen during these attacks, and has anyone had a child that has suffered injury due to the condition?  My doctor said it was a much higher risk then a non NCS pregnanc and that the fetus could receive brain damage from lack of oxygen.",
            "post_id": "3640717",
            "timestamp": "1226352145",
            "user_id": "user_678025",
            "user_link": "/personal_pages/user/678025",
            "votes": 0
        },
        {
            "answer": "I am 31 years old and started experiencing symptoms at age 13 and had a blackout event every few years and I was almost always standing.  I thought I had low blood sugar until it happened a few hours after lunch years back.  My family docs. ran all the tests and never diagnosed anything.  Then when I was 29 I blacked out sitting at a table in a Panera Bread and I was kinda freeked out and wordied about driving risks.  My new family doc referred me to the cardiologist and I tested positive on a tilt table test after 3 minutes.  They prescribed low dose betta blockers, but I never took them because my events were not very frequent.  However, I am 20 weeks pregnant and I had an event during work this week and now I am wondering if I should be cocerened.  I was well hydrated and ate something 30 minutes earlier.  My first trimester I spent many mornings laying down b/c I was too dizzy to get up and I had trouble getting enough food and fluids due to morning sickness.  Any suggestions??? My OB didn't seemed concerned when I told her that I had low blood pressure issues during our first visit.  If I am able to manage okay through pregnancy, should I be concerned about delviery????",
            "post_id": "3672892",
            "timestamp": "1227022838",
            "user_id": "user_686533",
            "user_link": "/personal_pages/user/686533",
            "votes": 0
        },
        {
            "answer": "THANK GOD there are others like me, im 18 years old and on xmas day 2008 i found i was pregnant, and since then i have had alot of fainting spells[ i used to get them four-five times a week ] but now i get it CONSTANTLY , i was diagnosed with NCS about  a week ago and they said that the way things are now, it will only get worse, they really want me to be on permanent bed rest and told me that i should not risk getting pregnant again after this child, will i try to get pregnant? no..but if it happens, ill face every challenge again... im due september 1st of 09 and i cant wait for the day to come when i can meet my beautiful child",
            "post_id": "4045502",
            "timestamp": "1235980776",
            "user_id": "user_780999",
            "user_link": "/personal_pages/user/780999",
            "votes": 0
        },
        {
            "answer": "I am 30 years old and I was diagnosed with NCS around the age of 24.  I was symptomatic at about ten years old but everyone blew me off until I got older and really started to complain.  I have two children nine years apart and I am expecting another in January of 2010.  My first time around my pregnancy and delivery were pretty uneventful even with an epidural that did not work.  I was not so lucky with my son who is now almost two.  I was told to NEVER get pregnant again but oops...During my last pregnancy I experienced preterm labor at 31 weeks and was put on bedrest I had my son three weeks early.  The delivery was a nightmare I tried another epidural and it did not work again so the doctor moved it.  As soon as it was moved my blood pressure, heart rate and oxygen bottomed out.  I kept passing out and they would bring me back long enough to push and I would get one push out and out I would go again.  I am very afraid this time, I have been taken off all of my meds and I am symptomatic but it is not real bad yet although my first few weeks off meds were bad.  I am so scared and nervous about this pregnancy but more so about my delivery.  I have seen three doctors to this point because I was labeled high risk then told I was not high risk but rather high maintenance.  My NCS is considered a \"complex problem\" so no doctor wants to take me on.  If anyone has any advice that would be great.",
            "post_id": "4682091",
            "timestamp": "1248200677",
            "user_id": "user_976719",
            "user_link": "/personal_pages/user/976719",
            "votes": 0
        },
        {
            "answer": "Hello All. I am 33 weeks pregnant and have just been diagnosed.  (Although we are still waiting on the tilt table test which can't be done while pregnant). During my first pregnancy I experienced symptoms which I thought were bad...but have realized in this second pregnancy that I was lucky then. I see a high risk OB, a pulmonologist, and a cardiologist. I pass out several times a day. Experience blood pressure as low as 60/40, a heart rate as high as 161, and my pulse ox hovers around 85% causing me to be on oxygen. Our baby has stopped growing due to the lack of oxygen I experienced for 30weeks before we could get a doctor to take us seriously. (We go in a gain Oct. 5th to have him measured). We will NOT be having anymore children. My husband actually gets his vasectomy this Friday. This has been a terrifiing conditoin for me. I am scheduled to deliver via C Section (which was bumpy with my daughter). I have extreme anxiety about dying.",
            "post_id": "4892461",
            "timestamp": "1253539796",
            "user_id": "user_1047113",
            "user_link": "/personal_pages/user/1047113",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with NCS when I was 19 (passed out in 7 minutes on the tilt table) ; I am currently 28. My husband and I are moving towards getting pregnant. I say moving towards because, with NCS, it's gotta be planned.Prior to our pregnancy plan, my doctor has had me on 30 MG of Adderall XR (the ADHD drug) a day which is combined with 5 MG of Proamatine every 3-4 hours. I cannot tell you what relief these medications bring. I am able to get up and go to work (as a teacher) and function at a normal level on a daily basis. My doctor's name is Blair Grubb and he is connected to Toledo University's College of Medicine. He is an expert in the autonomic dysfunction field and is simply a genius (He has patients coming to him from other countries-- that's how good he is).Dr. Grubb ,and his cohorts, did a controlled study on pregnant women who have NCS. They found some amazing things and have published an article: \" Outcomes of Pregnancy in Patients with Preexisting Postural Tachycardia Syndrome\". It was published in the PACE (Pacing and Electrophysiology section, Division of Cardiology, Department of Medicine, University of Toledo Medical Center, Toledo Ohio. Published in August 2009, volume 32). They studied 22 pregnant women: during the course of study symptoms remained unchanged in 3, improved in 12, and worsened in 7 patients. All women completed their pregnancies with limited to no complications. The major medications of the study were beta-blockers, midiodrine, SSRIs, fludrocotisone, and combinations of the medications.I encourage all of you to have your doctors find this article.Currently, I am stepping down off of the Adderall (not safe during pregnancy), and modifying my medications. I have a high-risk OBGYN who is willing to work with Dr. Grubb, my husband and I, and our future little one. According to both my OBGYN and my cardiologist, there is no reason to avoid pregnancy and it is a workable situation.I wish all of you luck. I know it is incredibly frustrating and discouraging.",
            "post_id": "5103658",
            "timestamp": "1258832244",
            "user_id": "user_1115909",
            "user_link": "/personal_pages/user/1115909",
            "votes": 0
        },
        {
            "answer": "i have this same problem just found out about a month ago.... found out i was pregnant 2 wks. later ... but ive been having the problem for yrs. (blackouts etc.) and they (doctors) all kept telling me it was just how my body handle my pregnancy .... but it was going on longer than that just got worse when i was pregnant i have 2 other children and with them i spent most of my time in the hospital or on bedrest because they didn't know exactly what was going on. With my son (my oldest) i had 3 actual blackouts the rest were sever light headedness with the one blackout i was in the hospital for 2 wks because i was home by my self and ended up hitting my head off the porcelain tub when i fell over i was about 7 mnths preg. and my daughter i had just had a lot of over night stays i made sure i had someone home with at all times when i was preg. with her i had more blackouts with her but they weren't as severe. So your best bet is to make sure you always have someone with you drink plenty of water and rest.",
            "post_id": "5143317",
            "timestamp": "1259943778",
            "user_id": "user_1128341",
            "user_link": "/personal_pages/user/1128341",
            "votes": 0
        },
        {
            "answer": "I have been diagnosed with NCS and am nine weeks pregnant. I was hospitalized yesterday for a fainting spell and the doctors tell me to eat a small amount every 2 hours and to drink a glass of water every hour but i'm still very weak.  I'm terrified that my baby wont make it. I have had a miscarriage before so if this baby makes it, it will be a miracle. Best of luck beth! Does anyone know of any good doctors that specialize in this?",
            "post_id": "5244218",
            "timestamp": "1262900282",
            "user_id": "user_1163881",
            "user_link": "/personal_pages/user/1163881",
            "votes": 0
        },
        {
            "answer": "I am 30 and was diagnosed with NCS 10 years ago.  I took ProAmatine and Florinef for about 2 years then threw them all out.  I was tired of the strict regimen for the meds and they weren't approved for pregnancy.  I made the commitment to drink more water and to eat a snack if I was getting hungry.  I often eat a small snack at bedtime.  Studies have shown that water intake raises blood pressure, which is the goal for anyone with NCS.  For me this has reduced my episodes to almost none at all.  My doctor didn't see any problems with pregnancy.  Our first was an early miscarriage,  It took 4 years to get pregnant again (DH did have testicular cancer and chemo during this period) and we now have a wonderful 2 yr old.  My doctor treated the pregnancy as high risk but felt I could have an epidural.  I refused.  Labor was less than 5 hours.  We have since had another miscarriage but are expecting a little girl in 3 months.  If I do have an episode it is almost always early morning and I didn't eat a late night snack or during the day and I realize that I haven't had very much water that day.  Best of luck!",
            "post_id": "5249192",
            "timestamp": "1263009941",
            "user_id": "user_1165676",
            "user_link": "/personal_pages/user/1165676",
            "votes": 0
        },
        {
            "answer": "I am currently 35 weeks pregnant with my second child. I started with symptoms in my teen years and was diagnosed when i was 19. I have NCS but they had a hard time deciding if it was POTS or NCS. I have a small mitralvalve issue. With my daughter my condition improved the longer i was pregnant the more 'normal' i felt. More energy, normal BP, less fainting.Early on i fainted alot. Then for the first time ever i had high blood pressure. During my first go round i was on salt tablets to increase my BP as the BP normalized they lowered my dose but when i went high i had to stop the salt and drink a liter a day of Gatoraid, and other drinks. i got hugely bloated and had a csection at 37 weeks my BP was 197/100 right before they got my daughter out.This time around with my son i have had a much better time of it. Two or three fainting spells early on but since then other than unrelated gallbladder issues much easier. I have had some spells (palpatations and just icky days). I would say that managing stress, fluid intake, getting your meals worked out that will help alot. With the meal thing remember that if you eat too much at once t can cause blood to pol in your digestive track. I found that not eating often enough or toom much at once really sets me off when pregnant.I am really wondering about Labo and delivery we are trying for VBAC this time and i was wondering if anyone had advice during the actual labor and delivery. I have to have an epidural because of the previous c-section in case of rupture. I would like to say that the c-section was a hard recovery because of the NCS. I lost a lot of fluid quickly and the drugs messed with me. We just don't heal as fast as others.",
            "post_id": "5331685",
            "timestamp": "1265067200",
            "user_id": "user_1196394",
            "user_link": "/personal_pages/user/1196394",
            "votes": 0
        },
        {
            "answer": "Am 28 and was diagnosed with NCS in 2008...would have been sooner but after an EKG, Echo, CT, etc. I thought it was related to stress or migraines.  After having an intense episode while seated and giving a training session for my job, I decided that I needed to find out what was causing my fainting.  I've tried beta blockers (metropolol sp?) and another that I can't remember the name of...back in the beginning of 2009 but then had several episodes while on the medications.  Considering the side affects of the meds (angina, heart palpitations) I decided that it made more sense to manage it myself without feeling so terrible (extremely tired/increased chest pain).  My syncope seems to be more infrequent than some others that have posted - have not had a full episode in 6 months but may also be due to avoiding my triggers.  I have a friend with vasovagal whose syncope seems to come on much faster than mine so it may depend on each person.  For me it's definitely feeling naseous, palms start to sweat and then when I'm close to fainting my vision is messed up (pixelated is probably the only word I have to describe it...I can see a word and identify the letters in the word but I can't tell you what the word is, kind of like my brain can't process it and put it together?)  Does anyone else have issues like that?  Growing up I thought when it happened that it was a migraine but am now realizing that I was probably sitting/standing too long.I'm very grateful to all of you for posting as it is difficult to find out information on NCS and I have been wondering about issues with pregnancy.  Please keep me updated on your progress - I'm looking to have kids in the next few years and want to know what I'm up against.  Would also encourage everyone to get a full copy of their medical records from their cardiologist.  I pulled mine recently to switch to a female cardiologist (FINALLY found one, am just more comfortable with a female vs. male) and found on my chart under Atria it says the atrial size is normal for both left and right but then continues to say 'The discontinuity of the interatrial septum is suggestive of an atrial septal defect.  There is a spontaneous right to left interatrial shunt.  The shunting is mild in size.\"  This was news to me as it was never discussed in my 4 visits with this cardiologist so I'm going to ask about it (have an appt. Thurs.) to find out if this could be a contributing cause/trigger.Also am wondering if any of you have a tendency to break out into hives frequently?  I never had a problem with this growing up but in the last two years it seems I constantly break out into hives (I'm pale so this is pretty hard to hide and very embarassing!) on my chest and sometimes on my face (spreading from my ears across my cheeks).  Other times when I am stressed I will get this very dark red band across my nose (looks like someone punched me...yeah good times).  I've tried several doctors that told me it was Uticaria and that my skin is very reactive to emotions/histamine release.  Does anyone else have this issue?  I'm wondering if it's at all related to chemicals that could also cause NCS?  At one point I tried Claritin at night, Zyrtec in the morning as well as large doses of Vitamin C to decrease the amount of histamine produces and Bromelain (sp?) to prevent histamine from attaching at the receptor site.  Unfortunately this just led to having hives and being really really really tired!",
            "post_id": "5401704",
            "timestamp": "1266871359",
            "user_id": "user_1221494",
            "user_link": "/personal_pages/user/1221494",
            "votes": 0
        },
        {
            "answer": "I am 25 and my husband and I plan on starting to try and get pregnant within the next few months.  I was dx with NCS last year when I passed out in under 10 seconds on the tilt table.  The nurses said I was the most positive test they had ever seen.  Since then I am taking Atenolol 25 mg 2x/day.  Once in the morning and one at night.  My life has been totally different since starting this medication.  My HR has decreased from over 200, to now resting in the 90's and when I work out in the 160's.  In the past year I have only passed out ONCE and it was after I was unable to maintain my BP from donating blood.I have been cleared by my OB to get pregnant and have been told to set up an appointment with a perinatologist to be monitored closely during pregnancy.  My cardiologist has cleared me as well, although I will have to stop taking the atenolol when I become pregnant and will be placed on a high sodium diet to maintain my BP.  My OB also told me that I will probably be on bedrest for the vast portion of my pegnancy and she expects my body to be unable to maintain my BP at a safe level.I am excited to become pregnant but I pray the baby will not be hurt by my NCS.  Any words of wisdom from someone who has been through this process?-Lindsey",
            "post_id": "5554065",
            "timestamp": "1270834245",
            "user_id": "user_1274591",
            "user_link": "/personal_pages/user/1274591",
            "votes": 0
        },
        {
            "answer": "I was diagnosed with NCS when i was 15 during a tilt table test where I flat lined for 28 seconds 30 mins into the test. Then at the age of 17 i was diagnosed with orthostatic hypotension as well. At that point I had asked my cardiologist if I would need a high risk Ob/Gyn if i were to get pregnant and they said yes. I am just curious if anyone has had what i have and had a successfull pregnancy?",
            "post_id": "5822771",
            "timestamp": "1277187799",
            "user_id": "user_1355416",
            "user_link": "/personal_pages/user/1355416",
            "votes": 0
        }
    ],
    "post_id": "1556057",
    "question": "Hi my name is Beth. I was diagnosed with NCS when I was 20. I am now 27. I can't stand for more than a couple minutes without having to sit down. I was taking Proamatine and Florinef, which helped at first but gradually I was getting worse and worse. The fatigue was horrible, I couldn't do anything during the day but sleep. Then I started having shortness of breath and chest pain everyday associated with NCS. No doctor has been able to help. I finally found something that is helping alot. But I'm still not cured of this. It's a natural supplement.... called Ambrotose, it has completely alleviated the chest pain and shortness of breath as long as I take it everyday. And another product called PLUS which supports the endocrine system which is the root problem of this disorder... the adrenal glands aren't functioning correctly, so this helps balance it out. It helps tackle the root prob and not just the symptoms like prescription meds. I want to know what has helped others and has anyone gotten pregnant with this condition and can your body handle a pregnancy with NCS? What did you experience? Does it make you worse? How did you handle childbirth too?",
    "timestamp": "1185911826",
    "title": "neurocardiogenic syncope and pregnancy",
    "user_id": "user_239352",
    "user_link": "/personal_pages/user/239352"
}