{
    "answers": [
        {
            "answer": "Siiii, buenísimo Ana, ahora lo que no se es cómo invitar a las demás!! Gracias por el grupete!!! ;)",
            "post_id": "5478059",
            "timestamp": "1268840287",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "Hola amigas!!!!!!!!!!!!!! No se bien donde se escribe!!!!! estoy probando jajajajajaja",
            "post_id": "5480166",
            "timestamp": "1268879342",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "si amigas!!!!!!!! salieron los coments!! vamos progresando!! besos a todas!!!",
            "post_id": "5483341",
            "timestamp": "1268954833",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "jajajajaja!!!!!!!!! vamos que en unpar de semanas somos expertas jajajajajaBuen finde amigas!!!!!!!!! las quieroooooooooooooo",
            "post_id": "5486773",
            "timestamp": "1269044735",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Chicas agreguen a cheleste!!!!!!!!!!!!!!! yo no tengo idea jajajaja",
            "post_id": "5487239",
            "timestamp": "1269057961",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Buen fin de semana para todas chicas, esta horrible el día hoy pero bueno.... da para hacer cucharita!!!Este finde esta mi hijastra en casa, esperemos que este todo ok...Mil besos chicas!!! Suerteeeeeeeeeeeeee",
            "post_id": "5487789",
            "timestamp": "1269087643",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "hello!!!! aca estoy!! ya hoy me puse al dia con todo y lo entiendo perfectamente (costo pero salio! je). Vayan agregandome como amigas...que bueno que ya estamos casi todas, no??besotototes!!!!!!!!",
            "post_id": "5491650",
            "timestamp": "1269203606",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "chicas que feo diaaaaaaaaa, lindo para poner corazones!! yo el ciclo que estoy terminando lo deje en 28 dias, el que empiezo seguramente mañana lo hare aca... y y a me quedo jajaja.... pregunta : me esto dando cuenta que tengo ciclos de 25 y 27 dias, alternados... es decir... despues que se me arreglo todo tuve uno de 27 desp uno de 25 desp uno de 27, otro de 25 y este parece de 27... que raro no????????, bueno chiquisssss!!! besossss",
            "post_id": "5491764",
            "timestamp": "1269206578",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola Chikis!!Las extrañeeeeeé!!! :)Ana, que raro eso, pero tal vez tenga que ver con el ovario que va a trabajar ese ciclo, podrá ser? Bueno, despues de todo, si sos regular, esta todo ok!!Que día tuve chicas ni se imaginan!!! Y eso que recién son las 10 de la mañana!!! UFFFF!!!Pasando a otra cosa, hacía un para de ciclos que no veía flujo clara de huevo, y estoy teniendo bastante, ayer por lo menos, era un monton... espero que este ciclo se regularice y quede linda mi grafi... Un embarazo sería un super milagro, por eso por lo pronto espero al menos que mi grafi sea clara... Ustedes cómo están??",
            "post_id": "5493437",
            "timestamp": "1269262578",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "chicas de laura martinez no saben nada no??? nadie tiene su ccelu o telefono ? que raro no volvio a escribir en 28 dias....  seguro es por algo bueno!! pero ya me esta preocupando.... besos!!",
            "post_id": "5493540",
            "timestamp": "1269264685",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Amigas!!!!!!!!!!! fuimos tias ya!!!!!!!!!!!!!!!!!! Lauri me mando ayer un mail donde contaba todo el proceso!!!!!!!!!!!!!!! El dia que fue al curso pre parto, que fue el 9 de marzo,  paso por la guardia y ya quedo internada, ella no tiene mucho tiempo porque los mellis estan internados todavia hasta que tengan un peso razonable, mile nacio con 2 kg y santi con 2.100 kg, pero vieron que bajan un poquitin despues, asi que ahora estan en eso, que aumenten de peso y que coman… Los peques estan geniales pero le hicieron cesarea porque tenia preeclampsia (o como se escriba) la que estaba mas delicada era ella por eso indujeron el parto!!!!!!!!!! pero ahora esta mas que feliz y super emocionada!!!!!!!!!!!Chicas tengo duda con mi ovulacion!!!!!! en fertility me marca que ovule el dia 14, que opinan ustedes????Besitos y buena semana!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "5494002",
            "timestamp": "1269273524",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Che!! yo estaba escribiendo en cualquier lado ajjjajja... q desastre q soy!! ahora sí las encontré...Cinde, si hay clara de huevo aprovechá para poner corazonetes a full, yo siempre tuve pero ahora q empecé con el Clomifeno tebgo justo un día antes de ovular y después nada, así q vos q tenés aprovechaloooooo!!!Q tengan una linda semana y espero no perderme!!",
            "post_id": "5494976",
            "timestamp": "1269290217",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "HOLA, SE VE LO Q ESCRIBO?",
            "post_id": "5495008",
            "timestamp": "1269290711",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Osi que linda noticia la de Lau!!! Quiero ver fotos ya de Mile y Santi!!Analia, eso de los ciclos de 25 y 27 dias alternados se da porque como ovulas cada mes con un ovario distinto pasa que cada uno tiene su ritmo, y evidentemente uno tuyo es de 25 y el otro de 27, esta bueno porque ya lo tenes aprendido!Chicas, ya estoy a tono con la pagina, casi que deje 28dias por completo! Me da la sensacion de que haber cambiado de pagina me renovo las energias para la busqueda de mi baby, no se porque!! pero aprovecho esta dosis que me otorga!! jajaBesos amigas!!!!!!!!!",
            "post_id": "5495811",
            "timestamp": "1269304060",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Chiquis, alguna sabe como notificar que alguien escribio en este foro... es decir, si hay msn nuevos...¿? porq no me avisa...Sí yo tb estoy contenta con la pagina, me falta pulir detallitos como este, pero nada grave. Hoy entré a 28 dias, y ya no entro más hasta las 10 hs del jueves x la huelga, y me aparece que el martes 06/04 expira mi cuenta! asi q -como no les quiero dar ganancia- eliminaré mi usuario un dia antes (5/04), y ya estaré definitivamente acá. Aca estamos bien!",
            "post_id": "5497249",
            "timestamp": "1269351543",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola!! Maria la verdad no se donde es que se pone eso, debe estar en configracion, porque a mi si me avisa, y no se porque le debo haber puesto eso en algun lado pero no se!! ajajaBueno gracias por sus opiniones, eso es lo que yo pensaba que es pr el ovario que usa cada mes... pero antes de los abortos no era asi, eran todos de 27 o 28 ya no me acuerdo.... igual ..... resulta q hoy es dia 29 y no me vino :0 . soy super regular y no estoy contenta por varias razones: 1- tengo todos los sintmas d que vine yaaaaa, 2- estos bichines son de antes de la operacion asi que lo mas probable es que si paso algo termine mal (ya me lo advirtio el doc, ) nos cuidamos asi que no creo a sea eso pero uno nunca sabe, mi grafica de este ciclo esta en 28 dias y como estamos de huelga no la pueden ver hoy... pero si la vieran se darian cuenta que es un poco dificil q esto no sea un anuncio de warry, por las fechas de los corazones y de ovulacion, bue... me descargue... si le cuento a mi maridin me dice q estoy loca... pero bueno... que a mi me venga de una vez y que a uds no les vengaaaaaaaaa jajajaja se entendio??? bueno bessosssssss",
            "post_id": "5498039",
            "timestamp": "1269365509",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Ana, pero este es el mes que tiene que durar 27 o 28??? Mira amiga si te cuidaste en todas las relaciones entonces no creo que estes...a no ser que nos estes ocultando algo jejeje. Si llegas a estar embarazada no pienses en que no va a llegar a termino, los milagros existen amiga!!!Chicas a mi tanmpoco me avisa nada, si descubren como se hace avisenme!!",
            "post_id": "5499003",
            "timestamp": "1269381786",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "a mi por lo que veo me avisa una sola vez al dia, por ejemplo el mensaje de ratita no me lo aviso, porque ya me habia avisado temprano de otro que me habian dejado en mi perfil... me llega un mail que dice algo de medhelp notification, ahora que me acuerdo yo habia puesto de \"day notification\" no me acuerdo donde estaba, ahora reviso y les cuento....besitossss",
            "post_id": "5499270",
            "timestamp": "1269387394",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "a ver,,, en ACCOUNT SETTINGS,  adentro una solapa de NOTIFICATIONS, ahi hay q tildar donde dice que te avise cuanado hay un cambio, yo lo tengo tildado por eso me avisa!RAtita, la verdad, este mes me tocaba ciclo de 27 supuestamente, y ya termina el dia 29 y no pasa naranja...., solo los dolores pre..... la verdad evitamos los dias criticos, pero ahroa entre en dudas.... y saben que cuando una se pone nerviosa es peor.... mi maridin me dijo q me quede tranquila que mañana me viene seguro... espero.... le queiro pasar mi atraso a alguna de udsssssssssssssssssssssss, beuno chicas que descansen mañana!!! besossss espero haberlas ayudado con el tema de las notificaciones! byeeeeee",
            "post_id": "5499291",
            "timestamp": "1269387822",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "bueno chicas... aparecio ... y como!!!!, me sente en el inodoro (perdon por ser tan literal) y cuando me levante.... todo rojo!! coagulos y todo!, obvio que no fue normal , me precupa bastante y lo hablare con mi doc, imaginense lo regular que soy que mis otros 2 posi los tuve el dia 29 del ciclo, no tengo ciclos de 29 ni de 30... perono quiero pensar eso... el doc me habia dicho q si tenia dudas me hiciera un test, porque no es lo mismo tener 1, 2 que 3 o 4 abortos, que si era asi habai que indagar mas... pero no me anime, no me lo hice... que boba... pero bueno ya esta, yo espero que solo haya sido un atraso normal, no me quiero encontrar mas problemas!!!!!!!!!!!! asi que hoy empiezo grafico aca!!!! y este mes a cuidarnos mas que falta poco!! uds como van ? ahora paso por sus casis... gracias por el apoyoooooooooo!!!! besosssssss",
            "post_id": "5501163",
            "timestamp": "1269444430",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Ana!! Que raro no?? digo, que se te haya atrasado un dia con lo regular que sos, pero por ahi la mente nos juega malas pasadas y eso hace que nuestro cuerpo no trabaje como debe, pero todo debido a nuestra cabecita. Me parece que no tenes que ponerte a pensar que si fue o no, ya esta, tenes que mirar para adelante porque no vale la pena. Cuando empezas el tratamiento??Yo por aca estoy en mi dia 11 dc habiendo tomado clomifeno, asi que a la espera! Estoy teniendo muchisimo flujo cosa rara porque esta medicacion mas bien te seca, pero bienvenido sea! El mes pasado ovule el dia 21, bastante tarde! asi que no me quiero apresurar a exprimirlo a mi maridin para dejarle pilas para mas adelante jejeBesos amigas! Ya quiero positivos de todas!!!!!!!",
            "post_id": "5502910",
            "timestamp": "1269475658",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "ah chicas me olvide de decirles que este mes voy a empezar con el truco de la esponja! ya vi que varias chicas lo utilizaron despues de muchos meses de busqueda y les funciono, lograron quedar embarazadas con este truquito! Ya veremos si funciona o no!",
            "post_id": "5502942",
            "timestamp": "1269476255",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "ratita!, lo de la esponja lo lei ayer! no lo habia escuchado... me dio un poco de asquito no?? te cuento que yo las dos veces que lo logre lo que hice fue quedarme acostada minimo 1 hora, me puse dos almohadas debajo y me quede asi,,, ahhh y ademas subi un poco las piernas como haciendo la vertical ajajajaja dure solo un segundo eh porque casi me mato, asi que no se los recomiendo si son tan de madera como yo ajajjaja bueno chicas hasta mañana!!!!!!!!!!!!!!",
            "post_id": "5503035",
            "timestamp": "1269477929",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "si Ani, la verdad que es un poco asquerosito, pero ya a esta altura ME DA IGUAL!!!!! no me importan lo que tenga que hacer, yo lo sigo al pie de la letra si eso aumenta las chances...y los de quedarme acostada lo vengo haciendo todos los meses y mas de una hora y hasta ahora nada asi que no me queda otra que seguir probando otras cosas jeje. Besotes y hasta manana!!!",
            "post_id": "5503293",
            "timestamp": "1269483905",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Yo también leí lo de la esponja y me dió cosita, pero q se yo, yo voy a ver si el ciclo q viene lo hago... Yo también hago lo de quedarme acostada, es más, no una hora me quedo hasta el otro día, no me levanto en toda la noche y todavía nada, así q vamos por lo de la esponja...Anaaa!! q cosas q hacemos eh!! jjaja, me imagino a vos haciendo esa especie de vertical y cayéndote para cualquier lado jjajj...Ratita no me acordaba q vos estabas con el Clomifeno, yo voy por el segundo ciclo y la verdad q no me tengo fé en este, primero me gustaba mi gráfico, pero ahora q lo estoy viendo bien y comparando con otros anteriores hasta ahora viene igual q siempre... así q a seguir esperando unos días más a ver q pasa...",
            "post_id": "5504283",
            "timestamp": "1269519395",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Lo de la esponja no le encuentro la explicacion medica... es decir, uno se pone esa esponja y el esperma no se cae.... pero el que tiene que caer, va a quedar pegado en las paredes de la esponja... no es q se van a ir nadando al utero porque no encuentran salida! jeje pero es verdad q muchas chicas quedaron, sera casualidad, fe, no se... Con probar no cuesta nada! Yo tb me quedo recostada, con las almohadas... bue al prinicipio, ahora ya no tanto.Una pregunta intima, ¿ a ustedes se les cae el esperma de sus chicos? Es q aunque me quede acostada y todaa la noche, se cae durante la noche y cuando hago pis al otro dia tambien... sera normal? las trompas no estan obstruidas porq me hice la HCG... q opinan??",
            "post_id": "5504899",
            "timestamp": "1269531355",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Bueno, como explicacion medica yo tampoco le encuentro, pero explicacion fisica si! es decir, te pones la esponja con el film bien profundo y eso por lo menos evita que no se te salga el esperma cuando estas recostas (y lo uno con tu segunda pregunta Mary) porque creo que si te quedas acostada sin nada el esperma corre y cae igualmente, o al menos es como mas aguado que espeso...por eso yo voy a probar la esponja ya que por lo menos cuando me quedo toda la noche conteniendo \"la cosa\" no se me sale lo que hace que pueda dormir mucho mas comoda, sino es un asco!",
            "post_id": "5505581",
            "timestamp": "1269543634",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "jajaj chicas como me hacen reir!! encima que es un asquito luchamos por dejarlo adentro..!! todavia me acuerdo cuando le hice la misma pregunta que nos hace maria a mi doc, como trabajmos juntos y tenemos confianza se empezo a cacarear de risa!! me dijo textual \" para que queres que se te quede adentro?? los pensas coleccionar??\" ajajaj y me dijo que con quedarnos un rato acostadas y con las almohadas alcanza, que el flujo caracteristico de esos dias \"atrapa\" gran cantidad de esperma, que los bichines se quedan y el semen se TIENE que caer, porque no lo absorvemos ni nada, que ademas en el momento en que salen, el hombre con los movimientos impulsa todo hacia el fondo, y me hizo un dibujito que es dificil de explicarles por aca, pero como que en el fondo nosotras tenemos como un recoveco y que mucho del semen queda ahi, por eso quizas si paso de noche durante todo el otro dia algo se nos sale, lo unico que no hay q hacer es lavarse enseguida, porque se esa manera disminuimos las chances!, hagan la vertical chicas!! ajajjaja pero no se caigan como yo!! a mi se me salio todo siempre y quede !! y hagan lo de la esponja!! todo sirveeeee!!! ya les contare mis locuras cuando empiece la busqueda nuevamente! besitos a todas y hasta mañana!!!!",
            "post_id": "5506612",
            "timestamp": "1269561271",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "jajajajaajajajajajaajajajaja!!!!!!!!!!!! no paro de reirme jajajajajajajajaja!!!!!!!!!! si que somos capaces de cualquier cosa, pero si encima me pongo algo adentro mi marido me interna jajajajaja!!!!!!!!!!!!! yo tambien estaba preocupada porque sentia que siempre el semen quedaba en la puerta pero estuve averiguando y es normal, pero si estas segura lo de la esponja no lo dudes amiga, yo por ahora no me animo pero como siga asi va a ir con esponja vertical y todo jajajajaajjaaj!!!!!!!!!!!!! Rati, vos no tenias el utero al reves???? porque en ese caso tendrias que quedarte acostada pero boca abajo!!!!!!Besos amigas!!!!!!!!!!!! las quieroooooooooooooooooooooo",
            "post_id": "5506773",
            "timestamp": "1269564428",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, que bueno saber que no soy la unica con ese problema!! Es que -no se reian- pero yo ya estaba pensando que mi marido no apuntaba bien, jejejje.. que loka, mejor que nunca se lo dije!!!Lo de la esponja, por ahora paso... pero lo de las almohadas y recostada si lo escuché y alguna vez lo hice. Les doy un consejo, en yoga se hace la vela.... y esa es la posicion ideal para q lleguen rapidito... pero el tema es q desp. de hacerlo ponerse a hacer yoga... nuestros chicos nos internan!!",
            "post_id": "5508304",
            "timestamp": "1269613335",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "jajajaja, eso maria! esa es la vertical que yo decia! la vela! para las que no la conocen busquen en google pongan posicion vela de yoga y ahi les sale como es.... no es dificil pero yo soy de madera... y ademas lo quise hacer mientras el no me veia y estaba en el baño asi q en cuanto escuche el ruido de la puerte casi me mato de un golpe!!!.... nuestra locura no tiene desperdicio!!!!!!!!!!..ajajaj besitosssss",
            "post_id": "5508335",
            "timestamp": "1269614090",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "jajaaja me haces reir Ana!!! están las chicas bob esponja y las chicas vela!!! jajaaj",
            "post_id": "5508453",
            "timestamp": "1269616667",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "jejeje se torna MUY divertida nuestra charlita!! jaja Yo la verdad no soy para nada una chica yoga porque como tengo un problema en una muneca lo tengo prohibido, pero googlie la pose y es la que intento hacer siempre despues de la relacion (lo hago solo en los dias mas fertiles por supuesto). Lo que esta bueno es tratar de que las piernas den contra la pared o el respaldo de la cama, por lo menos te sostiene y te vas para cualquier lado. Y mi marido cuando hago todo esto me dice que soy una exagerada, se mata de la ria y no me entiende, asi que se imaginan que si le cuento lo de la esponja ya directamente me manda al borda, asi que ese es MI secreto...ya quiero que llegue mi semana fantastica para probar el truquito!!! jejeAh Osito, tal cual como vos decis, para variar y sumar a todo el asunto tengo el utero invertido y hay opiniones que despues de cada relacion me tengo que poner boca abajo, pero tambien hay otro que dicen que lo mejor es piernas para arriba (la vela) asi que no me queda del todo claro, entoooooonces lo que hago despues de \"la vela\" es darme vuelta boca abajo por una horita mas....estoy chapa chapa, ya lo see!!!!!Besos amigas y que tengan un precioso finde!!",
            "post_id": "5509280",
            "timestamp": "1269630208",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Como supieron q esta invertido? por la eco se dan cuenta?rati!!!! la posicion boca abajo es mas comoda q la otra! q guacha ! no vale! jejeje!!",
            "post_id": "5509448",
            "timestamp": "1269633618",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "si, a traves de eco trans me lo diagnosticaron...y si boca abajo es mas comodo pero yo de histerica roto en todas las posiciones jaja",
            "post_id": "5509786",
            "timestamp": "1269639749",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "nos mandan al borda a todassssssssssss ojo si nos agarran con la esponja adentro!!!!!!!!!!!!!!! ajajajajajajajajajajajajajajaja no somos hermosasssssss?????????????? besossssssssssss buen findeeeeee!!!!!",
            "post_id": "5510342",
            "timestamp": "1269653143",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola amigas!!!!!!!!!! ya estoy con la asquerosa, me bajo ayer y sin avisar previamente  !!!!!! pero bueno ya esta asumida jejejejej, espero que este si sea el ultimo!!!!!!!!!!!! Que suerte amiguis esta semana es re cortita!!!!!!!!!!!!!!Alguna sabe como agrgar a cheleste o a alguna otra argentinita por aca???? es que yo no se como se hace!!!!!!!! Besistos!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "5516096",
            "timestamp": "1269833368",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "yo tampoco se como sé hace, creo q lo tiene q hacer ella,,, le avisas?Q lastima osi, ojala sea este tu ciclo... yo todavia no ovule, asi q me estoy haciendo a la idea que voy a tener un ciclo largo.",
            "post_id": "5517104",
            "timestamp": "1269870910",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Osi, amiga, ojala que este sea el mes de todas y que el proximo tengamos que hablar de panzas y no de posiciones!!Chicas, hoy me levante con una terrible infeccion urinaria, me duele muchisimo, voy cada 5 min al bano y ademas orino con sangre, estoy media asustada pero ya esta tarde voy a ver al medico a ver que me dice. He tenido otras veces pero nunca con sangre...a alguna le paso??Yo creo que ovule el sabado, la verdad que estaba cero preparada y de casualidad me hice un TO y me salio super positivo, ademas estaba con la clara de huevo a full. El tema es que hoy me bajo la tempe lo que me hace dudar bastante...estoy media desorientada, habra que esperar...",
            "post_id": "5517248",
            "timestamp": "1269874037",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "No, nunca me pasó con sangre. Hace poco tuve sistitis, pero se me fue sola... el medico seguro te de un antibiotico",
            "post_id": "5517333",
            "timestamp": "1269875672",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Me perdí toda esa charla re loca q tuvieron che!!...  Irene está embarazada y leí en sus notas q usó el Pre Seed, o no sé, algo así y obvio la esponja, así q ya lo decidí, el próximo ciclo Bob Esponja a full!!Ana, te contesto acá xq no me acordaba como era, para agregar el dibujito ese con los días de fase lútea, fijate q cuando hacés un comentario acá, en el foro, abajo del campo donde se escribe el mensaje hay algo q dice \"Show Ticker\", hacés clic ahí, te aparece algo q dice \"Add one of your ticckers..., abrís y te aparece Ovulatio Tracker, lo seleccionás y listo...",
            "post_id": "5518055",
            "timestamp": "1269887579",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Chicas, el pre seed es para las q son más bien secas.. q no tenemos flujo clara de huevo, y que generalmente cuando tomas clomifeno, es una de las consecuencias, q una esta mas seca.... no se si se vende en argentina.Hoy si hago algo pruebo la famosa esponja! jejeje pero sigo sin entender la logica ...",
            "post_id": "5518128",
            "timestamp": "1269888982",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chicas yo no llegue a hacer lo de la esponja :( es que fue de dia entonces no daba...que mal timing!",
            "post_id": "5519306",
            "timestamp": "1269912309",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Yo tampoco pude... llegue super tarde a casa! :(  y no me dió para hacer manualidades... empecé una gimnasia nueva, q son unas capsulas termicas y el tratamiento dura como una hora y media!!! asi q llegue y no me dio el tiempo.Pero hice la vela! jejeeje, como estan??? alguna nove?",
            "post_id": "5520615",
            "timestamp": "1269957559",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "aguante la vela!!! ajajaj como andan todas???? estamso todas en la misma parte del ciclo o por ahi no??? alguan ya esta en los ultimos dias??? como aca hay q dar mas vueltas.. me mareo... cuenten como anda todo??? besosss!!!",
            "post_id": "5521291",
            "timestamp": "1269970538",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "ahi siiii salio la barrita abajo! gracias andreeeee!!! asi me guio como ando yo tambien!! besitos!!",
            "post_id": "5521296",
            "timestamp": "1269970612",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola, como pones el baner abajo, ana??",
            "post_id": "5521419",
            "timestamp": "1269972787",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! cómo andan? yo mal, estoy super bajón, la verdad q a veces me dan ganas de mandar todo al diablo, estoy cansada y malhumorada, se nota? jjeeje, no en serio, tan lindo q estaba mi gráfico y hoy la muy perra empieza a hacer esa curvita para abajo q tanto odio!!... la tempe oral, q es la q llevo en mi gráfico bajó solo una décima, pero la vaginal me bajó de 37.1 a 36.7, así q ya está... lo único q me llama la atención, y se lo voy a consultar al gine cuando vaya, es ese manchado q tuve... pero bueno, nada, ahora a esperar q venga...",
            "post_id": "5521803",
            "timestamp": "1269979853",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "ay andre, no decaigas, nunca se sabe, pero se perfectamente como te sentis!",
            "post_id": "5522049",
            "timestamp": "1269984506",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "maria, segun que me conto andre mas arriba es algo que pones cuando escribis algo aca, dice \"show tcker\" pones ahi y cuanto pones post, sale! proba... besitosss",
            "post_id": "5522366",
            "timestamp": "1269991857",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Chicas yo tambien hice la vela y anoche bob esponja por las dudas, pero me parece que el pedazo de esponja era demasiado grande y no lo aguante asi que a las 2 horas me lo saque porque era super molesto, voy a tener que recortar a Bob! jeAndre, no hay palabras de consuelo cuando vemos que la tempe baja y los dolores de la roja acechan, a mi siempre me pasa lo mismo y por mas que mi marido trate de consolarme es imposible pensar de que \"el proximo mes sera', porque ya venimos pensando eso hace bastante tiempo y ya nos deja sin esperanza....lo unico que te quiero decir es que sabemos muy bien por lo que pasas porque nos pasa a todas en cada ciclo, asi que aqui estamos para escucharte amiga!!",
            "post_id": "5522603",
            "timestamp": "1269997648",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Lolin corazon, te deje un mensajin en 28, es que todavia me parece mas facil!!!!!!!!!! animo corazon!!!!!!! estamos juntas en esto amigaaaaaaaaaaaaaaaaaYo estoy asumiendo el nuevo ciclo jejejeje pero tambien bastante harta y agobiada, me parece que este mes metodo test de ovulacion a ver que tal me va!!!!!",
            "post_id": "5523015",
            "timestamp": "1270007438",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "me salio el grafiquito!!!!!!!!!!!!Las quiero chicas!!!!!!!!!!!!! Vieron que ridiculos quedan los mensajes con esta traduccion jajajajaja",
            "post_id": "5523019",
            "timestamp": "1270007503",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Chicas! a andre le subio la tempe mucho! jajaja para mi hay ++ en puerte",
            "post_id": "5524063",
            "timestamp": "1270042356",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Ayyyy!!! pase por la grafica de andre en 28 dias y si!! volvio a subirle la tempe a un dia del dia D!!!!!! Andreeee!! mucha suerte estamos con vossssss!!!!!!!!!!!!",
            "post_id": "5524103",
            "timestamp": "1270043143",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "chicas, cuanto duran las molestias de ovulacion???.... desde hace dos dias q se me hinchó todo... ayer tambien... y hoy un poco menos, pero sigo molesta!!! Me estoy asustando...",
            "post_id": "5524151",
            "timestamp": "1270044052",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "ayyyy ya voy a pasar por la grafica de andre!!! que bueno!!!!!!Mary, con clomifeno se te hincha hasta las orejas, no te asustes, pasa!! Me acuerdo mi primer mes me paso que sentia muchos dolores por un par de dias y tambien me asuste, pero no pasa nada, es normal. No probaste hacerte un TO??",
            "post_id": "5524228",
            "timestamp": "1270045814",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "No, ya no quiero hacer más nada, solo voy a tomar la tempe que hoy subió",
            "post_id": "5524277",
            "timestamp": "1270046943",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chicas!! aparecí por acá!! bueno igual ya pasaron por mi gráfico así q ya saben q subió mi tempe!!... es q tengo taaaaantas dudas, ya se q se aclararían haciéndome un TE, pera me da un ca...zo jjajj... voy a ver como sigue todo esto...Dudas... manchado y atraso por el Clomifeno???... tempe alterada porq me estaré por enfermar??? ayyy chicas menos mal q están ustedes xq todo esto rondando en mi cabezota es mucho...Ana, voy a poner mis gráficos anteriores visibles así los ves y me das tu diagnóstico jajaj, ahhh y te dejé un comentario en 28 días, algo de la TSH q ayer me dieron el resultado (bien 1.41) pero q es anti TPO? eso me dió <5Mari, este mes tomaste el Clomifeno? xq yo en este ciclo no tanto, pero en el primero con Clomifeno sentí mucha hinchazón por dos o tres días en la fecha de ovulación. Y en este ciclo hinchazón y molestias de ovulación re fuertes, como si me estuviera por venir...Gracias chicas!! crucen los dedos por mí!!",
            "post_id": "5524965",
            "timestamp": "1270058606",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "TPO: anticuerpos antiperoxidasaBue me imagino como te sentirás!!! a mi tambien me da terror hacerme un TE! cada vez q lo hago nunca me sale lo que espero... el ciclo anterior era una sombra! y no se entendia q era... los odio!!!",
            "post_id": "5525235",
            "timestamp": "1270064173",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! claro... como es feriado están de joda no? jjajja, yo tuve q trabajar medio día, así q en cinco minutos me voy a casita. Les cuento q mi tempe subió más todavía, así q, si Dios quiere y todo sigue así el sábado me hago el test... Q pasen un hermoso finde!!",
            "post_id": "5527985",
            "timestamp": "1270138089",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "ayyy chicas me pone nervisoa la grafica de andre!! ya que estamos \"al pedo\" crucemos todas los dedos y recemos por ella  esto huele a posiiiiiiiiiiiii!!!   besitos y buen finde!",
            "post_id": "5528403",
            "timestamp": "1270146441",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Suerte Andre!!!!!!!! Pensamientos positivos por vos!!!! Y porfa contanos apenas tengas noticias!!",
            "post_id": "5528947",
            "timestamp": "1270157525",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "si chicas !! mañana ya es sabado y vamos a tener el posi de andre !! todas pensando en positivo asi hacemos fuerzaaaaaaaaa!!! y Andre: ya sabes que pase lo que pase estamos acaaaaaa!! besitosssssssss",
            "post_id": "5531776",
            "timestamp": "1270241078",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "suerte suerte suerteeeeeeeeeeeeeeeeeeeeeeeeeeeVamos andre!!!!!!!!!!!! tiene que ser positivo!!!!!!!!!!!!!!! Besos para todas amigas!!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "5532844",
            "timestamp": "1270275374",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "POSITIVO DE ANDRE!!!!!!!!!!!!!!!!!!!!!!!!  que feliz que estoy es como si fuera nuestro no chicas???!!! FELICITACIONESSSSSSSS!!!!!!, besos a todas a ver cuantas mas me alegran el mes ehh!! besitossssssss!!!",
            "post_id": "5533366",
            "timestamp": "1270304971",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Siiiiiiiiiiiiiiiiiiiiiiiiiii, yo tambien estoy super felizzzzzzzzzzFelicitaciones andreeeeeeeeeeeeeeeeeeeeeee!!!!!!!!!!!!!!!!!!",
            "post_id": "5533450",
            "timestamp": "1270307584",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "yeaaaaaaaaahhhhhhhh!!!! vamos con los posi!!!!!!!!!!!! Andre, me alegraste el finde que venia totalmente de bajon!",
            "post_id": "5533467",
            "timestamp": "1270308153",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola Chicas!!!Acá estoy empezando ciclo nuevo!! Saben cuanto duro??? 23 DÍAAAAAS!! no sé por que habrá sido tan cortito, pero por lo menos la grafica se entendió!!Voy a llamar a tesla a ver si me dan turno para hacerme la histero, ya que el ciclo pasado no me dieron, no había!Les comento que consegui la maca, pero no en comprimidos son una especie de \"trocitos\" de maca, al parecer están como horneados... alguna sabe como se toman??",
            "post_id": "5537977",
            "timestamp": "1270476447",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "♥♥♥♥ FELICITACIONES ANDREEEEEEEEEEEEEEEEE ♥♥♥Que notición y que super huevo de pascua que teníamos por acá!!!!!!!!Y yo ni enterada!!!!!!Que lindaaaaaaaaaaaaaaaaaaaaaaaaaaa!!!",
            "post_id": "5537986",
            "timestamp": "1270476682",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! estoy leyendo todos los comentarios atrasados jjajja Gracias amigas por todo el apoyo en estos días!! ya se los debo haber dicho 20 veces, pero estoy tan agradecida de haberlas encontrado... tanta buena onda... tanto apoyo en los momentos difíciles... tantas orejas para escuchar quejas y bajones!!... solo nosotras sabemos lo importante q es contar con chicas q están en lo mismo q una, son cosas q solo nosotras, las mujeres lo entendemos, los hombres lo viven de otra manera, así q me alegro un montón de tenerlas!!Hoy quise entrar a 28 días y ya no pude agregar nada a mi gráfico, así q ya fué, entraré solo para constestar mensajitos y listo, vieron q en Proyecto Bebé ya van a poner las gráficas??... apenas las pongan yo paso la mía para allá... igual sigo con esta, pero me gusta más Proyecto, es más linda, será xq es rosa como 28 días jajjajChiquis portense bien y yo me voy a poner a trabajar, q la verdad q desde q llegué no hice nada jajjj Besos!!",
            "post_id": "5541357",
            "timestamp": "1270564447",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Quise hacer mi gráfico de embarazo y no sé de donde saca q estoy de 13 semanas... me pone cualquier fecha y yo puse la fecha en q me hice el test... mañana con tiempo voy a ver como se hace...",
            "post_id": "5541408",
            "timestamp": "1270565354",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Sí Andre en proyecto bebe parece q van a estar listas para la 3° semana de abril... espero porq aca me da todo error! GrrrHoy me levante terrible! me mire al espejo y me veo gorda, caderonas, estoy c esos dias que te ves fea! jejejecomo estan uds.??? andre como te sentis???",
            "post_id": "5541484",
            "timestamp": "1270566224",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Buen día Chicas!! Mari... estas hormonas... Grrrr....Yo me levante un poquito mejor que ayer, que me dolia toooooooooooodo!!!Andre no puedo ayudarte con el grafico de embarazo... ay ojalá te salga y prontito asi chusmeamos todo!!Se van a mudar a proyectobebé?? Yo ya no me quiero mudar... =(LES DEJO UN FUERTE ABRAZO A TODAS!!!",
            "post_id": "5541532",
            "timestamp": "1270566874",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "Bueno chicas, acabo de dar de baja mi usuario en 28 dias, snif, pero no les iba a dar de ganar desp. del mal manejo q hicieron... si alguien lo va a hacer, está esa opcion en Configuraciones. un beso",
            "post_id": "5541818",
            "timestamp": "1270571229",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "si yo entre anoche y ya no se podia agregar nada, la opcion libre solo incluye hacer comentarios, y de que sirve!! para eso uso el hotmail y listo!!! yo aunque use la nueva pagina voy a seguir usando esta... me gusat porque te detecta ovulacion y tiene mas cosas! pero usare las dos... besitos a todasss aver quien se une a Andre este mes???? vamos chicas pilaaaaaaaaaaaaaaaaaaaasssssssssssssss!!!! besitosssssssssssss",
            "post_id": "5542108",
            "timestamp": "1270576459",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola amis queridas....yo no me uno nada a Andre porque esto va de mal en peor...ayer llore toda la tarde y por suerte lo tengo al gordo que me escucha siempre y que intenta consolarme, digo \"intenta\" porque nada me consuela...la verdad estoy re mal, estoy cansada, siento que nunca voy a poder quedar, nunca me imagine tener que pasar por este sufrimiento al intentar quedar por primera vez, pense que iba a ser mas facil...Estoy enojada conmigo misma, y mucho con Dios, ya ni rezo porque ni me interesa, se que ya no me manda ayuda de ningun tipo, asi que solo me queda confiar en los medicos y la ciencia....quiero que todo esto por lo que estoy pasando se termine ya, siento que se me esta haciendo eterno...Chicas perdon por el bajon pero les quiero contar como me siento, uds me pueden entender mas que nadie en el mundobesotess grandesss",
            "post_id": "5543032",
            "timestamp": "1270591075",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Rati amiga!!!!!!! ayer vi tu mensajin en 28 y sabes que te entiendo al igual que todas por aca, los dias que pintan grises son los peores ya lo se, yo muchas veces pienso que nunca pero nunca voy a lograrlo y despues pienso por que no? todo lo que este a nuestro alcance tenemos que hacerlo!!!!!!! lo mas importante es  tratar de pasar estos malos momentos, esta bien desahogarse y llorar pero despues hay que seguir, amiga yo despues de perder dos bebitos aca sigo tratando de tirar para adelante!!!!!! es duro esto pero lo vamos a lograr algun dia, mira lolin si no!!!! dale amiguis animoooooooooooooYo hoy empece con to jajaja, me salio negativo y encima son re caros jajajaj, y tambien otro de las medidas que tome fue darle a mi maridin redoxon doble accion, no sabemos si sus bichines seran malos pero como tiene zinc y vatamina c sabemos que son buenos para fortalecer a los bichines asi que este mes voy con todo!!!!!!!Sabes que aca estamos para ayudarte amiga!!!!!!! te quierooooooooooooooo",
            "post_id": "5543118",
            "timestamp": "1270592568",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "chicas!! que no decaiga!! yo como Osi tambien ya perdi 2 embarazos y aunqeu todo el mundo te consuela diciendo: \"por lo menos quedaste\" uno les dice... si pero no crecen... no se quedan! y te da tanta bronca! todas aca hemos pecado de mirar con bronca a las pendex embarazadas  o a las minas que tienen como  mil y no tienen un peso para darles de comer y encima los tratan mal.... pero bueno ...NO podemos decaer! tenemos nuestros dias pero sabemos que despues vienen los dias buenos, el dia que tengamos a nuestro bebe en nuestros brazos recordaremos estos momentos con risas y no llanto!Ya lo dije mil veces pero lo repito ESTAMOS PREPARADAS PARA ESTO CHICAS, VAMOS A  SER MADRES PORQUE NOS LO MERECEMOS, y no se habla mas!!! lo lograremos en un mes, un año o diez! pero lo lograremos! hoy la ciencia esta de nuestro lado y LO VAMOS A LOGRAR! mientras tanto Rati y al resto tambien: ACA ESTAMOS PARA HACERNOS EL AGUANTE!!!! que no decaiga car...!! que cuando yo este triste quien me va a sostener!!Asi q a pensar en positivo que lo positivo TRAE EL POSITIVO!!!!!!!!Besos a todas : las quiero!!!!!!!!!!!!!!!",
            "post_id": "5543279",
            "timestamp": "1270595251",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Ratita, demás está decirte q entiendo todo lo q te pasa, es tal cual, yo sentía eso, q nunca lo iba a lograr, hasta hace unos días, un día q me había bajado la tempe y estab re bajón, ese día me acuerdo q pensé, bueno ya está, no es para mí... la priomera vez q quedé embarazada lo perdí, ni siquiera sé xq, después de un montón de años, nos decidimos y empezamos con q mi marido tenía varicocele, OK, se opera, se recupera, y cuando él está bien empiezo yo con las cosas raras...Todo nos tenía q pasar a nosotros??? Pero por suerte es como dice Ana, la ciencia está de nuestro lado!!, no es imposible... y lo q nos pasa cuando vemos q otra vez no lo conseguimos es perfectamente normal, y para eso nos tenemos a nosotras, a nuestras amigas, no hay nadie q entienda como nos sentimos, solo entre nosotras podemos darnos fuerza y ánimos!!Chicas q tengan un lindo día, y Ratita acá estamos para hacerte el aguante, besos!!!!",
            "post_id": "5545259",
            "timestamp": "1270646279",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Yo tb siento lo mismo ani!!!! yo siento q nunca me llega a mi, pero bue ojala algun dia se acuerde de nosotros tb. Creo q seriamos muy buenos padres.Chicas, estoy como loca aca en el trabajo y creo q me estoy refriando..",
            "post_id": "5545353",
            "timestamp": "1270647592",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Gracias a todas chicas!!! Ayer me la pase llorando casi todo el dia...tengo un inexplicable dolor en el alma, me duele el pecho, el corazon....nunca habia tenido una crisis tan profunda. Y de tan mal que estaba termine contandole todo a mis hermanas que no sabia nada de nada. Una ya es mama, la otra no. Nunca me imagine hablando este tema con ellas, pero me vi y me senti tan pero tan triste que necesitaba el apoyo familiar de alguna manera. Supongo que hice bien en contarlo porque me desahogue y ellas me dieron sus palabras de aliento. Chicas no se que hacer...la gine ya me derivo a fertilidad pero no si ir ahora o no, porque yo a fines de mayo me estoy mudando de aca, me estoy yendo dos meses a argentina y en agosto me voy a vivir a chile, entonces como que los tiempos para hacer tratamiento de fertilidad aca no me dan, pero por otro lado es esperar hasta agosto! y me parece demasiado, son cuatro meses...la verdad que eso tambien me angustia mucho, tener que postponer todo para dentro de cuatro meses....",
            "post_id": "5545448",
            "timestamp": "1270649037",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola Ana, y por q no haces una consulta en argentina? Y lo continuas en chile. Yo tb en junio voy a hacer una consulta en algun centro, pero aun no tengo nada ... Quiero un doctor q sea mas piola que sea mas contenedor, no se... el mio es muy cuadrado!!! Pero vi que seremas y halitus en BA, tienen buenas referencias. Q obra social tenes en argentina??? Yo tengo osde.",
            "post_id": "5545752",
            "timestamp": "1270653512",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chicas, las leo, y las quiero y respeto y aprecio cada día más :)Ratita, te contaría y diría mil cosas, todas nos sentimos igual, algunas con mas razones que otras, pero con razones! Dios no es culpable, Dios te escucha, y yo voy a seguir rezando por vos, si dejas de hacerlo, asi como recuerdo a todas...Este sentimiento doloroso que sentimos no viene de Dios, es ajeno a él, el no quisiera vernos sufrir... pero lo que no debemos hacer es dejarnos caer... Lo vamos a conseguir!! Sí que sí!!! Ya nos va a tocar, pero debemos seguir luchando...Si no queres perder tiempo, rati, yo estoy de acuerdo con Mari, hacete ver en un buen lugar donde te digan la posta , conta tu situacion, que viajas y eso, pero no te desanimes, aca estamos todas en la misma, para escucharte patalear y gritar y quejarte, todas las quejas son bienvenidas, escuchadas pero a tirar la toalla?? JAMAS!!!Esta es una lucha que vamos a ganar!!!",
            "post_id": "5546079",
            "timestamp": "1270658531",
            "user_id": "user_1239278",
            "user_link": "/personal_pages/user/1239278",
            "votes": "0"
        },
        {
            "answer": "Si Mary, definitivamente tengo que ponerme a averiguar sobre los centros en bsas, yo tengo luis pasteur de obra social, deberia averiguar que me cubre.Cinde, mil gracias por tu aliento! Gracias a todas!! La verdad que las adoro!! Son mi cable a tierra....Ya ahora estoy un poquito mejor, espero no recaer nuevamente...besos a todassss",
            "post_id": "5547112",
            "timestamp": "1270674694",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola Ratita!! pasé un chiquitín para saber como estabas, me parece bien q lo hayas hablado con tus hermanas, me imagino el alivio q debés sentir al haberte desahogado así con ellas... Me alegro de q estés mejorcita amiga...Me resulta más cómodo pasar por acá xq los gráficos como q no los entiendo, bah me cuestan jjeje así q cuenten como van en q días están a ver si hay novedades!!Mary, si venís a Bs. As. andá a ese gine q te dije, el antes trabajaba en Halitus, q creo q queda cerca del consultorio de él, así q ya q estás date una vuelta... a mi me lo recomendaron y me encanta, igual bueno, eso depende de cada una, no? es muy personal, pero no te hace dar vueltas, y eso me gustó...Cinde recién te contesté tu mensaje, ya sabés, si necesitás q te mande algo avisame y te lo mando por mail...Besos!!",
            "post_id": "5549374",
            "timestamp": "1270731562",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Gracias Andre, creo q no tiene osde! bue, no lo encontré!, sabes??? es alejandro martinez?.... es muy seco?",
            "post_id": "5549535",
            "timestamp": "1270734733",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Holis!!!!!!!!!!! ratitaaaaaaaaaaaaa espero que estes mejor amigaaaaaaaaaaaaYo sigo con los to y bien negativos jajajaja, son muy caros la caja trae 5 tiras y sale $72 jejejeje, no se si mi economia agantara tanto gasto!!!!!!!!!!!!!!Rati, tu obra social es prepaga???? la mia es una cagada, tengo osplad, para osde no me da el cuero (lo tengo a mi marido a mi cargo tambien) y estoy viendo opciones. La luis pasteur tiene buenos centros, al menos por mi zona pero tendria que averiguar cuanto sale!!!! Que otras me recomiendan???? Lolin el doc que decis es privado???Perdon si no paso por sus grafiquines, es cierto que por aca es mas facil y no nos perdemos de vista chicas!!!!!!!!!!Las quiero!!!!!!!! si saben de alguna obra social buena o alguna prepaga no tan cara avisen porfis!!!!!!!!!!!! Besos",
            "post_id": "5550833",
            "timestamp": "1270757434",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Mary!! me hago un quilombo con esta página!!... estoy re perdida jjajja... No, se llama Marcelo Martínez, el teléfono es 4821-2305/06, yo llamé hoy y están dando turnos para junio. Yo me atiendo con él, pero como ahora tengo q ir para llevar la eco apenas la tenga, me dieron turno con otro q trabaja con él, q se llama Rodrigo Slatske o algo así, pero el q tiene la posta es Marcelo, siempre está lleno el consultorio... Así q fijate, tenés q tener en cuenta q da turnos largos, llamá con tiempo!!",
            "post_id": "5550912",
            "timestamp": "1270758846",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "ok, gracias Andre! es q me quiero tomar un descansito,,, por ahi en mayo llamo, para un turno en junio o julio... tengo q ver. La semana que viene tengo turno c un medico clinico quiero hacerme un chequeo general, despues de castigar mi cuerpo con tanto tratamiento quiero que esté equilibrado y sanito. Yo me voy de vacaciones, finalmente en mayo. Asi que el mes que viene no hay busqueda, pero igual busque o no, no lo consigo! asi q no se si cuidarme o no, y no registrar nada, no sé qué hacer. Mi ciclo está hecho una cagada, y se ve que va a ser largo, tengo ese presentimiento.Chicas, que quede entre nos, pero hoy mato a alguien aca... no saben lo tranquilos q trabajan en comparacion con los argentinos!!! grrr , tengo una chica q trabaja conmigo y le tengo q pedir 10 veces las cosas!!! grrr",
            "post_id": "5550935",
            "timestamp": "1270759262",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chiquis, en mercado libre venden los TO y te dan TE tambien, mucho mas baratos que los de la farmacia",
            "post_id": "5550985",
            "timestamp": "1270760239",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Osi!!! Luis Pasteur es buenisima! la verdad que ni idea cuanto sale porque AUNQUE UD NO LO CREA la tengo por mi viejo! ya es hora de cortar el cordon! jajaja no en realidad me la sigue pagando porque como estoy en el exterior no tendria ninguna en los momento que visito arg.Los TO en arg es CARISIMOOOOOO!!!!!! todo en arg es carisimo, ya es una verguenza! no se que se piensan...aca los compro por internet, me vienen 30 y mes sale 5 dolares, un chiste!! antes de irme me llevo una caja jejeMary, yo te diria que ni te cuides en mayo! Que pasa si llegas a quedar embarazada en ese mes? el viaje se puede hacer igual o no??? a mi me paso lo mismo el mes anterior a viajar a disney, pense en cuidarme porque si quedaba no me iba a poder subir a nada pero despues pense, a la mierda si quedo de 10! y no me subire, preferia no desperdiciar ningun mes. Ademas uds no se van a europa? se supone que caminas bastante pero no te puede afectar tanto, solo que por ahi estas mas cansadita, pero por caminar no pasa nada, mientras no corras...",
            "post_id": "5551119",
            "timestamp": "1270762723",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola chiquis!! como andan? veo que un poquito mejor??? me alegro muchooooooooo, yo recien llego del trbajo suuuper cansada no volvi a casa en ttodo el dia...Chicas los TO los vende una chica por mercado libre yo tengo guardado el tel si lo necesitan ahora no me acuerdo pero creo que pague 50 pesos los 10 y venia y TE  de regalotodavia tengo guardados 8 porque al final no los use todos salvo el TE qe era el que me habia dado posi (buuuuuuuuuuuu) lo tire obvio me traia malos recuerdos...Si los necsitan les paso los datos...Y en cuanto a las prepagas todas tienen algo... la mejoricta es Osde, pero bueno,.. cuesta,... pero se puede usar el aporte de tu OSocial como parte de pago y te descuentan bastante!! obvio depende del sueldo que uno tiene... hay gente q conozco que no tienen que pagar nada d adicional!! es cuestion de llamar y ellos te dicen...besitos a todassssssssssssssssss",
            "post_id": "5551568",
            "timestamp": "1270770717",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! por fín llegó el viernessss!!Osito, mi gine me atiende por Medicus, por suerte tenemos esa Obra Social, mi marido trabaja para una empresa del grupo Clarín y la empresa la paga, creo q a él le descuentan 50 mangos... nada!!... no es un plan guau, pero... Seguro debe atender por otras Obras Sociales... será cuestión de averiguar... y sino ver cuanto cuesta la consulta privada...Lo de los test de ovulación, cuales usas, los Evaplan? porq yo los compré una vez y sí, son carísimos, después usé unos q compré por Mercado Libre, compré 20+ 5 de embarazo por 100 pesos, y a mí me resultaron buenos...Mary, no te agobies controlando todo, te vas de vacaciones!!... disfrutalas a full, pero seguí buscando!! descansá de las tempes, de la medicación, pero no dejes la búsqueda, en una de esas, relajaditos... ayyyy ojalá!! q lindo q vuelvas de vacaciones con sorpresa jajajjaChicas q pasen un lindo finde!!",
            "post_id": "5553049",
            "timestamp": "1270816623",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, buen dia! si es verdad Andre, me gusta controlar, jejeje.Me da cagagazo mas que nada no por hacer esfuerzos, porq el mayor esfuerzo es cargar la valija en subtes hasta los trenes, y eso. El resto, es caminar y no pasa nada. Mi mayor miedo es tener una urgencia y al no tener obra social, no saber q hacer quien me atiende... etc.... pero no voy a controlar nada y listo!!! Tampoco voy a hacer ningun tratamiento.Ana no solo en argentina, en UY tambien esta todo carisimo. El año pasado fui a USA, y me compre ropa en H&M y me salio tan barato que ya no quiero comprar nada mas aca. Son todos unos ladris x aca!¿ como estas andre hoy??? la pancita??Analia, pasa el dato... igual a mi me da cosita retomar con los TO! Ya les conte q mi doc me dijo q en mi caso con la lh alta, puedo dar falsos positivos!",
            "post_id": "5553267",
            "timestamp": "1270820834",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Bueno chicas aca ve el mail de la chica que los vende.... no se cuanto estaran ahora...: testdeovulacion es de gmail punto com lo escribi asi porque sin no sale....Que saben de la pagina de proyecto bebe, ya tiene graficos???Bueno chicas... buen finde!! a corazonear las que esten es los dias fertiles!!!!!!!!!besitosssss",
            "post_id": "5553422",
            "timestamp": "1270823575",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "no, no tiene... esperemos q lleguen pronto, no me gusta mucho la de aca... me da mucho error",
            "post_id": "5553450",
            "timestamp": "1270823843",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Holisssssssss!!!!! al fin llegue!!!!!! hoy todo el dia en la calle, desde las 7 am y recien llego... el to me lo hice recien, pero nada che, mas blanco que nunca, ayer y antes de ayer se marcaba pero hoy nadddaaaaaaaaa!!!!!!!!!! y bue seguire con los corazones haremos el esfuerzo jejejejejeje!!!!!!!!!! mariiiiiiiiiiiiii, vacaciones son vacaciones ok!!!! yo te entiendo porque tambien tengo que contrlar todo!!!!!!!! pero desconectate amiga!!!!!!!!!!!!!!!!Un besote argentinitas!!!!!!!!!!! me voy a descansar un ratito!!!!!!!!!! las quieroooooooooooooooooo",
            "post_id": "5555470",
            "timestamp": "1270860666",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Osito, el otro día hice algunas tareas para vos jjejej, averigûe y bueno, mi doc no atiende por tu Obra Social, la consulta particular cuesta $ 100, te hacen la factura y podés averiguar si la obra social te lo reintegra... Los test de ovulación los podés comprar en Mercado libre, o tengo un mail. el mismo q pasó Ana, ***@****, la chica se llama Marina y hay q ir a buscarlos a Belgrano...Cómo pasaron el finde??... yo estuve bastante ocupada, fuí a la endocrinóloga, tuvimos un cumple el sábado a la tarde, y a la noche salimos con unos amigos... domingo al mediodía asado, a la noche pizza... y a la madruga PATALETA jjajajja... ayyy chicas, q mala noche q pasé!!... tengo una piedrita en la vesícula y se vé q algo me cayó mal, me levantaba a cada rato, no quise tomar nada por las dudas, así q me la aguanté... A la mañana me fuí a sacar sangre para la Beta, y a la tarde voy a buscar el resultado... tengo un día bastante movidito!! por suerte se me pasó el dolorcito, pero hoy me voy a sacar turno con el gastro, xq me quiero quedar tranquila si me pasa otra vez...",
            "post_id": "5562610",
            "timestamp": "1271075519",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Andre! cuidate nena!! a hacer dieta eh! cualquier cosa me preguntas... bueno chicas que onda el finde?? yo descanse bastante, no veo la hora de empezar la busquedaaaaaaaaaaabesitos a todas como van sus ciclos????byeee",
            "post_id": "5562883",
            "timestamp": "1271080990",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, buen dia! como fue el finde? Yo descanse bastante, no hice mucho, no.Hoy tratando de no caer en bajon, porq ya me empezaron los sintomas aunq hoy como no bajó la tempe seguro se extienda el ciclo... me pasa siempre con el clomifeno, dicen q alarga los ciclos....es una cagada eso, bah es q estaba acostumbrada a ciclos más cortitos.Andre, tu doc atiende osde? yo reintegros tengo... creo q me reintegran x consulta unos $100.  ¡q feo lo del dolor q tuviste!!! como se te saca eso???Ana: vos sos nutricionista?besis",
            "post_id": "5562914",
            "timestamp": "1271081726",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! Mi notcia sobre el finde es QUE ME VINO!!!!!! No fue ninguna sorpresa porque ya la sem pasada me habia bajado la tempe, asi que ya la estaba esperando. Este mes es mi ultimo mes con clomifeno y ya despues se vera que hacemos...Estoy muy bien animicamente ya pensando en mi proxima sem fantastica, esta vez voy a tratar de usar a bob esponja!Andre que mal lo de la piedrita en la vesicula! dice que es doloroso no??Eso, ana, yo pregunto lo mismo, sos nutricionista??",
            "post_id": "5562961",
            "timestamp": "1271082387",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Mary, a la tarde lo tengo q llamar al doc para pasarle el valor de la Beta y le pregunto, supongo q sí, q por Osde debe atender...Ana!! ya sé q me voy a tener q operar en algún momento, xq la piedrita ya está, así q por ahora solo me queda hacer cosas para q no me joda tanto, así q si tenés algún consejito será bienvenido!!Chicas, es un dolorrrrrrr feito feito, primero sentía toda la panza hinchada, y después un pinchazo fuerte continuo, del lado derecho, justo donde terminan las costillas, con Buscapina se pasa enseguida, pero no quería tomar nada, así q me levanté, tomaba agua, caminaba... no sabía como hacer!!... pero por suerte ya pasó... es así, viene y se va de golpe... al gastro sin falta!!",
            "post_id": "5563034",
            "timestamp": "1271083556",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "si, yo creo que mucha agua debe ayudar bastante, igual preguntale a tu doc... porq algunos medicamentos están permitidos y eso te ahorraria sufrir!",
            "post_id": "5563133",
            "timestamp": "1271085025",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Andre gracias amiguiis!!!!!!!!!! voy a seguir averiguando, igual pasame bien el nombre y donde atiende, si es alguna clinica mejor porque en cuanto me dan el recibo de sueldo de este mes me pongo en campaña para pasarme de obra social!!!!! que feo lo de la piedra pero sabes que buscapina podes tomar durante el embarazo igual preguntale al doc que te dira en que medida....Opte por suspender los to, el del otro dia me dio dudoso y yo lo considero positivo jajajaja es que son muy caros como para dudar pero encontre por mercado libre un test en saliva, alguna lo conoce? servira? es el del microscopio pero es reutilizable (ellos dicen para siempre pero creo que dura uno o dos años) y mucho mas barato en comparacion con los evaplan que son 5 y cuestan $75 y este $170... Que opinan???Todo bien el finde??? rati que mal amiga pero ya vas a ver que va a llegar el dia en que no la vamos a ver mas!!!!!!!!Un beso gigante para todas y buena semanaaaaaaaaaaaaaaaaa",
            "post_id": "5563162",
            "timestamp": "1271085453",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Sí, se puede tomar Buscapina, pero q se yo, me lo aguanté igual por las dudas... pero hoy sin falta le pregunto al gine y q él me confirme si puedo tomar en caso de q me vuelva a pasar... ojalá q no me pase más!!!!Osito, se llama Marcelo Martinez, el consultorio está en Larrea 1035 1º B, es a media cuadra del Instituto del diagnóstico, y los teléfonos son 4821-2305/06",
            "post_id": "5563585",
            "timestamp": "1271093251",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, si soy nutri...!Y Andre??? quiero saber como te fue con la betaaaaa!!!???Chicas lo de los To es relativo, depende justo cuando te da el pico de LH, y calculo q el de saliva sera lo mismo (?) segun lei lo mejor es realizarlo dos veces al dia a la misma hora asi agarras el + seguro pero es mucha plata!!!!besosssss",
            "post_id": "5565203",
            "timestamp": "1271121791",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! fuí a buscar el resultado de la Beta, y subió un montón!! 10442 mUI/ml...!! más tarde lo llamo al gine a ver q dice, pero para mí está bien, no????Hoy ya estoy re bien otra vez, anoche dormí como un angelito y hoy no me quería levantar!! tenía sueño atrasado jajjjaQ pasen un lindo día!!",
            "post_id": "5566315",
            "timestamp": "1271160070",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Buenos dias chiquis!!!Ana, te tengo una consulta como doctora!! jajaja! Mi caso es que mi gine me dijo q por la relacion invertida de la LH mayor a la FSH en un dia 3dc, es resistencia a la insulina y me dio metformina.... pero jamas en mi vida me dio mal un analisis de sangre de medicion de azucar en sangre. Mañana voy al clinico para q me confirme esto, seguro me mande estudios... porq aun no me cierra el diagnostico del gine. ¿Que analisis determina si tenes resistencia a la insulina? ¿Qué tipo de estudio de sangre? Y si tuviese, ¿hay q hacer una dieta especial? Gracias!! jejeje pobre Ana, pero me venis como anillo al dedo!!Andre!! que bueno amiga! me pone re contenta, ¿que te dijo el gine??Besitos a todas!!! muacks!!",
            "post_id": "5566595",
            "timestamp": "1271165327",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Maria, Hay varios factres que determinan la resistencia a la insulina, pero el que mas usamos es el HOMA, un indice que resulta de relacionar los valores de insulina y glucemia, hasta donde yo se (no soy endocrinologa) la relacion LH /FSH no determina ese diagnostico, el clinico teva a aclarar el panorama, salvo que ya tengas hecho los otros estudios!,Andre!! sera uno solo? ajajjaja preguntale a laura martinez cuanto le dio pero me parece q a  ella de una ya le hbia dado  mas de 2000 asi q me parece q zafaste ajajajabesitossssssss",
            "post_id": "5567068",
            "timestamp": "1271173153",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "No Ana, me hablo de resistencia a la insulina y no me hizo ningun analisis de sangre :(, excepto el de la LH/FSH. Conoces alguna bueno endocrinologa en capital?Andre, no creo que sean 2!! bah vos q queres? a mi el medico este me dijo q omifin el riesgo de multiples era menor, el riesgo grande es con menopur y eso... creo q lauri se administro ampollas de menopur.",
            "post_id": "5567835",
            "timestamp": "1271184775",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Mari, a mi me hicieron lo del test de resistencia a la insulina, con el índice HOMA... en ese momento me salió q tenía la glucemia un toquecito alta, pero nada más, no tengo resistencia a la insulina... Me lo mandó a hacer el gine, y después me derivó a una diabetóloga, me hicieron una curva de glucosa, y como yo tengo antecedentes familiares de diabetes, me dijo q la repita cada tanto, para control...No creo q sean dos!! noooo, me vuelvo loca!! jajjajaj El día q fuí al gine le llevé la eco de control de ovulación, y tenía un foli de 21 mm y el otro de 14, me dijo q el q rompió fué el de 21, así q no creo... bah creo q depende de eso no???Lo de los embarazos múltiples es una posibilidad, el médico apenas empecé con el Clomifeno me dijo q era posible... Me voy corriendo a ver la Beta de Laura!!!!jjajjjaChicas q día de mierd.......!!! cómo llueve!!! cada vez me está costando más levantarme tan temprano!!!",
            "post_id": "5570451",
            "timestamp": "1271246439",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Maria, la verdad no conozco nada de capital porque trabajo solo en zona oeste, quizas alguand e las chicas pro aca te pueda ayudar.. pero no te alarmes que me parece que necesitas otros analisis antes de ese diagnostico, que ademas de ser asi, con dieta ejercicio y el peor de los casos con una pastillita se regula todo!!!!,besitos a todasssssssss byeeeeeee",
            "post_id": "5570598",
            "timestamp": "1271249419",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola ! CHICAS gracias x la respuesta!!Les cuento que hoy tengo turno con el clinico, asi q espero que me mande a hacer estudios como Dios manda! Ojala me de bola! Los medicos son muy raros!Ana: ¿tendra algo que ver con mi colesterol alto del cual se desconoce la causa?Andre: como va la panci???Yo aca, se ve que ovule el 15 dc, ahora me cierra un poco mas todo.... el clomifeno me retrasa mucho los ciclos y estoy con SPM hace dos dias... ya no tengo esperanzas, asi q la espero a mi amiga para mañana. Con amor, porq es parte de mi, jejeje, me leo y no puedo creer lo resignada q estoy ya con estoy.Estoy sola hoy, mi marido está en baires y yo tengo q laburar! Grrr",
            "post_id": "5570935",
            "timestamp": "1271254742",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "chicas buen dia, ya estoy desesperada! apenas tengo un leve sintoma de SPM, pero ya no se ni cdo ovule... mis ciclos no superan los 28 dias, el mas largo fue de 29 con clomifeno. Como el clomifeno alarga mis ciclos, ya que ovulo mas tarde, no me preocupé hasta hoy, porq ya 16 dias de fase lutea, creo q es mucho. Tengo mucho miedo y estoy paralizada! no tengo ningun sintoma de embarazo, tengo miedo q sea algo malo! me da terror hacerme un TE! PERO YA NO AGUANTO MAS! Que hago??? ayuda! para colmo mi marido esta de viaje, y no le dije nada para no preocuparlo!",
            "post_id": "5574733",
            "timestamp": "1271342367",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Bueno chicas, no aguante mas y me hice un TE!!! OBVIAMENTE NEGATIVO TOTAL, con una sensibilidad de 25! En vistas a que tengo 37 de temperatura, no me va a bajar hoy!Recen por mi, tengo miedo de tener algo malo.un beso",
            "post_id": "5574862",
            "timestamp": "1271344583",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "amiga tranquila!! desde esta manana que trato de escribirte en tu muro y no me deja!! no se que pasa...no puede ser nada malo!! por ahi definitivamente ovulaste mas tarde entonces todavia hay que esperar...de ultima si estas tan intraquila anda a una guardia y que te saquen sangre para ver que realmente no estes embarazadasuerte amiga!!!! cualquier cosa que necesites escribe!! besotessssssss",
            "post_id": "5575026",
            "timestamp": "1271347784",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "A mi me pasa lo mismo c tu muro y el de analia! No me guarda los mensajes!Ayyy no se! lei tantas cosas q puede ser un quiste folicular! estoy re cagada! Mañana a la mañana agarro a mi marido y me voy a la guardia. El no regresa hasta hoy a la noche!",
            "post_id": "5575600",
            "timestamp": "1271358065",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "si es un quiste no te asustes porque no es NADA! A mi me encontraron uno en octubre justamente porque no me venia pero lo que tenia era un manchado marron...pero por otro lado me acuerdo que las tempes que tenia antes de saber lo del quiste y cuando ya estaba preocupada que no me venia (lo te por supuesto era negativos) era bajas! y las tuyas estan altas! asi que porfa no te hagas la cabeza de antemano....besotes amiga y aqui estamos esperando tus noticias!",
            "post_id": "5575629",
            "timestamp": "1271358414",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola Mari!! ayer te dejé un mensaje, xq nunca paso x los gráficos y cuando pasé por el tuyo y vi esa tempe, más los días de Fase Lútea... se me ocurrió q pintaba para posi!!... no te hagas la cabeza con cosas raras, pero no dejes de ir al médico mañana!!... contame q pasó cuando tengas novedades!!Un beso grande!!",
            "post_id": "5575813",
            "timestamp": "1271361667",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola Andre! si gracias! lei tu mensajito en mis notas!Les cuento q estoy re cagada porq ya no se ni cuando ovule! y me duele mucho el bajo vientre. Y lei por ahi q puede ser un quiste o un ectopico, y me da mucho cagazo! me hice un TE con sensibilidad de 25 como el de clearblue... y me dio negativo! ahora no puedo parar de pensar!Para colmo ayer fui al medico clinico, y me dijo que mi ginecologo no me puede mandar a tomar metformina sin hacerme estudios mas especificos de sangre, que pare de tomarla durante 10 dias y desp. me haga el analisis q me mando.... uno me dice una cosa, el otro otra cosa... ya estoy perdida! No se ni que hacer, la semana q viene tengo turno c la ginecologa mia de toda la vida en baires y la pondré en autos. Ella no es de fertilidad, pero haber q opina al respecto!Mañana a la mañana me voy a la guardia... espero q me haga una eco, es lo unico q me dejaria tranquila.un beso a todas y gracias!",
            "post_id": "5575862",
            "timestamp": "1271362592",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "MAria!!, quedate tranqui!! los ciclos suelen alargarse,., los mios JAMAS pasaron de 27/28 dias y el ultimo estuvo en 29, sin clomi ni nada, solo que estuve muuy nerviosa... los ciclos se alargan o se achican muchas veces por nuestra cabecita loca!, igualmente para quedarte tranquie andat a la guardia, el tema es q te hagan la eco... a veces si no tienen necesidad no la hacen, de ultima la agrandas y listo... pero tranui amiga que no pasa nada seguro es solo un atraso por el clomi... y en cuanto al doc, espera a tu gine de confianza, ya te decia yo q lo de la resistencia a linsulina estaba muy tirado de los pelos....sera por la metformina que se atraso un poco??? espera a verla... en 10 dias vas a tener el panorama mas clarobesis a todas!!!!",
            "post_id": "5576639",
            "timestamp": "1271375804",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola Mari, ví q al final bajó la tempe, es una tranquilidad amiga, saber q solo fué un ciclo q se alargó... La semana q viene sin falta a tu gine eh!!... llevale tooooodo lo q tenés, análisis, lo q tomás... y hacele todas las preguntas necesarias para quedarte tranquila... Un beso grande y q pasen un lindo finde!!",
            "post_id": "5578076",
            "timestamp": "1271420858",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, al final no fui a la guardia... como bajó la tempe a 36.5° (estaba sostenida en 37) voy a esperar, si mañana no viene de cabeza me voy a la guardia.Gracias chicas!! no se que haria sin ustedes! es increible la relacion que formamos aun sin conocernos, gracias de verdad!Ana: el clinico me dijo q no tome mas, y haga los analisis. Me dijo q no me pueden diagnosticar sin analisis, asi q ya veremos!Andre: siii bajo! esperemos q venga! nunca ha sido tan bienvenida la W! No veo la hora que se termine todo esto! y tomarme un descanso!",
            "post_id": "5578273",
            "timestamp": "1271424950",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Menos mal que las cosas se aclaran Mary, vas a ver que todo va a ir bien y te va a llegar. El descanso te va a venir super bien! Yo tambien estoy pensando en uno porque este es mi ultimo mes con clomifeno y si no quedo ya para mayo largo las tempes, los TO, toodoo y a relajarse!Chicas que pasen muy buen finde!! besotes a todas!!",
            "post_id": "5578361",
            "timestamp": "1271426325",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola amigas!!!!!!!!! si rati ando perdida, es que estoy en un monton de lados y al final en ninguno jejejejeje y para colmo estoy a ful coin el laburo, asi que por estos dias voy a estar desconectada aunque entro aca y siempre leo este forito pero a veces  no contesto porque me tarda un monton y termino cerrando todo, mi maquina anda para atras jajajajaMari, tranqui amiga, que haya bajado la tempe te va a relajar no se por que tenes tanto miedo, si es un quiste no es nada como dijo rati corazon, pero si es un ectopico tendria que dar porsitivo el test asi que relax amiga, pensa en tus vacas!!!!!!!!!!!!!!Las quiero chiquis!!!!!!!!!!!!!!!!!!!! Besitossssssssssssssssssssssssss",
            "post_id": "5578503",
            "timestamp": "1271428790",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Chicas me esta bajando!!!!! estoy mucho mas aliviada, no puedo creer q este diciendo esto! pero en fin, es un alivio.gracias y besos!",
            "post_id": "5579104",
            "timestamp": "1271439430",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Que bueno mari!!!!!!!!! jajajaja, que raro alegrarnos no???? pero bueno ya vas a ver que se va a ir prontito!!!!!!!!!!!!!!Como estan amigas???? yo sigo con mi flujo clara de huevo jajajaja, ni cuando supuestamente ovule vi tanta jejejeje!!!!Estuve averiguando obras sociales, la que yo tengo saco la clinica en la que me atiendo asi que si o si me tengo que cambiar. Rati averigue la pasteur, es buenisima pero aparte de lo que me descuentan tengo que poner 500 pesos es muchooooo, pero te cubre tratamientos de fertilidad amiga fijateeeee!!!!Por ahora la que mes me convence es OSPE, alguien la conoce??? lo que tiene de bueno es el San juan de Dios en ramos... ahora tengo una duda, supongamos que este mes quede, me atenderan el parto? tendre carencia? yo creo que no, porque supuestamente deberian contarme la antiguedad no? la verdad que no se jejejeje, si alguien me ayuda!!!!! Un beso gigante amigas!!!!!!!!!!!!!! las quieroooooooooooooooo",
            "post_id": "5585681",
            "timestamp": "1271621122",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Mari!! q suerte q te vino amiga!!... ahora sí fue bienvenida... pero q no se haga la loca q mucho no la queremos eh!! jajajja... después contá como te fué con el gine...",
            "post_id": "5587865",
            "timestamp": "1271679157",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas como anduvo ese finde? y el granizo?? por aca cayo muuuy chiquito pero cerca estuvieron unas pelotas enooormes!!, me imagino habran aprovechado para cucharear.. esta mediando abril y todavia estoy aca esperando el posi de alguna!!!Chicas lo de la OS es un tema, generalmente las carencias por embarazo son de 10 meses, para que no entres embarazada, pero si te embarazas despues no hay drama!, igual una vez lei algo de una ley que prohibia las carencias... pero no se como es eso ahora....Bueno qe empiecen bien la semana!! besosssss",
            "post_id": "5588083",
            "timestamp": "1271684048",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola chicas buen dia, espero q hayan tenido un lindo finde!Besos",
            "post_id": "5588087",
            "timestamp": "1271684100",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Any (ratita) no puedo dejarte mensajes!!!! no me deja!",
            "post_id": "5589536",
            "timestamp": "1271706872",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! Hoy lunes aca fue feriado asi que andaba como si fuera domingo y casi ni entre!Osi, ni sabia que pasteur cubria fertilidad, en junio de cabeza me meto en eso, gracias por el dato!! Y lo de las carencias me mataste, con eso no puedo ayudarte..Chicas increible lo del granizo!! lo vi online y no lo podia creer!! alguna tuvo destrozos de autos o algo por el estilo??Mary, todavia sigue el problema para dejar mensajes??!! que mal!! a mi recien ahora me dejo escribirte, te deje uno hace un ratito!!Yo estoy a la espera de este finde, que si es como el anterior ya estaria ovulando...quiero tomarmelo muy tranqui, aun no decidi si tomarme o no la tempe, siempre me pasa lo mismo pero las ganas de saber me ganan!!Buena semanita para todas bombonazas!!",
            "post_id": "5591111",
            "timestamp": "1271733320",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Buen día chicas, como estan?? q increible lo del granizo! pero cada 4 añitos pasa en Bs As! a alguna se le rompio algo??Ana, sabes que no me llego ningun mensaje... me fije si sin querer te bloquié, pero no. A mi me deja escrbirte, pero cuando le doy post... no se guardan! ni notas ni msn privado! rarisimo!!!El jueves voy a la gine, a ver q opina y el lunes 3/5 tengo endocrinologo. Yo creo que con tres opiniones me voy a quedar tranquila. Segun mi clinico no hay resistencia a la insulina, y me mando estudios de sangre (el gine no me hizo, solo se guió por lo hormonal) asi q un endocrino es el experto en eso. Ya ahi voy a confirmar si estaba mal diagnosticada o no. Desp. q vuelva de las vacaciones voy a buscar otro doc!q tengan lindo dia!!",
            "post_id": "5592324",
            "timestamp": "1271771678",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "MAria, que raro te deje dos una ayer y otra hoy, fijat en el perfil, a mi me llegaron ls tuyas.... El endoc CON MAS ESTUDIOS si te  lo  va a confirmar o desmentir,,, qeudat tranqui hasta ese dia....BEsisss",
            "post_id": "5592805",
            "timestamp": "1271778916",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola chicas buen dia!!!! yo aca soportando comentarios de la pastera! q garron... ni q fuera un river - boca, esto!besos a todass",
            "post_id": "5596865",
            "timestamp": "1271861753",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!!!!!!!! por donde andan????No les des bola mari!!!!!!Les cuento que estoy super triste hoy bajo un pelin mas mi tempe asi que se que se acabo, solo espero que me baje aunque todavia no vi el manchadito que me aparece dos dias antes... estoy super para abajo, es que este mes tenia un presentimiento, pero bue, se que se me va a pasar!!!!!!!!!!!!!!!!Las extrañooooooooooooooooooo",
            "post_id": "5598748",
            "timestamp": "1271891451",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Hola Osi!!! y como fue la tempe hoy??No te deprimas, porfi!! hay meses q son peores q otros, porq algunos meses estamos mas fuertes y otros c mas ilusiones. ojala pronto se nos de!!!beso a todassssssssss!!",
            "post_id": "5600822",
            "timestamp": "1271944842",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "hola chicas!! estoy media desaparecida, mil perdones! es que estoy teniendo dias de locos, ojala que esto ayude a despejarme y olvidarme del tema!A Osiii que mal lo de la tempe, no te deprimas please, no soy la mas indicada en decirlo pero voy a dar animos como uds me dieron a mi cuando yo lo estuve...arriba que ya pronto lo vamos a conseguir!! Igualmente aun no te vino asi que a no perder las esperanzas, te acordas que a Andre le habia bajado la tempe justo cuando le tenia que venir, despues volvio a repuntar y luego la sorpresa!! A pensar en +++++!!!!Besotes y abrazote grande!!!",
            "post_id": "5601432",
            "timestamp": "1271955834",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! cómo andan???... Osito andás de bajón???... ya sé como te debés sentir, así q desde acá te mando un abrazo grande grande y arriba eh!!...q un día de bajón te perdonamos, pero después hay q seguir luchando si???Yo esta semana estoy a full, mi jefe se fué unos días de vacaciones, así q estoy aprovechando a hacer trámites y cositas personales, q cuando está él no las puedo hacer, cada vez q le pedimos algo hay q aguantarlo con cara de ort..., así q estos días me estoy poniendo al día con mis cosas pendientes!!...Sigo sin náuseas ni nada de eso, solo mi dolor de tetotas, q esas sí q están creciendo eh!! jjajja, sueño, y un poquito más cansada de lo habitual... y el sábado tengo la eco, q espero q veamos algo!!Un beso grande para todas!!",
            "post_id": "5602061",
            "timestamp": "1271965331",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "que lindo andre!!! ya la primera eco no??? despues contanos todo!!",
            "post_id": "5602805",
            "timestamp": "1271978727",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Que bueno Andre!!! contanos pls!!!osi q tal hoy??besos a todas",
            "post_id": "5604568",
            "timestamp": "1272031093",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chicas, alguna sabe algo de Fernanda (lechuguina en 28 dias) y de la otra chica argentina q le habian recomendado la donacion de ovulos, de zona oeste de Bs As... pero desp. iba a comenzar con estimulacion... no recuerdo su nombre??? ¿alguna recuerda a ella?",
            "post_id": "5604652",
            "timestamp": "1272032471",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola amigas!!!!!!!!!!!!! no saben la cantidad de pruebas que tengo para corregir!!!!! no tengo tiempo de nada!!!!!!!!!!!! Mari no me acuerdo pero las buscaremos..Suerte andre mañana!!!!!!!! que emocion!!!!!!!!!!!!!!!!!!!!Yo sigo igual, aunque hoy un poquito mas cagada, no me quiero hacer ilusiones pero hoy tenia la tempe 36.5 (ya se que es baja pero en mi es alta jajajaj) aunque mi flujo esta oscurito, no manchadito pero tipo amarillo fuerte... ayer me hice un te y salio negativo (es que tengo que empezar con progesterona lo antes posible), mari mis ciclos suelen durar menos y empiezo a manchar antes, tipo en el dia 25, hoy es 28, mi fase lutea generalmente es de 12 dias, con lo cual oficialmente tengo un atraso pero no me siento embarazada y creo que la menstruacion baja en cualquier momento!!!!! tengo muchos nervios pero no me quiero ilusionar porque se que la caida va a ser peor!!!!!!Buen fiende amigas!!!!!!!!!!!!!!!!!!!!!!!",
            "post_id": "5606066",
            "timestamp": "1272057073",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Ayyy osi! para mi estas ! es que sabes la cantidad de casos q la primera vez les da negativo???? y no de 28 dias, conozco gente... hace 4 meses una de mis amigas le paso eso y no le comenzaron los sintomas hasta la semana 5! asi q no pierdas la fe, fijate en tu grafi si la ovulacion se pudo haber retrasado y conta 12 dias. Ayy nena q emocion!!! y tenes 12 dias de FL!!! GUACHAAAAA!!!!!!! Yo tengo 15 dias!! es eternooooooo!! jejeejeBesos y animos!!!! avisanos y a corregir las pruebas!!!!!",
            "post_id": "5608524",
            "timestamp": "1272129705",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chikis!! como andan???? buen finde para todas!!OSii!! que nervios???!!! seras la embarazada del mes??? si es asi por fin me estan haciendo caso... quiero que una a una ( si quieren de a dos no me ofendo..) se me vayan embarazando mes a mes asi quedo yo solita para junio/julio y recibo atencion personalizada!!! ajajajaBueno Andre lo logro en Marzo y crucemos todas los dedos por Osito!!!!!!!! sabes OSi que estamos aca para hacerte el aguante SEA O  NO SEA lo que deseamos!FUERZA!!!!!!!!!!!!!!!y buen finde para todas! besitos!",
            "post_id": "5608581",
            "timestamp": "1272130964",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Ayyy chicasssssssssss!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! OSi tiene un tempe hermosa!!!!!!!!!!!!!!! que contenta estoyyyyyyyyyyyy!!!!!!!!!!!!!!!",
            "post_id": "5611165",
            "timestamp": "1272209706",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "jjajajajaja!!! chicas las necesito mas que nunca tirandome energia super positiva!!!!!!!!!! jajajajaja, esoty de los nervios y super cagada!!!!!!!!!!!!!!! mañana a la mañana me hago otro test, ayer me hice uno pero estaba fallado el muy p..... asi que mañana saldre de dudas y si es posi llamo a mi gine para empezar con la medicacion, pero no voy a estar en todo el dia jajajajaja, asi que me voy a moriri de ganas de contarles si me dio posi, como aguanto todo el dia???? es que me voy con mis niños a la feria del libro y volveremos a las 7 de la tarde al cole asi que a mi casa estare llegando mas tarde!!!!! Gracias por estar ahi!!!! no saben lo bien que me hacen... hace mucho que no sabemos nada de cinde no???",
            "post_id": "5611214",
            "timestamp": "1272211041",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!!... antes q nada!! vieron la tempe de Osito de ayer???... ayyyy me parece q voy a tener compañerita de panza!! q emoción!!yo tuve la eco el sábado, mi super bebé, bah mi super porotito mide 9 mm, no me dieron el informe de la eco, lo tengo q ir a buscar el viernes, así q no tengo fotito todavía, pero bueno, lo más importante es q está bien, vimos el saquito y adentro estaba mi porotín!!... el doc lo pintó con el cursor y escuchamos como le latía el corazón a full!!... recién en ese momento tomé conciencia de q llevo una vidita adentro mío jejje... y bueno, obvio me puse a llorar!!... pero esta vez de alegría!!Q tengan una linda semanita amigas!! y Osito, tu gráfico está genial, sabés q para lo q sea estamos acá eh!!",
            "post_id": "5613934",
            "timestamp": "1272286209",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Buenos dias chicas!!!! como estan??? como fue el finde???Si  Ana!! que sea una preñi x mes! jejeje asi vamos cayendo cada una de nosotras!! polvos polvos, jajajaja sonó feo, pero de bebe! jeje... bue del otro tambien!Andre: q lindoooo!! 9 mm es un poroto recien nacido!!! jejeje, me imagino la emocion! me pone super feliz x vos!!! ya se lo contaron a la flia?OSOOOOOO me estas matando de los nervios! anda a un cyber, y contanos porfaaaaaaa!besos!!!",
            "post_id": "5614062",
            "timestamp": "1272289044",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Osoooooooooooo no nos dejes esperandooooooooooooo queremos novedadessssssssss!!!!!OSi es la candidata del mes de abril y tiene todos nuestros votossssssss!!!",
            "post_id": "5614081",
            "timestamp": "1272289313",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "hola chicas!!! yo tambien me estoy comiendo los codos por Osito, YA quiero saber!!!Como viene el comienzo de semana?? aca con lluvia!!Les cuento que yo la semana que viene me voy de vacaciones, mas precisamente el 7 de mayo!! y estoy volviendo el 21...supoongo que algo me conectare para ver sus novedades, pero no para subir tempes, porque ya decidi que confrimo mi ovu en los proximos 3 dias y largo el termometro, me pone muy nerviosa! ojala lo pueda hacer! ademas no me quiero llevar termometro al viaje, ya que el mes que viene no tomo mas clomifeno no me voy a tomar las tempes, las abandono (a las tempes por supuesto, a uds no!)Les mando un beso gigante y que tengan excelente comienzo de semana!!",
            "post_id": "5614156",
            "timestamp": "1272290418",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Q BUENO!!! A DONDE VAS??? POR ALLA??Yo la otra semanita tb me voy! iupiii",
            "post_id": "5614229",
            "timestamp": "1272291804",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "sisi aprovechamos nuestro ultimo tiempo en usa para pasear por los angeles y san francisco que no conocemos, ya que estamos aca aprovechamos porque en breve nos vamos!que dia te vas mary?? cuanto tiempo?? y contanos que lugares vas a estar visitando!",
            "post_id": "5614426",
            "timestamp": "1272295058",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Que lindo! si aprovecha! la costa oeste es re linda... desde S. Francisco a S. Diego, esta muy bueno... yo estuve hace como 8 años en california, y me re gustó...especialmente San francisco. Nosotros nos vamos el 15/05 y regresamos para la primera de junio (3 semanas),,, hacemos londres, amsterdam, berlin, munich, Praga y no se si viena...... vamos enganchando con el tren!ayy q nervios con osito! esta en la feria del libro !!!",
            "post_id": "5614709",
            "timestamp": "1272299688",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "woooww que lindo viaje!!! yo diria que ni te cuides en el viaje porque vas a estar tan relajada y contenta que por ahi eso te juega a favor! ojalaaa!!!si Osi dijo esta en la feria, quiero saberrrrrr!!!!!!!!!!!",
            "post_id": "5615097",
            "timestamp": "1272305212",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Perdon perdon perdon!!!!!!!!!!!!! llegue, re tarde jajajajajajajaSi amigaaaaaaaaaaaaaaaaaaaaassssssssssssssssss es posiiiiiiiiiiii!!!!! no lo creo y por cuestiones de salud mental prefiero guardar la cordura jajajajajajaj e ir paso a paso, ya empece con la proges hoy y con el acido folico de 5 en lugar de 1mg, ya llame a mi gine, mañana la veo y les cuento bien NO LO CREO!!!!! Y QUIERO QUE ESTA VEZ DURE!!!!! asi que ahora si que las necesito mas que nunca!!!!!!!!!! Las quiero muchisimo!!!!!!!!!!!!!!Andre!!! que bueno que viste a tu piojito! es una alegria gigante!!!!!!!!!!!!!!!Un beso grande amigas!!!!!!!!!!!!!!!!!!!!!!!!!Ah, alguna sabe como se marac el posi en la graf????? jajajajajaj",
            "post_id": "5616457",
            "timestamp": "1272327291",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "SISISISISIS!!!!!!! OSITO!!! QUE FELICCIDADDDDDDDDD!!!!!!!! Desde aca todas ponemos fuerzas para que  esta vez se agarre biennnnnnnnnnnnnnn fuerte!!!!!!!!!! LA rayita es tenue porque mirando bien tu grafi para mi se implanto hace unos dias!!!, no podes poner posi en el grafico,tenes que crear el de embarazo!!!Marzo: AndreAbril: OsiMe parece bien que me hayan hecho caso:Ahora:Quien se anota para Mayo????????",
            "post_id": "5616548",
            "timestamp": "1272329119",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Hola Osi!!! muchisimas felicidades amiga!!! estoy re contenta!!! es verdad lo que dice analia, es q se implanto hace poquito! es mas yo creo q ovulaste entre el 15 y 16. Asi q tranqui!!! y a disfrutar mucho, q te lo mereces!!!Hay una opcion para poner el posi, fiajte es hpt! besossss",
            "post_id": "5616650",
            "timestamp": "1272331444",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "VAMOOOOOOSSSSSSSSSS!!!!!!!!!! VAMOSSS CA-RA-JO!!!!!! jajajaja estoy feliz por vos Osito!!!! feliz felizzzzzzzzzzzzzzzVamos chicas que seguimos TODAS!!! lo vamos a conseguir en breve!!! Y cuando ya estemos todas con nuestras panzas nos juntamos a tomar un cafecito en Palermo para festejarlo! jajajaBesotes amigas!! Y Osi a disfrutar y a cuidarse!!",
            "post_id": "5616898",
            "timestamp": "1272336002",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Ositooooooooooo!!! q alegría tan grande amiga!!!! chicas nos está trayendo suerte nuestro forito eh!!!!!! vamos q dentro de poco va a estar lleno de panzas!!!!!!!Q suerte Osinguis q ya lo tenés!! ahora tranquilita eh!!... te lo digo yo, q estoy re cagada  jajjajaj, pero bueno es normal estar un poco asustaditas, tenemos q ir paso a paso y disfrutando a full de las pequeñas alegrías q nos dan nuestro porotos día a día!! Además estamos todas acá haciendo fuerza para q esté bien agarradito a su mamá Osa, así q esta vez todo va a salir bien, te lo merecés después de tanta lucha amiga!! disfrutalo mucho mucho!!Quién sigue para Mayo??????... Un beso grande chicas y q tengan un lindo día!!",
            "post_id": "5618371",
            "timestamp": "1272380263",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, buenas y santas! yo acá c muchoooo trabajo!donde se metio la nueva mami?? osiii? Contanos todooooooooo!!!Besos a todas!",
            "post_id": "5618811",
            "timestamp": "1272386458",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Amigas, estoy con perdidas me mandaron reposo absoluto por 15 dias, progesterona que ahora me la pongo vaginalmente y buscapina en perlas…. estoy en off, hoy llore mucho pero no puedo caerme, voy a tratar de ser lo mas positiva que pueda (aunque con mis antecedentes ….) pero bueno, son las novedades, la semana que viene vuelvo a ver a la gine y ahi me mandaran una ecografia, por ahora a esperar, tengo mucha fe aunque se que puede pasar cualquier cosa…Solo recen por mi!!!!! no voy a poder comunicarme tanto pero siempre pienso en ustedes!!!!! gracias gracias graciasHoy mi tempe bajo un poco a ver mañana como esta, para mi es un gran indicador, si bien todavia estoy dentro de mis limites de tempe alta bajo un poco aunque puede estar alterada porque dormi poco!!!!!!!!!Las voy a extrañar muchisimoooooooooooooooooooooooooooo",
            "post_id": "5620520",
            "timestamp": "1272411630",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Fuerza Osi!! yo pase por dos innombrables asi q entiendo tu miedo... ESTA VEZ SI!!!!tenete fe!! estamos aca todas rezando por vos! VA  A SALIR TODO BIEN, por favor cuidate muchoooooooo te queremosssssssssss!!!!",
            "post_id": "5620621",
            "timestamp": "1272413359",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Osi amiga FUERZAS!!! Muchas personas pasan por eso y terminan con sus bebes en brazos, hay que ser positiva y rezar mucho para que todo salga bien....estas en mis oraciones y rezos reina, cuidate mucho!! te queremos!!!!!!!!!!!!",
            "post_id": "5621064",
            "timestamp": "1272421293",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Osito!! estamos todas rezando y haciendo fuerza con vos para q tu bebé esté bien!! a veces los embarazos empiezan complicados o con cositas raras q nos hacen asustar pero no significa q no vaya a seguir adelante, vos tenés q tratar, aunq sé q es dificil, de estar tranquila, hace reposo absoluto y no llores, por favor!!Te mando un beso y un abrazo gigantes!!... y no te preocupes si  no podés entrar a contarnos nada...lo importante es q te cuides... a vos y a tu bebé!!",
            "post_id": "5622192",
            "timestamp": "1272456895",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Osi!!!! animos nena, q tenes tanta gente haciendo fuerza por vos que va a salir todo bien! Vos cuidate mucho, descansá, y relajadita porfa. Aprovechá a descansar y que te mimen mucho mucho! Vas a ver que prontito va a estar todo bien!!! la progesterona ayuda un monton para q se implante bien y se agarre fuerte. Desde acá mi energia más positiva, y a pedir a Dios que prontito esten los dos re bien! muchos besos!!",
            "post_id": "5622599",
            "timestamp": "1272463857",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Chicas!! pasé por la casita de Osito en 28 días y dice q ya no tenía manchado!! solo algunos dolorcitos, pero nada marrón ni nada de eso!! sigamos haciendo fuerza desde acá para q ese bebé se le prenda bien!! como una garrapatita!! jajjajaj Osito va a estar todo bien, seguí haciendo reposo y cuidate mucho mucho!!!Cómo andan ustedes???... yo corriendo de un lado al otro... llevé a mi vieja al médico y le mandaron un montón de cosas... encima soy la única q se ocupa de ella, xq lo q es mi dulce hermanita... nada de nada... Me voy a pedir un día en el trabajo para hacer algunas cosas, xq no puedo estar pidiendo permiso para salir dos horas todos los días, así q cuando venga mi jefe se lo diré... hoy ya veo q voy a tener un día!!! uyyyy con la cara de ort... de mi jefe!! quién lo aguanta!!!!",
            "post_id": "5626293",
            "timestamp": "1272545742",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola Andre, ¿está bien tu mamá?. Mira, en mi caso, en mi trabajo tengo mucha libertad de salir y llegar, y hago todos los tramites asi... me ausento dos horas, etc... porq si pido el dia, los muy turros me lo descuentan!!!!! y es un monton de $$$q bueno lo de osito!!! estoy haciendo mucha fuerza.",
            "post_id": "5626390",
            "timestamp": "1272548314",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola Chicas, ya crearon graficas en proyecto-bebe... son mas onda 28 dias. Igualmente hoy es el 1° dia, y no carga bien el sistema.",
            "post_id": "5627205",
            "timestamp": "1272562763",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "uyy que bueno!! voy a ir mirando!! gracias por avisar!me re alegro que osito no haya tenido manchado ayer! estoy segurisima de que todo va a salir de 10!!besotes amigas!!",
            "post_id": "5627288",
            "timestamp": "1272563698",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "ahi acabo de subir mi ultimo grafico, pero por ejemplo falta la opcion para marcar el dia de ovulacion, la fase lutea y ademas los TE. Ademas no esta la opcion de comentar graficos.Falta mejorar un poquito, esperemos que vayan haciendo los cambios",
            "post_id": "5627352",
            "timestamp": "1272564587",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "pasame el link! el mio es triple w....proyecto-bebe.es/zyklustagebuch/Ciclo_16_04_198x78.htmA mi tampoco me marca nada, grrr",
            "post_id": "5627700",
            "timestamp": "1272569994",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "a ver fijate....proyecto-bebe.es/zyklustagebuch/Abril_198x54.htm",
            "post_id": "5627807",
            "timestamp": "1272571224",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Q suerte q tenés Mari!!, es tan importante tener tiempo para poder hacer las cosas!!... acá nooo, igual ya se lo dije y se lo tomó bastante bien jjejej... obvio q me lo va a descontar, pero bueno, estoy más tranquila así...Si le digo q me voy y vuelvo está controlando el tiempo q tardás, entonces lo hice más fácil, no vengo directamente, y hago todo lo q tengo q hacer tranquila!!... Mi mamá anda bien, dentro de todo, tiene arritmia y hace unos días empezó con unos dolores en los intestinos, así q mañana vamos al gastro, y después tenemos toda la semana q viene bastante ocupaditas jejjej... es q hacía mucho q no iba al médico y bueno, ahora q fuimos le mandaron un montón de cosas!! ella pobre no entiende nada, siempre dependió en todo de mi viejo, y bueno, ahora q él no está, no sabe bien para donde agarrar... en fin cosas q pasan...",
            "post_id": "5627949",
            "timestamp": "1272572899",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!! como andan?? yo con poco tiempo, recien llego ...mañana paso por sus graficas.... Me comentaba Maria que el aceite de onagra o primula que estoy tomando mejoraba el flujo... la tomo porque me dijeron que ayuda... no sabia ella me comento que despues de la ovulacion produce contracciones ...pero lo del mocooo... NO SABENNNNNNNNNNNN, que asqueteee, este mes me tuve q poner protectores!!! increible la cantidad.... ahora me hace dudar con el tema de seguir tomandolo desp de ovular.... alguien sabe algo mas???'besos a todas!!!!!",
            "post_id": "5628587",
            "timestamp": "1272583413",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Amigas!!!!! me hice una escapadita y aca estoy garcias gracias gracias!!!!! son tan importantes... por suerte sigo sin manchar, mi tempe hoy bajo a 36.7 pero que haya estado en 37 para mi era como un milagro, la vag sigue en 37, estoy con mucha fe pero tambien preparada para todo, ayer me hice otro test y sigue saliendo dudoso, eso si me preocupa aunque el primero que me hice fue uno de los caros y estos son de los bien berretas, voy a esperar a hacerme otro el domingo o lunes a ver si se marca mas, eso seria de gran ayuda!!!!!!!!!!!!!Yo sigo rezando con todo mi corazon!!!!!!!!!! Las quiero muchisimo!!!!!!!!!!!",
            "post_id": "5629085",
            "timestamp": "1272593704",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Ositoooooo!! q alivio amiga q me dá q no tengas pérdidas!!... seguí en la cama porfis!!! y cuidate mucho mucho!! un beso grande!!",
            "post_id": "5630122",
            "timestamp": "1272631725",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Osi, segui descansando amiga! y que te mimen mucho!!! va a estar todo bien, porq se esta agarrando fuerte.. vas a ver! mucha fuerza de todas desde acá!Ana, te escribí en tu grafica acerca de la onagra. Googleá \"Primrose fertilty\" ahi te salen diversas marcas de USA q indican la toma y la forma de tomarlas.... Pero tb cdo busqué en castellano encontré como más diversas opiniones: q todos los dias, Y hasta algunas chicas decian que con la warry no se toma. Yo me quedé con la opcion de USA porq coincidian en la toma varias marcas.... y todas decian hasta la ovu y despues no xq daba contracciones. Estoy tomando 4 capsulas de 500 mg, vos? Voy a ver como me resulta,,, porq en USA habla de lo bueno que es para el moco cervical y en español de lo bueno q es para regular las hormonas ¿? A mi para ambos me sirve, es cuestion de probar! y ahora q viajo me voy a traer el pree sed, q tb dicen q es bueno. Bueno, besitos a todas!!!",
            "post_id": "5630232",
            "timestamp": "1272634183",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Hola chicas!!... cómo están??? yo el viernes me pegué un cagazoooooo... Fuí al baño y tenía un manchado marrón, lo llamé a mi marido y decidimos ir yaaaa a la guardia... Les resumo, está todo bien, me hicieron una eco y lo vimos otra vez!!... ya mide 22 mm y se le notaba la cabezotita bien redondita, el resto como un poroto jejjeje... También me hicieron un análisis de orina y bueno nada, el gine me dijo q estaba bien lo q hicimos de ir enseguida, pero q estaba todo genial... Esa sangre podía ser de la implantación, del día de la eco... en fín, me dice: Si te tengo q decir el motivo, no lo sé... Por las dudas Progesterona y reposo el finde, no absoluto, pero q trate de quedarme quieta y no andar de acá para allá...Pero q cagazo por favooooor!!...Osito sigue bien, sin pèrdidas, hoy tiene gine, vamos a ver q cuenta!!",
            "post_id": "5640808",
            "timestamp": "1272915975",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "ayy andre menos mal que solo fue un susto! y no hay mal que por bien no venga: lo viste otra vez!!! que buenooo!! me super alegro que todo vaya viento en popa!! Contame, ya tenes pensado nombres?? Me encanta hablar de ese tema! jijiSi, Osi estaba sin manchados, ojala que este todo muy bien, vamos a ver que le dijo el gine en un rato!",
            "post_id": "5641112",
            "timestamp": "1272919969",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "looooooo que susto amiga!!!!!!! te habia dejado un mensajito en 28!!!! que bueno que estas bien!!Mañana eco!!!!! que nervios!!!!!! se que no se va a ver nada, estaria de 5+2 pero la gine quiere ver si esta bien ubicado y quiere descartar algun hematoma, tambien me hago todos los analisis incluyendo la beta!!!!!! Recen mucho porfis!!!!!!!!!!!! ya me agarro el chucho!!!!! jajajajajaUn besito amigas!!!!!!!!!!!!!!",
            "post_id": "5641479",
            "timestamp": "1272926352",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Osi fuerza!!! Todas estamos rezando por vos para que todo este muy bien! Al menos el sangrado paro no? y eso no se supone que es una buena senial??Besotes amiga y mucha suerte!!!",
            "post_id": "5641512",
            "timestamp": "1272927141",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Ay chicas no me asusten!! cuidenseeeeeeee!! que nosotras estamos haciendles el aguante!!Besitos!!",
            "post_id": "5641839",
            "timestamp": "1272933693",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "RAtita! que vi tu grafica recien y esta hermoooosaaa!! crucemos los dedos chicas!!! este meses tuyo!!! muchos besos a todas!",
            "post_id": "5641850",
            "timestamp": "1272933911",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "gracias anita!! pero tengo cero ilusiones, no siento NADA!!!",
            "post_id": "5642687",
            "timestamp": "1272953006",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Chicas sigo bien por suerte!!... no manché más, con la Progesterona, y \"tratando\" de estar tranquila... Anoche fuimos a la guardia xq mi vieja se sentía mal, le quedó un ganchito en los intestinos de una laparoscópica de hace unos años y la tienen q operar!!... pobre, no me quería decir q se sentía mal, para q yo no ande de un lado al otro, pero no aguantaba más el dolor!! hoy la llamo a mi hermana para q dividamos las tareas jejejje... no tengo buena relación con ella desde q murió mi viejo, pero bueno, tampoco me puedo hacer cargo de todo ahora, si yo no tuviera q cuidarme sí lo haría, pero ahora tengo q cuidarme por dos jejje... Igual a ella le queda la parte de los papeles, autorizar órdenes, comprar remedios, pedir turnos, de mi viejita me encargo yooooo...Osito, hoy vas a conocer a tu miniporotito jajajaj... suerte suerte y suerte amiga!!Q tengan un lindo día!!",
            "post_id": "5643188",
            "timestamp": "1272974020",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Andre que bueno que esta todo bien! a disfrutar entonces!Pobre tu mama!! Escuche miles de historia que dejan cosas ahi adentro, pobrecita! Igualmente no es nada, se lo sacan y listo, pero el dolor lo paso! Lamento que te lleves mal con tu hermana...es una lastima! ojala que algun dia se puedan arreglar! es tan lindo tenerlos!Chicas hoy me hice un TO y no vi ni la sombra! es mala senial sumado a que no tengo NI UN SINTOMA! Hoy mi tempe subio un pelin pero puede que este alterada, anoche me queme la mano con agua re caliente (por suerte no estaba hirviendo) y me termine durmiendo a las 5 de la manana! no saben que mal la pase!",
            "post_id": "5643792",
            "timestamp": "1272985018",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Hola Chicas, me conecto 5 minutos q estoy en un curso, y las saludo!!!Osi!!! pls contanos como estan?? viste a tu bbito?Rati! pero espera.... no es demasiado pronto para un TE??? Mira lo que le paso a osito, el primero le dio negativo... y después...Andre: le contaste a tu mami? q bueno q tu hermana no se nego a colaborar, asi no estas con tantas responsabilidades.Bueno chiquis, hasta mañanabesos",
            "post_id": "5644289",
            "timestamp": "1272992811",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "Mary!! No era un TE, era un TO!! no se si es pronto o no pero tampoco siento nada :(",
            "post_id": "5644686",
            "timestamp": "1272998285",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Ratita!! espra un poco corazon!!!!! todavia falta para q unTO o un TE te de +!!, paciencia amiga! y ojala se de! crucemos los dedos!!Andre! que susto lo de tu mami, pero debe ser una boludez.ahora que bobinas los docs!! ajajaQue saben de osi?",
            "post_id": "5644711",
            "timestamp": "1272998619",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "volvi de la eco... Ufffffff, nunca voy a tener buenas noticias????? no se ve nada, solo el endometrio engrosado pero nada mas, el jueves me entrgan la beta... el lunes le llevo todo a la gineSera que ovule mas tarde???? que me pasa amigas??? alguien sabe???? me quede en blancosuerte ratulinga!!!!!!! no le des bola al test, a ver si me alegras un poco!!!!!!! loooo que bueno que sigas bien y que susto lo de tu mami!!!!!Las extraño amiguitas!!!!!!!!!!!!",
            "post_id": "5644947",
            "timestamp": "1273002107",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Osi!!! no te pongas mal!! yo fui en la semana 6 pasadas y solo vi un mini saquito de 4mm, que despues crecio un monton!! lamentablemente despues se detuvo pero el tamaño no tenia nada que ver... vos todavia no llegas a la semana 6 asi que espera un poquito,,, quizas ovulaste mas tarde,,, por eso.... mirando tu grafica parecia eso ya te lo habia dicho, te la hiciste Tranvag?? porque tarda tanto la beta?? rompele las bolas al lab, yo siempre la conseguia la noche anterior ajajaj... bueno amiga pensamos en positivo todas para vossssssssss!! besos a todassssss",
            "post_id": "5645808",
            "timestamp": "1273014791",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "ani, estoy sorprendentemente tranquila, ni yo lo creo... si, tardan son lentos en la zona jajaja vos lo debes saber, pero hoy me compre otro evatest porque los otros que me hice salia el posi super clarito, y el nabo del tecnico me dijo que no habia embarazo y como le recrimine ahi me dijo bueno no lo descarto porque el endometrio esta agrandado puede ser que estes de 4 sem, la cuestion es que me dije chau, ahora si enloqueci del todo y es un SUPER EMBARAZO PSICOLOGICO JAJAJAJAJ, pero me lo hice y con el pipi de la tarde y antes de que se marque la linea de control se marco el positivo, las dos lineas estan super parecidas asi que loca no estoy jajajajaja... ahora toca esperar...",
            "post_id": "5645876",
            "timestamp": "1273016375",
            "user_id": "user_1238248",
            "user_link": "/personal_pages/user/1238248",
            "votes": "0"
        },
        {
            "answer": "Osito amiga! que animales los que hacen las ecos,no tienen  corazon, mira si no podia decirte mas suave las cosas.. yo me la hice en Tesla moron, y no volvi mas, desp me las hice en otro lugar donde trabajo, en moron tambien, donde el doc es un amor... me explicaba con lujo de detalles todo...y me contenia cuando las ecos empezaron a salir mal... y me acuerdo que me dijo que es dificil antes de la semana 6/7 asegurar nada.... asi q nada osi... paciencia, y que bueno lo del test! apoya nuestra teoria!! besoss!!",
            "post_id": "5647445",
            "timestamp": "1273061987",
            "user_id": "user_1239451",
            "user_link": "/personal_pages/user/1239451",
            "votes": "0"
        },
        {
            "answer": "Ratita, uyyy con mi hermana nunca tuvimos problemas, pero bueno, es como todo, bah no, no todo el mundo es así, pero bueno a mí me tocó... cuando murió mi viejo cambiaron mucho las cosas, es feito xq cuando mi papá murió, además de tener q superar eso me tocó superar el hecho de darme cuenta de quien era mi hermana en realidad... pero bueno, ahora no me puedo dar el lujo de hacerme la q no necesito ayuda, tengo q cuidarme así q bueno, q cumpla che!!...Mary!! estás perdida!! síiiii, ya se lo conté!! está super felíz!! también a mis suegros y a algunos amigos!!Ana, si son bastante pelo..., encima el clínico le decía q tenía gases jjajajja son de terror!!Osinguis!!... y en una guardia no te podés hacer la Beta?, yo la primera q me hice fué así y me la dieron a las dos horas, y la otra en un Laboratorio, pero a la tarde ya estaba... Y lo de la eco tiene razón Ana, habrá q esperar amiguita, depende de muchas cosas q se vea algo o no, del equipo, del q te la hace... vos quedate tranqui, y seguí cuidando mucho q ese niñito!!Besos chicas!!",
            "post_id": "5647468",
            "timestamp": "1273062438",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas! Osi si! para mi, creo q ya te lo dije antes, ovulaste mas tarde. Igual tranquila porq hay ecografistas q son de terror. A mi una vez, me toco una estupida total,,, una vieja de m.... hay de todo, algunos super profesionales y otros muy alejado de eso. Pero es muy normal q no se vea nada en la primera eco, aunq me imagino la desilusion. q bebe escurridizo, eh!!!Rati, nena, como fue tu tempe hoy???Ana: no se si te conte antes, pero fui al endocrino y me mando un monton de analisis. Me dijo q mi medico era vidente o muy buen medico q se daba cta por la cara si tenia resistencia a la insulina.... asi q dentro de poco ya sabre a ciencia cierta si estaba diagnosticada bien o mal.No sabia nada andre!!! q bueno, tu vieja debe estar feliz con la noticia!!!beso a todas!",
            "post_id": "5648329",
            "timestamp": "1273076672",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        },
        {
            "answer": "hola chicas! yo tambien estoy media desaparecida, es que estoy con mil cosas y casi que ni puedo pasar x cada una! hoy la tempe bajo un pelin, y hoy se acabaron porque se me rompio el termometro :(...como el viernes me voy de viaje ya ni voy a comprar uno hasta que vuelva, asi que el mes que viene voy a estar sin tempes! Este domingo me tiene que venir asi que les voy contando!Osi muchas fuerzas!!!!!!! Besotes a todas!! las quiero!!",
            "post_id": "5650003",
            "timestamp": "1273105688",
            "user_id": "user_1239298",
            "user_link": "/personal_pages/user/1239298",
            "votes": "0"
        },
        {
            "answer": "Rati, cómo vamos a hacer si no te tomás las tempes???... solo nos queda esperar q no venga???... ojalá amiguita y se te dé!!!!Mari, los médicos son de terroooooor!!!!... yo, ahora q ando con esto de mi vieja, grrgrrrr, me dá tanta bronca, uno te dice una cosa, otro te dice otra, q tomes esto, q no lo tomes más... la verdad q es cuestión de caer con el doc indicado, pero en el camino te encontrás con cada uno...Osito cuando tengas la Beta contanos!!Besos para todas!!",
            "post_id": "5652315",
            "timestamp": "1273165249",
            "user_id": "user_1246392",
            "user_link": "/personal_pages/user/1246392",
            "votes": "0"
        },
        {
            "answer": "Hola chicas, ando bajon hoy.....:(Me hice una eco y me encontraron un quiste folicular!! buaaaaOsi, contanos!Muchos besos a todas",
            "post_id": "5653008",
            "timestamp": "1273176111",
            "user_id": "user_1239206",
            "user_link": "/personal_pages/user/1239206",
            "votes": "0"
        }
    ],
    "post_id": "5477948",
    "question": "Hola chicas!!! abri este forito para continuar nuestra charla de argentinas de 28 dias..... les parece? inviten a las que faltan!!! besos a todas!",
    "timestamp": "1268838495",
    "title": "nos reunimos aca como en 28 dias??",
    "user_id": "user_1239451",
    "user_link": "/personal_pages/user/1239451"
}