{
    "answers": [
        {
            "answer": "Hey, i'm all for canada having cooler weather. Yesterday was a crazy day, it started out HOT then rained all day.I booked my trip to scotland for dec, i'm so excited haven't been there for 2 yrs. It will be so nice to see all of my fam.Hope everyone has a nice day.:D",
            "post_id": "1129279",
            "timestamp": "1123045200",
            "user_id": "user_92920",
            "user_link": "/personal_pages/user/92920",
            "votes": "0"
        },
        {
            "answer": "I hope you are speaking in terms of Celcius - because 25 deg Fahrenheit is C-O-L-D, no thank you.  :-)",
            "post_id": "1129280",
            "timestamp": "1123045200",
            "user_id": "user_59623",
            "user_link": "/personal_pages/user/59623",
            "votes": "0"
        },
        {
            "answer": "Your from Scotland? Were you born there? ANd how did you get to Toronto!That plane crash yesterday was quite the scare, Unbelievable that no one was killed",
            "post_id": "1129281",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Yes -- although I do like winter?Where are you located?",
            "post_id": "1129282",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "I took my almost 11 month old son to a friends house last night to babysit (she is 50 who just had a son graduate high school so I trust her judgement) and she gave him milk in his sippy.  Is he going to be ok do you think.  He seems great and I don't really know how much he drank since he does not do well with sippy cups.  What is the reason exactly as to why they should NOT have milk before a year and really he is only a month away so is it really bad???  Thanks and Take Care",
            "post_id": "1129289",
            "timestamp": "1123045200",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Tomorrow is CD 21, so I go get my progesterone checked and my refill prescription for Clomid in case I am not pregnant.  I imagine I ovulated because I had sore breasts all last week, some lovely face adornments, and my temp was high.  Although, the high temp could be my inflammation levels due to the AS.  I'll let you ladies know tomorrow.  Here's to hoping!",
            "post_id": "1129290",
            "timestamp": "1123045200",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "Your son should be fine.  Most doctors recommend mixing cows milk with formula when the baby is 10-11 months old so that by 1 year they are totally on cows milk.  You can't switch them cold-turkey, you have to blend it and switch them gradually.  You might want to ask your doctor about starting that now, otherwise he could get extremely constipated by switching him too fast.",
            "post_id": "1129292",
            "timestamp": "1123045200",
            "user_id": "user_59623",
            "user_link": "/personal_pages/user/59623",
            "votes": "0"
        },
        {
            "answer": "I'm in Michigan.  I'm not ready to talk about winter yet...",
            "post_id": "1129295",
            "timestamp": "1123045200",
            "user_id": "user_59623",
            "user_link": "/personal_pages/user/59623",
            "votes": "0"
        },
        {
            "answer": "Yes, i'm from scotland.I came here through relatives and meet my dh, and decided to stay. I have been here for 10 yrs and loving it:D",
            "post_id": "1129297",
            "timestamp": "1123045200",
            "user_id": "user_92920",
            "user_link": "/personal_pages/user/92920",
            "votes": "0"
        },
        {
            "answer": "Jlu hart--Best of luck hun!!It will happen be patient.. remember you can always take me up on my offer!...(which kid do you want)Blondie--The reason they say wait til a year is for allergy purposes, I know of some who have put babies on cow's milk as early as 3 months..NOT that i reccomend thatCody has had a taste of ice cream (milk) so Im sure if he had allergies to milk it would have showed then I will wait til later on (he's 9 months) til I switch just for the vitamins in the formula.(closer to a year)Has Christopher ate anything from the table??  butter, cheese??I have given Cody a cob of corn(corn was off) just to chew on for his teeth he loved it.. and im sure there was butter on it toThey say wait for strawberries until a year but I have seen baby food with pureed strawberries as a beginner food?Now to they say peanuts to wait til almost 3 years of age I guess its a biggy and the reaction is worse.(My nephew has a peanut allergy requires an epi pen)",
            "post_id": "1129298",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "My cousin's little boy (he will be 4 in Oct) has just recently had one of those allergy tests.  They discovered that he is allergic to peanuts, hot dogs (?) and lots of other stuff.  The crazy thing is, he has eaten all of this stuff before and it had no affects.  They even said no chicken.  I dont think I have ever met someone allergic to chicken.  I think the doctor told her to stop feeding him certain things and they will gradually add stuff back into his diet.  Has anyone heard this or experienced it before?",
            "post_id": "1129299",
            "timestamp": "1123045200",
            "user_id": "user_75542",
            "user_link": "/personal_pages/user/75542",
            "votes": "0"
        },
        {
            "answer": "Hey hun how are you?Never heard of an allergy to chicken or hotdogsHotdogs I might say could be some filler that is put in ? You know when you read the package and it has all the stuff in it that we cant even pronounce...But damn hotdogs are good!Peanuts i think are a big one! My oldest dd had testing done but nothing showedMost kids (but not all) do grow out of it.",
            "post_id": "1129301",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "I feel stupid again.  Yes my son has had very little bits from a grilled cheese sandwich and he does get little bites of my ice cream.  Main ingredient.....MILK!!!!!  He has not had a reaction yet.  I figured he would be ok it just kind of freaked me out because I always thought wait for a year.   She said she also gave him a few little peices of fried chicken (w/out skin of course) and that also freaked me out.  I am so afraid of choking.  She gave him a peice of potato once that had a skin left on it.  I was a nervous wreck.  I watched him and he did end up gagging on it but eventually got it down.  Like I said her son made it so I should try not to worry so much.  Thanks",
            "post_id": "1129302",
            "timestamp": "1123045200",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Gagged a little and got it down.  I would have been a nervous wreck.  My little guy has started coughing (he is getting over a nasty cold) and I cant stand it.  It makes me feel like he is choking.  I feel like he needs a drink of water to clear his throat (I DONT GIVE HIM WATER), although, what is wrong with giving a baby water?  Is it because they cant taste it and will choke or what?",
            "post_id": "1129304",
            "timestamp": "1123045200",
            "user_id": "user_75542",
            "user_link": "/personal_pages/user/75542",
            "votes": "0"
        },
        {
            "answer": "Its okay your blonde!!...lol..So am I but mine comes from a box!Im the same way  i have tried cody with bits and pieces(mashed potato, toast, arrowroot cookie) Your sitting on the edge of your seat But thats what teaches them to eat, chew and swallowMotherhood a life time of worrying!!",
            "post_id": "1129306",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "You hear so much stuff!Water--Well its in the formula???????The only thing i think of is where it came from ? purified and clean (I still sterilize his water)He does love sipping on my cold water when I have it in a bottleI also figure they mean dont make it a source to fill up on for they need the nourishment from formula",
            "post_id": "1129308",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Why can't you give him water???  Who said that?I know you're not supposed to give your young baby several ounces of water b/c then they fill up on water instead of formula/breastmilk, but I don't see any reason why you can't give him sips of water to clear his throat!",
            "post_id": "1129310",
            "timestamp": "1123045200",
            "user_id": "user_59623",
            "user_link": "/personal_pages/user/59623",
            "votes": "0"
        },
        {
            "answer": "That is just what I have heard.  I guess I could ask his pediatrician.",
            "post_id": "1129311",
            "timestamp": "1123045200",
            "user_id": "user_75542",
            "user_link": "/personal_pages/user/75542",
            "votes": "0"
        },
        {
            "answer": "I use to work in a Dr office and believe it or not but a young baby ( before a year old) died because mom gave him to much water.  She thought she was doing a good thing.  It was very hot that year and she was trying to keep him cool and hydrated.The over load of water messed up his etectrolites and caused something to happen to his heart.  I am not sure if what you heard has something to do with this kind of situtation but I had never heard that something like this could happen.I always bought baby water to mix with my babies forumula.  We live in a rural area and have crop fields just feets away from our well so I am kind of afraid what kind of chemical I could be feeding my babies if I was to use the well water.",
            "post_id": "1129312",
            "timestamp": "1123045200",
            "user_id": "user_75143",
            "user_link": "/personal_pages/user/75143",
            "votes": "0"
        },
        {
            "answer": "Yes, if you still want to give him some water then ask your doc.  I believe what you heard was not fully explained.You shouldn't give a small baby a bottle of water to drink because, just like cinnamonheart said, they fill up on non-nutritional water instead of milk.  They might miss a feeding b/c they feel full and that's detrimental.  I don't feel it's detrimental whatsoever to give them sips of water.",
            "post_id": "1129314",
            "timestamp": "1123045200",
            "user_id": "user_59623",
            "user_link": "/personal_pages/user/59623",
            "votes": "0"
        },
        {
            "answer": "Like you I also live in country land with our own well.We live about 20 mins from Walkerton (the water tragedy)I never tested our water until that happened THANK GOD I always boiled it for my other two..It never had ecoli (thats what was in walkerton's)  it had coliform which is some dirt which could come from the water itself or pipesBut this year we put in a 3000 dollar filtration system with a alarm if anything is detected in it. BUT i still boil it for formula...You just never know...I know im crazy (dh says so)but better safe than sorry!",
            "post_id": "1129317",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Carrigan will be 9 months on the 12th and she has had Cinnamon toast, mashed potatoes, ice cream, smooshed up green beans, and decaffinated tea. She loves it all. And no, I don't give her massive amounts of it. Just a little to taste to see if she likes it, and she has been fine. So don't feel bad about giving him stuff!",
            "post_id": "1129319",
            "timestamp": "1123045200",
            "user_id": "user_59030",
            "user_link": "/personal_pages/user/59030",
            "votes": "0"
        },
        {
            "answer": "Thank you.  I don't feel too bad about it.  I am with you.  I want to see what he likes  I don't give a whole lot of the stuff just a couple tastes.By the way I love your daughters name.  If I ever get pregnant again (God I hope I don't BUT...) if I do I want a girl and I want to name her Carrigan or Kerrigan.  I would have to stay with the K sound in the name.  I have a Katelyn McKenzie and a Christopher Randall.  I am thinking Kerrigan Renee or Delaney as a middle name.  Isn't that your little girls full name???  Take Care.",
            "post_id": "1129322",
            "timestamp": "1123045200",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Hey girls,anyone remember the baby getting frequent hiccups in the last few weeks of your pregnancy? mine gets them once or twice a day and they sometimes last 5 to 10 minutes. I feel so bad for the little guy because there isn't anything I can do to help him. LOL. just wondering if I should mention it to my OB at my appt. tomorrow (I'm 36 weeks).",
            "post_id": "1129326",
            "timestamp": "1123045200",
            "user_id": "user_43067",
            "user_link": "/personal_pages/user/43067",
            "votes": "0"
        },
        {
            "answer": "Hi. Had a few spare minutes and was wondering how your doing? Hicups...Aubrey had them 5-6 x's a day a mostly at night!! I can't believe I'm done and you have to wait a couple more weeks!! I feel for you. It is so nice to see my toes and not be so swollen. My little one is doing good with breastfeeding. I had such a hard time w/ the first. Although the engorement is soooo awful. What are your plans w/your son as for feeding? Take it easy...go get your nails and toes done!! Enjoy, I do miss it a little bit-being pregnant!",
            "post_id": "1129327",
            "timestamp": "1123045200",
            "user_id": "user_28606",
            "user_link": "/personal_pages/user/28606",
            "votes": "0"
        },
        {
            "answer": "My little guy had them ALL THE TIME.  It seemed like all day everyday.  After he was born, he also got them alot.  He doesnt get them as much now.",
            "post_id": "1129328",
            "timestamp": "1123045200",
            "user_id": "user_75542",
            "user_link": "/personal_pages/user/75542",
            "votes": "0"
        },
        {
            "answer": "You breastfeed your son -right? If so, What did you do for the engorgement? Did you try the cabbage leaves trick? I am so worried about getting another infection from not emptying the breast. She only feeds 15 minutes one breast per feeding. Any help?",
            "post_id": "1129329",
            "timestamp": "1123045200",
            "user_id": "user_28606",
            "user_link": "/personal_pages/user/28606",
            "votes": "0"
        },
        {
            "answer": "I have not had any engorgement with my son (yet).  He is almost 11 months old and still nurses CONSTANTLY!!!!!  I was a little engorged this morning on my right side because it had been about 8 hours since he nursed on that side.  I just nursed him from there when I woke up and all was fine.  Now with my DD who is now 7 yrs old I nursed her as well and I only got engorged with her once in which case I pumped and then when I weaned I became very engorged because I quit cold turkey.  I took warm showers and expressed some milk by hand.  I had a nurse tell me to wrap an Ace type bandage very tightly around them.  I never really did that.  After a few days or so all seemed to let up.  I hope this was somewhat helpful to you.  I am hoping to wean in the next 5 months or so and I think I will do it more gradually this time rather than cold turkey.PS  I never heard of cabbage leaves.  What is that suppose to do???",
            "post_id": "1129330",
            "timestamp": "1123045200",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Thank you, and yes her full name is Carrigan Delaney. We debated on using the Ke instead of Ca, but my other daughter is Kennedy Taylor, so we went with Ca. I personally think it's up to each individual as to what they give thier child. They know their baby better than anyone and I know some are probably wetting their pants b/c Carrigan has had what she has at 8.5 months, but she's healthy and she liked it, so I thought no more about it.",
            "post_id": "1129332",
            "timestamp": "1123045200",
            "user_id": "user_59030",
            "user_link": "/personal_pages/user/59030",
            "votes": "0"
        },
        {
            "answer": "thanks! :o) I'm planning on breastfeeding him, but I've never done it before so I'm a little nervous about it.as for the pregnancy- i have all the \"little\" symptoms of preeclampsia (blurry vision, flashing lights in the vision sometimes, swelling-in my face and fingers, but especially in my legs, nausea, headaches yada yada), but no high bp and no protein in my urine, so I haven't been restricted to bed rest yet- although my doctor says it is coming... planning on working another 2 weeks if I can.. we'll see how it goes.",
            "post_id": "1129339",
            "timestamp": "1123045200",
            "user_id": "user_43067",
            "user_link": "/personal_pages/user/43067",
            "votes": "0"
        },
        {
            "answer": "I hope you know I was kidding about the blonde joke!Cabbage leaves slightly  cooked and then cooled --place  them on your breasts for relief..",
            "post_id": "1129342",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Andi - As always very helpful again :o)  I never knew that about the water thing.  I give mine a little water but like I said he does not really know how to take a sippy so he really never gets any.Cinnamon - I know it was a joke I laughed.  I always tell ppl I am the reason there are blonde jokes LOL!!!!  Those are some of the best jokes.  I am always teased on being blonde.  It is totally ALL natural.  NEVER had any color at all.  It's ok.",
            "post_id": "1129346",
            "timestamp": "1123045200",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Good luck with the monitor! I bought some O predictor strips and never got a surge even after testing for 10 days straight. I did, however, get a positive HPT two weeks later!I loved a website called www.conceptionstore.com They would email me when it was time to start BDing and even when to do it if I wanted a girl (which BTW never worked,lol) But I got pg twice following their advice. The first was May 2003 which ended in m/c in June and then the very next cycle following the m/c.I was never patient enough to do the BBT, cervical mucus, or any of that.Andrea",
            "post_id": "1129363",
            "timestamp": "1123045200",
            "user_id": "user_40010",
            "user_link": "/personal_pages/user/40010",
            "votes": "0"
        },
        {
            "answer": "Cheese, ice cream and the like are actually different than regular milk. They are broken down a bit more when they are made into cheese, yogurt, ice cream, etc. Allergies are a concern as well as digestability. Babies under a year don't have a mature enough digestive tract to break it down and it can and usually does cause loose stools and gas. One glass of milk shouldn't be a problem, just keep an eye on him.With the allergies, it takes at least on exposure to it for you body to decide it is allergic to it, sucks huh? My son had been on an antibiotic once before and the second time he was on it, he developed welts. It took the first exposure to get things going. Same with many people and bee allergies, they get stung and have no ill effects, then down the road they get stung and suddenly they are in anaphylaxis. Good news is, just like someone mentioned, they usually outgrow a lot of those allergies. My older brother was allergic to 26 different things, went in for weekly allergy injections and made our life miserable (just kidding, we just had a lot of restrictions due to his allergies) He is now an adult and most of them have resolved. Peanuts are a scary allergy though, you have to be extra diligent. Good luck eating out, getting ice cream, etc.Small amounts of water are okay, before they are 2 months NO water. They have so little blood volume, even a small amount can lead to water intoxication (fancy way of saying severe electrolyte imbalance) which decreases the amount of potassium in their body, leading to death of cardiac muscle. Cinnamon, you work in geriatrics, right? Have you ever had a patient on Lasix (of course you have, or some form of diuretic) they always have to have a potassium supplement paired with it for the exact same reason. I used to have a patient who had OCD, I mean severe OCD. He wasn't allowed to have his cigarettes as he would down the pack in under 10 minutes, he couldn't have a water cup or urinal (portable kind) as he would drink and drink and drink and wind up in the hospital. Same concept, only babies don't have enough wiggle room. And there is also the concern about filling them up on empty calories, babies will rarely ever get dehydrated as long as they are fed regularly and kept cool.Cabbage leaves are great, but i did read to use them infrequently. There is an actual therapeutic proprty in them that is absorbed through the skin. Once daily use or so shouldn't be a problem. I think if you used them several times a day every single day there might be issues. I'll see if I can dig up the article. They worked wonders when I had mastitis in the beginning with Tristan. I never had to deal with engorgement like you ladies. Mine would only happen if we were out and about and I missed a feeding or started late. Tristan and Jonathan each only nursed off of the left side, so it was constantly being used. Never had time to build back up,lol!",
            "post_id": "1129340",
            "timestamp": "1123045200",
            "user_id": "user_40010",
            "user_link": "/personal_pages/user/40010",
            "votes": "0"
        },
        {
            "answer": "You guys are probably sick of hearing me go on about my digital fertility monitor, but i have to tell you what happened.It's a clear blue monitor,i bought the test sticks for it but when i got  home i noticed that i had bought the test sticks for the clear plan monitor, so i take them back only to find that shoppers don't stock them. I then begin calling different  stores, but no one had them or knew what i was talking about, I go on line and purchase some, only to find out that i won't recive them untill next week(argh) so i decided to call the clear blue help line and explained what had happened, i was gobsmacked when they told me i could use clear plan test sticks with the clearblue monitor....What a smuck. Yes i know i should of called them first, but unfortunetly i am the most impatient person. Things have to happen NOW!!!Sorry ladies i just had to vent about what an idiot i had been:(",
            "post_id": "1129352",
            "timestamp": "1123045200",
            "user_id": "user_92920",
            "user_link": "/personal_pages/user/92920",
            "votes": "0"
        },
        {
            "answer": "Well, I've read alot today on this site. I am a total wreck now-a-days. I had a tubal ligation in November 2004. I really wish that I hadn't. I have been regretting it ever since. My menses are all messed up. I am also breastfeeding for the last 13 months. The last couple of months my periods have been so messed, that I keep thinking that I am pregnant. I even dream about it. My husband chuckles and says that is how hard I am wishing to be pregnant. I feel more symtoms of pregnancy in the last couple of weeks, but I think that it may all be in my head. Why do we Women put ourselves through this???? Will I always feel pregnant for the rest of my life. Or is this a late onset of post partum depression?  I feel like a war veteran with a ghost baby inside. Am I crazy!!!!!",
            "post_id": "1129370",
            "timestamp": "1123045200",
            "user_id": "user_96853",
            "user_link": "/personal_pages/user/96853",
            "votes": "0"
        },
        {
            "answer": "Thanks, i went to the conception store it was pretty interesting.Thanks also for the good luck wishes, i need it:D",
            "post_id": "1129374",
            "timestamp": "1123045200",
            "user_id": "user_92920",
            "user_link": "/personal_pages/user/92920",
            "votes": "0"
        },
        {
            "answer": "Hey I had  a tubal done in Nov 2004 also after the birth of my son.. My periods have been regular Just heavy heavy heavy!!I have no regrets we have three kids and thats enoughHow many children do you have???Truthfully you still can get pregnant with your tubes tied I know of two women personally, and I got pregnant when my dh had a vasectomy so obviously things grow back!!Take a  hpt and seePost partum  depression can last as long as a year and nothing is written in stone",
            "post_id": "1129375",
            "timestamp": "1123045200",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Thanks for listening. I have four kids, and one step-daughter. Myself, I have two daughters, and two sons. My finances are pretty slim right now, so I can't even afford to get a home test. I am anxiously awaiting monthly friend. I am a week late, and the doctor says she wants to do a PAP smear first. Which will not be until next month sometime. I am only waiting a couple more days, and then I will have to go in and get tested. This is the third time my little friend has been late. With all my spontaneous crying I am driving myself crazy. So with all this, there had better be a good reason, hey?",
            "post_id": "1129376",
            "timestamp": "1123045200",
            "user_id": "user_96853",
            "user_link": "/personal_pages/user/96853",
            "votes": "0"
        },
        {
            "answer": "Relief! Everything looks well with the baby. It grew from 4.1mm to 18.6 mm in two weeks. It is actually measuring 8 weeks 4 days even though I am 7 weeks 6 days, and the heartbeat was strong 171 bpm. This is about the time I went in with my last pregnancy and found out the baby had quit growing, so I was quite nervous. Now I can relax for a couple of days and then I'm sure go back to being nervous.  I couldn't believe the information she could tell me.  She could tell I ovulated from my right ovary and the baby is sitting to the left side of my uterus.  She even said it moved, but I didn't see it.  I'll have to play back the video tape and see if I can see it.Good luck tomorrow and make sure you let me know all the details!",
            "post_id": "1129380",
            "timestamp": "1123045200",
            "user_id": "user_80229",
            "user_link": "/personal_pages/user/80229",
            "votes": "0"
        }
    ],
    "post_id": "1058502",
    "question": "Good morning girlsIts another hot one here ..Having a heat wave this week!Hopefully it cools down Dh is on vacation next weekThe heat just makes me lazy- Lots to do but NO ambition in the heatHow about just some nice 25 degree weather!!",
    "timestamp": "1123045200",
    "title": "Open Forum for Wednesday",
    "user_id": "user_66141",
    "user_link": "/personal_pages/user/66141"
}