{
    "answers": [
        {
            "answer": "ok I don't want to scare you but that is a sign of preeclampsia...  you should do a search and just keep an eye on things... pain in shoulder, headache, swelling in hands and face and spots, blurred vision or flashing lights... in my opinion I would talk to dr....  take care girl... do a google... haha",
            "post_id": "2639112",
            "timestamp": "1205432071",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "Signs and SymptomsSigns and SymptomsFrequently Asked QuestionsStatisticsNoneHypertensionSwelling or EdemaProteinuriaSudden Weight GainHeadacheNausea or VomitingChanges in VisionRacing pulse, mental confusion, heightened anxiety, trouble catching your breathStomach or Right Shoulder PainLower back painHyperreflexia",
            "post_id": "2639124",
            "timestamp": "1205432175",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "NOTICE IT SAYS RIGHT...Stomach and/or Right Shoulder PainThis type of stomach pain, called epigastric pain by the medical profession, is usually under the right-side ribs. It can be confused with heartburn, gallbladder problems, flu, indigestion or pain from the baby kicking. Shoulder pain is often called referral pain because it radiates from the liver under the right ribs. Lower back pain is different from muscle strain common to pregnancy. It is usually more acute and specific. All may be a sign of HELLP Syndrome or a related problem in the liver. Shoulder pain can feel like someone is deeply pinching you along the bra strap, or it can be painful to lie on your right side.What you can do...Pain in this area should be taken very seriously; do not dismiss it and go to bed. Call your health professional immediately.",
            "post_id": "2639131",
            "timestamp": "1205432232",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "Some women are more at risk of developing pre-eclampsia than others, especially:Women in their first pregnancy.Women pregnant for the first time by a new partner.Women who’ve had pre-eclampsia before.Women whose mums or sisters have had pre-eclampsia.Women aged over 35 years old.Women expecting twins or multiples.Women with chronic illnesses, such as kidney problems, migraine, diabetes or high blood pressure.",
            "post_id": "2639145",
            "timestamp": "1205432359",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "I'll do some searching.....since I've had higher blood pressure and blurred vison head aches  rapid heart rate and now right shoulder pain I think I should talk to my Dr directly forget his nurse",
            "post_id": "2639148",
            "timestamp": "1205432366",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "ok I did the research for you! haha.... it says expecting twins... first preg... girl what do you think?",
            "post_id": "2639152",
            "timestamp": "1205432388",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "I think it's important you talk to the doctor too, and if you haven't checked your own blood pressure at a pharmacy, do so.  It does sound like you're having all the classic symptoms of preclampsia...Probably not uncommon with twins I would think.Sheri",
            "post_id": "2639167",
            "timestamp": "1205432578",
            "user_id": "user_324372",
            "user_link": "/personal_pages/user/324372",
            "votes": "0"
        },
        {
            "answer": "I've had killer heart burn lately too....I've been living on tums....and it feeld like a pinching in my bra line....",
            "post_id": "2639175",
            "timestamp": "1205432671",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "ok.. call!!! haha let us know I will say a short prayer right now that it is nothing...",
            "post_id": "2639178",
            "timestamp": "1205432706",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "man I've had nausea lately too.....gosh I'm for real calling my dr. forget the nurse",
            "post_id": "2639184",
            "timestamp": "1205432761",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "my blood pressure was 141/89 yesterday my pulse was only 121 so that's low for me lately.......what can they do for it?",
            "post_id": "2639211",
            "timestamp": "1205433048",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "there are meds and bed rest... probably some other things.. only cure is delivery.. they just manage symptoms until then and try not to deliver soon...",
            "post_id": "2639221",
            "timestamp": "1205433156",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "ok I just got off the phone with the nurse again the Dr was in a patients room.....and she kind acted like I was over reacting.....but she told me to go to a clinic and get my blood pressure taken manually and then call them back......she said he usually goes by you're blood pressure...but here's all my symptomsBAD!!! heart burnNausea (never had Morning sickness)My eye site has gotten blurry the past 2 weeksLower Back pain (figured due to an extra baby)Racing Pulse (120+)ConfusionTrouble catching my breathRight shoulder painsTerrible headaches",
            "post_id": "2639267",
            "timestamp": "1205433573",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "Most women who will get HELLP have blood pressure problems before they get HELLP syndrome. (But you can get HELLP syndrome even if your blood pressure is normal.)Notice... you can get hellp syndrome even ifyour blood pressure is normallll",
            "post_id": "2639367",
            "timestamp": "1205434504",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "HELLP syndrome is a life-threatening liver disorder thought to be a type of severe preeclampsia. It is characterized by Hemolysis (destruction of red blood cells), Elevated Liver enzymes (which indicate liver damage), and Low Platelet count.Between 4% and 12% of women who have severe preeclampsia or eclampsia develop HELLP syndrome. But women can have HELLP without having either preeclampsia or eclampsia first.1 In most cases, this happens before 35 weeks of pregnancy, though it can also develop right after childbirth.1, 2HELLP syndrome often occurs without warning and can be difficult to recognize. It can occur without the signs of preeclampsia (which are usually a large increase in blood pressure and protein in the urine). Symptoms of HELLP syndrome include:Headache.Vision problems.Pain in the upper right abdomen (liver).Shoulder, neck, and other upper body pain (this pain also originates in the liver).Fatigue.Nausea and vomiting.Seizure.HELLP syndrome can be life-threatening for both the mother and her fetus. (Most fetal deaths that follow HELLP syndrome are actually caused by complications of premature birth before 28 weeks of pregnancy.3) A woman with symptoms of HELLP syndrome requires emergency medical treatment.so it looks like it would be hellp syndrome if you don't have the high blood pressure they need to check your liver...  girl sometimes you have to take charge of your health care especially when it is a nurse that may never have seen hellp before",
            "post_id": "2639391",
            "timestamp": "1205434722",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "so they can check for hellp with the urine test too?  My dr has done no testing except BP and u/s no urine or blood testing....",
            "post_id": "2639413",
            "timestamp": "1205435013",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "what does the hellp stand for do you know?",
            "post_id": "2639417",
            "timestamp": "1205435046",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "Your dr. doesnt do a urine test at every dr. appt???",
            "post_id": "2639436",
            "timestamp": "1205435194",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "nope just bp and u/s",
            "post_id": "2639459",
            "timestamp": "1205435440",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "Wow, i though urine test was the normal routine in check ups. I would have him check it!",
            "post_id": "2639493",
            "timestamp": "1205435706",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "wow I thought all dr did a urine test at every check up for pg... you need to have it checked.. kaiser does all patients every time",
            "post_id": "2639497",
            "timestamp": "1205435761",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "Acronym\tDefinitionHELLP\tHaemolysis, Elevated Liver Enzymes, Low Platelets",
            "post_id": "2639500",
            "timestamp": "1205435799",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "You don't think my Dr will get mad me trying to diagnois my own problem",
            "post_id": "2639505",
            "timestamp": "1205435862",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "haha,... who cares!! it is your baby and he should be checking your urine.. mine has always done it even with my first 11 years ago...",
            "post_id": "2639524",
            "timestamp": "1205436030",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "I agree with melimli!! Who cares.......And he should be checking that urine!!!!",
            "post_id": "2639534",
            "timestamp": "1205436128",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "No offense, but yoru doc sounds questionable. to me :0)- My doc does urine test EVERY TIME no matter what as they check for protein in the urine and other things that can diagnose blood pressure probs since everyone's \"normal\" is different.Get a 2nd opinion and quickly, in my opinion. Stay safe. It's their job to answer your questions.",
            "post_id": "2639551",
            "timestamp": "1205436262",
            "user_id": "user_281219",
            "user_link": "/personal_pages/user/281219",
            "votes": "0"
        },
        {
            "answer": "Urine testing is performed at all prenatal visits. Specifically, the urine is checked for the presence of sugar and protein. Sugar in the urine could indicate gestational diabetes and the presence of protein could indicate toxemia, a pregnancy complication.",
            "post_id": "2639556",
            "timestamp": "1205436320",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "yeah he's done no blood work or urine testing.....although he said at my 18 weeks appt he was gonna do the triple whatever blood testing.....So do you think I should demand to come in for the urine testing today or wait til my next appt the 24th?",
            "post_id": "2639559",
            "timestamp": "1205436356",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "I actually switched to him over another lady I was going to b/c he's supposively the best in town....and almost everyone goes to him...I figured since he was doing the u/s everytime maybe that's why he hadn't done the other testing...",
            "post_id": "2639585",
            "timestamp": "1205436619",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "don't wait!  you would never forgive yourself if something happened.. you have twins which increases your risk... the 24th is a long time from now.. just go in..",
            "post_id": "2639603",
            "timestamp": "1205436779",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "I would do what you think is right for you! If I were you I would see if maybe you can be seen sooner. And I would ask him why he hasnt done any testing and or urine.",
            "post_id": "2639606",
            "timestamp": "1205436800",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "oh and u/s doesn't show your liver function!  be strong girl.. I know it is hard when you are young to demand.. as you get old you just don't care what anyone thinks haha... good luck",
            "post_id": "2639610",
            "timestamp": "1205436834",
            "user_id": "user_296076",
            "user_link": "/personal_pages/user/296076",
            "votes": "0"
        },
        {
            "answer": "When I call them back with my bp I'll ask why he hasn't done a urine test....and tell them I'd rather come in and have one done to help calm my nerves and heck while im there I want another u/s...(you can never have to many pictures) LoL  I just hope they don't get mad but I'm worried and that's one thing they don't want is a worried pregnant woman that is big enough to sit on them and do damage.....well only 15 more minutes and i'm off work then I have a 30 minute drive home or should I say to the health clinic...I don't know why they want me to go to a clinic and no just have me come in and have it checked.....the nurse said a manual check is better than those machines....",
            "post_id": "2639679",
            "timestamp": "1205437632",
            "user_id": "user_178590",
            "user_link": "/personal_pages/user/178590",
            "votes": "0"
        },
        {
            "answer": "A manual check is better than the machines, but I don't understand why they didn't just tell you to come in THERE for them to check it.  I cannot believe your doctor is not checking your urine at each visit.  I go in at least 2 times a week and they check mine every time (and everyone else too).  You are definitely high risk with twins and he should be taking every extra precaution with you, including LISTENING to you when you call with different symptoms.  I don't know how many ob/gyn's you have to choose from in your area, but I would start looking for another, and a high risk would be your best choice.  HELLP syndrome is very serious, and life threatening, and if you are having symptoms of that or pre eclampsia you need someone to take you seriously.  Brandi please check into getting another doctor, one that doesn't take any chances with you, or your precious babies!!!",
            "post_id": "2639938",
            "timestamp": "1205441539",
            "user_id": "user_176934",
            "user_link": "/personal_pages/user/176934",
            "votes": "0"
        },
        {
            "answer": "Good luck ! and Yes my dr checks my urine EVERY time too! with this baby and the last.. Girl dont let him decide .....I would step up to them and demand this test every time! or I agree with the others PLEASE start looking for another DR...  you have two precious lil angels in you you rely on you and yor DR care!  Good luck girl, please let us know how all  goes.. I am worried about you =( I will say a prayer that all is well and you and your lil ones stay healthy!!!!Kellu",
            "post_id": "2640358",
            "timestamp": "1205447945",
            "user_id": "user_171867",
            "user_link": "/personal_pages/user/171867",
            "votes": "0"
        },
        {
            "answer": "wow... Hope all turns out for the best browneyes... you have had it tough form the start. maybe you should get an another ob... good luck and let us know.",
            "post_id": "2640538",
            "timestamp": "1205450727",
            "user_id": "user_304653",
            "user_link": "/personal_pages/user/304653",
            "votes": "0"
        },
        {
            "answer": "Sweatheart, you  HAVE high blood pressure (read below from March of Dimes) and you have a doctor who is not doing anything to help you.\"A systolic reading of 140 or higher, or a diastolic reading of 90 or higher, is considered high blood pressure. \"That he is NOT helping you is malpractice...plain and simple, especially if he is not conducting the standard tests at EVERY SINGLE visit and that includes, like the gals have been saying, URINE TESTS.You need to take this seriously and if you don't feel comfortable standing up to your doctor then go the the ER so they can run the proper tests and confirm a diagnosis. If you don't do this and something bad happens to you or your baby you will have to live with that for the rest of your life. If you DO do this and everything is normal then you have that assurance and peace of mind.I know standing up to your doc is hard...I had to do it just yesterday regarding my blood clot history as my high risk OB was trying to pass the buck to everyone else...THAT'S WHY I GO TO THEM!!!**link to full article and copy of relevant paragraph.**http://www.marchofdimes.com/professionals/14332_1222.aspHow is blood pressure measured?At each prenatal visit, the health care provider measures blood pressure with an inflatable cuff that wraps around the woman's upper arm. The pressure in the arteries is measured as the heart contracts (systolic pressure) and when the heart is relaxed between contractions (diastolic pressure). The blood pressure reading is given as two numbers, with the top number representing the systolic pressure and the bottom number representing the diastolic pressure (for example, 110/80).A systolic reading of 140 or higher, or a diastolic reading of 90 or higher, is considered high blood pressure.Because blood pressure can go up and down during the day, health care providers often re-check a high reading to determine if a woman truly has high blood pressure",
            "post_id": "2642349",
            "timestamp": "1205492458",
            "user_id": "user_281219",
            "user_link": "/personal_pages/user/281219",
            "votes": "0"
        }
    ],
    "post_id": "2639065",
    "question": "ok so I know I'm full of questions lately but the past 2 days I've noticed a very sharp pain on the back side of my right shoulder when I move it hurts worse but if I stay still it's ok.....it's like a pulled muscle or something......my mom said it could be a pregnancy thing but I've never heard of that .....anyone esle have this?",
    "timestamp": "1205431474",
    "title": "Pain in right shoulder",
    "user_id": "user_178590",
    "user_link": "/personal_pages/user/178590"
}