{
    "answers": [
        {
            "answer": "I keep telling the doctors that my pain triggers my seizures and they keep telling me that is impossible. To appease them I suggested that pain can be exhausting on the body and exhaustion causes seizures.  They are more agreeable to that.  I have a very minor heart condition and and sciolosis.After car accidents and returning to work...that is grossly hard on my back, my siezures return.  I fell at work a few months ago and my seizures returned and became uncontrolled.  If I control my back pain I seem to control my siesures.I am wondering if you have made any head way with your doctors in having them open their eyes.  I am sure there are more of us out there.I wnat more than anything to get my life back, maybe we can show the medical community we are the precedent setting cases.  After all we are the experts on our own bodies, they have just never came across cases like us or have never given others a serious listen.I am going to a world reknowned pain doctor and epilepsy clinic in the winter, they are going to work together to figure this out.  Please contact me if you suffer pain and seizures.  Strength in numbers...maybe they will listen.",
            "post_id": "3383852",
            "timestamp": "1220986747",
            "user_id": "user_614977",
            "user_link": "/personal_pages/user/614977",
            "votes": 0
        },
        {
            "answer": "my daughter who is 6 has the same things she is taking 600mg of tegretol a day and we thought it was from pain then she would take a seizure out of the blue she has also had EEG's done and MRI and normal there is an abnormalty in left side of brain then she had a cut on her foot i put peroxide on it and she took a seizure and her eyes went really big while she was coming out of it and today she was getting sharp pain in her back and chest pains and again she took another seizure and eyes went huge while coming out what is this i would like to know. I am going to see her doctor on thursday and going to tell them i want more tests done on her this in not right.",
            "post_id": "3409351",
            "timestamp": "1221518525",
            "user_id": "user_621153",
            "user_link": "/personal_pages/user/621153",
            "votes": 0
        },
        {
            "answer": "I agree this is not right. I have a rare condition that cause extreme pain and eventual organ failure however i have been have what looks like seizures for a few years now I’ve flown to the UK and had specialist assess me in Australia all test are normal and I’m expected to just get on with life ??? Impossible I’ve had 4 seizures this week alone. I def. think pain can cause seizures and it needs to be looked into and research as it can completely control yours and your families life i would love to hear more people opinion?:)",
            "post_id": "5042375",
            "timestamp": "1257278762",
            "user_id": "user_1095830",
            "user_link": "/personal_pages/user/1095830",
            "votes": 0
        },
        {
            "answer": "Reading these posts makes me feel good and bad, my husband is 27 in good health and very active he started having seizures after hurting himself within the past few years but it has started to happen more and more. He had surgery a little over a year ago because he had sleep apnea, they drilled out his sinuses and removed his tonsils, adenoids, uvula and scrapped down his tongue. He is now able to sleep without snoring and he can breathe through his nose. Since the surgery his seizures have been more often and worse each time. He just had one today because he hit his arm, it was painful but not that bad. I said that it seems to me an adrenaline rush from the pain causes the seizure its his bodies way of dealing with the pain. I really think that all the Dr.s who say this is normal or say there is nothing wrong are crazy. It is not safe or healthy to have seizures for any reason. I was wanting to know if anyone else has more than one seizure caused by pain? I ask because my husband always has one small one then he will come to then within a minute or so he will have one that is worse and lasts at least a minute or more and he always wets himself, which is the worst for him. I hope and pray someone finds an answer to this. It took me 6 years and 10 Dr.s to find out that I had Sinus Tachycardia and Ehlers Danlos Syndrome Type 3 or Hyermobility type, I don't produce Collagen or Protein so my joints are deteriorating and there is no cure or real treatment. I have been dealing with it for my whole life without knowing until I was 22 I am now 30 and still hold out hope for a cure. I hope that I can find an answer for my husbands seizures soon it is a scary thing. Good luck to all of you and never give up hope!",
            "post_id": "5621070",
            "timestamp": "1272421508",
            "user_id": "user_1295063",
            "user_link": "/personal_pages/user/1295063",
            "votes": 0
        },
        {
            "answer": "OMG--I have had the same thing...And no doctor nor mri or egg has been able to tell me what is wrong with me....my seizures are also brought on by pain...it usually takes a while before i experience another siezure. i can go years with out them.. due to one of my seizure i have lost my 4 bottom fron teeth... i fell foward and my jaw hit the floor so hard my teeth literally shattered and this was after having a charlie horse. i wish some one would tell us what is wrong with us...... ***@****",
            "post_id": "5624979",
            "timestamp": "1272503523",
            "user_id": "user_1296226",
            "user_link": "/personal_pages/user/1296226",
            "votes": 0
        },
        {
            "answer": "The following posts are very interesting. I am a neurologist and currently subspecialty training in pain management.  After reading the above posts I would like to clarify a few points. Technically, pain is not a \"cause\" of seizures. Seizures are caused by both structural abnormalities in the brain, which can usually be seen on neuroimaging, or physiologic abnormalities which can not. Some people will have a lower threshold for having a seizure. For example, lack of sleep will lower your seizure threshold. This is why they do sleep deprived EEGs. It is very reasonable to presume that pain can be a \"trigger\" for a seizure in a person who has a lower seizure threshold. In fact pain can induce a vasovagal response that can also cause a loss of consciousness and subsequent seizure. So pain, albeit uncommon, can be a trigger for a seizure.  Did you hear about all the people who had seizures when the Pokemon cartoon first came out? The flashing lights \"triggered\" a seizure in some people who were predisposed to them. In the end, antiepileptic medication treats both neuropathic pain and seziures.",
            "post_id": "5994711",
            "timestamp": "1281034150",
            "user_id": "user_1404192",
            "user_link": "/personal_pages/user/1404192",
            "votes": 0
        },
        {
            "answer": "I have low back pain due to having seizures aleast ten in a year maybe more cause sometimes since I have been on Tegretol, when I have a seizure I have two or three in a row....I end going to the hospital with a black eye or broke leg once.....so I think pain causes seizures also I have Scolios and Denergative disc disease...doctors dont care just about the money rollin in....this is system is unbeilevable!",
            "post_id": "6144264",
            "timestamp": "1284572563",
            "user_id": "user_1446810",
            "user_link": "/personal_pages/user/1446810",
            "votes": 0
        },
        {
            "answer": "ive had seizures sense i was 6 years old and they usally happen when i am ill or when i get bad pain,i know when there about to happen and i can sometimes even prevent them from happening, but when they do happen i can remember everything,ill get really dizzy and my ears will begen to ring, then ill be out for about a min. i dont twich or anything but i do get stiff up sometimes, then ill wake up and in a couple of min, ill be perfictly fine but sometimes ill be really exhausted and ill sleep for a long time.and when i tell people that they are brought on by pain most of the time they dont belive me when i tell them this and all the docters say that they dont know why i have them.ive had e.e.gs and m.r.is done and they all came out normal.everyone tells me that pain can not bring on seizures and theres no way im haveing them because of pain but yet almost all of my seizures were brought on because of pain, like today i almost had one at the dentist when he stoke the nidle in me to numb my gums.im positve that pain can bring on seizures because im living proff, and so are all of you.people always talk to me about my seizures and tell me why i could be having them and tell me that im wrong when i tell them about pain, but yet im the one who has them!..when i was 4 i feel and craked my head opean on a corner of a brick.then when i was in first grade i ran into the blechers and i had a seizure.then a little while after that i step on a piece of glass and got really dizzy and had another.after that i was 7 and was banging on my door and my hand went through a glass part on the door, i got really dizzy but i sat down and breathed slowly and i calmed myself, i prevented that one from happing. when i was in 8th grade i hit my funny bone really hard and i had one. when i was 14 i felt really sick and dizzy i layed down and breathed slowly and calmly and i prevented that one.when i was 16 i fell off my skateboard and broke my arm, i had a seizure when they poped it back in place at the hospital.2 weeks ago i broke my knuckles and i had to be walked out of class because the pain was so bad i was getting dizzy and almost had one but i prevented that one too. so to everyone out there that doesnt belive that seizures can be brought on by pain your wrong!! they can be and i have them and so doese these other people. belive us and help us because this is not something we would lie about, we want are lifes back so why the heck would we lie??!!..i absolutly know that seizures can be brought on by pain and all you other people that belive it too are right! i hope that the docters will start listening to me because i want my life back and i want help..i hope that they can help us all..",
            "post_id": "6172165",
            "timestamp": "1285219281",
            "user_id": "user_1454336",
            "user_link": "/personal_pages/user/1454336",
            "votes": 0
        },
        {
            "answer": "my sons 18 and he too has suffered the same experiances they called it some shock syndrome..but hes allways had learning difficulties and his memory is poor hes due to see a neurologist on 13 oct but all the other doctors have drawn a blank...its uch a worry he cant even get a job because of his lack of confidence and hes such a fantastic lad..he want to work on a building site but im so scared in case he hurts himself..his father has epilepsy and has all his life so dont know whether anything has been passed on so fingers crossed we get a result....",
            "post_id": "6197584",
            "timestamp": "1285835294",
            "user_id": "user_1461211",
            "user_link": "/personal_pages/user/1461211",
            "votes": 0
        },
        {
            "answer": "I have suffered from the same thing my whole life.  It is a pain and it is embarrassing.  If I even so much as bump an elbow i have a seizure.  If I cut my finger I have a seizure.  Basically anything that causes pain causes a seizure.  All the doctors have blown me off and said that I am crazy or it is all in my head!  Sad thing about it is that while they are blowing me off I am still having seizures with no end in sight.  I don't like to have seizures at all much less over something as little as a bump on the knee or elbow.",
            "post_id": "6369736",
            "timestamp": "1290099869",
            "user_id": "user_1510786",
            "user_link": "/personal_pages/user/1510786",
            "votes": 0
        },
        {
            "answer": "it is nice to see i am not the only one who thinks there is a connection between pain and seizures.  i'm sure most of you have heard the general \"triggers\" (brain trauma, lack of sleep, stress, strobe lights, some sounds, etc.)  i started going to the epilepsy center in the cleveland clinic 3 years ago.  after some intense testing, scar tissue was found the right temporal lobe of my brain. the scar tissue is thought to be the result of a severe car accident my senior year of high school. (2005)  i am now 23 and currently working on a master’s degree in mental health counseling with a goal of earning a phd in counseling psychology.  however since my car accident, the seizures have worsened.  before the surgery, the seizures averaged out to around one every 3.5 weeks. in 2009, the doctors performed an operation called a temporal lobectomy where a golf ball sized portion of my skull was removed to allow the surgeon access the scar tissue…the scared tissue was then removed….my skull was stapled back into place via titanium staples. this is now, the second winter i have experienced since the surgery, although the pain of ’10 – ‘11 has been much worse than the ’09 – ’10.   the cold temperatures in the single digits have taken a toll and come with severe headaches.  the headaches are so strong, i can check my pulse by simply counting the pain sensations for ten seconds and multiplying by 6.  with every heartbeat comes a throbbing pain. since the first of december, i have experienced three (the last two being less than 3 weeks apart).  every day i had a seizure, i had been outside for some part of the day long enough to allow the cold to screw with the staples and develop severe headaches.  i do not believe that is a coincidence and pain can and are causing my seizures to worsen…..although some say i am only looking for a good reason to move to florida.  hahaha  seriously though, if you do not live in a cold climate to be bothered by the metal, you may want to look into the surgery and to see if it may be an option.  dr. william bingaman was my surgeon at the cleveland clinic. the clinic has a very helpful staff and i recommend the click to anyone.  i hope this was helpful to anyone curious about the subject.....  : )",
            "post_id": "6629152",
            "timestamp": "1297209883",
            "user_id": "user_1594000",
            "user_link": "/personal_pages/user/1594000",
            "votes": 0
        },
        {
            "answer": "When I do this, my blood pressure drops dangerously low- like 60/40. I do have high blood pressure and have taken medication since the 80's. Even with meds, it still ran about 145/ 90ish. But now that I take Keppra. it runs 120/80. BTW, I am 56.Jeanette",
            "post_id": "6778765",
            "timestamp": "1301427116",
            "user_id": "user_1648851",
            "user_link": "/personal_pages/user/1648851",
            "votes": 0
        },
        {
            "answer": "I am about to have a seizure caused by pain, I have a lumbar disc proplapse and have already had 3 seizures in the last three days. Will try and post us after the seizureps sleepdog the neurology guy is full of it drugs don't solve the problem always",
            "post_id": "6840170",
            "timestamp": "1303259157",
            "user_id": "user_1666876",
            "user_link": "/personal_pages/user/1666876",
            "votes": 0
        },
        {
            "answer": "My 10 yr old son had a seizure 1 yr and 5 months ago.  Dizziness followed by loss of conciousness.  He twitched minimally the first time, but did have urinary incontinence, his eyes were wide open and pupils dilated.  He had  nausea, and vomiting after.  No postictal aura, he just seemed tired after.   His primary referred him to a neurologist, who did not diagnose him or order further testing.  She just said he would be evaluated if he had another one, though the posibility of him having another one after 1 yr would drop by 50%.  Yesterday he had another one.  He jerked a little more, but had no urinary incontinance, nausea but no vomiting.  He saw his primary and her diagnosis was syncope (passing out) and gave a referral to a neurologist.  The thing is that both times was while I was cutting his hair! Both times he made a comment that it hurt.  The first time the clippers had a dull blade and he said it had pulled his hair.  The second time he said I had nicked him in the ear with scissors.  I checked and there was no cut, no redness, nothing.  Both times the seizure occured just minutes, if that, after he had complained.  The thing is he has had pain before, he is a boy occasionally gets hurt, but he has never passed out or had a seizure, just the two times with hair cuts.  I did cut his hair inbetween the two seizures without incident.  Does anyone have any insight, suggestions, or even speculations on what may be going on?",
            "post_id": "6859215",
            "timestamp": "1303875558",
            "user_id": "user_1672276",
            "user_link": "/personal_pages/user/1672276",
            "votes": 0
        },
        {
            "answer": "hey guys, im 17, male and today just after school my friend kicked my finger by mistake and i felt so much pain and i got all dizzy and i was trying to fight it because i believe in mind over matter which in this case did help me because i only experienced this grand mal seizure for only about 3 seconds. this is the first time something like this has happened to me. i really dont know wat to do im going to a walk in clinic tomorrow but this blog or w.e really has given me an idea to wats going on. i also have a heart condition maybe theres something to it thats linked? i dont kno when this can struck again because when i popped my shoulder i was in pain but i did not experience this before its the first time and i guess u can say im worried lol any feedback would be appreciated thanks",
            "post_id": "6900036",
            "timestamp": "1305172827",
            "user_id": "user_1683834",
            "user_link": "/personal_pages/user/1683834",
            "votes": 0
        },
        {
            "answer": "My so is 9 years old and has had \"episodes\" for the last 3 years in response to pain. These \"episodes\" which I firmly believe are seizures seem to come in clusters and all happen when pain is introduced. He does not have them everytime he is hurt which makes it hard to know when to expect it. He has had approx. 10 total. Each one seems to be different in nature....today while at the hospital getting his cast off (I need to say when he broke his arm at school he had no issues) he was complaining it hurt when he tried to move his wrist because it was stiff. Well, the dr. felt his arm and he stated he was dizzy. I told him to breath and then he went into a full tremor and his eyes were really funny and in two different directions but he has never wet himself. The Dr. stated it was a seizure and needed to see a neurologist. I explained our whole story and how we have and even been in hospital and the MRI and EEG are always fine so the local dr. is sending us to a pediatric neuro for a second opinion. He ask to have that Dr. call him so he could explain to him what he witnessed. I am a nervous wreck always worried he will do this when I am not there and get hurt. PLEASE if anyone gets any answers update so we can get some relief from this unknown condition!!",
            "post_id": "6938172",
            "timestamp": "1306439217",
            "user_id": "user_1695351",
            "user_link": "/personal_pages/user/1695351",
            "votes": 0
        },
        {
            "answer": "It is crazy that I am seeing all of you on here right now. I was talking to my husband, asking if he thought that our son's siezures could have been caused by pain (is that possible)? and so I decided to look online for more information. It is reassuring to see that there are more people out there with this same problem. Hopefully, someday soon, we can get some answers. My son is 5, and has had two siezures in three weeks. We have never noticed him having a siezure before, but he just gets stiff and collapses with his eyes rolled back and is non-responsive for about thirty seconds. The last siezure he had was at the hospital to get his MRI. They had just put in his i.v., we were walking back to the room and he started having a siezure, but the time before that he was watching cartoons. There have been several times that he has had a blood draw or slammed his finger in the door, etc... where he got all pale and collapsed, but we didn't realize that this could have been him having a siezure. Thank you all for sharing.",
            "post_id": "6941801",
            "timestamp": "1306557806",
            "user_id": "user_1696325",
            "user_link": "/personal_pages/user/1696325",
            "votes": 0
        },
        {
            "answer": "my pain induced seizures started when i was 3 i got my finger bent back in a vcr at the time my dr said i would grow out of them, im 18 and have not grown out of them. intense unexpected pain normaly triggers them. i have had many tests done every thing has come back normal. my most recent seizure was may 31st i sneezed my abdomin hurt then i felt the tingley buzzy feeling and passed out i woke up shortly to find i had falled off my bed onto tile floor lucky my knees were only a little bruised but as normal i was extremly tired. one dr said my blood oxygen levels could be low and to increase my salt intake but tuesday after my seizure the only thing not normal was my heart rate was up a little bit. i am looking for a new nurologist to go see ( my last one saw me once then sent me to a cardiologist who tald me about the blood oxygen levels neither helped).i have been told that durring my seizures my upper body tenses up and my eyes roll back in my head.  since i was 3 ive had at least 8 seizure all after experiencing pain.       i am glad to know i am not the only one, if any one finds out something new please share. thank you.",
            "post_id": "6956312",
            "timestamp": "1307044088",
            "user_id": "user_1700572",
            "user_link": "/personal_pages/user/1700572",
            "votes": 0
        },
        {
            "answer": "I am 73, have transverse myelitis,have banding and burning in my abdomen and lower chest and from left buttock down left lower extrmity. When it gets very bad I get aspinal seizure from the buttock to left thigh with paralysis down to left foot. the burning is severe and I fall to the ground.  It lasts for 1-2 minutes and I canthink and talk while it occurs and get up as if if nothing ever hapened. I am improved with 600mg of oxcabazepine.  Now that it is staring to recur I would like to raise the dose. Any thoughts about the dose?prinx",
            "post_id": "7047520",
            "timestamp": "1310060567",
            "user_id": "user_1730031",
            "user_link": "/personal_pages/user/1730031",
            "votes": 0
        },
        {
            "answer": "I am a 38 year old wife and mother of three boys who was re-diagnosed with epilepsy about three and a half years ago only they said it was borderline epilepsy with a tendency to become full epilepsy  again. I have noticed that roller coaster rides will give me migraines which will in turn cause me to go into seizures as well as rapid flashing lights will cause them. I have been on and off of medicine for this since I was 3 years old.",
            "post_id": "7278490",
            "timestamp": "1317238221",
            "user_id": "user_1821418",
            "user_link": "/personal_pages/user/1821418",
            "votes": 0
        }
    ],
    "post_id": "2469060",
    "question": "Please be patient while I explain my circumstances. I was born premature and they stuck me in an incubator and put a needle in my head.  I still have the scar but it did not show up on the MRI.  When I was a year old, at a department store, I hurt my finger and had a grand mal seizure.  My mother took me to the pediatrician who yelled at her for letting me hurt myself.  After that, every time I would have an injury, I would have a grand mal seizure.  Examples, when I got bit by a dog, when I fell down a flight of stairs, when I get a really bad charlie horse in my leg.  They thought that I would grow out of it but I'm 31 and I've had 52 grand mal seizures.  In July, I had one when my back popped out in my family doctor's office (I had gone because my back had already started to hurt, then I sneezed and I heard it pop, and then it became extremely painful.)  When this happened, I had a GM right in front of my doctor.  He asked me to see a neurologist as well as a cardiologist because I have a strange heart beat as well.  The cardiologist did an EKG, a stress test and an echocardiogram.  While on the treadmill, my pulse was up to 200 after 6 minutes and they made me get off.  A week later they called and said that everything looked fine.  I decided not to see a neurologist at the time because having seizures when I hurt myself was something that I've always done and they just said that it was my body's response to pain.  Then, in November, I had a seizure out of the blue with no injury to provoke it.  My husband witnessed it.  I remembered feeling extremely dizzy (like always), and it kind of seems like the lights get a bit brighter. I layed on the floor and he said that my eyes rolled back in my head.  Then I started convulsing and a few minutes later when I woke up my pupils were fully dilated and I had urinated.  I was not awake for any of this, for this is just my husband telling me what happened.  Nor was I awake at the doctor's office, for he described the same exact thing but of course, I was unaware of what happened after the dizziness.  Because I had never had one without pain causing it, I went to the ER.  They did a cat scan which turned out normal and referred me to a neurologist who in turn referred me to an epileptologist.  The epileptologist did an EEG and an MRI.  All came back normal except he said that there is something rhythmically wrong with my heart and that I need to have more tests done.  My heart rate kept bouncing between 60 and 110 as I was laying there for about 30 minutes during the EEG.  But my epileptologist said that pain is not a trigger for seizures and that he does not want to set me up for seizure monitoring since I only have seizures 3-4 times a year on average.  He does not want to completely diagnose me with epilepsy because nothing showed up on the tests.  He did up my dose of Lamictal and told me that I cannot drive for a year or take baths alone.  He wants me to go back to the cardiologist for more tests.  Am I the only one out there with pain causing seizures?  Thank you for any patience and expertise in this area.  I feel as if I'm the strangest human being on earth. It seems as if everyone else just yells or says \"ouch\" when they hurt themselves.  What I wouldn't give for an \"ouch\" instead of a seizure.  Thanks again.",
    "timestamp": "1202218431",
    "title": "pain causing seizures",
    "user_id": "user_410140",
    "user_link": "/personal_pages/user/410140"
}