{
    "answers": [
        {
            "answer": "I keep telling the doctors that my pain triggers my seizures and they keep telling me that is impossible. To appease them I suggested that pain can be exhausting on the body and exhaustion causes seizures.  They are more agreeable to that.  I have a very minor heart condition and and sciolosis.After car accidents and returning to work...that is grossly hard on my back, my siezures return.  I fell at work a few months ago and my seizures returned and became uncontrolled.  If I control my back pain I seem to control my siesures.I am wondering if you have made any head way with your doctors in having them open their eyes.  I am sure there are more of us out there.I wnat more than anything to get my life back, maybe we can show the medical community we are the precedent setting cases.  After all we are the experts on our own bodies, they have just never came across cases like us or have never given others a serious listen.I am going to a world reknowned pain doctor and epilepsy clinic in the winter, they are going to work together to figure this out.  Please contact me if you suffer pain and seizures.  Strength in numbers...maybe they will listen.",
            "post_id": "3383852",
            "timestamp": "1220986747",
            "user_id": "user_614977",
            "user_link": "/personal_pages/user/614977",
            "votes": "0"
        },
        {
            "answer": "my daughter who is 6 has the same things she is taking 600mg of tegretol a day and we thought it was from pain then she would take a seizure out of the blue she has also had EEG's done and MRI and normal there is an abnormalty in left side of brain then she had a cut on her foot i put peroxide on it and she took a seizure and her eyes went really big while she was coming out of it and today she was getting sharp pain in her back and chest pains and again she took another seizure and eyes went huge while coming out what is this i would like to know. I am going to see her doctor on thursday and going to tell them i want more tests done on her this in not right.",
            "post_id": "3409351",
            "timestamp": "1221518525",
            "user_id": "user_621153",
            "user_link": "/personal_pages/user/621153",
            "votes": "0"
        },
        {
            "answer": "I agree this is not right. I have a rare condition that cause extreme pain and eventual organ failure however i have been have what looks like seizures for a few years now I’ve flown to the UK and had specialist assess me in Australia all test are normal and I’m expected to just get on with life ??? Impossible I’ve had 4 seizures this week alone. I def. think pain can cause seizures and it needs to be looked into and research as it can completely control yours and your families life i would love to hear more people opinion?:)",
            "post_id": "5042375",
            "timestamp": "1257278762",
            "user_id": "user_1095830",
            "user_link": "/personal_pages/user/1095830",
            "votes": "0"
        },
        {
            "answer": "Reading these posts makes me feel good and bad, my husband is 27 in good health and very active he started having seizures after hurting himself within the past few years but it has started to happen more and more. He had surgery a little over a year ago because he had sleep apnea, they drilled out his sinuses and removed his tonsils, adenoids, uvula and scrapped down his tongue. He is now able to sleep without snoring and he can breathe through his nose. Since the surgery his seizures have been more often and worse each time. He just had one today because he hit his arm, it was painful but not that bad. I said that it seems to me an adrenaline rush from the pain causes the seizure its his bodies way of dealing with the pain. I really think that all the Dr.s who say this is normal or say there is nothing wrong are crazy. It is not safe or healthy to have seizures for any reason. I was wanting to know if anyone else has more than one seizure caused by pain? I ask because my husband always has one small one then he will come to then within a minute or so he will have one that is worse and lasts at least a minute or more and he always wets himself, which is the worst for him. I hope and pray someone finds an answer to this. It took me 6 years and 10 Dr.s to find out that I had Sinus Tachycardia and Ehlers Danlos Syndrome Type 3 or Hyermobility type, I don't produce Collagen or Protein so my joints are deteriorating and there is no cure or real treatment. I have been dealing with it for my whole life without knowing until I was 22 I am now 30 and still hold out hope for a cure. I hope that I can find an answer for my husbands seizures soon it is a scary thing. Good luck to all of you and never give up hope!",
            "post_id": "5621070",
            "timestamp": "1272421508",
            "user_id": "user_1295063",
            "user_link": "/personal_pages/user/1295063",
            "votes": "0"
        },
        {
            "answer": "OMG--I have had the same thing...And no doctor nor mri or egg has been able to tell me what is wrong with me....my seizures are also brought on by pain...it usually takes a while before i experience another siezure. i can go years with out them.. due to one of my seizure i have lost my 4 bottom fron teeth... i fell foward and my jaw hit the floor so hard my teeth literally shattered and this was after having a charlie horse. i wish some one would tell us what is wrong with us...... ***@****",
            "post_id": "5624979",
            "timestamp": "1272503523",
            "user_id": "user_1296226",
            "user_link": "/personal_pages/user/1296226",
            "votes": "0"
        },
        {
            "answer": "The following posts are very interesting. I am a neurologist and currently subspecialty training in pain management.  After reading the above posts I would like to clarify a few points. Technically, pain is not a \"cause\" of seizures. Seizures are caused by both structural abnormalities in the brain, which can usually be seen on neuroimaging, or physiologic abnormalities which can not. Some people will have a lower threshold for having a seizure. For example, lack of sleep will lower your seizure threshold. This is why they do sleep deprived EEGs. It is very reasonable to presume that pain can be a \"trigger\" for a seizure in a person who has a lower seizure threshold. In fact pain can induce a vasovagal response that can also cause a loss of consciousness and subsequent seizure. So pain, albeit uncommon, can be a trigger for a seizure.  Did you hear about all the people who had seizures when the Pokemon cartoon first came out? The flashing lights \"triggered\" a seizure in some people who were predisposed to them. In the end, antiepileptic medication treats both neuropathic pain and seziures.",
            "post_id": "5994711",
            "timestamp": "1281034150",
            "user_id": "user_1404192",
            "user_link": "/personal_pages/user/1404192",
            "votes": "0"
        },
        {
            "answer": "I have low back pain due to having seizures aleast ten in a year maybe more cause sometimes since I have been on Tegretol, when I have a seizure I have two or three in a row....I end going to the hospital with a black eye or broke leg once.....so I think pain causes seizures also I have Scolios and Denergative disc disease...doctors dont care just about the money rollin in....this is system is unbeilevable!",
            "post_id": "6144264",
            "timestamp": "1284572563",
            "user_id": "user_1446810",
            "user_link": "/personal_pages/user/1446810",
            "votes": "0"
        },
        {
            "answer": "ive had seizures sense i was 6 years old and they usally happen when i am ill or when i get bad pain,i know when there about to happen and i can sometimes even prevent them from happening, but when they do happen i can remember everything,ill get really dizzy and my ears will begen to ring, then ill be out for about a min. i dont twich or anything but i do get stiff up sometimes, then ill wake up and in a couple of min, ill be perfictly fine but sometimes ill be really exhausted and ill sleep for a long time.and when i tell people that they are brought on by pain most of the time they dont belive me when i tell them this and all the docters say that they dont know why i have them.ive had e.e.gs and m.r.is done and they all came out normal.everyone tells me that pain can not bring on seizures and theres no way im haveing them because of pain but yet almost all of my seizures were brought on because of pain, like today i almost had one at the dentist when he stoke the nidle in me to numb my gums.im positve that pain can bring on seizures because im living proff, and so are all of you.people always talk to me about my seizures and tell me why i could be having them and tell me that im wrong when i tell them about pain, but yet im the one who has them!..when i was 4 i feel and craked my head opean on a corner of a brick.then when i was in first grade i ran into the blechers and i had a seizure.then a little while after that i step on a piece of glass and got really dizzy and had another.after that i was 7 and was banging on my door and my hand went through a glass part on the door, i got really dizzy but i sat down and breathed slowly and i calmed myself, i prevented that one from happing. when i was in 8th grade i hit my funny bone really hard and i had one. when i was 14 i felt really sick and dizzy i layed down and breathed slowly and calmly and i prevented that one.when i was 16 i fell off my skateboard and broke my arm, i had a seizure when they poped it back in place at the hospital.2 weeks ago i broke my knuckles and i had to be walked out of class because the pain was so bad i was getting dizzy and almost had one but i prevented that one too. so to everyone out there that doesnt belive that seizures can be brought on by pain your wrong!! they can be and i have them and so doese these other people. belive us and help us because this is not something we would lie about, we want are lifes back so why the heck would we lie??!!..i absolutly know that seizures can be brought on by pain and all you other people that belive it too are right! i hope that the docters will start listening to me because i want my life back and i want help..i hope that they can help us all..",
            "post_id": "6172165",
            "timestamp": "1285219281",
            "user_id": "user_1454336",
            "user_link": "/personal_pages/user/1454336",
            "votes": "0"
        },
        {
            "answer": "my sons 18 and he too has suffered the same experiances they called it some shock syndrome..but hes allways had learning difficulties and his memory is poor hes due to see a neurologist on 13 oct but all the other doctors have drawn a blank...its uch a worry he cant even get a job because of his lack of confidence and hes such a fantastic lad..he want to work on a building site but im so scared in case he hurts himself..his father has epilepsy and has all his life so dont know whether anything has been passed on so fingers crossed we get a result....",
            "post_id": "6197584",
            "timestamp": "1285835294",
            "user_id": "user_1461211",
            "user_link": "/personal_pages/user/1461211",
            "votes": "0"
        },
        {
            "answer": "I have suffered from the same thing my whole life.  It is a pain and it is embarrassing.  If I even so much as bump an elbow i have a seizure.  If I cut my finger I have a seizure.  Basically anything that causes pain causes a seizure.  All the doctors have blown me off and said that I am crazy or it is all in my head!  Sad thing about it is that while they are blowing me off I am still having seizures with no end in sight.  I don't like to have seizures at all much less over something as little as a bump on the knee or elbow.",
            "post_id": "6369736",
            "timestamp": "1290099869",
            "user_id": "user_1510786",
            "user_link": "/personal_pages/user/1510786",
            "votes": "0"
        },
        {
            "answer": "it is nice to see i am not the only one who thinks there is a connection between pain and seizures.  i'm sure most of you have heard the general \"triggers\" (brain trauma, lack of sleep, stress, strobe lights, some sounds, etc.)  i started going to the epilepsy center in the cleveland clinic 3 years ago.  after some intense testing, scar tissue was found the right temporal lobe of my brain. the scar tissue is thought to be the result of a severe car accident my senior year of high school. (2005)  i am now 23 and currently working on a master’s degree in mental health counseling with a goal of earning a phd in counseling psychology.  however since my car accident, the seizures have worsened.  before the surgery, the seizures averaged out to around one every 3.5 weeks. in 2009, the doctors performed an operation called a temporal lobectomy where a golf ball sized portion of my skull was removed to allow the surgeon access the scar tissue…the scared tissue was then removed….my skull was stapled back into place via titanium staples. this is now, the second winter i have experienced since the surgery, although the pain of ’10 – ‘11 has been much worse than the ’09 – ’10.   the cold temperatures in the single digits have taken a toll and come with severe headaches.  the headaches are so strong, i can check my pulse by simply counting the pain sensations for ten seconds and multiplying by 6.  with every heartbeat comes a throbbing pain. since the first of december, i have experienced three (the last two being less than 3 weeks apart).  every day i had a seizure, i had been outside for some part of the day long enough to allow the cold to screw with the staples and develop severe headaches.  i do not believe that is a coincidence and pain can and are causing my seizures to worsen…..although some say i am only looking for a good reason to move to florida.  hahaha  seriously though, if you do not live in a cold climate to be bothered by the metal, you may want to look into the surgery and to see if it may be an option.  dr. william bingaman was my surgeon at the cleveland clinic. the clinic has a very helpful staff and i recommend the click to anyone.  i hope this was helpful to anyone curious about the subject.....  : )",
            "post_id": "6629152",
            "timestamp": "1297209883",
            "user_id": "user_1594000",
            "user_link": "/personal_pages/user/1594000",
            "votes": "0"
        },
        {
            "answer": "When I do this, my blood pressure drops dangerously low- like 60/40. I do have high blood pressure and have taken medication since the 80's. Even with meds, it still ran about 145/ 90ish. But now that I take Keppra. it runs 120/80. BTW, I am 56.Jeanette",
            "post_id": "6778765",
            "timestamp": "1301427116",
            "user_id": "user_1648851",
            "user_link": "/personal_pages/user/1648851",
            "votes": "0"
        },
        {
            "answer": "I am about to have a seizure caused by pain, I have a lumbar disc proplapse and have already had 3 seizures in the last three days. Will try and post us after the seizureps sleepdog the neurology guy is full of it drugs don't solve the problem always",
            "post_id": "6840170",
            "timestamp": "1303259157",
            "user_id": "user_1666876",
            "user_link": "/personal_pages/user/1666876",
            "votes": "0"
        },
        {
            "answer": "My 10 yr old son had a seizure 1 yr and 5 months ago.  Dizziness followed by loss of conciousness.  He twitched minimally the first time, but did have urinary incontinence, his eyes were wide open and pupils dilated.  He had  nausea, and vomiting after.  No postictal aura, he just seemed tired after.   His primary referred him to a neurologist, who did not diagnose him or order further testing.  She just said he would be evaluated if he had another one, though the posibility of him having another one after 1 yr would drop by 50%.  Yesterday he had another one.  He jerked a little more, but had no urinary incontinance, nausea but no vomiting.  He saw his primary and her diagnosis was syncope (passing out) and gave a referral to a neurologist.  The thing is that both times was while I was cutting his hair! Both times he made a comment that it hurt.  The first time the clippers had a dull blade and he said it had pulled his hair.  The second time he said I had nicked him in the ear with scissors.  I checked and there was no cut, no redness, nothing.  Both times the seizure occured just minutes, if that, after he had complained.  The thing is he has had pain before, he is a boy occasionally gets hurt, but he has never passed out or had a seizure, just the two times with hair cuts.  I did cut his hair inbetween the two seizures without incident.  Does anyone have any insight, suggestions, or even speculations on what may be going on?",
            "post_id": "6859215",
            "timestamp": "1303875558",
            "user_id": "user_1672276",
            "user_link": "/personal_pages/user/1672276",
            "votes": "0"
        },
        {
            "answer": "hey guys, im 17, male and today just after school my friend kicked my finger by mistake and i felt so much pain and i got all dizzy and i was trying to fight it because i believe in mind over matter which in this case did help me because i only experienced this grand mal seizure for only about 3 seconds. this is the first time something like this has happened to me. i really dont know wat to do im going to a walk in clinic tomorrow but this blog or w.e really has given me an idea to wats going on. i also have a heart condition maybe theres something to it thats linked? i dont kno when this can struck again because when i popped my shoulder i was in pain but i did not experience this before its the first time and i guess u can say im worried lol any feedback would be appreciated thanks",
            "post_id": "6900036",
            "timestamp": "1305172827",
            "user_id": "user_1683834",
            "user_link": "/personal_pages/user/1683834",
            "votes": "0"
        },
        {
            "answer": "My so is 9 years old and has had \"episodes\" for the last 3 years in response to pain. These \"episodes\" which I firmly believe are seizures seem to come in clusters and all happen when pain is introduced. He does not have them everytime he is hurt which makes it hard to know when to expect it. He has had approx. 10 total. Each one seems to be different in nature....today while at the hospital getting his cast off (I need to say when he broke his arm at school he had no issues) he was complaining it hurt when he tried to move his wrist because it was stiff. Well, the dr. felt his arm and he stated he was dizzy. I told him to breath and then he went into a full tremor and his eyes were really funny and in two different directions but he has never wet himself. The Dr. stated it was a seizure and needed to see a neurologist. I explained our whole story and how we have and even been in hospital and the MRI and EEG are always fine so the local dr. is sending us to a pediatric neuro for a second opinion. He ask to have that Dr. call him so he could explain to him what he witnessed. I am a nervous wreck always worried he will do this when I am not there and get hurt. PLEASE if anyone gets any answers update so we can get some relief from this unknown condition!!",
            "post_id": "6938172",
            "timestamp": "1306439217",
            "user_id": "user_1695351",
            "user_link": "/personal_pages/user/1695351",
            "votes": "0"
        },
        {
            "answer": "It is crazy that I am seeing all of you on here right now. I was talking to my husband, asking if he thought that our son's siezures could have been caused by pain (is that possible)? and so I decided to look online for more information. It is reassuring to see that there are more people out there with this same problem. Hopefully, someday soon, we can get some answers. My son is 5, and has had two siezures in three weeks. We have never noticed him having a siezure before, but he just gets stiff and collapses with his eyes rolled back and is non-responsive for about thirty seconds. The last siezure he had was at the hospital to get his MRI. They had just put in his i.v., we were walking back to the room and he started having a siezure, but the time before that he was watching cartoons. There have been several times that he has had a blood draw or slammed his finger in the door, etc... where he got all pale and collapsed, but we didn't realize that this could have been him having a siezure. Thank you all for sharing.",
            "post_id": "6941801",
            "timestamp": "1306557806",
            "user_id": "user_1696325",
            "user_link": "/personal_pages/user/1696325",
            "votes": "0"
        },
        {
            "answer": "my pain induced seizures started when i was 3 i got my finger bent back in a vcr at the time my dr said i would grow out of them, im 18 and have not grown out of them. intense unexpected pain normaly triggers them. i have had many tests done every thing has come back normal. my most recent seizure was may 31st i sneezed my abdomin hurt then i felt the tingley buzzy feeling and passed out i woke up shortly to find i had falled off my bed onto tile floor lucky my knees were only a little bruised but as normal i was extremly tired. one dr said my blood oxygen levels could be low and to increase my salt intake but tuesday after my seizure the only thing not normal was my heart rate was up a little bit. i am looking for a new nurologist to go see ( my last one saw me once then sent me to a cardiologist who tald me about the blood oxygen levels neither helped).i have been told that durring my seizures my upper body tenses up and my eyes roll back in my head.  since i was 3 ive had at least 8 seizure all after experiencing pain.       i am glad to know i am not the only one, if any one finds out something new please share. thank you.",
            "post_id": "6956312",
            "timestamp": "1307044088",
            "user_id": "user_1700572",
            "user_link": "/personal_pages/user/1700572",
            "votes": "0"
        },
        {
            "answer": "I am 73, have transverse myelitis,have banding and burning in my abdomen and lower chest and from left buttock down left lower extrmity. When it gets very bad I get aspinal seizure from the buttock to left thigh with paralysis down to left foot. the burning is severe and I fall to the ground.  It lasts for 1-2 minutes and I canthink and talk while it occurs and get up as if if nothing ever hapened. I am improved with 600mg of oxcabazepine.  Now that it is staring to recur I would like to raise the dose. Any thoughts about the dose?prinx",
            "post_id": "7047520",
            "timestamp": "1310060567",
            "user_id": "user_1730031",
            "user_link": "/personal_pages/user/1730031",
            "votes": "0"
        },
        {
            "answer": "I am a 38 year old wife and mother of three boys who was re-diagnosed with epilepsy about three and a half years ago only they said it was borderline epilepsy with a tendency to become full epilepsy  again. I have noticed that roller coaster rides will give me migraines which will in turn cause me to go into seizures as well as rapid flashing lights will cause them. I have been on and off of medicine for this since I was 3 years old.",
            "post_id": "7278490",
            "timestamp": "1317238221",
            "user_id": "user_1821418",
            "user_link": "/personal_pages/user/1821418",
            "votes": "0"
        },
        {
            "answer": "My wife has the same issue. I witnessed her several seizures and these were all cause by pain. She's now pregnant and I'm more worried. How can she handle the pain when she gives birth to a baby. What should I do?",
            "post_id": "7417778",
            "timestamp": "1321508317",
            "user_id": "user_1899917",
            "user_link": "/personal_pages/user/1899917",
            "votes": "0"
        },
        {
            "answer": "Hey Rich - My mum has pain induced seizures and she managed to give birth to my sister fine.  My mum had a few seizures during the birth (it took a while!) but was generally ok and didn't even need an epidural.  I'd avoid a water birth though (obviously)!",
            "post_id": "7433334",
            "timestamp": "1321970479",
            "user_id": "user_1908879",
            "user_link": "/personal_pages/user/1908879",
            "votes": "0"
        },
        {
            "answer": "I am 41 years old and my first pain caused seizure was when i was about ten years old and a neighbor was piercing my ears. I have seizures everytime i  bump an elbow or knee. By the age of thirty I somehow learned to stop them when I would feel it coming on. I sit on the floor and hold my head and say no, or think it and after a few seconds the feeling stops. After I still feel like I had a grand mal, sore muscles and confusion. I dont know why that works now but I am glad it does.",
            "post_id": "7447742",
            "timestamp": "1322432369",
            "user_id": "user_1916969",
            "user_link": "/personal_pages/user/1916969",
            "votes": "0"
        },
        {
            "answer": "You are definitely not the only one out there!!!!!!!!    Your story is so close to my own it shocked me. I've been through all the testing you have been through. been told its in my head, and its anxiety.... my seizures started at 5 years old and continued throughout my life. (24years old at the moment) during my testing they have tried to trigger epileptic seizures with no luck but have narrowed it down by a cardiologist to be my heart. as the pain causes shock in my body that then the drop in my blood pressure stops/slows my heart which no longer sends blood to my brain creating the Grand mal seizure trying to bring oxygen up to my brain… the best test I have had to prove this is a tilt table test, it might help you, as they stick you with a needle first which then triggered my seizure as the table was being raised to a 90 degree angle… once doctors had my heart flat lining and coming back on screen (and not just stories myself or others had told them)… they could finally do something about it! I’ve been on medication and seizure free for 2 years…. A pace maker later in life maybe an option but because of my age they are not wanting to do anything to drastic just yet! Good luck with everything! I understand how frustrating it is and how crazy drs can make you feel. All the best. Melissa",
            "post_id": "7596365",
            "timestamp": "1326773823",
            "user_id": "user_1989417",
            "user_link": "/personal_pages/user/1989417",
            "votes": "0"
        },
        {
            "answer": "Heads can be super sensitive my head messes with me more than any other part of my body!  So if his nerves are on hyper drive up there then that might be what causes that!  I found that out when I tried to get my hair highlighted with one of those caps you use the hooks to pull the hair through .. it wasn't pretty!",
            "post_id": "7813603",
            "timestamp": "1333028382",
            "user_id": "user_2094185",
            "user_link": "/personal_pages/user/2094185",
            "votes": "0"
        },
        {
            "answer": "My 18 year old daughter has had seizures for 4 years now.  In the beginning, she would have seizures during soccer games.  This was caused from exhaustion I would assume.  She has been on Keppra XR 750mg 3 at bedtime for 2 years now and seizure free.  When she turned 18 in December 2011, she  was released from care at Children's Hospital of Orange County (CHOC) and was advised by the doctor that her being seizure-free, she could stop taking the medication.  I was appalled! I now am going to take her to an Adult Neurologist at Loma Linda University but she has a few weeks before her appointment.  The oddest thing happened yesterday!  She had her wisdom teeth pulled (all 4) yesterday.  Last night, the pain was so intense, she actually fought off a seizure.  She didn't lose conscientiousness but pupils dilated, eyes big, HER NOSE CHANGED SHAPES, and right before she panicked and was muttering that she didn't want to have a seizure.  She is still medicated so I'm wondering if the pain caused this seizure.",
            "post_id": "7877016",
            "timestamp": "1334860968",
            "user_id": "user_2120428",
            "user_link": "/personal_pages/user/2120428",
            "votes": "0"
        },
        {
            "answer": ".My daughter was also born premature and has seizures which are only brought on by extreme pain or fear. First seizure occurred when she was playing hide and seek with her 1/2 sister and when her sister jumped out of hiding it scared her and she had a seizure, since then she has had several others; falling off a ladder going up to her bunk bed, slamming her finger in the car door, hitting knee on coffee table; etc. She has had many tests.. EEG, CAT scan, MRI and the doctors have come up with nothing. She has been to specialists as well. They tried to tell me they have never heard of this and act as if I am making this up. I am a nurse and they are definitely Grand Mal seizures. Her father also has them, but only brought on by extreme pain, and his daughter (her 1/2 sister). He refuses to believe they are seizures when he has them. He says it's him just passing out although he's not the one standing over him watching him flop around, tensed up, with his eyes rolled back in his head and moaning. Does anyone have any suggestions? Are maybe a good physician in the MI area they might be able to refer us to. One Dr. did say he could put her on seizure meds, but he feels she isn't haven't them often enough to make such a rash decision and sometimes the side effects of the medication is not worth toughing out a seizure or two. Anyone's suggestions or stories are greatly appreciated. This is the first time I have found anyone else with similar stories, so thank you all for your posts!",
            "post_id": "7957301",
            "timestamp": "1337148003",
            "user_id": "user_2167879",
            "user_link": "/personal_pages/user/2167879",
            "votes": "0"
        },
        {
            "answer": ".My daughter was also born premature and has seizures which are only brought on by extreme pain or fear. First seizure occurred when she was playing hide and seek with her 1/2 sister and when her sister jumped out of hiding it scared her and she had a seizure, since then she has had several others; falling off a ladder going up to her bunk bed, slamming her finger in the car door, hitting knee on coffee table; etc. She has had many tests.. EEG, CAT scan, MRI and the doctors have come up with nothing. She has been to specialists as well. They tried to tell me they have never heard of this and act as if I am making this up. I am a nurse and they are definitely Grand Mal seizures. Her father also has them, but only brought on by extreme pain, and his daughter (her 1/2 sister). He refuses to believe they are seizures when he has them. He says it's him just passing out although he's not the one standing over him watching him flop around, tensed up, with his eyes rolled back in his head and moaning. Does anyone have any suggestions? Are maybe a good physician in the MI area they might be able to refer us to. One Dr. did say he could put her on seizure meds, but he feels she isn't haven't them often enough to make such a rash decision and sometimes the side effects of the medication is not worth toughing out a seizure or two. Anyone's suggestions or stories are greatly appreciated. This is the first time I have found anyone else with similar stories, so thank you all for your posts!",
            "post_id": "7957302",
            "timestamp": "1337148152",
            "user_id": "user_2167879",
            "user_link": "/personal_pages/user/2167879",
            "votes": "0"
        },
        {
            "answer": "I am 43. I have had pain related seizures since i was 14. Most times I thought I was passing out. I had one in Middle school, banged my knee in wood shop went dizzy and fell on a vice. I fractured my skull. It doesn't happen very often but usually after extreme pain and a lack of sleep.My daughter at 1 years old hit her head and then went limp. Went to Emerg and nothing was wrong. Last night she fell on her buttocks, cried out my wife picked her up and she went limp. She was like that for 10 min. Ambulance came, they took blood preasure she was out but awake. We are waiting test results.",
            "post_id": "8157590",
            "timestamp": "1342756141",
            "user_id": "user_3137962",
            "user_link": "/personal_pages/user/3137962",
            "votes": "0"
        },
        {
            "answer": "I am sitting here in Cumberland Hospital with my fiancee. He has his T-8, T-9, and T-12 vertebraes fractured.He also, has a bruised spine, for the past 2 nights he has gotten into coughing fits which in turn jerks his back and causes pain. When the pain reaches a horribly uncontrolled level he goes into seizures.The first time this happened I was so scared that I had no clue what to do but thank god we are in the hospital and they were able to care for him. Anyway, the hospital has done so many tests on him and have come up with no answer to what the problem is. I do believe that his seizures are induced by the pain.If you can get some information to me about this please send it to ***@****.",
            "post_id": "8162774",
            "timestamp": "1342917749",
            "user_id": "user_3141576",
            "user_link": "/personal_pages/user/3141576",
            "votes": "0"
        },
        {
            "answer": "U all r very right ...my mother has the same promlems ...pain causes seizers but doctors cant find anything and i worry to death when shes at work by herself ....she has a charlie horse in her leg and she knows a seizer will follow....hope someone can find a answer soon...",
            "post_id": "8242984",
            "timestamp": "1345128257",
            "user_id": "user_3195789",
            "user_link": "/personal_pages/user/3195789",
            "votes": "0"
        },
        {
            "answer": "I don't have an answer as to why your son only had them while getting a hair cut.But I have had a seizure when i was about 8 or 9 years old while my aunt was combing my hair after a bath. I remember it feeling as though the comb dug in a little to hard, there was no  mark, no nothing.According to my mother I've had these episodes since i was very young, I was put onto tegretal but taken off it after only a short time. I was referred to a pediatric neuroligist at the time and all he said was that I wasn't epileptic. End of story for the doctors. I don't remember much of the ones from that age, the first ones I do remember I must have been about 6 or 7, they would be caused by something as simple as hitting my elbow, my tail bone, scraping my back, etc. I would get tingly, tunnel vision, then wake up feeling like I had a deep sleep with a really in depth dream and sometimes I would lose control of my bladder. When I wake up I would feel disoriented not quite sure where I was, then it would click that I had had an episode. I would only have a couple a year some I would be able to \"make go away\". I would just focus on one spot on the wall, floor whatever I could see and the tunnel vision would subside and I would be fine. Then suddenly nothing for quite a few years, thought that I had grown out of it. Then when I was 15 turning 16 I had one at a restaurant, my boyfriend and I were playing a video game waiting for our food and I was really hungry. No pain triggered this one, same as before I got tingly & tunnel vision woke up on the floor. Since I was becoming of age to get my drivers license I had to wait until after the 2nd neurologist visit. They did 1 EEG and after they told me I was just a \"delicate\" flower\" and not to worry about it all neurology signs were normal. Then I didn't have one until I was 19 (2 months before my 20th b-day) I stabbed my hand with a knife while working at a bakery, same signs as before but this time i was able to make it go away. A few months later I smashed my hand between a bread rack and the bread slicer, sat down on the floor because I knew I wouldn't be able to fight this one, woke up staring at the ceiling a few minutes later. A few more months later I was working at a vet clinic and I was assisting the vet holding a patient, I got really hot and blacked out then as I was falling I hit my head on a cement wall and had an episode, woke up on the floor had urinated myself. Once again the doctor has sent me to a neurologist, I've had a CT scan - normal, regular EEG - normal, sleep deprived EEG - normal, EKG - normal. Now I'm now 21, went 8 months without an episode then just last night I had abdominal pain that woke me out of a deep sleep, thought I had to go to the bathroom, got really hot blacked out and woke up stuck between the toilet & the wall. I have no idea how long I was out for this time since I was alone. I think it was around 2am.Now the doctor told me that he thinks its vasovagal syncope (Vasovagal syncope (vay-zo-VAY-gul SING-cuh-pee) is the most common cause of fainting. Vasovagal syncope occurs when your body overreacts to triggers, such as the sight of blood or extreme emotional distress. The trigger results in vasovagal syncope — a brief loss of consciousness caused by a sudden drop in your heart rate and blood pressure, which reduces blood flow to your brain. Vasovagal syncope is usually harmless and requires no treatment. However, you can injure yourself during a vasovagal syncope episode - Mayo Clinic website) This last episode I wound up with a cut on my upper back and a very sore neck, I am re-starting my physio treatment since my last episode 8 months ago for whip lash from hitting the cement wall.Hope you have better luck than the rest of us.I hope this provides some answers, although I hope that this is not where the doctor draws the line on the investigation. I go back to my neurologist in october to see if she has any other ideas.",
            "post_id": "8258099",
            "timestamp": "1345583730",
            "user_id": "user_3207647",
            "user_link": "/personal_pages/user/3207647",
            "votes": "0"
        },
        {
            "answer": "I just read your post with great interest.  I am 50 and have been having what I thought were pain-triggered seizures since I was about 10, when I was diagnosed as epileptic after a grand mal seizure  that was triggered by a classmate slapping me on the back.  I had several seizures from 10-14, all triggered by some kind of sharp pain, e.g., biting into very hot food, swallowing wrong, hitting my funny bone.  Was put on phenobarbital and then dilatin.  In late teens, was seizure free and weened off of the drugs.  Since then I have had pain-triggered seizures very occasionally from a blood draw, whack on the head, etc..., with no repeat triggers until today (i.e., have had many blood draws since one that caused seizure. none causing a seizure).What I have learned over the years is that I can feel an episode coming and stave it off by putting my head between my legs and sitting/squatting down for a while.  However, I just whacked my funny bone.  I felt the pain intensifying (it spirals and grows), made my way to the grass, and put my head down.  I woke a few minutes later with my head down and realized I had just had an episode, but am nearly certain there was no rigor, or muscle tensing/spasms, which led me to the computer to see what it was...Reading your post makes me wonder if I have actually been having vasovagal syncope and NOT epilepsy all these years.  I am loathe to talk to my doctor about this as what I have has always been labeled idiopathic.  My grand mal seizures in the past did involve spasms, per eye witnesses, but I now wonder about that...also, I have a very high pain threshold in general, two children via natural childbirth and not registered pain at levels most people do.  HOWEVER, certain pain I find intolerable and those are my triggers: funny bone sharp pain, quick blow to the head or back (e.g., slap on the back), swallowing wrong.  I have also just started taking Lisinopril 2 days ago for slightly elevated blood pressure and will be carefuly to see if this is affecting me negatively.",
            "post_id": "8272079",
            "timestamp": "1345991668",
            "user_id": "user_3219363",
            "user_link": "/personal_pages/user/3219363",
            "votes": "0"
        },
        {
            "answer": "Wow. I just had a pain related seizure 2 days ago. My good pain doctor retired and now I'm stuck with a moron who doesn't believe stuff. He must be omniscient since he knows everything. They have taken away my rescue meds for breakthrough pain. I'm in big trouble until I can find a pain management dr that doesn't suck. Fortunately the neurologist who I saw with this took the report on the seizures in stride and believed me.",
            "post_id": "8566030",
            "timestamp": "1354217686",
            "user_id": "user_4414346",
            "user_link": "/personal_pages/user/4414346",
            "votes": "0"
        },
        {
            "answer": "My exhaustion and stress causes my seizures too. You are not alone and it's quite frustrating dealing with doctors who think they know our bodies better than we do. I have grand mal seizures when I am tired, during my sleep, and upon awakening. I have been diagnosed with epilepsy and these types of seizures occured several years after my head injury that put me on disability. I believe it is from my injury but no one wants to believe me.",
            "post_id": "8583533",
            "timestamp": "1354636063",
            "user_id": "user_4441503",
            "user_link": "/personal_pages/user/4441503",
            "votes": "0"
        },
        {
            "answer": "Hey guys, I am with you all.  I started having seizures when I was about 14, just after hitting my arm on the washing machine.  I then did not have another one after having 3 children and 2 miscarriages until I broke a small bone in my foot which at first my husband and daughter laughed at me because I would pass out three times before they could get me into the house, only about 25 feet.  Then I had another one right in front of my neurosurgeon while he was checking my back at my two week check up after back surgery.  My daughter looked it up and it is called anoxic seizures, which are triggered by anything that reduces the flow of blood to the brain.  The report seem to say that it might only be children but from the sounds of all of us it isn't.  I too get light headed, I feel as though the room gets grey looking and I then don't remember the rest.  Well I hope this helps all of you out.  I have not been diagnosed with seizures nor do I take any special meds for it either.  I really think this is what I have.  Please let me know if you agree.",
            "post_id": "8674118",
            "timestamp": "1356919389",
            "user_id": "user_4376328",
            "user_link": "/personal_pages/user/4376328",
            "votes": "0"
        },
        {
            "answer": "I have been dealing with the same issues for the last three years. I've had 4 seizures now. I have taken time off of work to see the best of the best at the mayo clinic in Minnesota and still no one agrees. I 've been diagnosed with tension headaches, seizures, hyrniated discs, and fybromyelgia. but they have nothing to do with the seizures. ugh.",
            "post_id": "8695877",
            "timestamp": "1357407838",
            "user_id": "user_4634074",
            "user_link": "/personal_pages/user/4634074",
            "votes": "0"
        },
        {
            "answer": "Hi my name is Martine. Are you still having the seizures? I am having a similar situation as you? Any progress, if so please explain. Thank you.",
            "post_id": "8851691",
            "timestamp": "1361045051",
            "user_id": "user_4920477",
            "user_link": "/personal_pages/user/4920477",
            "votes": "0"
        },
        {
            "answer": "I myself is going through the samething.  I have been in pain for over 3 years none stop then about a year and a half ago it got to be just almost constant severe pain.  I started falling in september 2012 and I have now started falling and becoming unconscious.  The doctors told me that I have pain elepsey except.  I asked him how can we fix it.  The doctor said,\" by controlling the pain.\"  I am on morphine, diluated, valume and more if this isn't helping what can and I am on the high dosage.  I am unable to work at the moment, but every week I have to get an off work order because I am not well yet.  I still fall two times a week and that is not working.  I was worse when I worked.  I fell almost everyday.",
            "post_id": "8977897",
            "timestamp": "1364622171",
            "user_id": "user_5168986",
            "user_link": "/personal_pages/user/5168986",
            "votes": "0"
        },
        {
            "answer": "Hello,I totally agree that pain is the cause of my seizures.I was hurt on my job years ago and thats when the seizures started.They seem to had stopped for a year then returned weekly.Some days i have 10 at a time.I'm on keppra 750mg twice a day which makes me very tired along with the other meds that i take.",
            "post_id": "8994667",
            "timestamp": "1365116550",
            "user_id": "user_5206742",
            "user_link": "/personal_pages/user/5206742",
            "votes": "0"
        },
        {
            "answer": "My wife has had a Migraine since Easter Sunday and was admitted to the hospital after the ER depts had no luck relieving her pain....she has suffered with migraines since she was 16 and she is 45 now. While in the hospital she began having seizures as many as 7-8 per day in some cases. They last between 5 & 6 minutes...they all start and end the same way. The first sign that one is coming is her left hand starts to shake...as soon as that happens she is non-responsive, her right side (leg and arm) become rigid, her left side (leg and arm) become very active kicking and grabbing, her eyes dart around but are non responsive to snapping my fingers in front of them, she also drools and blows spit bubbles. I can tell when the seizure is going to end because her right hand and arm start to move and she always reaches for her head ...because now her head is throbbing. As I am holding her down she will try to bite me as if she is protecting herself.....if she is alone when the seizure happens she ends up wandering as if sleep walking (this happened in the hospital) and the nurses thought she was trying to be difficult. She has anxiety and depression issues and well as migraines and they are trying to tell us there is nothing medically wrong.....it has to do with her being stressed, depressed...etc...She has had sleep walking episodes in the past, but they did not present the same as these seizures. There have been times when I thought she was alseep watching TV and I have seen her left hand shaking..I always assumed she was dreaming and never worried about it. Most times she would wake up in a panic, but now I wonder if it was just a less violent seizure....they did EEG's and MRI's wit contrast and said it was all negative with the exception of an area of the brain on the MRI that has to do with memory..there is a follow up MRI in June.....They also did a Lumbar Puncture to check for a virus or infection....they tried 5 times over 2 days before they got it right....the Dr. who finally got it said they first Dr.'s were too low on her back (in the wrong spot)....now since then she has had no control or strength in her right leg. They sent her home with a walker and are going to do a Visiting Nurse /Physical therapy......what the hell !!!!Does this sound familiar to anyone.....and btw they say the leg problem is also in her head.",
            "post_id": "9043311",
            "timestamp": "1366519972",
            "user_id": "user_5330376",
            "user_link": "/personal_pages/user/5330376",
            "votes": "0"
        },
        {
            "answer": "My daughter has reflex sympathic dystrophy  and is having seizures. She says it is like someone is breaking her neck and the pain goes down her spine. She has recently been hospitalized twice and they could not find out anything. She had all the tests. What do you think?",
            "post_id": "9199409",
            "timestamp": "1371248506",
            "user_id": "user_5629278",
            "user_link": "/personal_pages/user/5629278",
            "votes": "0"
        },
        {
            "answer": "Has anyone here looked into Cataplexy as the cause for the episodes? Cataplexy looks exactly like epilepsy, even a grand mal seizure but is brought on by emotions, fatigue, heightened emotions. It is common for cataplexy to be paired with Narcolepsy, but not always. I feel I have a minor case of Cataplexy and was told by my sleep doc after a sleep study that my test looked as if I am actually a narcoleptic but because of the meds I am on and must be on, he can't formally diagnose it. The good thing about cataplexy is that it can be treated, but very differently than epilepsy and one is not the other. Good luck to you all!",
            "post_id": "9211679",
            "timestamp": "1371646756",
            "user_id": "user_5649193",
            "user_link": "/personal_pages/user/5649193",
            "votes": "0"
        },
        {
            "answer": "I have had two seizures due to cutting my finger. Once when I was 12 the other 22.  Both times I was working, so my heart rate would have been up, I also at times have iron deficiency. The first time I cut my finger- I passed out seizured came to passed out again seizured. The second time I got dizzy and sat down, passed out, seizured, wet myself, came to. Someone came to my aid, and told me my eyes rolled back and my body was shaking. I'm about to get my four wisdom teeth out tomorrow, and for some stupid reason I thought these seizures didn't need to be discussed. Now I'm a little worried. Don't want to seizure with a scalpel in my mouth!",
            "post_id": "9231307",
            "timestamp": "1372204172",
            "user_id": "user_5677903",
            "user_link": "/personal_pages/user/5677903",
            "votes": "0"
        },
        {
            "answer": "I've had seizures since I was ten, I am currently 18 and never took any medicine for them. They had seemed to have stopped after the 5th grade but after about 4-5 years I started having them again. The doctors have done tests and redone some of them and found nothing wrong that they can tell. So far the triggers have been sever pain, stress, or  illness like the flu. The last couple of times I've had a seizure I have actually stopped breathing. I do not think the doctors even believed I had them until I got sick and had one in the doctors office while the were checking my blood pressure. I can usually tell a couple of second (long enough to notify someone nearby) before I have one. Before I have one I usually get a funny feeling similar to the kind of feeling you get by standing up to fast. Then I black out and according to my parents and sister who have been present during most of these 'episodes' I start twitching and lose bladder control, and stop breathing. When I come to Its as if I am waking up from a dream I slowly become aware of the world getting hearing back first then vision and controlled movement of my arms, legs, and head. Afterwards I am exhausted for hours and sometimes its even days before I feel like myself again. I would like to know if anyone with a similar condition has found a way to completely prevent them so that I can have a normal life. I would also like to know if it would be safe to have children or if it would be to great of a risk for both myself and the child. Also to those who say it is impossible for pain to be the trigger that is because you have not experienced it. People also used to say it was impossible to land on the moon yet we have. Think about all the deseases that have gone undiagnosed for years until resent advances in medicine.",
            "post_id": "9321585",
            "timestamp": "1374651846",
            "user_id": "user_5808923",
            "user_link": "/personal_pages/user/5808923",
            "votes": "0"
        },
        {
            "answer": "When I was in 1st or 2nd I fell and hit my head on the floor in wall mart, woke up and seemed to be ok and days after went to school and bent my middle finger back to far and just passed out with my head down, woke up sitting with all the kids on the floor still and the teacher was still talking. Never thought about it again. Then Years later im 16 I started smoking cigs and one day my boyfriend barley hit me in my side, just enough to hurt a little and knock the air out of me. I went down to my knees and dreamed I got up but I really woke up in his arms and he said I looked like I just had a seizure. I fell out of a lifted truck one night lol and twisted my ankle a little and I got really hot and dizzy and I could tell I was about to go into a seizure so I told my sister see you in a minute lol, i shook just a little they said and Woke up and was a little tired but I was fine. I walked around in the tx heat trying to find this place and it was like 5 in the afternoon and i hadnt eaten a single thing all day but i was smoking a cig while in the heat, got to where i was suppose to be and then had this pain in my stomache and then all the sudden i got dizzy and hot like always grabbed my sister and crouched down and had one for no damn reason. Had a few more incidents but only one with pain not being involved. I thought the cigarettes triggered this weird pain seizure thing when i was 16 so after 3 years I'm now 19 and I quit smoking finally, I recently cut my foot and started to get really hot and dizzy and felt like I was going to go into one but my adrenaline just rushed and made me feel kinda sick and eventually I cooled down and could aid my foot which wasn't that bad. I have not had one lately but I also have not been hurt badly. I've never urinated on myself or had violent or long seizures, but pain definitely is the cause no doubt! Maybe my head injury when I was younger and the cigarettes triggered it or maybe I was bound to get them when I got older because of the head injury, idk. But yall are not alone and im glad to know im not either, But I'd like help so these can end, it is embarrassing and scary to be alone.",
            "post_id": "9582755",
            "timestamp": "1382177004",
            "user_id": "user_6533050",
            "user_link": "/personal_pages/user/6533050",
            "votes": "0"
        },
        {
            "answer": "question, have had gran mal seizures since I was 17 they stopped at 21 and didn't return  til I was 27. then i was diagnosed with epilepsy and have been now for many years. I am 53 now and still have seizures. meds seem to partially control them. Mostly brought on by stress or lack of enough sleep which is under 9 hours. eeg recently showed no  activity but mri came back with scaring. The neurologist  first sayed I had a benign tumor but then said itwas the scaring and with my past seizure activity their might be a procedure I might be eligible for.  scary for me. any thoughts",
            "post_id": "10522009",
            "timestamp": "1402011633",
            "user_id": "user_9155690",
            "user_link": "/personal_pages/user/9155690",
            "votes": "0"
        },
        {
            "answer": "I Have been having sever pain with arthritis .made an appoiment with doc ,for this week.in the meantime i have had 2 seizurs.so very scary.as i live alone .",
            "post_id": "10943783",
            "timestamp": "1408342115",
            "user_id": "user_10179761",
            "user_link": "/personal_pages/user/10179761",
            "votes": "0"
        },
        {
            "answer": "Maybe this reasoning would help.  I know that pain medications - narcotics - mimic the same endorphins released naturally in fight or flight cycles AND narcotics LOWER the seziure threshold -- meaning it is more likely that one would experiance a seziure while taking pain medications, possibly the same is true when a situation is first presented in childhood where the child feels like they have no control and no information to resolve an incoming threat -- especially a painful one.When we perceive a significant threat to us, then our bodies get ready either for a fight to the death or a desperate flight from certain defeat by a clearly superior adversary.Endorphins, which are the body's natural pain killers, are released (when you are fighting, you do not want be bothered with pain–-that can be put off until later.)Physical changesFight or flight effects include:•Our senses sharpening. Pupils dilate (open out) so we can see more clearly, even in darkness. Our hairs stand on end, making us more sensitive to our environment (and also making us appear larger, hopefully intimidating our opponent).•The cardio-vascular system leaping into action, with the heart pump rate going from one up to five gallons per minutes and our arteries constricting to maximize pressure around the system whilst the veins open out to ease return of blood to the heart.•The respiratory system joining in as the lungs, throat and nostrils open up and breathing speeding up to get more air in the system so the increased blood flow can be re-oxygenated. The blood carries oxygen to the muscles, allowing them to work harder. Deeper breathing also helps us to scream more loudly!•Fat from fatty cells and glucose from the liver being metabolized to create instant energy.•Blood vessels to the kidney and digestive system being constricted, effectively shutting down systems that are not essential. A part of this effect is reduction of saliva in the mouth. The bowels and bladder may also open out to reduce the need for other internal actions (this might also dissuade our attackers!).•Blood vessels to the skin being constricted reducing any potential blood loss. Sweat glands also open, providing an external cooling liquid to our over-worked system. (this makes the skin look pale and clammy).•Endorphins, which are the body's natural pain killers, are released (when you are fighting, you do not want be bothered with pain–-that can be put off until later.)•The natural judgment system is also turned down and more primitive responses take over–this is a time for action rather than deep thought.Might be a starting point to research anyway, hope it helps : )",
            "post_id": "12285200",
            "timestamp": "1427759018",
            "user_id": "user_12913502",
            "user_link": "/personal_pages/user/12913502",
            "votes": "0"
        },
        {
            "answer": "I also have a seizure following severe cramping in the calf muscle. Not very nice.",
            "post_id": "12876625",
            "timestamp": "1435504107",
            "user_id": "user_14616512",
            "user_link": "/personal_pages/user/14616512",
            "votes": "0"
        },
        {
            "answer": "I get the same thing .. I'm tired of telling my doctors about my seizures induced by severe pain... I'm 39 and still having them and all Dr's keep saying that is not true that pain does not cause pain... heck is my body going thru it how would u know.. I want my life back is all I know... and here I thought I was the only one .. hopefully they can now see all of our comments and maybe do research and finally help us out...",
            "post_id": "12977515",
            "timestamp": "1437167130",
            "user_id": "user_14892200",
            "user_link": "/personal_pages/user/14892200",
            "votes": "0"
        },
        {
            "answer": "(Almost 21) I have been subject to a couple seizures here and there over the past several years. Not sure how many, when I was 7 my skull got busted open by a very large rock and I had to get stitches (only remember the bee sting, and turning to my dad before it hit me the entire rest of summer is a blacked out block. I have bad memory as well no matter what I do. Including before childhood memories have started inching ever slowly back.) recently I've had three seizures and have had back pain all my life that when I was 15/16 only got worse when I got into it with someone about three of me together. And at 19 I got busted up in the head pretty good.and had one around then.  Anyway after my seizures I feel numbness and tingling and I shake everywhere slightly, sometimes it's jerks, long before I even go into a seizure it's like my body knows it's happening and doesn't want to do anything to make it worse so it stays seated for as long as possible and then I get up and move to be comfortable when I know I need to get comfy. I lose consciousness, get worse pain in all my joints, sustain a slowly worsening irrational heart beat from beginning to long after its stopped, I can't remember anything I blank out and stare at nothing when my body starts getting ready I guess? And some other things a bit worse; my dad has seizures for a couple years now and idk if that's in the family. Mental illness is and addiction and other things. But should I take the medicine I found ( lost it about week or so ago) if it's been about a week or so without me taking it and it's the first I've had since being prescribed. Only half-3/4 of the 1 month supply is gone. (***hospital prescibed after I had my back to back seizures about a half a month ago or a bit more.***) it's Levetiracetam 500 mg tablets and they make me tired weak and dizzy, but they work I suppose? Not sure why I had this seizure last night but just curious on the input.Sorry my mind speaks a little differently to me than some so if my comment confused any I'll rewrite it when I can word like everyone else.",
            "post_id": "13127238",
            "timestamp": "1439842277",
            "user_id": "user_15322042",
            "user_link": "/personal_pages/user/15322042",
            "votes": "0"
        },
        {
            "answer": "I also couldn't remember whether I had taken the seizure medicine or not if whether I took it as soon as I got up or if I forgot to do it then and did it later or completely forgot about taking it at all.",
            "post_id": "13127263",
            "timestamp": "1439842574",
            "user_id": "user_15322042",
            "user_link": "/personal_pages/user/15322042",
            "votes": "0"
        },
        {
            "answer": "Wonderful! I'm not alone!!!!! I have seizure from pain as well!  I broke my back in a car accident and had such a bad seizure that I bit through my tongue and crushed a tooth, But they told me I didn't have one. I can't get any medication for it because I have pain that comes hand and hand with it and remember it. One doctor said it was a brain event. WTF??? I need help and I'm not getting it.",
            "post_id": "13533719",
            "timestamp": "1449953421",
            "user_id": "user_16639828",
            "user_link": "/personal_pages/user/16639828",
            "votes": "1"
        },
        {
            "answer": "Diagnosed with epileptic seizures had been on pain meds many years. Dr. Took me off of them. Without pain meds my seizures are way worse. Does this make sense?",
            "post_id": "13778838",
            "timestamp": "1460265564",
            "user_id": "user_17803172",
            "user_link": "/personal_pages/user/17803172",
            "votes": "1"
        }
    ],
    "post_id": "2469060",
    "question": "Please be patient while I explain my circumstances. I was born premature and they stuck me in an incubator and put a needle in my head.  I still have the scar but it did not show up on the MRI.  When I was a year old, at a department store, I hurt my finger and had a grand mal seizure.  My mother took me to the pediatrician who yelled at her for letting me hurt myself.  After that, every time I would have an injury, I would have a grand mal seizure.  Examples, when I got bit by a dog, when I fell down a flight of stairs, when I get a really bad charlie horse in my leg.  They thought that I would grow out of it but I'm 31 and I've had 52 grand mal seizures.  In July, I had one when my back popped out in my family doctor's office (I had gone because my back had already started to hurt, then I sneezed and I heard it pop, and then it became extremely painful.)  When this happened, I had a GM right in front of my doctor.  He asked me to see a neurologist as well as a cardiologist because I have a strange heart beat as well.  The cardiologist did an EKG, a stress test and an echocardiogram.  While on the treadmill, my pulse was up to 200 after 6 minutes and they made me get off.  A week later they called and said that everything looked fine.  I decided not to see a neurologist at the time because having seizures when I hurt myself was something that I've always done and they just said that it was my body's response to pain.  Then, in November, I had a seizure out of the blue with no injury to provoke it.  My husband witnessed it.  I remembered feeling extremely dizzy (like always), and it kind of seems like the lights get a bit brighter. I layed on the floor and he said that my eyes rolled back in my head.  Then I started convulsing and a few minutes later when I woke up my pupils were fully dilated and I had urinated.  I was not awake for any of this, for this is just my husband telling me what happened.  Nor was I awake at the doctor's office, for he described the same exact thing but of course, I was unaware of what happened after the dizziness.  Because I had never had one without pain causing it, I went to the ER.  They did a cat scan which turned out normal and referred me to a neurologist who in turn referred me to an epileptologist.  The epileptologist did an EEG and an MRI.  All came back normal except he said that there is something rhythmically wrong with my heart and that I need to have more tests done.  My heart rate kept bouncing between 60 and 110 as I was laying there for about 30 minutes during the EEG.  But my epileptologist said that pain is not a trigger for seizures and that he does not want to set me up for seizure monitoring since I only have seizures 3-4 times a year on average.  He does not want to completely diagnose me with epilepsy because nothing showed up on the tests.  He did up my dose of Lamictal and told me that I cannot drive for a year or take baths alone.  He wants me to go back to the cardiologist for more tests.  Am I the only one out there with pain causing seizures?  Thank you for any patience and expertise in this area.  I feel as if I'm the strangest human being on earth. It seems as if everyone else just yells or says \"ouch\" when they hurt themselves.  What I wouldn't give for an \"ouch\" instead of a seizure.  Thanks again.",
    "timestamp": "1202218431",
    "title": "pain causing seizures",
    "user_id": "user_410140",
    "user_link": "/personal_pages/user/410140"
}