{
    "answers": [
        {
            "answer": "At this point a blood test and/or sonogram would be the only things to give you a definitive answer.",
            "post_id": "4745105",
            "timestamp": "1249706476",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "so do u think i possibly could be even though ive had irregular periods in the past and ive had 3 negative HPTS, and at the hospital.?",
            "post_id": "4745113",
            "timestamp": "1249706990",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "If your having unprotected sex there is always a possiblity that you are pregnant.",
            "post_id": "4747141",
            "timestamp": "1249772428",
            "user_id": "user_935252",
            "user_link": "/personal_pages/user/935252",
            "votes": "0"
        },
        {
            "answer": "Its possible, but most women would show positive on a urine test by now. I would make an appointment with your GYN so that they can to a blood test and u/s (as Joy suggested) to make sure, and if not you can find out whats going on with your periods.",
            "post_id": "4747540",
            "timestamp": "1249784877",
            "user_id": "user_949288",
            "user_link": "/personal_pages/user/949288",
            "votes": "0"
        },
        {
            "answer": "Oh wow! I just read that you are 15 and you want to be a mommy? Hunny, don't take this the wrong way, but PLEASE wait! Don't be in such a hurry to grow up! I had my first child at 16 and trust me it is NOT easy... on you or the baby. There is so much that you both will miss out on. If you are sexually active you should really see your Dr, get put on b/c and use protection to prevent STD's. There is plenty of time to become a mommy later. Enjoy being young now...I really don't mean to offend you, just trying to share with you some of the things that I wish someone would have shared with me. I love my DD to death, but there is so much I missed and wasnt able to give her that I would have been if I would have been older.",
            "post_id": "4747549",
            "timestamp": "1249785081",
            "user_id": "user_949288",
            "user_link": "/personal_pages/user/949288",
            "votes": "0"
        },
        {
            "answer": "yeah thank you i know im young my mom had me when she was my age but i just love kids so much, and ive been taking care of them my whole life and i love them to death. im really mature for my age. and sometimes i dont even think i can have kids cause of my irregular periods. its hard.",
            "post_id": "4749575",
            "timestamp": "1249851363",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "You do sound very mature but it's alot different having your own child compared to looking after them. Atleast when you look after them you can always give them back, if its your child you have them 24/7 and it's hard work.Think through this very seriously.",
            "post_id": "4749661",
            "timestamp": "1249853992",
            "user_id": "user_691102",
            "user_link": "/personal_pages/user/691102",
            "votes": "0"
        },
        {
            "answer": "yeah i know its not easy, but i raised my little sister, i got up with her in the middle of the nights, changed her diapers, gave her medicine, fed her, and all of it. cause my mom was in no position to take cre of an infant.",
            "post_id": "4750430",
            "timestamp": "1249872008",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "I think you need to do a bit more growing up before you try for a baby.  i was the same at your age my parents told me i was a 15year old in a 21year old's body, i was older than i looked and acted older.  I love kids myself and have been trying for a while now i'm 24years old.  I was lucky i never fell pregnant at your age, take a good look at the life ahead of you what can you offer a child at your age.You have no job, no qualifications as your still at school, no house or money and theres no point in living off benefits if you want to give your child the best start in life, having a partner who wants to be with you and the baby also, someone who want's to spend the rest of their life with you and not just for a quick ****I hope this message sinks in as you will live to regret this later in life if you do fall pregnant",
            "post_id": "4750872",
            "timestamp": "1249889347",
            "user_id": "user_505857",
            "user_link": "/personal_pages/user/505857",
            "votes": "0"
        },
        {
            "answer": "I was 35 when I had my son (only child)....we planned for it, were prepared financially and thought that we were emotionally prepared......Many young people are fit to be parents....but speaking for myself being older and having a baby....I don't see as though there is any way to be 100% prepared for the amount of time and energy that it takes to care for a baby.  I'm an RN, my husband a Land Surveyor...we are financially OK and sometimes I still stress about money.....You seem like a smart person....you know how to prevent a pregnancy......There's no need to live off the system if it can be prevented.....Regardless of what happens, good luck....",
            "post_id": "4750977",
            "timestamp": "1249895805",
            "user_id": "user_354373",
            "user_link": "/personal_pages/user/354373",
            "votes": "0"
        },
        {
            "answer": "okay i really dont want any more lectures. i know it wont be easy. an i appreciate ur concerns. but i probly wont be able ta get preg. anyway",
            "post_id": "4762048",
            "timestamp": "1250121404",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "Taking care of an infant is more than changing a diaper and giving a bottle. Your mom bought those diapers and medicine. To have a baby at fifteen would mean trying to finish school with an infant, having to provide all their clothing, medications, diapers and wipes, etc.I've raised babies as a child myself. But that didn't mean I was ready to be a mom at 15. Good luck to you!",
            "post_id": "4762075",
            "timestamp": "1250121788",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "thanx, but money isnt an isue n i have one more year of school. i know it wont be easy but its worth it to me.",
            "post_id": "4762100",
            "timestamp": "1250122406",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "I don't understand? How can money not be an issue? Who is going to pay for diapers and formula and co-pays at Dr. Appts, and a stroller, crib, playpen, swing, carseat, toys, etc...Make sure you think about the baby too... is it really fair to purposely bring a baby into a home where you aren't able to financially support it?I know you don't want lectures but these are things you should really think about when your thinking about trying to get pregnant. And what about your school? Who will watch the baby? Or are you going to drop out? Then what? Are you planning on working? have you taken in account the cost of daycare? and if not where will the money come from then? Are you just going to stay living at home with your mother? Do you really want that? Do you want that for your baby?",
            "post_id": "4762127",
            "timestamp": "1250122861",
            "user_id": "user_949288",
            "user_link": "/personal_pages/user/949288",
            "votes": "0"
        },
        {
            "answer": "no my baby would have a good life, and i have money saved up, and im still saving where i get money every month. plus i already have someone to watch the baby while im in school, and yes its my mom. but only until im out of school. and i already have a place to live when im out of school.",
            "post_id": "4762155",
            "timestamp": "1250123137",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "in my opinion your mad if you think you can do it take it from me i feel pregnant at your age and i had my son i left school with no grades i had to live on benefits (welfare for some people) i had to move out of my parents because we were overcrowded i raised my son on my own yes my mum and dad helped alot but i done most of it on my own and im telling you looking after your sister is nothing compared to looking after your own i lost all my friends i couldnt go out like any normal teenager i love my son sooo much but if i could turn back the clock and use protection i would have i dont know what its like to be a teenager because from the age of 16 i was a mummy. And for your to say money is not an issue believe me it is you have no idea how much a baby costs.just be careful about wanting a baby its not all cute clothes and baby toystake care",
            "post_id": "4762210",
            "timestamp": "1250123998",
            "user_id": "user_464067",
            "user_link": "/personal_pages/user/464067",
            "votes": "0"
        },
        {
            "answer": "To each her own- we only speak up because we care. Not because we want to berate you. Whatever choices you make in life are the choices you have to live with for the rest of your life. Just remember that a baby isn't going to make your life any better or any easier. And if it is unconditional love you are looking for, there is plenty of time to wait for a baby when you're married, settled, have a house, have a job/career/education.I just don't get why teens today think having a baby is \"cool\" or the right thing to do. You want freedom, you want to make your own choices... but you also want to put another human being into the mix. Be mindful that you should want to provide the best for them. Not want them right now, right this minute, when you're still a child yourself.And a 15-yr-old's body is not meant to handle pregnancy just yet. Be kind to yourself and remember that it's not just your own life you could be potentially messing up. It could be your baby's life as well.",
            "post_id": "4762259",
            "timestamp": "1250124753",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "wow girl, so i'm kind of going through the same thing. i have all the symptoms and i was just sure i was pregnant but the hpt came out negative so idk. it could be stress causing all the issues. i'm starting to think that's what's going on with me. i'm not ragging on you like everyone else, but if you're NOT pregnant i would def wait to TRY to have a kid because it is a lot of work and money. i raised my nephew for the first year of his life and even with WIC they cost a lot. but if everyone stops raggin on you(even though they do have some good points) and give you some helpful comments let me know since i'm kinda on the same boat.",
            "post_id": "4762289",
            "timestamp": "1250125266",
            "user_id": "user_1002585",
            "user_link": "/personal_pages/user/1002585",
            "votes": "0"
        },
        {
            "answer": "tuggletee- we're all mothers and we know how difficult it is to raise a baby. We're not \"ragging\" on anyway. Just providing some insight, though I know how much teenagers like to listen to reason. ;-)",
            "post_id": "4762313",
            "timestamp": "1250125733",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "JoyRenee- insight, ragging, it sounds the same to me. but i am just another one of those teenagers(18) who \"likes to listen to reason\". i understand you all are mothers. i got the point of that since you all mentioned it(sorry, teenage sarcasm). but please notice that i obviously DO listen to reason because i did say she should wait and told her that everyone has some good points =). and by the way not ALL teens think it's cool and the thing to do to have a baby. not trying to argue, just stating that.",
            "post_id": "4762511",
            "timestamp": "1250129766",
            "user_id": "user_1002585",
            "user_link": "/personal_pages/user/1002585",
            "votes": "0"
        },
        {
            "answer": "by the way, i want to mention again that i wasn't trying to be rude. i know i kind of sounded that way. i think my hormones are going crazy haha.",
            "post_id": "4762645",
            "timestamp": "1250133159",
            "user_id": "user_1002585",
            "user_link": "/personal_pages/user/1002585",
            "votes": "0"
        },
        {
            "answer": "Okay, I guess we are have this alarm that goes off when we see a teen who says they want to have a baby. And in some countrys its normal. But not in ares. Its sad to see a young person put such a hold on there life. And in some ways in selfish. But we are here to help her. And in no way do we want to judge you. So please don't get affended by are thoughts or opinions.  But some of us have had children at a young age, and it has put such a strain on are lives. Some come out of it and go on to make a great life for themself. But other end up not being able to. And I dont want that to happen to anyone. I only had my child at 18. Its been a long ten years. And like you. Yes I had money. My daughter had everything she wanted. She never went without. But it but off alot of my youth. I couldent go out or have a drink for my 21st birthday. I had ot stay home. It sucked. I had to put off school because I didnt trust any day cares. And none of my friends had time to watch my daughter.  So like just changes when you have a child. And I think that is what everyone here is trying to tell you. But I am not going to judge you. Its ur life, and you do what you want. But just take a moment and think a little more and be sure you can provide for this child on all aspects.",
            "post_id": "4763104",
            "timestamp": "1250146124",
            "user_id": "user_972246",
            "user_link": "/personal_pages/user/972246",
            "votes": "0"
        },
        {
            "answer": "thank you, i understand. i guess i just want to know for sure that i CAN actually have children because sometimes i feel like i cant. cause it hasnt happend yet ya knw?",
            "post_id": "4765599",
            "timestamp": "1250196620",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "as I think Joy, and others have said,Your body might just not be READY To have a baby, or be physically capable of actually carrying a pregnancy.  You really, REALLY need to speak to an OBGYN about all of this to find out the real risks of getting pregnant at such a young age, because other than the social and mental aspects of it, there can be SERIOUS Physical complications and issues. since your 15 and not done growing, your hips might not be wide enough for you to carry a baby full term and give birth as you should, that might mean a Csection or even more serious risks for the baby.As I mentioned before, the younger the woman, the higher the risks for Preterm birth, Miscarriage, Preeclampsia/eclampsia that can lead to stroke/death and other risks, but a Doctor would be the best person to go through to find out.Before you actually continue trying, I would suggest you make sure to get a checkup and find out your risks. I'm sure you'd rather make sure your healthy and strong and developed enough to carry a child, than to deal with complications later on.",
            "post_id": "4765818",
            "timestamp": "1250199782",
            "user_id": "user_363110",
            "user_link": "/personal_pages/user/363110",
            "votes": "0"
        },
        {
            "answer": "Yeah your right but i dont know . i wish people would just answer my quetion i posted and stop telling me im too young and bla bla bla. i know all this. i just want my ques. answered, or experiences, or advice. ya know?",
            "post_id": "4766428",
            "timestamp": "1250212029",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "I would love to answer your question... Just go and have a blood test done and that will put all of your worries to rest.",
            "post_id": "4766825",
            "timestamp": "1250218545",
            "user_id": "user_796506",
            "user_link": "/personal_pages/user/796506",
            "votes": "0"
        },
        {
            "answer": "thank you so much!",
            "post_id": "4769220",
            "timestamp": "1250279231",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "Well let me answer your question. yes you can become pregnant and you may be pregnant. I have a question for you? Why dont you get advice from your mother I am sure she has all the answers for you. I am 24 and I am married and have a 2 year old.Almost all my friends are still not married and dont have any kids. Dont get me wrong I love my life but I wish that I waited to get married and have kids. This is my current life.Work-Home-Work-Home every day is the same. I asked my mom several times if she could watch my son while I go out with my husband and you know what she told me?I waited until i finished raising you guys efore I went anywhere. Dont get me wrong Yes kids are great but wait you will have enaugh time and honey if you want this child to keep your bf will not work trust me on that.Please dont get this wrong but wait you have nothing to loose :)",
            "post_id": "4769447",
            "timestamp": "1250283215",
            "user_id": "user_1003670",
            "user_link": "/personal_pages/user/1003670",
            "votes": "0"
        },
        {
            "answer": "thanks. but do u think i am? n i have talked to my GRanny she has custody of me. oh and no its nt to keep my boyfriend. he never argues with me oe anything he treats me so good. and i dont need a baby to keep him. ....",
            "post_id": "4769507",
            "timestamp": "1250284787",
            "user_id": "user_992329",
            "user_link": "/personal_pages/user/992329",
            "votes": "0"
        },
        {
            "answer": "Only a test will tell honey. Just break down and buy one and take it with your first morning urine after your period is due.",
            "post_id": "4770270",
            "timestamp": "1250301622",
            "user_id": "user_796506",
            "user_link": "/personal_pages/user/796506",
            "votes": "0"
        },
        {
            "answer": "Don't know what to tell you. They all kind off nice girl when you are young and free. But when they get responsibility (a baby) they intend to run especially at that age.Life seems perfect right now and don't spoil it for yourself or for your bf. Enjoy life everything will come at the right time. I wasn't your age long ago so I know what it means to be a teen or a young women. I am not judging you nor am I here to judge you I am just asking you and I even don't know you to think it thru. At age 22 I was diagnosed with HPT.(A Sexual Transmitted disease) and I even didn't sleep around my Husband was my first. Guys will tell you anything you wanna hear but what they did before you and maybe while they are with you that is a different story. I was lucky it was caught on time and I am fine. As for my husband by all means I am not mad at him at all because he is a guy and guy unfortunately intend to sleep around. Be careful because diseases can kill you!!!!Best of luck and I hope all your plans are well planned out!!!!Tina",
            "post_id": "4770350",
            "timestamp": "1250303051",
            "user_id": "user_1003670",
            "user_link": "/personal_pages/user/1003670",
            "votes": "0"
        }
    ],
    "post_id": "4745086",
    "question": "okay so me and my boyfriend have had unprtected sex lotssss of times.and i think i am pregnant. my instincts tell me i am. i feel different and ive been realy tired, naesous, dizzy, headaches, pee constantly and its darker than normal. my boobs are really sore, but ive taken 3 HPT'S all negative. although one turned positive after about an hour. ive went to the hopstial they did a urine test, also negative, but still i feel that i am. i dont know. im over 2 months late for my period. although ive experienced irregular periods but for the past 5 months its been reg. (february,march,april,may,june) my last one was june 1st. and ended on the 8th. PLEASE HELP. ant comments are helpful. thanks.",
    "timestamp": "1249705918",
    "title": "PG OR WAT? HELP!",
    "user_id": "user_992329",
    "user_link": "/personal_pages/user/992329"
}