{
    "answers": [
        {
            "answer": "You would probably need the opinion of a perinatologist associated with a large academic medical center.  I don't think you are going to find a lot of research in this area, nor will you find a lot of women who have had the experience you are seeking to hear about.  Perhaps with enough new testing, they may be able to give you more reassurance.You'll have to weigh the risks and benefits for yourself, and hope for the best.  Get several opinions from doctors associated with large academic centers and have a long talk with your husband about whether you two are willing to take the risk.",
            "post_id": "57788",
            "timestamp": "1146114000",
            "user_id": "user_112241",
            "user_link": "/personal_pages/user/112241",
            "votes": "0"
        },
        {
            "answer": "My doctors are the best....Johns Hopkins.  I am looking for anyone that has personal experience.",
            "post_id": "57789",
            "timestamp": "1146114000",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "what test did you get to diagnose your stroke? CT or MRI....Sorry just curious.",
            "post_id": "57829",
            "timestamp": "1149224400",
            "user_id": "user_126610",
            "user_link": "/personal_pages/user/126610",
            "votes": "0"
        },
        {
            "answer": "I am 32, had a stroke, almost 3 years ago when I was 30 an ischemic stroke right hemishere do to narrow carotid arteries, birth defect.  I have some left side weakness but It is minimal.  I have an eleven week old little girl.  The pregancy was normal until I was almost full term 36weeks 5days then I had a focal seizure. Still running test to see if it was preeclampsia or from the stroke.  I had her vaginally and she is healthy and normal.When I asked my neurologist if I would be able to have children after my stroke he told me to let my body heal and rehab for a couple of years.  I knew it was a big risk but I prayed everyday god just let me make it thru today. She is my little miracle.  I'm not going to push my body for a second one I thank god for this one.",
            "post_id": "57840",
            "timestamp": "1150174800",
            "user_id": "user_142302",
            "user_link": "/personal_pages/user/142302",
            "votes": "0"
        },
        {
            "answer": "I am 34 and had a stroke during my 25th week of my pregnancy. I had AVMs. I had my first stroke at 25 also by an AVM. I was told by my neurosurgeon it was ok to get pregnant but I don't think any human can predict if its safe to have children if you had a previous stroke.  Now the doctors say its up to me if I want to try again.  They just don't know.  I am in the same boat wanting to know if their are others out their that had an ok pregnancy after a stroke.  I want my child to have a sibling but thoughts of the tough time I had being pregnant and having a stroke makes me also consider a surrogate for my next child.",
            "post_id": "57843",
            "timestamp": "1150606800",
            "user_id": "user_143107",
            "user_link": "/personal_pages/user/143107",
            "votes": "0"
        },
        {
            "answer": "I really appreciate all of those that commented. It is a very difficult situation to be in...and don't know what to do!  Those of you pregnant...how's the pregnancy going?",
            "post_id": "57846",
            "timestamp": "1150866000",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "I had a stroke from a Left Carotid Dissection when I was 29 too.  I also went to JHU High Risk.  My doctor was Dr. David Nagey (since deceased -- he was the best).  I kept asking him the risk when I got pregnant the next year and he kept telling me \"after you we'll have one case!\".  I carried my son to 38 weeks with a few episodes of right sided weakness.  At 38 weeks, we all got a bit nervous with the numbness and induced labor, however they did let me have a normal delivery, despite everyone's hesitation about re-dissection.  My neurologist was/is Dr. Steven Kittner at U of MD.  We wondered about the stress of delivery, we had originally planned on a heavy epidural with a passive second stage, but I decided I wanted to do natural childbirth and I did.  Since then, I've also delivered a baby girl at age 35 with no complications.  Now, 10 years after the dissection and stroke, I'm getting back into running and exercise and trying to find a doc who will give me a straight answer about the risks/wisdom of long distance running and lifting weights (not power lifting just normal weights) -- if I've delivered two 10 lb babies vaginally without medication haven't I stress tested my brain already?",
            "post_id": "57931",
            "timestamp": "1152594000",
            "user_id": "user_146878",
            "user_link": "/personal_pages/user/146878",
            "votes": "0"
        },
        {
            "answer": "not sure how to get email without doing it over this forum...I'm really curious to talk with you....It's been really difficult.",
            "post_id": "57910",
            "timestamp": "1152680400",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for writing.  How interesting....I know who Dr. Kittner is...he did a stroke study on young women and I am one of them.  My neurologist is the best...Dr. Wityk at Hopkins and people travel all over the country to see him.  I would like to speak with you more at length regarding this if possible.",
            "post_id": "57906",
            "timestamp": "1152680400",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "You can reach me off-line -- how do we do that -- I'd like to learn more about your neurologist.  I'm kind of in-between now.  I developed migraines after the stroke so went down to Georgetown to see a migraine specialist down there, but she's moving to Texas - Dr. Kittner is a great doctor, but he's more of a stroke guy vs. migraine & stroke.  I'm just curious about your doctor.  I'm happy to share more info about my pregnancies.  After Dr. Nagey died, my second pregnancy was actually at University of Maryland with Dr. Hugh Mighty, their Directory of OB-Gyn (High Risk) and their mid-wife team working together.  That was kind of fun, but I preferred Hopkins over-all.",
            "post_id": "57909",
            "timestamp": "1152680400",
            "user_id": "user_146878",
            "user_link": "/personal_pages/user/146878",
            "votes": "0"
        },
        {
            "answer": "My Email is renata.***@**** you can email me there...",
            "post_id": "57911",
            "timestamp": "1152766800",
            "user_id": "user_146878",
            "user_link": "/personal_pages/user/146878",
            "votes": "0"
        },
        {
            "answer": "i had a stroke at 29 yrs. i had a left dissection cartotid artery. right now i'm 31 yrs. i want a baby but my right arm and hand isn't working. i can bend my elbow right now. do you have a full movement in your right hand and arm. i worried about taking care of a baby. can you please give me some advice?",
            "post_id": "1861490",
            "timestamp": "1189051362",
            "user_id": "user_270048",
            "user_link": "/personal_pages/user/270048",
            "votes": "0"
        },
        {
            "answer": "I had an Ischemic stroke last year affecting my left side. I was an avid tennis player prior to my stroke.  I am now playing a limited form of tennis. And I am very curious as to what the steps were for you to get to the point of running. I am very happy to see that his has been accomplished by a stroke survivor.",
            "post_id": "1861634",
            "timestamp": "1189055211",
            "user_id": "user_270086",
            "user_link": "/personal_pages/user/270086",
            "votes": "0"
        },
        {
            "answer": "I had a major stroke at age 8 (almost 9).  It's not something  I talk about w/ my family a lot, and I certainly didn't understand it at the time.  Neither did my doctors, couldn't figure out what happened.  It was my right cerebral artery I believe that clogged up, resulting in left side paralysis.  Now I'm 20 with a slight limp and weakness of that side.  I'm getting married soon and will be thinking about having children in the next few years.  Honestly I never thought about having problems with pregnancy or childbirth until recently.  My mom mentioned that I might have problems, but she didn't know much about it. Can anyone give me some advice and/or links to information about risks and what to expect?",
            "post_id": "1917922",
            "timestamp": "1190678439",
            "user_id": "user_284367",
            "user_link": "/personal_pages/user/284367",
            "votes": "0"
        },
        {
            "answer": "Is your artery occluded?  I had a stroke a month ago with no resulting deficits .  I dissected my right carotid after over exertion while I ran a race.  My artery is 100% occluded and I have been told that I cannot run again and cannot have more children because your blood clots during pregnancy.  I'm amazed that you are running and were able to have more kids.  Do you work up slowly?  Do you know why you dissected your artery?",
            "post_id": "2248833",
            "timestamp": "1198015965",
            "user_id": "user_365400",
            "user_link": "/personal_pages/user/365400",
            "votes": "0"
        },
        {
            "answer": "both of my carotid arteries are occluded!  I was told that I would have to take lovenox shots 2 times a day throughout my whole pregnancy and 6 weeks later.  you should see a high risk doctor.",
            "post_id": "2253963",
            "timestamp": "1198105586",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "Thanks!  I'm still amazed.  But as my stroke was recent, I haven't even gotten that far to talk to an OB.  I've been told no more kids from the neuros at the hospital.  Did you find out why you had a stroke?  Did you have a problem with your arteries?  That's amazing that you had both occluded.  I'm still in the workup process.  I am so happy I found this website because I thought I was the only one out there with a stroke at 35.  Now I see that this happens to a lot to young women and that life can get back to normal even if it's a new normal.",
            "post_id": "2256269",
            "timestamp": "1198156815",
            "user_id": "user_365400",
            "user_link": "/personal_pages/user/365400",
            "votes": "0"
        },
        {
            "answer": "My stroke happened at 29!  What kind of stroke did you have?  where are your neurologists?  Are you back to \"normal?\"",
            "post_id": "2266847",
            "timestamp": "1198367602",
            "user_id": "user_73028",
            "user_link": "/personal_pages/user/73028",
            "votes": "0"
        },
        {
            "answer": "I had a stroke after dissecting my right carotid.  I ran a 5k race earlier in the day and the doc feels that the overexertion during the race dissected my artery.  I had no obvious problems with my arteries (cholesteral or genetic malformations) so that is what he thinks happened -  am in the process  of hematology workups.  I was very fortunate that my husband caught my stroke in time  and I was eligible for the MERCI retriever.  I was so lucky that I did not need OT, PT and speech.  My stroke doc is at Sentara Norfolk General in SE Virginia and obviously he knows what he is doing.  My neuro also is associated with that hospital.  As far as being back to normal - I'm pretty darn close.  i have problems with my concentration and energy level.  My husband and I were trying for baby #3 when this all happened.  I feel right now I should be grateful for the two babies that I have and thankful for my recovery.  I'm scared to chance it and try to have another one unless I know why I had a stroke to begin with.  Have you been successful with your pregnancy?",
            "post_id": "2273132",
            "timestamp": "1198543501",
            "user_id": "user_365400",
            "user_link": "/personal_pages/user/365400",
            "votes": "0"
        },
        {
            "answer": "I had a stroke when I was 28 eight months after my first child.  It was believed by my neuro. doctor that it was migraine or birthcontrol related.  A year and half later I am pregnant about 4 weeks with my second.  This was a complete surprise and I am really nervous about it.  My OB says that I should be ok and so far everything has been. It is comforting to see some of having babies after a stroke.  I have felt all alone sometimes going through this.",
            "post_id": "2565323",
            "timestamp": "1204060457",
            "user_id": "user_432657",
            "user_link": "/personal_pages/user/432657",
            "votes": "0"
        },
        {
            "answer": "I had a stroke when I was 28, 8 months after the birth of my first child.  My neuro doctor says that it was a stroke from migraine/ birthcontrol.  A year and later I am pregnant with my 2nd child.  Totally surprised and not ready to be honest.  But God is in control.  It has been comforting to see and read others of you having children (healthy at that) after a stroke.  I have felt alone sometimes going through this.  Thanks for your stories and advice.",
            "post_id": "2565350",
            "timestamp": "1204060717",
            "user_id": "user_432657",
            "user_link": "/personal_pages/user/432657",
            "votes": "0"
        },
        {
            "answer": "I had a stroke when I was 28, 8 months after the birth of my first child.  My neuro doctor says that it was a stroke from migraine/ birthcontrol.  A year and later I am pregnant with my 2nd child.  Totally surprised and not ready to be honest.  But God is in control.  It has been comforting to see and read others of you having children (healthy at that) after a stroke.  I have felt alone sometimes going through this.  Thanks for your stories and advice.",
            "post_id": "2565351",
            "timestamp": "1204060721",
            "user_id": "user_432657",
            "user_link": "/personal_pages/user/432657",
            "votes": "0"
        },
        {
            "answer": "Hey just wondering how the pregnancy went?",
            "post_id": "4451352",
            "timestamp": "1242079850",
            "user_id": "user_900501",
            "user_link": "/personal_pages/user/900501",
            "votes": "0"
        },
        {
            "answer": "I had an ischemic stroke at 28 years old 3 days after giving birth to a 9 1/2 lb baby. My gyno actually made me feel more at ease about all of it than the hemotoligist or nuerologist. No one could tell me why I had. I had no complications theroughout my pregnancy or delivery. They both told me that it was not pregnancy related but not to have anymore children. I miscarried 3 times (before each one of my live births). I have never been able to get any straight answers about any of it. I have physically recovered from it except that I have shaking episodes on my right side still at times and my mind is not the same. My memory is horrible now and I sometimes can know what I want to say but sometimes I just can't find the right words. I have a bit of weakness on my right side also but not major enough for most people to notice. I also talk really fast alot of times but don't realize it (people sometimes look at me funny) I am now 33 and pregnant (surprise!!). I am scared to death but I also feel like God would not have given me this gift if I wasn't supposed to have it. It is a little more comforting to see that I am not the only one out there but I am frustrated and feel very dumb about it all and haven't been able to find any answers.jaime_76",
            "post_id": "4742846",
            "timestamp": "1249658708",
            "user_id": "user_996314",
            "user_link": "/personal_pages/user/996314",
            "votes": "0"
        },
        {
            "answer": "have any of these people been checked for having a pfo? i had strokes at 30. now at 41 I've been trying to get pregnant and my many doctors discovered a pfo they all believe related to the prior strokes. all say i can go no further without more testing, possibly corrective surgery. maybe it's worth looking further into these cases, i have been waiting 10+ years for answers. only now has there really been a major interest. also always seek second an third opinions.",
            "post_id": "5134652",
            "timestamp": "1259721204",
            "user_id": "user_1125671",
            "user_link": "/personal_pages/user/1125671",
            "votes": "0"
        },
        {
            "answer": "Hi On 10/3009 i had a stroke from a (avm) at 30 years old i have 2 small children i'm having a hard time dealing with not being the same. i'm ashamed I did great in rehab only b/c i felt i was stronger than others as soon as i got home i felt bad. Outpatient  PTis gonig finr. I have weakness on my left side also lost of field vision i'm scared of everything going back to work will it happen again are just a couple of my fears. I feel lost. i try to live a normal life but can't stop thinking about my problems. i hate i can't type or think like i use too. i feel stupid even though everyone says i'm lucky that i can talk ,walk and my memory is good but i don't feel lucky when everyone else is fine. when my friends are talking about their fabulous life and all i have is a sad story. My doctors and fanily say i'm a miracle i got to the hospital in mins and had very little damage they expect me to fully recover. How can i cope with this at my age?  This weekend i'm throwing my kids a big birhtday party wish me luck it's my first public event. YIu ladies made me feel so much better. I'm starting to feel like a survivor more than a loser. Good luck to all you. you've my new inspiration that there is life after a stroke.",
            "post_id": "5243657",
            "timestamp": "1262892036",
            "user_id": "user_1163019",
            "user_link": "/personal_pages/user/1163019",
            "votes": "0"
        },
        {
            "answer": "Hi there.  I had a stroke when I was 17.  Rendered me C5 quad.  I learned to walk again.  And depending on who you ask - I can run too!  I just look funny.  I have had to adjust my gait as my right leg drags.  When I run I sort of fling my leg around as I do not get the normal heel toe lift that my left leg, ankle and foot are capable of.  I find I can fire the muscles fast but they fatigue quickly.  So really I am only doing sprints.  I cannot run a marathon or anything.  But man it feels good just to get moving.  I played Ultimate Frisbee for several years until last year my back started acting up due to the compensating I was doing in my running style.  I have since had to stop playing and do activities that support more bi-lateral movement.  Ie) Biking.   All I can say is don't give up.  Keep working out so you can get stronger.  Listen to your body.  If you are tired - take a rest.  Practice \"running\" on a treadmill at slow speed to get the hang of it.  And you can hang on to the rails for support.  Also practice running in the pool.  I love doing that.",
            "post_id": "5463399",
            "timestamp": "1268432740",
            "user_id": "user_1243408",
            "user_link": "/personal_pages/user/1243408",
            "votes": "0"
        },
        {
            "answer": "I had a stroke when I was 17.  I am now 37.  8 months pregnant.  All is well but I am scared too.  Doctors do not know what to do with me.   They do not know why I had the stroke.  I was healthy non smoking teen who was very active in sports.  Low blood Pressure.  The two possible causes of my stroke are I was on the Pill, and I suffered some neck strain the day before the stoke.  The legion on my spine went from C5 to T3.  It took me months to learn how to walk again.  I still have some paralysis (Right Hand)  Weak Right leg and torso.I do not know if I am going to have a Natural Birth or a C Section.  Doctors are reluctant to do C section and I am fearful that I may not be able to push.",
            "post_id": "5463421",
            "timestamp": "1268433318",
            "user_id": "user_1243408",
            "user_link": "/personal_pages/user/1243408",
            "votes": "0"
        },
        {
            "answer": "I am 35 years old, and currently on blood thinners for treatment of my dissections but no stroke that happened 1 year ago next week.  I have a 10 year old son that I delivered vaginally, and all was normal.  I have been going to Duke University hospital to a High Risk specialist and they strongly advise me not to get pregnant again.  My OB and Neuro doc feels that I will be ok, it's such a tough decision, I have been tested for lots of genetic things that can contribute to this condition and all is negative so far.  Just doesn't seem to be enough studies done on people that had dissections and then preganancy. Just wondering if there are more of us out there??",
            "post_id": "5463735",
            "timestamp": "1268441792",
            "user_id": "user_1243575",
            "user_link": "/personal_pages/user/1243575",
            "votes": "0"
        },
        {
            "answer": "Hi there I had a SAH in 02 had two children since and am pregnant with my 3rd, I had them naturally so try not to worry to much you will be fine. Jess.xxx",
            "post_id": "5464788",
            "timestamp": "1268479159",
            "user_id": "user_1243965",
            "user_link": "/personal_pages/user/1243965",
            "votes": "0"
        },
        {
            "answer": "i had a stroke at 26 three years after my first child and i'm wanting to have another but is not successful in getting pregnant and i'm 34 now could have having a stroke slim those chances?",
            "post_id": "5676448",
            "timestamp": "1273757602",
            "user_id": "user_1312548",
            "user_link": "/personal_pages/user/1312548",
            "votes": "0"
        },
        {
            "answer": "I have antiphospholipid syndrome which causes your blood to clot too much and puts you at a high risk for miscarriage and stroke during pregnancy.  I believe  because of hormone levels when your pregnant your at an even higher risk than any other time.  Maybe some of you can be checked for this its a simple blood test.  I was told certain blood thinners can be  taken during pregnancy.  Something to research.",
            "post_id": "5676621",
            "timestamp": "1273760922",
            "user_id": "user_147400",
            "user_link": "/personal_pages/user/147400",
            "votes": "0"
        },
        {
            "answer": "I am 35 years old and had a stroke 5 months ago at age 34.  Doctors have determined that my stroke was due to  clotting issues related to complications from pernicious anemia, malnutrition, and a congenital heart defect (PFO) that I have since had repaired.  I have completly recovered and I am now taking supplemental vitamins regularly, eating healthy, and I want to have another baby (already have a 11 y/o and a 2 y/o).  However, I am cautious because my family I already have needs me, but I still feel the urge to have more children.",
            "post_id": "5915070",
            "timestamp": "1279217958",
            "user_id": "user_1381719",
            "user_link": "/personal_pages/user/1381719",
            "votes": "0"
        },
        {
            "answer": "My left carotid artery dissected 14 days after I gave birth to my daughter at 31 weeks(c-section).I was 24 y/o. I had preeclampsia and HELLP syndrome. My left carotid is still occluded.  It has been 3 years and I would love to have another baby but I am very scared.  My doctors all tell me they don't know what to do because they have never seen a case like mine.I was wondering if anybody else has had similar problems and had a \"normal\" pregnancy???",
            "post_id": "6056748",
            "timestamp": "1282506329",
            "user_id": "user_1421843",
            "user_link": "/personal_pages/user/1421843",
            "votes": "0"
        },
        {
            "answer": "I had a stroke due to birth control at 23, and had a surprise pregnancy a year and a half later. I am very lucky all was well with me and my son. I  knew it was risky, and was told I was kookoo by many doctors. I found a doc who would see me eventually. pregnancy after stroke isn't recomended, but you definately CAN get pregnant. I don't plan on having another child. I took lowdose asprin untill I was 6 months along.",
            "post_id": "6068401",
            "timestamp": "1282763536",
            "user_id": "user_1049234",
            "user_link": "/personal_pages/user/1049234",
            "votes": "0"
        },
        {
            "answer": "I am 2 years post dissection with pseudoaneurysm (no stroke--just mini strokes) and no healing. I have 5 year old twins and my husband and I would really like to have another. My symptoms are mostly under control but doctors seem unsure of the risk. I had preclampsia with the twins at 36 weeks and delivered via c-section at 37 weeks. My internal med doc referred me to my gyn but no one is really telling me how high the risk is of injuring the dissection further and/or of continuing the aspirin therapy and beta blockers. I understand no one can say for sure what will happen but I really need a better understanding of the risk so we make the best decision for my health and don't put our potential baby in harms way. Can anyone refer me to any online resources or a type of doctor to consult?Thanks!!Kate",
            "post_id": "6225198",
            "timestamp": "1286504284",
            "user_id": "user_1468581",
            "user_link": "/personal_pages/user/1468581",
            "votes": "0"
        },
        {
            "answer": "I was 25  and 2 weeks along when i had my stroke I am now 28 and wondering about having another child. I have after effects but they're not noticable if you dont know me well. The doctors never did determine what the actual cause of my stroke was. I had a PFO repaired during the the first month of my pregnancy. I was told if I want to have more kids i should be fine but to plan way ahead. I'm from a very small town in Idaho and didn't have the best experience with Doctor's or the nearest University hospital. My family docotor's were baffled by me but very supportive. My Cardiologist, Dr, Soresen from Salt Lake City, UT was the greatest! The University of Utah doctor's I was not impressed with. They kept me there for a week drew my blood every 4 hours, did MRI's and talked to me once a day for 10 minutes they finally sent me home with Lovenox shots 2x a day (I switched to Heparin) with no understanding of the cause at all. Thats when we found Dr. Soresen he found my PFO and repaired it 2 weeks later. I retaught myself to write, read and speak. My pregnancy went well, I went 37 weeks and delivered C-section for fear I could hemmorage. I won't lie I'm very scared of getting pregnant again. I guess I'm looking for reassurance and reccomendations on Doctor's within Utah and Idaho.  Sorry about any grammar or spelling issues, LOL.",
            "post_id": "6564339",
            "timestamp": "1295527666",
            "user_id": "user_1568941",
            "user_link": "/personal_pages/user/1568941",
            "votes": "0"
        },
        {
            "answer": "I had 2 strokes in April last year both in middle of cerebellum overlapping both left and right sided, was left with weakness in left are and right leg. My doctor has advised that I resign myself to not having any children in the future, after reading this though Im encouraged to ask for a 2nd opinion. I live in the Uk and they have no idea why I had a stroke other than that I was on the pill. I still havent seen a neurologist and have now started suffering from migraine.I already have a 5 year old little girl but always wanted more children in future! Reading this has helped thankyou x",
            "post_id": "6633139",
            "timestamp": "1297302307",
            "user_id": "user_1596043",
            "user_link": "/personal_pages/user/1596043",
            "votes": "0"
        },
        {
            "answer": "I too had a stroke, 3 months after my son was born, 3 years ago.  I found out yesterday I was pregnant again!  Yeah!  I went to The Cleveland Clinic where they ran tests, and after seeing a neurologist at home, and a few emergency room visits, oh and a 3 night stay in the hospital for observations, I was told that it \"may\" have been pregnancy related!  lol  MAY!  There are no guarantees in this life, I say go for it!  You never know what is going to happen.  Best of luck to you!",
            "post_id": "6800584",
            "timestamp": "1302059231",
            "user_id": "user_1655450",
            "user_link": "/personal_pages/user/1655450",
            "votes": "0"
        },
        {
            "answer": "I had 2 TIAs when I was 27 years old. Both TIAs happened after my 2nd son was born (about 9 months old) and I was on orthoevra patch. Doctors found out that I have a PFO and due to combination of birth control pills and PFO i developed TIAs. Now it is 7 years later and I would love to have another baby but I am scarred. I am even affraid to have PFO closed? is it risky? is it easy recovery after PFO closure? Were you told you can have another baby after you have PFO closed?",
            "post_id": "7749767",
            "timestamp": "1331175724",
            "user_id": "user_2065728",
            "user_link": "/personal_pages/user/2065728",
            "votes": "0"
        },
        {
            "answer": "I am 28 Years old and Had 3 mini strokes last April. The doctors have done lots of test and could only put my stroke down to my pill. I have low blood pressure, Active and do not smoke so was a big shock. I have nearly full recovered as have had weaknesses down my left arm and with my speech. I am currently receiving councilling due to panic attacks and starting to feel alot better about what has happened.My husband and I are now thinking of starting a family, We do not have any children and the Doctors at the time said pregnancy should be fine but would need monitoring.  I am very scared with getting pregnant, with stopping my tablets and the giving birth. Has anyone else felt these feelings and Is there likely to be more stroke issues during the pregnancy?Thank u x",
            "post_id": "8913050",
            "timestamp": "1362749280",
            "user_id": "user_5042914",
            "user_link": "/personal_pages/user/5042914",
            "votes": "0"
        },
        {
            "answer": "how long after ur stroke could u move agin I had a stroke age 24 an it was only 8mths ago but I still cant move my toes or ankle at all",
            "post_id": "9397109",
            "timestamp": "1376766423",
            "user_id": "user_5923273",
            "user_link": "/personal_pages/user/5923273",
            "votes": "0"
        },
        {
            "answer": "I too had a stroke when I was 25 and I am now 27 and wanting to start a family.I understand completely what you are saying about being scared about getting pregnant and giving birth. My doctors say I should not go for an unplanned pregnancy but otherwise they didn't say I could not have babies...just that I have to be close monitored. For me it was also a big shock since I didn't smoke and I was very active, so the pill might have caused it, but not for sure...i'm getting married in december and a little worried about getting pregnant (although i would love to have children). Claresullivan433 i'll ask my doctors about risks and i'll let you know if i have important info. I'm not american but live in Europe so excuse me for any mistakes.thnks",
            "post_id": "9398677",
            "timestamp": "1376820004",
            "user_id": "user_5925930",
            "user_link": "/personal_pages/user/5925930",
            "votes": "0"
        }
    ],
    "post_id": "57171",
    "question": "I had a stroke when I was 29...2 weeks after I gave birth to my first child.  I had a bilateral carotid dissection.  I am now 33 and am thinking about having another child, but none of my doctors know for sure why I had a stroke in the first place.  Both my ob and neurologist think that I should be fine, but they really have never seen this before.  I keep looking for other opinions....and suggestions?  Anyone out there that had a baby after a stroke?",
    "timestamp": "1145768400",
    "title": "pregnancy after stroke",
    "user_id": "user_73028",
    "user_link": "/personal_pages/user/73028"
}