{
    "answers": [
        {
            "answer": "a blood test can detect a pregnancy as early as 5 days after ovulation. basically because it once you ovulate and the sperm and egg meet it takes about 5 days for the egg to implant itself and that is when the hcg hormone starts being produced.that being said....if you ovulated late it is possible that the blood test could have been wrong it just depends on when you ovulated.  however after 11 years (i'm betting) it is unlikely that your tubes came untied.good luck to you, let us know what you find out.~nanci",
            "post_id": "1118107",
            "timestamp": "1108274400",
            "user_id": "user_65183",
            "user_link": "/personal_pages/user/65183",
            "votes": "0"
        },
        {
            "answer": "thanks I will let you know what i find out.  But I did find an article on the net that said after 10 years your chances of tubes coming untied more than triples the chances of them coming untied within the first 5 years.",
            "post_id": "1118115",
            "timestamp": "1108274400",
            "user_id": "user_85248",
            "user_link": "/personal_pages/user/85248",
            "votes": "0"
        },
        {
            "answer": "Subject: Pregnacy after tubal ligationTopic Area: Pregnancy - AbnormalForum: The Maternal and Child Health ForumQuestion Posted By: Tamm on Sunday, April 25, 1999Posted by Tamm on April 25, 1999 at 14:03:41I had a tubal ligation about 13 months ago..I recently went into see my dr with abnormal symtoms in my cycle ( server cramps, heavy bleeding large clots) He informed me that I was miscarring. I had blood work done that showed a high level of pregestrone, which confirmed his diagnosis. Could you please explain how this happened and if it could happen again?Thank youI found the article that I was looking at earlier on the net.  I copied it and pasted it here. Let me know what you think and I will let u know what I find out. Thank you for your help I realy appriciated it.--------------------------------------------------------------------------------Posted by hfhs.md.rcs on April 26, 1999 at 23:51:24Dear Tamm:Tubal ligation has a known failure rate that is 1-3/1000 women in the first 5 years and 10/1000 women by 10 years.If the portion of the tube attached to the uterus unseals or the ends of the tube grow together, there is a pathway for sperm and egg to meet.Keywords: tubal ligation failureThis information is provided for education purpose and is not a medical consultation. If you have specific questons please speak with your physician.",
            "post_id": "1118117",
            "timestamp": "1108274400",
            "user_id": "user_85248",
            "user_link": "/personal_pages/user/85248",
            "votes": "0"
        },
        {
            "answer": "Hey It is possible!! I know a lady who had her tubes tied her dd was 19 and she was pregnant with another I think she had her tubes tied for 15 years!!My husband had a vasectomy  and I have a 3 month old so nothing is impossible!This time i got my tubes tied and between that and dh vasectomy it better work!!But blood tests are accurate for pregnancy but just keep a check on things",
            "post_id": "1118129",
            "timestamp": "1108360800",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "umm I have 4 kids had my tubes tied 2 years ago and have had no period in almost 2 months is it possibe i could be pregnant?? anyone HELP",
            "post_id": "1880753",
            "timestamp": "1189620423",
            "user_id": "user_274993",
            "user_link": "/personal_pages/user/274993",
            "votes": "0"
        },
        {
            "answer": "Yes it is possible I have 4 kids and am now 16wks.3dys pregnant,I had my tubes tied when I had my son 11yrs ago and even took 6 pregnancy test and all said neg and the 7th at the doctors office was also neg and that was at 7wks and now here I am pregnant and I also have bled every month as is on a perod and that has happened to me with my 3rd pregnancy I bled 5 mnths and never knew I was pregnant until going to the doc and having a lood test done b/c I felt lousy and did'nt know what was wrong with me...and my sil was on the shot and had her blood testedand urine test done at the doc and the test came back neg also and she was 4months pregnant.So trust your body and don't take no for an answer.",
            "post_id": "1882780",
            "timestamp": "1189662001",
            "user_id": "user_232876",
            "user_link": "/personal_pages/user/232876",
            "votes": "0"
        },
        {
            "answer": "hi everyone,I had my tubes clamped 5 years ago after my son, it has been 7 weeks since lmp, all tests are negative including blood tests, and all my hormone levels are normal, have another appointment in 3 weeks to see obgyn, i'm going mad has this happened to anyone?",
            "post_id": "1908101",
            "timestamp": "1190384275",
            "user_id": "user_281884",
            "user_link": "/personal_pages/user/281884",
            "votes": "0"
        },
        {
            "answer": "Does anyone know how effective a tubal ligation is after 7 years, or what my chances of concieving may be?",
            "post_id": "1954030",
            "timestamp": "1191587524",
            "user_id": "user_292875",
            "user_link": "/personal_pages/user/292875",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied 5 years ago, I had made a harsh decision to do so after I lost my daughter 31 days after birth. All I know is I never wanted to go threw that again. Almost 5 years to the day I was feeling really crummy, cramp,bleeding after my normal period. I went to the hospital and told them I had my tubes tied, routine was still to do a pregnacy test and low and behold I was pregnant. I had an ultra sound and it was NOT a tubal pregnancy but I did miscarry. No one can explain this either. It is very frustrating because I do want another baby, but everyone keeps telling me different things. The doctors can't even give me straight answers. Anyone else???????",
            "post_id": "1965176",
            "timestamp": "1191899325",
            "user_id": "user_295640",
            "user_link": "/personal_pages/user/295640",
            "votes": "0"
        },
        {
            "answer": "I made a post on this topic about a week ago I got my tubes tied in 2005. I havent had a period since August. I took a EPT test and it came back poitive and then I went to the hospital a few days later due to cramping and they told me that I wasnt pregnant. Here it is Oct. I still havent had a period I have all the signs of being pregnant. I can even feel my uterus now its gotten hard like a brick and further up in my abdomen. But I still can not show a positive urine test. I did do some research on it and I learned when you have a tubal its best to do blood than urine becasue of some reason its harder to get a positive urine test. The problem im running into being that I dont have insurace that its hard for me to find anyone to do a blood test on me they tell that they cant to a blood pregnancy test because I have had a tubal. I have come to the point as to say I know my body well enough I have had 3 kids and I know in my own little way im pregnant so im just going ot wait until the baby comes. I am so frustrated with this situation. Its going to cost me well over 200 dollars just to get a blood test done if I can find someone to do it. I have been on the phone with several nurses around here in my area and they all tell me the same thing \"you have had a tubal you need blood done not urine.\"Im compleatly at a loss.",
            "post_id": "1967414",
            "timestamp": "1191959139",
            "user_id": "user_293404",
            "user_link": "/personal_pages/user/293404",
            "votes": "0"
        },
        {
            "answer": "",
            "post_id": "1974668",
            "timestamp": "1192131238",
            "user_id": "user_298206",
            "user_link": "/personal_pages/user/298206",
            "votes": "0"
        },
        {
            "answer": "It has been 5 years this past July that i had my one tubed left and it was tied. at least thats what i am sure was done since dr saidhe can reverse it! I lost one tube with a etopic in 2000. Well i had my daughter in 99 the 2000 i had the etopic and in 2001 i had a miscarriage, then in 2002 i had my son. I just found out about a year ago that i have endometriosis i had a LAP done and drtook some out! I am now 4 days late on my period and havent been late for ever in a day! I was wondering after 5 years could my tube grow bac together really. I am more nervous about this than anything. Hubby and i have wanted another baby but dr said my best bet was to have the invitro done. because having the endometriosis i could have another etopic and i do not want or wish that on anyone! I felt like i was dieing!! Well if u have anything for me about this please let me know!  Thanks!!!",
            "post_id": "1974712",
            "timestamp": "1192131832",
            "user_id": "user_298206",
            "user_link": "/personal_pages/user/298206",
            "votes": "0"
        },
        {
            "answer": "I had my tubal done 2 years ago after I had my 2nd child. I had it done because everyone told me that I didn't need anymore kids because my husband and I dicvorced while I was pregant with our 2nd child after 10 years together. Well I had it done at the age of 27 and I have always hated that I did it, but now I am with a great guy who loves me and my kids and he knows of the tubal and he understands that I may not be able to have anymore. I guess what I am looking for is someone that has had a tubal ligation with the clips and still got pregant.",
            "post_id": "2015774",
            "timestamp": "1193168964",
            "user_id": "user_310367",
            "user_link": "/personal_pages/user/310367",
            "votes": "0"
        },
        {
            "answer": "i hade a tubal ligation on 10-29-04 i am 24 i really regret it. i am divorced from my first husband who talked me into the ligation and i am re married to a wonderful guy who has no kids so we both want a child together . we can not afford a reversal so i am asking for help from god . i am almost 2 months late on period. have all prego symptoms . took 3 different kinds of hpt and all neg. i dont have insurance so i cant go to doctor. i just found out from the doctor what he did to my tubes he said oh they were just cut like it was no big deal . so my questions are could i still be prego. since my tubes were just cut could they grow back . with my fisrt child i was 20 weeks before i found out and i even took hpt went to doctor and a christian clinic and all test were neg finally at 20 weeks i took another hpt and positive with my second i was16 weeks before i found out and both times i had no symptoms just missed periods. im like the post a few up i guess ill just wait and see if i have a baby lol good luck 2 every1 post if you get new results it will give some of us hope.",
            "post_id": "2020195",
            "timestamp": "1193250897",
            "user_id": "user_302388",
            "user_link": "/personal_pages/user/302388",
            "votes": "0"
        },
        {
            "answer": "repost please",
            "post_id": "2022691",
            "timestamp": "1193287054",
            "user_id": "user_302388",
            "user_link": "/personal_pages/user/302388",
            "votes": "0"
        },
        {
            "answer": "I would like to know if women ovualte after TL it has been 9 years since my TL and I have always felt myself ovulate, I can see when I ovulate. I am a mother of 5 kids...aging from 15-9 I want verymuch to actually have another baby. My now fiance` and I would like to. This last cycle I cramped extremely hard during about the time of my ovulation, and about a week ago  cramped again, same as I have done in the past I think mostly with my first child (the extreme cramping, I didnt know I was pregnat for some time because I actually spotted with her on the day I was suppose to start.... anyway I have also read somewhere that women lose there sexual desire when pregnant...I never had that, with my ex husband but for the last week I have been extremely uninterested..... which I cannot understand.... so not like me....If anyone has any similar feelings emotions experiences that would be great... thanks",
            "post_id": "2054126",
            "timestamp": "1193969716",
            "user_id": "user_320807",
            "user_link": "/personal_pages/user/320807",
            "votes": "0"
        },
        {
            "answer": "I had a TL on 2-1-98 my last period was on 9-20-2007.My breast are VERY sensitive and some swollen, i feel like i need to throw up some mornings but i never do. i have like a irritating headache everyday, i have the heartburn every night, i am having to urinate alot more than normally and i have a discharge. Has anyone had these symptoms after TL and been pregnant?I really appreciate the info.....Thanks",
            "post_id": "2061868",
            "timestamp": "1194183156",
            "user_id": "user_323015",
            "user_link": "/personal_pages/user/323015",
            "votes": "0"
        },
        {
            "answer": "I had the exact same story---27 tubal with clips...divorced after 10 years with the daddy.  nowi'm with a wonderful guy whom i've just married and i want a baby so bad.  Any chance of sucess.  Somebody give me some hope.",
            "post_id": "2210991",
            "timestamp": "1197252891",
            "user_id": "user_357544",
            "user_link": "/personal_pages/user/357544",
            "votes": "0"
        },
        {
            "answer": "It can happen  I had my tubes cut and burned alomost 8 years ago last month I was pregnant.  I had a miscarriage but i got pregnant which I thought never possible.  My doctor offered to redo my tubes I chose not to.  Like you I also remarried and my husband has no children so if I were to get pregnant again it would be a blessing.  Also when I found out I was pregnant I searched on the net and found out that more people than you can imagine actually have regular uterine pregnancies after they had a tubal.  Don't get me wrong anytime you get pregnant after a tubal you risk a chance of ectopic.  But do some research on the net and you will find what I did. Hope I helped",
            "post_id": "2211223",
            "timestamp": "1197256760",
            "user_id": "user_352049",
            "user_link": "/personal_pages/user/352049",
            "votes": "0"
        },
        {
            "answer": "I'm having the exact same symptoms you are, except my period is only a couple days late.  I had my tubal in march of 99.  Let me know what you find out.",
            "post_id": "2336844",
            "timestamp": "1199849066",
            "user_id": "user_382523",
            "user_link": "/personal_pages/user/382523",
            "votes": "0"
        },
        {
            "answer": "HELP! I'm 31 y/o and i had my tubes tied jul. 15th 1997. My period is now 4 days late. I have'nt been late since 1996. I took a first response home pregnancy test 2 days ago and it came out negative. I went to see my gyn doc this evening and the urine test came out negative. Now i have to schedule an appt. for an ultrasound. Doc said if i feel faint or dizzy to go directly to the ER and they'll give me the ultrasound on the spot. Meanwhile my breasts are sore, my left side is very painful, my lower abdomen hurts, my lower back hurts, i'm constipated and i have gas, and my bladder is constantly full. Can anyone please give me some advice.",
            "post_id": "2402270",
            "timestamp": "1201141840",
            "user_id": "user_397628",
            "user_link": "/personal_pages/user/397628",
            "votes": "0"
        },
        {
            "answer": "hi i need help im 41 years old had my tubes tied 20 years ago with clamps now i hav a missed perid and a urinary tract im scared not ready to go to the doctors yet im wondering could i be pregnant and would it be a etopic one is this possible and if i am is there any chance of survival",
            "post_id": "2658426",
            "timestamp": "1205824794",
            "user_id": "user_453571",
            "user_link": "/personal_pages/user/453571",
            "votes": "0"
        },
        {
            "answer": "I am 27, have 3 sons, my husband had a vasectomy and I had a tubal.  I know the chance is extremely slim, but I am 1 month late which never happens, am cramping though it is stabbing pain in my right lower abdomen (my appendix are already out).  Any ideas???  When should I see a dr. or worry???",
            "post_id": "2667611",
            "timestamp": "1205987592",
            "user_id": "user_455671",
            "user_link": "/personal_pages/user/455671",
            "votes": "0"
        },
        {
            "answer": "i had a tubal in 1999  when my last son was born  well the other day i went to the emergency room because i wasnt feeling to good the nurse had asked me if i was pregnant , i said no my tubes are tied she told me that dont mean nothing i could still get pregnant  HELLO someone talk to me@ ***@****",
            "post_id": "2815440",
            "timestamp": "1208917542",
            "user_id": "user_488314",
            "user_link": "/personal_pages/user/488314",
            "votes": "0"
        },
        {
            "answer": "For starters i had my tubes tied or so they say, i cant get the dr to tell me anything, in jan 2002 ive NEVER missed or been late for a cycle in 6 years. now im 2 weeks late, have all the pregnancy symptoms and in my heart i \"FEEL\" that i am, but i dont want to really think i am for fear that im not. it will break my heart. i spent 10 years in a marriage, have 3 beautiful daughters from that marriage. when almost a year ago he left me for another woman and had a child with her. im now happily engaged to a wonderful man with no children of his own. he knows the chances are slim.. but we still continue to pray. can god give me what i so desperately want even when the drs say its not possible??",
            "post_id": "2835291",
            "timestamp": "1209324843",
            "user_id": "user_492459",
            "user_link": "/personal_pages/user/492459",
            "votes": "0"
        },
        {
            "answer": "hello,i am a 23 year old and i have three kids...i got my tubes clamped almost 7 mths ago, but i have not had my period for two mths, i was having them every mth, i was up everynight for a week vomting only at night. i am also haveing pains on my lower part of my stomach. i al also mlicking in my breast. i went to birthcare to get a urine test done but it same back neg. is there a chance i am pregmat and will i be able to carry it? some one please help me i really need it!!!!",
            "post_id": "2845725",
            "timestamp": "1209518733",
            "user_id": "user_494709",
            "user_link": "/personal_pages/user/494709",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied, I think clip and burnt 13 years ago.I thought I was pregnant I could see and feel movement in my stomach like a baby. I have 3 children youngest 13.after going to doct, found out it's my gallbladder only funchioning 17 percent.like some of you. I've remarried now to the man of my dreams,He has one child she's about to b 16. I would love to have him a son. But I only want it if it's gods prefect will.I want nothing out his will.Because he know's what's best for me. He's the only one who kno my furture.But, I will Contiue to pray and ask him,If his prefect will is for me to have a baby i have enough faith in him to know it will come. And if he say yes I will let you kno as soon as it happen thats a promise! If he do it for me.he loves me kno more than u. he'll do it for you. If its not his prefect will. Trust him enough to kno it's for a reason.he see and kno what we don't.And for you who beleive I pray for you. And I'm asking god to let his prefect will be done for you.hey'' let me kno. GOD BLESS! amen.p/s remember we can't put a time limit on god.I've been praying for 5 years. But i'm not giving up. i'm not rushing him. if it never happen im find because i kno it's not his will.If it does wow!!!!!!!! joy, peace, happiness, blessed. miracle from God.and I'll give him all the credit 100%",
            "post_id": "2893007",
            "timestamp": "1210525629",
            "user_id": "user_505061",
            "user_link": "/personal_pages/user/505061",
            "votes": "0"
        },
        {
            "answer": "I see your post was put on here some time ago but I was wondering how that worked out for you? You see I just turned 43 in April, I have had reg periods my whole life (no more than 5 days late) and now I find myself 19 days late. I've had my tubes clamped for 18.5 yrs. I am going through some stress right now but my periods have always came early or more frequently with stress, not late. Before the tubal I've never had a problem to conceive, let's just say it was necessary or I would have 20 kids by now!! I have ALL the symptoms of pregnancy with the exception that the pregnancy test I took 6 days ago being negative. I thought maybe menopause but there was no warning and no symptoms leading up to it if it is menopause. Any thoughts?",
            "post_id": "2995994",
            "timestamp": "1212596640",
            "user_id": "user_527420",
            "user_link": "/personal_pages/user/527420",
            "votes": "0"
        },
        {
            "answer": "I had a TL in Jan of 2008 and I have missed my period.  I took 3 test and all came back positive.  I went to the doc asap and he did blood work.  It came back positive.  I had an ultrasound and nothing was seen.  I have been going for blood work every other day to make sure the hormone levels are increasing.  I am wondering at what point should I request another ultrasound?  I am currently 5.5 weeks along.  I am guessing another couple of weeks...but it is so hard to wonder what is going to happen.",
            "post_id": "3071221",
            "timestamp": "1214192621",
            "user_id": "user_531529",
            "user_link": "/personal_pages/user/531529",
            "votes": "0"
        },
        {
            "answer": "My hormone levels are increasing well.  I have an ultra sound tomorrow a.m.  I am starting to get a bit down about the whole thing. I hate the thought of going and finding out it is a tubal.  I keep telling myself to be thankful for the three wonderful children I have...but this baby no matter where it is, is a part of me.  Ahh! the suspense is killing me.",
            "post_id": "3076520",
            "timestamp": "1214312653",
            "user_id": "user_531529",
            "user_link": "/personal_pages/user/531529",
            "votes": "0"
        },
        {
            "answer": "I also have an ultrasound tomorrow a.m.  I feel the same as you.  I already have two children of my own and two step-children, but feel if this little one has the will it will find a way.  I can't wait to find out where he or she is!  Good luck tomorrow!",
            "post_id": "3076969",
            "timestamp": "1214319936",
            "user_id": "user_544414",
            "user_link": "/personal_pages/user/544414",
            "votes": "0"
        },
        {
            "answer": "I see that you found out that you are indeed going to be a mommy again.  Congrats!  It is hard not to think of this circumstance as a miricale.  I was curious when you had your ligation and what kind did you have?  When are you due?  Good luck to you!",
            "post_id": "3094562",
            "timestamp": "1214682603",
            "user_id": "user_531529",
            "user_link": "/personal_pages/user/531529",
            "votes": "0"
        },
        {
            "answer": "I had a ligation 11 years ago last month.  Last month I had a two day period that was very light.  I have felt nauseous and very tired since two days before my irregular period.  I also have a feeling of tightness below my naval. My next period should be in about a week. I have three wonderful children but was in a miserable marriage until 6 years ago.  I have been married to a wonderful, Christian man for almost 4 years now.  He does not have any children so we would be so excited to have one of our own. I am really scared to take a test and be disappointed but I know I need to find out what is going on.  I/we pray God has decided to bless us with a special gift!",
            "post_id": "3148023",
            "timestamp": "1215884932",
            "user_id": "user_559594",
            "user_link": "/personal_pages/user/559594",
            "votes": "0"
        },
        {
            "answer": "I too had my tubes tiered over 11 years ago and I am now experiencing pregnancy symptoms.  Nausia, sore breasts, the smell of food makes me sick to my stomach.  I have another week before I can say I've missed my period.  I did take a pregnancy test but it came back negative.  I feel in my heart that I am pregnant but just don't know.  I am with a wondrful man who has not children, I have 4 but would love to be able to give him a child of our own.  Just feeling like could this really be happening after 11 years.",
            "post_id": "3295952",
            "timestamp": "1219097879",
            "user_id": "user_593490",
            "user_link": "/personal_pages/user/593490",
            "votes": "0"
        },
        {
            "answer": "Hello, Im 36 and have had my tubes tied/cut/burned? since 1994, I did do invitro in 1999 and lost the baby at 5 months into pregnancy we done it again in 2002 and had beautiful boy/girl twins. Since by tubal ligation in 94  I have been always on time never late and very heavy for 7 to 10 days. In July was atleast a week or more late, this month never really had a period a smear here and there. I have severe nausea, breasts hurt, horrible headaches,tired all the time. My 5 yr old boy twin asked me today if I had a baby in my belly because my belly was hard and asked me if it hurt and I said a little and he said then you probably have a baby in your belly I told him no that mommy couldnt have babies anymore and he said if GOD wants you to have a baby he will put one there. My stress level is no more than usual, keep thinking I will just wait and see if it comes next month, but am very curious.  I hear your chances are higher having them tied over 10 yrs and being over 35 anyone with any knowledge of this??",
            "post_id": "3302166",
            "timestamp": "1219216157",
            "user_id": "user_595039",
            "user_link": "/personal_pages/user/595039",
            "votes": "0"
        },
        {
            "answer": "also a little more info, I have had 6 babies including the one I lost in 99, and 5 of them where with only 1 ovary, so feel that I am very fertile if it makes any difference. Still have 8 eggs frozen but would love to be pregnant naturally again, and as if it wouldnt have perfect timing I return back to nursing school to finish my next degree in October. So still very excited hoping the possibility is very high that I could be, please comment and let me know if possible.",
            "post_id": "3302171",
            "timestamp": "1219216553",
            "user_id": "user_595039",
            "user_link": "/personal_pages/user/595039",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tied for 6 going on seven years, banded not cut or burned. June 11th was the last time I have had a period. On Aug. 2nd and 3rd I had a brown spot in my panties. Around the 11th I started getting really nauseated,cramping, heavy breasts, unusually tired and my moods were everywhere. I have taken 3 at home tests and on the 15th another urine test at the drs office(all were negative). This morning I woke up and to my surprise had a thick brown discharge when I went to the bathroom. I have since gone to the bathroom 2 more times since I went at 0630 this a.m. and still the discharge on wipe. My husband doesn't want to talk to me about it cuz he is nervous that I may be pregnant. Funny thing about it is..........I believe in my heart that I am. I have heard that women who have had their tubes tied have a hard time getting positive results from urine samples. Not sure why though. I hope things work out for you. You are not by yourself:) If anyone else can give advise please do.",
            "post_id": "3307645",
            "timestamp": "1219328535",
            "user_id": "user_595523",
            "user_link": "/personal_pages/user/595523",
            "votes": "0"
        },
        {
            "answer": "I belive that if it's meant for you to get prgnant you will.I HAVE  HAD MY TUBES TIED FOR ALMOST 4 YEARS AND I HAVE 2 GREAT BOYS ONE'S 7 AND THE BABY WILL SOON BE 4 I WISH I COULD HAVE ANOTHER BABY A GIRL OR BOY AS LONG AS IT IS HEALTHY I WILL TELL YOU JUST PRAY AND HAVE FAITH AND IT WILL HAPPEN! I JUST GOT MINE TIED HAS ANYONE GOTTEN PRGNANT THAT SOON? I HAD A FRIEND WE USED THE SAME DOC AND SHE GOT ANOTHER BABY MAYBE I WILL BE THAT LUCKY ALSO!!!!! WISH ME LUCK!!!!!!!!",
            "post_id": "3612755",
            "timestamp": "1225764878",
            "user_id": "user_671246",
            "user_link": "/personal_pages/user/671246",
            "votes": "0"
        },
        {
            "answer": "I too need help I had my tubal 4-24-04 after my son was born. I was pressured into it. I really want another baby. Today is 11/05/08 and My last menstual was 09/09/08. I have been cramping but nothing, at the same time I been having all the pregnancy symptoms. I took 2 test and both were negative. Can I still be pregnant?",
            "post_id": "3621941",
            "timestamp": "1225940788",
            "user_id": "user_673361",
            "user_link": "/personal_pages/user/673361",
            "votes": "0"
        },
        {
            "answer": "I am 37 have 4 kids of my own had a tubal done after my \"baby\" in 93. Like alot of people on here I am remarried and wish with my whole heart I could get pregnant again. Last October I thought maybe because I was over a month late My husband went out and bought me a pregnancy test and a box of tampons, well the test was neg. then I started that night, and did not stop bleeding until jan. after a hysteroscopy dnc then everything was normal periods normal on time and everything until October i had slight spotting for a day and a half twice in Oct then nothing yet this month some spotting after sex, just once so far I have tender breasts, extreme hunger at times always in the bathroom my stomache is tight and heavy feeling no sex drive and feeling sick all the time I am afraid to take a test dont want to waste the money if I am not any ideas? anyone? here's to hoping huh?",
            "post_id": "3637966",
            "timestamp": "1226291645",
            "user_id": "user_677315",
            "user_link": "/personal_pages/user/677315",
            "votes": "0"
        },
        {
            "answer": "I had my period two weeks ago but I'm experiencing symptoms that I normally experience right before I start my period! I told myself two years ago that I would never do this again. I told myself that I would accept the fact that I'm sterile. But here I am!  Two years ago I experienced symptoms that made me believe that I was pregnant. I bought a pregnancy test. It was negative, so I went for a blood test, also negative. Convinced that there was something in my uterus, I talked my doctor into an ultrasound and nothing. I had my tubal ligation done in 1999 after the birth of my 3rd child. I was only 22! I didn't regret it until 4 years ago, when I met this man that I'm truly, madly, deeply in love with! Ever since then, my mind has been playing tricks on me. I desperately want my tubal ligation to fail! I want more than anything to have a baby with this man. I really don't have the finances to reverse what has been done. There are times that I get a virus that mimics pregnancy symptoms and I run out and buy a test, hoping that I'm pregnant. When I get these symptoms, I also research like crazy hoping for some light to the end of this tunnel. This is what I have researched: Tubal ligation has a known failure rate that is 1-3/1000 women in the first 5 years and 10/1000 women by 10 years. (Think about it, ten pregnancies out of 1000 women in a span of ten years!) That's not a lot of failures! There is a higher failure rate if the woman had a ligation at the time of her c section, which I did. It turns out that having a ligation at the time of delivery compromises the quality of the ligation, because the uterus and fallopian tubes are swollen. Even if a woman gets pregnant, it's more than likely a tubal pregnancy. I have read a lot of stories from women claiming to have these symptoms, but no one ever comments back. This is really depressing! I don't know why I even put myself through it!",
            "post_id": "3647234",
            "timestamp": "1226472184",
            "user_id": "user_679926",
            "user_link": "/personal_pages/user/679926",
            "votes": "0"
        },
        {
            "answer": "I had my period two weeks ago but I'm experiencing symptoms that I normally experience right before I start my period! I told myself two years ago that I would never do this again. I told myself that I would accept the fact that I'm sterile. But here I am!  Two years ago I experienced symptoms that made me believe that I was pregnant. I bought a pregnancy test. It was negative, so I went for a blood test, also negative. Convinced that there was something in my uterus, I talked my doctor into an ultrasound and nothing. I had my tubal ligation done in 1999 after the birth of my 3rd child. I was only 22! I didn't regret it until 4 years ago, when I met this man that I'm truly, madly, deeply in love with! Ever since then, my mind has been playing tricks on me. I desperately want my tubal ligation to fail! I want more than anything to have a baby with this man. I really don't have the finances to reverse what has been done. There are times that I get a virus that mimics pregnancy symptoms and I run out and buy a test, hoping that I'm pregnant. When I get these symptoms, I also research like crazy hoping for some light to the end of this tunnel. This is what I have researched: Tubal ligation has a known failure rate that is 1-3/1000 women in the first 5 years and 10/1000 women by 10 years. (Think about it, ten pregnancies out of 1000 women in a span of ten years!) That's not a lot of failures! There is a higher failure rate if the woman had a ligation at the time of her c section, which I did. It turns out that having a ligation at the time of delivery compromises the quality of the ligation, because the uterus and fallopian tubes are swollen. Even if a woman gets pregnant, it's more than likely a tubal pregnancy. I have read a lot of stories from women claiming to have these symptoms, but no one ever comments back. This is really depressing! I don't know why I even put myself through it!",
            "post_id": "3647239",
            "timestamp": "1226472201",
            "user_id": "user_679926",
            "user_link": "/personal_pages/user/679926",
            "votes": "0"
        },
        {
            "answer": "Hi, I just wanted to say I know how everyone is feeling, the confusion and the unknown. Today Im 9 days late for my P, two day before they were to start I have a light to med brown discharge (but only when I wiped from going to the toilet), (symtom classed as implantation bleeding happens a few days to a week before period is due) ! which lasted three days. Then nothing. Ive been getting lower back pain, cramping (mild), heavy type of headaches, nausea (mild), tightness around my lower abdomen, this morning Ive noticed goosebump lumps around nipples. All of which are pregnancy symptoms and I dont get any pms except heaving aching feeling like everything is going to fall out. I did preg test on day 3 and 4 and 6 after my expected P was due all neg. To top this off I am like clockwork with my P exactly 27 or 28 cycle, as well 7 years ago I had my tubes clamped. My (now)  husband and I are due to go to IVF on the 9th Dec, I guess I will know sooner or later, but is there anyone who has been pregnant after having tubes clamped.",
            "post_id": "3716077",
            "timestamp": "1228030659",
            "user_id": "user_697546",
            "user_link": "/personal_pages/user/697546",
            "votes": "0"
        },
        {
            "answer": "im 32 yrs old and i had a tubal ligation done almost 5yrs ago.And i regret alot cause now i want another baby,but i had also read storys about women getting pregnant after tubal ligation.Does anybody knows of someone who had their tubes cut and burn and still got pregnant.....Can someone please get back to me on this im desprate......and to get my tubes reverse cost alot of money and insurance dont cover it.",
            "post_id": "3738399",
            "timestamp": "1228503090",
            "user_id": "user_703102",
            "user_link": "/personal_pages/user/703102",
            "votes": "0"
        },
        {
            "answer": "i'm confused about the whole situation also had my tubes tied also supposed to be tied/burnt/clipped but dont really know i'm showing signs of pregnancy and i have two kids both disabled ones in a wheel chair both a blessing and i kind of want another one but i dont know if i am i have took about ten tests and even some at the dr office all neg. but i still feel pregnant. i dont know which way to go, anyone have any adviceconfused in the carolinas",
            "post_id": "3945895",
            "timestamp": "1233615419",
            "user_id": "user_753548",
            "user_link": "/personal_pages/user/753548",
            "votes": "0"
        },
        {
            "answer": "I am 32 years old, I had my Tubal (Pomeroy Teqnique =clip, burned)done 11 years ago 1997 after the birth of my second child.. I didn't want the tubal but my then husband insisted on me getting it... I've wanted to have a child with my husband now, and 3 weeks ago I to was feeling all the pregnancy symptoms and just knew in my heart that I was preg. I took hpt (+) couldn't believe it took another (+) so I went Monday to local clinic I used to work at and they gave me an urine test and it to was (+) so with the shock and disbelief, since I was told it was nearly impossible for me to become preg. I went to the hospital and they gave me a quantative blood test..they confirmed it I was about 2 weeks preg. and they had me come back to the hospital 2 days later, (Wed.) to see if my levels were raising...and they were it went from 128 first to 288 second test, the third test (Fri.) I took the levels began to drop they went to 221, So i was a wreck but the Dr. was reassuring that it could be anything to make the levels drop. Since it was the weekend I did everything I could to make sure I didn't jeopardize this preg.. Mon. I felt fine, better than ever... Tues. I woke up and was bleeding..Hysterical I rushed to the ER and the Dr. there said it was extrautarine bleeding and it wasn't a ruptured tube.. She said I could be experiencing blight ovum (miscarriage), So now I have another appt. on Mon. to see my OB/GYN to reassure that my tubes are fine I believe I'm going to request him to do a Lapro. to tell me how my tubes look and if they have indeed grown back together...Waiting to see",
            "post_id": "4103823",
            "timestamp": "1237385096",
            "user_id": "user_797169",
            "user_link": "/personal_pages/user/797169",
            "votes": "0"
        },
        {
            "answer": "I got my tubes tied 16yrs ago...For the last couple months I've been feeling movement in my stomach but have been getting my period still..But last month my period was only 2 days..I had an ultrasound done and blood test doctor said she didn't see anything but my right tube was a little bit larger then the left which she claimed was normal...Blood work was negative.I still have been feeling movement even more on some days then others...I got my period yesterday but this time I have cramps which I don't get on my period usually its before not during..I felt movement alot the day before and still while on my period..My husband says its gas or maybe I have to go to bathroom but I know my body..I have 3 girls also 20,18,17...I'm 36yrs old and was young when i had my girls...My husband doesn't have any and this would be a blessing..But with no answers and no insurance it's driving me crazy...Don't know what else to do.",
            "post_id": "4376266",
            "timestamp": "1240268422",
            "user_id": "user_872972",
            "user_link": "/personal_pages/user/872972",
            "votes": "0"
        },
        {
            "answer": "I know the chances of getting pregnant after getting cut tied and burnt(1-25-07) I desperatly want to get pregnant with my new husband and it is driving me crazy. I was pressured into getting the TL by my ex and his family. My new hubby is very supportive and wishes us to have a child also. I guess what Im asking is that how possible is it for me to get pregnant and what are the chances of me getting a reversal?  Im only 25 and am hoping for the best. I dont recommend the TL at all Ive had so many issues with it and it has caused me serious depression that required medications.",
            "post_id": "4434123",
            "timestamp": "1241634149",
            "user_id": "user_896353",
            "user_link": "/personal_pages/user/896353",
            "votes": "0"
        },
        {
            "answer": "I just read your post as I am searching and you say you would like another baby! I do not know how ole this is but I had a tubal reversal done on 4-13 after my TL 7 1/2 years ago. I had them triple burned and he put them back together. Dr. RIchard Levin is a leading specialist in this field since before I was born. It cost me 6,200 and this included hotel stay for two nights, the night before and the night after. hotel shuttle to the hospital, surgery,meds everything!!!! i did not even give the hospital my insurace card and all I had to say was I was a patient of Dr. Levin. You can look him up at babiesbylevin.com He is the nest and offers free services afterwards till you are pregnant! Even another surgery if needed. he is in Louisville KY but he has had ladies come from Alaska, and from the middle east and further. He has the best bedside manners and is like an old friend not just  a dr. There is also a support group I am a memebr of for ladies deciding to have one and aafterwards. We have ladies even in their 50's get the surgery and concieve. He looks over your operative report, checks FSH if needed and Sperm then calls you on the phone for free to tell you if you are a good canidae for the surgery. Best of luck to you! Oh I lost my daughter at 23 weeks and she only lived for three hours. I had my TL about a month afterwards too. I fully understand, but also know we were not in a state of mind to make such a decision. Sorry about your loss! I miss my Emma everyday! She would be 8 this August! :(",
            "post_id": "4486270",
            "timestamp": "1242923225",
            "user_id": "user_906115",
            "user_link": "/personal_pages/user/906115",
            "votes": "0"
        },
        {
            "answer": "im 48 had my tubes cut and tied about 11 years ago iv not had a period for about 6 months which i put down to the menopause. over the last few weeks iv put on weight around my tummy and im sure i could feel movement over the last few days could this be the menopause do you think or pregnancy iv not had a test cause i didnt think it possible what do you think anyone im starting to worry help please.",
            "post_id": "4652931",
            "timestamp": "1247474096",
            "user_id": "user_966885",
            "user_link": "/personal_pages/user/966885",
            "votes": "0"
        },
        {
            "answer": "I am a 29 year old mother of four 6 years ago after my last girl my husband and I thought it would be best for mr to have a TL. Since then I have divorced my ex and I am engaged to a wonderful man. I recently have been experiencing pain in my lower abdomen. I have also been spotting, I had the procedure done immediatly after given birth and the Dr. said it was called the clip procedure. If there is anyone who may have had this done and has gotten pregnant or experiencing complications please give me some advice.",
            "post_id": "4716602",
            "timestamp": "1248995365",
            "user_id": "user_987682",
            "user_link": "/personal_pages/user/987682",
            "votes": "0"
        },
        {
            "answer": "I am a mom of three i had a tubal ligation done 6 years ago.  Because of painful periods i have also been on the depo to supress my periods for about four years.  I am newly engaged and my fiance' and i want a  child, so i missed my depo that was due last month and usually when i miss my dose, i get a period about a week after i am late with the dose.  This time i have not yet gotten a period (it's been about 4 weeks) and have had some pregnancy symptoms but the home tests (2) have been negative.  I too cannot afford the reversal procedure, can anyone tell me of anything i might be able to do, besides the reversal, that can increase my chances of getting pregnant?",
            "post_id": "4857408",
            "timestamp": "1252604033",
            "user_id": "user_1034786",
            "user_link": "/personal_pages/user/1034786",
            "votes": "0"
        },
        {
            "answer": "I had a tl (12/2001) cut and burned, after a c-sec a baby girl. Only wanted 3 children and she was my last. My Dr didnt counsel me at all just told me it was perminate. Two months later she died of SIDS. Felt like I wanted to die myself but I still had two other children to live for. But since then Ive been wanting to have another baby and every now and then I thought I was pregnant because of late periods.(mind playin tricks) I had to start the pill because I spotted after periods and have been on them for 4 yrs and they helped with the spotting but in July I didnt take the pill and got very bad period so I re started it in August but since Im 35 now I stopped and the pill. my periods come 24th of every month on time and even came 24th in july when I didnt take the pill. But July was the last time I got my period.  On the 24th of August I cramped for about a week but no blood. I had lower back aches, light headness, dizzy, cramps, urinating a lot, wanting to eat everything and still no period. Ive taken 4 hpts starting from 1wk late n all neg. Even did first morning urine 1 wk ago and still neg. Now 3 wks late and I barely get cramps but stll lower backaches. I hve a dr appt thursday with my primary physician to get a blood test because planned parenthood wont give me blood test unless they feel its ness. I must say to anyone thinkin to have TL PLEASE DONT DO IT!!!! U Never know what may happen that will make you want more children. Get the IUD they have a 5yr and a 10 yr and I wish I knew more about them at the time I had my TL I wouldve gotten it. Ill let you all know what happen at the Dr.",
            "post_id": "4873021",
            "timestamp": "1253022018",
            "user_id": "user_1040261",
            "user_link": "/personal_pages/user/1040261",
            "votes": "0"
        },
        {
            "answer": "I took another hpt last night and it was negative then a few hrs later i started my period but very light. Im still going to go to the Doc to get a blood test just to make sure Im not miscarring.",
            "post_id": "4880229",
            "timestamp": "1253185701",
            "user_id": "user_1040261",
            "user_link": "/personal_pages/user/1040261",
            "votes": "0"
        },
        {
            "answer": "I had my tube tied and burnt 11 yrs ago.  I have every symptom of being pregnant.  Breast have gotten huge, tender and nauseau, dizzy, cramping very tired . i was bleeding heavily for 3 days. I went to the er. they took a pregnancy test ,it was positive. They didn't even tell me . When I asked the nurse if they have gotten in touch with my obgyn ,she asked me for what? She said for your pg test? I was confused. She said it came out pos. then she continued to tell me they documented it as a negative result.  It was late at nite and I was on pain medicine, I didn't question her.  They found nothing on my cat scan and proceeded to send me home on strong pain meds.  I spoke to my dr. the next day he said he wants to do an exploratory lapo. on me.  He said I may have endometreosis.  I don't think the hospital even told him my test was positive.  I'm wondering how this could be.  Any clues?Confused",
            "post_id": "4903172",
            "timestamp": "1253764926",
            "user_id": "user_1050787",
            "user_link": "/personal_pages/user/1050787",
            "votes": "0"
        },
        {
            "answer": "I am also hoping that GOD will bless with me with another baby. I too got my tubes tied and regretted it- while I was still in the hospital. At the time I got my tubes tied was during my C-section in 2006. At the time me and my boyfriend were unemployed and n ot very responsible even tho were older and should have been. My mom also was the biggest influence on me getting my tubes tied. Well after our daughter was born, we completely turned our lives around. Boyfriend is now my husband. He has a very good job working for the city as a lineman. We just purchased  our new home. He is also the best father I have ever seen! He also has 3 grown kids and i have 2 older kids. Our little girl we have together has been such a huge blessing and I believe she was sent to us to change our lives. When she was about 6 months old I started researching tubal reversals and thats when I found out it is possible. I brought it up to my husband but he said he didnt want anymore kids, he just wants to spoil the one we have together. I begged and cried to him to the point that is caused arguments with us. He then said, lets wait awhile(well im getting old) now our child is 3 and I've been bringing it up again. He doesn't want anymore kids, he says hes too old,he's 51 now, i'm 37. I want this soo bad. I threaten to have the reversal, he says he will wear condoms. So I guess the only way I will have another child is by GODs help.As far as the reversal for some of you ladies, check out Dr. Levin or baby's by levin center. I have done sooo much research on this and this is the best place to go. Don't go with cheapest doctor. Don't go with closest doctor. His prices are about 6900 but that covers everything and he will follow up with you til you get pregnant. He will help, for free, with fertility care as needed. He will re-do the surgery for free if for some reason the tubes re close. They have many options as far as paying for the surgery. You can apply for medical loans just like if you were to charge the surgery. If you don't qualify then you can get a co-signer. They didn't offer this a couple years ago. I almost applied last night without telling my husband but chickened out.Please, anyone contact me with any pregnancy after a tubal ligation. I love to hear about it. my user name is my email. I had to spell it like that. Any of you that have had pregnancy symptoms, what ever happened. Many times I have had the symptoms too but I think it was just because I want it to be true so badly.",
            "post_id": "4903538",
            "timestamp": "1253776979",
            "user_id": "user_1050887",
            "user_link": "/personal_pages/user/1050887",
            "votes": "0"
        },
        {
            "answer": "Hello ladies!After reading every ones desprate attempt to get pregnant after a TL, this is one true story to leave you in awe. I had a TL after the birth of my 4th son in April 2007. I was unsure of the type of tubal, all I know is that I DID NOT want anymore children. I am 28 y/o and I just started my career as a paralegal, and I was at a point in my life that I knew I didnt want anymore children. Well I started dating this guy who had no children, but was unaware that I could not have anymore children, and I did not want to tell him because I thought it wasnt none of his business and just in case I needed a big come up on money I would tell him I was pregnant.+ I didnt think the relationship would go as far as it did anyways. I figured he wasnt my type anyways. I know ladies...NOT SO NICE.Well, I finally decided I needed that BIG COME UP ( $ ) so i told him I was\"P\". I thought he was going to tell me to abort the baby, but my BIG PLAN blew up in my face. He actually wanted the baby:-o, and on top of that, he told his entire family. Everyone was so happy being so this was supposed to be his 1st child. Ladies, this man became everything I wanted in a man. He was like a dream come true. Everything you could wish a man to be, he was and more. After the big announcement to the world, he became so attached. He started rubbing on my belly, rubbing my feet, wouldnt allow me to do much of nothing for myself. I couldnt even bend over to tie my shoe without him doing it for me. I began to feel real bad about what I had done, but deep down inside I knew that even if I could have a baby, i wouldnt want it. Besides, I had just started my career for christ sakes!!!! and I wasnt mentally ready to start over. Well I guess GOD had other plans for me. He tought me a big lesson. This is story marks a true saying in the statement \"There is power in the tounge\".My last period i told him was 10/25/09. Which it really was. I was trying to figure out a way to tell him I lost the baby. So I decided to wait until Nov. when my period came to tell him I miscarried, but he was so happy, and I didnt want to take the joy he had or break his heart, and to make matters even worst, he asked me to marry him. I really started to feel bad, and knew if I had told him the truth he would be devistated and probably wouldnt want to talk to me again. So I pushed it off for another month, and said I would tell him at the end of Dec.Well ladies, I began to feel a little diffrent the entire month of Dec. I started urinating a lot, getting cravings, I picked up 2-3 lbs, uncontrollable sleep moments etc. the whole \"pregnancy syndrome\" ordeal. So I decided to take a PT and it was neg. I knew God had loved me so much, that he would do that to me so i brushed it off. Well my period became due and I got 1 day of light bleeding and that ws it. Nothing! Nada! Zip!   WELL I DECIDED TO TAKE A 2ND PT WHICH WAS (+) AND A BLOOD TEST CONFIRMED THE PREGNANCY. AT THE DR. APPT TODAY I FOUND OUT THAT NOT ONLY AM I 9 WEEKS PREGNANT, BUT I AM 9 WEEKS PREGNANT WITH FATERNAL TWINS, AND THEY ARE IN MY UTERUS WITH A STRONG HEART BEAT!!!!!! I HAD A LATERAL TUBAL BOTH SIDES TIED/CLIPPED/BURNED LIED, DIED, AND LAID TO THE SIDE, BUT GOD SAID OTHER WISE. SO NOT ONLY DID I GET PREGNANT, I GOT 2 MIRACLES, LESS THAN 3 YRS AFTER TUBAL, AND NO EPTOPIC PREGNANCIES!! DUE DATE IS JUNE 29TH. WEDDING IS APRIL 14, 2010. Sorry to be so long winded, but this story needed to be told...to give hope to those who need it. NOW WE WILL HAVE A FAMILY OF 6...WOW THAT'S A BIG NUMBER, AND JUST TO THINK IT ALL STARTED AS A PRANK. I GUESS I HAVE TO PUT THAT CAREER ON HOLD AFTER ALL!",
            "post_id": "5233444",
            "timestamp": "1262649942",
            "user_id": "user_1159920",
            "user_link": "/personal_pages/user/1159920",
            "votes": "0"
        },
        {
            "answer": "Q:Did you have a normal P...in Nov or is that the one that was a 1 day of light bleeding .....?",
            "post_id": "5254010",
            "timestamp": "1263163735",
            "user_id": "user_1167638",
            "user_link": "/personal_pages/user/1167638",
            "votes": "0"
        },
        {
            "answer": "Hey all,  Just a little story of hope for all of you wanting a baby after tubal.  I had a tubal in Nov.2006 at the same time as my c-section with my 3rd child.  I had terrible pregnancies with all of them - high BP, preeclampsia, gestational diabetes.  After baby #2 my Dr. said no more but I HAD to have my 3rd and I got my way but Dr. said absolutely I would have a tubal this time.  Anyways, they cut, took out a section of each and sutured all ends - supposed to be the most sure fire, never get pregnant again method.  Apparently, not so much.  In Feb. 2008, I conceived baby #4.  I had just finished nursing baby #3 about a week before.  Complained to hubby about thinking I was lactose intolerant because I was feeling so bloated.  After missed period, decided to try a pregnancy test but didn't think it was at all possible.  Surprise, 3 pregnancy tests, doctor confirmation that it was in the uterus and a shellshocked husband later, baby #4 was on the way.  All went well, and Dr. told us to bring a camera into the scheduled csection to take pics of what had gone wrong.  Absolutely nothing!!  Tubes were still taken apart, no regrowth at all.  Still not sure how our little miracle made his way but in Oct 2008 baby entered the world happy, healthy and God's surprise gift to us.  Had clips attached to all ends of my tubes and hubby went for vasectomy a month later - hahaha.  Hope our story gives hope to some of you.",
            "post_id": "5405436",
            "timestamp": "1266955827",
            "user_id": "user_1222841",
            "user_link": "/personal_pages/user/1222841",
            "votes": "0"
        },
        {
            "answer": "after 2 great kids I had my tubal done in Nov. 05. 6 months after my daughter was born. I was very surprised to find out that i'm pregnant!!! My doctor sent me to get a ultrasound immediately due to risk of ectopic pregnancy but, all is well. I disregarded the 3 missed periods due to my tubal so even when I took the test and it showed positive it was such a shock I took another one. Baby is healthy so far with a due date Aug. 31st. wish me luck! All of you that are hoping it is unlikely but not impossible it does happen im proof LOL!!!",
            "post_id": "5408817",
            "timestamp": "1267034398",
            "user_id": "user_1224014",
            "user_link": "/personal_pages/user/1224014",
            "votes": "0"
        },
        {
            "answer": "i am experiencin no symptoms at all and found out im having an eptopic pregnancy. can you give me any advice as to a safe moral way of saving possibly both of us. I dont believe in abortion and value my own life as well as my childs. The high priest and the bishop have given me options but my dr doesnt want to try them. I am catholic and was told by ten weeks my tubes can rupture causing death in both which is not what i want. so my bishop and arch di sat down and we discussed having the section of my fallopien tube that the baby is in completely removed which by the standards of our church and my condition and knowing theres doubtedly any chance to save the baby, would be the moral and only way excepted by the lord. I really would accept any advice you can help me with.",
            "post_id": "5451397",
            "timestamp": "1268151347",
            "user_id": "user_1239380",
            "user_link": "/personal_pages/user/1239380",
            "votes": "0"
        },
        {
            "answer": "Has one heard of a woman getting pregnant after a tubal litigation (6 years ago) from a prior marriage  and her husband had a vasectomy (7 years ago) from a prior mariage?",
            "post_id": "5486546",
            "timestamp": "1269039398",
            "user_id": "user_1251558",
            "user_link": "/personal_pages/user/1251558",
            "votes": "0"
        },
        {
            "answer": "yes you can still get pregnant. i had my tubes tied after my last baby, and just a few months later i woke up with severe pain in my stomach and was rushed to the emergency room by ambulance to find out that i was 8 to 9 weeks pregnant and the baby was in my fallopian tube which was attached to my ovary. and my stomach had been feeling up with blood for the past few days and i then had to be rushed into surgery where they had to remove the baby along with my left fallopian tube and ovary. i also had to have a blood transfusion cuz i lost over half the blood in my body. the doctor said that if i would have waited any longer i more than likely would have died. so be careful.",
            "post_id": "5486939",
            "timestamp": "1269048891",
            "user_id": "user_1251703",
            "user_link": "/personal_pages/user/1251703",
            "votes": "0"
        },
        {
            "answer": "I am 26 years old and divorced from the father of my 3 boys.  I have read the comments that have been posted but I still need to know if it's possible to get pregnant after BTL and I had them burned as well.  I am currently with the love of my life and he would like another child since he too had a previous relationship that went wrong.  We would like to have another baby, but I still need to know if it is possible.",
            "post_id": "5502134",
            "timestamp": "1269460218",
            "user_id": "user_1257135",
            "user_link": "/personal_pages/user/1257135",
            "votes": "0"
        },
        {
            "answer": "I am a 46 year old and had my tubes cut, burned and laid to the side. Because, I knew after my last child (19 years ago)  I did not want any more children (and still don't). My period has been irregular since I turned 35. However, I had a heavy period in January and Februay which each lasted about 12-14 days and nothing in March. Is is possible that I could be preg???",
            "post_id": "5538583",
            "timestamp": "1270488304",
            "user_id": "user_1269633",
            "user_link": "/personal_pages/user/1269633",
            "votes": "0"
        },
        {
            "answer": "I have not read very many stories about those of you who have had your tubes CLAMPED.  In Nov. 2006, after the birth of my 4th child, I had my tubes DOUBLE CLAMPED on both sides.  I was wondering what are the chances of becoming pregnant with this type of TL. The docor just said that it was double clamped on both tubes, he did not say anything about cutting, tying or burning, so if any of those were done I was not told so.  Anyway, I have regular periods every 33 days.  On March 12, 2 WEEKS before my period was due to start, I had light brown SPOTTING that lasted for 3 days, then nothing....then I was 11 or 12 days late for my period after it was due and had heavy bleeding for a day or 2 then it was light for a day or 2 after that.  Also when it was heavy, there were SMALL light colored chunks (skin colored/grayish) and some SMALL clots.   Does anyone think that i may be pregnant or had a miscarriage????  write me at crystrav1981 at live *******!  P.S.  I have been reading all of everybody's posts and i truly feel for you and wish the best and baby dust to you all!  (also been making me cry a lot)",
            "post_id": "5563514",
            "timestamp": "1271092006",
            "user_id": "user_1277678",
            "user_link": "/personal_pages/user/1277678",
            "votes": "0"
        },
        {
            "answer": "I am so out of it and forgetful all the time too, so i forgot to list my symptoms: frequent urinating, cravings and food turnoffs, weight gain (10 lb), some nausea, heartburn, constipation, gas, tighter belly, sleep disturbances (one night, my husband said i was snoring and moaning a lot; i have had these things happen only with pregnancy...usually i beat my husband up in my sleep tho); clumsiness and loss of balance, forgetfulness, brain fog, run out of energy fast, being sleepy at work, joint pain where my thigh connects to my pelvis, which is another pregnancy syptom i don't see mentioned above, and just \"feeling pregnant\"...i have not taken a hpt yet...i have one sitting in my bedroom, just waiting to be more sure that I might be pregnant because I am not too likely to be with the Tubes being tied and the way i've been bleeding and spotting makes me wonder if i had an early miscarriage...anyone have any ideas?  Would really appreciate it!",
            "post_id": "5563606",
            "timestamp": "1271093518",
            "user_id": "user_1277678",
            "user_link": "/personal_pages/user/1277678",
            "votes": "0"
        },
        {
            "answer": "VERY VERY EMOTIONAL!",
            "post_id": "5563620",
            "timestamp": "1271093654",
            "user_id": "user_1277678",
            "user_link": "/personal_pages/user/1277678",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied goin on 7yrs in July i want to have another baby is it possible 4 me to get prego and last month i had two perods and im on my perod again but i should of started in the middle of the month but i never had a perod 2 times in a month so is it possible to bleed and stil b pergo?how would i find out if my tubes have came untied and if they ever will?",
            "post_id": "5613284",
            "timestamp": "1272259173",
            "user_id": "user_1292753",
            "user_link": "/personal_pages/user/1292753",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied goin on 7yrs in July i want to have another baby is it possible 4 me to get prego and last month i had two perods and im on my perod again but i should of started in the middle of the month but i never had a perod 2 times in a month so is it possible to bleed and stil b pergo?how would i find out if my tubes have came untied and if they ever will?",
            "post_id": "5613293",
            "timestamp": "1272259547",
            "user_id": "user_1292753",
            "user_link": "/personal_pages/user/1292753",
            "votes": "0"
        },
        {
            "answer": "I had a tubal after my second csection 3 years ago now I'm a couple of days late on my period I haven't felt good for couple of weeks I've taken 2 pregnancy tests which were negative could I be pregnant I also ovulate every month about 2 weeks after my pregnant and I don't remember doing that this time I know it probably sounds bad but I always have cervical mucus that's how I know when I ovulate",
            "post_id": "5640057",
            "timestamp": "1272904574",
            "user_id": "user_1301527",
            "user_link": "/personal_pages/user/1301527",
            "votes": "0"
        },
        {
            "answer": "2 years ago i had my tubal ligation done after having my 4th child two weeks ago i found out im pregnant again i thought i was done having babies but i gess im not im actually not sureif i want to keep this babie and god knows i want too its just we cant afford to we have been thru hard times and i dont think we can handle another child im so upset over this situation im going thru bc thats y i had the ligation done so that i woudnt have to be going thru this i really feel bad and i know im going to have issues if i do not keep it so please can someone please let me know im not doing rong !!!!",
            "post_id": "5650613",
            "timestamp": "1273117130",
            "user_id": "user_1304799",
            "user_link": "/personal_pages/user/1304799",
            "votes": "0"
        },
        {
            "answer": "Missed 2 periods. Boobs sore. No sickness like other 2 kids. Been tied for 7 years. Negaitve results. Cant get in to obgyn till july next appt. Do u think i could be pregnant. And hormones levels are lower cause of maybe causei had blood disorder. Dk. Any ansers.***@****",
            "post_id": "5651748",
            "timestamp": "1273155258",
            "user_id": "user_1305217",
            "user_link": "/personal_pages/user/1305217",
            "votes": "0"
        },
        {
            "answer": "I had my tubes clipped almost 14yrs ago. I have 2 daughters and thought I was done at the time. The girls' father and I split 10yrs ago and I have not been really serious about anyone until now. I met a man that is amazing. He means everything, but I know he wants a baby and I feel like I will be taking that away from him if it's not possible with me. I love reading all of your stories. I have hope and inspiration now, and I think the whole purpose of leaving this comment is to feel connected to others, because there are times when we do need that, and to say thank you for sharing, and maybe ask for some prayers of hope and a miracle. Thank you! A.",
            "post_id": "5749749",
            "timestamp": "1275530499",
            "user_id": "user_1334313",
            "user_link": "/personal_pages/user/1334313",
            "votes": "0"
        },
        {
            "answer": "Well week 30 of my surprise pregnancy and all is well.  I am having my tubes removed this time but, my luck they'll grow back",
            "post_id": "5826354",
            "timestamp": "1277253218",
            "user_id": "user_1224014",
            "user_link": "/personal_pages/user/1224014",
            "votes": "0"
        },
        {
            "answer": "Can u still get pregnant after having 1 to 2 centimeters of ur tubes cut out? I'm always tired, tender breast and   moodiness but doesn't know if its possible. I had my tubes cut when. I had my 4 year old by c section. My period seems to be late by few days",
            "post_id": "5877697",
            "timestamp": "1278434759",
            "user_id": "user_1371321",
            "user_link": "/personal_pages/user/1371321",
            "votes": "0"
        },
        {
            "answer": "I had my tubes clamped Dec of last year after my 3rd child. I havent had my period for a month now, and I am usually very regular.....have only ever missed my period when pregnant!! I feel much more tired, breast are tender and im moody but not all the time!! I have taken 5 PT and all read negative. We have had a lot of stress recently with loss of jobs and 3 children ranging from 6years to 9 months....but my life hasnt really ever been \"stress free\".....anyways im wondering if someone could give me some insight!! I keep telling myself im pregnant but at the same time i just dont know!!",
            "post_id": "6069849",
            "timestamp": "1282790406",
            "user_id": "user_1425610",
            "user_link": "/personal_pages/user/1425610",
            "votes": "0"
        },
        {
            "answer": "I just was worried I had my tubes tied 3yrs ago and this month I had my period it ended on thurs and now last night being monday I started bleeding again I feel really bloated and tired I dont know what to think can be going on help plz",
            "post_id": "6116338",
            "timestamp": "1283910223",
            "user_id": "user_1438878",
            "user_link": "/personal_pages/user/1438878",
            "votes": "0"
        },
        {
            "answer": "i had my tubes tied in 2005 when i had my third baby... since then i divorced the father of my children and i am getting married to a wonderful man at the end of the year... i just had my period about August 27th however, now i am worried because my abdomen looks a little swollen i have a lot of heart burn and im always sleepy. my mother and mother in-law keep telling me im pregnant... does anyone know how long i should wait before I take a test? please help thanks",
            "post_id": "6116682",
            "timestamp": "1283917424",
            "user_id": "user_1438987",
            "user_link": "/personal_pages/user/1438987",
            "votes": "0"
        },
        {
            "answer": "Hi, I am Ashley, I am 27 have 3 kids, 2 boys soon to be 8 and 4, and a daughter 17 months old. I had a tubal, cut tied burned april 16th 2009 after haviing my 3rd c-section, My LMP was Aug 7 lasting 3 days and I am normally a 7-10 day woman,...here it is the Sep14th, and I am normally always on time. I am always sleeping evey chance I can get, my stomach seems like it has grown, im very moody, want to eat so much lately, gas, cramping, severe back pain, (which makes me think I will get my period any day now) I also have leaking of urine throughout the day, I cry for no reason...Idk if that because I am nervous about taking a HPT. ..when is the right amount of days to stop and take one. I dont want to go get one and it be negative and waste 10 dollars..ughhhhh woman get the hard job, men dont have to worry so much..",
            "post_id": "6139541",
            "timestamp": "1284476028",
            "user_id": "user_1445539",
            "user_link": "/personal_pages/user/1445539",
            "votes": "0"
        },
        {
            "answer": "I have a much different delima than anyone on here, I am kinda feeling like the crazy woman at the moment.  I am 25 yrs old.  I had my BTL 6 months ago.  I have had 1 period the entire time!  I have read on webmd that there is a condition called \"tubal litigation syndrome\".  This is where blood supply is cut off from your litigation to your ovaries that produce all the hormones that keep us kicking.  The ones that keep us all feeling normal, but I have experienced synthoms such as memory loss, soreness, tiredness, and of course the feeling of throwing up.  This being said, this is all the symthoms of being pre-menopausal!  Scarey as hell for me.  I am only 25.  I have 2 beautiful kids, both premes.  If I am pregnant, then I am deffinately scared for its life because my body can only hold a 19.5 inch baby. After they reach that point, they decide to come out, and no medication can stop them!  I hope its cuz I am menopausal!  Not pregnancy.  Either way, I am screwed.   And the Drs wont give me any answers.  He said to come back in when I have another painful attack.  Am I suppose to crawl in there?  He must be sick in the head!",
            "post_id": "6226976",
            "timestamp": "1286555524",
            "user_id": "user_1469049",
            "user_link": "/personal_pages/user/1469049",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied and burnt in 1995. I will be 38yrs old in Feb.  I think I may be pregnant. I had a light period that came 2weeks early this month. I think I would be around 9weeks not sure as I never keep a close track, did not think I needed to.  I have bloating, gas, stomach feels hard,  thought I had the flu last week, have headache off and on. I am normally a health person, and all of these symptoms I had with my second child, now 14yrs. I never had morning sickness with either of my kids and very few complications other than feeling full all the time and frequent urination which I now have started to experience.  I felt movement like a flutter on Monday and that was when it hit me. Could I be pregnant. My Husband had ask me the week before if I was and of course I said no how could I be had tubal.  Had very tender breast the past few weeks that I did think was odd but I have big breast, 38 DDD.  Never really see breast changes due to this.  I don't know if I should wait another month and see if anything changes or get a pregnancy test. Some of you said it did not read positive the first few times.  I don't need a baby at this point in my life, I now work full time and have a son going to collage next year and my youngest is 14yrs. We down sized our house a few years ago thinking it would be just the two of us in short order.  That being said I am not saying I don't want the baby. I would love one just not what I had planned. Now I have mixed emotions and don't know where to turn.  I always wanted more kids but knew we could not afford to give them everything.   I know that in my heart I would love to have a baby but the worry of having one at 38yrs old. I mean I will be 39 and my husband just turned 40 last month.  Any suggestion or thoughts would be helpful.",
            "post_id": "6250629",
            "timestamp": "1287149382",
            "user_id": "user_1475942",
            "user_link": "/personal_pages/user/1475942",
            "votes": "0"
        },
        {
            "answer": "i had my tubes tied/cut/clip/burned and now i regret it b/c i have a wonderful husband that i want a baby girl with we were also prophesied that we would have a baby after we got married. i have also prayed to God for this baby girl. i was also told by a nurse a my sons dr that she had here tubes tied/cut/clip/burned and she still had a baby girl. so im like the rest of you ladys that want a baby after ten(10) years i want my little baby girl soon. IF IT GODS WILL IT WILL HAPPEN FOR US GOD KNOWS WHATS BEST FOR US!!!",
            "post_id": "6288994",
            "timestamp": "1288108914",
            "user_id": "user_1487346",
            "user_link": "/personal_pages/user/1487346",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tied 10 years ago and currently going thru a divorce from my husband. I met a man and now I think I am pregnant, as I have tender breast, no missed periods yet, slight pain in my lower stomache area.  I do feel tired occassionally, no sickness, just this feeling since I have a hardness in my lower extremeites.  I had flu like symtoms.  I have discussed with co-workers and they are like 'you are not pregnant'.  So I am at a loss at this time since I thought when your tubes get tied you are done having children, despite the chances. I have never even heard of this happening until I have read all of the posted comments and am amazed by them.  Women is this really possible. Really.",
            "post_id": "6318047",
            "timestamp": "1288813170",
            "user_id": "user_1495631",
            "user_link": "/personal_pages/user/1495631",
            "votes": "0"
        },
        {
            "answer": "I am thirty six and had my tubes tied and burned almost 10 years ago.  I had a very light short period last month.  Since then have all signs of being pregnant that I did with my other three children, but now my breast are producing Colostrum. I took two home test that came out with no result.   My friends say that I took the test too soon and that I need to wait a few more weeks.  My husband and I would be very happy if I was pregnant again, but due to previous miscarriages I am scared, and want to know as soon as possible.  Would like advice from anyone who has been where I am now.",
            "post_id": "6352613",
            "timestamp": "1289680886",
            "user_id": "user_1505830",
            "user_link": "/personal_pages/user/1505830",
            "votes": "0"
        },
        {
            "answer": "I am 40 yrs old and will be 41 next month. Last Tues. as I was sitting in the tub I watched as my stomach started doing waves. I said no way, so I checked my breast and had a discharge like milk as I had in the past with my 4 other children. Now I'm worried, I took 2 hpt and went to the doctors office and took the blood test and everything is negative. Now mind you I had a tubal that I was told was a perminent proseedure done 12 yrs ago. Could it be that because I was on my cycle at the time that the test were performed could cause a negative result or what could this be. My family doctor said it's probably gas, but I know the difference. I have had heartburn out of this world and my stomach is not hard at the bottom it's huge at the top right under my breast to right at waist line. the most confusing thing to me is I feel pregnant but with all my other pegnancys when I missed my cycle I knew I was prego. This movement in my stomach has been happening on a daily basis for a month now and in the beggining I did just chalk it up to gas till I saw the milky substance and the waves and I know it's not gas I know what my body feels and I also have alot of swelling going on in the legs and feet even my hands and don't talk about the urge to pee all the time and the headaches and being tired. Anybody out there with advice that might help I'm open to hear them. Thanks again!!",
            "post_id": "6424899",
            "timestamp": "1291613520",
            "user_id": "user_1522777",
            "user_link": "/personal_pages/user/1522777",
            "votes": "0"
        },
        {
            "answer": "I had a postpartum tubal ligation, Nov 25, 1981.  They removed a portion of each of my tubes, then cartarized them (this is a 3-5 chance of 1,000 of ever getting pregnant).  I was really pushed into having it done, by my family and my doctor, from the time I found out I was pregnant with my 3rd child, at the age of 21, so I did it.  Back then it was kind of taboo to have more than 2 kids.  I had gotten pregnant on the pill.  I later became very depressed since I had always wanted a little girl, and had 3 sons.  I prayed secretly about it, and I was pregnant, by the time my 3rd son was 6 months old, with triplets, of course.  The doctor would not even see me for an appt, at first,but I had,what I thought were flu-like symptoms for 3 weeks.  I finally got an over the counter preg. test, and it was positive.  Finally my OB-GYN doc would give me an appt.  He was so upset he ordered another preg. test and an unltrasound at the same time, until I reminded him that I would have to empty my bladder for the preg, test, and needed it full for the ultrasound.  At my 5th month, I had another ultrasound, and there was only 1 baby.  They said my body had just absorbed the 2 fetus that were weak.  Guess what I had a little girl.  Not long after her birth we divorced due to him trying to kill me, and raised 4 children alone for 17+ years.  She is now 28 with her first little girl.  I am convenced that God granted me my request.  I later had some problems and had to have a hysterectomy at 27.  So have faith and if it is God's will, it will be done.  Everytime life has been hard, and it certainly has,  I remember that God is real, and there for me, everytime I think of my sweet daughter.",
            "post_id": "6517013",
            "timestamp": "1294297474",
            "user_id": "user_1553914",
            "user_link": "/personal_pages/user/1553914",
            "votes": "0"
        },
        {
            "answer": "I had a tubal ligation Feb 09 and thought everything was great now were are in 2011 and I have yet to start my period twelve days late and scared as hell. My breasts are tender and no cramps just the same as if I was pregnant. Pregnancy test came back negative, yet it also came back negative with my second and wow. That child was planned. but the fifth not so much. I need some advice. Scared yet somewhat antsy. I like my routine in life, really don't like change, but can adapt. My husband has no idea yet! LOL.",
            "post_id": "6523968",
            "timestamp": "1294457840",
            "user_id": "user_1555923",
            "user_link": "/personal_pages/user/1555923",
            "votes": "0"
        },
        {
            "answer": "I also forgot to mention that my cup size has gone up from a B to a C cup a very large C cup I have also gained a few pounds fifteen to be exact. (i like to blame that on quitting smoking in Oct 10) but holy hannnah, I feel as if I am but I really need to know eh! I have also had a cervical cancer scare this summer and finally came out negative and maybe it is hope that I can still create or maybe it is just peri-menopausal crap.  Don't really know what to say or do at this point until I have my period or a baby, I would be happy either way.If you all have anything to tell me please do, really don't know what to expect! Looking for an answer. Hoping someone can give me a good one or something I really need to hear, (I guess eh!)",
            "post_id": "6524044",
            "timestamp": "1294459456",
            "user_id": "user_1555923",
            "user_link": "/personal_pages/user/1555923",
            "votes": "0"
        },
        {
            "answer": "I got my tubes tied and burnt about 4 years ago. Now that I am about to be married we would like to have another baby. Can anyone give me advise on how to get pregnant or if its even possible.",
            "post_id": "6531463",
            "timestamp": "1294681080",
            "user_id": "user_1558406",
            "user_link": "/personal_pages/user/1558406",
            "votes": "0"
        },
        {
            "answer": "I had my TL in 2001 after my 4th child. I had 3 wonderful girls with my ex, then after I married my current hubby I became pregnant and ended up having a c-sec. and a son. So while they were in there I asked them to tie my tubes. The doctor told me that she burned them an made the sides look like tea cup handles. Well now I am weeks away from turning 40 and I have  bad cramping in my left side,my breast hurt and I have BAD heartburn. Im not late my period is not due for a week,and its always on time. The last time that pamprin didnt work for my cramps I was pregnant, also the last time that i had heartburn like this. Can it happen?",
            "post_id": "6579753",
            "timestamp": "1295928943",
            "user_id": "user_1574111",
            "user_link": "/personal_pages/user/1574111",
            "votes": "0"
        },
        {
            "answer": "Hi there..I'm a 38 year old, mother of 2 boys...Reading everyone's replies about having babies after a tubal ligation is really giving me a ton of encouragement. See almost 10 years ago I had my tubes done during my C-section with my son who was born 1-31-01..But my last \"normal\"  period was on Oct. 6th.... I got what I thought was going to be my next cycle early. on Nov. 1st. but that started completely different... really light and only lasted about 21/2 days... in both Dec and Jan I started bleeding around the 7th and 8th which was normal cycle time for me.. but again the bleed was different.. lighter and only lasted about 3 to 4 days... other than my typical 5 to 7.Ever since mid Nov. I've been experiencing typical pregnancy symptoms..  Like fatigue, enlarged and sometimes painful breast, frequent urination, some nausea  in Nov and Dec but nothing now. ( I only had morning sickness with my other 2 pregnancies in the first month also. ) My abdomen is also getting bigger and I've gained some weight.My problem is I haven't gotten a positive HTP yet. the last one I took was in mid Dec. I have no insurance and no Drs. will even see me once they find out I've had a TL and neg. tests. I even think I feel movement already .. I can't get a blood test done without a drs. order ... I'm at a loss here I mean I guess  I just have to wait and see what happens. but if I'm pregnant I'd like to get pre-natal care.  and without proof other than what I'm feeling... It's impossible.  Any suggestions are appreciated..Thank You.. Colleen",
            "post_id": "6581742",
            "timestamp": "1295985066",
            "user_id": "user_1574730",
            "user_link": "/personal_pages/user/1574730",
            "votes": "0"
        },
        {
            "answer": "I find this to be a little crazy...I had my TL 11-03-2007 after my second son was born C-Sectoin...I am the most normal of normal period girls!! I was supposed to start on the 17th of this month...here we are it's the 23rd...Little worried really don't want it to be a tubal pregnancy...Now the boys father and I separated not long after my second son was born...about 4 months after I kicked him out...I met the man of my dreams!! Now we are married and he has no children of his own (finding that i see this often in your stories)I don't well won't get my hopes up...but I sure hope that God has answered my prayers for this!!",
            "post_id": "6761294",
            "timestamp": "1300907017",
            "user_id": "user_1643434",
            "user_link": "/personal_pages/user/1643434",
            "votes": "0"
        },
        {
            "answer": "We are in the same boat in the same time frame this year. I got my tubal done with my second c-section december 27, 2002. I do not know how it was done, but I'm starting to guess most drs. are doing clamps? Well, low and behold I was supposed to start my period this month, I had forgotten the exact date, last month it was somewhere between the 16th and 19th and I am not one to be late myself, only maybe one day or just plain a day or two early. I AM LATE!! It is now the 25th!!! I had figured out I had started my last period atleast by the 19th, well, the latest I should've started by any means would've been the 23rd, giving some way for 28 days in february. I usually have a period for about 6-8 days on average so I do know myself pretty darn well. I started having really sore breasts like I would the week I was expecting to start (this is why I say I should've started the 19th!), then two days later they weren't as sore but they're still sore and my areola has gotten a tad darker from being light colored, my nipples are tender and get erect which is abnormal unless I'm cold or in the shower, etc., I am gassy, have had cravings, almost thru up in the walmart food section yesterday just from the smell, I'm more tired than usual, not moody just seem very chipper lol, I'm peeing alot and even made sure to get a urine test done to make sure there is no infection and don't know why they didn't do a pg test, I took two pg tests a couple days ago that were negative. I AM FREAKING OUT!!! Lol, I won't be upset either way because I am an adult and if it is to be it will, I can't hate a child or myself because nature wants its way, just worried it may be eptopic or that I might just have a tumor or cysts or something worse. I wish the best of luck to you. I am planning to have my fiance' of the past year take me to the hospital today because I have had one hectic week worrying.",
            "post_id": "6766148",
            "timestamp": "1301049058",
            "user_id": "user_1644910",
            "user_link": "/personal_pages/user/1644910",
            "votes": "0"
        },
        {
            "answer": "I had a tubal ligation 3yrs ago but iam havin every sign showin pregnancy but my 2 tests I have takin came out neg. Iam cravin foods like crazy always exhausted my tummy is pokin out like it did when I was pregnant with my 3 babies im moody my periods r normally heavy & last 5-7 days but my last 2 have been extremely light & only 3 days long. Plus iam constantly wantin 2 have sex its pretty much like I crave it all day long like b4 when I was pregnant. Im so confused. I just feel like iam pregnant. Wats the chances of me bein pregnant.",
            "post_id": "6785676",
            "timestamp": "1301604561",
            "user_id": "user_1650925",
            "user_link": "/personal_pages/user/1650925",
            "votes": "0"
        },
        {
            "answer": "Had coils put in about a year or so my question s can you still get pregnant?I have all the signs plus havent started period for 2months.  Has anyone ever got pregnant after having this done?",
            "post_id": "6797475",
            "timestamp": "1301974388",
            "user_id": "user_1654523",
            "user_link": "/personal_pages/user/1654523",
            "votes": "0"
        },
        {
            "answer": "I had my tubal ligation 7 years ago and for the past 4-6 months my menstrual starts at an earlier date. I also have pain during my menstrual now. A few nights ago I woke up to feeling fullness in my breast and couldnt sleep. Now my breast are very sore and look bigger! I dont know what this may be,can someone give me advice?",
            "post_id": "6834104",
            "timestamp": "1303090296",
            "user_id": "user_1665118",
            "user_link": "/personal_pages/user/1665118",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied almost 3 years ago.  I haven't had a period for the past 2 months.  My breasts have been sore (and appear bigger), I've been moody, crapping, hungry but throwing-up and constant nausea for the past 2 weeksed.  I've gained a bit of weight in the last few months and my energy levels are way down.  I'm being told that there is no way I'm prego... BUT????? IDK.... Anyone out there know what I'm going through?",
            "post_id": "6847539",
            "timestamp": "1303487317",
            "user_id": "user_1668930",
            "user_link": "/personal_pages/user/1668930",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tied almost four yeas ago and for awhile now  have felt a little different craveings and these werid movements in my stomace but i have a period and to i have pains on the sides of my stomachmaybe my overies does anyone know what this could be??????",
            "post_id": "6869780",
            "timestamp": "1304210722",
            "user_id": "user_1675137",
            "user_link": "/personal_pages/user/1675137",
            "votes": "0"
        },
        {
            "answer": "Ok so like I stated above I had a tubial ligation done 3 yrs ago well from feb 2 mar my periods were abnormal lastin only 3 days nstead of my normal 5-7 days & extremely light nstead of a heavy flow like normal but then here comes april & absolutely no period iam currently 9days late & out of all these 3yrs with my tubes tied I have NEVER missed a period or been late. Im havin every single sign of bein pregnant cravings exhausted all the time peein more frequently breasts tender & gettin bigger had gained 18lbs n the last 2 months belly pokin out more & more BUT I have takin 5hpt tests & 1 blood test & all have been negative. I recently had a dr appt & my dr drew blood 2 make sure my liver kidneys & thyroid were workin correctly everything came out perfect except my rbc & wbc she explained that cause iam a smoker my rbc was only high cuz they r workin harder 2 produce more oxygen 2 my body but never explained y my wbc was high then a week later I had another dr appt where they drew more blood 2 test 4 pregnancy well all of a sudden my rbc & wbc were perfect they werent high at all every ounce of my body is screamin that im pregnant & my dr wont do an ultrasound until I miss a 2nd period. If iam pregnant this will b my 4th baby & will b a blessin cuz everyday I regret ever havin this procedure done. Im just confused cuz all my tests keep comin out negative I just wanna kno wats goin on with my body I NEVER missed my periods unless I was pregnant",
            "post_id": "6872745",
            "timestamp": "1304326213",
            "user_id": "user_1650925",
            "user_link": "/personal_pages/user/1650925",
            "votes": "0"
        },
        {
            "answer": "Ok so like I stated above I had a tubial ligation done 3 yrs ago well from feb 2 mar my periods were abnormal lastin only 3 days nstead of my normal 5-7 days & extremely light nstead of a heavy flow like normal but then here comes april & absolutely no period iam currently 9days late & out of all these 3yrs with my tubes tied I have NEVER missed a period or been late. Im havin every single sign of bein pregnant cravings exhausted all the time peein more frequently breasts tender & gettin bigger had gained 18lbs n the last 2 months belly pokin out more & more BUT I have takin 5hpt tests & 1 blood test & all have been negative. I recently had a dr appt & my dr drew blood 2 make sure my liver kidneys & thyroid were workin correctly everything came out perfect except my rbc & wbc she explained that cause iam a smoker my rbc was only high cuz they r workin harder 2 produce more oxygen 2 my body but never explained y my wbc was high then a week later I had another dr appt where they drew more blood 2 test 4 pregnancy well all of a sudden my rbc & wbc were perfect they werent high at all every ounce of my body is screamin that im pregnant & my dr wont do an ultrasound until I miss a 2nd period. If iam pregnant this will b my 4th baby & will b a blessin cuz everyday I regret ever havin this procedure done. Im just confused cuz all my tests keep comin out negative I just wanna kno wats goin on with my body I NEVER missed my periods unless I was pregnant",
            "post_id": "6872746",
            "timestamp": "1304326230",
            "user_id": "user_1650925",
            "user_link": "/personal_pages/user/1650925",
            "votes": "0"
        },
        {
            "answer": "Hi, May 26,2011I'm a little confused. Had a tubal 4-7-04 and I've never missed a period. I had my last period March 16 then had small brown spotting(only when i wiped) for 2-3 days app. 1 week ago. Still no regular period, however breasts are slightly bigger, tired, constipated, one breast has little seapage, weird food cravings,ect. I am 31 and ONLY time i've ever had these problems i was pregnant, however 2 wks ago took hp test and it was neg. Also have discomfort in lower abdomen as if i'm about to start period!?!?I also feel if the good Lord meant for it to be, then it is a blessing!",
            "post_id": "6937861",
            "timestamp": "1306432623",
            "user_id": "user_1695271",
            "user_link": "/personal_pages/user/1695271",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied after my last child was born on 11/22/2006 my last period was on 5/16/2011 I'm having really bad headaches and sleeping a lot could I b pregnant....",
            "post_id": "7018009",
            "timestamp": "1309050194",
            "user_id": "user_1718310",
            "user_link": "/personal_pages/user/1718310",
            "votes": "0"
        },
        {
            "answer": "I had a TL done 10/13/10 after having my 6th baby!  I havent had a period in over two mths just some spotting for maybe 2 days.  I took a home pregna. test it was negi.  I went to the dr. had a blood test done it was negi too and had all my hormone levels checked to rule out early menopause. Everything was normal.  Thats been almost a mth ago.  Having all the symptoms of pregna.  It sounds crazy but I want another baby. Praying God will bless us with another one!!!  Gonna take another PT in a couple of weeks. (fingerscrossed)",
            "post_id": "7088651",
            "timestamp": "1311362570",
            "user_id": "user_1745131",
            "user_link": "/personal_pages/user/1745131",
            "votes": "0"
        },
        {
            "answer": "im a mother of 3 lovely kids iv nt long turned 28 n i long for another child after having my 3rd by c section i was sterilised n iv recently been having symptoms of pregnancy which doctor is sayin is flu ?? and they never did a test to check im wondering if miracles happen ?? can some1 help!!!",
            "post_id": "7125983",
            "timestamp": "1312569227",
            "user_id": "user_1756430",
            "user_link": "/personal_pages/user/1756430",
            "votes": "0"
        },
        {
            "answer": "Hi, Even though you wrote your message in 2007 and its now 2011, I have only just seen and would like to know how your pregnancy went and was everything ok.",
            "post_id": "7135025",
            "timestamp": "1312890043",
            "user_id": "user_1758925",
            "user_link": "/personal_pages/user/1758925",
            "votes": "0"
        },
        {
            "answer": "3 yrs ago i had my tubes cut tyed and buned after baby #3.i hav had mood swings,breast tenderness and inlargment,swollen feet,nausenes,irritability,and tired all the time for 2 months now.last month my period was a week late with horrible cramps this month 3 days late i hav always been all tim with no changes till now all hom test hav been neg.any explanation or ideas whats going on with me im 26yrs old.help?",
            "post_id": "7154019",
            "timestamp": "1313465212",
            "user_id": "user_1763968",
            "user_link": "/personal_pages/user/1763968",
            "votes": "0"
        },
        {
            "answer": "Has anyone ever heard of someone becoming pregnant when both the woman AND the man have been fixed? I've had 5 babies and cannot afford nor do I want to have any more children... that is why we chose to get the ligation and vasectomy done obviously! I'm a week late on my period however and I guess I'm just scared. Can it happen??!",
            "post_id": "7155400",
            "timestamp": "1313513688",
            "user_id": "user_1764562",
            "user_link": "/personal_pages/user/1764562",
            "votes": "0"
        },
        {
            "answer": "A woman is 37 years old she had 2 children, in 1994 she had a operation not to have children that is almost 17years. Know can she become pregnent",
            "post_id": "7173013",
            "timestamp": "1314046112",
            "user_id": "user_1771293",
            "user_link": "/personal_pages/user/1771293",
            "votes": "0"
        },
        {
            "answer": "Im a 31 y/o mother of 6. I had a TL done after my twin girls were born 6/24/09. Three months ago, I had a heaviness feeling in my abdomin along with pressure. I called the doctor and they have told me my muscles in my uterus are stretched from all the kids i had. My lmp two months ago came a week early started getting really bad headaches, dizzy spells. I was thinking of how i felt while i was pregnant with my twins and thought to myself this is how i felt pregnant. SO i waited to see how my period was this month and i came 4 days late and lasted 2 days. I made dinner and just out of the blue i got really nauseated from the smell. My belly is getting bigger, i have really bad back aches, sore breasts, very tired, and getting more nauseated. I broke down last night and bought two tests.The first test i thought was neg but later that night i seen what looked like a faint line in the positive so i retested this morning and i got a plus sign. Im worried to tell my husband that we are expecting  our 7th child. Everyone was telling me you cant get pregnant after having a TL well i guess i proved eveyone wrong on that note. Now to make a drs appt. Very nervous to do that. I am so excited for this and to all the women out there wanting another baby after a TL just keep praying and keep in mind that it can happen and it is happening more and more. If its meant to be it will happen",
            "post_id": "7178918",
            "timestamp": "1314207168",
            "user_id": "user_1773853",
            "user_link": "/personal_pages/user/1773853",
            "votes": "0"
        },
        {
            "answer": "Please help!!!! I 34 year and I had my tube tired in November 2007. Since then i have never skip a period or been late. I am now 5 days lates. i need advice. is there a possiblity of me pregnant. please someone, some advice",
            "post_id": "7181034",
            "timestamp": "1314266308",
            "user_id": "user_1774914",
            "user_link": "/personal_pages/user/1774914",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied 19 years ago and I'm late tied and hungry all the time and feel like my tummy as grown is it really possible I could be pg?",
            "post_id": "7182587",
            "timestamp": "1314302516",
            "user_id": "user_1775515",
            "user_link": "/personal_pages/user/1775515",
            "votes": "0"
        },
        {
            "answer": "I had my tl done 21 years ago and I am now 48 years of age. The last three months my period has been irregular. I feel nausa when I dont eat, gas, constipation, tender breast, I feel bubbles in my lower stomach. I have had two home test and they both where negative; but I have never had a postive test with home test and the blood test is negative. I know my body and I feel pregnant. In three months I have picked up 15 pounds and I have not change my eatting habits. At first I thought I was going through the change; but menpause does not cause fluttering in the lower part of you stomach. Do anyone have any suggestion???",
            "post_id": "7188727",
            "timestamp": "1314485772",
            "user_id": "user_1778288",
            "user_link": "/personal_pages/user/1778288",
            "votes": "0"
        },
        {
            "answer": "I had a TL at age 23 11/09. Every month, it seems like I have pregnancy symptoms;  super swollen tender breasts, nausea, fatigue, pee more etc. This month seems to have an added symptom; light pink discharge 1 week after ovulation/1 week before period due. Right after I had the discharge, my breasts are now swollen, pee so much its annoying, dizzy/light headed, stabbing like pains in pelvis and extreme thirst. I think having tubals done just screws up out bodies to the extreme.",
            "post_id": "7191906",
            "timestamp": "1314599753",
            "user_id": "user_1780188",
            "user_link": "/personal_pages/user/1780188",
            "votes": "0"
        },
        {
            "answer": "Something here my body is acting pregnant pts neg but breast are still growing. HELP",
            "post_id": "7195531",
            "timestamp": "1314712470",
            "user_id": "user_1782071",
            "user_link": "/personal_pages/user/1782071",
            "votes": "0"
        },
        {
            "answer": "I had a tubal 10 years ago after my third child.. one clamped and one clamped and burnt.. My last period was July 31 It is now September 1.. so I am 6 days late.. I have never been late for a period except when I was pregnant with my children.. I have every sign of pregnancy.. Headaches, nausea, low back pain, hip pain, acid reflux, and tired. I took a couple dollar store tests, and a couple first response and all were neg.. my boyfriend wants me to go to the doctor but I dont have insurance and dont want to look stupid.. So Im not sure what Im going to do yet.. I will update..",
            "post_id": "7202109",
            "timestamp": "1314885690",
            "user_id": "user_1785037",
            "user_link": "/personal_pages/user/1785037",
            "votes": "0"
        },
        {
            "answer": "I am almost 32 yrs old and havent had my period since july 23rd...took pregnancy test at home and it came out negative...i feel crappy...like im pregnant! Should I test again or just go see a dr...I had my tubal ligation 8 yrs ago!",
            "post_id": "7202948",
            "timestamp": "1314902087",
            "user_id": "user_1785355",
            "user_link": "/personal_pages/user/1785355",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied 3 yrs ago. I spoted this period and I'm puking everyday food makes me sick and I crave weird things. I'm scared and really don't want to waste money on a test. Do you think its possible for me? They said it couldn't happen.",
            "post_id": "7205998",
            "timestamp": "1314986692",
            "user_id": "user_1786713",
            "user_link": "/personal_pages/user/1786713",
            "votes": "0"
        },
        {
            "answer": "I got my tubes tied over a year ago and my period is 7 days late is it possible that I could be pregnant I have had. Symptoms of pregnancy but I would like to know if it is at all possible",
            "post_id": "7219638",
            "timestamp": "1315421855",
            "user_id": "user_1793761",
            "user_link": "/personal_pages/user/1793761",
            "votes": "0"
        },
        {
            "answer": "hi everyone i had my tubes tied 2007 daughter is four years old have all da pregnancy symptoms no period since july 26 august start spotting a day before it was due have taken hpts all negative havent taken a blood test i think dats wat i need or a sonogram or something not understanding wats going on could i be pregnant cause da doctors dont seem to know wats going on could someone help",
            "post_id": "7219704",
            "timestamp": "1315423134",
            "user_id": "user_1778284",
            "user_link": "/personal_pages/user/1778284",
            "votes": "0"
        },
        {
            "answer": "I had my tubes cut and cauterized 31/2 years ago and am currently 41/2 weeks pregnant for the second time since having them cauterized. I miscarried the first time and am praying everything is ok this time.",
            "post_id": "7229874",
            "timestamp": "1315746226",
            "user_id": "user_1798765",
            "user_link": "/personal_pages/user/1798765",
            "votes": "0"
        },
        {
            "answer": "I had my tubes clipped tied and burnt on november of 2001 and i missed my period for september and took a home pregnancy test it was positive couldnt believe it went to health department and found out that i am six weeks pregnant",
            "post_id": "7237372",
            "timestamp": "1315952077",
            "user_id": "user_1802359",
            "user_link": "/personal_pages/user/1802359",
            "votes": "0"
        },
        {
            "answer": "How did they find out you was pregnant? I have been having symptoms of being pregnant and have also taken several pregnancy test. All have been negative. Went to the walk in clinic and they also did a pregnancy test. That was also negative. Wondering if I should  have had a blood test or ultrasound. This wondering whats wrong with me is driving me crazy. My daughter who is 18 thinks that I am prego. My son who is 12 is hoping that I am. I am too. Would love to have another child even at my age of 43.Please help",
            "post_id": "7243451",
            "timestamp": "1316118572",
            "user_id": "user_1804524",
            "user_link": "/personal_pages/user/1804524",
            "votes": "0"
        },
        {
            "answer": "I went to my doctor and he has has set up an appointment for me to have an ultrasound. I am having this done Wednesday the 28th. I will let you all know what I find out. Praying it's good news.",
            "post_id": "7264000",
            "timestamp": "1316780176",
            "user_id": "user_1804524",
            "user_link": "/personal_pages/user/1804524",
            "votes": "0"
        },
        {
            "answer": "I am a mother of 4. Had my tubes tied during a c-section with my son in Nov 2005. Just recently married in September. My period is late and I feel all the signs as the previous pregnancies. I have NEVER missed a period as much as I wished I had! I took a hpt....negative. Not sure what to do next??? Waiting can be detrimental to a normal, healthy pregnancy. And there is already risk of it not be normal.No insurance. But we all know the E.R. can not refuse a patient care. Maybe thats my only option in finding out. I know my body! The fatigue, tiredness, the pain in my pelvic area and lower back, the early cravings & hunger, the tender breast & the sex drive :)!!!! The success stories are very helpful in giving much needed hope. Pls continue to share and give advice! I will keep you posted! Be Blessed!",
            "post_id": "7297579",
            "timestamp": "1317841558",
            "user_id": "user_1829565",
            "user_link": "/personal_pages/user/1829565",
            "votes": "0"
        },
        {
            "answer": "I am 39 years old, divorced with three incredible children. 12,10, and 7. I like so many of you had my tubes tied 5/12/04, and I am regretting this horrible decision. Now, I am with a incredible man who loves us but wants a child of his own. So, I am holding out hope, I spoke with my OB/GYN last year about this. He told me that he has had women come into his office 8-10 years after their TL's pregnant. Its rare but it happens, so lets hope and pray that this happens for all of us as well. Till then I am I am following my ovulation and praying that we get our miracle too.",
            "post_id": "7314105",
            "timestamp": "1318361191",
            "user_id": "user_1836851",
            "user_link": "/personal_pages/user/1836851",
            "votes": "0"
        },
        {
            "answer": "My period 3days late my tubes are tied I took a home test but it was negative can I be pregnant my cycle always on time now late",
            "post_id": "7314876",
            "timestamp": "1318377580",
            "user_id": "user_1837151",
            "user_link": "/personal_pages/user/1837151",
            "votes": "0"
        },
        {
            "answer": "Well got my results from the Ultrasound.But my husband and I both saw a crescent moon shaped thing.I have no idea what it was, cause they never explained what it was. When they called to tell me the results, they said everything was normal. If that's true, then what was the crescent shape we saw. I'm still having all the same pregnancy symptoms. So, I now have an appointment with the OB/GYN tomorrow. I hope I get some results this time. Babydust to all and good luck.",
            "post_id": "7317101",
            "timestamp": "1318443722",
            "user_id": "user_1804524",
            "user_link": "/personal_pages/user/1804524",
            "votes": "0"
        },
        {
            "answer": "hi kendra,i had tubal ligation 9 years ago,but my last few periods have been really short and light,i feel tired and dizzy and very moody,maybe its wishful thinking but im hoping im preganant,duno what to think!!!!",
            "post_id": "7321111",
            "timestamp": "1318540264",
            "user_id": "user_1470835",
            "user_link": "/personal_pages/user/1470835",
            "votes": "0"
        },
        {
            "answer": "Well I finally got some answers. I have Interstitial Cystitis. Which is sometimes referred to as Painful Bladder Syndrome (PBS) - is a long-term, yet treatable, inflammatory medical condition of the bladder wall. The doctor also thinks I may have Endometriosis. I also am having blood work to find what is causing the rest of my pregnancy like symptoms. I am scheduled for surgery October 31st to treat my I.C and Endometriosis. Hope this helps some of you. Pregnancy symptoms don't always mean your pregnant. It very well could be a medical condition causing your symptoms. Even though I would have prefered to have been pregnant. Even at my age of 43. But that wasn't the case. So you should definitely see your doctor. Explain all of the symptoms you are having. Good luck to you all.",
            "post_id": "7322859",
            "timestamp": "1318596467",
            "user_id": "user_1804524",
            "user_link": "/personal_pages/user/1804524",
            "votes": "0"
        },
        {
            "answer": "My story is alittle different. I am 28 years old and got my tubes cut and burnt 5 yrs ago after I had my one and only child. I have never really had regular periods, but in Sept of 2010 they had to remove a golf ball size cyst off of my left ovary. After that if starightened them out for a while up until a few months ago. But the whole 9 months I was pregnant with my son, I had a period, no major symptoms and for the first 4 months of my pregnancy Ikept getting negative test results. I was almost 3 months along when the dr did an ultrasound. I would like to have another child now that my son is in school. Does anyone have any suggestions? The dr's say itll cost me $2600 DOWN PAYMENT just to get a reversal started. I have state insurance so Im understanding that they wont cover a reversal unless its a medical emergancy. PLEASE HELP! I am open to anything.",
            "post_id": "7334245",
            "timestamp": "1318948619",
            "user_id": "user_1845586",
            "user_link": "/personal_pages/user/1845586",
            "votes": "0"
        },
        {
            "answer": "hello everyone my name is nicole,i had a tl done almost 6 years ago and now feeling signs of a pregnancy i have taken hpt's they were neg.and went done a test at a clinic and that also came out negative.my period came but was off and on and very light,im experiencing symptoms like nausea,really tired,going to the bathroom alot and others.i am married to my wonderful husband we have kids together one is not his and 3 are his.we just now got finacially stable some what and i want another one the doctor did say there is a chance i can get pregnant and that my tubes can grow back but its very rare.i really want to have another one even tho i am young.any advice will help me out.if i am pregnant that will be a blessing as with my last child family and the man i was with at the time told me to have the tl done cause he didnt want anymore so i listened and now i regret it every single day as my kids want another brother or sister around",
            "post_id": "7339616",
            "timestamp": "1319088736",
            "user_id": "user_1847824",
            "user_link": "/personal_pages/user/1847824",
            "votes": "0"
        },
        {
            "answer": "i had a tubal done october 2009 and i am pregnant and scared don't know if its a tubal because the doctor's ultrasound can't detect where the fetus is.....blood work proved that i am indeed pregnant i guess i just gotta wait and see whats going on but the wait is very scary...wonder why they can't see anything...but oh yes u can get pregnant after tubal",
            "post_id": "7357483",
            "timestamp": "1319731278",
            "user_id": "user_1856648",
            "user_link": "/personal_pages/user/1856648",
            "votes": "0"
        },
        {
            "answer": "I am 35 I had a tl almost 10 years ago I am having some pregnancy symptoms but am unsure. It would be a blessing because 2 years after having the procedure I have regreted it. I am nervous about taking a home pregnancy tes yet know I really need to. My last cycle was in july and I had 2 within a short period of time. In August I spotted but nothing and have nothing since. I have brest tenderness fluttering feelings in the lower abdominal and out of the blue have had slight headaches with nausea and even having calstrom coming from both breast. I have heard and even witnessed pregnancies after TL however, I have also been told many hpt read negative even when pregnant any suggestions on how long I should wait before taking one to get accurate results?",
            "post_id": "7359322",
            "timestamp": "1319782417",
            "user_id": "user_1857944",
            "user_link": "/personal_pages/user/1857944",
            "votes": "0"
        },
        {
            "answer": "well blood levels are normal...doc believes baby is in uterus......whew....ima just keep praying so far so good.....tubes were burned 2 yrs ago  god can do anything",
            "post_id": "7361218",
            "timestamp": "1319844900",
            "user_id": "user_1856648",
            "user_link": "/personal_pages/user/1856648",
            "votes": "0"
        },
        {
            "answer": "I got my tubes tied in 2004. I have had regular periods ever since...no complications. I began dating another man with no kids.  As the rest of these stories have went...I am now over a week late and smells are making me want to throw up.  Im afraid and excited at once.  Getting a test after work today.  I wonder is there a higher chance of pregnancy with clamps than other methods",
            "post_id": "7387026",
            "timestamp": "1320693452",
            "user_id": "user_1881628",
            "user_link": "/personal_pages/user/1881628",
            "votes": "0"
        },
        {
            "answer": "I've had my tubes tied for almost 6 years! I been having nausea vomiting and even cravings! I'm scared to do a pregnancy test! What if I'm not!  What should I do???",
            "post_id": "7394694",
            "timestamp": "1320877839",
            "user_id": "user_1886191",
            "user_link": "/personal_pages/user/1886191",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied 9yrs ago. Starting in june I got my period on time then in july it was 11days late. August it came at end of the month. Sept it came end month so I figured that it was changing with me turning 30. Now its nov I didnt get it in oct. Now ifeel nausea sometime lower back pain pelvis pain nipples sore. Do yall think im pregnant im scared to go to dr took home test it was negative.",
            "post_id": "7401375",
            "timestamp": "1321059267",
            "user_id": "user_1890093",
            "user_link": "/personal_pages/user/1890093",
            "votes": "0"
        },
        {
            "answer": "helloi have no children after two years of marriage had an ectopic pregnancy operation in that my left fallopian tube got remove(around 4 months back) thn i had an light periods for 5days .since two months i have not came in periods can anyone suggest whats the problem ? what to do?",
            "post_id": "7403517",
            "timestamp": "1321128683",
            "user_id": "user_1891399",
            "user_link": "/personal_pages/user/1891399",
            "votes": "0"
        },
        {
            "answer": "Its has been six yearssince my tubes been tied I flutters in my stomach what does that mean",
            "post_id": "7406465",
            "timestamp": "1321217755",
            "user_id": "user_1893239",
            "user_link": "/personal_pages/user/1893239",
            "votes": "0"
        },
        {
            "answer": "I had a TL a little over 15 years ago and I am having the same symptoms as you. All my test (even blood) came back negative but I have fluttering in my uterus, and all the other symptoms you have. I am calling our local Family Planning here and getting a free ultrasound done so I can know for sure.",
            "post_id": "7410211",
            "timestamp": "1321314130",
            "user_id": "user_1895552",
            "user_link": "/personal_pages/user/1895552",
            "votes": "0"
        },
        {
            "answer": "hello   i am going through the same thing. my ex husband talked me into getting my tubes burnt.  @ yrs ago we are devorced now and i am remarried to a wonderful man. he has no children, but he excepts my as his own.  we would love to have a baby together.   but not really sure how to go about it.",
            "post_id": "7423081",
            "timestamp": "1321663819",
            "user_id": "user_1902884",
            "user_link": "/personal_pages/user/1902884",
            "votes": "0"
        },
        {
            "answer": "i had my tubes tied a little over a year ago now ive been getting a period 2 to 3 times a month and have been getting really nauseated and have been puking",
            "post_id": "7439879",
            "timestamp": "1322152222",
            "user_id": "user_1912198",
            "user_link": "/personal_pages/user/1912198",
            "votes": "0"
        },
        {
            "answer": "Hi, I've had similar symptoms. Had a tubal in 2001, have 2 teenagers 17 (almost 18) and 15. My period is regular, but was 2 weeks late then I had bleeding, not like my regular period. We all know how our regular cycle feels and \"smells\". Anyway, my temp had been up for weeks 99.5, today and past few days have been 98.6 - 97.9. The day the bleeding started I did have some clots and it started off light in color. But I still have \"symptoms\", hungry more often which is weird cuz I can go with eating 1x a day, increased smell sensitivity, nausea and m/c all times of the day, weird taste in my mouth.I've had negative pee sticks but I am going to have a beta test only because of my symptoms and the fact that post-tubals don't show up on urine tests properly.",
            "post_id": "7447118",
            "timestamp": "1322416636",
            "user_id": "user_1904181",
            "user_link": "/personal_pages/user/1904181",
            "votes": "0"
        },
        {
            "answer": "I took a test and it said postive october 27.. Had a ultra sound done and nothing.. Just the last two weeks my breast has been swollen and stomach cramps.. Well 23 of this month I spotted and had a whole lot of white creamy discharge and bad oder.. My breast or back normal and no stomach it just feels week.i also have bad acid reflux.. And im nauseated 12 hrs. A day but dont throw up just belch.. Someone plz help...",
            "post_id": "7455004",
            "timestamp": "1322620220",
            "user_id": "user_1920844",
            "user_link": "/personal_pages/user/1920844",
            "votes": "0"
        },
        {
            "answer": "Peace I had a tubal ligation 15years ago, been feeling sick , the dr. said I couldnt be pregnant and that its probably fibrois,  I had a ultra sound did to see if I had fibrois, it came back that I didnt. The dr. check me and said that my uterus is getting larger. I have another ultra on dec. 16, 2011, in about 2 weeks. Am I pregnant, I hope so, if I am ,im about 14weeks and I think I keep feeling something move in my stomach. Could it be, I hope so, what do you guys think it could be. Waiting and hoping that I am with child ( pregnant ).",
            "post_id": "7456707",
            "timestamp": "1322673715",
            "user_id": "user_1921729",
            "user_link": "/personal_pages/user/1921729",
            "votes": "0"
        },
        {
            "answer": "Well I had a tubal when I had my son 2 years ago, and tonight I got a positive pg test.  I was pg in Aug.  I was 8 days late then had terrible bleeding and cramping.  Sep and Oct were both normal, now I am four days late.  I am calling my dr. tomorrow to get an ultrasound to make sure the placement is not in my tubes.  I have two children, 5 and 2 and struggled with fertility issues with both of them, so this is terribly ironic to me.  But if it is GOD plan then so be it.",
            "post_id": "7462350",
            "timestamp": "1322803133",
            "user_id": "user_1924162",
            "user_link": "/personal_pages/user/1924162",
            "votes": "0"
        },
        {
            "answer": "I had a TL 18 months ago when I had my last daughter! My periods have been fine up until about 6 months ago and they started getting kinda random. Now the past four months i have only had two periods and both time I have gotten the worse headaches with them. I don't feel and symptoms of being pregnant but I just wanted to know if it is normal for ur period to just pretty much cut back after having the TL?",
            "post_id": "7462425",
            "timestamp": "1322805110",
            "user_id": "user_1924198",
            "user_link": "/personal_pages/user/1924198",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied in mid July 2010 after the c-section of my 4th child. Here it is December 4, 2011 and my last menstrual cycle was the first week of September 2011. I took two home pregnancy tests and left them on the sink in the bathroom only to return about twenty minutes later with a faint positive sign. I then read up on it saying that if it is left more than ten minutes then it could be a false positive from an evaporation line. My breasts feel hot and heavy, ive been eating food like crazy, having to urinate often, large increase of vaginal discharge, and ive been tired and moody. I can't really afford to go buy more pregnancy tests because they are so expensive! And I hate to go to the doctors office and look like a fool thinking that i'm pregnant after a tubal. I have been doing research on what a tubal pregnancy would look like and I don't have any of those symptoms, so I really don't know what to think. Any advice??",
            "post_id": "7468817",
            "timestamp": "1323020192",
            "user_id": "user_1927375",
            "user_link": "/personal_pages/user/1927375",
            "votes": "0"
        },
        {
            "answer": "hello any help is well appericatedI am a 29 married mother of 5 children and for the past couple of months my period have been very abnormal. I got the tubal clamp in 2007 after my daughter was born I recently went to the ER for the following sympthoms: sharp pain in my left side under my ribs, nausea and lighted headness when the dr touched the area I can also feel it in my lower back on the left side. Blood test was done so was urine and a cat scan and they could find no reason for this pain but sent me home with a nausea med and pain med and nothing seem to be working. I have noticed some weigh gain in the belly area and have also had some preg sympthoms altho test came back neg. Can anyone help me I really would like to know what is going on with my body. Thanks in advance",
            "post_id": "7470196",
            "timestamp": "1323058402",
            "user_id": "user_1928188",
            "user_link": "/personal_pages/user/1928188",
            "votes": "0"
        },
        {
            "answer": "I had my tubes cut and burnt 12 years ago and have only been really late once since then. My periods were out of wack for about the first 6 years but have been normal and now Im late. Im tired and my back hurts. My husband put the idea out there that I could be pregnant but I dont want to believe him. I have always wanted another child, but my girls are 14 and 12 now. Could it be possible? I have read the other posts on here and to me it sounds like it happens. If possible what test is best, urine or blood?",
            "post_id": "7488178",
            "timestamp": "1323584207",
            "user_id": "user_1936725",
            "user_link": "/personal_pages/user/1936725",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tides over 6 years ago. Towards the end of last month I had my period. A little over a week after that me and my new boyfirend slept together. Yesterday I started bleeding again. Now today there are no signs of my period. I am not sure what is happening with my body. Usually the first two days are extremely heavy flow of my period. But now Im showing no sign that Im on.........Im just confused cause this has never happened .....(sigh) someone please offer some advice..... maybe its nothing  also",
            "post_id": "7491676",
            "timestamp": "1323708670",
            "user_id": "user_1938562",
            "user_link": "/personal_pages/user/1938562",
            "votes": "0"
        },
        {
            "answer": "I had a tubal ligation 11yrs ago but my periods are irregular this past month it was a very light flow like spotting, tired a lot, weight gain, back pain, and feel thobbing sensations in abdominal area..could I be pregnant? Took 3 home test came out negative..",
            "post_id": "7507562",
            "timestamp": "1324185149",
            "user_id": "user_1945642",
            "user_link": "/personal_pages/user/1945642",
            "votes": "0"
        },
        {
            "answer": "It very well could  be premenopause....I have a period every 3-4 months...no spotting inbetween or anything....now 8 yrs after my TL I have been spotting a teeny bit...not bright blood like ya get at the end of your period...only a bit....im confused and hoping but not holding out.",
            "post_id": "7517002",
            "timestamp": "1324485232",
            "user_id": "user_1949976",
            "user_link": "/personal_pages/user/1949976",
            "votes": "0"
        },
        {
            "answer": "I had my tubes clamped almost eight years ago and endometrial ablation 6years ago went in for a normal female exam and was sent for pelvic u.s for possible systs on ovaries. There is a five mill something on my uterus they say either syst or baby. Have to go back in two weeks. So ill let ya know;-) I had my tubes tied at 21.  Big mistake and hope it is a healthy normal pregnancy it would be an answered prayer!",
            "post_id": "7521077",
            "timestamp": "1324604002",
            "user_id": "user_1951668",
            "user_link": "/personal_pages/user/1951668",
            "votes": "0"
        },
        {
            "answer": "I am 37 had tubes clamped 13years ago have not had a period since nov 2011 i am never late",
            "post_id": "7543327",
            "timestamp": "1325382059",
            "user_id": "user_1962683",
            "user_link": "/personal_pages/user/1962683",
            "votes": "0"
        },
        {
            "answer": "I had a tubal sterilization nov.20.2004 herei am now 7 years later woundering if I'm pregnant this is why I've always had my period every month now my last period was nov.25.2011 it lasted 4 days it's now Jan 2 2012 an no period I took one home pregancy test 3 days ago an it was negative. What could be wrong I do have a little symptoms of pregnancy!",
            "post_id": "7547942",
            "timestamp": "1325537653",
            "user_id": "user_1965283",
            "user_link": "/personal_pages/user/1965283",
            "votes": "0"
        },
        {
            "answer": "I had a tubal in 2007 after my 5th child was born.  All of my children were c section.  Now after all these years I am 3 weeks late.  I have not had a period since Nov 18th.  I thought.. this doesn't happen, I have nothing to worry about lol.. this isn't something you hear about very often, now that I have read this, I texted my husband to let him know I'm 3 weeks late and he's excited....  I don't understand men lol. I'm up in the air about the whole thing.  If we are pregnant again, then Yay!!  if I start my period, then Yay!!",
            "post_id": "7555437",
            "timestamp": "1325707793",
            "user_id": "user_1968886",
            "user_link": "/personal_pages/user/1968886",
            "votes": "0"
        },
        {
            "answer": "I am 25 I had my tubes tied on aughust 30 2010. Now I find out yesterday that I am 9 weeks pregnant. I call the doc who preformed my tubal ligation. She says she cut out a portion of the tubes clamped the remainder then burned the ends. Nature is crazy they reattached and now here comes baby #4. My husband is speechless. So am I.",
            "post_id": "7604180",
            "timestamp": "1326989643",
            "user_id": "user_1992980",
            "user_link": "/personal_pages/user/1992980",
            "votes": "0"
        },
        {
            "answer": "I am 25 I had my tubes burnt in 2010 my cycle was 1 week and 4 days late. I have 1 child and my cycle  came late with her and I didnt find out I was pregnant w her until I was 3 months.",
            "post_id": "7607627",
            "timestamp": "1327081651",
            "user_id": "user_1994534",
            "user_link": "/personal_pages/user/1994534",
            "votes": "0"
        },
        {
            "answer": "I am having the same symptoms as you I took a test this morning and it came back negative. I had my last child almost 11 years ago. I have been pregnant 3 times I know what it feels like. But they keep telling me no its not likely to be pregnant.",
            "post_id": "7616794",
            "timestamp": "1327355738",
            "user_id": "user_1999456",
            "user_link": "/personal_pages/user/1999456",
            "votes": "0"
        },
        {
            "answer": "That's exactly how my situation is. I had my tubal almost 11 years ago and I am having pregnancy symptoms. I took a HPT this morning and it came back negative. But everything I have read says that is normal, I talked to a friend this morning that is a PA and she says it not likely that I am pregnant but I feel that I am. My husband is total excited!!! He has names picked out and everything. I am like you if I am YAY!! If im not YAY!! Let me know how yours turns out.",
            "post_id": "7617012",
            "timestamp": "1327360548",
            "user_id": "user_1999456",
            "user_link": "/personal_pages/user/1999456",
            "votes": "0"
        },
        {
            "answer": "just wondering if anyone here had a healthy baby i had my tubal 5yrs ago and i feel like im pregnant i even have a light green fluid coming from by nipples and every sit iv been to say its normal its 2 days till my period so i was just going to get every ones input seeing im very tired all the time ,i feel sick to my stomach,i eat alot more than i normally do,and my boobs are sore,and im not cramping like i normally do before my period.so if anyone can pls help i would appreciate it",
            "post_id": "7620413",
            "timestamp": "1327448655",
            "user_id": "user_2001132",
            "user_link": "/personal_pages/user/2001132",
            "votes": "0"
        },
        {
            "answer": "just wondering if anyone here had a healthy baby i had my tubal 5yrs ago and i feel like im pregnant i even have a light green fluid coming from by nipples and every sit iv been to say its normal its 2 days till my period so i was just going to get every ones input seeing im very tired all the time ,i feel sick to my stomach,i eat alot more than i normally do,and my boobs are sore,and im not cramping like i normally do before my period.so if anyone can pls help i would appreciate it",
            "post_id": "7620445",
            "timestamp": "1327449182",
            "user_id": "user_2001132",
            "user_link": "/personal_pages/user/2001132",
            "votes": "0"
        },
        {
            "answer": "I am experiencing the same thing right now. I have taken one blood test and one HPT and they were both negative but I believe I am still. I haven't had any PMS symptoms which I normally do and I was suppose to start today and I have nothing and am never late and it starts like clock work.",
            "post_id": "7623895",
            "timestamp": "1327538367",
            "user_id": "user_1999456",
            "user_link": "/personal_pages/user/1999456",
            "votes": "0"
        },
        {
            "answer": "i am never late either and i took a hpt and it came back negative but i feel like i am but then im not sure if im going crazy lol my hubby is going to make me go take a blood test this week if i dont start soon let me know if you have any updates",
            "post_id": "7627250",
            "timestamp": "1327624803",
            "user_id": "user_2001132",
            "user_link": "/personal_pages/user/2001132",
            "votes": "0"
        },
        {
            "answer": "I facing a still birth last Jan 15 at 21weeks... its my 5th pregnancy but my 1st baby... my poor baby Aidan umbilical cord get twisted and stop the blood supply... due to healthy purpose i and hubby decided right away did the TL and its cut and burnt... now i worry after read all this comments... will i really have high risk of failure bcos do it during the c-sec...???I don't think i can go thru any pregnancy again and now i worry that what if...?? kindly share me what else kind of protection i can used to avoid un plan pregnancy... i worry this will make my relationship with hubby ruin... thanks in advance.. hugsss...Rachel",
            "post_id": "7646018",
            "timestamp": "1328160495",
            "user_id": "user_1935407",
            "user_link": "/personal_pages/user/1935407",
            "votes": "0"
        },
        {
            "answer": "Did she have her baby or did she loose it.I had my tubes done through my navel 19 years ago.I had them cinched is all.So I wonder if I have a chance of being pregnant.I have done a few pregnancy test all show negative.But I am over a week late on my monthly.I have been feeling tired alot and cry about everything.And have been eating alot more,and my breast get sore sometimes.",
            "post_id": "7667861",
            "timestamp": "1328805142",
            "user_id": "user_2024122",
            "user_link": "/personal_pages/user/2024122",
            "votes": "0"
        },
        {
            "answer": "It has been 11 years since I had a baby and my tubal done I also have hyperthyriodism im on methamizole for that I feel like I am pregnant but a test showed neg is it posible that I maybe pregnant? I am having light bleeding today n I feel weird ?",
            "post_id": "7673554",
            "timestamp": "1328971692",
            "user_id": "user_2026665",
            "user_link": "/personal_pages/user/2026665",
            "votes": "0"
        },
        {
            "answer": "hi all i had a normal period last month feb 2012.well i have not had one this month i took 3 HPT all neg whent to the hospital yesterday march 28th all they would do is a blood test witch was neg to.i had my tubes cute tied and burnt almost 14 years ago.what should i do?",
            "post_id": "7814678",
            "timestamp": "1333050605",
            "user_id": "user_2094609",
            "user_link": "/personal_pages/user/2094609",
            "votes": "0"
        },
        {
            "answer": "I will tell you, my neighbor became pregnant 12 years after having a tubal ligation.  Here son is now 9 years old.",
            "post_id": "7857875",
            "timestamp": "1334328298",
            "user_id": "user_2112633",
            "user_link": "/personal_pages/user/2112633",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tided aswell after my third child that was 5years ago but I have all the symptoms of being pregnant I don't knw what to do I've done test they are all negative. Can some give me advice what to do please",
            "post_id": "7860819",
            "timestamp": "1334411714",
            "user_id": "user_2113804",
            "user_link": "/personal_pages/user/2113804",
            "votes": "0"
        },
        {
            "answer": "I am 40 years old and am needing some advice. I had a tubaligation in December 2000 after delivering my fraternal twins via c-section. I am re-married now to a younger man and he has no children at all and really wants a biological child. I haven't had a period now in 2 months and have never been late unless I was pregnant. I have taken 3 home pregnancy tests and all were negative, however my breasts are very tender and I am having headaches all the time. Is there a possibility that I may be pregnant? I am not sure how my tubaligation was done, but it will be 12 years this December since I had it done. If anyone can offer me any advice I would greatly appreciate it. Thanks so much in advance.Michelle",
            "post_id": "7881184",
            "timestamp": "1334971248",
            "user_id": "user_2122038",
            "user_link": "/personal_pages/user/2122038",
            "votes": "0"
        },
        {
            "answer": "Had a tubal ligation back in 2008 after an emergency C-section with my daughter. After five pregnancies, miscarrying 3 children, and then the last two that made it ended up being high risk pregnancies...I was tired. And my doctor granted my request to have a tubal ligation. I am regretting it big time. My husband and I wanted at least one more child, and while I enjoy not having to be on birth control or remembering to use condoms, I hope beyond hope that I am one of those cases where I will be pregnant again. I can't go in for a reversal right now, but I have been having symptoms of tender breasts, feeling worn out more than normal as of late, and I had some cramping which I should not have had because my cycle had ended a week and a half before hand. Not to mention the fact, I popped a stitch on my bra the other day. It felt tighter than normal. And I have NEVER had this problem with this bra before. I'm keeping my fingers crossed. Now while it will suck being pregnant right now because I am renewing my vows in 8 weeks, and I have a wedding dress and everything that has been altered to fit my now slim figure, I am hopping that this new start with my husband, will be further blessed with a new little one. I took a hpt this morning, and a light half a line formed at the top of the \"base line\" of the test. I'm not sure if it is a defective test, or it is starting to pick up on pregnancy hormones. But, we will see.",
            "post_id": "7911231",
            "timestamp": "1335813635",
            "user_id": "user_2134235",
            "user_link": "/personal_pages/user/2134235",
            "votes": "0"
        },
        {
            "answer": "I had my tubes cut and tied the day after I delivered my son in 2004.I returned to the doctors 3mnths later with a knot in my abnomen and I swore it was moving! my doctors asured me it was impossible and home tests showed negative.They sent me to a surgen 2weeks later, who said it was a blockage due to constipation and  had me take a surgery prep kit to clean me out.I had been spotting for over a month now and aweek after the prep kit,I began to bleed,alot! I collapsed during Thanksgiving dinner and was rushed to the hospital.They ran blood tests and it came back positive for pregnancy.I passed out.long story short... I was 2and a half mnths pregnant in the tubes and the baby was trapped on the other side of the knot they tied.The tube had split and I had been bleeding internally for over a month.My organs were floating in blood when they went in to remove the fetus.They said my doctor had to leave the room during surgery,go across the hall and pray for me because he did not know how he could save my life,but he returned and finished the surgery along with a blood transfusion and I made it.God wasn't through with me yet and my doc says I trully am one in a million.But I know that I serve a Mighty God.Marti Osborne,TN",
            "post_id": "7933564",
            "timestamp": "1336437895",
            "user_id": "user_2149712",
            "user_link": "/personal_pages/user/2149712",
            "votes": "0"
        },
        {
            "answer": "Hello was just wondering if it was possible to get pregnant 5 months after tubal ligation?",
            "post_id": "7999864",
            "timestamp": "1338350954",
            "user_id": "user_2193474",
            "user_link": "/personal_pages/user/2193474",
            "votes": "0"
        },
        {
            "answer": "Does anyone know of any doctors that do tubal reversals in michigan??",
            "post_id": "7999900",
            "timestamp": "1338351479",
            "user_id": "user_2193474",
            "user_link": "/personal_pages/user/2193474",
            "votes": "0"
        },
        {
            "answer": "I am 42 had my tubes tied 17yrs ago... My mom had 10 kids and I knew I was fertile mertile..  My youngest is 21yrs old.  Expected my P a week ago..  Never been late, never had breast tenderness like I do now, and Lactating.  I am scared.  Still waiting longer before taking any tests.  Feels like pms, but been feeling this way for over 2wks.  Kids are a blessing, all of our kids are grown, very fertile, 15 grandkids.  Crazy.  Confused.",
            "post_id": "8043105",
            "timestamp": "1339542883",
            "user_id": "user_2232936",
            "user_link": "/personal_pages/user/2232936",
            "votes": "0"
        },
        {
            "answer": "I will like to know if I could get prego even do my tubes are tied 4 yeara ago I feel prego I haven't got my period almost 2months I been vomiting, nausea, eating a lot feeling cramps I'm scared going to the doctor.  Has this happened to anyone?",
            "post_id": "8117662",
            "timestamp": "1341650347",
            "user_id": "user_3110219",
            "user_link": "/personal_pages/user/3110219",
            "votes": "0"
        },
        {
            "answer": "Dear Regina: More likely are pre menopause symptoms. Women usually don't talk about it. But the possibility of a woman making healthy eggs or eggs at all after 45 is extremelly small and, if on top of that you add the fact of the BTL, well is not chance that we are pregnant. Pre menopause symptoms can start at 35 yrs and last up to 10 yrs, and we will notice weight gain and all kinds of symptoms. Accepting that we are approaching menopause is not easy, because is the end of our possibilities of having a child.",
            "post_id": "8135188",
            "timestamp": "1342140636",
            "user_id": "user_3122422",
            "user_link": "/personal_pages/user/3122422",
            "votes": "0"
        },
        {
            "answer": "Are you pregnant?",
            "post_id": "8135202",
            "timestamp": "1342141007",
            "user_id": "user_3122422",
            "user_link": "/personal_pages/user/3122422",
            "votes": "0"
        },
        {
            "answer": "Yes, it happens, if you are still making helathy eggs, you could be pregnant. See adoctor it could be other things as well. A pregnancy test will be your first thing to do. The first urine in the morning is the most accurate.",
            "post_id": "8135212",
            "timestamp": "1342141181",
            "user_id": "user_3122422",
            "user_link": "/personal_pages/user/3122422",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied 16 yrs ago. I'm on my cycle now but I'm on the downside yet I'm feeling nauseous n fatigued. I just want the probability of me being pregnant. I also experienced fluid coming from my breast with a lil tenderness. Could I possibly b prego?",
            "post_id": "8144714",
            "timestamp": "1342422013",
            "user_id": "user_3129038",
            "user_link": "/personal_pages/user/3129038",
            "votes": "0"
        },
        {
            "answer": "I have a question for anyone willing to try to give me an answer. My mom has had her tubes tied for over 16 years and now has every last symptom of pregnancy (suspects to be about a month along.) She just turned 42 years old last week and has been pre-menopausal for about a year or so. If she is pregnant, does the baby have a chance of being born and being healthy? I've heard about the tubal pregnancies being a threat but how big of a chance does that have at effecting the baby? This will be, if positive, her third pregnancy. Thanks",
            "post_id": "8154117",
            "timestamp": "1342672606",
            "user_id": "user_3135921",
            "user_link": "/personal_pages/user/3135921",
            "votes": "0"
        },
        {
            "answer": "I have a question for anyone willing to try to give me an answer. My mom has had her tubes tied for over 16 years and now has every last symptom of pregnancy (suspects to be about a month along.) She just turned 42 years old last week and has been pre-menopausal for about a year or so. If she is pregnant, does the baby have a chance of being born and being healthy? I've heard about the tubal pregnancies being a threat but how big of a chance does that have at effecting the baby? This will be, if positive, her third pregnancy. Thanks",
            "post_id": "8154127",
            "timestamp": "1342672803",
            "user_id": "user_3135921",
            "user_link": "/personal_pages/user/3135921",
            "votes": "0"
        },
        {
            "answer": "It looks like this is a really old thread of conversation. I'm curious how things are turning out for your mom though.... did she get positive confirmation of a pregnancy? I'm in my late 30s and have had 3 kids and now suspect another pregnancy after having my tubes ties over 4 years ago.",
            "post_id": "8169584",
            "timestamp": "1343107433",
            "user_id": "user_3146572",
            "user_link": "/personal_pages/user/3146572",
            "votes": "0"
        },
        {
            "answer": "I'm 37 years old with two kids...an almost 16-year-old daughter and a 10-year-old son.  I had my tubal after the c-section delivery of my son...on March 14, 2002.  I was 26 at the time.  That was 10 years, 5 months ago.Three years ago I also underwent Ablation surgery in an attempt to eliminate my heavy periods.  It didn't completely work, though it didn't make them easier.  (NOTE - a 100% success rate with this surgery also eliminates any chance of getting pregnant again).  But, like I said, mine wasn't a complete success.Now, I find myself nearly 2 weeks late for my period, which has arrived like clockwork for the past 25 years.  The only two times in my life that I've been late, I've been pregnant.    My cycle is so set in stone that my husband is already convinced a baby is on the way.I know the failure rate for a tubal is low, but it does happen.  And that would be just my luck.There is a HPT in my immediate future...God help me.",
            "post_id": "8210412",
            "timestamp": "1344211033",
            "user_id": "user_3173217",
            "user_link": "/personal_pages/user/3173217",
            "votes": "0"
        },
        {
            "answer": "I almost feel stupid writing about this.  I think I might be going crazy. I feel so silly.  I have been feeling some symptoms of pregnancy, but now I'm not sure if I'm making myself feel these symptoms or if they are real.  I had a tubal ligation 1 year ago.  I have been feeling on and off nausea, difficulty digesting, some on and off tingling in my breasts, but not really soreness.  I had my period, but it lasted only 2 days instead of 5 days - it was abundant 1 day (not just spotting). BUT, what makes me wonder is that on top of the on and off nausea and breasts and headaches, my middle child (I have 3) has been soooooooo clingy to the point of not wanting any of the other kids to touch me, I have to eat holding his hand.I took 5 HPT and 1 blood test and they were all negative. Am I going crazy??? Is it secret wishful thinking? I know I probably can't handle another baby, but deep down inside would really want to be pregnant....Does that make sense???",
            "post_id": "8282222",
            "timestamp": "1346263234",
            "user_id": "user_3227860",
            "user_link": "/personal_pages/user/3227860",
            "votes": "0"
        },
        {
            "answer": "WOW!!! It's all I can say....I am flabbergasted at your story....never heard anything like this! Praise the Lord!!!",
            "post_id": "8282945",
            "timestamp": "1346279141",
            "user_id": "user_3227860",
            "user_link": "/personal_pages/user/3227860",
            "votes": "0"
        },
        {
            "answer": "Hi. I had my tubes tied when after I had my son in 2001. My periods always come every 4 weeks on the day. This month, never received one.MY breasts are sore and tender, I have lower ab pains, and just slightly started spotting but not a period. Have been peeing alot and sometimes nacious. I will be 44 in less then 2 weeks. I had 3 kids. Any advice?",
            "post_id": "8284679",
            "timestamp": "1346331305",
            "user_id": "user_3229791",
            "user_link": "/personal_pages/user/3229791",
            "votes": "0"
        },
        {
            "answer": "Have you done a pregnancy test?",
            "post_id": "8285043",
            "timestamp": "1346338860",
            "user_id": "user_3227860",
            "user_link": "/personal_pages/user/3227860",
            "votes": "0"
        },
        {
            "answer": "Hello,I had my tubes tied 2years ago . Have been getting a period every month regular now July 2days on Aug. nothing . could I b pregnant . I'm worried bc I got my tubes tied bc I had a misscariage .been light headed and sore breast crazy appetite .. please someone give me ur opinion",
            "post_id": "8294595",
            "timestamp": "1346624715",
            "user_id": "user_3237615",
            "user_link": "/personal_pages/user/3237615",
            "votes": "0"
        },
        {
            "answer": "I'm 37 years old I have 4 children, oldest 19 years old. After the birth of my youngest 12 years ago I had a tubal ligation during my c-section. My cycle since then has always been 21-23 days. I'm now on day 27 and still no menstral. I felt like I was going to start on the 1st, I had all the symptoms like i was going to start  but still havent My breast are really sore and that's the only symptoms I ever had during all my pregnancies, never got morning sickness or anything . What is wrong with me?",
            "post_id": "8299008",
            "timestamp": "1346770892",
            "user_id": "user_3241790",
            "user_link": "/personal_pages/user/3241790",
            "votes": "0"
        },
        {
            "answer": "I have had my tubes tied for 11 yrs. And I feel pregnant. I look like im at least 3 or 4 months. My breast r big and I keep taking test that comes out negitive. Ive been feeling flutters. I do still have a period. I know im pregnant! I just don't understand why my test r negitive. Has anyone gotton pregnant and had this happen. And if so how long were u wen u finally had a positive test.",
            "post_id": "8331083",
            "timestamp": "1347716288",
            "user_id": "user_3613451",
            "user_link": "/personal_pages/user/3613451",
            "votes": "0"
        },
        {
            "answer": "I had my tubes cut tied and put back together. During. My c secation over 10yrs now my home test or showing + but very. Light u almost. Can't. See it for two myths now my period been. Messed up hurting. In stomach can I be prego I feel sick when I eat",
            "post_id": "8331084",
            "timestamp": "1347716301",
            "user_id": "user_3613457",
            "user_link": "/personal_pages/user/3613457",
            "votes": "0"
        },
        {
            "answer": "They say that with HPT aren't as likely to show up positive after a tubal ligation.  Best suggestion is wait 2 weeks and get a blood test.  That will give you body enough time to figure out what's going on whether you're pregnant or not",
            "post_id": "8336937",
            "timestamp": "1347902309",
            "user_id": "user_3695842",
            "user_link": "/personal_pages/user/3695842",
            "votes": "0"
        },
        {
            "answer": "im 34 yrs old. got sterilized 9 yrs ago. and im now late on my period. been suffering from sickness, heartburn, fatigue, lower back pains and faint from time to time, i have been under a lot of stress past month and put a lot down to that, but now that im late im beginning to wonder as i am never normally late, if anything im early,",
            "post_id": "8354591",
            "timestamp": "1348398857",
            "user_id": "user_3866070",
            "user_link": "/personal_pages/user/3866070",
            "votes": "0"
        },
        {
            "answer": "I am scheduled for an ultrasound on Monday... I had a TL done in 2009... I now have Milk Leaking, Pain in my lower abdomen and I get sick to my stomach when I smell food. I will keep you posted...I know it is possible to get prego after a tubal Litigation. Being sick at night is how I was with my first child. I have three now and I am 27 yrs old.",
            "post_id": "8371576",
            "timestamp": "1348852623",
            "user_id": "user_3972467",
            "user_link": "/personal_pages/user/3972467",
            "votes": "0"
        },
        {
            "answer": "I had my tubes tied in 11 yrs ago but I recently started feeling fatigue and nausea and my face started breaking out with acne that I never had problems with before....could that be a symptom of pregnancy? I haven't had no test done yet.",
            "post_id": "8385001",
            "timestamp": "1349234164",
            "user_id": "user_4041072",
            "user_link": "/personal_pages/user/4041072",
            "votes": "0"
        },
        {
            "answer": "UPDATE: I had a tubal ligation done a little over 1 year ago. 2 months ago I had all the pregnancy symptoms. Nausea, sore breats, fatigue, hormonal/emotional roller coaster, cramps, spotting, no real period, etc. My HPT and blood test were neg. I ended up demanding for a sonogram because I thought I was going crazy. Well, they didn't see anything.  I was not pregnant.  They did blood tests to check for thyroid problems, perimenopause, cysts, etc. All tests were negatives.  The Dr said it could just be an \"off\" cycle and everything usually get back to normal.  And it did. I'm back with regular cycles, normal period, and no symptoms.  However, I really kind of wished I had been pregnant.  But I'm really trying to get that out of my mind, knowing how impossible/improbable it is. I can't set myself up for disappointment month after month because I'm not pregnant.  I don't know why I feel this way....I've had my tubal ligation for over a year, never thought about it twice, knowing we can't handle a forth child....but now I find myself wanting to be pregnant again! I truly felt saddened by my choices.....I don't even want to ask God to grant us a miracle.....I'm scared I would just set myself up for disappointment after disappointment.....Anyways.....I just never thought I would go through this grieving/mourning phase about a tubal ligation and being finished for good....Good luck to all of you!",
            "post_id": "8490265",
            "timestamp": "1352166253",
            "user_id": "user_3227860",
            "user_link": "/personal_pages/user/3227860",
            "votes": "0"
        }
    ],
    "post_id": "1057191",
    "question": "I had my tubes tied 11 years ago.  I have had symptoms of pregnancy for about a week and a half.  Bloating, constipation, throwing up, tender breasts, etc.  I had a blood test done two days ago that came back negative, but my period isn't due for another 5 days.  My last period came two weeks early and wasn't very heavy.  How often do tubes come untied?  And could I be pregnant even though the blood test came back negative?  Could have been to early for it to show even with a blood test, because I sure feel pregnant.",
    "timestamp": "1108274400",
    "title": "pregnancy after tubal ligation",
    "user_id": "user_85248",
    "user_link": "/personal_pages/user/85248"
}