{
    "answers": [
        {
            "answer": "My mom had this a few times, I know it's terrible sitting on the toilet with a bowl in your lap.  How awful.  She had a stomach bug.  They gave her an antibiotic and told her to drink clear fluids, eat light, and she was free to use pepto-bismol.  She didn't have a fever or anything that would resemble a cold.  Just the stomach stuff.  Sorry you feel so crappy.",
            "post_id": "175374",
            "timestamp": "1163656800",
            "user_id": "user_165051",
            "user_link": "/personal_pages/user/165051",
            "votes": "0"
        },
        {
            "answer": "DO NOT TAKE PEPTO, it contains a chemical that is dangerous to your baby.  Probably says on the label anyway.Clear fluids, gingerale, popsicles, apple juice are great for stomache problems.  Once you stop throwing up, try some toast and if you keep that down a banana.I think you should probably be seen by your doctor as well.I hope you feel better soon.",
            "post_id": "175378",
            "timestamp": "1163656800",
            "user_id": "user_164559",
            "user_link": "/personal_pages/user/164559",
            "votes": "0"
        },
        {
            "answer": "I had stomach pain during my early stages of pregnancy, like one or two days after i conceived. I used to have hot flashes with sweat and was very weak . This continued for a while . I am now 6 weeks of pregnant, and everything is under control. Sometimes i feel sharp pain on and off but not for long time just a moment that's it. I think i had the pain coz i was constipated . But when i visited the dctor she told me the pain is there since the abdomen starts stretching. So i think u might have some of this problem. Take care and take rest alott.",
            "post_id": "175383",
            "timestamp": "1163656800",
            "user_id": "user_162733",
            "user_link": "/personal_pages/user/162733",
            "votes": "0"
        },
        {
            "answer": "I feel so bad for you.  I have been there!  I'm at 20 weeks today with baby #2 and had it with both of my babies.  Not sure if it was a tummy bug on top of morning sickness or just an extra dose of morning sickness, but really all you can do is keep hydrated and just make a mental note of what not to eat.  I just got past that stage about a week and a half ago, but I would just let your Dr. know about the incident and keep pushing fluids, hopefully you'll get past this soon.  It's very miserable, but I think it happens more than you would guess, feel better.",
            "post_id": "175529",
            "timestamp": "1163743200",
            "user_id": "user_141622",
            "user_link": "/personal_pages/user/141622",
            "votes": "0"
        },
        {
            "answer": "anxious is right - DO NOT take pepto-bismal while pregnant - it says right on the label to call your HEALTH PROFESSIONAL first.  people on these forums mean well, but please don't take medication suggestions while pregnant without checking with your doctor.",
            "post_id": "175571",
            "timestamp": "1163743200",
            "user_id": "user_143952",
            "user_link": "/personal_pages/user/143952",
            "votes": "0"
        },
        {
            "answer": "My wife is 6 months pregnant with our second child, she has started suffering the exact same symtons as yourself, stomach pain, diarrhea & sickness. We are starting to get a little concerned about this now and could not seem to find anything related to this on the internet until i came across your story. Hope someone has all the answers.  Best of luckDarren",
            "post_id": "1735197",
            "timestamp": "1186950053",
            "user_id": "user_250205",
            "user_link": "/personal_pages/user/250205",
            "votes": "0"
        },
        {
            "answer": "I have suffered the same exact thing and I am 13 weeks pregnant.The pain is so bad at times, I am beside myself with what to do.How did things turn out for you?",
            "post_id": "2227366",
            "timestamp": "1197560706",
            "user_id": "user_360991",
            "user_link": "/personal_pages/user/360991",
            "votes": "0"
        },
        {
            "answer": "i just came across this website looking for the sanme answer. Im almost 38 weeks and this is the third time I have had this. I had NO morning sickness during my pregnancy. I do have gull stones i found that out at about 31 weeks. Do you think thats why i could be getting this?",
            "post_id": "3084901",
            "timestamp": "1214460717",
            "user_id": "user_546247",
            "user_link": "/personal_pages/user/546247",
            "votes": "0"
        },
        {
            "answer": "I have had the same syptoms today and just found out i was pregnant. I already had my gall bladder out after my first child, this is #2. so maybe i just cant handle some foods right now.  to bella2 you might look into gall bladder problems. I had severe pain right under my ribs all through pregnancy and just thought it was heartburn. turns out i had several gall stones and one lodged in my bile duct. they took out my gall bladder, but now with just getting pregnant i wonder if greasy foods are not for me. to kylee1818 im wonderin the same thing because my gall bladder is out my system functions sooo differently when i have foods high in saturated fats. maybe i had too much hamburger today. if anyone else has had there gall bladder out with these symtoms it would be great to know. my doctor doesn't even know im pregnant yet, but maybe i should call in the morning",
            "post_id": "3377323",
            "timestamp": "1220863045",
            "user_id": "user_613359",
            "user_link": "/personal_pages/user/613359",
            "votes": "0"
        },
        {
            "answer": "This is normal, some women have different symptoms with different Pregnancies.  Throughout my pregnance until about the last 8 weeks.  I was vomitting.  In my early pregnancy I would vomit and diareah sitting on the toilet and using a bowl.  The doctor said this was normal as your body adapts to chnages and hormones.  Some women experience nothing and some women experiance terrible \"all day sickness\" in intervals.  I say \"all day sickness\" because its not really morning sickness like everyone may think.  Overall I am trying to give you advice that you should not be worried unless you have pain in your stomach that is sharp and only on one side.  That may be an indication of gallbladder kidney stone or appendicitis.  If you are experienceing dull pain all over after vomitting, its your body adapting to the midsection stretching out.  Good Luck to you.  If its any help I suggest keeping some plastic bags behind the toilet for emergency cases.  You can tie it up and throw it out immediately after.  Drink plenty of water and stay away grease and acidic fruits and veggies.  Congrats remember you are growing something beautiful.",
            "post_id": "4749641",
            "timestamp": "1249853491",
            "user_id": "user_94570",
            "user_link": "/personal_pages/user/94570",
            "votes": "0"
        },
        {
            "answer": "I am 6 weeks pregnant and have been having extreme nausea for the past week and a half but no vomiting. Today the nausea seems worse than ever...I want to throw up but haven't. I have on and off diarrhea and so nauseous that I don't feel like eating anything. Nothing sounds good. I am reading this is normal...but need help with some relief. I am a stay at home mom and have a 1 1/2 year old...I had some nausea with him but that was it...this is horrible. Forget MORNING sickness...this has been on and off all day and all night! What to do?",
            "post_id": "4948294",
            "timestamp": "1254862100",
            "user_id": "user_1064934",
            "user_link": "/personal_pages/user/1064934",
            "votes": "0"
        },
        {
            "answer": "im only about 6 weeks pregnant ... but the other day i had vomiting an diarrhea for the entire day ... my first pregnancy i had morning sickness once a day but everyday .. this is my second pregnancy an it kinda scared me  is it normal to have vomiting an diarrhea for that long at one time?? ...",
            "post_id": "5308742",
            "timestamp": "1264507715",
            "user_id": "user_1188386",
            "user_link": "/personal_pages/user/1188386",
            "votes": "0"
        },
        {
            "answer": "I'm 20 weeks' pregnant and am just getting over a stomach bug (vomiting and diarrhea). In a little more than 24 hours I lost half the weight that I have gained since being pregnant. Normally that would make me happy, but not now. If you do not have a fever and are not seeing blood in your stool or vomit, then the best thing to do is to just stay hydrated with clear fluids and broth and rest a lot. Do not overdo it on sugary drinks, though, because that could irritate your system. Fruit juice mixed with water is ok. Once you can keep the fluids down, eat a little plain white rice or some white bread. Nothing with much fiber. I managed to keep rice and Eggo waffles down. But definitely keep the fluids coming. The baby should be just fine.",
            "post_id": "5342315",
            "timestamp": "1265314587",
            "user_id": "user_1200127",
            "user_link": "/personal_pages/user/1200127",
            "votes": "0"
        },
        {
            "answer": "Firstly, I hope everyone is feeling better. The first 2 comments have the best info minus the pepto bismal. If its dangerous for your baby you shouldn't take it. I'm 38 weeks and never had morning sickness but had a stomach bug for 24 hrs. My doctor suggested imodium ad for the diahrea and lots of fluids to avoid dehydration. I continuously drank water until my vomit was clear and then tried chicken noodle soup & ginger ale. I started to feel better soon after. Please remember water is very important all the while. Hope this helps.",
            "post_id": "5491177",
            "timestamp": "1269192956",
            "user_id": "user_1253272",
            "user_link": "/personal_pages/user/1253272",
            "votes": "0"
        },
        {
            "answer": "My wife is pregnant first time. She is in 7th week. On Monday she was terrible with loose motion and vomiting. After doc suggested Periset MD tab. Loose motions has stopped. Tuesday and Wensday she was ok. But Today again she vomit whatever she has eaten. Motion is ok now. She is also suffering from pian under ribs (upper part of abdomen). She is also facing pain lower left side of adbdomen. But lower left side pain comes and goes. I do not know what to do. Doc says it is natural. I am more worried about her vomiting at this stage. I am alone at home to take care of her. I am in distress please suggest whether these symptoms are common or anything very serious about it.",
            "post_id": "5549127",
            "timestamp": "1270726013",
            "user_id": "user_1273084",
            "user_link": "/personal_pages/user/1273084",
            "votes": "0"
        },
        {
            "answer": "I have this too. It ***** and its about the 3rd time I have gotten it during my pregnancy. My Dr SUGGESTED to take Pepto & Tylenol for my fever and that seemed to help. Now its just me, my gatorade, and the porcelain goddess.",
            "post_id": "5639811",
            "timestamp": "1272900757",
            "user_id": "user_1301456",
            "user_link": "/personal_pages/user/1301456",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone..I would just like to say that the vomitting and diarrhea during pregnancy is not normal. I am recently pregnant with my 3rd child and have had many complications and have lost a baby that was full term. During my 2nd pregnancy I had the same symptoms and one of the conclusions was that I had really low potassium. This caused me to camp out in the bathroom for days..and finally I went to the ER..first they came back to tell me it was a stomach flu..and I disagreed..I didn't have anyone around me at all with a stomach virus...after all said and done..I was filled with fluids for 24 hrs. My doctor told me the number one sign of low potassuim is that your bowl movements smell deadly..and believe me you'll know..I understand everyone gets diarrhea here and there during pregnancy but it should not last more then 3 days and it should not be liquid. Some other things that I experienced with the same symptoms where preeclampsia which my doctors did not catch and the result was my still born baby..also kindey failure, hyperemesis, and complications with your liver or gallbladder. I think if anyone has persistant symptoms you should seek a 2nd opion.",
            "post_id": "5795885",
            "timestamp": "1276596862",
            "user_id": "user_1347785",
            "user_link": "/personal_pages/user/1347785",
            "votes": "0"
        },
        {
            "answer": "Same here I am 9 weeks I have not been able to go to the bathroom #2 and today i ate some fast food but it was a turkey sandwich and curly fries and my stomach started to turn and I rushed to the bathroom and had bad diarrhea and I could not take the smell so I vomited every where. That was so weird I was doing #2 and vomiting at the same time and my son and husband were looking at me like omg are you ok.",
            "post_id": "5841639",
            "timestamp": "1277583784",
            "user_id": "user_1360833",
            "user_link": "/personal_pages/user/1360833",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing the same thing over the past 24 hours.  I am 38 weeks pregnant and I threw up multiple times last night and have had diarrhea constantly.  I have not had any morning sickness throughout my whole pregnancy and as a matter of fact have not vomited in almost 7-8 years  I called my birth center and they said that it does not sound pregnancy related.  I have read some other forums online that have said that this is an indication that labor will be starting.  I guess I will find out here shortly...good luck and I hope you feel better.Amandahttp://powerparenting101.blogspot.com",
            "post_id": "5978814",
            "timestamp": "1280695203",
            "user_id": "user_1399798",
            "user_link": "/personal_pages/user/1399798",
            "votes": "0"
        },
        {
            "answer": "im nearly 7 weeks pregnant & have been really ill today with sickness & diarreah,im worried this isnt normal as its like liquid & i havent eaten a thing all day, except ginger biscuits. does anyone know what i should do?",
            "post_id": "6608425",
            "timestamp": "1296671833",
            "user_id": "user_1583548",
            "user_link": "/personal_pages/user/1583548",
            "votes": "0"
        },
        {
            "answer": "Every pregnancy is different. Morning sickness can be horrible in early pregnancy - I went off meat and sweet foods completely and couldn't keep hardly anything down but it settled after a few months. the trick is to find things that you can keep down and stick with them. Try and eat sensibly and avoid grease and acidic foods. Diarrheoa in late pregnancy is also normal - your body will begin to regularly clear out the digestive system as it prepares for labour - some women will find that bouts of loose motions are accompanied by sickness. this can even be caused by that baby beginning to engage. As the baby is fully grown at this late stage of pregnancy their movements apply pressure to organs. If they are beginning to engage sometimes this applies pressure to the bowels causing a flush out. Similarly women may find that the loose motions are accompanied by the loss of the mucus plug - maybe later on in the day or a few days later. If there are other symptoms like loss of the mucus plug then the loose motions are most likely the body preparing for labour. In first time mums the body can begin to prepare as early as 35 weeks - it takes time and doesn't all happen fast like on the TV. As constipation is common in pregnancy a sudden flush out is often the body's way of regaining the balance. If however the diarrheoa is very severe and lasts for several days without stopping it is only sensible to contact your GP or midwife. If it comes and goes and you can still get some food down then take it as a sign of things progressing. Braxton Hicks can also set off loose bowel movements so if you have any tightening of the abdomen try and walk about, empty your bladder and drink water - the Braxton Hicks should subside and this should help the bowel movements. Unfortunately pregnancy does have some nasty aspects but just remember that however grim you feel the baby is hanging on in there - your body will deal with them first so if you are dehydrated and havent eaten for a while the body will take your reserves (fat stores etc) and ensure the baby is nourished - its you that will suffer not them! Good luck to all who are suffering the dodgy stuff and congratulations to all expectant mums!",
            "post_id": "6817616",
            "timestamp": "1302601790",
            "user_id": "user_1660704",
            "user_link": "/personal_pages/user/1660704",
            "votes": "0"
        },
        {
            "answer": "I had my gallbladder removed in 07 before my son was born in 09. This is my second pregnancy and it is nothing like the first. My gal-bag removal didn't bother me with the first. I had little morning sickness and never vomited or had diarrhea. This time around it's horrid!! I have pain under my left rib cage, extreene nausia, fatigue, diarrhea and I just started the vomiting.I have no answers other than I have gone to the dr and they haven't been able to do much. I have a tummy ultrasound for next week and if they tell me something helpful I make sure to post it.Dr did say that since I had my gal-bag removed it could be bile dumping, might check into that too.I'd say if it keeps up longer than two-three weeks check with the drs. Even though they can't do much since we are pregnant!",
            "post_id": "6927408",
            "timestamp": "1306113472",
            "user_id": "user_1692151",
            "user_link": "/personal_pages/user/1692151",
            "votes": "0"
        },
        {
            "answer": "I am 14 weeks preg and have had diarrea for 4days now n just notice some blood and mucas. Anybody know what this means? Am worried about the baby and have a doc appointment today at 4.",
            "post_id": "7008345",
            "timestamp": "1308744530",
            "user_id": "user_1715377",
            "user_link": "/personal_pages/user/1715377",
            "votes": "0"
        },
        {
            "answer": "i am 16 weeks pregnat n last night i started getting really bad cramps to where i had t0 rush to the bathroom t0 vomit then noticed maybe i ate something bad? then had diahrreah im really worried ewhat should i do? plz help?  ;/",
            "post_id": "7030178",
            "timestamp": "1309445098",
            "user_id": "user_1722408",
            "user_link": "/personal_pages/user/1722408",
            "votes": "0"
        },
        {
            "answer": "I have that rite now",
            "post_id": "7068294",
            "timestamp": "1310723733",
            "user_id": "user_1738267",
            "user_link": "/personal_pages/user/1738267",
            "votes": "0"
        },
        {
            "answer": "im 11 weeks pregnant and today i was in so much pain i had the worst cramps and i had diarrhea and throwing up at same time. i started to sweat and get light headed like i was going to pass out. i couldnt move from the bathroom, this is my third pregnancy and i remember feeling this way with  my first. after i had my first i was dianosed wit gallbadder stones and i had it during my pregnancy the whole time i had my gallbadder removed so why would i be feeling the same way with no gallbadder...",
            "post_id": "7194199",
            "timestamp": "1314662527",
            "user_id": "user_1781276",
            "user_link": "/personal_pages/user/1781276",
            "votes": "0"
        },
        {
            "answer": "i would say thats just morning sickness and gas :/ they say to sleep on your left side it usually relieves it all normal in pregnancy :)",
            "post_id": "7304066",
            "timestamp": "1318026819",
            "user_id": "user_1832231",
            "user_link": "/personal_pages/user/1832231",
            "votes": "0"
        },
        {
            "answer": "Hi yesterday morning i was sick but i dnt wat it is becuz i was vomiting and dirrahea and i had the pain so bad so I dnt know if the food I was eating or a sing of pegrante becuz my first child i did have dirrahea but vomiting yes so can yall give me your answer my yahoo is ***@****",
            "post_id": "8020545",
            "timestamp": "1338920613",
            "user_id": "user_2206777",
            "user_link": "/personal_pages/user/2206777",
            "votes": "0"
        },
        {
            "answer": "I failed two test only had 2periods in 4months been thrownin up and constipated and  morning sickness i have a seven yr old lil girl im 23 yrs old.",
            "post_id": "8365400",
            "timestamp": "1348685873",
            "user_id": "user_3938086",
            "user_link": "/personal_pages/user/3938086",
            "votes": "0"
        },
        {
            "answer": "hi i'm 19 and 23wks pregnant with my 1st last nyt i started with a stomach bug with  these syptoms as i caught of a friends little girl i'm extremly week and trying my best to keep myself hydrated but havent eaten since 3pm yday and am getting worrid i'm causing my little boy harm any suggestions PLEEEASSE x",
            "post_id": "8469870",
            "timestamp": "1351620319",
            "user_id": "user_4244364",
            "user_link": "/personal_pages/user/4244364",
            "votes": "0"
        },
        {
            "answer": "I had my gallbladder removed and I'm currently 6weeks pregnant and I can't eat anything and still have diarrhea  & vomiting like crazy.  I hope this is normal",
            "post_id": "8521149",
            "timestamp": "1353018588",
            "user_id": "user_4337971",
            "user_link": "/personal_pages/user/4337971",
            "votes": "0"
        },
        {
            "answer": "diarrhea and vomiting during my first 4-5 months of pregnancy, I diagnosed my self doctor was clueless about diarrhea, I just stopped eating or drinking any dairy like (milk, yogurt, cheese, sour cream, pudding) and within a days my diarrhea and cramping stopped. I bought lactaid milk for my cereal.  After having baby everything went back to normal, started back drinking milk and eating all of the above, and amazing my baby girl not lactose intolerant, wierd I know but try it, might help, god bless, kayla",
            "post_id": "9166114",
            "timestamp": "1370261765",
            "user_id": "user_5578235",
            "user_link": "/personal_pages/user/5578235",
            "votes": "0"
        },
        {
            "answer": "I'm 12 wks almost 13. and I'm getting pain, vomiting and I'm stuck on the pot....3am with out sleep. I didn't have this problem with my first kid. I rarely eat but it could be food poisoning... but I don't know. I was left feeling week and more tired than I was. I hope someone has answers....",
            "post_id": "9314782",
            "timestamp": "1374487078",
            "user_id": "user_5798778",
            "user_link": "/personal_pages/user/5798778",
            "votes": "0"
        },
        {
            "answer": "I'm 12 wks almost 13. and I'm getting pain, vomiting and I'm stuck on the pot....3am with out sleep. I didn't have this problem with my first kid. I rarely eat but it could be food poisoning... but I don't know. I was left feeling week and more tired than I was. I hope someone has answers....",
            "post_id": "9314781",
            "timestamp": "1374487078",
            "user_id": "user_5798778",
            "user_link": "/personal_pages/user/5798778",
            "votes": "0"
        },
        {
            "answer": "Sometimes it have to do with what you are eating. Sugary, Chocolatey foods can make your stomach upset, certain dairy products also makes your stomach hurt. Being that you are pregnant you probably over indulge and thats ok. Through the day watch what you eat. This happens to me and unfortunately my kids too. Until we clear it all out of our digestive system, then we feel better. We get bad stomach cramps, and almost like contraction feelings and after that, pain starts, the hard stools pass then flows the diarrhea. It last for an hour almost everytime. Your body is cleaning the food you ate that didn't agree with your tummy. No medicine can calm it( seems like it too me and my kids) your body has to get rid of it.",
            "post_id": "9590942",
            "timestamp": "1382429622",
            "user_id": "user_6560039",
            "user_link": "/personal_pages/user/6560039",
            "votes": "0"
        },
        {
            "answer": "This is my second pregnancy my first one was easy with this one I have been nauseas where I dry heeve and throw up white foam and this weekend has been the worst I got a toothache and was up all night sweaty cold and dry heeving  threw up twice where it hurt my chest and made me not able to breathe i have even peed everytime it made me sick to my stomach",
            "post_id": "9756723",
            "timestamp": "1387127132",
            "user_id": "user_7019086",
            "user_link": "/personal_pages/user/7019086",
            "votes": "0"
        }
    ],
    "post_id": "124993",
    "question": "I am Pregnant with my second child. I never had morning sickness with the first and with this one, still not too morning sickness but for the third time now I have had vomiting and diarrhea at the same time happening. I thought it had to do with what I was eating, because the first 2 times it happened after having fast food (which I rarely do anyways), but this last time it happened shortly after eating eggs, toast and fruit. I told my doctor after the first 2 times and she agreed that maybe it was just too much grease, but now that theory is thrown out the window. It comes on very quickly, with a starting feeling like I just have to go to the bathroom and then followed with severe stomch pain and vomiting & diarrhea. Then sweating and chills, leaving my skin extremely itchy, but everything is usually gone within 1 hour just leaving me feeling weak. Has anymore ever heard of this before? I appreaciate any suggestions or recommendations. Thanks!",
    "timestamp": "1163656800",
    "title": "Pregnant w/ diarrhea and vomiting at the same time.",
    "user_id": "user_170928",
    "user_link": "/personal_pages/user/170928"
}