{
    "answers": [
        {
            "answer": "my understanding of ablation was that it was the burning away of the uterine lining, leaving scar tissue which makes it difficult for the uterine linng to build back up, usually done as a remedy to heavy irregular periods in women who are through building their family.i would think the risk to the baby would be during the 1st trimester (which you may already be past) when implantation occurs and the placenta develops. Once the placenta takes over, I'd think the baby would be home free.  I'm not sure what the risk to you would be, except they probably wouldn't let you deliver vaginally, due to risk of uterine rupture during labor from the scar tissue.I had a friend who had the ablation done. her doc told her it would be impossible to get pregnant in the next 10 years, that she probably wouldn't even have a period for quite a long while... guess I better tell her about you, huh? LOL.did they do your ablation for heavy periods, or was there some other reason?",
            "post_id": "1127724",
            "timestamp": "1121490000",
            "user_id": "user_43067",
            "user_link": "/personal_pages/user/43067",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for replying to my post. Yes, they did mine for heavy periods, plus I was in so much pain to due to my periods. No, one is not to get pregnant after this, or at least thats what they told me. But you see my dr's was wrong. They are telling me now that I will be able to carry the baby, but still, I am scared to death. I go to have an ultrasound done on monday to see where the baby has planted itself. And to see what is instore for me then. Just tell your friend to use all the protection she can from getting pregnant, cause apparently, you can still get pregnant after an ablation. I was finished having my babies, thats why I had it done. I have 3 children. But you know, I have looked at it since I have gotten over the shock that it must have been the Lord's will, so I am looking at it that way, and if he wants me to carry the baby, then I will. That is the only way to look at this situation. I have put it all in his hands, but that dont meant I am not scared to death. Again thank you for replying to my post.Deanna",
            "post_id": "1127726",
            "timestamp": "1121490000",
            "user_id": "user_94803",
            "user_link": "/personal_pages/user/94803",
            "votes": "0"
        },
        {
            "answer": "hm.You are over a large portion of the danger if you have indeed made it to 16 weeks without incident--golly, you must have had a lot of endometrium left after the ablation.  You must have continued to have some sort of period or significant bleeding during the last year if you had that much endometrium left, surely.Stranger things have happened, I suppose.  If you are 16 weeks, you should be feeling the baby move (if this isn't your first pregnancy) and your uterus should be clearly palpaple halfway to your belly-button.  How are you counting your dates?",
            "post_id": "1127727",
            "timestamp": "1121490000",
            "user_id": "user_75880",
            "user_link": "/personal_pages/user/75880",
            "votes": "0"
        },
        {
            "answer": "FROM OB-GYN.NET:\"Ablation does NOT provide reliable birth control, since ovulation still takes place as before, and the uterine lining may be receptive to a pregnancy. Second, pregnancy in general should not be elected after an ablation; in fact, it can be dangerous. The procedure can cause changes in the uterus that make pregnancy potentially hazardous to the mother, including possible complications such as uterine rupture and placenta accreta (a placenta that becomes \"stuck\" to the uterus and cannot be removed, causing potentially life-threatening bleeding). Because of the potential problems with future pregnancies, it is generally recommended that reliable birth control, including male or female sterilization, be considered in women who undergo ablations.\"---------------------------------------------------------------Here is a paragraph from the book, A Gynecologist's Second Opinion: The Questions and Answers You Need to Take Charge of Your Health by William H. Parker, M.D., with Rachel L. Parker, Contributions by Ingrid A. Rodi, M.D. and Amy E. Rosenman, M.D:\"Once the lining cells of the uterus are destroyed by the procedure, there is no place for a developing fetus to attach within the uterus. If some cells remain following an ablation, there exists the rare possibility of pregnancy occuring. If pregnancy were to occur, termination would most likely be recommended as doctors are concerned that without adequate cells lining the inside of the uterus, the placenta would grow directly into the muscle wall of the uterus and take hold like the roots of a tree. As a result, the placenta would not be able to separate at the time of delivery, and hemorrhage could occur. This procedure is not a form of birth control and another method of birth control must still be used to avoid pregnancy.\"So it sounds like it can be very dangerous, still!",
            "post_id": "1127728",
            "timestamp": "1121490000",
            "user_id": "user_75880",
            "user_link": "/personal_pages/user/75880",
            "votes": "0"
        },
        {
            "answer": "I think I may be pregnant as well.  It will be two years in August since I had the ablation done due to heavy bleending and pain caused by the bleeding.  I have three children.  My youngest has a terminal chromosome disorder and didn't want anymore children.  I am scare to take a test...tell my husband or anyone for that matter.  Scared and don't know what to do.  My husband and I are already constantly fighting.  This would end us for sure.  I have thought that I might be pregnant for about three weeks now but haven't had any of the 'normal' signs.  My stomache is showing signs and there is pressure in my abdomen if I bend over or lay on my stomach.I just can't believe this is happening to me...I already have a special needs child.  My marriage is in the dumps and now this.  I can't handle it.Help,K",
            "post_id": "1127920",
            "timestamp": "1121749200",
            "user_id": "user_95315",
            "user_link": "/personal_pages/user/95315",
            "votes": "0"
        },
        {
            "answer": "This is for Sweetie,  What are the symptoms of your pregnancy.. do you get sore breasts? I had an ablation done 2 years ago and I am feeling pregnant , my breasts hurt and my stomach is big and nausea.. sometime ago I did a test and it was negative and I am scared to do another test.. My doctor told me  that there are chances its not a 100% on the surgery.. I have had my 2 kids and I worried. please email me at ***@**** and good luck!",
            "post_id": "1949242",
            "timestamp": "1191454484",
            "user_id": "user_291638",
            "user_link": "/personal_pages/user/291638",
            "votes": "0"
        },
        {
            "answer": "I am wondering how everything went for you? The post was in 05? Can we please have an update? I am 2 years post ablation and just found out I am 18 weeks and 2 days pregnant! The doctor is quite conserned about the placenta growing into the uterus and not being able to seperate at birth, which is handled by them taking the uterus at the time of birth, that aside, baby and I should be fine! So I am starting to calm down a bit, but would like to know how you and baby are?Marlee",
            "post_id": "1962829",
            "timestamp": "1191858042",
            "user_id": "user_295104",
            "user_link": "/personal_pages/user/295104",
            "votes": "0"
        },
        {
            "answer": "Hope all is going well. Glad I found you. I have so many questions. Had the novasure done in May of '06. My husband had a vasectomy so birth control was not a concern of ours. We divorced not long after that. I am in a serious relationship with a man that has no children and is very capable of having them. I started taking birth control pills    . Now I bleed continuously. I hate it. He and I will probably marry some day soon. Not sure if I would want to take the risk of becoming pregnant. People will think I am nuts for even considering this. Would love to give him a child if that is something for us. Not sure what to do. Was wondering after your procedure, did you still have heavy periods? When I had this done I was told I had a very thick uterine wall. Wondering if that is why I still have heavy periods. I did go 77 days without a period at all. Doc said probably due to stress and weight loss. Not sure if I should just go and get a tubal ligation and be done with this whole thing.  Would love some input from anyone....",
            "post_id": "1992851",
            "timestamp": "1192632930",
            "user_id": "user_303390",
            "user_link": "/personal_pages/user/303390",
            "votes": "0"
        },
        {
            "answer": "I had the ablation too and then divorced.  I amnot with a wonderful man who does wants kids and I am so scared, but I want to try. I is so nice to hear good stories for once about this!",
            "post_id": "2111401",
            "timestamp": "1195246225",
            "user_id": "user_308944",
            "user_link": "/personal_pages/user/308944",
            "votes": "0"
        },
        {
            "answer": "oops. I just re-read what I wrote, that should have said I am now with a wonderful man!!!",
            "post_id": "2125242",
            "timestamp": "1195575275",
            "user_id": "user_308944",
            "user_link": "/personal_pages/user/308944",
            "votes": "0"
        },
        {
            "answer": "I had my ablation done two years ago for heavy periods and thinking that i would not want more kids, as things turned out i met a wonderful man and will be getting married in april, only problem is now we are wanting to have a baby, is this at all possibe, i still have a monthly period",
            "post_id": "2162598",
            "timestamp": "1196406943",
            "user_id": "user_347743",
            "user_link": "/personal_pages/user/347743",
            "votes": "0"
        },
        {
            "answer": "I had a Ablation performed in Dec 06', and recently found out that I am 14 weeks pregnant.  I've been terrified that I won't be able to carry to term.  Right now everything is looking fine, although they will be continually doing ultrasounds to make sure the placenta is attached properly and if so that the baby is growing properly.  Everything feels normal except I seem to have alot more abdominal discomfort than in my previous pregnancies.  Have you experienced it as well?  I think maybe because the Placenta is rooting so deep in the uterine walls may be causing it.  I hope all is going well in your pregnancy, and I would love to hear your experiences.  I was so in shock when I found out, because I was told this could'nt happen, so I was relieved to know others are in the same position and I was not alone in this.Jewell1117",
            "post_id": "2194918",
            "timestamp": "1197075342",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Hi I had my  tubes tied 13 years ago, and an ablation done in June of 2006, I have had no period.... And now its Dec,20007 last month I had a light show just spotted my breast have been sore for almost 2 months now, i feel sick some days day and evenings, Ive been cramping like im going to start, Ive been getting dizzy and lightheaded my stomach looks a little bigger but most of all its my breast that are tender and sore!! And Im so freaked out I almost bought a pregnancy test picked it up and put it back down, I said to myself Im not pregnant .. But now Im starting to WONDER!! Help I so scared.. RA",
            "post_id": "2275684",
            "timestamp": "1198651681",
            "user_id": "user_370399",
            "user_link": "/personal_pages/user/370399",
            "votes": "0"
        },
        {
            "answer": "Well, thats exactly how it happened for me!  I was so ill, but dismissed it thinking that there was no chance I could ever be pregnant.  I would definately take a test, so at the very least it would give you peace of mind.  If you are pregnant you would have to go to see your Gynocologist ASAP, due to some very dangerous potential risks to you.  It was very shocking when I found out!  It took about 2 to 3 weeks before I could even comprehend what was happening, My youngest child is now seven and I never thought I would be doing this again!  Any how,  Good Luck to you and I hope all is well.Jewell1117",
            "post_id": "2276486",
            "timestamp": "1198686962",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I had the novasure ablation in April of 2007 due to heavy period lasting 2 weeks or more.  I still get a period every month and they seem to be getting heavier and heavier and now the clots are coming back ( sorry that was gross). I have an appt w/ my ob in Jan of 2008.  Most recently my breast feel extremely soar, and I am very exhausted. My husband and I use birth control.  The thought of being pregnant scares me because I know it would be dangerous. I've enjoyed reading all of the comments. Good luck everyone.",
            "post_id": "2283218",
            "timestamp": "1198817508",
            "user_id": "user_372056",
            "user_link": "/personal_pages/user/372056",
            "votes": "0"
        },
        {
            "answer": "ladies personally I have had albation done about a year ago, it worked, but not as well as I wanted it to, so 4 months after that I had my uterus removed............ best thing i ever did.  no periods and still have all my hormones.Now I would like to add that just cause you are past your first tri doesn't mean the complications are over.  In fact they say that the bigger the baby gets the more complications that can arrise.  The main issue for the mother is bleeding and it won't stop...........I am truly amazed that so many docs aren't telling females of the risks when they get the ablation done.  My doc even had me sign a paper that stated that I knew that I shouldn't get pregnant after the ablation due to high risk pregno and death to me or the baby.......Understand I know first hand what ablation does to your uterus......... It took docs over 3 hours to remove my uterus because it feel into pieces when they were removing it........ This is due to the fact that ablation does hurt your uterus and it makes it hard to carry a baby to full term afterwards.Please look onto the novasure website to read up on the issues about this.Good luck.There is another post regarding ablation on here, you might want to look at it cause there are over 100 posts on it.",
            "post_id": "2286675",
            "timestamp": "1198907185",
            "user_id": "user_189237",
            "user_link": "/personal_pages/user/189237",
            "votes": "0"
        },
        {
            "answer": "Anyone have any news on successful pregnancies after the ablation???",
            "post_id": "2314250",
            "timestamp": "1199460399",
            "user_id": "user_308944",
            "user_link": "/personal_pages/user/308944",
            "votes": "0"
        },
        {
            "answer": "I had the novasure procedure done almost exactly a year ago. I was on Depo for 5 years and than started bleeding one day last year out of the blue and never stopped. I almost died, it was very frighting. I have had no period since than. But yesterday I started bleeding and pretty heavy. Not enough that I'm going to bleed to death, but a lot. Has any one had this happen to them and is this normal? I feel like I should have my Uterus taken out and not deal with this any more.",
            "post_id": "2326192",
            "timestamp": "1199669336",
            "user_id": "user_380395",
            "user_link": "/personal_pages/user/380395",
            "votes": "0"
        },
        {
            "answer": "Hello everyone.  I had the ablation done in June of 2006 and in June of 2007 conceived.  I didn't realize I was pregnant because I had no symtoms other than feeling tired.  No breast tenderness or morning sickness.  I began gaining weight and my clothes weren't fitting and since I had 4 back to back pregnancies, I thought I had fybroid tumors.  My youngest son was 1 and my oldest was 6 so I was definitely done.  Well I scheduled an appointment to see why my stomach was looking so bloated and found out I was 13 weeks pregnant.  Three days later, I woke up in the middle of night in a pool of blood got up and went to the bathroom and dropped a large mass the size of my hand.  I was saddend because I had just come to terms with being pregnant. Went to the doctor in the morning and with vaginal ultrasound, discovered I was still pregnant.  I was put on bed rest until the bleeding stopped.  I continued to blead not heavy but light (one pad per day) but the blood turned from the bright red to dark red within 4 days after that episode.  I lightly shed the dark brownish colored blood until the fifth month and then didn't bleed anymore.  I am now 4 weeks from my due date and I am only experiencing leaking of some sort where I have to were a pantiliner everyday. It's clear but it's there everyday.  Baby has been monitored closely all pregnancy, and doctors haven't scheduled me for c-section, so as of right now, I am cleared for vaginal delivery like my previous 4.  That's been my experience, and all I can say is, I was too scared and having nightmares of dying or bleeding to death during delivery, and I turned all that worry and fear and placed it in the hands of almighty God.  He is the only one who has my life in His hands. No doctor, or research is greater than the creator of life Himself.  I took their knowledge and did my own research of my risks, and prayed faithfully that my body would not be subseptible to what research shows. I confessed daily that my uteris would be a great incubator for this baby and my body will supply the nutrients neccessary to carry full term.  Don't let fear overtake you especially durning an already risky pregnancy.  Stay calm, find peace however you can to make it through. It takes strength, faith and wisdom but it can be done. I am a living witness, and in 2 weeks, I will attend my first and only baby shower for the daughter I longed for for so many years, and now she is just 4 weeks away from meeting her family.  She is my miracle baby, when I gave up and wanted no more.  God is always in control, and although I will definitely so something more permanent after this birth, I feel blessed that I can be a testimony for other mothers going throught the same thing.Hope this helps you ladies.",
            "post_id": "2464771",
            "timestamp": "1202140262",
            "user_id": "user_409128",
            "user_link": "/personal_pages/user/409128",
            "votes": "0"
        },
        {
            "answer": "Thank God for finally a positive experience.  I now am 22 weeks and just found out we too are having a little girl.  So far the baby is doing great although during the ultra sound they found out I have placenta accreta, where the placenta has grown into the uterus and I will have to have c-section as well as hysterectomy.  They expected that to happen, so no shocker there.  I continue to pray everyday that God continues to protect my baby and let it be born happy and healthy.  I choose to believe that this child was meant to be. Even if it wasn't planned by us I do beleive it was by God.  Good Luck in your weeks to come!  I'm sure all will be well!Jewell1117",
            "post_id": "2466011",
            "timestamp": "1202155632",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Did you have your preiod after your ablation?  And if so was it heavy?I hope all is well in your pregnancy!",
            "post_id": "2514810",
            "timestamp": "1203094596",
            "user_id": "user_308944",
            "user_link": "/personal_pages/user/308944",
            "votes": "0"
        },
        {
            "answer": "Yes, I had lighter periods after the ablation allthough they didn't go away completely for about 6 months.  Then I was pregnant soon after.Jewell1117",
            "post_id": "2519167",
            "timestamp": "1203183216",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Wow, that is amazing! I wish you the best.  Please keep us updated if you can!  I will be praying for you!",
            "post_id": "2532068",
            "timestamp": "1203445087",
            "user_id": "user_308944",
            "user_link": "/personal_pages/user/308944",
            "votes": "0"
        },
        {
            "answer": "I had the Novasure and D&C proceedure done Dec 2007 - now I regret it with every part of my being.  The day I had the proceedure I had started my period.  I have not had a period since.  Twice now I've had a little pink on the toilet paper each month but that's it.  I just want to break down when I think of what I have done to myself.  I have one child and I know I want another one.  I made a horrible decision based on painfull periods and desperation.The doctor told me that I had a \"small\" uterus and that he was confident he got it all and that I wouldn't have a period (he was correct).  Because it has been so recent do I have a chance at somehow reversing this and taking something or having a proceedure done (such as another D&C) to stimulate the uterine lining to grow?And please don't patronize me....I've already stated that it was a horrible decision.. I knew good and well what the proceedure would cause and I know good and well the risks now that I have changed my mind about wanting to get preggers.  I'm just looking for options.Has anyone seeked treatment to reverse this proceedure with success?  Success meaning a full-term pregnancy.Thanks so much!",
            "post_id": "2759352",
            "timestamp": "1207771468",
            "user_id": "user_475687",
            "user_link": "/personal_pages/user/475687",
            "votes": "0"
        },
        {
            "answer": "I do not think there is a reversal of the procedure.  From what I understand when the lining is gone, it's gone.  But on the other hand I ended up pregnant about 9 months after the Ablation.  The baby has insufficient lining to attach to, so she has basically become permanently attached to the uterine wall.  I am schedule for a C-Section/ Hysterectomy at the end of May.  I know there are alot of risks in being pregnant after Ablation, but my pregnancy has been pretty uneventful.  I go ever 4 weeks for Ultrasounds to check the Placenta as well as the babies grow.  So far so good!  We have no reason to believe that things won't be fine.Good Luck!Jewell1117",
            "post_id": "2767080",
            "timestamp": "1207924569",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I had my procedure done about 2 years ago.  I have never had a cycle sense.  I was married at the time I had the procedure and didn't want anymore children with that man. I have also had my tubed burnt.I am now married to a wonderful man that doesn't have any children and I wish to have a child with him very bad.  I have heard that acupuncture does a wonderful job thickening uterine lining.  We are going to try that for awhile then go see an IVF specialist to see if we can get enough lining to attach an embryo to.  We are very hopeful and I would like to see if anyone else has had a good experiences after an ablation procedure.",
            "post_id": "2772193",
            "timestamp": "1208037365",
            "user_id": "user_478547",
            "user_link": "/personal_pages/user/478547",
            "votes": "0"
        },
        {
            "answer": "I went to see my OB/GYN today - the same one who did my Novasure proceedure in December - and he told me there is no way for me to get pregnant.  I haven't had a period since my proceedure and he said he was sure he got all the lining. He said he could place me on the surrogate wait list.I thought about seeing a specialist but I don' think I could handle the emotional rollercoaster and don't want to end up bankrupt.Good luck and God Bless to everyone.  It sounds to me like pregnancy after ablation is truly a miracle.  Maybe my miracle with come one day.  I am greatful for the child I already have today though.MBGirl330",
            "post_id": "2808240",
            "timestamp": "1208797228",
            "user_id": "user_475687",
            "user_link": "/personal_pages/user/475687",
            "votes": "0"
        },
        {
            "answer": "Ok.  I have read so many other places that it can be done.  Girls, lets not give up here.  I heard that if you are on Provera for 10 days that it might promote uterine lining and bring on your cycle and then you may start birth control to maintain estrogen levels.....I would get another opinion.  Try an RE.  I went to my OBGYN that did my procedure but that is not what they want to tell you, they do not and will not tell you that you can reverse this.  I have heard that you can take baby aspirin every day so that you can promote lining growth and other drugs.  I also heard of another woman that told her NEW gyno that she wasn't having periods and didn't know why, he put her on some meds and got it started again.....from another message board.",
            "post_id": "2809919",
            "timestamp": "1208819794",
            "user_id": "user_478547",
            "user_link": "/personal_pages/user/478547",
            "votes": "0"
        },
        {
            "answer": "I was wondering if Jewell1117 or Teecepink have had their babies yet?",
            "post_id": "2877082",
            "timestamp": "1210175887",
            "user_id": "user_501553",
            "user_link": "/personal_pages/user/501553",
            "votes": "0"
        },
        {
            "answer": "Hi ladies I am 36 years old and a mother of 4. They are 20, 18, 15 & 9. You may think i'm crazy I had my tubes tied 7yrs. ago and had my oblation 5months ago and didn't realize until talking to my husband of 19yrs. a few weeks ago that we really want another child. My cycle never stopped after the oblation it only took 2 months for the bleeding to get back to normal but I have no cramps at all. Thank God for that. We really want one more child. I have heard of a reverse tubal but I didn't know the risk of a pregnacy after a oblation or the slight chance of getting pregnant. I remember my doctor telling me that since a had my tubes tied that I didn't want any more children when he suggested the oblation and I agreed because at the time I hadn't thought about it but he never went into detail that if I ever changed my mind that I couldn't get pregnant.I think I know what stirred up all the emotions of us having another baby. Our first grandchild which was a boy was a still born about a month ago. We were so excited and had so many plans. Now they are talking about waiting a couple of years before trying again. I don't know maybe it's for the best if we can't but we sure do want to. My youngest is really getting big and I didn't realize that the baby stage would be over after awhile because we always had 1 little one on the end.If anyone understands or have any suggestions please comment. THANKS!",
            "post_id": "2921044",
            "timestamp": "1211139865",
            "user_id": "user_511429",
            "user_link": "/personal_pages/user/511429",
            "votes": "0"
        },
        {
            "answer": "I am 31 years old and a mother of 2.  They are 9 and 10.  I had an ablation 2 years ago and have since decided to have another child.  My husband and I thought were were through having kids and have recently changed our minds.  I have been trying to get pregnant for the past 6 months, with no luck.  I had the ablation for heavy periods, since the ablation I now have heavy periods again.  It seems like this is the largest emotional roller coaster I have been on.  However I, intend to keep trying!",
            "post_id": "2925034",
            "timestamp": "1211227250",
            "user_id": "user_512434",
            "user_link": "/personal_pages/user/512434",
            "votes": "0"
        },
        {
            "answer": "I have 10 days until my baby girl arrives!  I am nervous of the Hysterectomy, and some possible complications due to the pregnancy.  I am confident all will go well, my Dr.'s have been on top of the whole pregnancy.  I have had no complications other than 2 boughts of preterm labor, which they were able to stop with med's and bed rest.  They do not know if it had to do with the ablation or if it would have happened anyways.  Good luck to all who are trying, I will update everyone once the baby is here!Jewell1117",
            "post_id": "2925680",
            "timestamp": "1211237956",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "So good to hear from you and that all is going well with you and baby.  Please keep us informed.  I am 6 1/2 weeks pregnant after having an ablation 5 months ago.  Dr. said I couldn't get pregnant after having it done so this was a BIG surprise.  I have three children already but I am thrilled but soooo very scared after all I have read about getting pregnant after having an ablation.  Keep us posted.  Good luck.",
            "post_id": "2931142",
            "timestamp": "1211295248",
            "user_id": "user_501553",
            "user_link": "/personal_pages/user/501553",
            "votes": "0"
        },
        {
            "answer": "My husband had a vasectomy when our son was 6 months old, then when my son was 15 months old I had the ablation surgery done for heavy bleeding.  The doctors told me that I could not get pregnant again was I sure this is what I wanted at that time, to stop all the pain and bleeding, I was 100% sure.  Now I have changed my mind.  Since my husband had the vasectomy, I wonder if it would be possible to get IVF or something along those lines.  Has anyone out there considered or been through this situation?",
            "post_id": "2985861",
            "timestamp": "1212417118",
            "user_id": "user_525232",
            "user_link": "/personal_pages/user/525232",
            "votes": "0"
        },
        {
            "answer": "Im sure with your baby that was due to arrive on the 29th you are very busy. Just wondering how things went. Ive read all your posts and im so glad you were able to carry your baby. I have NovaSure done in April of 07 and I just found out last friday im pregnant. My first emotions were terrified and upset with myself that I let this happen. Im almost 37, I have 5 healthy children and had 5 eneventful pregnancies. Although my bleeding was much less after the procedure I had a period every month on a regular cycle. I called my Ob that did the procedure first thing Mon. morning and he didnt even ask to see me. Told me to terminate the pregnancy and referred me to an abortion clinic.He said my chances of everything being ok were less than 5 percent. I had already come to terms with the fact that I would more than likely have to have an abortion, I do not want to risk my life and leave my other children without a mother. I called and made an appt for the abortion but im only 5 weeks and I have to be at least 6 so I have to wait. I think that is torture for any woman. The longer I know im pregnant and I feel pregnant the harder the thought of terminating it gets. Im in a relationship with a wonderful man who i love with all my heart. He has no children of his own and didnt want any but loves my kids to death. Now that im pregnant and the thought that we will have to terminate it he has uncovered feelings he didnt think he had not to mention he is strongly against abortion. I decided to look on the internet for high risk Doctors in my area and only one came up so I made a phone call. I talked to a high risk nurse who talked to the high risk Doctors and called me back and they thought I should definitely be seen and get a second opinion by someone before I do anything. They referred me to a Dr that is a little closer to me than they are.So now im waiting for a call to schedule a consult. I do not want to get my hopes up and unless I can get someone to say I have a really good chance of getting through this successfully I wont keep it on a less than 5 percent chance. I do know though that if I at least didnt see someone I would always have that in the back of my mind...what if everything would have been ok and I terminated for nothing.  I have been constantly looking online and reading stories, both good and bad. there just isnt a lot out there. I appreciate you keeping people posted throughout. Ive noticed like a lot of other women that people tend to drop off and it leave us wondering what happened.What did your doctor say when you found out you were pregnant? And that mass you passed in the middle of the night..what do they think that was?",
            "post_id": "2995001",
            "timestamp": "1212580898",
            "user_id": "user_527205",
            "user_link": "/personal_pages/user/527205",
            "votes": "0"
        },
        {
            "answer": "To all of you who have had your babies, please tell us out here what happened. There is so much fear of the unknown and you ladies are truly able to put our fears at rest.",
            "post_id": "3010450",
            "timestamp": "1212880277",
            "user_id": "user_517657",
            "user_link": "/personal_pages/user/517657",
            "votes": "0"
        },
        {
            "answer": "where did everybody go? I hope everyone and their babies are ok.",
            "post_id": "3030597",
            "timestamp": "1213297813",
            "user_id": "user_527205",
            "user_link": "/personal_pages/user/527205",
            "votes": "0"
        },
        {
            "answer": "PPPPlease Help!  Sorry to sound so \"needy\"  but I have been on an emotional roller coaster!  I had ablation 8/07.  Have had normal monthy cycle with normal flow ever since.  LMP was 4/26.  5/12 I started having preg symptoms as with my other 2 pregnancies.  5/20 I began to spot brown, pink for a few days, then it stopped.  5/21 has severe cramping.  Went to Dr 6/3 and she said per transvaginal ultrasound that there was something in there, but it wasn't a fibroid.  It is probably a polyp and you've had a miscarriage.  The pee test was neg.  I was so in shock.  What a blessing it would be to have another baby!  She said wait til after my next period and if that didn't get rid of it, she'd do a D&C.  I continue craving and some heartburn which is out of the ordinary and am having mood swings and can cry at the drop of a hat.  6/13 I began to brown spot again and the next evening had severe cramps again.  It turned red and I have worn a pad, but really didn't need to cause its so light.  I went to hospital to have blood work done yesterday.  both qualitative and quantitative and bothe were negative.  I still have symptoms and feel I'm pregnant.  Does anyone know of instances where the blood test has come back neg even though pregnant because of the ablation?  Thanks for your time.  Any input will be well received.  I admire each of you.",
            "post_id": "3049144",
            "timestamp": "1213726040",
            "user_id": "user_538474",
            "user_link": "/personal_pages/user/538474",
            "votes": "0"
        },
        {
            "answer": "So sorry it took so long to get back.  I've been busy with the little one.  She is absolutely perfect in every way.  I was never told to have an abortion by my doctor.  It was never even suggested as an option.  When I found out about the pregnancy they brought me in immediately to make sure it was'nt a tubal pregnancy.  From day one I new there was risks, but they never made me feel like I could die from the pregnancy.  They watched everything more cautiously than a regular pregnancy and did more ultra sounds.  I understood there was more risks to the baby as far as growth restrictions and the placenta working properly.  In my case my daughter was 8 lbs two weeks early and my largest baby ever so that was not even and issue.  I did have to have a C-section as well as a hysterectomy due to the fact that the placenta grew through to the outside of the uterus and would not detach, but other than that the pregnancy was pretty uneventful.  I always believed that getting pregnant with my daughter was a miracle from God, and I trusted that whatever the outcome was going to be, it was what was meant to be!  My faith that God would protect me and the baby is what got me threw all my fears.  I hope it gets you threw yours.  Get second and third opinions and never give up your faith!  Good Luck to you all!Jewell1117",
            "post_id": "3050417",
            "timestamp": "1213742742",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "First of CONGRATULATIONS! That is terrific. I wish my doctors would have had the same outlook yours did. Maybe I wouldnt have terminated my pregnancy. You definitely need support and hope from the ones you are putting all your trust in. I had my abortion last wed. and i may never be convinced it was the right thing to do. Especially when i read your story. If having a hysterectomy at the time of a c-section was all i had to worry about i would have done it in a heartbeat!Hold that baby close to you, she is truly a miracle.",
            "post_id": "3054240",
            "timestamp": "1213817266",
            "user_id": "user_527205",
            "user_link": "/personal_pages/user/527205",
            "votes": "0"
        },
        {
            "answer": "I am 36 years old, I have 4 sons (15 months, 3 ,6, 10)..I hard my tubes tied Jan 07 and my Novasure Ablation in 12/2007 ....I have been bleeding every other day or whenever it feels like a guess until May and so far in June.  I have had 2 ultrasounds April and beginning of May, showing my lining has grown back.  But all of a sudden my period has stopped, nothing. I'm feel like I'm going to be sick, mainly drive heaves, no breast soreness...just feeling liek I'm going to be sick. I took a pregnancy test but it was negative.  I don't even know if it is too early to even test my periods were so crazy.  My doctor told me it's impossible to get pregnant after an ablation.  I guess she should read webmd blogs. Should I see my gyn?Thanks,Anne",
            "post_id": "3074175",
            "timestamp": "1214258026",
            "user_id": "user_543919",
            "user_link": "/personal_pages/user/543919",
            "votes": "0"
        },
        {
            "answer": "Congrats to you!  I know your scared, just make sure your Doctor stays ontop of things.  Have you called to make an appointment yet?  The odds of you getting pregnant were so small, you have to look at it as a miracle that was meant to be.  Stay positive and if there's any questions I can help you with, let me know.Good LuckJewell1117",
            "post_id": "3083124",
            "timestamp": "1214428526",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I wanted to share my story with all of you...I had the Novasure pocedure done in Jan of 2006 at the end of a horrible marriage.  I have since met a wonderful man and am getting married in August.  We started talking about having children and went to see a different OBGYN because my OBGYN wouldn't even talk with me about it.  This gyno was great!  He ran some tests and put me on an estrogen/provera regiment to bring on a period that I haven't had for 2 years.  No luck.  He tried to do an HSG test (ultrasound done by inserting die into tubes and uterus). No luck.  He sent me to an RE which that is where I was diagnosed with Asherman's.  My uterus was scarred shut from the Novasure.  They went in and took out as much of the scarring as they could.  We are waiting to see at this point if my period comes back or not, but there are ways to get pregnant after an ablasion.  There are gynos out there that will help you.  I just hope that you will do your research first and make sure that you take care of any issues, like Asherman's before you try to get pregnant.  I will never be able to get pregnant on my own, we will need to do IVF but to me it is worth it.",
            "post_id": "3097666",
            "timestamp": "1214772300",
            "user_id": "user_478547",
            "user_link": "/personal_pages/user/478547",
            "votes": "0"
        },
        {
            "answer": "All of you that are pregant or going through fertility appointments after ablasion...keep us all informed.",
            "post_id": "3107607",
            "timestamp": "1214968000",
            "user_id": "user_478547",
            "user_link": "/personal_pages/user/478547",
            "votes": "0"
        },
        {
            "answer": "Hello AllI am 27 with 4 healthy wonderful children,I had MEA done in 2004 for heavy periods and have had a period ever since. At the time I had it done I thought I was all done having children as I was married and my hubsband had a vas. Well we seperated and I am now with the love of my life whom doesn't ahve any children of his own and we desperately want to have a child. I went to my family dr adn he told me that if I am still shedding a lining that I should have enough there to concieve but since he didn't know much about it he refered me to an OB}GYN  to see what he had to say,Well I seen him the other day and he was very rude with me about even considering to be pregnant after having the MEA done. I explained my situation to him and told him how important this was to us and we knew the risks and were willing to take the chance since being on here and seeing so many positive stories. I am otherwise healthy and I am not really overly concerned about a serious problem occuring. I am scheduled to have pelvic ultra sounds done and a dye test done to make sure that my tubes are not blocked with scar tissue,I have to have blood tests done on day 3 and day 21 of my cycle to see if I am ovulating as I was always on time with my cycle until the past few months but I think its just my self stressing about things messing me up and I already had a bunch of blood tests done the day I seen him. He over all told me that I would probably get pregnant again but he would prefer that it wasn't while under his care until he was certian that all was well with me so that nothing could come back on him if something went wrong. I go back and see him in august if my family dr suggests it where he was so rude to me to get my results.if not I will be refered to a different dr who is willing to work with me in a positive manor.I will keep you all up to date with what is going on with me:)",
            "post_id": "3111565",
            "timestamp": "1215044321",
            "user_id": "user_538388",
            "user_link": "/personal_pages/user/538388",
            "votes": "0"
        },
        {
            "answer": "I think that Dr.s are very worried about lawsuits thats why I think they suggested that the lady have an abortion w/o seeing her first.  I can see if they ultrasounded and found something unusual, that would be different.  Always get a good Doc that's understanding of the situation.  Any pregnancy is a stressful time w/o your Doc being rude.  Good luck to Katie16 with your pregnancy.  I'll keep you in my prayers!Jewell1117",
            "post_id": "3114574",
            "timestamp": "1215109619",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I am 6 weeks and 4 days pregnant.  I had a vaginal ultrasound yesterday and everything looks fine so far.  I even heard my baby's heartbeat:)  ~ But, I had an ablation (for heavy bleeding) a little over 1 year ago.  I saw my obgyn today and will be going to see a high risk obgyn very soon to discuss options.  I am hoping she will say that things will be ok, but I just don't know.  I think that the thing that worries my doctor and me is that the placenta will most likely attach and grow into the uterus wall.  This can cause massive bleeding when the baby is born and can put lives at risk.  I am very scared about this possibility.  I have also read about other complications.  I recommend to anyone that wants to become pregnant to strongly consider doing so before having an ablation because there are just to many negative things that can happen.",
            "post_id": "3130807",
            "timestamp": "1215532496",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "Hi.  After reading all of the above I have to add one additional factor... Not only did I have the Novasure done - at the same time I had Essure coils inserted into my tubes.  Note this: I already have six kids... Well, two years later I found myself pregnant at age 43... after both the Novasure and Essure.  It turned out that one of the coils was expelled into the uterus.The Dr. that performed both procedures... well, he just said it was textbook material.. he couldn't believe it.  At six weeks we did see the heartbeat - at 8 it was gone.  Unfortunately, i miscarried.  But given my age and the two procedures... I'm not all that surprised.  I had a d and c and they also removed the expelled coil.  Congrats to all the new mommies once again after having Nova.  But also remember about Essure...That's no fool-proof either.Stacey",
            "post_id": "3144537",
            "timestamp": "1215798720",
            "user_id": "user_558880",
            "user_link": "/personal_pages/user/558880",
            "votes": "0"
        },
        {
            "answer": "I am really glad to hear of all of the great news on here for pregnancy after ablation.  I have another appt on Monday to check out my lining.  We are creeping towards a possible pregnancy but I am carefully watched and under doctors care, this I suggest if you plan to try to get pregnant after ablation, but do NOT give up if you want another child...it can happen.",
            "post_id": "3146088",
            "timestamp": "1215824893",
            "user_id": "user_478547",
            "user_link": "/personal_pages/user/478547",
            "votes": "0"
        },
        {
            "answer": "I am new to the forum. Here is my story. I am 33 y/o. I have a 17 y/o daughter and a 11 y/o son. I never imagined I would be divorced and remarried so in 1998 I had my tubes tied and in 2006 I had an ablation via Novasure done. My new Husband and I want a baby but I just feel that this is not possible. I have been talking with the Chapel Hill tubal Reversal and they said by my OP notes I should have no problem with the reversal, the problem is the ablation. They said if I am not having periods then I probably do not have sufficient lining to support a pregnancy. Some months I have some pink on the TP some moths I have nothing and some I have not a whole lot but a day or two where I have a small amount of bleeding. Does this tissue grow back? I see there are some of you with a pregnancy after an ablation. I did have anemia with my very heavy periods so I had to do something but now I regret EVER having it done. if it were not for that I could have the TR and probably have a baby, now I am not even sure that is possible. I am still thinking of having the TR done in hopes that even with the ablation it is possible. Any advice from anyone or how can I stimulate the re-growth of my lining?",
            "post_id": "3218004",
            "timestamp": "1217420258",
            "user_id": "user_575192",
            "user_link": "/personal_pages/user/575192",
            "votes": "0"
        },
        {
            "answer": "Just wanted to check in to see how everyone was doing!  I was excited to hear your little one is doing well.  Stay well rested, I'm sure all will be well.  I had a couple episodes of premature labor as well.  They weren't sure if it was from ablation or not.  My little girl just turned 10 weeks, and already weghs 14lbs and 24 inches long.  They were afraid she wouldn't grow properly.  Obviously not the case!Good Luck Jewell1117",
            "post_id": "3263812",
            "timestamp": "1218416549",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I am so excited for you and your little girl, what a wonderful outcome and positive story, congratulations.  I am 39, just married for the first time this past April.  I have a 19 year old son and didn't think I would ever get married or have more kids so I opted for an ablation in 2004 due to very heavy periods.  Well, I was disappointed when my periods returned the following month just about back to what they were before the procedure.  Now I'm married to a man who doesn't have any children of his own and we both want a child now.  I got pregnant in May, but it was an Ectopic pregnancy and I have to have my left fallopian tube removed along with our \"baby.\"  Our doctor is aware we are trying to get pregnant and has explained the risks, but hasn't discouraged us at all from trying, so I feel good about that.  We know that I may have to have my uterus removed at birth, but I'm okay with that as long as we have a beautiful healthy baby born first.Again, congratulations and I hope to be sharing good news of being pregnant with all of you soon.Katie,  hang in there, keep us posted.",
            "post_id": "3264290",
            "timestamp": "1218427872",
            "user_id": "user_586126",
            "user_link": "/personal_pages/user/586126",
            "votes": "0"
        },
        {
            "answer": "Has your doctor stated that even though you have had an ablation that it is not possible to get pregnant. I have read alot of info on the internet that it is not possible. This is the only site I have come across that women actually have gotten pregnant. I hope that i will be able to have a baby with my new husband.",
            "post_id": "3266624",
            "timestamp": "1218481223",
            "user_id": "user_575192",
            "user_link": "/personal_pages/user/575192",
            "votes": "0"
        },
        {
            "answer": "I am new to this forum.  I had an ablation in May 1998 - yes 1998.  I have always had periods after this procedue.  In fact, many months they are heavy.  My periods also last 4-6 days.  I have recently re-married and my new husband is talking seriously about having a baby (I am 42 years old with my oldest child being 15).  I would love to have a baby with my new husband but I really don't know if this is safe.  I did place a call to my OB and he is going to call me back, but I wanted to see if there was anyone out there with my similar stats.  I am in great health and have had two wonderful pregnancies in the past - with NO complications.",
            "post_id": "3266822",
            "timestamp": "1218483688",
            "user_id": "user_586714",
            "user_link": "/personal_pages/user/586714",
            "votes": "0"
        },
        {
            "answer": "Hi. I had my EA 8/24/06. I have continued heavy periods and cramping.I, like so many others on this site was married to a man with a vasectomy. My kids are 16 and 11. I thought I was through. We are now divorced, and I am with someone wonderful. I also thought I couldn't get pregnant, so we weren't very careful. Well, my period is a little late, and I took a test this afternoon. It looked positive, although the horizontal line was darker. I am going to get bloodwork done tomorrow.Basically, if it's positive, they do an ultrasound to see if the baby is on my tubes. I am so scared! I'm even scared of getting my blood drawn!I'm a nervous wreck around hospitals and doctors!",
            "post_id": "3268011",
            "timestamp": "1218502543",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "How far along are you now?  I'm so glad to hear you are holding onto the good days, I will pray for you and your little one.  I seem to have real positive OB/GYN doctors because the same doctor who did my ablasion also did a myomectomy to remove fibroids from my uterus because she knew I wanted to get pregnant now and the complications with pregnancy and the large fibroids I had were worse than a pregnancy after an ablasion.  My new OB/GYN, who works with my first one, also knows I want to get pregnant, has discussed the risks and limited chance with me, but encourages trying and will monitor me the entire way.  He says I'm likely to have more miscarriages due to the ablasion, but it's possible to get pregnant and have a healthy baby after a uterine ablasion.  Please keep me up-to-date on your progress and know I will be praying for you.  Thanks for the encouragement, hang in there.",
            "post_id": "3271332",
            "timestamp": "1218570259",
            "user_id": "user_586126",
            "user_link": "/personal_pages/user/586126",
            "votes": "0"
        },
        {
            "answer": "Yes, both of the OBs I've seen say it is possible to get pregnant after an ablasion, it's just more risky and more difficult.  The chances of you having more miscarriages is higher and there can be complications at birth.  However, neither doctor has discouraged us from trying or told us to NOT try, so I'm going with the trying and hoping and praying for the best.  I don't plan on changing doctors, so I would imagine if he thought is was a risk, or there may perhaps be a lawsuit, he would have told us this wasn't possible or safe and to stop right away!  I'm encouraged my both of the OBs I saw and look forward to the day I can let all of you know we are having a baby.Blessings to all of you, especially Katie, stay well and to Jewel, thanks for the joy of your story.",
            "post_id": "3271404",
            "timestamp": "1218571217",
            "user_id": "user_586126",
            "user_link": "/personal_pages/user/586126",
            "votes": "0"
        },
        {
            "answer": "Well, I went to the doctor today for my bloodwork, and the dr. just called me and told me I am pregnant. My HGC (is that right?) is only at 48, and he thinks I am only two weeks along. I am getting cramping, like I am about to have my period. He took an ultrasound and said he couldn't believe how strong my uterus was. As long as I don't get a \"period\" before friday, I go back for more bloodwork to see if my level has gone up!",
            "post_id": "3272805",
            "timestamp": "1218593955",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Katie, Hi! Congratulations! Did you have weird cramping the first few weeks?",
            "post_id": "3273033",
            "timestamp": "1218598217",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "i was just wondering if u had a ablation do u always have a neg. pee test.i feel like am may-be preganat  i have sore breast,  tired all the time , moody and my belly seem to hard and not as mushy. what do i do my new husband and i want a baby so badly am afrid to be disapointedany suggestion for how to go about gettn pregant",
            "post_id": "3278024",
            "timestamp": "1218685919",
            "user_id": "user_589184",
            "user_link": "/personal_pages/user/589184",
            "votes": "0"
        },
        {
            "answer": "I too felt a little crampy when I found out, although  was about 8 weeks along.  We named our little girl  Ava Grace.  She's an absolute Angel!  Katie I pray for you always.  I want to hear another successful outcome.  I was on bed rest at the end of the pregnancy, and I can only imagine what it must be like for you with so long to go!  Just remember it's all going to be worth it and I could use a little of that rest right about now!  So enjoy while it lasts!  Your little guy will be keeping you busy soon enough.",
            "post_id": "3286138",
            "timestamp": "1218845319",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I am now 13 weeks pregnant and doing well.  I see my obgyn here in town and travel to Indianapolis often to see my high risk obgyn.  I will deliver at the IU med center because they are better equipped to handle any problems that should pop up.  I had another ultrasound this past Friday and we think it's a boy:)  We have a 13 year old son and a 7 year old daughter.  We wanted to make sure that everything progressed well past the 12 week point and have told our kids today that a baby is on the way.  Our daughter thought I was joking.  She has wanted for so long to be the older sister.  We told my family today and they were happy.  It has been such a rocky year with the loss of my mom.  (ovarian cancer)  It's nice to be able to share some happy news with everyone.  Well I'm going to look at craigslist for baby things.  We got rid of everything.  It is fun to buy new things:)  Good luck to everyone else.",
            "post_id": "3296688",
            "timestamp": "1219110285",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "Congratulations Jennie! I am only about 3 weeks along, and quite nervous! What were your periods like after your ablation? Mine were still heavy and the dr. did an u/s and said my uterus looked \"plush\". (I guess that's good?) I'm just at such an early point, and want to hear some positive news! Did your dr. say if you will have to get a hysterectomy right after giving birth? My dr. said I am the first person he has ever seen get pregnant after this surgery, so I am trying to look at it as a miracle, especially since I certainly wasn't trying.",
            "post_id": "3297003",
            "timestamp": "1219115909",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I'm back to give an update!  Yesterday afternoon I went to the my doctor.  I had initiated the visit and the transvaginal ultrasound and sonogram.  I wanted to see the condition of my uterus 9 months post-op.  Ladies I am happy to report that 5 months after my doctor telling me to forget about having a child I am thrilled to say that I have been given the green light!!  And for those of you who don't feel like going to back to look at my desperate and sad post in April of this year - I had Novasure in December 07 because of terrible painful periods. I was 36 and thought I was done having children. Right after the procedure I met the man of my dreams and we wanted very much to have a child of our own.  I went to see my doctor in March and he said to forget about getting pregnant.  It was awful.  AWFUL!My uterus has completely regenerated itself - 8 days into my cycle I have an 8mm lining which is completely normal.  My uterus is plump and healthy.  I am still only having very light periods though (2 days of spotting).  My doc told me that if he hadn't done the ablation himself (in Dec 07) he would have never known I had it done.  I've never seen my doctor look or act the way he did yesterday - HE was glowing.  I think he was shocked and amazed and sincerely happy to me (us).  The positive energy coming from him amazing.Although my doc told me he thinks this was all a coincedence he told me that he would never tell anyone to underestimate the power of the mind.  I think it was that but mostly Gods will.But I will tell you what I did that I know played an important role in all of this - and that is my lifestyle - both before and after the procedure.  My healthy lifestyle has finally proven itself!!  :)  First - I DO NOT SMOKE.  Second - I have an extremely healthy diet (whole grains, lots of green leafy veggies such as KALE and fresh dark green salads with veggies, lots of fresh berries everyday - rassberries, blueberries, blackberries, strawberries,. and soy bean \"edamame\" - organic whenever possible and affordable).  I do not eat **** such as fried foods, overprocessed food, junk food, sugars.  Third - I take 400IU of Vitamin E everyday along with a multi-vitamin.  And the last thing - starting in July I started taking 3000mg of BROMELAIN per day (3 seperate doses on an EMPTY stomach) for the first two weeks of my cycle.  Bromelain can help thicken the uterine lining.  You do not want to take this more than 2 weeks at the beginning.  There was a lot of research involved on my part with regards to Bromelain.  All I can tell you is that after one go around with Bromelain I started having RED blood instead of pink blood during my \"periods\".We have an appointment with an IVF doctor Sept. 8.  I'll update everyone then!Good luck to everyone!  There IS hope!!",
            "post_id": "3298419",
            "timestamp": "1219156115",
            "user_id": "user_475687",
            "user_link": "/personal_pages/user/475687",
            "votes": "0"
        },
        {
            "answer": "I'm doing well today.  I was actually able to set foot in my favorite Mexican restaurant today and not feel like throwing up!  For some reason when I am pregnant I just can't eat Mexican food, seafood or popcorn:(  To answer your question~ Before my ablation my periods were extremely heavy.  After the ablation I still had periods each month, but they were very manageable.  My doctor has done many ablation procedures, but I am the first one that has gotten pregnant after.  He sent me to Indianapolis within a week to see a maternal fetal health specialist.  She let me know that while it is a definite possibility that I will need a hysterectomy upon delivery, that she has had patients that have delivered vaginally.  I have an appointment tomorrow morning with my doctor here in town and another appointment in Indianapolis in 4 weeks.  They have done either a vaginal ultrasound or regular ultrasound at each appointment.  I will be having some sort of special ultrasound when I go back to Indianapolis.  I think the thing I am having trouble with right now is putting on weight.  The morning sickness has been a pain to deal with this time around.Well, I am going to take my dog on a walk before my kids arrive home from school.  Have a good afternoon everyone:)   ~~I would still recommend the ablation procedure, it was the only thing that helped me.  I just wish that we would have tried for this baby before we had the procedure done.  It would be a lot less scary.",
            "post_id": "3299643",
            "timestamp": "1219172570",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "My doctor also told me that he had ONE patient who got pregnant after ablation so far - just one.  She had a history of infertility - extremely heavy periods and opted for the ablation at the age of 40.  9 month later she got pregnant and went on  to have a healthy baby.",
            "post_id": "3303037",
            "timestamp": "1219242572",
            "user_id": "user_475687",
            "user_link": "/personal_pages/user/475687",
            "votes": "0"
        },
        {
            "answer": "Well, I was having a bit of light brown spotting, so went in for a check-up today instead of tomorrow. I am only at 5 weeks, so the dr did an u/s assuming he wouldn't see anything. He saw a little \"pea\" in my uterus and thought that might be the baby.We did bloodwork and my HGC came back 1776  (hooray!) and my progesterone 21.5.He also called teh company that makes the HTA (Hydrothermal ablasion which is the type I had), and they had never heard of anyone getting pregnant! So between my doctor, my past doctor, and this company, I am the only one they know of getting pregnant. He said within the next 7 to 10 days, we should be able to get a heart beat.I don't want to get too excited this early, but I really feel like this is a miracle from God!Jennie, I'm happy to hear you are doing so well, and also that your specialist has delivered healthy babies this way!",
            "post_id": "3305027",
            "timestamp": "1219268490",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I absolutely believe that God is the reason for your baby!  I went thru years of infertility after the birth of my other children...We tried up to the point of the ablation, and I always said f it's God's will, it will happen.  It never did so we gave up and had the ablation, and what do you know, 9 months later we were pregnant.  Everything is done in God's time.  Not when we think we want or need something.  Keep you faith and stay positive.  I know it's hard, but surround your little one with positive energy!Good luckJewell1117",
            "post_id": "3305073",
            "timestamp": "1219269264",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Thank you so much Jewel! I always read your story and it keeps me feeling positive!~Holly",
            "post_id": "3305613",
            "timestamp": "1219276698",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Thank you all for the encouraging stories!  I had ablasion done in Jan 08. Just found out that I am 6 wks pregnant! However I am very scared and confused! My dr says there have not been enough cases like this to have any accurate stats and that I will probably miscarry. I do believe God has his own plan for each of us.",
            "post_id": "3310847",
            "timestamp": "1219376359",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Congratulations!I am just wondering what you periods were like after you ablation.Were they lighter than before or still heavy? Did your doctor test your HCG levels, progesterone and do an ultrasound? I just want to know if your doctor said this on a whim or did some tests.Also, did he look at your uterus on an ultrasound? He should be able to see the state of your uterus, and also at 6 weeks, see a possible sac.~Holly",
            "post_id": "3311905",
            "timestamp": "1219413512",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Had a 1 heavy period in March 08 and had a light 1 in June! My dr did do an ultrasound did see the sac. He did not mention anything about my uterus and I go back on Sept 12 for blood work. The only other thing he said was if I did carry they would do c section. I have had 3 very difficult pregnancy already! PleAse give me any info u have or if there are issues I should bring up. My dr says this is so uncommon and he truely acts as if they don't know much.",
            "post_id": "3312729",
            "timestamp": "1219426013",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "i left my husband and we are divorce now and i found a wonderful man that wants a baby but the thing is i had a ablation and i also had my tubes cut and tied and i was wondering if  we could do in-vitro fertilization would it hurt me to do this or is our best bet to just adopt a baby . could someone please help me .",
            "post_id": "3314004",
            "timestamp": "1219448067",
            "user_id": "user_597198",
            "user_link": "/personal_pages/user/597198",
            "votes": "0"
        },
        {
            "answer": "I know that they watched my uterus very carefully.  I had ultrasounds ever 4 weeks thru entire pregnancy.  They were watching the baies growth rate as well as to see if the placenta had developed an Accreta (which it had)  That is were the placenta grows so deep into the uteran wall that it cannot release at child birth.  Therefore they did a C section as well as a hysterectomy.  They also had me on moderate bed rest at end of the pregnancy to stop some preterm labor.  I know that my Dr. had consulted with a Dr. a the Mayo clinic thru entire pregnancy, because it was the first time he had this happen.  So maybe your Dr. can seek some advice as well.Good Luck",
            "post_id": "3314534",
            "timestamp": "1219457387",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "My Obgyn is going to send me to a specialist, and he will also monitor me. I will let you know what he has to say. Until then, I really just have to sit and wait.This situation is so rare, that doctors don't know anything about it. I know that there is a difference in the types of ablation. The Novasure is more much more powerful than the Hydrothermal.Jewell, which type of ablation did you have?Girlpower, as soon as I go to my specialist in the next 2 weeks, I will let you know.I wouldn't make any decisions based on what one doctor says. I would get a second opinion.",
            "post_id": "3315840",
            "timestamp": "1219502372",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I had what was called roller ball ablation.",
            "post_id": "3315859",
            "timestamp": "1219502788",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Please keep me posted! I am just staying positive and knowing that God will get me through this!",
            "post_id": "3317384",
            "timestamp": "1219534932",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "How early did they detect detect placenta problems?",
            "post_id": "3317555",
            "timestamp": "1219538364",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "If it helps you to know, I had the Novasure procedure done.  I am feeling well today and will be taking my 7 yr old out for breakfast:)  I heard my baby's heart beat at my appointment this past week.  The doctor said it sounded great and I am beginning my 14th week.  I hope everyone has a great day!  ~Jennie",
            "post_id": "3318939",
            "timestamp": "1219584394",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "I am in the excact same situation you are in. I have talked to a specialist here that does tubal reversals called chapel hill tubal reversals dr berger, he is very successful and women from all over come to him. It is 5900.00 and all they need is your records from the ablation and the reversal. My reversal I had done they said is a high success rate, only thing with the ablation is i would need an u/s to measure the thickness of my lining, if i chose to have that done, but they do not require it. I am goin to have the reversal done as soon as we save the money and just home god takes over the rest! I did not realize so many women getting pregnant after an ablation until after i came upone this site. I just wonder if there are more women who had an ablation who are either on birth control or had there tubes tied and that is why there are not more pregnancies with the procedure then there are. I had the novasure in 2006 but i am starting to have very light 1 day spotting return. I have read that if you have it done in you r early thirties the linig has a more chance of regenerating and periods return then if you had it done at a later age.",
            "post_id": "3322282",
            "timestamp": "1219670954",
            "user_id": "user_575192",
            "user_link": "/personal_pages/user/575192",
            "votes": "0"
        },
        {
            "answer": "They found the Accreta at 22 weeks along.",
            "post_id": "3322709",
            "timestamp": "1219677305",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I was feeling fine and I'm still feeling fine, but I had a great deal of bleeding (clots and blood) this morning and actually had to go to the emergency room.  Our baby is still there.  We saw him on ultrasound and heard the heartbeat (normal).  The radiologist and doctor spoke with us and everything pertaining to our pregnancy looks ok right now.  The whole thing was pretty scary.  I never had any pain.  Has this happened to anyone else?  I know that because I had an ablation that this is very risky.  I have posted prior to this if anyone needs more background info.  Any response would be appreciated.  ~Thanks, Jennie",
            "post_id": "3327802",
            "timestamp": "1219775358",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "Oh my God Jennie!Thank GOD you and baby are okay! But what a scary ordeal you must have been going through! Did they put you on bedrest? I am just so sorry....you must have been a nervous wreck. Please keep us posted on why they think this happened.",
            "post_id": "3328493",
            "timestamp": "1219784960",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Go back and read Teceepink's post. She had the same type of bleeding. Maybe that will help.",
            "post_id": "3328535",
            "timestamp": "1219785464",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Thanks for your response.  I did go back and read that post and it made me feel better.  I'll let you all know how things go.  I'm still feeling ok.  Have a good evening:)",
            "post_id": "3328923",
            "timestamp": "1219791368",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "I had the novasure procedure in 2005.  I took a HPT last week. My OB/GYN had me come in immediately for ultrasound and labwork.  We saw the baby yesterday and heard the heartbeat. I am 8 weeks and 5 days according to measurements.The ultrasound tech said that if she did not know that I had the EA done, she would have not known by looking at my lining.  I have not had a period since early this year.  Although prior to that I had very light flow for approx. a week or so, but not every month.I am the first in my Dr's practice (4 other Dr.s) that is pregnant after EA.  She is excited and optimistic. However, she has referred me to a high risk specialist and will also continue to see me. She said she will be doing a lot of research and we will go through this together...informed and ready for anything.  I feel 110% better after seeing her yesterday.  We did talk about all of the scenarios and placentia acretia and the end result if that happens (c-section and removal of the uterus). But, she was very optimistic and I feel great.  We are excited though still shocked.  We have an 11 yo and 8 you and I will be 40 next month.If anyone in the same situation wants to email me privately:  spotsr4me   @    gmail  .comJodi",
            "post_id": "3332908",
            "timestamp": "1219866572",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "I also want to put out my e-mail: ***@****. I think it is important that we all share in this together and collect all of the information we can.",
            "post_id": "3334309",
            "timestamp": "1219886403",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "hollygannonphoto   @   aol  .  com",
            "post_id": "3334316",
            "timestamp": "1219886490",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Sorry have not been feeling well! Lots of cramping! I went into the dr today and they did another ultrasound he said everything looked good, got to see the heart beat! That was so exciting, it is always such a miracle! Dr did say even tho all looks good there is still a huge possibility that the implantation might not b a good one and I can still miscarry! Talk about a rollercoaster ride. However I am 9 wks and that is a good thing!",
            "post_id": "3334332",
            "timestamp": "1219886748",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Congratulations on the heartbeat! And you are further along than you thought!As far as the cramping, I was having it constantly, now it comes and goes. I had it really bad earlier today, I think due to stress. I actually went on a bikeride and it subsided. I have read where some women have cramping well into their second month.Anyway, hope that makes you feel better. Why does your doctor think you will automatically have implantation? Could he see that the baby had implanted himself on the ultrasound? This is all so confusing!",
            "post_id": "3334801",
            "timestamp": "1219894415",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "katie I wish you the best, I will keep you in my prayers ~d",
            "post_id": "3336274",
            "timestamp": "1219935527",
            "user_id": "user_177382",
            "user_link": "/personal_pages/user/177382",
            "votes": "0"
        },
        {
            "answer": "I am praying for u!",
            "post_id": "3336442",
            "timestamp": "1219938102",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Hi Everyone,I am 38 and recently divorced.  I had my tubes cut and tied 13 years ago.  I also had the ablation surgery last year for heavy periods.  I did not plan on having any more children and really didn't think that I wanted to.  Unexpectedly, I met a wonderful man that I have now been dating for 7 months.  We have been talking marriage, but he is a little younger than me and he doesn't have any children and I know that he wants a child.  I really want to have a child with him and I am considering a tubal reversal, but I am really scared of the possiblity of getting pregnant after the ablation surgery.  I need some good advice.  I am not sure where to start.",
            "post_id": "3336782",
            "timestamp": "1219942548",
            "user_id": "user_603517",
            "user_link": "/personal_pages/user/603517",
            "votes": "0"
        },
        {
            "answer": "I am praying for you. I can't begin to imagine what you are going through.Please keep us posted.~Holly",
            "post_id": "3336890",
            "timestamp": "1219944104",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "My dr said the baby looks good but that did not mean it had a good implant and I could still miscarry and that there was nothing we could do but wait and see! I am so confused!  My dr has not even mentioned sending me 2 a maternal fetal dr. Should I initiate that?",
            "post_id": "3336913",
            "timestamp": "1219944349",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I went to my doctor today, and we heard/saw the heart beat! He said I am 6 weeks and one day. He is scheduling me to go see a specialist in two weeks time. I go see him one more time before that for another ultrasound. I would definitely initiate that. I think it will give you peace of mind.",
            "post_id": "3337429",
            "timestamp": "1219951632",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "See my post from aug 25th. I am in the same situation you are, 33 y/o Divorced and recently remarried and want a child with my new husband and i ahd a tubal in 1998 and Novasure in 2006. Start by finding a tubal reversal specialist and have him review your op notes from the ablation and the tubal and you will need an u/s to measure the thickness of your lining to see if it is thick enough to hold an implantation. I am saving for the reversal and not electing the u/s and just praying god will take care of the rest.",
            "post_id": "3337531",
            "timestamp": "1219952925",
            "user_id": "user_575192",
            "user_link": "/personal_pages/user/575192",
            "votes": "0"
        },
        {
            "answer": "Thank you...I did read your post.  I saw Dr. Bergers web site yesterday.  I do feel like there may be some hope now.  It definitely gives me a place to start.  I hope everything goes good for you.",
            "post_id": "3340234",
            "timestamp": "1220014296",
            "user_id": "user_603517",
            "user_link": "/personal_pages/user/603517",
            "votes": "0"
        },
        {
            "answer": "Has anyone heard anything via email about Katie16? I am still very worried! Katie I am praying for you and your family!",
            "post_id": "3341756",
            "timestamp": "1220039678",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I'm worried too. I keep checking this forum every time I log on.",
            "post_id": "3342014",
            "timestamp": "1220044184",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Hi everyone! I had the NovaSure procedure done on Feb 15, 2008. We have a healthy happy 6 year-old daughter whom we adore. We did not think we wanted anymore children...but somehow, somewhere along the way we changed our minds. I called my on OB today and he left me a message saying pregnancy was not recomended and gave me a surrogacy clinic phone #, which I am not interested in. After reading several of your stories I feel like I just want to go for it... but I need to be resoponsible for the child that is here now, ..i I know what I want to do but not sure if I should......any thoughts?",
            "post_id": "3342837",
            "timestamp": "1220059944",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "Two days ago I would have told you to throw caution to the wind, but after waiting and not hearing anything from Katie16 the realization of how dangerous this can be kicked in!  I was lucky, I had my happy ending but it could have turned in a heartbeat.  Just be really cautious of what could happen to you, as well as any future baby before you make the decision.  My pregnancy was unexpected, I don't think I would have ever deliberately tried to get pregnant given the possibilities. With that being said, I do believe in miracles, that's why it's so hard to give you advice. Only you can decide what's best for you and your family!  We all need to continue to pray for Katie.  I can't get her off my mind.  Hopefully we will be hearing some good news real soon!",
            "post_id": "3342981",
            "timestamp": "1220062146",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "ncbeachgirl, do you have periods? If you don't, you most likely won't get pregnant. You should go get an ultrasound to see how your uterus looks. If it looks too thin, than you are putting yourself at risk. I'm only 6 weeks and have no idea what I'm in for. This was not planned. All I can do is pray for a miracle. I don't see a high risk OB for 2 more weeks.Jewell, I am so worried for Katie too. Hopefully she is resting and hasn't gotten to the computer yet. Maybe we'll hear something tomorrow.",
            "post_id": "3343260",
            "timestamp": "1220067848",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Well I see still no word from Katie! That is so scary, the gals on here are all I have found with anything positive to say about this type of pregnancy and then when we see one with complications and no word of how things are, you cant help but fear the worst!  However, KATIE I AM PRAYING FOR YOU! I am with you Holly (Hellodian) It is hard to advise anyone to try to get pregnanct after ablation. A pregnancy can always have complications resulting in tragedy but from what you read a pregnancy after ablation increases those risks GREATLY!!! I have a very strong faith though and I believe that God has his own plan for each of us and that is the only thing that keeps me from spinning out of control like Taz! I have always had fertility problems, then was eclamptic with my first child and had preeclampsia with my two youngest spent many weeks on bed rest. Delivered my first at 32wks, 2nd at 35wks and my 3rd at 36wks. So I already realize that I will be hit with a double edged sword if I carry this baby.  Now I am 9 wks pregnant and scared as HELL!!  Maybe this will be my first flawless unactive pregnancy!!!  My hubby decided we should tell our girls I dont know if it was the right thing to do or not but its done. We live in a small farm community and have always been very involved so everyone knows our children-my middle one spread the word very fast at the football game tonight.  It is so hard for me though because we have known all these people are whole lives they have watched us grow and our girls grow since birth and have always givin us a hard time about a boy! (My hubby was our big all state QB, all state Basketball, blah, blah, blah WE have been together since his mom babysit me at age 4) So everyone is so excited and praying for a boy and I am just praying I carry this baby and it does not kill one of us!!  How do I handle that situation?  These folks have all taken care of my family while I was down with the other pregnancy so they are just expecting me to be down a while and give them another baby to spoil and watch grow.  It is very hard for me to deal with.  I am just trying to stay positive!! The more of my 'family' here that knows the more prayers going out for us!",
            "post_id": "3343480",
            "timestamp": "1220074611",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Girlpower, Wow! Sounds like you have a great network of family and friends! You are almost 3 weeks ahead of me and I am waiting to see the high risk specialist before telling my daughter and parents. My partner hasn't told anyone yet. He's so scared, plus first child for him! We lost my little brother in March, so I don't even know how to tell my mom, she will be so consumed with worry.Jewell, I wanted to say thank you so much for staying on this forum. You are the only hope we have, and I know I'm going to have alot of questions for you as this progresses!",
            "post_id": "3344199",
            "timestamp": "1220105255",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Just reread my earlier post that would be \"our girls\"",
            "post_id": "3344220",
            "timestamp": "1220105527",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I never thought I would be continuing on this site after Ava was born, but I've been so compelled by everyones story that I just can't stop caring about you all.  I remember being so sad, scared and confused and nobody could understand, except for the people that were going though it as well.  The longer it goes without talking to Katie the more fearful I become.  My hopes are that they admitted her to Hospital and both Mom & baby are doing well.  She had mentioned on  a previous occassion that if something bad had happened her twin sister would reach us.  Since we haven't heard I choose to believe they will both be just fine.",
            "post_id": "3344284",
            "timestamp": "1220107200",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Thank you for responding, I have very light 3 maybe 4 day periods with some mild to moderate cramping the same time every month. So I am hopefull! I plan to talk to my Ob again next week.",
            "post_id": "3344758",
            "timestamp": "1220118116",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "Thank you for always being positive! As you know we all need that.",
            "post_id": "3345176",
            "timestamp": "1220128642",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Hello there, I am writting because I was so compelled to. All of your stories have touched my heart so much. I have been trying to do research on Ablation for so long and this is the first time that I have found any information at all that is even remotly helpful. You all have given me so much hope. I already have three children and am only 28 years old. I had an extremely bad divorce. I have been with my now fiance for four years. We will be married in April. This seems to be a very common problem but he has no children. I know how badly he wants a baby. He treats my three as his own but I know that it is different. I had an endometrial ablation in '06. I want to be able to give my fiance a child so desperatly. He will not even let me discuss it with him because of his fear of the dangers. (I am going to have him read these posts). After I had my first child I had surgery to remove cancer on my cervix. I was told that I would NEVER have anymore children. I had two more gorgious healthy babies. When I was pregnat with my daughter (my youngest) I kept telling the doctors that there was something wrong with her heart. I have no idea how I knew this, I just felt it. Throughout my pregnancy and even after she was born they listened to me only lightly and kept an eye on her heart. When she was four years old she had heart surgery. She is healthy and wonderful now. And now, I can't explain it but I KNOW that I can have another child. Even after the Endometrial Ablation. I'm sure that I can have another one, I just feel it. Any advice or concerns anybody else can share with me? For those of you that have become pregnant after the procedure was it worth it to you? I guess my ONLY fear would be a doctor trying to talk me into an abortion. I am 100% absolutly against abortion. Honostly, if a doctor told me tomarrow that I would die if I did not have this abortion then I would go home with my child still in the womb and hold all three of my babies very tightly tell them how much I love them and pray very hard. I would NEVER have an aboriton. Your stories of having children after ablation are very uplifting. My doctors never fully discussed any complications of getting pregnant or anythign they just basically said that I should take a birth control to prevent it (which I never have). Thank you all for your stories.",
            "post_id": "3345913",
            "timestamp": "1220146477",
            "user_id": "user_605644",
            "user_link": "/personal_pages/user/605644",
            "votes": "0"
        },
        {
            "answer": "I am in somewhat of the same boat as you. We want another one too, I should have waited. I only have 1 child, but I had a very good pregnancy and I feel I too can do it again even though the odds are against us. I am against abortion too but I could not bear not being here to take care of my daughter, it gives me chills to think about it..... I know this is not helpful or inspiring but just the same I thought I would share anyway..:-)",
            "post_id": "3345956",
            "timestamp": "1220147287",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "Well, this morning I woke up to some brown spotting and cramping. The spotting so far only occurs when I \"pee\". My dr. wants me to rest, as he is concerned about the cramping. As long as I don't bleed red blood, I will go see him on tuesday morning.It always seems like these things happen on holiday weekends.:(I am so scared, but trying to remain optimistic. My dr. was so relieved last week when he saw the heartbeat.Still no word from Katie?",
            "post_id": "3349050",
            "timestamp": "1220232622",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "It is normal to have a brownish discharge during any pregnancy under the best of circumstances.  I had it quite a bit with my first daughter.  It is terrifying but maybe look at is a good excuse to get some much needed rest!  Stress won't help you or baby, so take it easy for awhile.  Make your husband and family wait on you hand and foot. :)  Take care and keep us informed.",
            "post_id": "3350742",
            "timestamp": "1220283497",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I am going to talk to my OB tomorrow about trying to have another baby, I still get my period the same time every month. I do not bleed as bad but I do still have some small clots. Does this mean that I still have some of my endometrium entact? Should I start by requesting an ultrasound? Any feedback would be helpful!",
            "post_id": "3352476",
            "timestamp": "1220318236",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "I am beginning my 15th week.  I have continued to spot since my bleeding problem last week, but just a bit earlier this evening I started to bleed more.  I am also having a little bit of pain.  I have taken it easy for the last week and tried to rest a lot.  I don't think I've ever sat around for such a prolonged time and let other people do things for me.  I am going to try to wait until morning and then contact my doctor.  They really did nothing in the emergency room last time for me other then tell me I was having a \"threatened miscarriage\".  If anything it was just really stressful.  The doctor was pretty clueless about the ablation procedure and why it could affect my pregnancy in a bad way.  There are only 2 hospitals in my town.  I am going to try to sleep and hopefully things will be better in the morning.  Good luck to everyone else  ~Jennie",
            "post_id": "3352545",
            "timestamp": "1220319356",
            "user_id": "user_555959",
            "user_link": "/personal_pages/user/555959",
            "votes": "0"
        },
        {
            "answer": "Sounds familiar! I went in to see my doctor this morning and he said I was also having a \"threatened miscarriage.\" Also, he said the size of my sac is about a week delayed.(I will be 7 weeks on wednesday.)I go see a specialist who supposedly has a very \"state of the art\" ultrasound on the 12th.I am also supposed to take it easy, but it's going to be tough with 2 kids, 3 dogs, 2 cats, and my boyfriend who is 2 1/2 hours away! Atleast I am very lucky in the sense that I don't have to go to work.I guess all of us who are in this boat, and who all seem to have the same issues with the bleeding and cramping, is just pray, stay positive, rest, drink lots of water, eat lots of good food, pray and rest!~Holly",
            "post_id": "3354279",
            "timestamp": "1220367761",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "You get some rest girl! It would be nice if we all lived close to eachother we could help eachother out! What is a threatened miscarriage? Meaning it is happening or could be? I am so sorry you are going through this! Take care and I will be praying for you!",
            "post_id": "3354464",
            "timestamp": "1220370262",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I continue to pray for you all!",
            "post_id": "3355377",
            "timestamp": "1220383504",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I had total ablation after an unpassed m/c dec06... i was told i would never get pregnant, got the depo shot to prevent the possibility, took yasmin on top of that for cyst prevention... I AM DUE END OF SEPT, TO OCT 7TH, THEY MAY NOT HAVE ME GO FULL 40. I AM CURRENTLY 35WKS, 0DAYS. HEALTHY AND HAPPY. THE ONLY PROBLEMS I EXPERIENCED WERE AND ARE FETAL GROWTH LAGGING. MY UTERUS AND PLACENTA ARE NOT GROWN TOGETHER. GOD DOES BRING MIRACLES. THIS WILL BE MY FIRST LIVE BIRTH! LONG LIVE AND GOD LOVE ELIJAH IMMANUEL!",
            "post_id": "3355405",
            "timestamp": "1220383889",
            "user_id": "user_537664",
            "user_link": "/personal_pages/user/537664",
            "votes": "0"
        },
        {
            "answer": "That is wonderful! Congratulations!To All:My OB called me back today and he said that even an ultrasound would not be able to tell if I had any part of  my uterine lining, or enough to carry a baby. He said that it is so microscopic that we could not tell. I want to think he just does not want to deal with me....he just wants to talk about having a surrogate...but I don't..... I guess I am just stubborn!",
            "post_id": "3355444",
            "timestamp": "1220384453",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "You can call around to different maternal specialists/high risk OBs and find someone who has the type of ultrasound that can look more closely at your lining.It sounds to me that he doesn't want to deal with you. Is he the one that did the ablation? I would go to someone else.~Holly",
            "post_id": "3356412",
            "timestamp": "1220398116",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I guess it means that it could happen because of the tan blood and cramps. But it seems alot of women have these symptoms in the first trimester.",
            "post_id": "3356424",
            "timestamp": "1220398238",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "That is awesome news! Just reading that gives me a little more confidence.  I am now 9 1/2 weeks and see my high risk Dr. tomorrow for the first time.Jodi",
            "post_id": "3356840",
            "timestamp": "1220405403",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "The ultrasound tech at my OB's office said that if  she hadn't know I had the surgery she would not have been able to tell because my lining looked normal.  My  OB said that with the technology available in \"today's ultrasounds\" that we would be able to watch closely to see where the baby implants (lining or uternine wall).Not that I am advising you to pursue this, because I still worry about our outcome...but if you are sure you want to, then I would advise you look elsewhere for a Dr.  I was very afraid that my OB was going to \"kick me to the curb\" because she had warned me of the dangers when I had the surgery, but she is actually very excited and extremely supportive.Jodi",
            "post_id": "3356884",
            "timestamp": "1220406073",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "Wow am I glad I found this Forum! This is the first positive I've read yet about being pregnant after an ablation. So here I go :o)Hi, my name is Stacy. I'm 35 years old with 2 kids 12 & 7. I had an ablation when I was 31. I just found out I'm pregnant. I always wanted another baby. Hence the reason I didn't have a hysterectomy and chose ablation instead :o) My Dr told me the chances of me getting pregnant afterwards was slim to none. Wow is he going to be surprised on the 19th when I show up to my first appointment... hahaha! I'm scared to death reading all the bad stuff that can happen. My husband is very worried as well :o( This forum has already brought some peace of mind. Thank you all for sharing your intimate stories with the world. If we only had all the negative stuff out there, some of us may have chose different routes for our babies :o(Looks like miracles can happen!StacyJ",
            "post_id": "3358016",
            "timestamp": "1220437969",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "I had my ablation back in 06. I sometimes have a day of a very light cycle. Were either of you having a cycle around the time you got pregnant. The first year I did not have any signs of a cycle but now it is like it is slowly coming back.",
            "post_id": "3358890",
            "timestamp": "1220455676",
            "user_id": "user_575192",
            "user_link": "/personal_pages/user/575192",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for the feedback! I have since called and made an appointment at the Jones Institute. I talked to a patient coordinator there and she set me up for a consultation with a specialist. The best part is, is that my insurance will cover the appointment! I am so excited that finally a dr. does not think I am crazy! They are going to do an ultrasound and check things out. The other part to my delema is that my husband had a vasectomy about a year ago. They might have to do this through INV if at all. They also offer a shared-risk plan for qualifying patients. If you have not heard of this, it is where they offer you 50-100% of you money back if you do not have a live birth or if conception fails... but again you have to meet certain criteria to qualify.. I wonder if desperation qualifies :-)",
            "post_id": "3359005",
            "timestamp": "1220457411",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "I am new to the forum myself... but welcome! Congratulations and please keep posting updates! I beleive that pretty soon this will not be such an uncommon thing!",
            "post_id": "3359025",
            "timestamp": "1220457677",
            "user_id": "user_604916",
            "user_link": "/personal_pages/user/604916",
            "votes": "0"
        },
        {
            "answer": "Just a little funny, but today I got my PERIOD!  The funny part is, is that I had a hysterectomy at my daughters birth!  I called the Doc and he said in very small cases they may have left some of uterine lining around the cervix and that would cause a period.  I'm beginning to think I have a \"Super Uterus\" or something.  How rediculous is that?  He said I had more chances of winning the Lotto.  Thats funny that's the same thing he said to me after my Ablation, when I asked my chances of a pregnancy!  I think I should start playing the Lotto! :-)",
            "post_id": "3359169",
            "timestamp": "1220460128",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Oh that is funny! I remember I used to secretly cuss my doctor everytime I got a heavy period after the ablation! Now I thank God!",
            "post_id": "3359425",
            "timestamp": "1220464292",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I am having a very rough time!  No bleeding but a lot of pain and heavy discharge the same type I had after my ablation!  The pressure is almost unbearable as well. Has anyone had this trouble? I had my girls without any pain meds and this pain just about has me screaming epideral PLEASE!CONGRATULATIONS to all you new comers who are pregnant!!Jewell if I was you I would be playing powerball!!",
            "post_id": "3359487",
            "timestamp": "1220465150",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Thank God all is well!  Did they keep you in the hospital? Why did they think the bleeding was happening? Continue to get rest and I'm so relieved to hear the both of you are well!  I'll continue to pray for you!",
            "post_id": "3359798",
            "timestamp": "1220470216",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "katie i was so worried. i'm am so glad you are ok.  pls take it easy and i will keep you in my prayers as well  ~d",
            "post_id": "3359927",
            "timestamp": "1220472303",
            "user_id": "user_177382",
            "user_link": "/personal_pages/user/177382",
            "votes": "0"
        },
        {
            "answer": "Katie~ Thank God you are both okay! What did they think happened?Girlpower~ I had the same thing after my ablation...lots of clearish fluid and kind of gross.It was an infection. You should call your doctor right away. They may have to put you on an antibiotic.",
            "post_id": "3360275",
            "timestamp": "1220477272",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I've had a cycle from day one. That's how I knew something wasn't right. FOr the last few months my menstrual has gotten a bit heavier, but still nothing like before. I even started to have mild cramps. Anyway, come this last Friday, I thought I started. Put a tampon in as usual and a few hours later there was nothing. Just a small spot. Same thing happened on Saturday. I knew then I was pregnant. Took 2 pregnancy tests, one yesterday and one first thing this morning, both were positive :o) I'm so happy, but REALLY friggin scared.....",
            "post_id": "3360622",
            "timestamp": "1220483154",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "Katie I am so thankful everything is ok, that had to be very scary!!  I will continue to pray for you!! You take it easy!!  Do they know the cause of the bleeding?Holly, I had infection after my ablation too. I was just wondering though if this could have something to do with the pregnancy?  I did go to the dr yesterday for all the pressure and I had a UTI so they put me on macrobid!  I am in hopes that will help soon.",
            "post_id": "3363952",
            "timestamp": "1220555584",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Thank goodness it was just a UTI and not a bacterial infection. The infection I had after the ablation was bacterial.This pregnancy is so different from my last. It seems to go day to day.Yesterday I was crampy and spotty, today I'm not cramping and only spotted tan this morning. I have to wait til wednesday to find out if the sac has caught up. I guess that has to happen for the pregnancy to progress. I am praying like crazy!!!!Has anyone else had the sac a week behind in size? Or heard of anyone else who has?",
            "post_id": "3364551",
            "timestamp": "1220564778",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Question: Is it common to bleed throughout this kind of pregnancy? Or does it just depend on the circumstances of each individual? Also, was it common for any of you to feel more pregnant than you really are? Meaning the pressure in your stomach is more intense and the pressure in the uteris is more prominant? I'm asking because I feel like I'm 4 months pregnant, my stomach is bloated, but I know I can't be more than maybe 4 weeks or so. Have any of that have had periods every month since the ablation ever found out they were further along than the last missed period?Sorry for all the questions.",
            "post_id": "3365121",
            "timestamp": "1220574715",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "I am only 10 weeks but do relate with you about all the pressure and bloating! I even look as if I am much further along!  They told me mine was from my UTI but I have been on the macrobid for 2 days and no difference. My doctor is very calm about this pregnancy like it is no big deal at all.  He is more worried about the preeclampsia, I have had it with all 3 of my pregnancies so he is positive it WILL be an issue with this one as well \"if I carry!\" I was eclamptic with my first (had seizures during delivery). I only had 2 periods from Jan to July so I am not much help there! I will be praying for you that all goes well.Keep asking questions because we are all learning together!",
            "post_id": "3365375",
            "timestamp": "1220579018",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Thanks for the response. I read this entire thread last night to find some of my answers. It's amazing to me how many of us have gotten pregnant after the ablation. I always knew deep down it could happen :o) And now I'm finding out the positive side of it :o) Apparently, we will be the stepping stones for those to come behind us :o) I will be praying for you as well. I'm a firm believer tho, that God has his hands in all our babies lives :o)",
            "post_id": "3366272",
            "timestamp": "1220607488",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "I have three kids and my husband had a vasectomy a month ago. I have been on birth control patches continually, i really thought i was done. But tonight, im not so sure... I love my kids, my son almost died at birth from group b sepsis. I know what God can do. My God is a mountain mover. But, I am not so sure I was listening to him when I got this procedure. I just had it in June, my chances for pregnancy are slim, i know. I don't have period because i am on contiuous birth control.Anyways, i have set up tonight as my family lie sleeping, reading your stories. I have cried with you and smiled. I loved reading that you all trust the Lord. It was the best decision I ever made getting to know him. I know God is in control. Know that tonight, I hit my knees for you mighty women of God. Those babies are miracles, know that God has an awesome and mighty plan for their lives.",
            "post_id": "3370171",
            "timestamp": "1220683244",
            "user_id": "user_611555",
            "user_link": "/personal_pages/user/611555",
            "votes": "0"
        },
        {
            "answer": "Thank you for your words. I truly believe this pregnancy is meant to be and meant to make it to the end with a beautiful baby born :o) I knew when I got the procedure done what my chances were. However, those chances were higher than a hysterectomy. I always wanted another one. I was so sad when I had to do this. At the same time, I knew even if my chances were only 1% it was better then none. And here I am :o) It's truthful God is a miracle maker. My son for a VERY sick baby when he was born. Doc's said he would never do anything. He's now 12 walking, talking and living a VERY normal 12 yr old life. Is it so much to ask for another? I figure he knows what he wants for us. He is the reason we have these babies. ANd through it all, I pray he keeps them safe and healthy :o)",
            "post_id": "3370728",
            "timestamp": "1220707172",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "I feel that the Lord does have a plan for each of us!  On the days that things are rough I know it is him that helps me to get through it all!  I had another ultrasound on Friday because I am having so much pain and pressure still.  I did still have a UTI and my bladder is not emptying so they put a cath in for me to wear for a while.  I am trying to take it easy as the Doc has advised however with 3 girls 15, 6 and 20months, our cattle, the garden and all the other everyday chores we all face it is becoming harder and harder! We also run our own tile installation business so my hubby sometimes works crazy hours.   My oldest, which is a HUGE help is sick right now (she has been for a week they think her gallbladder is bad) and having a bum ankle and being on crutches it makes it rough she does not feel like wrestling the lil one around either!  We have a very large and loving support group here with all our friends and family but I hate having to use up all my resources so early in the pregnancy.  I know that God will guide us through this just as he does everything else if we will allow him to.I continue to pray for all of you daily!!Holly, I hope you are feeling better and things are going well for you!Katie, I hope your bleeding has stopped and you and baby are still doing well.My US yesterday the baby still looked good.  I have a small place behind my placenta that is still bleeding that they are watching but doctor does not seem to be to worried said that can happen in a normal pregnancy.Everyone take care and with the power of prayer anything is possible.  God will be blessing 2009 with all our little miracles!!",
            "post_id": "3371136",
            "timestamp": "1220716220",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Just checking in. Hope everyone is doing well :o)",
            "post_id": "3377457",
            "timestamp": "1220869290",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "To Kristen-I am at a complete loss for words!  My heart is broken for you and Katie's children.  We knew there was a possibilty of this happening, but I thought having \"faith in God\" was enough.  I was so very wrong.  Try to take comfort in knowing she is not alone....She will forever be with her little \"Angel\" Nathan in Heaven.  My prayers are with you always!Julie",
            "post_id": "3378742",
            "timestamp": "1220894371",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "As I sit here crying, I can't even imagine what your family is going through. I felt so close to Katie, and looked forward to her stories each day. I was so worried the last time she was in the hospital, and I thought she was better. I am so very sorry. If there is a home address you can share, I would appreciate that. My e-mail isholly    gannon    photo    @    aol   .   comI have to space it out so they don't block it.I am so, so sorry. She was so easy to talk to, and even though I have never met her, I felt a connection with her. Please take care.Holly",
            "post_id": "3380010",
            "timestamp": "1220911160",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I just went back and read some older posts and realized you are her TWIN sister. I'm sure no one can even begin to understand the personal loss you are feeling. Again, I am so sorry.",
            "post_id": "3380669",
            "timestamp": "1220922371",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Thank you for having the strength to let us know about Katie and Nathan!  There are no words to comfort your family at this time but PLEASE know you will continue to be in my prayers! I am so sorry for your loss! I know just from what I learned about her on here that her family meant everything to her and her love for her children had no boundries! She truely thought of Nathan as MIRACLE OF GOD and she will forever hold him! Again I am very sorry for your loss.",
            "post_id": "3381893",
            "timestamp": "1220948160",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "this is very tragic and shocking and i am so so sorry to hear of your loss and i send out prayers for healing for her family, especially for her young children.",
            "post_id": "3382574",
            "timestamp": "1220968832",
            "user_id": "user_391963",
            "user_link": "/personal_pages/user/391963",
            "votes": "0"
        },
        {
            "answer": "I just got back from my U/S and the sac is almost all of the way caught up to baby :) but the doctor can see a bloodclot forming in my uterus. Jewell, did you have this? I go to the specialist on friday. I am 7w 1 day.",
            "post_id": "3383070",
            "timestamp": "1220976574",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I never had a blood clot. Everything look normal up til around 20 weeks.  My placenta was a very strange shape though.  It looked like 2 sections connected in middle.",
            "post_id": "3383255",
            "timestamp": "1220978830",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "What was the name of the specialist that your doctor spoke to at Mayo? I am getting my doctor in touch with a specialist there named Dr. Rose and was wondering if it was the same doctor.",
            "post_id": "3387087",
            "timestamp": "1221052246",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "My Doctor never mentioned his/or her name.  It probably is the same group though!  I am so happy to hear that he is contacting a specialist.  What do they think the blood clot is caused from?  Are they sure it's a clot?  I continue to pray for you!  It can't hurt to be too cautious in this case.  Have they given you your due date yet?",
            "post_id": "3387364",
            "timestamp": "1221056679",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Well, it looked like a big black mass. Who knows if it caused from the ablation or just a coincidence. I go see my Maternal Fetal medicine specialist on friday. He has supposedly had cases like this before, which comforts me. I am just trying to educate myself as much as possible. I have turned our blog into a file of information. I've taken procedures, dates, etc and put them together. Maybe someday it can help others. Ofcourse I am changing names. After what happened to Katie, I am just taking this alot more seriously. I still can't stop thinking about her and her family. My family lost my little brother in March, and I don't think they could take losing me, too! Plus I'm a single mom, and my kids would not only lose me, but lose everything else in their life.I just want to be aware and educated through this whole journey!",
            "post_id": "3387565",
            "timestamp": "1221059584",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "What happened to Jennie and JP (Jodi)? They both disappeared.",
            "post_id": "3387574",
            "timestamp": "1221059763",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Congratulations! But you must have the year wrong on your ablation date. If you had it January 2008, that was exactly nine months ago. You must have gotten pregnant right after that. What kind of an ablation did you have? I have never heard of anything like this. What complications have you had with your pregnancy? Are you seeing a specialist?Hve you had any bleeding or pre term labor?",
            "post_id": "3387609",
            "timestamp": "1221060103",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Wow! That is awesome! What kind of ablation did you have?",
            "post_id": "3389462",
            "timestamp": "1221083007",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Holly, I have what at first the dr said was a clot behind my placenta. However, after my US last  friday he referred to it as a small hemorage (spelling?) it did look like a small black marble and it sits directly behind the placenta.  He is watching it and he has done an US every week, it does not seem to be changing and baby is growing well. I am so happy to hear that your sac has caught up!  You must take it easy!!  My hubby has been very ill and in the hospital (he never even sees a dr and I am sure most our men act the same when ill :) so it has already been a very long week.  Dr says take it easy with this place behind the placenta BUT it has not been easy to do the last few days. We are finally home and I am trying to follow dr orders. What a challenge that can be!My dr looked at me yesterday and said and I quote \"I am sure you have been doing some reading about this pregnancy and you realize that we really have no clue how to handle this other than watch closely and see what happens\"  I will start seeing a Maternal/fetal specialist a little later. He said that until I was a lfurther along there was not anything they could do for me. That they would do some ultrasounds to look at growth and placenta if I continue to carry.  I am 11 wks and 1 day today and have watched baby grow the last 4 weeks and always hear a very strong heart beat.  I believe My Heavenly Father will hang onto this lil one for me.  Then I think about Katie though and the realization hits-IT IS SO UNPREDICTABLE.Summer CONGRATS! It is a blessing from God each time I hear a positive story because there are so many tragedies!  I will be praying all goes well with delivery.  Are you having c-section or does your doctor think you will deliver natural. Please keep us updated from now till delivery.",
            "post_id": "3390600",
            "timestamp": "1221099330",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I sure don't miss the days of constantly wondering and worrying about what's going on with my  baby.  I envy those women who seems to go thru the entire pregnancies without any complications or worries.  Everyone of my pregnancies had its issues. I was so scared for me, scared for the baby, and I was affraid to get too excited, because there was a constant fear something may go wrong.  I created a shield to protect my heart from breaking!  Then finally I put all my faith in God's hands.  Good or bad, I accepted what ever the future would bring to me.  Letting go, finally gave me a peace to make it thru the rest of my pregnancy.  Worry and stress and useless anxiety, do nothing good for you or your babies.  I just want you to know that there is hope and I will continue to pray for you both.  I know in my heart you and your babies are going to perfectly healthy!",
            "post_id": "3390769",
            "timestamp": "1221101707",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Thank you for your spiritual encouragement!  This site has truely blessed me with women like you who have the same love for our Lord as I do. I know that God will bless me always, he is my ROCK and he carries me through each and everyday!  There is much evidence just within my life that proves the power of prayer, I WILL CONTINUE TO PRAY FOR ALL OF YOU ON THIS SITE.  I pray for those especially that don't know the Lord in a personal way, because without MY GOD I would fall apart!",
            "post_id": "3390904",
            "timestamp": "1221104129",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I don't know if you will ever take another look at this site. Just want to let you know that your family will continue to stay in my prayers!!",
            "post_id": "3390916",
            "timestamp": "1221104289",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I am still here, just haven't been able to check the site. Any way to get these messages to come to my inbox?I am now 11 weeks pregnant and doing fine.  I have been to my OB and to a Specialist. I will be seeing them each monthly, so about every 2 weeks I see one or the other.  Neither practice has had a case of pregnancy after EA, but I feel confident with both of my Dr.'sI have had 2 ultrasounds and think I will have one every visit. They said everything looks good and the baby's heartbeat is good.  \"Peanut\" is also growing on schedule as expected.I think the majority of my worries lately have been over genetic issues as I will be 40 in less than 2 weeks. But after reading about Katie and baby Nathan, like most of you, I cried and asked myself \"What will my family do if that happens to me?\"  Will it have been worth it?   My specialist wants me to have the round of genetic tests done.  I told her that I was not willing to terminate for Down's or some other genetic issue, but she broke it down to me like this....   \"What if you go through all of this and have a baby that only lasts a few days (Trisomy 18) or yet, what if you go through all of this, don't make it yourself and your husband has a baby that only lives 2 days.\"  It hit me then, but it really hits now.Jodi",
            "post_id": "3397657",
            "timestamp": "1221242473",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "Jody- I was pressured by my doc's as well for genetic testing due to the fact that I was 37.  I denied all testing.  The blood panels only tell you that there could be a chance, they are not definate.  I had a friend almost terminate a perfectly healthy son, due to that testing.  As for the amnio, I understood that there was only a 1 and 270 chance of Downs or other genetic problems, but the chance of miscarriage was 1 in a 100.  I figured I  had more chances of losing a healthy baby than finding out something was wrong.  Only you can decide whats right for you, I just wanted to offer a different perspective.",
            "post_id": "3397807",
            "timestamp": "1221244491",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Well, I went to my maternal fetal specialist yesterday. Baby looked great, but he showed me where the hematoma has gotten larger. It's almost surrounding the sac.I go back on friday to see if it has gotten any smaller.  In a normal pregnancy, this wouldn't be too much cause for alarm, but with my situation after ablation, this could be extrememly dangerous to the baby and me. So, all I can do is stay off of my feet for a week, and go back and see what happens. Hearing all of the possible risks of  early labor and bleeding to death, after what happened to Katie and Nathan, were too much for me to handle. I also have two kids to think about.Once again, I have to repeat what Katie's sister said. If anyone is thinking about getting pregnant after an ablation, think very hard.My high risk doctor told me yesterday that he just lost a baby at 24 weeks after ablation. The mother lived, but her baby didn't. I just couldn't bear that. I am putting this in God's hands, as I have been, and praying that the clot goes down, but I am also thinking of my family.",
            "post_id": "3400782",
            "timestamp": "1221315483",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I wish we could know more about Katie's situation. Did she have constant care/sonograms? Were her dr's prepared enough? My Dr. already told me that they would have blood on hand as a precaution.  Did she know if the placenta was attached to the uterine wall?   I wish we could find out her Dr.'s name and location so that one of our Dr.'s could contact them.  Neither my OB or high risk have had a case so they are seeing me every two weeks and said we will be prepared for anything.I cried for hours yesterday about Katie and Nathan.  I could not stop thinking that it could happen to me. My husband would not be able to handle it and what about my kids?  I am trying to remember what Jewel said and keep praying for the best.  These are our little miracles and I want to think that God is giving us another chance but then look at Katie and Nathan.I wish there was a study we could look at to see the end results and percentages.  How could we compile our own \"legitimate\" study for others?  We can't always be sure that the info on a forum is 100% accurate with people dropping off for unknown reasons...we assume something happened to them, but heck maybe they just got rid of their internet?!I definatley agree that anyone trying to have a baby after EA should  re-think the situation.  Dr's should require permanent birth control in addition to the EA.  Not just recommend it.Jodi",
            "post_id": "3401050",
            "timestamp": "1221321766",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "I agree about the birth control.  Not only did my Dr. not recomend it, he made the ablation seem like a form of birth control.  I also had discussed the possibility of getting pregnant w/ another Dr. in the practice at a routine check up and she sad don't ever let it cross my mind, it could never happen!  Thats why I was sick for over a month before I decided to do a test.  Hopefully this opened their eyes at my practice.",
            "post_id": "3401328",
            "timestamp": "1221327846",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I do believe with all my heart the babies are gifts from God.  Allthough I don't know why Katie and Nathan had to lose their lives.  I will never understand that.  I'm sure you are out of your mind with worry right now!  I will continue to pray for you and baby!  Do your Dr.'s think the clot could dissolve?  Whatever decisions you end up making will be what's best for you.... Just go one day at a time. ~ Julie",
            "post_id": "3401342",
            "timestamp": "1221328319",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I am starting to second guess my dr! Any thoughts from anyone? He acts as if there is no need to see specialist yet, he says that all a specialist is needed for is to look at my placenta and that it is to early for that!  I am going to be 12 wks on Mon.  I see my dr on Tues and I am going to discuss one more time that for my own peace of mind I would like to see a specialist. The Maternal/Fetal clinic said I needed a referral from my OB!Holly is your specialist monitoring your Hematoma or just your OB?  I have one that has remained the same size. I am getting so confused and scared!  I know it is in Gods hands, I just want to make sure that I am receiving proper care if it is needed.  Does your specialist go a lot more in depth with everything?Any feedback from anyone on how soon you started seeing your specialist and how concerned your dr was would be greatly appreciated.",
            "post_id": "3403448",
            "timestamp": "1221378196",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I didn't have a hematoma, so my case is different.  I never saw a specialist, but my Dr did consult with one on my condition.  Like I said in earlier posts, my Dr. never made me feel like things could be fatal.  He was very positive!  I guess ignorance was bliss for me.  I knew there could be risks to the baby though.  My Dr. just saw me more frequently than other pregancies I had had.  At about 20 weeks is when they started to regularly check my uterus with more in depth ultrasounds to check baby growth and placenta problems. Allthough the also gave vaginal ultasounds at every appointment as well.",
            "post_id": "3403824",
            "timestamp": "1221397620",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "I definitely think you should see a specialist just for the fact that you have had an ablation. The problem I am facing now is, on top of the ablation, my hematoma is so large, and even if it goes away, he said there could easily be more to come, and that puts this at even higher risk.Jewell, you are 100 percent correct when you say ignorance is bliss! My specialist seems so intelligent, yet he scared me to the point of considering a termination, which up until now, wasn't an option. While my doctor made me feel safe and secure, the specialist made me feel the opposite, but he also was telling me everything based on medical facts, and I have to weigh out the options.Plus the fact that my specailist just had a baby delivered at 24 weeks that didn't make it certainly doesn't help matters. I just wish I didn't know about it!!Also, I am a single mom raising my adopted daughter. She never sees her father, and she and I are extremely close. I am all that she has in this world. My son is 16, and from a different father, so if anything were to happen to me, she loses me, her home, her brother, everything. She would have to go live with a father who is 60 years old and never there, and a 28 year old stepmom that doesn't like her. Also, she doesn't know I am pregnant, and she will be SO excited when I tell her! What if the baby doesn't make it? She just wouldn't understand. This is all so frustrating!",
            "post_id": "3403910",
            "timestamp": "1221400250",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I am at an absolute loss for words :o( I am so VERY Sorry to hear of this loss. As I site hear with tears strolling down my face, I now wonder WHAT AM I DOING?! I've known of the risks. Am I so selfish to have another baby that I put my own health at risk? Is it so selfish of me? Then I could actually leave the 2 I have behind with no mommy? OMG, this is so hard! How do I make a decision to terminate what God gave me? Yet how do I make a decision to stay with baby and possibly leave husband to do it for the rest of their lives? I don't know that reality has ever smacked me in the face the way it just did reading about Katie and Nathan. This is AWFUL news :o(Stacy",
            "post_id": "3403923",
            "timestamp": "1221400424",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "Holly- I can't imagine what you must be going thru!  You are in a tough position with your young daughter and son as well.  No matter what you decide to do, no one will judge you.  You make your decisions based on what you think is best for you and your family!  Just go one day at a time right now.",
            "post_id": "3404116",
            "timestamp": "1221405150",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "My Dr. referred me to a specialist immediately. I saw her about a  week after my first OB appt.  My OB was very positive and only very briefly discussed how things could go wrong and told us how we would be prepared.  The specialist was a little tougher, but even tougher with the genetic issues.  I will see them every month with 2 weeks between each appt.  I'm not sure exactly what more the specialist will do though her sonogram equipment was more high tech than that of my OB's.My other issue, which I'm not sure if I mentioned, is that I have 2 fibroids. One is the size of the baby and will, specialist said, grow along with the baby. She also said it appears to be dying from the inside out which can be painful if it does.  I have never had fibroids before so I'm not sure what to expect and how exactly it will affect the baby besides, Dr. said, vying for the same nutrients and blood the baby does.I did talk to my OB about the issues seen on here by the members and she didn't think the preterm labor was a result of having the EA, but other reasons.Jodi",
            "post_id": "3405446",
            "timestamp": "1221432718",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "One other thing my maternal fetal specialist said was that I have scar tissue scattered all over my uterus, which causes problems. He also said that if the baby does grow outside of my uterus, it could attach onto my bladder or rectum, which could have lifelong consequences. Sorry, I know that's so gross!Also, he said with the hematoma, which is quite large, my body's immune system will want to \"clean up\" the hematoma, but doesn't exactly know what it's attacking, and could eat away at the baby's sac. I don't know. He just kept saying so many scary things. I'm so confused. I'm going to talk to a rabbi tonight.",
            "post_id": "3405530",
            "timestamp": "1221434071",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "When they did the hysterectomy they found that my placenta had grown thru to the outside my uterus.  ( I think that's what you meant to say)  Thankfully no permanent consequences.  Try to remember your specialist has to tell you every possible thing that can go wrong, no matter how small the chances are, due to the liability issues.  What does he recommend?  Does he think you should terminate?  Or has he not said one way or another.",
            "post_id": "3405601",
            "timestamp": "1221435577",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "WOW! I know Dr's should tell us everything, but that's a bit much. You must be terrified right now. I wouldn't put a whole bunch of weight on some of that stuff. I mean really, I haven't heard all that. I have heard about the placenta and the way it can attach to the uterus. But my understanding is a hysterectomey at birth will resolve all thos issues. I know this is a scary time, trust me, I spent most of my morning crying over the \"what could happen\" What we should be spending our energy on is the \"what could happen\" in the positive lights! :o)I have 2 fibroids too. One on the inside of my uterus and one on the outside. I have NO idea what complications they may cause. I've just started thinking about that :o( But again, I can't change what is going on...so we now go to the positive side of things and pray we will all be ok!Stacy",
            "post_id": "3405719",
            "timestamp": "1221437796",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "He didn't say. I guess I have to make that choice.Stacy, I am so sorry I am being overly dramatic. I was feeling so positive before I went to him. You are right, he was definitely telling me worse case scenarios. I really am not good with all of that medical stuff. I hate hospitals, needles, drawing blood, all of that stuff. I am a nervous wreck!The fact of the matter is, we are all guinea pigs in this! I mean, they really don't know a whole lot about this whole thing. From  a legal stand point, the companies that make the ablation instruments should be more adament about making sure women get their tubes tied during the ablation.Once again, I am so glad I have you guys to talk to! I don't know what I'd do without you!",
            "post_id": "3405765",
            "timestamp": "1221438930",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "wowoowowow, congrats!",
            "post_id": "3408399",
            "timestamp": "1221503706",
            "user_id": "user_391963",
            "user_link": "/personal_pages/user/391963",
            "votes": "0"
        },
        {
            "answer": "Honey, don't be sorry for being dramatic. I'm in the SAME shoes you are. I do feel like we are the guinea pigs. I'm not terribly upset about that, but at the same time, this is a VERY VERY scary time. We all want healthy babies and we all want to be healthy too! I'm not kidding, I freaked right out when I heard about Katie :o( I just don't see the sense in us dwelling over what could happen. We know some facts, but the rest is specualtion AND a case by case basis. We need to support each other thru each moment on this and report changes, findings etc to help educate ourselves. You hange in there. ANd ALWAYS remember no matter WHAT decisions you make thru this, NO ONE WILL JUDGE you! Not here anyway. :o)I started spotting this morning and I'm having some very mild cramps. I don't go to the doctor until Friday. I sure hope this is just part of the whole ordeal and everything is ok with the baby!Summer CONGRATULATIONS! You bring the hope we all so desperately need right now. Love and hug those beautiful babies for us :o)Stacy",
            "post_id": "3408642",
            "timestamp": "1221507262",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "What wonderful news!!  Congratulations! You have been blessed. This is wonderful news for all of us.Jodi",
            "post_id": "3409596",
            "timestamp": "1221522448",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "Have you called the dr.?  On a previous pregnancy I started spotting and my Dr. called me in to do an ultrasound and gave me progesterone. It helped save the baby.I am really surprised by the differences in how OB's treat different issues.  My friend's daughter started spotting and they called the Dr.  She was told to put her feet up.  She lost the baby at 10 weeks. This was a normal pregnancy.  Not trying to scare you further. Just wondering why some OB's do something and others don't.Jodi",
            "post_id": "3409628",
            "timestamp": "1221523122",
            "user_id": "user_595332",
            "user_link": "/personal_pages/user/595332",
            "votes": "0"
        },
        {
            "answer": "I am so happy to hear you and babies are doing great!  Get lots of rest, and I hope you have some extra help with the little ones, especially while you are healing.  Finally some good news! ~ Julie",
            "post_id": "3409805",
            "timestamp": "1221526348",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Summer~CONGRATULATIONS!!! I am so happy for you! And what adorable names! I wish we could put photos up! What a wonderful success story!Stacy~Thank you for your kind words. Also, I do believe that spotting is alot more common in our situation. I notice when i do too much, I will spot a little bit. Just take it easy. Even with normal prgnancies, spotting is usually fine the first two trimesters.",
            "post_id": "3409849",
            "timestamp": "1221527068",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "Summer, God bless you and your beautiful babies!!  CONGRATULATIONS.  Reading your story has made me realise that the dr can prepare us for the worst, its their job but our God is a MIGHTY, MERCIFUL AND POWERFUL GOD and all life is created by him!! How exciting no hysterectomy either!!!  You enjoy those babes!!Julie, Thank you once again for always being so positive!  We have decided to once again trust in the Lord a little more than yesterday!!!! This little miracle is in His hands no matter what a dr says! I have not used birthcontrol for 12 yrs and only had 3 pregnancies in that time of which I took fertility meds for the 1st one. AND MY DR TOLD ME A BABY WOULD NOT INPLANT IN MY UTERUS AFTER THE ABLATION. Drs are good but they are not GOD they read and learn just as we do.  I know we should now the \"what if's\" but right now I am sticking with my same OB because he has been very positive, is watching me weekly, has admitted we are in this together and that he has not dealt with a case like this so we wait and work together and he thinks, as we do, that God has plans we don't always 'plan' for.  It is all very scary, however I was eclamptic with my 1st and the complications there could have resulted in death as well.  My dr says I seem to like Russian Roullette :)  We have lost babies before and we know that God would not give us something he won't help us through!!  So we will wait and see.  I refuse to consume myself with stress and worry anymore, it is only harder on me and the baby!!Holly, stay positive!  Continue to get rest and pray!! I will be praying for you that everything gets better.  My 6 yr old prayed tonight that God doesn't let the baby in my tummy die. Which was really hard on me!  We have talked with her about it, in 6 yr old terms the best we could.  She knows that all our friends and family (church family too!) are praying for our health and thats about all we can do is trust in God.   We have lost many people close to us in the last 3 yrs, young and old and we have always tried to help her understand that God calls us home in His time not ours. It has allowed an open door to talk with her about knowing the Lord in a special and personal way and someday we will all meet again!!   Some think we are crazy letting her know so much about death, whether it be about my mom or our baby but she watched me grieve over the loss of my mom and I wanted her to understand the best she could that death was not scary but very sad for those of us left here.  If I did not have my FAITH I would be flippin crazy about life right now!!! God will get us each through this and has brought us all together for strength to help us get through it.  If it was not for this site I would not have heard anything positve!! Stay strong and we will all keep praying for everyone on this site and thanking God for each positive outcome we read about!!",
            "post_id": "3410152",
            "timestamp": "1221531031",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Your babies are beautiful!  How much did they weigh at birth?  They look good sized for being a few weeks early and twins.",
            "post_id": "3412084",
            "timestamp": "1221581707",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Forgot to ask if they are identical of fraternal twins?",
            "post_id": "3412092",
            "timestamp": "1221581770",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Hope you are doing better today!!  I am praying for you!",
            "post_id": "3414869",
            "timestamp": "1221621402",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I went in yesterday morning for an emergency d and c due to heavy bleeding the night before. We were just afraid there would also be more blood clots. I have had a difficult 2 months with cramping and spotting, and I was getting so emotionally attached so early, Part of me is relieved that I didn't have to make this decision.This has been the biggest emotional rollercoaster I have ever been on, and I feel a connection with every one on this forum. I still want to check in and see how everyone is doing! I hope that's okay!Summer, your girls are beautiful!!!",
            "post_id": "3415974",
            "timestamp": "1221657208",
            "user_id": "user_587021",
            "user_link": "/personal_pages/user/587021",
            "votes": "0"
        },
        {
            "answer": "I am so sorry to hear your news.  I am glad that God took the decision out of your hands.  I know how torn you were about this.  The most important thing is you are Ok!  Take care of yourself ~Julie",
            "post_id": "3416063",
            "timestamp": "1221658755",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Girls, continue to hang in there, we need more happy endings!",
            "post_id": "3416071",
            "timestamp": "1221658853",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "You didn't have to have hysterectomy, I am so suprised.  Did they say another pregnancy is possible?",
            "post_id": "3416402",
            "timestamp": "1221664312",
            "user_id": "user_356080",
            "user_link": "/personal_pages/user/356080",
            "votes": "0"
        },
        {
            "answer": "Look at the profiles of all the members.  Thats all I can say.  ALL the members.Creepy.",
            "post_id": "3418355",
            "timestamp": "1221694580",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": "0"
        },
        {
            "answer": "I am so confused!  Of course I am a small town backwoods girl not a big shot from CA but what scenario are you speaking of?  Pregnancy after ablation? I am just curious when there are those of us out here looking for answers and some support under some very scary circumstances why you as a \"L&D nurse\" would not understand the seriousness of the situation.  Maybe I have taken you all wrong!!  Please explain!",
            "post_id": "3419254",
            "timestamp": "1221708941",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "Back to business :o) I'm so sorry to hear about what happened. I am glad to see you're OK! Hang in there girl and don't let this stop you from your goals! :o)Summer: Those babies are beautiful. Good for you!Hang in there ladies!Stacy",
            "post_id": "3419874",
            "timestamp": "1221733059",
            "user_id": "user_608251",
            "user_link": "/personal_pages/user/608251",
            "votes": "0"
        },
        {
            "answer": "I am even more confused now than I was earlier.  I logged back into my computer pulled up my favorites and the old forum came up.  Now I can't even see the horrible conversation that was going on earlier.  Very weird!!",
            "post_id": "3421670",
            "timestamp": "1221764488",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "This is a thread, not a forum. If you scroll up to the very top of this page, and click on the link that says \"Back to Forum,\" THAT'S the Maternal & Child forum. This is a thread that is a part of this forum.Much of the conversation of yesterday violates MedHelp rules: fake posters, name-calling, people getting bent out of shape, etc. All those parts of this thread have been deleted.Hope this helps clarify some things for you. God bless.",
            "post_id": "3421712",
            "timestamp": "1221764983",
            "user_id": "user_184674",
            "user_link": "/personal_pages/user/184674",
            "votes": "0"
        },
        {
            "answer": "Ladies, I just wanted to assure you that we are not trying to hijack this thread or cause drama.  I'm sure you are going through a lot and need each other's support.  We are just trying to make you aware that not all stories are true and to be very very careful.  Pay attention to details and consistency in someone's story.  If things are not making sense then question it.  I guarantee you once you call someone out on something they will disappear for good.  Good luck to all of you.",
            "post_id": "3421806",
            "timestamp": "1221766278",
            "user_id": "user_145992",
            "user_link": "/personal_pages/user/145992",
            "votes": "0"
        },
        {
            "answer": "Ladies, please.  Lets keep the comments to the subject matter mentioned in the topic of the original post, please.I'm over this, its out of control.  The more you comment, the worse it's getting.  I shouldn't have made the comments I did yesterday.  I own that.Please...please.  Just stop.  I'm asking nicely.The subject of this post was pregnancy after an ablation.  Please, lets keep it that way.",
            "post_id": "3421918",
            "timestamp": "1221767682",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": "0"
        },
        {
            "answer": "Thank you very much!",
            "post_id": "3421936",
            "timestamp": "1221767871",
            "user_id": "user_596475",
            "user_link": "/personal_pages/user/596475",
            "votes": "0"
        },
        {
            "answer": "I posted on the thread that Andi created but I just wanted some knowledge about endometrial ablation.  I've never heard of this before.  I googled it and read that many women undergo it if they have heavy periods?  Can someone for educational purposes give me some more information about it.  I'm very curious to know more.",
            "post_id": "3421946",
            "timestamp": "1221768014",
            "user_id": "user_145992",
            "user_link": "/personal_pages/user/145992",
            "votes": "0"
        }
    ],
    "post_id": "1058367",
    "question": "Last year I had an ablation of the lining of my uterus. The dr. told me that I could'nt get pregnant. Over a year later, I am pregnant and scared to death. I have been reading up on ablation, and have came across nothing but \"you should'nt get pregnant after an alation, because it's high risk for the mother and baby\". I do not know how far along I am, but I believe about 4 mths already. I go to the dr. on Monday, but I was wondering has anyone heard of someone having an ablation and then getting pregnant and everything turned out great. Thank you for your time.Deanna ***@****",
    "timestamp": "1121490000",
    "title": "Pregnant after an ablation",
    "user_id": "user_94803",
    "user_link": "/personal_pages/user/94803"
}