{
    "answers": [
        {
            "answer": "While the risks are increased, I have seen many woman go on to have healthy babies in their forties.  Look at Hale Barry, Jennifer Lopez is near 40, the list goes on not to mention women I have personally known.  If you're truly nervous about it, the decision is up to you.  It has been done and will continue to be done.  Besides, think of all the medical advances we have now.  Did you have any trouble with your previous pregnancies?  While older now, you can pretty much assume a new pregnancy will follow the same scenario as your others.  Good luck to you, I know this is a tough decision.",
            "post_id": "2590774",
            "timestamp": "1204559097",
            "user_id": "user_126454",
            "user_link": "/personal_pages/user/126454",
            "votes": "0"
        },
        {
            "answer": "I thought I would add that my sister had a baby at 40 about 14 months ago.  It was actually an unplanned pregnancy - no trying or anything.  The baby's healthy and doing fine.  I'm 44 and pregnant (31w4d) but my ttc journey wasn't as smooth as hers - LOL.  I ended up doing ivf w/donor eggs which worked out wonderfully.  I've noticed, btw, that doctors are much less optimistic about women having babies in their 40's - they're so quick to point out the negative w/out balancing it with any positives.  I hope this helps!",
            "post_id": "2591229",
            "timestamp": "1204565959",
            "user_id": "user_254689",
            "user_link": "/personal_pages/user/254689",
            "votes": "0"
        },
        {
            "answer": "I'm almost 45 and also pregnant from IVF and donor egg. To put my mind at ease, I had EKG, stress test, echocardiogram and pulmonary function testing before IVF. I'm a worrier and I have two young children. Everything checked out fine so my Doctor said it was safe. Maybe you could have some testing to put your mind at ease. Good Luck.",
            "post_id": "2591298",
            "timestamp": "1204566813",
            "user_id": "user_370736",
            "user_link": "/personal_pages/user/370736",
            "votes": "0"
        },
        {
            "answer": "I am now 40, have been TTC for 2 1/2 years (unfortunately 3 miscarriages thus far).  My chances of another miscarriage are still about 30% (but still 70% chance of success!).One of the main problems in your 40s is egg quality.  That is the probable reason for my miscarriages, I am healthy and got pregnant pretty easily.  If you are healthy, and pregnancy is viable, there is little chance you will have major problems, although there is a higher chance you may develop things like gestational diabetes.  And you have a higher risk for Down's syndrome, but its still about a 1/100 chance for a 40 year old.If you are prepared for a potential miscarriage, possible difficulty in conceiving and/or using your own eggs, then go ahead.  I know many women around 40 who had no problems whatsoever, conceived naturally and had perfectly healthy children.  That's why I still see some hope for me and others our age.  Its good that your Dr is pointing out the risks, but he may also be needlessly scaring you out of trying.",
            "post_id": "2591459",
            "timestamp": "1204568697",
            "user_id": "user_349346",
            "user_link": "/personal_pages/user/349346",
            "votes": "0"
        },
        {
            "answer": "I am 43 and pregnant with the help of IVF.  I had great success with egg production and retreival.  The dr. said the eggs (19 of them!) were in excellent condition.  I think you should go for it!",
            "post_id": "2591507",
            "timestamp": "1204569122",
            "user_id": "user_416285",
            "user_link": "/personal_pages/user/416285",
            "votes": "0"
        },
        {
            "answer": "I'm 40 and it's really funny actually. My husband and I prayed and prayed about whether to have a 3rd because I had a life-threatening complication in my last pregnancy (I was 33 at the time). After much thought and consideration we decided to, but given that I was 39 at the time we thought for sure it would take a while. I was already on the fence age-wise and not knowing if we were making a stupid decision not just pregnancy and baby-wise, but lifestyle wise. Heck, I'd be \"ancient\" when my kids went to college and who knows if I'd ever meet my great-grandkids...Well, we decided in late June that I'd have my IUD removed and if we decided not to have more kids then he'd get fixed. July wasn't a \"timing\" month and we just planned on being happy if it happened, or didn't happen but I was still very honestly on the fence about it and had my cycle start on 8.13.07.And that was my last menstrual cycle and I am now 29 weeks along. I'm honestly overwhelmed and go through periods of total elation and excitement and period of thinking, \"WHAT IN THE H*** DID WE DO???? I'M 40!!!\" But everyone tells me that the 3rd is so joyous and that I won't feel so \"old\" when the little guy shows up.We moved from Calif. to Atlanta in July (double whammy stress-wise) but my Ca. doctor was SO encouraging. He says they don't start blinking an eye until after ~43. Here it seems different...lots of judgment and skepticism. I have gotten to where I don't even like telling someone my age because I get the \"Oh. You're pregnant?!? How old are you? That must have been a surprise or a mistake.\"Aside from that and with regard to risks, I just decided we all have risks. Period. Having a greater CHANCE of a risk doesn't mean that you will EXPERIENCE that risk...And I had a life-threatening pregnancy risk and a child with developmental delays at 33 (he's fine now). So while age can indeed dicate some things, it can not dictate all things.It's a personal choice and one that you will vascilate on even when you're pregnant!Good luckChristina",
            "post_id": "2591701",
            "timestamp": "1204571544",
            "user_id": "user_281219",
            "user_link": "/personal_pages/user/281219",
            "votes": "0"
        },
        {
            "answer": "I have been through pregnancy hell, but I'm now 40 and in my third trimester.  The ladies on this board are probably sick of hearing my story by now but I had 10 mcs since DD in the past three years.My OB never once mentioned my age as a reason NOT to try,  In fact, when I told her I wanted to stop trying for number 2 at 40, she convinced me to at least go for 41.One of my friends just had a baby at 45, another at 41.   Even with 1 in 40, the odds truly are in your favor.You could do a FSH and estrodial test, which can tell you egg quality.  I don't think it's 100% accurate though.Good luck whatever you decide!",
            "post_id": "2593008",
            "timestamp": "1204589876",
            "user_id": "user_161782",
            "user_link": "/personal_pages/user/161782",
            "votes": "0"
        },
        {
            "answer": "I had my now 3 yr old son without complications when I was 40.  We got very lucky and got pregnant on the 2nd month of trying.  We decided we would try to make a sibling for our son and getting pregnant this time around has been a much different story.  It took 4 months to get pregnant and then I m/c'd.  Got pregnant right away after my 1st period and m/c'd again.  After trying for almost 2 years total, I got pregnant again and am now 26 weeks along at age 44.  It's been a little bit of a rough road, but I'm sure it will all feel worth it when we're holding our new bundle of joy.I live in Colorado where it seems the norm to be in your late 30's to mid 40's when bearing children, however, when I was visiting my mom in Florida recently I got a real nasty vibe from someone about my age who was talking about her grand child that is my son's age.  I have to say, I really don't care what other people think about our decision to have babies late in life.  I can't imagine my life without my wonderful son and I'm sure I won't be able to imagine life without my child to be, once he/she is here.  In a lot of ways, I feel like we're much better parents now then we would have been when we were younger.  All of the need to party is out of our systems and we're very family oriented.Good luck with your decision!Melanie",
            "post_id": "2593239",
            "timestamp": "1204593089",
            "user_id": "user_159047",
            "user_link": "/personal_pages/user/159047",
            "votes": "0"
        },
        {
            "answer": "It must be a southern thing with regard to age. It seems many start very early in the south (sorry to stereotype...) but I agree that in the west, the northwest, etc (where I have a ton of family and friends)  starting before you're 35 is almost too young!!! Funny!",
            "post_id": "2593435",
            "timestamp": "1204596000",
            "user_id": "user_281219",
            "user_link": "/personal_pages/user/281219",
            "votes": "0"
        },
        {
            "answer": "Don't let the doctors decide your course of action.  Only you know what you can and are willing to do.  My best friend Mary had boy/girl twins - she delivered them a month before her 43rd birthday.  One of my co-workers had her first baby (all naturally) at 48 a week before Thanksgiving last year.  She had been diagnosed with breast cancer when she was 42,  fought it,  survived it and is better than ever now.  Her doctor,  thank God she had one who is positive and willing to weigh her options with her,  told her that she should try if that's what she really wanted - and she did and now has a beautiful little boy who had his christening last weekend.Search your soul - if it's what you want,  go for it.  If you find that all you can think of are the negatives,  then maybe you don't really want to do this but are considering doing it for your partner - that's a whole different story,  isn't it?Whatever you decide - good luck!!!",
            "post_id": "2594590",
            "timestamp": "1204622723",
            "user_id": "user_183942",
            "user_link": "/personal_pages/user/183942",
            "votes": "0"
        },
        {
            "answer": "ps.  I thought I might add that my friend Mary's twins are perfectly healthy and fine!!  They are ten now,  Elizabeth is a beauty who sings and dances and models for Macy's catalogs.  Daniel is in the artistically-talented program and won 1st prize in the science fair at his school last year.  They're not my kids,  but thought I'd brag anyway :o)  I am so proud of Mary,  she suffered two miscarriages and didn't let that stop her from trying again.  Ok,  I'll go away now.......promise!",
            "post_id": "2594598",
            "timestamp": "1204623274",
            "user_id": "user_183942",
            "user_link": "/personal_pages/user/183942",
            "votes": "0"
        },
        {
            "answer": "Thank you so much for your comments and stories.You have helped me think not as much about the negative issues about this. It's god to hear some happy stories in the end.I am still nervous but with a more open mind to this.Many thanks :)",
            "post_id": "2597040",
            "timestamp": "1204662620",
            "user_id": "user_438165",
            "user_link": "/personal_pages/user/438165",
            "votes": "0"
        },
        {
            "answer": "Well I am not to familiar with pregnancy in your 40's but I do know that my mother and father were in there mid 40's and pregnant with me and I was full term and healthy baby....she didn't even get morning sickness ...that lucky lady!  I do know doctors usually give  additional testing on older women. I hear many women are starting to have childern in there 40's. I personally haven't heard of anyone having abnormalities with there pregnancies as of yet.",
            "post_id": "2597184",
            "timestamp": "1204664603",
            "user_id": "user_384464",
            "user_link": "/personal_pages/user/384464",
            "votes": "0"
        },
        {
            "answer": "I am fourty two and much to my and my husbands surprise, I am now thirteen weeks pregnant.  But it has been so scary, the doctors always tell me all the negative things that can happen and never anything positive because of my age.  Everythings find thus far, I just have to trust in Jesus and pray we have a normal healthy child.",
            "post_id": "2926481",
            "timestamp": "1211250596",
            "user_id": "user_512787",
            "user_link": "/personal_pages/user/512787",
            "votes": "0"
        },
        {
            "answer": "I turned 45 this month and due this week,my dh and I have been married for 25years and had a surprised pregnancy! Nothing is really diffrent then with the first 17years ago, other then the medical testing!I feel if anything it is a plus!!! We are to be more relaxed, and have time and paitents this time around. I dont plan on working and will have nothing but time for this one. how can that be any wrong?????good luck..",
            "post_id": "2927858",
            "timestamp": "1211285061",
            "user_id": "user_304653",
            "user_link": "/personal_pages/user/304653",
            "votes": "0"
        },
        {
            "answer": "i am completely jealous about all the pregnant over the age of , my mother is 44 and is completely depressed that she cannot have a child of her own even with IVF because of the abnormal eggs. she refuses to get a donor egg because she sees it as \"not her own\", they have spend thousands of rands on treatment and now at the final stages she only had one egg and it showed abnormality.. i cannot describe how sad she is, it reminds me of three years ago when she had a miscarraige at 9 months...is there completly no other way she can get her own???From Liza",
            "post_id": "4738344",
            "timestamp": "1249547763",
            "user_id": "user_994798",
            "user_link": "/personal_pages/user/994798",
            "votes": "0"
        },
        {
            "answer": "I had Gavin when I was 41, I had 4 miscarriages before him.  He is now a healthy beautiful 7 month old little boy.  It was a struggle, but all worth it to me.  This is my hubby's first child and only from me...lolIf you believe than it will happen for you.  Good Luck on yor decision.Debbie",
            "post_id": "4738629",
            "timestamp": "1249561086",
            "user_id": "user_503649",
            "user_link": "/personal_pages/user/503649",
            "votes": "0"
        },
        {
            "answer": "You ladies are giving me SO much hope. It's so encouraging!",
            "post_id": "4739541",
            "timestamp": "1249577065",
            "user_id": "user_605648",
            "user_link": "/personal_pages/user/605648",
            "votes": "0"
        },
        {
            "answer": "I had two children by the time I was 30.  My husband and I weren't trying to have a 3rd child, but we did when I was 48. Our little boy is almost 2 now, perfectly healthy and the delight of our lives.  His 19 year old brother and 24 year old sister love him dearly.  I did have some minor health problems while pregnant that I didn't have with the other pregnancies---gestational diabetes, high blood pressure and generally feeling exhausted and run down.  Also, my sister-in-law, after several miscarriages, had her only child when she was a coupld of weeks shy of her 45th birtday.  She also had a healthy baby boy.  So, you can have a healthy baby after 40.",
            "post_id": "6076019",
            "timestamp": "1282933103",
            "user_id": "user_1427316",
            "user_link": "/personal_pages/user/1427316",
            "votes": "0"
        },
        {
            "answer": "I am going through fertility sessions with my doctor right now. My age wasnt a factor of difficulty. My age was a facotr of my eggs being mature enough for getting pregnant. I trust my doctor, he said it may be a little risk of down syndrome for the child. But that didnt hurt our wanting a baby. I hope this helps...oh my age is 43 and my hunny's age is 32.",
            "post_id": "6905668",
            "timestamp": "1305357293",
            "user_id": "user_1684717",
            "user_link": "/personal_pages/user/1684717",
            "votes": "0"
        },
        {
            "answer": "Thanks, everybody.  I'm sad and scared, as I have no partner, no money, and I'm about to turn 43 (and a healthcare person told me I have little chance without medical intervention at this age).  I want to find a great guy soon enough to conceive naturally.  You all gave me hope, though my heart is still frightened and weepy right now.Thanks,K",
            "post_id": "7302393",
            "timestamp": "1317975290",
            "user_id": "user_1831544",
            "user_link": "/personal_pages/user/1831544",
            "votes": "0"
        },
        {
            "answer": "Your comments are quiet encouraging, my son is 12 now and we have been trying for the second child for a little while now but I guess I was a little scared since I was 44 a month ago. Keeping the faith, thanks alot",
            "post_id": "7410313",
            "timestamp": "1321316132",
            "user_id": "user_1895589",
            "user_link": "/personal_pages/user/1895589",
            "votes": "0"
        },
        {
            "answer": "One of the best pieces of advice I can give you is for both you and your partner to stop all intake of alcohol. It can kill fertility by up to 50%I'm 43. Had my gallbladder removed in July. Stopped all alcohol and got pregnant in September. I'd been TTC for over a year since my last M/C. I used to drink a few glasses of wine per week plus a few G&Ts.My family has also been on the failsafe diet which I would also highly recommend. www.fedup.com.au",
            "post_id": "7418437",
            "timestamp": "1321538746",
            "user_id": "user_127466",
            "user_link": "/personal_pages/user/127466",
            "votes": "0"
        },
        {
            "answer": "I know the original post is almost 4 yrs old, but noticed some recent entries and thought I'd share.I'm 43, my husband 32 and we have been married for 9 yrs, the first for both. We have a daughter who is turning 5, a 4.6 yr old and I found out I'm due in Aug. This current child was planned AGAINST.Both pregnancies were considered high risk due to prior surgeries, age, and asthma/allergies. My first was a breech c-section and since we lived in a somewhat rural area, it made my second a c-section as well.We received all the lectures and warnings about conceiving after 35, especially with my second because I was 39.6 when I delivered. The was they treated me and emphasized Currently, I'm at a higher risk for cancer, preterm labor, preeclampsia, placental problems, high blood pressure, low birth weight, (our kids weren't all that big to begin with), stillborn, and diabetes.  Then there's the risk to the child such as Down's, type -1 diabetes, high blood pressure as well as all the problems that go with premature children, (autoimmune issues, learning disabilities, and a myriad of other endless low-birth weight issues.)Everyone and every pregnancy is different, but I only had 2 problems  and that was with my first, preeclampsia and morning sickness for 9 mo. The latter of which was the reason I didn't gain any weight, there wasn't any meds I could take that didn't have side effects.Although we passed on it the first two times, (mainly because I was afraid of the pain), we will be looking into either Nuchal Translucency or Amniocentesis. Yes, there are risks but I want to be informed with as much notice as possible to any abnormal results.My husband is in the medical field and I'm unemployed. Oh wait, I'm supposed to say I'm a SAHM (stay at home Mom). Yes, I do believe I'm more interested in raising good humans, patient and enjoy the little things, then had I started in my 20's. But I will admit to having less energy and occasionally worry about seeing my children raise a family. For me, the trade off is worth it.Because I don't look my age, I'm fortunate not to have to deal with too much public opinion. On the rare occasion a stranger is aware of my age, I get looks or borderline disparaging comments. For the few that pay attention to my parenting or better yet, my children's behavior, I either get questions about how my age effects how I raise my children or comments about how well behaved they are.Bottomline, there are things in my life that I would gladly change, but the age that I chose to become a Mom is not one of them.",
            "post_id": "7550794",
            "timestamp": "1325608773",
            "user_id": "user_1966565",
            "user_link": "/personal_pages/user/1966565",
            "votes": "0"
        },
        {
            "answer": "I was in the exact same situation.  I had three early miscarriages after 40 and before having my perfectly healthy son at age 42.  He's a total delight to us all and probably spoilt rotten as he orders his 12 and 14 year old half-brothers about all the time!  He has so much attention from us all he is devleping really quickly in every way.  I'm not sure how he will handle another younger sibling if my current pregnancy works out though, as he is very possessive of me!",
            "post_id": "7563222",
            "timestamp": "1325893527",
            "user_id": "user_1971189",
            "user_link": "/personal_pages/user/1971189",
            "votes": "0"
        },
        {
            "answer": "Forgot to say he's five and I'm now 47.",
            "post_id": "7563231",
            "timestamp": "1325893594",
            "user_id": "user_1971189",
            "user_link": "/personal_pages/user/1971189",
            "votes": "0"
        },
        {
            "answer": "I am 39 and pregnant with my second child. I just miscarried in January so I know the risks but I have to admit that after knowing that it was possible I had to try again. I am a type II diabetic and understood the risks. I am now in my 9th week with no cramping or spotting. Dont get me wrong, I am miserable quite often (back pain, breasts very sensitive, nausea and stretch marks). My husband didnt want this after the miscarraige and the docs repeatative use of the term \"high risk\" but he is now excited and worried. When I feel my worst I remind myself that I only have six months to go and I will be reminded of how it was all worth it when I look at the beautiful bundle in my arms.",
            "post_id": "7974765",
            "timestamp": "1337655625",
            "user_id": "user_2144151",
            "user_link": "/personal_pages/user/2144151",
            "votes": "0"
        },
        {
            "answer": "Im 41, my first pregnancy about six weeks in. Overjoyed, hopeful and looking forward to the birth of my little one!",
            "post_id": "7977927",
            "timestamp": "1337737203",
            "user_id": "user_2181341",
            "user_link": "/personal_pages/user/2181341",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm Emma. I'm 41 and just discovered im 5w3d with my first pregnancy after years of trying.  We had given up. .. stopped clomid and then tamoxifen as they didn't work. .. that was a year ago.  So this is a nice surprise but I am very scared about abnormalities at my age. Im quite fit and well.  No major issues. I take thyroxine which is well controlled and have haemochromatosis which is a genetic thing where I don't absorb iron as I should do...so a little worried there.  The whole age thing scares me quite a lot.",
            "post_id": "9104643",
            "timestamp": "1368326508",
            "user_id": "user_5460642",
            "user_link": "/personal_pages/user/5460642",
            "votes": "0"
        },
        {
            "answer": "Hi Emma. I just want to say I'm 38 pregnant with number five a little girl I'm 34.2 weeks. It CAN happen and have happy healthy babies. Just talk to Dr about iron thing they will keep an eye on it.  Best of luck in sure you'll be ok. More and more women are having babies ALOT later in life :)  good luck",
            "post_id": "9105110",
            "timestamp": "1368344111",
            "user_id": "user_4467187",
            "user_link": "/personal_pages/user/4467187",
            "votes": "0"
        },
        {
            "answer": "I know its hard,  but try and relax.  Im not far behind you in age.  I will be 40 a month after this baby is born.  Im 29 weeks and due in July.  I also have an iron issue.  Ive been anemic the entire pregnancy.  Ive taken an iron supplement along with the prenatal vitamin.  Hope its working.  You must feel week and tired all the time.  I know i do!  Anyways,  try not to worry about the age thing.  Ive had all the genetic test and all looks good.  The only thing ive noticed being almost 40 and pregnant is that im in alot of pain.  Upper back,  middle back,  lower back,  groin pains.  My body isnt what it used to be...olol.  Still will all be worth it when my son is born.",
            "post_id": "9106084",
            "timestamp": "1368386866",
            "user_id": "user_4583720",
            "user_link": "/personal_pages/user/4583720",
            "votes": "0"
        },
        {
            "answer": "Ladies, thank you.for sharing your experiences! There is so much hope.",
            "post_id": "9106502",
            "timestamp": "1368400583",
            "user_id": "user_1612057",
            "user_link": "/personal_pages/user/1612057",
            "votes": "0"
        },
        {
            "answer": "Its just so wonderful to read about all these encouraging experiences. My partner and I, both in our forties are thinking of having a baby. Although I have two children - 16 and 12 from a previous marriage, it will be a first time for him. Both of us are terribly excited about this but also a bit worried about health complications for me and the baby. I am 44 with no health worries. The thought of a new baby just fills me with joy and I do hope we can all settle down into enjoying a fulfilled family life. Can anybody please tell me about the possible health complications to watch out for at this age ?",
            "post_id": "9258831",
            "timestamp": "1372934265",
            "user_id": "user_5715685",
            "user_link": "/personal_pages/user/5715685",
            "votes": "0"
        },
        {
            "answer": "I loved reading this thread. And to share in this thread we got our l bundle of joy in may and i had just turned 43. Only realised i was pregnant around 15 weeks and went through shock, fear and uncertainty. With no prenatal care the stakes were high. I thought i was growing crazy with all the emotions. But i never had a health problem, it was the fittest time of my life physically but not mentally. I was sleepwalking but am grateful to God my doctor was amazingly supportive and positive. I went on to deliver the joy of our whole family- he is the centre of his sisters and they adore him and are so o protective of him.  Am so o humbled ladies- yes most foctors would say what they read but our bodies are still unchartered territories in a way. I had a c section but was so o quick to heal and was surprised. I honestly feel in my twenties in a way but with the added  advantage that am calm, patient, embracing motherhood,tolerant, wiser in a way.  Most of all, i know that am not in control but God is.",
            "post_id": "9259982",
            "timestamp": "1372969290",
            "user_id": "user_4879787",
            "user_link": "/personal_pages/user/4879787",
            "votes": "0"
        },
        {
            "answer": "Let me add that i have experienced motherhood in my 20s,in my 30s and in my 40s.",
            "post_id": "9259989",
            "timestamp": "1372969453",
            "user_id": "user_4879787",
            "user_link": "/personal_pages/user/4879787",
            "votes": "0"
        }
    ],
    "post_id": "2590434",
    "question": "Not sure if that was the right topic to choose from but here is my question:I am already forty years old and have two older kids...long story short my new partner is wanting to have a child with me. I have been warned by two Dr.'s already that the risks are higher now because of my age. 1-40 that i will have some problems with the pregnancy. I am afraid of getting into this now but I had said I agreed to try. Now I am getting afraid again at the thought of something going wrong with the baby...the pregnancy or me. I am not sure if I am emotionally strong enough to go through that as my Dr. explained some of the risks to me and the outcomes.I guess what i am asking is for some more feed back from others regarding this. Either positive or negative.Thank you....",
    "timestamp": "1204554127",
    "title": "Reality of pregnancy in forties?",
    "user_id": "user_438165",
    "user_link": "/personal_pages/user/438165"
}