{
    "answers": [
        {
            "answer": "I agree with this.....although I did get induced myself and had an amazing labour and delivery...my sister who was also induced ended up having an emerg csection, and so did my bosses sister. Thats 2 out of 3 of us that had emerg c sections and were induced...",
            "post_id": "6711384",
            "timestamp": "1299466154",
            "user_id": "user_1209036",
            "user_link": "/personal_pages/user/1209036",
            "votes": "0"
        },
        {
            "answer": "With my first i had a normal spontaintios labour, which went very well and we both are great. But with this pregnancy I have no choice but to induce. I live to far away from a hospital and with my first labour only being just 4 hours it is in my and my babies best interest to be inducted.The reason behind this is the risks of having a baby on the side of the road with no cell phone service is alot less than the risks of an inducment.The dr would like me to be induced at around 37 weeks and has allready set a date even though i am only 24 weeks into this pregnancy.Im very scared i will end up having to have a c section but have to go with the dr decision as there is nothing else we can do.Thanks for shairing this info. I found it very very helpful.",
            "post_id": "6711519",
            "timestamp": "1299469210",
            "user_id": "user_1419501",
            "user_link": "/personal_pages/user/1419501",
            "votes": "0"
        },
        {
            "answer": "I agree. How much have they truly studied the drugs they give to women to induce labor? We may not know the effects it could have on the body and baby until many years from now. Why risk it?? I understand, there is a small percentage who may need this and who need c-sections, but far too many elect to be induced for convenience and end up putting themselves and their baby at risk.",
            "post_id": "6711540",
            "timestamp": "1299469649",
            "user_id": "user_280369",
            "user_link": "/personal_pages/user/280369",
            "votes": "0"
        },
        {
            "answer": "I'm sorry but 37 weeks is still early to induce. Do you have any risks which make him think you should be induced at 37 weeks? Is he going to be out-of-town during your 38th, 39th or even 40th week? I don't mean to question you or your doctor but I am just curious as to why he felt 37 weeks was the magical time to do it since baby's lungs can still be immature at 37 weeks. There is discussion about making 38 weeks+ full term because of this.I definitely believe that there are cases for induction and I'm NOT saying you're making a bad call. Sometimes distance can be a safety issue. I just would question the 37-week mark if you have no risks or reasons for having baby before 38 weeks. If you don't mind my unsolicited advice I'd ask the doctor about inducing during the 39th week. You may have an easier induction the further along you are and the more prepared your body is to go into labor. And if you do want a more natural birth you can see if they'll break your water and allow you to labor before introducing Pitocin. I understand not everyone is into natural birth but I am throwing that out there in case you were interested in natural birth.You ultimately need to go with what you feel is the best route and I wish you many blessings.",
            "post_id": "6711545",
            "timestamp": "1299469700",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Well, I didn't read the article, but trust my doctor with my life.  He has been my dr. since I was 15 (I am now 35) and has delivered all 6 of my kids.  And he will deliver this one as well.  I have been induced twice by my own choice to make sure he was present at the birth.  I didn't want a dr. I had never met delivering my baby.  And I am sure my dr.'s colleagues are just fine.  He wouldn't work with them if they weren't but that is just my preference.My worst experience was with my 3rd child and I WAS NOT induced.  I labored mostly by myself at home all day.  I was 8 cm by the time I got to the hospital and that IS NOT what I wanted.  Why did this happen??  Because I went into labor on a Sunday and my dr. was not on call so I was sent home after one hour with no progression.  This was my 3rd child and only 2 days from my due date.  I KNEW I was in labor.  Thus doing most of the work at home, and again, that is not what I wanted.  Anyone that wants to go naturally and experience all that pain, well more power to them.  And I mean that with all my heart.  No sarcasm intended, but I don't want to feel all that pain.  It just isn't necessary, in my book, when there are other options.  I don't feel like less of a woman for preferring an epidural and my husband sure doesn't look at me as less of one.  Heck, I wouldn't care if he did but he is SUPER proud of me for giving birth to all of these children.  All of my children have been very healthy, etc.  And Pitocin is something our body produces naturally anyway.  In fact, it won't show up on an autopsy because of that very reason.  I saw that on a documentary.As I said, I did not read the article, but there will always be studies on both sides.  If it weren't considered safe to induce, it wouldn't be done.  Are there risks??  Yes, there are risks to anything; even walking to check the mail.  There are also risks to home births, etc.  Not something I would do, but many people do.  What I am trying to say is that as much research that is out there that might say inductions are bad or risky, there will be just as much to say otherwise.In the end, you have to do what you  feel is best for yourself, your baby, and your family.  That answer will be different for everyone.  It is also important to trust your health care provider.",
            "post_id": "6711710",
            "timestamp": "1299474231",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "Keep those babies in!!!! Get rid of the OB and find a good midwife!!!",
            "post_id": "6711730",
            "timestamp": "1299474563",
            "user_id": "user_1627138",
            "user_link": "/personal_pages/user/1627138",
            "votes": "0"
        },
        {
            "answer": "I haven't read the article either as i'm in the middle of cooking dinner at the same time, but I think that it's the mothers choice too whether to be induce, i wasn't with my first but due to having diabetes this time around i'm sure i will be as much as i would like a spontaneous labour it's just not going to happen also, i live quite a distance from the hospital where i'll be delivering so knowing that i'm going to be there the whole time is of comfort too, also another note being in australia too we have the midwifes do all the inducing well mainly and the ob is either there when a person has private health insurance or there is a problem during the labour.",
            "post_id": "6712034",
            "timestamp": "1299485316",
            "user_id": "user_136689",
            "user_link": "/personal_pages/user/136689",
            "votes": "0"
        },
        {
            "answer": "I apreciate the concern and absolutly love the fact i have someone other than myself to dicuss this with.It has been a major worry this whole pregnancy. As i said my first labour was great and i was very upset io couldnt do the same again, but we have to do whats best in the long run.where i live its very much a farmer town. I live and work on a HUGE property and will be due right in the middle of the biggest harvest we have had in over 20 years. ( great timing i know). My husband and family will have to leave me to do harvest when im 39 weeks.I know to most people it sound like a very far out thing to go but it is the life we choose.I will always do whats best for my baby ( even if it happenes to hinder me).I absolutly would love a natural birth.. Hate the fact i have to get medical interventions to help me along the way and will be airing all this to my midwife.Another thing they are worryied about is the fact of a still birth. I really have no idea why as its not hereditory at all but my mother has had two and both aunties have had a still birth each...i will certainly ask to get my waters broken before any other action is taken ..I will be satying in the hospital for about 8 days before had to insure i get all the tests needed to make sure my boy s lungs are developing..Just to let you know im due 1st july but getting induced 17th june..2 early. So i correct myself a bit as ill be 38 weeks...",
            "post_id": "6712152",
            "timestamp": "1299490550",
            "user_id": "user_1419501",
            "user_link": "/personal_pages/user/1419501",
            "votes": "0"
        },
        {
            "answer": "I have to say I am on the side of induction too as I have had one for my own health at 38 weeks.  I lived far from the hospital...1.5 hours and have never made it to term with any of my children.  I also had a lot of complications throughout my pregnancy.  Last pregnancy I had 7 ultrasounds, bleeding, 2 cardiac monitors, 2 ambulance rides, passed out at work, hypotension, kidney stones that got me a nice MRI and 3 days hospital stay, etc.  I think getting him born was the best thing for him! He ended up being 8lbs 8 ounces at 14 days early.  They said I probably wouldn't have had him vaginally at term, so it saved me from a c-section.  Also since I saw people advocating home birth and midwives I must say that my first two children would have died if born at home.  I believe the hospital is there to help us.  It is every woman's choice, but I trust everyone will consider the risks of at home birth as much as this topic.  I am pregnant again with very different issues this time (crazy I know). I wish everyone out there a happy and healthy pregnancy!",
            "post_id": "6712588",
            "timestamp": "1299506617",
            "user_id": "user_231051",
            "user_link": "/personal_pages/user/231051",
            "votes": "0"
        },
        {
            "answer": "I'm not really for or against induction, for whatever the reason may be for it. I think if it's an elective induction at 38+ weeks, and the doctor and patient agree it's safe to do and want it to be done, then go for it.I have two kids and both of my labors were induced. My first labor was induced at 39 weeks for nothing more than the sake of convenience, as my son was due the week before finals and I was a college student. I didn't want to miss that week because getting the notes and studies for the finals were critical to me. I had a low to no risk pregnancy and I did not want to be taking finals that were rescheduled over my winter break. Sorry if that sounds selfish, but I didn't want any extra moment of my time taken away from my baby in his first four weeks of life because I was setting him aside to study for finals and rescheduling extra hours to get back to school to take them. I was induced on a Wednesday and was back in school on Monday. The following week I took the finals and I had my full three weeks of winter break totally uniterrupted to bond with my baby. I wouldn't change a thing.With my second, I went into preterm labor at 33 weeks and was hospitalized three times and put on bed rest between then and my induction at 38 weeks. By the time I was 37 weeks, I was in so much pain that I could barely get up to walk. To be honest, I wanted to induce at 37 weeks, but my OB required me to wait until 38 weeks unless I went naturally from the preterm labor. By the time I got to 38 weeks, I needed help walking at some points because that's how much pain I was in, and I wasn't lucky enough to get any prescription pain killers, so I was depending on Tylenol, which was doing nothing for me. An induction at this point was more than welcome. And because I'd been in preterm labor for five weeks, my labor was really fast. My baby was also eight pounds when he was born, so I wonder how much he would've weighed if I'd gone past 38 weeks. Again, with that experience, I wouldn't change and don't regret a thing.I do, however, hope and pray that I can have a completely natural labor if I get a third chance. I'd love to have that experience and, even though I know I've made the right decisions for myself and my family with my last two labors, I feel like I'd miss out on something wonderful and extraordinary if I don't get a natural labor at some point.",
            "post_id": "6713095",
            "timestamp": "1299517208",
            "user_id": "user_184674",
            "user_link": "/personal_pages/user/184674",
            "votes": "0"
        },
        {
            "answer": "My mother was induced for me over 21 years ago, obviously not having as good of medical care as they do today and never had any problems. I was born vaginally after 6 hours of labor. I think if the woman knows the risks involved and has done her own research, then she can make that decision for herself. There are risks involved with child birth no matter what, so it's going to come down to what the mother is most comfortable with. I do think there are circumstances where induction is better than waiting for natural delivery in some cases and would never tell a woman to not have an induction.",
            "post_id": "6713349",
            "timestamp": "1299521524",
            "user_id": "user_613992",
            "user_link": "/personal_pages/user/613992",
            "votes": "0"
        },
        {
            "answer": "I have to say I agree with the risks associated with inductions. But I also have to say that I was induced at almost 38 wks.. (37.5 to be exact) My labor was awfully painful but only lasted 10 hrs long. The reason to my induction was preeclampsia.... While I wish I couldve been given the chance to go naturally. But I still wouldnt change anything, bc it was out of my control. That being said... I want a natural delivery with my son, but if my husband is going to be away for days at a time, it would be best to deliver the baby with his by my side, yes \"planned\" bc I wouldnt want anyone else to be there in place of him. I wouldnt do it any earlier then 39 wks. And If he wont be working away for days at a time, then If I get to my due date I wouldnt go any farther then 41 wks bc I DO NOT want to push out a 10 lb child. Yes induction has its own risks, but to each thier own i guess.",
            "post_id": "6713468",
            "timestamp": "1299523052",
            "user_id": "user_920871",
            "user_link": "/personal_pages/user/920871",
            "votes": "0"
        },
        {
            "answer": "Thank you all for sharing your stories and experiences without getting upset with one thing or another! Induction ultimately is not safe for mother or baby but there are definitely instances when the benefits outweigh the risks. I think the problem I have with it is that most OBs schedule inductions with absolutely no medical reasons whatsoever which puts unnecessary risk on mom and baby. Hard to discuss it if people don't read the article to see where I'm coming from. Induction of a low-risk woman with no prior issues could lead to a birth that is not favorable for her or baby when she may have had a great birth had she been allowed to wait. This is just what the studies and statistics show. The truth is the truth no matter who is writing the article.There will always be two sides of the fence in any issue; those who have inductions that end up well and those who do not (and studies show there are far more of the latter).Lemena - home birth has been proven to be safer than hospital birth for low-risk women who have a medical professional present (in those cases a CNM or CPM). Hospitals and OBs are very good to have on hand for those who are high-risk or have complications or just for women who feel safer under the care of one. No one is denying that. But I think people should do some research and gain information before making blanket statements that home birth is not safe. It is not for everyone, like Michele said above, and that is fine. It sounds like you do have complicated pregnancies and births so induction can be very right for you; I'm not saying it isn't right EVER. I'm just stating it is risky, especially for those who are scheduled for it for no medical reason.I have never given birth at home. But my last birth was with midwives at a hospital. My husband wanted the safety net of the hospital and I wanted the care of midwives for my birth and this was the perfect compromise. I didn't mind being at the hospital though I would LOVE to give birth at home or at a freestanding birth center this time if we are able. We're looking into our options now. Otherwise I think I'll be fine sticking with my midwives at the hospital.AHP- If natural birth is what you want then I desperately hope it for you as well. Are you pregnant or trying? Natural birth is always possible. And I want to encourage you that even 10-lb babies can be born vaginally and safely. It has more to do with what position you're pushing in. If you're on your back in bed pushing it narrows the pelvis about 25-30%. I like many of the points you made.Kelli- If you're there for 8 days before the induction perhaps they can do a membrane sweep about 5-6 days into your stay (if baby's lungs are well of course). This may begin natural labor for you as well. Breaking your water can also help that along. The more \"natural\" the induction techniques the better off for you. Ultimately there are still risks but I'm sure you know all of that. Don't feel like you're making a bad choice because I brought this up. I definitely do not judge you (or anyone else for that matter).",
            "post_id": "6713475",
            "timestamp": "1299523155",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "**** sorry not ten hours. Only 8 hours!",
            "post_id": "6713479",
            "timestamp": "1299523271",
            "user_id": "user_920871",
            "user_link": "/personal_pages/user/920871",
            "votes": "0"
        },
        {
            "answer": "Julia- now THAT is a necessary, medical reason to induce (pre-eclampsia). Thank you for sharing your story! I pray you get to have your natural birth next time around if at all possible. You can still have a \"natural\" induction. That's kind of an oxymoron, LOL! But if you have your water broken or membranes swept and they leave you alone to go into labor you just may be able to have that natural birth and avoid drugs.My last was a natural birth and while it was painful it was the most amazing experience. My two epidural births I regret. I wish I had gone natural with them; it would have been best for me and for them. However I can't live in regret. I cherish their births for the positive moments and strive to work toward advocating natural birth for others and strive to continue to have natural births myself. But I want to encourage women who DO get epidurals or inductions that they can still make choices and have a great experience (if it isn't what they want).Michele, so long as you are happy and satisfied with your births is what matters. ;-) Anyone who judges you for loving your induction births and epidurals is not a very kind person and I apologize on behalf of natural birth advocates, some of whom DO make women feel guilty and like crud for the choices they make. It's like with any mom issue (breast versus bottle, for example) we need to support one another in our decisions. My only point is to educate those interested in natural birth; not force it on others or make others feel guilty for not wanting/liking it.",
            "post_id": "6713491",
            "timestamp": "1299523505",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Thank You Joy!!! I sure hope so too! I want to try to \"naturally\" induce... walking, BD, pineapple, spicy foods... lol.",
            "post_id": "6713552",
            "timestamp": "1299524570",
            "user_id": "user_920871",
            "user_link": "/personal_pages/user/920871",
            "votes": "0"
        },
        {
            "answer": "Thanks Joy. ☺No, I'm not pregnant and not actively ttc right now either, lol. We're not quite ready for another baby just yet, financially and otherwise. We are most likely going to start trying for our third child in about three years, when my husband is well established into a career (he hasn't graduated college yet) and we're able to move into a bigger house. Right now we're living in a home that's less than 1000 sq ft, lol...I don't even know where we'd put another baby right now, lol!I really wanted to have a natural birth with my second son, but I didn't expect the preterm labor. That changed everything. Going through five weeks of labor that ranged from very strong and needing to be hospitalized three times to fairly mild while on bedrest but still uncomfortable and painful is an experience I'd wish on no one. I never in my wildest dreams thought labor could last for five weeks. It was miserable, especially the hospitalizations. When I was taken off the Procardia at 36 weeks, my OB and everyone else thought I'd deliver before 37 weeks, but my little guy stayed put--and the pain got worse by the day. By 37 weeks, I just could not mentally handle any more. I was a miserable wreck. I did want to have a drug free, naturaly birth...but my delivery was so fast and I didn't really have anyone to coach me through it. Although my epidural never had a chance to kick in and I basically had a natural birth, it wasn't what I wanted. They made my lie on my back even though I was screaming that it hurt and I wanted to sit up. I think that's the reason I got a 2nd degree tear. I still don't regret the induction, though. I just regret that I didn't have more understanding medical staff during my delivery who would work with me to give me what I wanted.With my first induction, I just had very little knowledge about labor and delivery. I think back on it now and I wonder how things would've turned out if I had waited to naturally deliver. I don't regret the induction, but I do wonder how different things may have gone.If and/or when I have my third, I want to get a midwife and try to do everything as naturally as possible.",
            "post_id": "6713641",
            "timestamp": "1299526234",
            "user_id": "user_184674",
            "user_link": "/personal_pages/user/184674",
            "votes": "0"
        },
        {
            "answer": "Joy, it's great that you want people to be informed and that you think it's best to do everything natural(want a home birth, no drugs, etc), but I don't think you should be pushing women to do as you think is right. Let women decide for themselves on what they want to do with their pregnancies. You are in a position of \"higher power\" on this board and can influence other women, so you need to think about that before talking about how natural birth is the best way to go for the mother and her baby. Some people want to be induced and others want to deliver by c-section. That is their choice to make and they can do just that. My mother chose to be induced for me to be born before her OB left for a week, as she only wanted him for her doctor, not for any medical reason. And this was years and years ago, which had no complications. If induction was not safe, it would not be done at all. It's passed through clinical trials and all of that long ago to be considered safe for women to do. It's great that you love to do things naturally, but other women want to be induced and they can certainly do that, without needing a reason to prove why.",
            "post_id": "6713785",
            "timestamp": "1299528695",
            "user_id": "user_613992",
            "user_link": "/personal_pages/user/613992",
            "votes": "0"
        },
        {
            "answer": "I had DD 3 months ago and we were planning on inducing at 39 weeks so that DH could be there and bc she was afraid that DD was going to be too big. Then she was worried bc I had SPD to the point I could barely walk and was going into preterm labor. She had to reschedule my 38w appt and that night I went into labor on my own and had my baby the following morning. She was 7 pounds and I labored for 18 hours and she got stuck. My pelvis didn't widen enough until I was in labor and I was in excruciating pain even with the epidural. I'm afraid that if I would have had to wait until the following week to deliver her that I would have had to have an emergency c section as she would have been too big for my body to deliver her vaginally. As it was, I had a painful and long delivery, but I am thankful that she came before the induction. My midwife didn't even want to schedule one as she had a feeling she wouldn't make it to the date and neither did I. I had a gut feeling the entire pregnancy that she would be born around the 10th of Dec, and she came on the 9th. Mother's intuition?",
            "post_id": "6713923",
            "timestamp": "1299530982",
            "user_id": "user_889551",
            "user_link": "/personal_pages/user/889551",
            "votes": "0"
        },
        {
            "answer": "I also live an hour away from the hospital. I have been induced with all 3 of my pregnancies and they were all at 39 weeks.I had no complications, my labors werent long at all. I have seen my doctor since i was 14 and couldnt imagine some stranger i didnt know or trust delivering my baby. I will take an induction if offered one this time as well. My longest labor was my first 7 hours. I wouldnt change my labor experiences for the world. Epidurals have risks and women still have them.",
            "post_id": "6714032",
            "timestamp": "1299533457",
            "user_id": "user_1609329",
            "user_link": "/personal_pages/user/1609329",
            "votes": "0"
        },
        {
            "answer": "sweetpea, thank you for expressing your opinion. I am not pushing any beliefs on anyone. I am merely sharing medical information and people are definitely free to choose the best route for them. If you actually READ everything I've written you will know that I always tell women to educate themselves and make the choices that are right for them. I am not on any higher level of power here except to make sure people follow the rules; that's it. I am a member just like everyone else and I'm free to express my personal opinions. I am not a MedHelp staff member, I am not paid. Just a regular member with the same membership as you.I do favor natural birth but I am not opposed to other options whatsoever. I honestly do not think you've read everything I've written here as I just said I have never had a home birth and probably won't have one this time. My midwives are at a *hospital*. I do advocate natural birth and I am not going to stop advocating the safest route for mother and baby. Neither will I judge anyone for the choices they make for THEIR birth. I only provide the data and women can make their own choice. As long as mommy and daddy are satisfied and at peace with their choices I'm so very happy for them. Please do re-read everything I wrote above so you understand that as I do not want to be taken out-of-context or misunderstood. And actually, in America, unsafe practices are done every single solitary day and not just on the maternity ward. Just because someone was in a car wreck and survived without wearing their seat belt doesn't mean seat belts don't save lives. Just because a few people have perfectly safe inductions doesn't mean women are put through emergency cesareans that could have otherwise been prevented. I highly recommend the book Pushed by Jennifer Block.NicoleW- I definitely believe in mother's intuition, LOL! When I was pregnant with my firstborn we got out a calendar and everyone put their guesses on which day my daughter would be born. Whoever won would get a gift card. Guess who won? That's right - ME! I guessed the time of day and the date. Didn't plan it, actually forgot about the contest until I realized I won and got the gift card. Hubby and I had our first date after her birth using that gift card!mamaof4410 - yes, epidurals are risky and women still get them. I only ask that women weigh the risks and make the right choices for themselves. I have had two epidural births and THANKFULLY didn't end up needing a cesarean and was able to push them out without forceps or vacuum. Putting evidence-based studies out there doesn't mean I am telling you that the choices you make are *wrong* but to weigh the risks with the benefits. Good luck with your upcoming birth!",
            "post_id": "6714075",
            "timestamp": "1299534571",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "AHP- I'm glad you don't regret it and that everything turned out alright. Do you have a different medical team this time? Perhaps one that is more sensitive to your needs and history? Sometimes induction truly is necessary. Being in labor for 5 weeks is just too hard on mom and baby. It truly is. If a mom is losing it and she needs help it's okay to ask for it. I couldn't handle the pain my first two births and got epidurals. Does it make me weak? No, it doesn't. I just didn't know what to expect or how to cope (and none of the staff seemed to care to help me cope more naturally). My firstborn I didn't get to hold right away because they gave me Morphine the night before to induce labor and it caused her to poop in utero. Meconium can be dangerous if baby aspirates it (they can actually die or become very ill; luckily she didn't aspirate it). My second daughter's collarbone broke during her birth because I was on my back AND the doctor was pulling on her even though her report later showed no indication of shoulder dystocia (being stuck). She had been waiting around all day for me to give birth and I think she was just tired and ready to go home by that point so she pulled the baby out of me instead of letting me push.So anyway that is my story on the first two and why I didn't appreciate others taking my labors and deliveries into their own hands. My baby got hurt (we didn't even know her collarbone was broken until the next day when the pediatrician came to check her out- and he was TICKED that it had happened in the first place) and that is just inexcusable what the doctor did during her birth.",
            "post_id": "6714095",
            "timestamp": "1299534996",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "And the risks are there. i would rather have taken the risk than risk having my baby in the middle of rush hour traffic alone.That was my point. Everything we do ultimately has risks, I feel very comfortable with the choice I made as should you. I would never get an epidural because of the risks and Im afraid of that needle.lol But thank you for putting the risks out there with the inductions.",
            "post_id": "6714100",
            "timestamp": "1299535082",
            "user_id": "user_1609329",
            "user_link": "/personal_pages/user/1609329",
            "votes": "0"
        },
        {
            "answer": "And thank YOU for understanding where I am coming from. I care so much for the women on this board that I literally just think of all of you all day and pray for safe deliveries (however those deliveries come about). I care about the women here and I care about their babies. I share this out of love, not out of a feeling of superiority or wanting to control anyone or tell them what to do.If I NEEDED an induction I would get one especially if it meant avoiding a cesarean. While I might still end up with a cesarean during an induction at least I TRIED a vaginal delivery. I definitely understand. I think people are misunderstanding me and that I'm totally anti-hospital, anti-doctor, anti-drugs and the truth is that I only want women to understand the risks. Doctors are supposed to give you information about both risk and benefit but they rarely ever do. No one told me ANY risks for a cesarean and I was expected to sign a consent form (in the event of emergency) while in the throes of labor?Anyway yes, I do understand that all things in life carry risk. I believe that was in the very first sentence I wrote when I posted this. ;-)  But knowing there are risks and knowing what the actual risks may be are two very different things.Thank you again for sharing your insight and experiences!",
            "post_id": "6714128",
            "timestamp": "1299535679",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I just don't agree that inductions are unsafe.  Period.  I just don't and I think that OBs get a bad wrap.  I choose to see a medical professional that I trust.  Who do I take my children to???  A pediatrician.  What is a pediatrician???  A doctor.  If I or my children ended up with cancer, who would we go see???  A doctor.  A specialist in fact.  Where would we receive treatment?  A hospital/medical facility.  So if there is a medical emergency, then OBs are fine and great to handle it, but if not, then they don't know what they are doing or what they are talking about.  At least that is what I am hearing here.Thank God there are such a thing as c-sections today.  Are they performed more than they should be?  Probably but that's why I said you need to trust your health care provider and make decisions WITH that person.  My doctor is very big on my being part of my own health care.  After all, I am paying him.  Thank God there are medications that can help women along if their bodies need it.  Once upon a time, there wasn't and there was a fair amount of women and babies that died during childbirth.  With today's technology, women and babies dying during childbirth is almost unheard of and I thank God and modern technology for that.Women that choose to induce for whatever reason do not love their children any less than those that don't.  Maybe that is not what this post is suppose to say or imply but that's why I have gotten from some of the comments.  I quit my job and have literally made it my life's work to dedicate my life to my children.  No one here knows me or what is in my heart and definitely, NO ONE knows how I feel about my children or how much they are loved, and that includes the one I am carrying now.  And I plan to have a scheduled induction, to insure my doctor is there, unless my baby has other plans.I am using the **I** word here a lot, but I am not just speaking for myself in actuality.  I am speaking for all women.  We all just do the best that we can and it is any and all of our responsibility to be well informed so that we can make well informed decision.By the way, even if you give birth at a hospital and are under a doctor's care.....no one can make you do anything that you don't want.  So if you want to go all natural and without any pain meds, you have that option.  NO ONE can force you into anything you don't want to do.  They can't make you take pain meds.  It is simply offered to you.  But at least if you have an emergency with your baby, you are somewhere where that can happen quickly.  My first stopped breathing shortly after he was born.  He had to be recessitated 3 times that morning and was put into intensive care.  No epidural and no induction.  Maybe if I had been given the pitocin to speed things along, he would not have gone through what he did.  They actually think my labor being as hard as it was, actually could have been the problem.  I also have a friend who's baby swallowed Meconium and had to have an emergency c-section.  They were losing him quickly, which they only knew because she was hooked up to the heart monitor machine...in a hospital.  So to me, if we are talking about risks here, a hospital is the LEAST risky place to give birth.  To me, giving birth anywhere is is taking unnecessary risks.In the end, we all do the best that we can.  The vast majority of us really are doing what we think is best for our children, but like I originally said, that will be different for us all.  And you are right Joy.  We really should support one another, but I just don't feel this post was supportive to all and I am simply defending my point of view and hoping that if anyone else feels the same way, they won't be afraid to share simply because they feel outnumbered.",
            "post_id": "6714141",
            "timestamp": "1299535901",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "**giving birth anywhere ELSE**",
            "post_id": "6714158",
            "timestamp": "1299536378",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "Michele, I truly did not mean to come off as unsupportive at all. As I said above to mamaof4410 I am not anti-doctor. I honestly think my viewpoint has become a little misconstrued. Medical stuff is never black-and-white and there are always two sides (or more) to everything. It is nearly impossible to get every little bullet point into a message here. I simply meant to inform women of the risks induction carries by sharing a little article, not to make anyone feel badly for any decisions they have made or will make.And you are correct - women have the right to refuse any care in a hospital. The problem is that women are not *aware* of that and think they have to be a 'yes man' to everything their doctor says without a second opinion. or receiving other options. Our maternity system is highly flawed. A few great cases of women with amazing doctors doesn't make up for the fact that the majority of OBs are causing serious harm to women both mentally and physically and serious harm to their babies.A cancer patient shouldn't just take a treatment plan they are uncomfortable with. They should research, get a second opinion, find all their options and execute the best action plan. The same is true for childbirth. I'm not saying don't trust your doctor; I'm saying trust your instincts and if you're uncomfortable go with someone else.You seem to be satisfied with how your births have gone and extremely happy with your doctor so I'm not entirely sure why you're being so defensive, especially as I stated that I am happy for you if you are happy and that I do not judge you in any way. You don't need to defend yourself to me or to anyone else.And being outnumbered? Plenty of women have just posted they are pro-induction or have had inductions they are satisfied with without flaming me once. This isn't about ME. This is meant to be a discussion, not a fight. If anyone is making it out to be a fight it is those putting up arms. Providing your experience and opinions is wonderful but at the end of it don't attack me for simply sharing something posted by a *MEDICAL* university who devotes their time to studying these types of things. Opinions are all good but at the end of the day actual statistical data trumps it every time.",
            "post_id": "6714178",
            "timestamp": "1299536742",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "Joy, I actually just spoke of comments.  I didn't necessarily say who they came from.  As I said, I consider myself well informed and just because I might make a different decision than you or anyone else, does not make me uninformed.  I am a research buff.I am not trying to fight either nor do I feel the need to defend myself specifically to you or specifically to anyone.  I am, as I said, just defending my view point.  And this was posted on a public forum and I simply commented.  And flaming you....not sure where that came from either.You are right...some people I guess don't know they can refuse anything at the hospital, although I am not sure why.  But that is also why I posted what I did in my previous post was to inform others that they don't have to do anything that they don't want to do and that they cannot be forced.I had a cousin who was diagnosed with cancer  and was given a treatment plan from MD Anderson Cancer Center here in Houston.  Now this is like the Cancer Center of the world here.  She didn't listen.  She wanted to try herbal this and that.  We all felt she was making a mistake but as we are speaking about here...it was her choice.  By the time she decided to go back to MD Anderson and listen to them, it was too late.  She was only 48 and left behind a 14 year old daughter and a 16 year old son.  She had homeschooled those kids their entire lives and they were her life and she was theirs.  It broke my heart to see those children at the funeral.  When her daughter gets married, she won't have her mother there, etc.  Many things went through my mind that day.  If only she had listened to the medical professionals.  I can't help but think that she would be here today.  I can't say for sure, but I also can't help but wonder.My best friend's mother died last July of cervical cancer because she had not had a pap in like 19 years.  She was only 56.  Had she have seen a doctor, she would probably be here today as well.So I hold doctors in high regard.  If statistics trumps your experiences, then that is great for you.  But my experiences speak volumes to me and most statistics come from just that....people's experiences.  We will simply just have to agree to disagree...",
            "post_id": "6714249",
            "timestamp": "1299538103",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "I totally respect you for sharing, I was just confused because I got the impression I offended you to the point of needing to defend yourself. I am actually sitting here crying because I feel absolutely horrible if I have made anyone feel badly and I will most likely delete this post to not cause anymore hurt or fear. That definitely was NOT my intention whatsoever. I just wanted to HELP but I think I just made things worse.I am definitely not anti-doctor. But I am definitely for people advocating for themselves and working together with their doctor, rather than just taking everything they say as the law. Does that make sense? My own mom died because she had a lump she failed to get checked out for a long time. Was that a doctor's fault? No, she should have been a voice for herself and gotten checked out right away. People have to be a voice for their own care. People die, people live whether they choose a more holistic approach or a more medicalized approach. Each and every case is so different. I only meant to share, not make anyone feel bad. And for that I'm truly, truly sorry.",
            "post_id": "6714262",
            "timestamp": "1299538456",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I wasn't making a blanket statement that at home birth is unsafe.  I was not considered high-risk in my first two births, but they had complications at birth that required immediately be taken away for not breathing and neither were induced.  I am not naive to know that women have given birth away from hospitals since the beginning of time.  I was merely saying that I was glad to have been at a hospital and that it is something to consider.  And I have seen a midwife in the past and she was not as knowledgeable as the OBs and REs that I have seen.  I left her practice.  Maybe she was a bad lemon, but I know I made the right choice for me.  My other doctors have always been forthright with me and told me of the risks of procedures and risks of not having procedures.  I try to educate myself either way.  I think it sounds like a matter of finding a medical professional that you trust no matter the type.",
            "post_id": "6716646",
            "timestamp": "1299607713",
            "user_id": "user_231051",
            "user_link": "/personal_pages/user/231051",
            "votes": "0"
        },
        {
            "answer": "Would it be possible for you to post some info on ''more natural ways of induction'' as im totally confused about nautral ways ( be it pineapple or sex or whatever else might help) to the more sever induction that cause these problems.as i have said before the ob is way to offreing with me about telling me what hes going to do without telling me what he CAN do instead...I wasnt aware of the diffrence between doing a sweep or what ever else they do?Im going to go to the idwifes in a few days and im going to have a huge chat about what is done and what the options are.. They say its to early for me to be thinking about that but i believe the more i think about it and the more info i get on it it will help me make the right choice for me and the baby....",
            "post_id": "6717630",
            "timestamp": "1299626178",
            "user_id": "user_1419501",
            "user_link": "/personal_pages/user/1419501",
            "votes": "0"
        },
        {
            "answer": "re:  \"home birth has been proven to be safer than hospital birth for low-risk women who have a medical professional present (in those cases a CNM or CPM). \"This is based on faulty research. When you compare the same population (i.e low risk women)  there is a higher incidence of adverse outcomes (deaths, birth injury) with home births with CNM as compared to physician assisted hospital births.The studies that show lower risks with CNM compare ALL populations (including high risk women). Once you compare the SAME low risk population, the numbers change dramatically.I did a lot of research on the subject when my husband and I first started talking about having another child and I seriously considered a home birth because I believe that natural is better and physicians tend to interfere where they are not needed. I am in nursing school and did my Maternal Child rotation in December 2010. Most of the interventions done seem to me to be so the HOSPITAL/doctor can hurry things along and free up a bed for another customer...since they only get paid for the delivery once...so better it only take 9 hours instead of a day or so.I don't even agree with artificial rupture of membranes (pretty much NO medical reason for it and increases risk of a prolapsed cord and infection) which is now pretty much standard practice.Btw you can probably guess I am not in favor of elective inductions :) I think God schedules things for a reason and we are asking for problems when we decide we know better...I really wish the Tulsa, Oklahoma area had a birthing center. Here you have a choice between home and hospital :(ChristinePS My own birth experiences have been 2 deliveries. First was spontaneous labor complicated by a BAD reaction to Demerol. Vaginal delivery, no epidural. Second was scheduled to be induced because he was post term and NST showed some distress. They admitted me the night before and put gel on my cervix to ripen it. I went into labor overnight and delivered vaginally, no iv meds or epidural, 41 minutes after my membranes spontaneously ruptured.Both times I told my doctor/nurses absolutely NO artifcial rupture or membranes. The only personal experience I had with AROM was when my aunt had to have an emergency c-section due to a prolapsed cord right after AROM...so I admit to strong bias in that area.",
            "post_id": "6718059",
            "timestamp": "1299635731",
            "user_id": "user_1629276",
            "user_link": "/personal_pages/user/1629276",
            "votes": "0"
        },
        {
            "answer": "This was a very interesting debate and I'm sorry I wasn't here for it, lol.I was induced for medical reasons 3 days before my son's due date, and the induction was easy, healthy, and the most amazing experience ever....but I had a very clear medical reason. I do not believe inductions should be elective before 38wks. period. but I believe that for medical reasons inductions can truly be a life-saver.I do not agree with elective inductions for convenience any more than I agree with elective c-sections for convenience...there is nothing \"convenient\" about bringing a life into this world in a healthy manner, and there's no way to force that scenario onto childbirth.but it has worked and does work for some people...and elective inductions for a good cause, like I said, can be truly  a Godsend for some women and babies. (when I say convenience, btw, I don't mean \"I live 4 hours from the hospital and need to be induced for convenience\"...that's a completely different scenario and I totally understand that).However...I have and always will support any woman on this board who chooses to induce. I may gently suggest that they wait until the last possible day to do it, but I would never belittle or berate someone for their choice because clearly I do not live their life.I do want to say, Joy....yes, home births are considered safe for low-risk women. However...very often, you don't discover that a woman is high-risk until an emergency has arisen and mom or baby's life is in danger...like what happened with my first delivery. I was a perfect candidate for home birth and in fact considered it...and if I had gone along with it, I would have bled to death...but there was absolutely no way to predict it. I'm all for midwives...but in a medical setting \"just in case\".Anyway...good job debating calmly and respectfully ladies. I'm so proud to be a part of this board!",
            "post_id": "6721891",
            "timestamp": "1299730365",
            "user_id": "user_1035252",
            "user_link": "/personal_pages/user/1035252",
            "votes": "0"
        },
        {
            "answer": "I missed this debate as it was happening, too.  But, it was quite an interesting read.  I was induced with my son at 40 weeks and 2 days (depending on whose date you go by) on Dec.10.  That was the date I had in my head, but my doctor dated my pregnancy based on LMP and a 28 day cycle, so she had me due on Dec. 1, even though all of my ultrasounds dated my son due between Dec. 6-8.  The later dates were more accurate to me, because I usually have a 35 day cycle, and I knew when I ovulated that month because I was using OPK's.My doctor really wanted to induce me on Dec. 3, because in her mind, he was already late, and she was worried that he'd be too big and there wouldn't be enough fluid left in there, so she made me come in to her office practically every other day between Dec. 1-10 and I did 2 extra ultrasounds and a non-stress test.  She also did a membrane sweep, without telling me before doing it - which I still think is wrong, but apparently legal??I had lost my mucus plug on Friday Dec 4, so at least I did something naturally!  LOL  By the time I was induced, I had been at 1 cm dialated for a few weeks, and thank God the induction went smoothly and 12 hours after checking in to the hospital, I delivered my sweet boy who is 15 months old and is just as healthy and smart as can be now.I always think his birthday is Dec. 12, though, because I think if I'd let my body go in to labor naturally, that'd be the day that he would have come.  I don't know why, but that's what I think.I do agree that doctors push inductions too much for their convenience, and so they can be in control of the situation, and my doctor and her nurse at their office were ticked when I didn't want to induce a week early.  I am glad I stood my ground and waited another week because I really think I would have ended up with an emergency c-section.  If I had to induce again, I'd want to wait until after 40 weeks again, and maybe even 41 weeks, just in case my \"instinct\" date is correct.I only know of two people, myself and my step-mom, who were induced and did NOT have to have an emergency c-section.  A few other patients of my doctor that I know and other friends that were induced (too early in my opinion) all had emergency c-sections.  That makes for a scary statistic and I was worried going into mine.  Luckily I was far enough along in the pregnancy that the induction worked for me.Well, anyways, that was my story, and I guess my opinion is that inductions and epidurals are great and do serve a purpose, as long as they aren't used out of convenience, especially the doctor's convenience.  (I am of course not talking about the ladies who live hours away from the hospital - that's a completely different kind of \"convenience\".  I'd opt for inducing instead of having my baby in a car on the side of the road too!)Oh, and I was pleased that this was a \"debate\" and not an \"argument\" for the most part, so I'll second Ashelen and say, it's an honor to be on this board to learn and discuss important topics in a civil manner! :-)",
            "post_id": "6726368",
            "timestamp": "1299865389",
            "user_id": "user_676143",
            "user_link": "/personal_pages/user/676143",
            "votes": "0"
        },
        {
            "answer": "I have read what you wrote and disagree with your opinion. \"not going to stop advocating the safest route for mother and baby\". You can think that a natural home birth is the \"safest\", but that is your opinion. If something goes wrong, a hospital is the safest place for mother and baby, not at home. If the mother is at home, a midwife can only do so much to help her and then they have to call 911 to be taken to a hospital by ambulance. The safest place to be is in the hospital. Then the mother and anyone with her should be educated on all options for them. If the doctor suggests something, then they should ask questions if they do not feel comfortable with what is going on. The patient must be their own advocate. Doctors, for what ever reason, get a bad rep. Though they are doing what they think is best for the mother and baby. In all the time I was shadowing in the labor and delivery ward, only a couple of the mothers who had been induced had complications. It's good to have opinions and educate yourself, but make sure what you post is credible, too. Home births are not \"safer\" then hospital births. Plus inductions are safe enough that they have been included into everyday practices.",
            "post_id": "6726760",
            "timestamp": "1299874049",
            "user_id": "user_613992",
            "user_link": "/personal_pages/user/613992",
            "votes": "0"
        },
        {
            "answer": "Just wanted to clarify...when I say that I induce by choice, I don't mean that I induce weeks before my due date.  My doctor wouldn't let me do that even if I wanted to.  See, my doctor works in 3 different hospitals.  Well, he has privileges at 3 and all 3 of those hospitals have professional buildings attached to them, where my doctor has offices.  So we induce the same week I am due.  There is one hospital in particular that I really like so we pick the day of that week that he is working at that office so he is really close by when I deliver.  They simply call him and he is there within a couple of minutes.  And I have never had to have a c-section for any of my births.  My doctor won't do one unless he absolutely has to.  I just want to make sure that my doctor is there.  If I go into labor late at night or on a weekend, he may not be on call.And sweetpea, I agree that the vast majority of doctors do really want what is best for their patients.  I mean, there are exceptions I'm sure just like with police officers or anything else, but I believe that most of them got into medicine because they wanted to help others and make a difference.Ashelen, I also agree with you in that even those that are considered \"low risk\" can have unforseen things happen.  My son (1st baby), I used as an example in one of my previous posts.  He stopped breathing about 6 hours after he was born.  They were actually getting ready to bring him to me and he stopped breathing and turned blue.  He stopped breathing 2 other times that morning.  It was really scary.  It would be scary at any age, but I had just turned 18 and was terrified.  If he had been at home, he probably would have died.  He was full term with no induction or epidural.  Back then, they wouldn't give you an epidural until you were at least 5 cm dialated.  By the time the anesthesiologist got there, I was already 9 and they weren't going to administer an epidural that late either. I begged too.  Believe me :)",
            "post_id": "6727068",
            "timestamp": "1299881335",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "I have read all the post and the article and I think there are risks to everything, inductions, natural delivery. I am definitely in favor of  inductions but I also think natural delivery  would be great too.When I was pregnant with my first I wanted to have a birth at a birthing center and a water delivery in fact however there wasn't a birthing center in my area that I could have that experience so I eneded up deciding to have a hospital birth with my doctor.  I have a history of depression and ppd has occured in my family so when dh told me he would be going out of town for work I was worried I would be overwhelmed not having him there to help me in the first couple weeks after my son arrived so I talked to my doctor who told me all the risk of getting an induction and how I could very likely end up with a ceserean since I had not dialation or effacement. I wanted to be induced anyway so she induced me at the next day at 40 weeks instead of waiting for him to come on his own and it went great. I am really glad that I didn't wait because I had a gut feeling he was going to be a week late and if that was the case he could have ended up being to big for me to push out since he ended up being 9 1/2lbs on his due date.I am pregnant again and my doctor is planning on inducing me at 39 weeks since this baby is shaping up to be bigger then my first and if my test results come back with me having GD I may even have to be induced even earlier which I hope is not the case but anyways I just wanted to say that a mother should be able to choose what she feels is right for herself and her child.",
            "post_id": "6728222",
            "timestamp": "1299919467",
            "user_id": "user_339134",
            "user_link": "/personal_pages/user/339134",
            "votes": "0"
        },
        {
            "answer": "I really don't have time to read through ALL the replies since there are so many and they are so long.  I just want to throw out MY opinion and experience.I don't necessarily believe in induction for \"convenience\" or \"scheduling\" a delivery.  But I do believe it is a great tool for other sitations.I have been induced twice...once with pitocin and once naturally via breaking of my waters.  Both times were done in order to ensure MY doctor would deliver me.  WHY?  Becuase my doctor is LITERALLY the ONLY doctor around here who would allow me to VBAC...even though I had several VBAC's before these two pregnancies.  This last time...even though I had VBAC's FOUR previous times successfully with NO issues....the nurse in L&D STILL insisted on \"prepping\" me in case of cesarean....she was SO certain I would end up wtih one...she refused me to drink anything and gave me crap about ice chips...she also shaved my belly...which I could have refused but wasn't in the mood to argue..what's a little hair?  I ended up with my VBAC thanks to the fact that my doc DID induce me on a night that he had hospital rotation.I also agree with women who opt for induction when there is a risk of another doctor being present if spontaneous labor occurs.  In my opinion this can be even riskier than induction.  A doctor who does NOT know your particular case/situation/pregnancy can make some very BAD decisions concerning your care. There is NO way they can brief themselves completely enough from your medical chart to make the absolute right decisions 100% of the time.As with everything there is risk.  Natural, drug-free, unassisted child birth is risky....this is why so many women died during childbirth many years ago.  I DO agree that inductions and c-sections are done far to often for unnecessary reasons...but there are situations where it can be argued that it IS better-even if it isn't life threatening.As with everything, we all have our opinions, but it boils down to personal choice. SO long as the woman is educated in her choices and the risks/benefits it is up to her to decide what is best in her situation.",
            "post_id": "6743393",
            "timestamp": "1300374335",
            "user_id": "user_202436",
            "user_link": "/personal_pages/user/202436",
            "votes": "0"
        },
        {
            "answer": "I forgot to add that BOTH of my inductions were ON my due dates.  I have also had an emergency c-section with my first (yes it WAS life or death)",
            "post_id": "6743403",
            "timestamp": "1300374584",
            "user_id": "user_202436",
            "user_link": "/personal_pages/user/202436",
            "votes": "0"
        },
        {
            "answer": "Joy:I just want to say that I am really glad you brought this up because I agree it is a very important topic. I am not for scheduling induction but I know there are some medical reasons to do it. I was induced. I didn't agree with it for many reasons. I had GD and was getting a NST twice a week and an u/s every week to check the baby and his growth. My Dr pushed me to get induced at 38 wks, I faught her over and over and she agreed to let me go to 39 wks. She stated \"I never let my GD patients go past 38 wks.\" It was stressful and I didn't want to do it. My baby only turned out to be 5 days early but it was hard on him and me both. I have a CNM this time around and she isn't going to push for induction until 42 wks which I am thankful for. With your 1st sometimes it is hard and scary cause you don't know what your rights are but I think you get smarter as you go. I didn't have to have an emergency c sec but it was close. I faght that too and he came 30 min later. The whole process was 27 1/2 hours long! There are reasons I am against this too and it is because both my sisters were induced and had emergency c sections because the baby was in distress. It is scary and can be avoided in many cases. One of my sisters did find out she cannot have children naturally because her hips don't spread and they get stuck so she has to schedule c sections which she does on her due date. Her middle child wasn't ready so they must have been off on his due date and he was on a respirator for a week due to lungs being undeveloped... this is what scares me the most. Babies really do come when they are ready. Again, i agree that there are medical reasons to be induced but there are WAY to many dr's doing this for convenience. My little sisters dr was going out of town so scheduled hers the Thursday before she was due and it was a long stressful labor that ended up in an emerg c section.",
            "post_id": "6743573",
            "timestamp": "1300378130",
            "user_id": "user_1294482",
            "user_link": "/personal_pages/user/1294482",
            "votes": "0"
        }
    ],
    "post_id": "6711268",
    "question": "I think with anything in life there are risks and benefits. But when it comes to your baby's well-being I think it is safe to say that we must take extra precaution. I just came across this article from the University of Rochester Medical Center and thought I would share and get a discussion going.http://www.urmc.rochester.edu/news/story/index.cfm?id=3120Obviously plenty of women have given birth via induction without a problem but studies have shown the vast majority do not. Induction taxes your body (and baby's body) and even if the outcome is positive (a live baby) it doesn't mean the road to getting that baby didn't have major risks.I'll pull a few quotes to highlight some main points but definitely go take a read. It is important to educate yourself about the birth of your baby. Trusting your doctor is all well but you must remember that only you can be an advocate for your delivery and the care of baby afterward. Unfortunately there are hidden agendas and fear of litigation that drive physicians to do great harm to women (the opposite of the oath they took when becoming a medical professional). Anyway, on to my quotes:\"In the past decade, scheduled deliveries have become commonplace, with physicians making elective inductions part of their routine obstetric care.“As a working professional and a mother, I know how tempting it can be to schedule a delivery to try to get your life in order, but there is a reason that babies stay in the womb for the full term,” said Loralei Thornburg, M.D., an assistant professor who specializes in maternal fetal medicine. “Why put you and your newborn at risk if you don’t have to?”\"Researchers found that approximately 34 percent of women who opted for elective induction of labor ultimately had a cesarean section, while only 20 percent of women who labored naturally underwent a cesarean delivery. Like elective induction, cesarean delivery naïvely may be seen as routine and risk-free, when in fact it is a major surgery and like all surgeries increases the risk of infection, respiratory complications, the need for additional surgeries, and results in longer recovery times.\"Though elective inductions are not outside the standard of care, physicians should be cognizant of the associated risks and communicate these risks to women considering the procedure. In an effort to better address this issue at the University of Rochester Medical Center, the department of Maternal Fetal Medicine is applying for a grant to help put procedures in place that will prevent elective induction of labor before 39 weeks.",
    "timestamp": "1299462461",
    "title": "Risks of Induction",
    "user_id": "user_376739",
    "user_link": "/personal_pages/user/376739"
}