{
    "answers": [
        {
            "answer": "I had to do the same thing with Hunter....My hubby is a painting so he is always driving were ever the jobs are, and with my luck, he was working over 2hours away when I was in the last weeks of pregnancy, so at my 39w check up i asked the same thing, to be induce just so I would know my hubby would be there! So that friday morring I was induce with pitocin(sp) and we got thing going......SO I understand were you are coming from! For us it was the best thing to do!",
            "post_id": "4362318",
            "timestamp": "1239918448",
            "user_id": "user_285793",
            "user_link": "/personal_pages/user/285793",
            "votes": "0"
        },
        {
            "answer": "I would schedule it. I think your dr is just covering all the bases. Yes some women end up having a csection, but odds are if it was going to happen it was going to happen. You're at your due date so go for it. I have to be induced this time around because my last labor was less than 3 hours start to finish and they are afraid of me having the baby at home or something like that. I was nervous about it too, but I did tons of reading up and now I'm okay with it.Good luck either way and be sure to keep us posted. BTW I can't believe you're at 39 weeks where did the time go??",
            "post_id": "4362462",
            "timestamp": "1239921537",
            "user_id": "user_349463",
            "user_link": "/personal_pages/user/349463",
            "votes": "0"
        },
        {
            "answer": "Not every induction ends up in c-section but you definitely are at a higher risk. I would try to go in with the hopes of them trying to let you do things as naturally as possible (in the sense that you don't have to use a ton of drugs right off the bat).They can dilate you, then sweep your membranes. Wait a few hours and see if contractions become stronger. Then they can break your water (ask them to hold off on the Pitocin because breaking your water can bring on STRONG contractions). After about 3 hours they may start the Pitocin if you're not progressing.It is proven that laboring while standing (rather than lying in a bed) can shorten your labor and reduce your chances of having a c-section. So even if they break your water you can get up and walk.",
            "post_id": "4362567",
            "timestamp": "1239923951",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I did not have a good expereince with induction...it did not work for meI was already dialted 3cm but never had any contractions when the \"tried\" to induce me.The first time on picton i did not have any contraction and after a few hours the baby's heart rate went up to about 188 (and stayed there) and my blood pressure also rose. The Dr was debating a c-section (but the or was full for a few more hours) I had such a hard pregnancy she really wanted me to deliver naturally so they stopped the picton and tried again the next day.The next day they started the picton again, I still did not have any contractions so the Dr broke my water. Contraction started IMMEADITLY. I had said i wanted an epidural, after just 1/2hr i started complaining of pressure. So they called for an epideral and were told 45 minutes and they called for the Dr to come (she was in clinic) I watched the clock for 45 mintues and said when it was up....they told me i wouldn't be having an epi...that it was time to push anyways. Had a hard time delivering, he was face up, and I ended up with a seperated pelvis.",
            "post_id": "4362604",
            "timestamp": "1239924646",
            "user_id": "user_414635",
            "user_link": "/personal_pages/user/414635",
            "votes": "0"
        },
        {
            "answer": "Oh and we were told on Sat i would be induced on monday morning so DH took the week off, monday we were bumped due to a more serious case, tues it didn't work, wed i had the babe but due to the seperated pelvis i did not get home till monday when DH was back to work....he hasn't been able to get more time off until this week and carter is 5 weeks old and my first week home i wasn't able to carry the baby up or down the stairs, my mom had to take the week off to come and help me",
            "post_id": "4362616",
            "timestamp": "1239924856",
            "user_id": "user_414635",
            "user_link": "/personal_pages/user/414635",
            "votes": "0"
        },
        {
            "answer": "I was overdue with my son - went over 41 weeks - and was induced.A friend called me the day that my OB told me I'd have to be induced and was sending  me to triage to have Cervadil inserted that night and \"joked\" about how she hoped I wouldn't have to be induced because inductions are BRUTAL....Anyway.....I have quite the opposite story to tell.  The Cervadil totally worked for me:  I had it inserted around 6pm - by 10pm, I was already cramping.  Woke up at 3am having contractions, albeit mild.  Started bleeding a bit, at which point DH and I returned to the hospital (at 6am).After walking the halls for a bit - until my room was ready, at 10am - I was officially admitted and put on a Pitocin drip.  Labour didn't really get going until my OB came in at 1:45 and broke my water for me.  Contractions were fast and furious at that point....and I was having back labour, so quite intense....but an epitdural did the trick and I delivered DS naturally at 9:44pm that same day, after just 30 mins. of pushing.Inductions don't have to be horrible! :-)",
            "post_id": "4362835",
            "timestamp": "1239929230",
            "user_id": "user_470885",
            "user_link": "/personal_pages/user/470885",
            "votes": "0"
        },
        {
            "answer": "I was induced in my 39th week due to pregnancy-induced hypertension.   My Bishops score was non existent so I was worried about the success but everything worked well and I delivered naturally.  I was induced w/ pitocin and progressed from a 0-3cm within a few hours and did NOT feel contract pain at all until 9h after the drip was started and a few hours after my water was broken.  Got the epidural a few hours later (ended up dilating from 3-9 in less than 2 h).  I have no regrets about being induced.BTW: your husband is entitled to take 3 months unpaid leave under FMLA once your baby is born IF he works for a company that meets a few requirements (has to have a certain number or employees etc).  His work can NOT penalize him for taking FMLA leave if eligible.  Just wanted to throw that out there.",
            "post_id": "4363143",
            "timestamp": "1239934895",
            "user_id": "user_91555",
            "user_link": "/personal_pages/user/91555",
            "votes": "0"
        },
        {
            "answer": "I was induced at 39 weeks due to having mild preeclampsia.  I was a fingertip dilated and had been for 2 weeks.  My baby was sitting very high, which made my doctor tell me he ws 99% sure I would have a c-section (but I told him I wanted to try it on my own, which is why he induced me rather than just c-sectioning me).  Since I was already a fingertip dilated, I didn't need the cervadil (sp?) so I was admitted at 5am and they started the pitocin at 6am.  At 8am the contractions were there but not painful.  The doctor broke my water and the contractions started immediatly.  By 10am I was 3 cm and they gave me an epidural (the contractions were worse than I thought they would be at 3cm).  From there, they ended up stopping the pitocin because I was dilating so fast (so it wasn't necessary to keep me on it) and by 1:30pm I was fuly dilated.  I had to push for 2 hours straight because my daughter was still sitting high.  I ended up pushng good enough for her to drop and was able to deliver her naturally.  Every women is different and inducing can either make take forever or happen really fast.  I felt lucky because the whole process lasted 7 hours and I was really thinking I was going to be there the whole day waiting to dilate.",
            "post_id": "4363146",
            "timestamp": "1239934980",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "bump...anyone else?  Thanks for everyone sharing!  I can't wait to talk to dh about it tomorrow!!!!!  I feel like I just need to talk it over...I just hope I am making the right decision...I feel guilty almost for 'rushing' it and then I also feel scared that it won't be the right decision and that it wont work and that I'll have a horrid experience etc.  Maybe I'm just too emotional to think straight at this point!  I guess getting some shut eye and sleeping on it so to speak might help too!",
            "post_id": "4363157",
            "timestamp": "1239935125",
            "user_id": "user_435139",
            "user_link": "/personal_pages/user/435139",
            "votes": "0"
        },
        {
            "answer": "Just wanted to say good luck. Who knows maybe you'll go on your own before then...stranger things have happend. GOOD LUCK! :)",
            "post_id": "4363170",
            "timestamp": "1239935350",
            "user_id": "user_210400",
            "user_link": "/personal_pages/user/210400",
            "votes": "0"
        },
        {
            "answer": "It's your choice, sweetie, and it's so stressful when women have the added stress of not knowing if their spouse will get off work. My SIL had to think about the same issues. Her induction went very well. She went in at 6am but wasn't induced until almost 10am. She had her son a 1:16 so she was only in labor for a few hours.Not every induction is a horror story and I hope yours goes well! Just speak up about what you want.",
            "post_id": "4363286",
            "timestamp": "1239938360",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I think I am going to stick to it and HOPE and PRAY that I'll go before then!  I started to lose what I assume is my mucous plug this a.m. THEN I did my prenatal aerobics hoping to move things along ;)THANKS for everyone's support and replies...",
            "post_id": "4363877",
            "timestamp": "1239965202",
            "user_id": "user_435139",
            "user_link": "/personal_pages/user/435139",
            "votes": "0"
        },
        {
            "answer": "i agree with those who said that NOT every induction has to be horrid... i know quite a few ladies who have wonderful success stories with induction.. unfortunately almost 15 yrs ago i was not one of them.my daughter was 2 weeks overdue (due june 16th) they admitted me to be induced on june 30th... they started the pitocin around 6am and by 6pm i had only dialated to 3cm... they STOPPED the pitocin overnight... not sure why but the oncall doc told them to... they started it back up the next morning, and the mild cramping i had the day before ended up being pretty good contractions for awhile. around noon they took that stick that looks like a big crochet needle and broke my waters... contractions started being awful and the waters were full of merconium (babys first bowel movement....VERY common in overdue babies) they let me labor (severe back labor) until they started to prep me for a csection at 11:30pm... that is almost 12 hours since the waters being broke, and merconium being found.  my daughter was born at 11:45pm on july 1st weighing 8lb 8oz and measuring 19 inches long.  luckily she didnt have jaundice or pnemonia which i guess is common in babies who have been in labor with merconium stained waters....the only thing that DID happen and i believe it was due to the merconium is i developed a slight infection which they took care of with IV antibiotics, but i had to stay in hospital a extra couple of days... from the day i went in june 30th to july 5th i was in hospital.mine IS a horror story and i dont want to scare you because that was soooo long ago they have changed alot since then... just go in hoping for the best and prepare for the worst... i try to do that with everything in life.. expect the worst but pray for the best...lolgood luck and i look forward to reading your birth story.",
            "post_id": "4363976",
            "timestamp": "1239969313",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "I was induced with both of mine.... I just had my son 6 weeks ago and both inductions went just fine..... I think the odds of the meds not working and you having to end up having a C section are very low.... so no worries.... baby is full term and at least you know DH will be there for it! I say go for it",
            "post_id": "4364065",
            "timestamp": "1239971888",
            "user_id": "user_589762",
            "user_link": "/personal_pages/user/589762",
            "votes": "0"
        },
        {
            "answer": "I am going back over 20 years, but I had my first daughter without being induced and was 5 cm before getting to the hospital.  I ended up getting an epidural when I was between 6-7 cm, because it getting to be too much.  I had her naturally.With my second daughter, I was overdue by 5 days and asked doctor to induce me.  I was already at 2 cm when the induction started, but by the time I hit 3cm, I was BEGGING for that epidural.  I don't know if I was wimpier the second time around, because I remembered the pain from the first delivery, or if the contractions were much more intense because I was induced.I still don't know the answer to that question, but my second labor seemed a lot more intense than the first, so........was it the pitocin that created those hard contractions the second time?  I guess it doesn't matter at this point, LOL.....Good luck to you though..",
            "post_id": "4364240",
            "timestamp": "1239975535",
            "user_id": "user_389205",
            "user_link": "/personal_pages/user/389205",
            "votes": "0"
        },
        {
            "answer": "Try not to worry....I know it's hard, especially w/ it being your first.I was induced w/ one of mine.  But it was by choice.  And it was with my 4th.  I did that because I almost didn't get my doctor w/ my third.  I went into labor on a Sunday and my doc wasn't on call.  Luckily, he spoke to the on call doctor and my doctor showed up.  Thank GOD!!!Anyway, my induction went well :)Now my SIL, was induced w/ her first for preeclampsia (sp??).  They admitted her at night and gave her that medicine to thin her cervix.  She went into labor all by herself in the morning without any help of any drugs.  Thinning her cervix was enough.  And like I said, it was her first.  On top of that, she was only 36 weeks along.So, try not to worry.  There will be some horror stories, but I don't think that's par for the course.  If you trust your doctor and your hospital, everything should be just fine.Induction is actually kind of neat in the sense, of that you know what to expect and when.  There is no guess work like, \"Well, are these braxton hicks or is this the real thing\"?Hang in there!!  It won't be much longer.  And shame on your husband's job for being jerks about you having a baby and your first at that.  I would also look into the FMLA as spade suggested.  Your husband does have your same rights if his company meets some requirements.  I think the company has to have at least 50 employees.  He does have the same rights as you, but maybe not at the same time???  What I mean is, say you want a parent to be there for 12 weeks w/ the baby.  Say you will take 6 of it and then he will take the next 6.  By law, assuming his company meets those certain requirements, he has a right to do that.  That is what I understand about the FMLA, but I could be wrong.  I haven't looked at it since 2001.",
            "post_id": "4364306",
            "timestamp": "1239976796",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "Just wanted to jump in and say that I had a great experience being induced (I don't remember if I told you that or not!)  It doesn't always have to be horrible.  :)  I'd do it again (just a little closer to my due date this time around!)  :)",
            "post_id": "4365125",
            "timestamp": "1239989006",
            "user_id": "user_583259",
            "user_link": "/personal_pages/user/583259",
            "votes": "0"
        },
        {
            "answer": "I was supposed to be induced since my daughter was still up very high, I had not dilated AT ALL or effaced one bit and I'd hit 42 weeks.  They did a non stress test to see if she was ok in there and had enough fluid, which she did.  I ended up having a c-section because of a previous injury to my hips, but it had nothing to do with an induction not working.  I just wanted to tell you that IF you do end up having to have a c-section, they are not the end of the world.  I had an amazing experience with mine and my recovery was very easy.  I did everything they told me to do and rested as much as I could while my daughter slept in the nursery.  You'll have plenty of time at home to bond, so get your rest while you have help.As for your husband, what another mom said is absolutely correct.  So long as his company qualifies, he can get FLMA and they can NOT do anything to him.  They have no choice but to give it to him, but it is unpaid.  My husband chose not to take it because we couldn't afford for him to be home without pay.  I was already a stay at home wife since I had a difficult pregnancy.  But he could have taken it and there was nothing his boss could do about it.  Personally, I was happier with DH at work.  I recovered much faster too since he didn't stay at night with me in the hospital since he had to work.  He came in every morning to see us and then off he went.  Then he'd come back after work.  I'm sure you and your DH will figure out what will work out best for you, but I encourage him to look into FMLA  (Family Medical Leave Act).  Good Luck and let us know how you're doing!",
            "post_id": "4365212",
            "timestamp": "1239990647",
            "user_id": "user_294806",
            "user_link": "/personal_pages/user/294806",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies...I'm sharing these with dh too...The whole time off thing is hard to explain...he qualifies for time off under fmla BUT we can only afford him to take 2w unpaid.  When he told his job he wanted 2w off for the birth of his child as covered under fmla, they told him to fill out a time off request form starting with the due date...and he explained that it was an estimated due date and that he would like to work up until the day of the due date and start his leave then but they gave him a bunch of malarkey saying they needed to make the schedule and he was either on it  or off it and if he was on he was expected to work blah blah blahOH well...at least he'll be home for me and the birth!",
            "post_id": "4367917",
            "timestamp": "1240060900",
            "user_id": "user_435139",
            "user_link": "/personal_pages/user/435139",
            "votes": "0"
        },
        {
            "answer": "Oh girl I am with ya about the fear of induction! I was scheduled to be induced on Feb 10th in the am and I was terrified! I prayed and prayed he would come before then. And low and behold my water broke the morning of the 9th! And funny enough since he was born at midnight it was the 10th! LOL guess he wanted to be born on the 10th but I was so happy my water broke and I didnt have to be induced. And the SAME thing happened to my friend and my mom. Their waters broke a day before her induction date...so dont give up yet! That lil boy might just be waiting til the last possible moment! Good Luck, can't wait to see pictures of that little man!! :)",
            "post_id": "4368597",
            "timestamp": "1240078112",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "Unless the baby is in danger, I would never let them induce me.  I am a strong believer that once medical intervention starts, more intervention is needed as the natural birth process doesnt have a chance to run the normal course.  I just have heard so many stories about those who are induced, who later need something for contractions or need to have water broken or need this or that, and then an epidural and then everything slows down and then later something to start the contractions again.....Therefore it isnt for me.It is a shame that you are in this situation because of your DH's job.  Keep us updated...",
            "post_id": "4368886",
            "timestamp": "1240085831",
            "user_id": "user_159157",
            "user_link": "/personal_pages/user/159157",
            "votes": "0"
        }
    ],
    "post_id": "4362243",
    "question": "Hi ladies!  So, I'm 39w3d and my due date is Monday, the 20th.  I was just checked today and I have not started to dilate.  I am effacing (didn't say how much).  My husband's job was jerky about him taking (unpaid!) time off to be at home with the baby and I for bonding and taking care of us.  They made him give 2w notice and he had to put the due date as the first day off.  SO, whether I have the baby or not on Monday, he'll be here with me...Tuesday, Wednesday ETC.  Last week my doctor and I talked about if I went a week late he would induce me...well today I asked if he would be agreeable to doing it before a whole week was up and he said, yes because the baby was full term and I would be past my due date on Monday.  SO he started to tell me that he would admit me on Tuesday night, give me some cervadil (I think that was the name) to dilate me and then check me in the morning on Wednesday...he said it may or may not work!  If it didn't work, he'd try a few other things and there was still a chance that those may not work and he'd send me home till Monday and then if Monday came he'd try to induce me all over again.  He also said that there was an increased risk that I'd end up needing a c-section with the induction medications.  This scared me as well as the thought that these medications *might* not work!?  He told me it was easier to schedule me for an induction and have me cancel it than to call back later tonight or tomorrow and then ask to be scheduled...he said he had a lot of April Mom's who were near or past their due dates.DH is asleep...I have no one to talk about this to...I'm nervous/scared...I hope I am making the right decision...I know ultimately it is ideal to let the baby come on their own but I feel so torn about the whole work situation with my husband.I'm going to see if my MIL will take me for a walk...I thought I was starting to have contractions maybe last night but I guess not...my lower back was having crampiness so I thought that maybe something was happening =(The doctor did say, not to give up hope because he could come on his due date...what happens today doesn't mean anything for what might happen tomorrow or the next day etc.Any advice or encouragement?!",
    "timestamp": "1239917306",
    "title": "Scared of Induction...Need advice...",
    "user_id": "user_435139",
    "user_link": "/personal_pages/user/435139"
}