{
    "answers": [
        {
            "answer": "Well I guess you would say lesson learnt!If your trying to get pregnant from which I say you have beenI dont think popping pills and drinking is the way to goHmmmmmmmm",
            "post_id": "1135243",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "i too had a m/c in sept at 4-5 week.....i am testing in 2 days and am probably PG too. i have been drinking coffee, and had some wine.....it WON\"T hurt you!!!! the baby isn't even tapped into your blood stream yet....it has yoke and the pool of blood it made from implanting. try to relax and call your doc on monday.....i have been on progesterone to sustain this PG if i am. you have not harmed you baby in any way. when i found out i was PG with my son....the night before i was doing shots, had no clue i was pG cuz on bc pills. i had a healthy 9 lbs baby boy. now that you know you are PG, don't drink any more and call the doc so they can moniter you. CONGRATS!!!! you and your baby are okay....many woman don't know they are PG and party and what not and have healthy babies. and your doc should have know you are most fertile after a m/c ....especially if it was as early as yours and mine....it won't even effect your cycle. i 'o'ed 7 days after i m/ced.love....kimmie",
            "post_id": "1135245",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "I posted to get some support, rather than to be judged.  I have not touched anything for almost 4 months.  AND I MEAN NOTHING.  I am a child psychologist who works with abused and neglected kids, so i am very very concerned about the well being of children.  I have been having a rough time lately and I thought that there was no way I could be pregnant or I would not have touched anything.  In addition, I used a condom because I was going to wait a couple months before trying again.  I would do absolutely anything to ensure the well being of my child and I am really disappointed that I go to a place like this to get some support and I get a response that suggests I am a irresponsible person, which I am not.  I have had two miscarriages in three months.  I have endured pretty bad cramps for the last week.  I even called the doctor to confirm my belief that it was almost impossible to be pregnant, WHO AGREED!  I must say I am very hurt and disappointed by your response.  I just wanted a break from the emotional and physical pain for one weekend.  I hope the next time you make a mistake someone is more empathetic and understanding with you.  I am in crisis and very very upset.  You should be ashamed of yourself",
            "post_id": "1135246",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "Thank you Kimmee.  I appreciate the reassurance.  I am struggling right now.  Of course I would never do anything now that I know I am pregnant.  It means to much to me.  Thanks again.   -TINA",
            "post_id": "1135247",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "i know how stressful TTCing can be. my doc said that it is best to not give up everything while TTCing cuz it can take at least 3-6 mos to conceive. if TTCing causes too much stress and is too obsessive it can keep you from conceiving. so he suggested that i be sensible and use moderation. if i want to have a drink with DH at a romantic dinner i should, if i have a headache...take something. i understand how worried you are especially after your losses....i am so sorry you had to go through that....what you took was no prob at this stage. when you took these things the baby had not implanted yet so no harm done. many woman don't think they are PG and take advil and have a beer or 2 to later find out they were and have healthy kids. i am sure you are more concerned with repeating another m/c....i know i have worried about that as well. i have a luteal phase defect and had to be on progesterone to sustain my PGs from now on. it has worked so far and AF is no where to be found....i test tomorrow. call your doctor tomorrow morning, under the circumstances i am sure she will fit you right in and take good care of you. good luck and try not to worry. CONGRATS and i am praying for a happy healthy 9 mos for you!!!love....kimmie",
            "post_id": "1135250",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "Listen to Kimmie, and quit beating yourself up over this. The fetus is still in a cellular stage right now, and no harm has been done. Call your dr. on Monday, and I'm sure she will tell you the same thing. I have experienced two losses this past year, and completely understand why your worried. Try to relax (I know-easier said than done) and call your dr. first thing in the morning.",
            "post_id": "1135256",
            "timestamp": "1128834000",
            "user_id": "user_93654",
            "user_link": "/personal_pages/user/93654",
            "votes": "0"
        },
        {
            "answer": "First offYou said you have not touched anything in 4 months!Well you just said you did  Fri  when you Popped advil and went drinkingI think before you GO ON you should send all the facts firstNEVER once did you mention a condom!And from what you posted it sounds like you want to become pregnant!!Foolish behaviour if thats what your intentions areNOT ONCE did i call your irresponsible so YOU must think that of yourself.",
            "post_id": "1135257",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "I wouldn't worry about it. As the other girls said that your baby is not drawing blood from you yet. I would call your doctor and get a blood test done, so you are absolutely sure you are pregnant, though I am sure you are. Then I would talk to the doctor about helping to prevent another mc. I hope that you will not stress over what you did, because I am sure if you thought there was any possiblity you were pregnant you would not have done those things.Mandi",
            "post_id": "1135259",
            "timestamp": "1128834000",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "I also know how it is to experience a m/cBut going out and drinking and taking pills ISNT the answerIm wondering if this post is for realWHY WOULD anyone if they just had a m/c and were trying againtake pills, drink, exercise \"REALLY HARD\" when they should be trying to let their body \"heal\"",
            "post_id": "1135260",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "Tina, I understand your concern...however, as kimmie has stated, everything should be alright if you are pregnant. I had been ttc for over 6 months (since my husband returned from Iraq) and didn't think I was ever going to get pregnant.  We had our wedding reception after two years of being married and trust me, I drank a few beers...more than a few.  I don't normally drink much at all but, I had a good time that night and the following week I found out I was pregnant.I too have had a miscarriage in the past and it sucks. I am now 8 weeks pregnant and afraid this one is not going to last either.  Two ultrasounds already show all is ok but having some brown spotting off and on so, not sure what to think.  Been prescribed progesterone suppositories so only time will tell.For those of you out there who have been on progesterone.....what do you think?  Has it helped?  Have you had any side effects?  Just curious more than anything.Wishing you the best, Tina.....hang in there.....",
            "post_id": "1135261",
            "timestamp": "1128834000",
            "user_id": "user_105328",
            "user_link": "/personal_pages/user/105328",
            "votes": "0"
        },
        {
            "answer": "I whole heartdly apoligize if this post is for realand you HONESTLY didnt know you were pregnantBUt from the way I read your post it sounds like your putting emphasis on how MUCH you were drinking, HOW HARD you exercisedpurposely to get a rise out of someone.AND it worked!I think there are WAY too many women who dont think ahead YES there are mistakes made when you DONT know your pregnantWHen you know OR know your TRYING thats the time to think of the baby and not yourself(MY OPINION ONLY NOT PERTAINING TO ANYONE)",
            "post_id": "1135264",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "she wasn't popping drugs...advil for what she thought was menstral cramps at her docs suggesting. also having a couple drinks is not going to hurt her or the baby at this point....and she didn't think she could be PG cuz her doc told her it was impossible. she trusted her doc and then found out it wasn't true and got scared. her doc misinformed her of the possiblity of getting PG....my doc said it was unlikely too...i 'o'ed 7 days later. she trusted her doc and a couple of advil and margaritas before implantation is not going to hurt her. many woman get PG by accident and were taking pain meds and having alcoholic bevi's before knowing and had healthy babies....i was one of them. i got PG at 21 on the pill and had no idea i was PG till my AF didn't show after stopping the pill. i had been partying like a lot of 21 yr olds. i had a very healthy son and a great PG. she was scared and paniced and so maybe didn't give every single detail....she was looking for some reassurance is all.love....kimmie",
            "post_id": "1135268",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "i am on progesterone for luteal phase defect and to sustain a PG for 12 weeks. the only side effects i have had is my boobs are huge and i got emotional the first 3 days. it has worked and has kept AF away for 8 days now and legthened my luteal phase so that i am now 13 DPO and have no sign of AF. i love progesterone:)love....kimmie",
            "post_id": "1135270",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "TinaC has been posting on other threads lately. I remember reading about her m/c, so I think this is a legitimate question.",
            "post_id": "1135271",
            "timestamp": "1128834000",
            "user_id": "user_93654",
            "user_link": "/personal_pages/user/93654",
            "votes": "0"
        },
        {
            "answer": "Thanks for the feedback.  Must explain why I have been so emotional the last few days....lol...poor husband.Just hoping that this pregnancy lasts....fingers crossed.Best of luck to you as well",
            "post_id": "1135273",
            "timestamp": "1128834000",
            "user_id": "user_105328",
            "user_link": "/personal_pages/user/105328",
            "votes": "0"
        },
        {
            "answer": "THIS IS NOT A JOKE and you should never make the assumption that it is or you take the risk of really hurting someone and you did.  I had ABSOLUTELY no idea I was pregnant and I did not know I had to include every single detail to gain support on here.  I appreciate your apology, but if you look at my other posts (one just a couple days ago), you will clearly see that this is very real and a very sensitive subject to me.  I have had two miscarriages and both very very recently. Your post did appear to hit at me being irresponsible and I think others would agree.  I just dont need any of this right now.  I need some support.Thank you so much girls for responding.  Besides the one post, you did help me to take a deep breath and have some hope. I am going to call the doctor first thing tomorrow.  I am really having a rough time emotionally these days as you can imagine and I have had to work with a bunch of children who have been sexually abused this past week, so I was already wiped out.  I have to get myself in a positive mindset, I guess I am still in shock right now.  Thanks Again, TINA",
            "post_id": "1135274",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "Hang in there.. Only time will tell.  The people being insensitive obviously don't have a clue.......I understand your concern and am right there with you.  Still hoping my pregnancy is going to be successful.  It really sucks wondering everytime you go to the bathroom what you might find.Sending you a hug...",
            "post_id": "1135275",
            "timestamp": "1128834000",
            "user_id": "user_105328",
            "user_link": "/personal_pages/user/105328",
            "votes": "0"
        },
        {
            "answer": "i was afraid the prometrium wouldn't work either....the first few days on it i thought for sure i was going to go into the bathroom and see AF. i have been on it now 14 days and NO sign of bleeding and AF was due 7 days ago :) now that it has been 2 weeks and nothing i am starting to relax. keep the faith and hang in there. the worrying starts to subside with time. CONGRATS and i am wishing you a happy healthy 9 mos:)love....kimmie",
            "post_id": "1135277",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "I do have a clue!! I DID have a m/c!! Thank you very much!!Also I know advil isnt a drug (like a street drug)LIKE i said if you didnt know that is one thing!But if your trying why would you even chance itI had a wisdom tooth extracted while pregnant and I REFUSED to take any pain medication!ANyways like I said if it a mistake thats one thing and i do apoligize",
            "post_id": "1135279",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "As I am new to this forum...what is PAM?",
            "post_id": "1135280",
            "timestamp": "1128834000",
            "user_id": "user_105328",
            "user_link": "/personal_pages/user/105328",
            "votes": "0"
        },
        {
            "answer": "Now thats just being silly to not post anymoreWe all have our opinions and lIke i had said it was posted with not all the information  so you are going to get reactions some good some bad",
            "post_id": "1135281",
            "timestamp": "1128834000",
            "user_id": "user_66141",
            "user_link": "/personal_pages/user/66141",
            "votes": "0"
        },
        {
            "answer": "what is PAM? i also am a member of APA and snugglepie.com which are great supportive groups. everyone there is wonderful and very supportive. i also have my own yahoo group for TTC, PG, m/c, parents...single or couples, and children with special needs. http://health.groups.yahoo.com/group/coons_ttc_group/ feel free to come and join us if you like. ty for your sticky vibes....i should be testing soon and would love to swapt all the PG fun with you....hope i get a BFP too!!!love....kimmie",
            "post_id": "1135282",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "Actually, they do not know when alcohol is safe and when it isn't at any point during a pregnancy whether it is 4 weeks or 8 months.  That is why Fetal Alcohol Syndrome is incurable and unpreventable.  Because of this, this is why doctors suggest that while trying to conceive that you behave as if you are pregnant.  Some people who drink and smoke can have healthy children, but that is a fluke, not the norm.",
            "post_id": "1135286",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "i can understand....i too have been stressed out at work....i am a nurse and work with the profoundly MR. my m/c was a little over 3 weeks ago and if i had not insisted that my doc give me my prometrium right away cuz i KNEW i would 'o' and didn't want to go through another m/c i would not be where i am today. my doc said i wouldn't 'o' that soon and i did 7 days later. i went to see him on last monday and he appologized for not trusting mY instincts and was glad that i was on the progesterone cuz he said that i might be PG again so soon and it will prevent a repeat of last month. doc are ppl too and sometimes they don't always realize that what is normal for most woman might not be normal for all woman. it takes a few cycles or most woman to get back to normal....i have always been the exception to every rule...i assumed and was correct that i would be on this one too...LOL. take a nice warm bath, pamper yourself, nap if you can....relax and call you doc tomorrow. i am sure she will be most helpful and take good care of you and your baby.love....kimmie",
            "post_id": "1135276",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "I have calmed down a bit now and would respectfully ask that you do not post anything else to me, as you are making this worse.  I am sorry you misunderstood my post, but as another individual said (and was correct), I just starting typing frantically only moments after I got the positive test.I was exercising hard because I have bad cramps and the doctor said it would help.  Also, I have gained 10 pds in the last two months and I was trying to get it off before next month when we were going to start trying again.  I have always exercised (swim laps= four to five days a week), I am just working out harder now to loose weight.  But again, I did not think I had to explain every single detail to get some support and there is only  so many lines you can type before you get cut off.CINN=If you continue to be insensitive I am going to completely stop posting on this sight period, which would really be unfortunate.I am also praying for you guys who think you are preg. now, or those who are pregant.  I hope to exchange continued morning sickness and baby stories in the future.  Girls, go to PAM sometime.  I have several friends there and they are a great gropu of gals who are just the best.  Sending very sticky baby dust to all of you.",
            "post_id": "1135278",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "PAM stand for Pregnancy after miscarrage.  ***@****.  I really suggest going there. These women are the best.CINN:  Again, I nicely asked you to stop posting to me and it was ignored and you are continuing to upset me and I think others as well.  I sorry that your dont seem to understand that I would stop posting here if you didnt stop.  You obviously dont seem to get how upsetting your posts are to me if you would call it silly.  To me it is far from silly.  Just please stop. I am asking you as nicely as I know how and would appreciate your cooperation.  I didnt write for varying opinions on what I did wrong.  I wrote so that I could get some support and I think everyone clearly understands that except for you.  Please respect the fact that I am struggling right now and dont need this.  Please just stop.",
            "post_id": "1135283",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "Maybe you are not pregnant.  While false positives are rare, they do happen.",
            "post_id": "1135287",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "First, I don't think that it is up to you who gets to respond to your message and who doesn't.  It is almost arrogant of you.Second, I don't think people should have to support drinking while trying to get pregnant if they don't agree with you.  It is a free country.  If you weren't willing to hear everyone's opinion, an open forum might not be the most effective venue for you.  Threatening to quit posting is also a negative reaction to a differing opinion.  Again, an open forum might not be the best place for you.Third, if you drank to calm yourself after a rough week, how do you plan to do so when you are pregnant?  That is not a judgment question, just a curious one.",
            "post_id": "1135288",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "sounds like a great group and i will check it out. for a long time i didn't post in here cuz i felt unwelcome. there has been alot of helpful info on this site....but i have had to just 'ignor' posts if they upset me. I AM NOT POINTING FINGERS AT ANYONE OR ANYONE IN THIS THREAD....GENERAL STATEMENT. sometimes i have found that ppl who share a different veiw have been quick to judge or point out wrongs instead of looking at it from the other persons point of veiw...i just weed those posts out and look at the posts that are factual.some ppl believe if you are TTCing you should act as if you are PG...and that is very fine and awsome. for me i only act PG when i get a BFP. i don't drink alot or take alot of meds, but i do have drinks when i go to a nice dinner or with friends in moderation and my doc says this is perfectly acceptable and NOT harmful in any way. the most important thing for you to do is not stress out. you did NOTHING wrong and your baby will not be effected by any of this....it hadn't even implanted yet. and even if it had it isn't tapped into your blood stream and as long as you have been excersizing all along...docs say that you can continue to do so even if PG. it is new regimes after PG is confirmed that may or may not cause probs.feel free to contact me at anytime and keep me posted as to what your doc says....happy health 9 mos to you girl!!!love....kimmie",
            "post_id": "1135289",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "Im sorry your going though this and it's sad that some people have to be so rude!I just had a m/c at 6 weeks and after I had a neg pregnancy test and started what I thought was a period the next day I had 2 beers and a wine coolor one night and another night I had one beer. I really dont ever drink and I have 2 young kids (one thats nursing) so I have to wait until their in bed for the night to ever have even 1 drink but still if I would have even thought I was pregnant I would not have had anything to drink. Of course you'll always fine something to blame it on though. If I were you I would go see my doctor and have your hcg level checked. Good luck I hope all is well!",
            "post_id": "1135296",
            "timestamp": "1128834000",
            "user_id": "user_103040",
            "user_link": "/personal_pages/user/103040",
            "votes": "0"
        },
        {
            "answer": "http://www.marchofdimes.com/professionals/681_1170.asp",
            "post_id": "1135299",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "I am sorry about your miscarriage.  No one should have to go through that.  I am concerned that you are drinking alcohol while nursing though.",
            "post_id": "1135300",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "Hmmmmmmmm......I am pretty sure you can post whatever you want here. Sometimes the truth hurts!!! I agree with you Cinn. as you know I had 2 MC and then a succesful birth. I, like you, would never think of doing anything that may harm my future pregnancy. Some people just dont think, and then they want support. I understand how hard it is to support someone when you dont support their acts. Thank god we are a free country and can say ANYTHING!!!!!!",
            "post_id": "1135306",
            "timestamp": "1128834000",
            "user_id": "user_77578",
            "user_link": "/personal_pages/user/77578",
            "votes": "0"
        },
        {
            "answer": "And yes you can drink while nursing... You can NOT drink 3 drinks and go feed your baby NO. But you can have a few drinks and wait 5 hours to nurse your baby. I have talked to my doctor about this. It'a 100% fine to have 1-3 beers and wait 3+ hours to nurse your baby. It's not even in your system anymore and only a tiny bit was even in the breast milk in the first place. My drinking 4 drinks in the past 5 months should not be of any worry to you....",
            "post_id": "1135307",
            "timestamp": "1128834000",
            "user_id": "user_103040",
            "user_link": "/personal_pages/user/103040",
            "votes": "0"
        },
        {
            "answer": "My doctor also said that having one drink per week was no big deal while TTC.  She said it could even help when your anxious about it.  I work with a lot of FAS kids and have done tons of interview with parents.  None have ever said that they just had a couple drinks while TTC.  They were all alcoholics and drank consistently throughout the pregnancy.  It is extremely rare to get FAS without ongoing binge drinking throughout the pregnancy.  I even presented a paper on it in grad school.I think her point was trying to get me to calm down and I have.  Even though the doctor said one drink per week was okay, I didnt until this weekend because I wasnt TTC and thought i was in the clear this month.  I just get super freaked out and my brain doesnt quite work right when I am under extreme stress.  I think I have collected myself.  I am going to retest.",
            "post_id": "1135292",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "i have clients with fetal alcohol syndrom and have studied its effect greatly. it is correct that they don't know to what extent alcohol effect PG. but the facts have shown that 3 or more drinks through out PG seems to gaurentee FAS and FAE. most doc DO NOT tell a woman to NOT consume alcohol while TTCing. they suggest to use common sense and have only a couple of drinks if you are going to. the 1st 2 weeks of PG you haven't even 'o'ed yet and so there is no reason to not or to have a glass of wine or a beer if you want to. after 'o' it takes 6-10 days to implant...so during that time the baby has not even attached. after that period of time when implant would be likely to occur it is wise to stay away from alcohol if you are TTCing just cuz it makes sense...i do agree. i am saying that for those woman who had no clue they could be PG and had a couple of drinks before a BFP should not upset themselves because it HAS been proven that the implanted egg is not attatched to maternal blood stream. it is nourished by the inner nutrients in the egg itself, the yoke sac, and exchanges O2 from the pool of blood that is formed during implant.i am not trying to sound rude or anything pls don't feel i am. i have a degree in biology and specialize in genetics and congenital defects...including FAS and FAE. and have studied to great lengths all the things that can go wrong in early PG. most woman who take care of themselves and stop possible detrimental behavior after a BFP will give birth to healthy babies.love....kimmie....hope this not AF and an implant bleed...heres to a BFP!!!!",
            "post_id": "1135294",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "I have been thinking about it and you are right, people are entitled to their opinions, so I am going to bow out as I do not feel very welcome or supported by some of you at all.  If you have not been reading my posts or ignoring certain parts of them, maybe I again need to say that I was not trying to get pregnant.  I was supposed to take a month off and tried to, but it didnt work out that way, but for some reason that keeps getting ignored.  I suppose one of the condoms broke, which isnt that uncommon and even then I took precautions until I was told by my DOCTOR that I wasnt.If I can make if for four months through two miscarriages and my dad almost dying a couple of weeks ago without drinking anything. I think I can handle the pregnancy fine, in fact I know I can.  As I said, I am a psychologist and know how to gain any assistance I need.  Drinking one weekend (which was a choice, not a need) makes me human.Anyway, Kimmee:  I truely appreciate your support and words of kindness.  I dont need combativenss right now, it is not good for me and I think you understand that so, I am going to stick with other supports that are truely helpful.  I wish there was some way I could get in touch with you.  If you get on PAM, you can sent private messages, which is nice.  Its a great and welcoming group of women who are truly there for support.  They make me smile and know all of what I have been through lately.I appreciate all the support and feel that some of you guys need to work on empathy, but then again, many say it is not a characteristic you can attain if you dont possess it already.",
            "post_id": "1135303",
            "timestamp": "1128834000",
            "user_id": "user_100808",
            "user_link": "/personal_pages/user/100808",
            "votes": "0"
        },
        {
            "answer": "when i was nursing DS i was told that if i had a drink to wait an hour per drink i had to nurse again. i would pump if i had a drink and give DS a bottle of stored breast milk. i was also told if i had a hard time with let down to have a beer to relax me....it wouldn't be in my current breast milk. i haven't BF in over 8 yrs....and have not done any research so don't know of the latest studies on that...and what they recommend now.i have seen the march of dimes site before....but studies are so much more intense and i use medical sites for my thesis' and most of my research comes from the Library of Congress and active studies by MD's and researchers in medical journals. i have found the info there to be more scientific with actual facts and figures. the places i get my research from are usually for students and other docs/researchers to compare trials and research patters. i do love the march of dimes site and what they stand for though and support them financially for all they do. it isn't a source that my team uses for a source of medical research is all.love.....kimmie",
            "post_id": "1135304",
            "timestamp": "1128834000",
            "user_id": "user_94511",
            "user_link": "/personal_pages/user/94511",
            "votes": "0"
        },
        {
            "answer": "I also agree with you about abstaining while trying to conceive.  I have Ankylosing Spondylitis which causes me a lot of pain in my back, hips, and elbows.  It will continue to spread throughout my joints and anything connected to them as it is incurable and systemic.  There are a lot of times where I want to take a pain pill to ease some of the pain I feel daily or steroids to increase the effectiveness of my Remicade, an infusion I get every 6 weeks.  While trying to conceive, I do neither.  That is my choice.  I am not saying I fault others for their choices while trying to conceive.  I just want to say that it is possible.",
            "post_id": "1135322",
            "timestamp": "1128834000",
            "user_id": "user_74988",
            "user_link": "/personal_pages/user/74988",
            "votes": "0"
        },
        {
            "answer": "And to clear things up I think drinking anything at all in pregnancy or taking anything (like a pain reliever) is not okay. I myself went though severe preeclampsia and preterm labor and would not take even a Tylenol even when I was feeling my worst. I hardly ever drink and I wouldn't have had anything to drink if I had any thought in my head that I was pregnant. I think it's just plan wrong.",
            "post_id": "1135323",
            "timestamp": "1128834000",
            "user_id": "user_103040",
            "user_link": "/personal_pages/user/103040",
            "votes": "0"
        }
    ],
    "post_id": "1059021",
    "question": "Okay, I really need you guys today. I have had two miscarriages over the summer (last one was on Sept 4 at 5 wks). I have had feelings all week like I am going to start, but I dont. To be on the safe side I took pregnancy tests on Sun. Wed. & Fri. (first response) and nothing. I even called the OB/GYN and explained the cramps, moodiness, breaking out, and no period after 33 days, and she also said that it was normal to feel this way because my body had not gotten back to a normal cycle and to give it some time to start AF.  She said it was highly unlikely that I was pg given I ovulated and had sex the last time about three weeks ago. After the call, I popped a bunch of Advil for the cramps and continued to take a lot of Advil since. I went out to dinner with my husband and had several drinks on Fri. I worked out really really hard yesturday and last night I went to a Mexican place (shellfish) and had a few margaritas. I have been drinking a lot of caffine in the last couple of days too. Basically all the things I cut out for so long because I thought there was no possilbe way I could be pregnant. WELL, this morning I got this really weird feeling and decided to take another hpt (I dont even no what possessed me) and got a very very very faint line pretty quickly. I am sitting here crying because I dont know what to think. If I had any clue this could happen.  I would not have done any of the things I have done lately.  It scares me that I have such a faint line this much later and petrified of having another miscarriage.  I feel so completely overwhelmed, scared, and guilt",
    "timestamp": "1128834000",
    "title": "SCARED TO DEATH>HELP",
    "user_id": "user_100808",
    "user_link": "/personal_pages/user/100808"
}