{
    "answers": [
        {
            "answer": "I'm so sorry. That's heart breaking",
            "post_id": "10190065",
            "timestamp": "1396613788",
            "user_id": "user_6686277",
            "user_link": "/personal_pages/user/6686277",
            "votes": "0"
        },
        {
            "answer": "What's the risk of keeping her?",
            "post_id": "10190075",
            "timestamp": "1396613969",
            "user_id": "user_6804782",
            "user_link": "/personal_pages/user/6804782",
            "votes": "0"
        },
        {
            "answer": "Im so sorry. Im 22 weeks as well and I couldn't imagine the pain. Is there any way you can keep the baby? Keep us updatedgod bless you and your family",
            "post_id": "10190084",
            "timestamp": "1396614163",
            "user_id": "user_7495588",
            "user_link": "/personal_pages/user/7495588",
            "votes": "0"
        },
        {
            "answer": "Im so sorry. Im 22 weeks as well and I couldn't imagine the pain. Is there any way you can keep the baby? Keep us updatedgod bless you and your family",
            "post_id": "10190086",
            "timestamp": "1396614187",
            "user_id": "user_7495588",
            "user_link": "/personal_pages/user/7495588",
            "votes": "0"
        },
        {
            "answer": "She wouldnt be healthy like she is now ...she would suffer and i could as well. Its a high risk pregnancy. No promises that the clervage would even work due to my cervix being so short that the doctors couldnt even measure it or accidentally breaking my water bag since its trying to come thru my cervix.I could go into labor anytime and at 22 weeks she wouldnt survive.",
            "post_id": "10190094",
            "timestamp": "1396614325",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Im just so hurt and im a regular on this app and i enjoyed reading you ladies stories, sharing advice, sharing symptoms. I really had fun with u ladies. And im going to miss going thru the stages with the other expecting moms and first time moms. August moms ,any moms stay strong!",
            "post_id": "10190113",
            "timestamp": "1396614630",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I can't imagine getting that kind of news ...Please please please get a second opinion...have you seen a high risk doctor yet? 22 weeks is so close to viability, I know people who have had kids at 23 or 24 weeks, and while it was rough at first they are doing very well now, and living wonderful lives as a family. This is your baby, i",
            "post_id": "10190124",
            "timestamp": "1396614767",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "She could survive at 22 weeks though. It isn't impossible. Get a second opinion!!! Please!!! :( termination this far along in pregnancy just doesn't seem like a viable answer coming from a doctor. I understand your water could break at any time, but can't you be hospitalized and they monitor you very closely on bed rest? This is just so sad to me.. so hard to comprehend how a doctor finds it so easy to give up on their patient, especially when you've not only entrusted your life, but also the life of your child in their care.",
            "post_id": "10190125",
            "timestamp": "1396614781",
            "user_id": "user_7714453",
            "user_link": "/personal_pages/user/7714453",
            "votes": "0"
        },
        {
            "answer": "Uggh stupid phone posted before I was done. This is your baby, your child, you deserve to know all your options and not be rushed into such a drastic decision to end her life because of what might happen.  I really can't believe that's the only option your doc gave you.",
            "post_id": "10190150",
            "timestamp": "1396615362",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry you are going through this but I agree I would hold on as long as you can... I know many women who had babies on or around 23 weeks andiI won't lie some of them didn't survive but many did. If its a matter of definitely losing her and possibly losing her at some point I would take my chances!!! I'm sorry that's my opinion and I'm not trying to tell you what to do.",
            "post_id": "10190172",
            "timestamp": "1396615774",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "It doesnt seem right at all. Im not in any pain, shes not in pain. No bleeding, no early contractions.Im at a catholic hospital thats all about pro life. Ive talked to 4 doctors so far and they all say the same thing. There giving me all these numbers/satistics and im left with no hope. I just feel robbed. I dont want to let her go but how they're putting things is thats the best way for her. I have until monday and im just praying for a miracle.",
            "post_id": "10190184",
            "timestamp": "1396615969",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "If you don't feel like its right they can't make you terminate my dear. Are they saying its a risk to you? I'm so sorry about you going through this. I'm 22 weeks also so I can only imagine what its like. Sending prayers and love your way",
            "post_id": "10190213",
            "timestamp": "1396616488",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "I WILL PRAY FOR YOU. And the difference between man and God, is OUR FAITH. And I strongly believe that if you have faith in God and yourself as well, you can carry your miracle baby. Science and God are two completely different things.. and although science has statistics and facts to back it up, no one has ever been able to disprove God. I am so sorry you are going through this.. but miracles happen and that is what your daughter is. Pray pray pray, and ask for the guidance and direction to make the right choice for your child and you. And even if termination is what your end result is, at least know you did EVERYTHING possible as a mother.",
            "post_id": "10190235",
            "timestamp": "1396616746",
            "user_id": "user_7714453",
            "user_link": "/personal_pages/user/7714453",
            "votes": "0"
        },
        {
            "answer": "I was floored to read this...but I'm also shocked that they tell you the only answer is termination, especially at a Catholic Hospital. This is your choice and part of you knows that the right decision would be to wait and see. Demand strict bed rest before settling on what these doctors tell you are right....if she can make it to 24 weeks, 26, 28, or 30...if the only medical reason for you to terminate is a short cervix then the best solution would be to let gravity do the work....keep your hips elevated while laying in bed with only getting up to potty.I'm pro-choice all the way and it really is your choice, allbeit a difficult one, but with a fetus that has no other major medical reason to die, I just dont understand how they can tell you that.I wish you the best of luck and will pray for you and your family. My ♥ goes out to you.",
            "post_id": "10190238",
            "timestamp": "1396616787",
            "user_id": "user_8120486",
            "user_link": "/personal_pages/user/8120486",
            "votes": "0"
        },
        {
            "answer": "Has anyone talked to you about the option of perinatal hospice? Its like hospice care for older people, but for young babies who are not expected to live very long. Its focused on comfort measures for your baby, so she doesn't suffer and giving you and her as much time together as possible.  Most parents find it very healing because you still get to spend time with your child and treats both of you with respect and dignity in a heartbreaking situation. You can find more info about how it works, parent testimonials and find programs in your area at www. perinatal hospice .org.  My heart goes out to you Mama, I'm sending many prayers your way. I've done presentations on this for.healthcare students in various fields  classes, and have talke",
            "post_id": "10190254",
            "timestamp": "1396617076",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "I would try to get more information. At 24 weeks she might make it. At 28 she would survive. At 32 she would survive and thrive for sure. I would think strict bed rest until labor is unavoidable would be an option. I would hope termination wouldn't be a primary choice for any care provider. Have you tried a different hospital?",
            "post_id": "10190255",
            "timestamp": "1396617139",
            "user_id": "user_7889426",
            "user_link": "/personal_pages/user/7889426",
            "votes": "0"
        },
        {
            "answer": "I have heard so many stories where the second opinion changes everything. Please do not loose hope. Do you remember that story of baby who was born at 24 weeks and the father his taped his journey all the way up to his first birthday ? It is possible. BE STRONG.",
            "post_id": "10190263",
            "timestamp": "1396617306",
            "user_id": "user_8120713",
            "user_link": "/personal_pages/user/8120713",
            "votes": "0"
        },
        {
            "answer": "Sorry, my phone again....Perinatal Hospice is a fairly new healthcare trend, so many docs don't know about it. If you have any questions, feel free to messege me, if I can't answer them I can get you in contact with someone who can.",
            "post_id": "10190265",
            "timestamp": "1396617331",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "Please Do Not Give Up If  You Do Not Fill A Sense Of Peace Over That Decision! Follow Your Gut... I Started Testing Positive For Preterm Labor At 25 Weeks And They Put Me On  Bedrest, I'll Be 32 Weeks Tomorrow And Just Now Starting To Dilate So If You Did Get Put On Bedrest For Even A Few Weeks It Would Increase Her Chance Of Survival! I Also  Have A Cousin That Was Born At 24 Weeks And She Is Still Alive And Doing Well!!! Do NOT let Those Doctors Persuade You In A Direction You Are Not 100% Ok With... FOLLOW YOUR HEART AND YOUR GUT, Your Gut Is Always Right!!! Good Luck, Keep Us Updated, And I'll Be Praying For You Also!",
            "post_id": "10190339",
            "timestamp": "1396618374",
            "user_id": "user_6387609",
            "user_link": "/personal_pages/user/6387609",
            "votes": "0"
        },
        {
            "answer": "I can't understand this you only need to make it 2 more weeks and then she viable and has a good chance and survival. I don't see why they are saying this it seems so wrong. I'd get out go home and out myself on bed rest keeping everything crossed if I were you.",
            "post_id": "10190361",
            "timestamp": "1396618798",
            "user_id": "user_6832165",
            "user_link": "/personal_pages/user/6832165",
            "votes": "0"
        },
        {
            "answer": "Grr posted to fast! I really wish you the best have hope she's doing great so far you may have a little fighter in there :)",
            "post_id": "10190376",
            "timestamp": "1396618995",
            "user_id": "user_6832165",
            "user_link": "/personal_pages/user/6832165",
            "votes": "0"
        },
        {
            "answer": "Im so sorry you are going through this. Im sending prayers you're way for you and your baby",
            "post_id": "10190500",
            "timestamp": "1396621245",
            "user_id": "user_7552244",
            "user_link": "/personal_pages/user/7552244",
            "votes": "0"
        },
        {
            "answer": "Thank you all for your love and support. I really has made me smile during a time i thought i couldnt. Omg u ladies dont know how this makes me feel. The doctors told me i have an infection and that im starting to already dilated. Still no pain, no contractions, no bleeding. I will be gettinh discharged soon and heading home. I will take this time to research more ans ask for second opinions at a different hospital. In my gut, it feels so wrong. And i will regret this if i go through with this. I must exhaust all options and fight for my unborn baby girl. I am based in chicago, il if anyone of u ladies can refer me i would be so thankful. Once again thank you all for the encouragement. It means so much to me i cany even describe. You ladies have given me hope in a time where i felt there wasnt. God bless you all for your kindness!",
            "post_id": "10190525",
            "timestamp": "1396621700",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "To clear up things im 22 weeks. Usually they give cervages around 14-16 weeks. With me being at 22 weeks i am at high risks and with that comes more complications. At this time the emergency cervage has a more horrific outcome. The chances of breaking my water while stitching, letting more infection/bateria go into the vagina. The cervage could still break. My baby can suffer mentally and physically ('handicap'-i hope thats the right term to use, so sorry if i offended anyone). It can also cause great danger for my health as well. This is all what the doctors are telling me.",
            "post_id": "10190549",
            "timestamp": "1396622092",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "May I ask u something? First question do u guys have Kaiser Permanente out there?  Second question how did they find out about ur cervix being short? How did they check for that? Didnt even know they checked that early?",
            "post_id": "10190551",
            "timestamp": "1396622159",
            "user_id": "user_7365589",
            "user_link": "/personal_pages/user/7365589",
            "votes": "0"
        },
        {
            "answer": "I'm High Risk, I Went Into Preterm Labor With My Last 2 Pregnancies. Had My Daughter At 25 Weeks(She didn't Make It) But They Watched Me More Closely With My Son And This Time Around Too. They Can Give Steroid Shots To Help The Baby Develop More Quickly And Have A Better Chance Of Survival, Strict Bed Rest To Keep The Weight/Pressure Off The cerviX. Good luck",
            "post_id": "10190627",
            "timestamp": "1396623538",
            "user_id": "user_7778162",
            "user_link": "/personal_pages/user/7778162",
            "votes": "0"
        },
        {
            "answer": "Fight for your baby girl! Girls are fighters, more than boys! Ask for steroids to help develop her a little more. Please get a second opinion. My first pregnancy I found out that my baby girl was sick and that she wouldn't survive. Right then I decided it wasn't my decision to say it was her time to go. I decided to carry her for as long as I could. I did get a second opinion, with unfortunately the same answers. I developed pre eclampsia and had to deliver her at 28 weeks. She passed while in labor, but I know to this day that I did the right thing. I gave her a chance even though the outcome wasn't going to be positive.",
            "post_id": "10190711",
            "timestamp": "1396624753",
            "user_id": "user_7363921",
            "user_link": "/personal_pages/user/7363921",
            "votes": "0"
        },
        {
            "answer": "Your update made me tear up, you do sound like a fighter, you and and you your baby can fight this together. I just sent you a messege with a list of Chicago area resources that specialize in providing alternatives to termination in difficult cases...praying that you are able to find some support from one of them! Keep us updated, you're not alone!",
            "post_id": "10190815",
            "timestamp": "1396626298",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "Ladies, all of you have been a grear support system i wish i can give you all hugs. Yesterday i was discharged and went home and just slept. My mom stayed up all night researching and getting other opinions. I talked to my original doctor and she told me to please get the cerclage (stitch of the uterus). She had plenty of 20+ week women who got the stitch and was able to have a normal pregnancy. We had a great convo and that gave me more hope. I am back at the hospital today just admitted, had another ultrasound (baby looks like she is riding a bike lol she so active) another vaginal screen everything still the same. I will be having the cerclage if everything remains the same! Im feeling more confident! Im feeling great, still no pain, contractions, bleeding NOTHING. thank you for all the prayers and advice I APPRECIATE EVERY LAST ONE OF YOU!!!!!! Stay blessed!!!!",
            "post_id": "10196502",
            "timestamp": "1396736377",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Hello, im not sure what K.P is? And they caught the cervix issue on Monday. Now i had a ultrasound at 12 weeks 5 days and what they told me was i was to early for a internal u/s whixh from what im hearing they could of saw it then and i would of had the cerclage at 14 weeks which is normal versus 22 weeks.",
            "post_id": "10196512",
            "timestamp": "1396736581",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I have incompetent cervix also they caught it at 17 weeks its hard to catch and most have a miscarriage. Jus know that you will always need a cerclage for any pregnancy.  I personally wouldnt terminate though it is likely you wont make it to full term it is rare but you could possible have her and chances are slim but miracles do happen. It is heartbreaking I read your previous posts and was hoping for good news for you. I would contact another dr they could possibly do a cerclage. My dr was very good I was very lucky tho im now 26 weeks so far everything is good they told me without the cerclage I would've  lost him at 20 weeks. So sorry to hear and hope a miracle comes your way.",
            "post_id": "10196546",
            "timestamp": "1396737073",
            "user_id": "user_6835698",
            "user_link": "/personal_pages/user/6835698",
            "votes": "0"
        },
        {
            "answer": "I hope everything works out well for you momma! I will keep saying prayers for you!!!",
            "post_id": "10196555",
            "timestamp": "1396737213",
            "user_id": "user_7552244",
            "user_link": "/personal_pages/user/7552244",
            "votes": "0"
        },
        {
            "answer": "It looks like my water bag is rupture/leaking so there running more tests but whatever happens im going to wait it out.",
            "post_id": "10196730",
            "timestamp": "1396740504",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I'm so glad you found some support from us. I've been checking every few hours to see a post from you... I have and will continue praying for you and your little bubs.",
            "post_id": "10196868",
            "timestamp": "1396743024",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "Hun I'm so sorry to hear about all this. Please do look for every possible option. Keep us updated please. I'm praying for you and your baby.",
            "post_id": "10196979",
            "timestamp": "1396745148",
            "user_id": "user_6629746",
            "user_link": "/personal_pages/user/6629746",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies, i am on complete hospital bedrest. I can only lay on my back or sides and the bed is tilted to where my feet are higher and my head is lower to keep my baby off the cervix. This is called the waiting game but i am confident that i can keep her in for as long as possible! Once again i cannot express how supporting you all been on this forum. I can feel the love and prayers coming from each and every direction and i appreciate it so much! Im still not in any pain, cramping, bleeding. And i had another ultrasound and my baby is so active!!!! Shes having fun in there! As long as she is okay and riding her bicycle (her feet were moving like she was peddaling a bike lol), im good!! Take care ladies and thanks again FOR EVERYTHING!",
            "post_id": "10197352",
            "timestamp": "1396752389",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I've been following your post and am sending prayers your way. I am so glad you didn't terminate",
            "post_id": "10197383",
            "timestamp": "1396753126",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "I'm praying now!!!! God is bigger than all this he can mend ur water bag!!! In the name of Jesus this baby will make it! I REFUSE to believe different!!!! My heart is there with u sweetie! Much love!!♥♥",
            "post_id": "10197396",
            "timestamp": "1396753309",
            "user_id": "user_7698659",
            "user_link": "/personal_pages/user/7698659",
            "votes": "0"
        },
        {
            "answer": "Praying everything works out good for you and your little girl!!",
            "post_id": "10197423",
            "timestamp": "1396753916",
            "user_id": "user_7416816",
            "user_link": "/personal_pages/user/7416816",
            "votes": "0"
        },
        {
            "answer": "Prayer goes out to you and your baby girl have faith girl.",
            "post_id": "10197433",
            "timestamp": "1396754189",
            "user_id": "user_7494125",
            "user_link": "/personal_pages/user/7494125",
            "votes": "0"
        },
        {
            "answer": "My heart breaks reading what you are going through. Im praying for you and your baby girl! Please keep us posted. If god hears all our prayers he will help you and your baby! Im certain.I'll keep checking for updates.. hoping, praying and wishing for good news.Sending lots of love and prayers to you and your family",
            "post_id": "10197438",
            "timestamp": "1396754441",
            "user_id": "user_2062826",
            "user_link": "/personal_pages/user/2062826",
            "votes": "0"
        },
        {
            "answer": "Good luck sweetie! I hope your baby girl stays in as long as possible. I will be keeping you both in my thoughts",
            "post_id": "10197442",
            "timestamp": "1396754479",
            "user_id": "user_7226538",
            "user_link": "/personal_pages/user/7226538",
            "votes": "0"
        },
        {
            "answer": "Wow!  First time seeing this post!  Hang in there momma! And please keep us updated♡ you'll be in my thoughts, and your baby girl. Stay positive, that's the most important thing you can do.",
            "post_id": "10197497",
            "timestamp": "1396755461",
            "user_id": "user_7458937",
            "user_link": "/personal_pages/user/7458937",
            "votes": "0"
        },
        {
            "answer": "I'm also praying for you as well and will put you on our prayer list at church. This is my first pregnancy as well. I am high risk for past heart problems, glaucoma and asthma. We are having a boy. I can't imagine what you are going through. I do know that God is right beside you holding your hand and will not leave you. Please keep us informed. I had birth defects and drs did not expect me to live past 2yrs old. I will be 30 before our lil man is born. God has a reason for everything and now it seems as if he wants your little girl to have a fighting chance.Laura",
            "post_id": "10197574",
            "timestamp": "1396756926",
            "user_id": "user_7692433",
            "user_link": "/personal_pages/user/7692433",
            "votes": "0"
        },
        {
            "answer": "Keep on fighting! Sending you love & light♥♥♥",
            "post_id": "10197771",
            "timestamp": "1396760253",
            "user_id": "user_7736470",
            "user_link": "/personal_pages/user/7736470",
            "votes": "0"
        },
        {
            "answer": "I just now found out that im 4cm dilated. Wow...even my nurse didnt know until the resident doc called in and told her. My baby is just a pound and one ounce. So it doesnt take a full dilation (if thats a word) fof her to come out.However the heartbeat is great still no pain, no contractions, not a bunch of leakage and no bleeding. I am still in high hopes for my baby Miamor. She is my love and i wont let her go!!!!!! Ladies again Thank u for all the love and prayers!!!!!! I feel them all pouring down on-us. You ladies give me strength!!!! THANK YOU!",
            "post_id": "10197797",
            "timestamp": "1396760867",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I would get a second opinion. See if there is anything you can do. Some ppl have that and are still trying to hold onto their baby's",
            "post_id": "10197821",
            "timestamp": "1396761584",
            "user_id": "user_7631083",
            "user_link": "/personal_pages/user/7631083",
            "votes": "0"
        },
        {
            "answer": "Dear Lord, give peace to ladyedmonds, keep her uterus relaxed , and her precious baby strong and healthy! Wrap them both in Your loving  arms tonight! Been praying for you all night, and I know my friends have been too. Thanks for the update, hope you can get some rest <3",
            "post_id": "10197827",
            "timestamp": "1396761762",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "I am definitely praying for you! Keep that little girl in there, she's a fighter and so are you! Hang in there ♥",
            "post_id": "10197851",
            "timestamp": "1396762219",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "Hang in there momma!! Blessings and prayers of safety for you and your beautiful baby girl all the way from Des Moines Iowa.",
            "post_id": "10197891",
            "timestamp": "1396763150",
            "user_id": "user_7935940",
            "user_link": "/personal_pages/user/7935940",
            "votes": "0"
        },
        {
            "answer": "I would get a second opinion and ask if bed rest will help with this \"problem\"",
            "post_id": "10197923",
            "timestamp": "1396764041",
            "user_id": "user_7881015",
            "user_link": "/personal_pages/user/7881015",
            "votes": "0"
        },
        {
            "answer": "Thank you all again!!!! Im located in Chicago, Il so its 1:15 AM . I am going to try to go to sleep and hopefully later ill have some great news and i can find this thread and update you beautiful supporting ladies! Thank you all for the prayers and kind words and advice. I cant stop thanking you all!!!! Goodnight or good morning where ever you loving ladies are!",
            "post_id": "10197943",
            "timestamp": "1396764586",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I just read all of this to my fiancé, as we have to go see a specialist about my cervix on May 6th.. my OB saw me at 10w5d & said she thought MAYBE my cervix was a little on the short/small side, so she'd rather let a specialist take a look at it.I'm already a mess, worried, so I can't imagine what you're going through - you are in our thoughts & prayers, and we have strong faith in God that He will allow you to hold that baby girl in long enough for her to be born healthy & happy!!!! we claim it, you can claim it, and believe in HIM!!! God bless you & your family!!! ((((: ❤",
            "post_id": "10197949",
            "timestamp": "1396764801",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "I'll definately be praying for you :) may god be with you & your little one & hear all of our prayers tnite ♥ ++++",
            "post_id": "10197951",
            "timestamp": "1396764975",
            "user_id": "user_6498478",
            "user_link": "/personal_pages/user/6498478",
            "votes": "0"
        },
        {
            "answer": "Good morning ladies. Its 6:40 am so far the doctor checked for leakage, any cramping, pain...i dont have any of the above. She withdrew blood and thats pretty much it. Yes i didnt get too much sleep , nothing is like the comfort of your own bed. =)Still praying for my love.",
            "post_id": "10198364",
            "timestamp": "1396784682",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Those are good signs, glad things seem to be looking up :)Sending positive vibes your way xx",
            "post_id": "10198369",
            "timestamp": "1396784873",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "♡ sending lots of love and prayers!",
            "post_id": "10198432",
            "timestamp": "1396787348",
            "user_id": "user_2062826",
            "user_link": "/personal_pages/user/2062826",
            "votes": "0"
        },
        {
            "answer": "Hi there, I think this post just became one of the most followed in this forum.  I just read all you've been going through. I must say you and your baby girl are being a big inspiration to all of us. In the end it's all about the journey,  and the fact that you chose to fight for your lovely girl, will make you proud of yourself for the rest of your life, , regardless of the outcome. We are still here though, praying for a happy ending:) Sending my thoughts and love all tge way from New Zealand.♡ (ps.In NZ it's already 7th of April...so if you're wondering if your girl will make to the future..well she already have:) Stay strong you two!)",
            "post_id": "10198437",
            "timestamp": "1396787548",
            "user_id": "user_6842958",
            "user_link": "/personal_pages/user/6842958",
            "votes": "0"
        },
        {
            "answer": "I am crying while reading your story! Hopefully at 22 weeks your baby girl has a chance at survival. Sending lots of love and hugs and well wishes from the UK. XXXXX",
            "post_id": "10198462",
            "timestamp": "1396788318",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "Thank you so much from all of your warm wishes. Ladies, this forum has kept me so positive. You all are so supportive that it brings tears to my eyes. The prayers are working in many ways. I pray for wellness to all of you and i hope to continue this journey with all of you. I would love to know more about each and every one of you. Thanks again for being such a great support system. <3",
            "post_id": "10198471",
            "timestamp": "1396788528",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "What i don't understand is that from what you said in jne of your earlier comments is that they told you at 12 weeks that it was too soon to do a vaginal ultra sound when that just isn't true. I got one at my first dr appointment at 10 weeks to make sure my baby was there and had a heartbeat. I'm glad to hear though that you and your little girl are doing good. I'm 33+5 with a healthy baby girl and I can't imagine going through what you are. I'm 19 and this is my first baby and I'm nervous about labor and whether I'll be a good mom. You said you wanted to know more about all of us so here's me. Before I got pregnant I was had enlisted in the Marines at 17, got both my parents to sign the release forms and was just waiting till graduation from high school to go to boot camp. Well 3 days before I was suppose to leave I got discharged because I told the truth about smoking weed once and the CO didn't want to sign the waiver. I was heartbroken, that was in July of 2013 my ship date was July 8th. In August I started the enlistment paperwork for the air force and was waiting to go get medically checked so I could leave for basic. Over labor day weekend I got pregnant and found out a week before my 19th birthday in September. I was so scared cuz her father and I hadn't even really been together very long and I had been on birth control. Now i can't imagine my life any other way. No her father and I aren't together anymore and haven't been since October but he's still going to be a part of her life and we get along so there's no fighting. I can't wait to meet my baby girl Ciara Janise and hold her. I hope you and your husband get the same chance and that you guys get to have your amazing family together without sadness. Your baby girls a miracle and you both deserve to grow together. You've made it this far I have no doubt in my mind you and your baby girl will continue to fight through this and come out on top.",
            "post_id": "10198518",
            "timestamp": "1396790193",
            "user_id": "user_7143736",
            "user_link": "/personal_pages/user/7143736",
            "votes": "0"
        },
        {
            "answer": "Yeah thats what i was told by the ultrasound lady when i got my u/s back in January. I wish she had of done that. Me , being this is my first pregnancy i didnt know i can push for that. I love your story by the way. Wow i was so nervous about joining the army and i heard marines were very tough so i decided to just go to college lol. Thank you fod sharing your story.I just spoke with my doctors and as protocol he let me know what can happen if i deliver this week. He recommends vaginal because a c-section is more danger to my health. He did mention steroids but i am only 22 weeks and a few days however if i can make it to 23 i can get the steroids which will help with ths development of my baby. At 24 weeks he said he would changs his mind about doing a c-section i guess because i would be mors viable.I was looking at him and just taking everything like a champ and i had a smile on my face because i KNOW i can make it! I can do this and im determined to keep her inside to keep her alive! Thank you so much for the prayers, advice, sharing stories it keeps me sane and positive!!!!! I can do this !",
            "post_id": "10198807",
            "timestamp": "1396797585",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Amen sister u keep that positive spirit momma!! Ur one strong lady!! Still praying and sending love!!♥♥",
            "post_id": "10198895",
            "timestamp": "1396799534",
            "user_id": "user_7698659",
            "user_link": "/personal_pages/user/7698659",
            "votes": "0"
        },
        {
            "answer": "Ok here's my story this is my second pregnancy I am 12 weeks 2 days pregnant. I have a beautiful little boy named mitch he's 20 months, hell be 2 in august. I hadn't been with my babys daddy before finding out I was pregnant so he left when I was pregnant with my son and haven't heard from him since.This baby, my husband and I never prevented nor planned, we weren't married at the time I found out but soon after. I took a pregnancy test february 13th 2014 because I was 4 days late and I figured maybe it was stress. I had 5 positive pregnancy tests because I kept taking them because I was shocked. I had had 3 miscarriages last year and was starting to wonder if I would ever have a healthy pregnancy. I went to the doctor a week later and I was 6 weeks 5 days. Great heartbeat. I was so happy!I am now 12 weeks 2 days and I am on full bedrest due to being hit in the stomach by someone. It caused a placental bleed small but could be very bad if the placenta quits working. I had an ultrasound last Monday at 11 weeks 4 days at the er. Baby was great but was placed on bedrest due to the bleed. I am not bleeding vaginally but I'm worried cause tommorow I go to find out if my baby is alive. I am praying for you but in turn please pray for my baby who I hope is okay.I am still having morning sickness so much I have lost 9 lbs in a week but I hop my babys okay. Much love ladyedmunds.",
            "post_id": "10198900",
            "timestamp": "1396799776",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "You are doing a great job. I admire the fight in you keep holding on baby girl ive been praying for you we all have. God will never leave you or forsake you. Stay rested I love you hugs!",
            "post_id": "10199077",
            "timestamp": "1396805081",
            "user_id": "user_4503521",
            "user_link": "/personal_pages/user/4503521",
            "votes": "0"
        },
        {
            "answer": "I am sending prayers and love your way! Yes! You will see thru this! Its not easy but stay strong for your little one. What i realize is that they count so much on us. Its great to have doctors but WE are the ones they need. Stay strong you hear me and i want updates! I will pour my love and prayers all over you two. Please keep in contact , we can get thru this together. Stay blessed and bed rest is the best. Let your body heal and keep sending those prayers up! Blessings will come down!",
            "post_id": "10199093",
            "timestamp": "1396805357",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "How are you doing Lady? Still thinking about you and keeping track of this post!",
            "post_id": "10199104",
            "timestamp": "1396805707",
            "user_id": "user_7458937",
            "user_link": "/personal_pages/user/7458937",
            "votes": "0"
        },
        {
            "answer": "I'm so pleased you are fighting for your baby girl and being so strong, I really hope you hold her in as long as possible :)",
            "post_id": "10199172",
            "timestamp": "1396807700",
            "user_id": "user_6832165",
            "user_link": "/personal_pages/user/6832165",
            "votes": "0"
        },
        {
            "answer": "@ladyedmundsI will keep you updated I have an ultrasound tommorow to find out if the baby is okay. I appreciate your prayers!",
            "post_id": "10199187",
            "timestamp": "1396807963",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "Its absolutely amazing that you are able to fight for your girl!!! So glad the drs are helping you keep her alive and riding that bike!!!! Continued love and prayers :-)",
            "post_id": "10199388",
            "timestamp": "1396815057",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "Sending positive thoughts your way! So glad you are fighting for your baby girl! Never let doctors push you around, do what you feel is best for you and your little girl.I am 30+2 today with a healthy baby boy. My mother was on bed rest her whole pregnancy with me, so I have been blessed to have such a healthy pregnancy. I am trying to finish up my master's degree this semester, so i have been crazy busy and being pregnant has changed a lot of our plans. This pregnancy wasn't planned but my husband and I are thankful for it regardless, we have always wanted children. I will defend my thesis the first week in May and we are expecting our son June 13th. I will keep sending positive thoughts your way. You can do this! Keep us all updated. We are rooting for you!",
            "post_id": "10199457",
            "timestamp": "1396815990",
            "user_id": "user_7889426",
            "user_link": "/personal_pages/user/7889426",
            "votes": "0"
        },
        {
            "answer": "Hoping for the best. My grandma had my mom around the 23 week mark, my mom was 1 lb 15 oz and this was back in 1968. So please hang in there miracles are possible. Just keep your head up.",
            "post_id": "10199733",
            "timestamp": "1396819917",
            "user_id": "user_7459830",
            "user_link": "/personal_pages/user/7459830",
            "votes": "0"
        },
        {
            "answer": "Hi ladies, ive been knocked out pretty much all day. Only waking up to call the nurse to let her know i needed to use the washroom. I developed an infection but im taking meds/iv to help it. At this point you really start to appreciate and miss the simple things like walking, using the bathroom by yourself, laying any position you like....i can go on and on, but you know what , its for my love. I will sacrifice everything to make sure she's here and she's safe. I really think bed rest will help me. I have faith. One nurse told me i might miss all of summer and u know what i told her....there's summer somewhere all year round, i love california! Lol i dont care about-the warm weather lol as long as its warm inside my heart and my baby knows she has all the warmth she needs from me. I told her all about you ladies and how you all are with us everyday. Thank you again i cant thank u all enough!",
            "post_id": "10199945",
            "timestamp": "1396822643",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Thank u for the positive thoughts!!!!! And good for u and early congrats to u in getting that masters!!!!!!! Woohooooo!!!!!!!!!!!!! Yes! You will do just fine girl!!! U made it this far!!!!! Keep me posted on your progress!!!!!!! And dont let a piece of paper or a lecture stress u out! Stay positive. You got your cap and gown already!?!?!",
            "post_id": "10199964",
            "timestamp": "1396822851",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "yayyyyy! I just replied to your message, so glad to hear you were resting/knocked out lol!!as long as you're holding that baby girl in, you can smile every single day knowing she's just ONE DAY STRONGER!God bless you & your family.. I know HE is sitting in the room with you, taking care of you all! so happy to see things went well over night!! ((:",
            "post_id": "10200028",
            "timestamp": "1396824042",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "Going to college is definitely stressful without being pregnant. But when you put your mind to it you can do anything. My daughters the reason i started going to college in January. I finished my first term with a 4.0 going full-time and this term I'm taking three classes with a credit total of 11 which is one under full-time and am gonna try and get a 4.0 again. I'm not sure I'll be able to this term simply because my daughter is due three weeks before finals but thankfully I can work ahead in one of my classes cuz I already talked to the teacher and my math teacher said i can try and to get help if I don't understand something. Just waiting for my other teacher to get back from surgery to find out from her.",
            "post_id": "10200065",
            "timestamp": "1396824763",
            "user_id": "user_7143736",
            "user_link": "/personal_pages/user/7143736",
            "votes": "0"
        },
        {
            "answer": "Keeping you in our prayers! God performs miracles everyday...you keep your head high and stay hopeful mama!",
            "post_id": "10200449",
            "timestamp": "1396830632",
            "user_id": "user_7735271",
            "user_link": "/personal_pages/user/7735271",
            "votes": "0"
        },
        {
            "answer": "Lord you are our last hope.our lifes are in your hand Lord.we know nothing is impossible if we call faithly in your name.Lord all we ask from you now is your mercy on our fellow mom -to-b.satan is a looser in Jesus name.protect the gift that u have given to our fellow woman lord.we leave every thing in your hand with all the faith that u will change hrr situation.Ame.-;-------- don't worry dear u will be fine",
            "post_id": "10200563",
            "timestamp": "1396832005",
            "user_id": "user_7844892",
            "user_link": "/personal_pages/user/7844892",
            "votes": "0"
        },
        {
            "answer": "Hi ladies!!!! My battery is dying so im rushing!!! Everything was great today!! The food was sooo good to my tummy today! Lol but my mother-in-law and aunt came to visit and i just felt soo good! IM FEELING GREAT!!!!!",
            "post_id": "10201257",
            "timestamp": "1396842095",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "That's good to hear stay strong ^__^",
            "post_id": "10201358",
            "timestamp": "1396843457",
            "user_id": "user_2170635",
            "user_link": "/personal_pages/user/2170635",
            "votes": "0"
        },
        {
            "answer": "I LOVEEEEE how humble and positive you are staying through this trial. Prayers always for you, your family, and your sweet angel girl!",
            "post_id": "10201524",
            "timestamp": "1396846361",
            "user_id": "user_7714453",
            "user_link": "/personal_pages/user/7714453",
            "votes": "0"
        },
        {
            "answer": "You are amazing! So proud of your choices! You're an inspiration to us all!",
            "post_id": "10201584",
            "timestamp": "1396847460",
            "user_id": "user_2219123",
            "user_link": "/personal_pages/user/2219123",
            "votes": "0"
        },
        {
            "answer": "Your an amazing woman/mom!Your so strong your partner is so lucky to have someone like you. Keep it up mama. Cook that lil bun (: hehe. Wishes go to u!!!!",
            "post_id": "10201593",
            "timestamp": "1396847609",
            "user_id": "user_7114473",
            "user_link": "/personal_pages/user/7114473",
            "votes": "0"
        },
        {
            "answer": "Wow im just seeing this! I am so worried about you and your baby girl! When will you be 23 weeks? I have always heard little girls are more of fighters then little boys. I hope God will keep that baby in the belly for a few more weeks! I can not even begin to imagine what you are going through. :( I am pregnant, we have a 2 year old and we have had 6 miscarriages. I am having liver issues that at any point can kill our baby boy. I have been struggling with that but I can honestly say I do not even think that compares to the struggle you both are going through. I really hope she stays in there ATLEAST 2-4 more weeks. Preferably,  6 to 10. I really hope they can start the steroids soon and by the time she arrives, she will be ready to face the world. Much love goes out to you! I wish I lived close, I would drive to see you. I could bring you anything you were craving and give you some company.",
            "post_id": "10201619",
            "timestamp": "1396848188",
            "user_id": "user_7114061",
            "user_link": "/personal_pages/user/7114061",
            "votes": "0"
        },
        {
            "answer": "I've just read this whole chain! Praying for you and your beautiful baby! You are an incredibly strong, and beyond courageous woman! I admire your selflessness and sheer gratitude for the small (but truly huge) milestones you're hitting every hour that you continue to keep that baby safe and sound. :) I believe that God has a plan, and nothing good in life comes easy. I think this will be your miracle baby - hang tight girl, you're doing remarkable! God bless! :) :)",
            "post_id": "10201645",
            "timestamp": "1396848827",
            "user_id": "user_7625771",
            "user_link": "/personal_pages/user/7625771",
            "votes": "0"
        },
        {
            "answer": "Your a very strong woman keep fighting the good fight for your precious baby!",
            "post_id": "10201720",
            "timestamp": "1396850540",
            "user_id": "user_7827642",
            "user_link": "/personal_pages/user/7827642",
            "votes": "0"
        },
        {
            "answer": "I couldn't agree more with all the ladies here. You are one strong lady!!!!!! May God bless you and keep you safe! He will never leave you hun. He is our great healer :) trust in him... And he will do great miracles, for he is the same always and forever♡praying for you, and sending many hugs. :)",
            "post_id": "10202136",
            "timestamp": "1396866235",
            "user_id": "user_6348044",
            "user_link": "/personal_pages/user/6348044",
            "votes": "0"
        },
        {
            "answer": "Just remember God has the final say so! U are very strong n keep that positive faith your baby girl needs it u get some rest n keep her in as long as u can!! Praying for u n your family",
            "post_id": "10202182",
            "timestamp": "1396867804",
            "user_id": "user_6151548",
            "user_link": "/personal_pages/user/6151548",
            "votes": "0"
        },
        {
            "answer": "Everyone on here has me in tears every time I read this... I just cannot get over how strong everyone is... I had some issues with preeclampsia with my first but she is now approaching her 3rd birthday next month. I'm 22w+5 and had some placenta previa issues that have since ended so this thread and your strength and dedication makes me feel like I can handle anything as long as my boy keeps brewing. Thank you for keeping us updatedPS I wonder if there is a limit to how many comments one thread can have Lol I can safely say I've never seen this many",
            "post_id": "10202219",
            "timestamp": "1396869268",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "So glad to hear you had a good day yesterday! Praying that today is even better! Praying for healing of your infection! Your strength and love for your daughter is so inspiring. I think that people underestimate how pure and strong a mothers dedication to her child is. It cant be easy being on constant bedrest, but I know you can do it! I woke up with a neat thought - not only is your daughter getting a fighting chance at life, but I am SURE that your story is going to inspire another mom in a tough situation and save the life of her baby! Look at how many people youve touched on here alone,and Im sure that we've all shared your story with our friends and family. Keep us updated if you can!",
            "post_id": "10202432",
            "timestamp": "1396873477",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "How have the hospital staff been at supporting you?",
            "post_id": "10202442",
            "timestamp": "1396873654",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "My prayers are with you and you have helped me believe that mommies know best!",
            "post_id": "10203303",
            "timestamp": "1396888576",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies! I just woke up. I slept so good last night that i didnt even wake for breakfast lol. I just had an-ultrasound and everything looks good. They measure the fluid around the baby and its NORMAL, THANK GOD! they will be moving me to a non-delivery room! At first, they thought i would go into labor but now ill be moving to a more comfortable normal room with a bigger bed! Yayy!!! Ladies you're prayers are working!!!!!!! I was telling my mom about all of you and she just wants to hug ALL OF U JUST LIKE I WANT TO DO! You ladies are sooo encouraging, so sweet, and the stories that you all share gives me more strength and faith! The staff here is amazing!! The nurses are filled with hope!!!! Thank you ladies so much for all the love and support. Im sending prayers to each and everyone of you and thanking God for all of your kindness!",
            "post_id": "10203550",
            "timestamp": "1396892199",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Here's my story. I wrote on your thread and im praying for u and your baby!!!!!!!!! Stay strong and consult with as many doctors u like. Weigh out your options ....do this all while on bed rest!!!",
            "post_id": "10203564",
            "timestamp": "1396892321",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I have just a few more days left until they'll give me the steroids! Taking one day at a time. Also, they told me i could sit up and go to the bathroom however i wasnt comfortable. I rather stay on strict bed rest until i feel like i can. Us mothers know whats best!",
            "post_id": "10203575",
            "timestamp": "1396892497",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "That's great u got some rest n even more great that your baby girl is doing wonderful God is good!! Keep that positive attitude n u will go far! You've touch so many of us n your story ik is helping another mom out there!! Hope u get more great news today n here on out!! :)",
            "post_id": "10203584",
            "timestamp": "1396892602",
            "user_id": "user_6151548",
            "user_link": "/personal_pages/user/6151548",
            "votes": "0"
        },
        {
            "answer": "This is great news !  I have so much faith in you && your baby . We'll all keep praying for you . xxx",
            "post_id": "10203585",
            "timestamp": "1396892615",
            "user_id": "user_7463033",
            "user_link": "/personal_pages/user/7463033",
            "votes": "0"
        },
        {
            "answer": "Thank you so much ladies!!!!!!!!!!!! I couldnt have made it this far without your love, advice, PRAYERS, kindness, faith ...i can go on and on! I hope any other moms who are going thru complications can see the love that you can get from here. I thank you ALL from the bottom of my heart.",
            "post_id": "10203622",
            "timestamp": "1396893344",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I keep checking this thread hoping and praying that you have some good news. Hope you and baby girl are doing well xxx",
            "post_id": "10203733",
            "timestamp": "1396894791",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "Stupid phone didnt load those posts! So relieved that youre doing well. Stay strong mumma xx",
            "post_id": "10203752",
            "timestamp": "1396895039",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "Thrilled about the good news! Stay hopeful and positive momma!",
            "post_id": "10204057",
            "timestamp": "1396899785",
            "user_id": "user_7458937",
            "user_link": "/personal_pages/user/7458937",
            "votes": "0"
        },
        {
            "answer": "Praying for you? I keep checking your post for good news!",
            "post_id": "10204086",
            "timestamp": "1396900129",
            "user_id": "user_5624774",
            "user_link": "/personal_pages/user/5624774",
            "votes": "0"
        },
        {
            "answer": "Oops i meant to put an exclamation point, not a question mark. Prayers for you and your little girl!",
            "post_id": "10204103",
            "timestamp": "1396900311",
            "user_id": "user_5624774",
            "user_link": "/personal_pages/user/5624774",
            "votes": "0"
        },
        {
            "answer": "Prayers for you and your daughter! Stay strong momma!",
            "post_id": "10204166",
            "timestamp": "1396901024",
            "user_id": "user_7551604",
            "user_link": "/personal_pages/user/7551604",
            "votes": "0"
        },
        {
            "answer": "So glad to hear baby girl is doing great! I've been continuously checking your posts and so happy that things are looking up for you! Hang in there mama....U can do it! Let those motherly instincts guide u...If u dnt feel comfortable yet then u go right ahead n keep urself on bedrest...mother knows best! God bless you and your baby girl and may He keep his arms around you both! Continue to keep us updated :)",
            "post_id": "10204173",
            "timestamp": "1396901074",
            "user_id": "user_7735271",
            "user_link": "/personal_pages/user/7735271",
            "votes": "0"
        },
        {
            "answer": "I keep checking your posts too! Hoping everything turns out okay, such an inspirational mother you are!",
            "post_id": "10204977",
            "timestamp": "1396911646",
            "user_id": "user_7301641",
            "user_link": "/personal_pages/user/7301641",
            "votes": "0"
        },
        {
            "answer": "♡ so glad to hear everything is okay (:Your such a strong personnnnn!!!",
            "post_id": "10205001",
            "timestamp": "1396911943",
            "user_id": "user_7114473",
            "user_link": "/personal_pages/user/7114473",
            "votes": "0"
        },
        {
            "answer": "I had my ultrasound and the babys perfect! Also the placental bleed is now just a tiny tear and its not bleeding anymore so happy! And I'm off bedrest!",
            "post_id": "10205047",
            "timestamp": "1396912365",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "Glad to hear the great news as well!! My husband and I have been praying. I am on bed rest til tomorrow. I am 19+2 and over night and through today when I sit up and stand or walk I have horrible pain in the vagimal area. No cramping, bleeding or contractions. Thank the Lord!! I go to Dr tomorrow and ultrasound Thursday. We will continue to pray. What are you naming her?",
            "post_id": "10205132",
            "timestamp": "1396913344",
            "user_id": "user_7692433",
            "user_link": "/personal_pages/user/7692433",
            "votes": "0"
        },
        {
            "answer": "So happy to hear good news from you! Glad everything is well and things are looking up. I check this thread everyday just to see how you're going :)I'll keep praying :) xx",
            "post_id": "10205543",
            "timestamp": "1396918671",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "I just read the first post and then was hoping you went to get another opinion! Glad to see that everything is going well! Hang in there, you're baby will be okay.. you seem too strong for her not to be. I hope everything works out and you have a healthy little girl ... keep updating ♥",
            "post_id": "10205579",
            "timestamp": "1396919119",
            "user_id": "user_6520484",
            "user_link": "/personal_pages/user/6520484",
            "votes": "0"
        },
        {
            "answer": "Im so happy to hear that!!!!! So happy that there is no more bleeding. Yes!!!!!! I am just so happy to hear that!!!!!! Yes keep me updated on your progress and im still sending prayers your way!!!! Stay blessed!!!",
            "post_id": "10205830",
            "timestamp": "1396922189",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Keep me updated please!!!!!!!! And yes i will continue to pray for you like you have done with me! I hope everything works out for the best!",
            "post_id": "10205841",
            "timestamp": "1396922353",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Thank you soooo much for all the prayers. I have been taken off the antibiotics (IV) and will only be taking it by mouth for a few days. I heard the heartbeat again and it is still strong! Thank God and you ladies for all the prayers and hope! You ladies are the ones that are inspiring!!! I dont know what i would have done without the extra push from you all. I cant thank you enough !!!",
            "post_id": "10205873",
            "timestamp": "1396922624",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I will for sure I have another check on the 25th to make sure babys still good and check the tear but I cried in relief to se my baby! I pray for you daily and will keep following fo updates thanks so much lady edmunds please pm your address so I may send your litle girl something",
            "post_id": "10205974",
            "timestamp": "1396923546",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "Prayers for u. I live in sc and its 2am and I've stayed up reading this. And I've got to tell u, just like everyone else has written, u r very strong!!! Keep ur head up and ur baby girl will keeping be strong too!! Just like others I know some ppl that have had babies 21-24 weeks and they r growing normally now after living in the nicu for a while. Hitting milestones like they should and everything. I fully believe this could be the outcome for ur baby girl. Love sent ur way. :):):)",
            "post_id": "10206839",
            "timestamp": "1396935154",
            "user_id": "user_8190042",
            "user_link": "/personal_pages/user/8190042",
            "votes": "0"
        },
        {
            "answer": "Hey lady was just checking to see how you and little baby girl are doing. I try and get on here and read what's going on everyday but I haven't gotten to it feels like for a couple days. I'm happy to hear that they told you that you could sit up and go to the bathroom and it's completely understandable why you wanna stay on strict bed rest. Your little girl is a fighter just like her mama. You are an inspiration to so many women on here and honestly I think more people should hear about what you've gone through because we need more strong women like you in our world I believe. Everyone these days give up way to easily or are just negative about everything after the first sign of bad news. I haven't had any complications with my pregnancy but my cousin before she had her daughter a little over a year ago miscarried 6 times and had to have an abortion at 3 months because the baby stopped growing. Now she's pregnant with her second baby and is due almost a month exactly after me. I'd love to know what your naming you beautiful angel because she truly is going to be a miracle. You both are already. Keep us updated still, we all want to know that everything is going ok.",
            "post_id": "10207352",
            "timestamp": "1396954743",
            "user_id": "user_7143736",
            "user_link": "/personal_pages/user/7143736",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies! Great news to share!!! They thought i had a leakage well they said it was a leaking however the doctor came in and said there was no leakage and just maybe my water bag has been sealed!!! Ladies your prayers are working!!!! Omg im shouting for joy!!!! Im crying! Thank you God and thank you for blessing me with such a great support system. You ladies have never given up on me and my baby. Im so thankful for you. Im moving to ny new roon which is out of labor and delivery. They want me to use the bathroom and sit up becausr im healthy. Still kinda nervous dont want to jump the gun. im still taking it day by day. Thursday ill get the steroid shot so im excited. Thank you all for your kindness from the bottom of my heart. Thank you. Thank you, thank you!!",
            "post_id": "10208703",
            "timestamp": "1396976786",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "WHEW!! AMEN SISTER!! I told u God could heal ur water bag and he did!!! I prayed he would and that it would be a miracle for His glory to open them docs eyes!! This has turned my bad day around!! If it wouldn't hurt so bad I'd go outside and run around my house screaming with joy!! I'm still praying for yal!! God ain't thru with yal yet just wait and see!! Hope u continue to have such a blessed day!! Much love ♥♥",
            "post_id": "10208897",
            "timestamp": "1396980123",
            "user_id": "user_7698659",
            "user_link": "/personal_pages/user/7698659",
            "votes": "0"
        },
        {
            "answer": "Praise and glory to god glad your doing well. Stay encouarged and remember this verse the race is not given to swift nor the battle to the strong but the one who endures forever. Those who wait upon the lord he shall renew their strength.",
            "post_id": "10209150",
            "timestamp": "1396984036",
            "user_id": "user_4503521",
            "user_link": "/personal_pages/user/4503521",
            "votes": "0"
        },
        {
            "answer": "Amen!!!!! So glad you and baby are doing good. God is a amazing and powerful God who answers prayers.",
            "post_id": "10209161",
            "timestamp": "1396984339",
            "user_id": "user_7827642",
            "user_link": "/personal_pages/user/7827642",
            "votes": "0"
        },
        {
            "answer": "Wow congratulations! Such a wonderful thread I read. Went from terrible to great all in a couple days. God is good to the max! Don't give up on him ever ! God bless you and your daughter. What a fighter she is!",
            "post_id": "10209197",
            "timestamp": "1396984887",
            "user_id": "user_6658373",
            "user_link": "/personal_pages/user/6658373",
            "votes": "0"
        },
        {
            "answer": "ive been following your story sense you posted  this 4 days ago and have been reading your updates to my fiance as well... and i wanted to tell you how glad i am that you didnt take the hospitals first advice, sometimes people dont realize that while yes they have studied for years to do what they do that sometimes it can all be a guessing game, your little girl isnt here yet and your  motherly instincts and willingness to do what you have to do is already with you! i was praying to god that everything wold turn out ok and im so glad that it has been. if you dont feel comfortable doing something they ask, then tell them. they shouldnt force you...i wanted to tell you a little of my story as sometimes does it not only help the ones going thru it but also the person still trying to deal with it.around the last of may 2011 i got with this man and everything seemed perfect, he had 5 children and possibly wanted more. as the months went by he proposed and we got married and everyone asked when we'd be expecting and whether they were joking or on some level being serious it started to become annoying and in a sense painful, here we were not using protection and still aunt flow came every month.. but he had 5 kids and with the yougest being 2 it must have been something up with my body and i shrugged it off as if it was ment to be itll happen .. then feb of 2013 come around and things arent so great between us, his ex was living next door trying to start probs between us for 2 years and it gets to the point where he asks for a divorce.. i tried to changed his mind for several weeks but finally started seeing him for the person he is. they day has come where im moving back to my home state and a few days before i go next door to tell his 3 youngest bye and things and i learn from his ex that he had a vasectomy shortly after their youngest is born.. i move back to my home state and end up in a relationship with this guy that ive known sense we were toddlers and a few months go by and we for get to use protection one time and about a month later i learn im pregnant.. everything is going good and we get used to the idea and all and we hit week 12 and i knew something was wrong and then started bleeding pretty badly and learned i had miscarried our little one ... after nearly breaking us apart for good and some pretty bad depression we pick up the pieces, move cities and learn that were expecting again. were now one day shy of 32 weeks with a healthy baby boy, both excited and nervous for our little boy to get here ..sorry i know this is quite a large comment but god performs miracles as he has for my life and i know he will continue to do so for you and your little princess : )",
            "post_id": "10209295",
            "timestamp": "1396986461",
            "user_id": "user_5525504",
            "user_link": "/personal_pages/user/5525504",
            "votes": "0"
        },
        {
            "answer": "God still/will/has always performed miracles!! your sweet baby girl is so strong, and I can't wait for you + all of us to meet her!! lolit is truly amazing to see all of this unfold.. one minute I'm in tears reading your news to my fiancé, as I thought and had fear you were going to listen to those crazy doctors telling you to let your baby go! but NO, you knew better, and God had bigger & better plans for her and your family!!God bless you and your family, you truly have a sweet testament of God waiting to be born.. and I do mean waiting, because it's not happening today or tomorrow! soooo happy for you, and we will continue to pray for you b/c we all know it works!!! (((((:",
            "post_id": "10209897",
            "timestamp": "1396996817",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "Thank God everything is great!!!! Im so happy for u! :)",
            "post_id": "10212505",
            "timestamp": "1397041063",
            "user_id": "user_7546668",
            "user_link": "/personal_pages/user/7546668",
            "votes": "0"
        },
        {
            "answer": "Wow just sat and read this whole post ur such an inspiration!! Keep fighting hunni!",
            "post_id": "10212578",
            "timestamp": "1397043486",
            "user_id": "user_6880636",
            "user_link": "/personal_pages/user/6880636",
            "votes": "0"
        },
        {
            "answer": "Thank you so much ladies for all your prayers and warm wishes. Thanks so much for sharing your own stories. Sometimes its not that easy to just share your own story but i appreciate and support you all. I couldnt have got this far without your prayers, advice, and kind words.Doctor just came in and said im doing good. Im starting to feel my baby girl's kicks in my vagina because she's breach, but its not constant. At the stroke of midnight i will be getting a steroid shot.I meant to ask her where do they stick the steroid shot? Lol. And then she mention something about magnesium? Or magnesia?? Ill have to ask her again. But it helps the brain development. But im holding on drinking my fluids, using the bathroom on my own fine.I cant thank each and everyone enough! I love you all and i will keep you updated and please keep me updated on how everything is going in your life. Praying daily for all of you kind ladies and i thank you so much for being there for me!!",
            "post_id": "10212735",
            "timestamp": "1397046637",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Well im glad to know everythingbis goin giod for your and your angel! But oan.. I was given my steriods shot in the stomach . Not sure you can get them any other place buts thats were Ive gotten mine.",
            "post_id": "10212772",
            "timestamp": "1397047102",
            "user_id": "user_8175778",
            "user_link": "/personal_pages/user/8175778",
            "votes": "0"
        },
        {
            "answer": "Sorry for all the typos....my  phone is a jerk..",
            "post_id": "10212774",
            "timestamp": "1397047163",
            "user_id": "user_8175778",
            "user_link": "/personal_pages/user/8175778",
            "votes": "0"
        },
        {
            "answer": "I had my steroid shots in the top of but cheek so guess it jus depends! So glad all is going good!",
            "post_id": "10212792",
            "timestamp": "1397047407",
            "user_id": "user_6880636",
            "user_link": "/personal_pages/user/6880636",
            "votes": "0"
        },
        {
            "answer": "So so glad everything is going fine for you and baby girl! Everytime I see there's more comments on this thread my heart races",
            "post_id": "10212935",
            "timestamp": "1397049998",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "You go momma! Such an inspiration to all of us, you've kept fighting for your little girl no matter what and it has all come through for you! I want to give you a hug! Keep it up Lady!! ❤❤",
            "post_id": "10212952",
            "timestamp": "1397050231",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "Did a glucose test when you have to drink that nasty orange liquid yuck!!!!!",
            "post_id": "10214249",
            "timestamp": "1397067266",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Lol aww im dreading taking that test.",
            "post_id": "10214299",
            "timestamp": "1397067799",
            "user_id": "user_4503521",
            "user_link": "/personal_pages/user/4503521",
            "votes": "0"
        },
        {
            "answer": "I'm very very happy you and your baby are doing better and that God is continuing to watch over both of you!  Sending you a strong hug momma and we're all here for you!  Let's all keep the prayers going for the both of you, :) ♡",
            "post_id": "10214304",
            "timestamp": "1397067951",
            "user_id": "user_7128540",
            "user_link": "/personal_pages/user/7128540",
            "votes": "0"
        },
        {
            "answer": "Baby and I are doing great!!! Strong heartbeat. They had a hard time catching the little guy to get a heartbeat. Tomorrow is my second ultrasound. We are so excited to see him again!!!",
            "post_id": "10214916",
            "timestamp": "1397077369",
            "user_id": "user_7692433",
            "user_link": "/personal_pages/user/7692433",
            "votes": "0"
        },
        {
            "answer": "Yayyyy!!!!! Isnt it beautiful hearing the heartbeat!!!!!?? My baby was the same way just hiding from the doctoe. It took like 5 mins the first time.Im so happy for you! And you get to see him!! Awwwwwwww tell me how that goes!!!!",
            "post_id": "10215347",
            "timestamp": "1397084055",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I'm glad everything is going well :) prise God",
            "post_id": "10215414",
            "timestamp": "1397085155",
            "user_id": "user_7494125",
            "user_link": "/personal_pages/user/7494125",
            "votes": "0"
        },
        {
            "answer": "obsessed with checking in on you & your baby girl!so happy to see things are still going well!stay strong, and we're still praying for you!! (((: ❤",
            "post_id": "10215447",
            "timestamp": "1397085545",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "So glad things are going well! I'm counting down midnight!",
            "post_id": "10215576",
            "timestamp": "1397087279",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "Glad to see things are going well! Still sending positive vibes :)",
            "post_id": "10215611",
            "timestamp": "1397087957",
            "user_id": "user_7889426",
            "user_link": "/personal_pages/user/7889426",
            "votes": "0"
        },
        {
            "answer": "I'm so happy for you! I'm so anxious for you to get the shot and can you believe the grace of god?",
            "post_id": "10215655",
            "timestamp": "1397088740",
            "user_id": "user_7753764",
            "user_link": "/personal_pages/user/7753764",
            "votes": "0"
        },
        {
            "answer": "So glad I was able to find this thread again tonight so I could check on you two... so glad the prayers are keeping the good news coming!!!! God is good all the time",
            "post_id": "10215684",
            "timestamp": "1397089149",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "I'm so happy to hear that you and your little girl are doing so good. Keep me updated.",
            "post_id": "10217209",
            "timestamp": "1397116231",
            "user_id": "user_7143736",
            "user_link": "/personal_pages/user/7143736",
            "votes": "0"
        },
        {
            "answer": "Hi ladies! I was so desperate to find this thread too! It took me literally an hour and a half! I was not giving up because you ladies NEVER gave up on me! And i thank you so much from the bottom of my heart! I got the steroid shot! Woohoo!!!! It was like a boost of confidence being injecting into my body.Today i just had a little bit, tiny thing of blood on my pad and i informed the nurse. She looked like she wasnt really worried at all then again she was filling in for MY nurse but she notified my nurse of it and she hasnt came back yet. But im not worried. No pain, no contractions, and still no bleeding because when i wiped myself there was no blood at all!I am having some yellow discharge which is common. And i am taking that fagile pill? (Misspelled). Other than that my blood pressure is normal, normal temp. No fever, chills, etc.I should be receiving another steroid shot tomorrow.Thank you for all of your prayers, thoughts, checking in on me i really cant stop thanking you and thinking of each and every one of you ladies. I read all comments out loud to my mother, husband, grandma, nurses, father etc! Lol! They couldnt believe the support that we are getting! Its amazing! You ladies are amazing!!!! I love each and every one of you!!!!!!Oh the nurse just came in and listen to the heartbeat and she saw the pad and she said nothing to worry about!!!!!!!",
            "post_id": "10219447",
            "timestamp": "1397161195",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I'm so happy everything is going good (:God and everyone else is looking over you!That lil girl wants to cook alittle more before meeting mom and dad ;)So happppy for u mamaaa.",
            "post_id": "10219478",
            "timestamp": "1397161792",
            "user_id": "user_7114473",
            "user_link": "/personal_pages/user/7114473",
            "votes": "0"
        },
        {
            "answer": "Oh yeah! She will continue to cook!!!!! Hahaha!!! Love it!!!! Thank you so much!!!!!",
            "post_id": "10219496",
            "timestamp": "1397162100",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "yayyy! so glad you got that shot!! (just messaged you back btw)how far along are you now?!!",
            "post_id": "10219506",
            "timestamp": "1397162268",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "Here is the prayer i say every night and for all the other moms out there =)Loving Heavenly Father, creator of all things, Your Word says You created all things through Jesus Christ and You made all things good and perfect.You give life to all things. I thank You, that I have conceived by Your grace and mercy. The baby in my womb is Your creation, thank You for Your precious gift.Cover me, the baby in my womb and my family members with the holy and precious blood of Jesus. I forgive all who have hurt me and rejected me in any manner.Protect me, my baby and my family members from all evil and dangers.  You are our refuge and our fortress.  For You, Lord, will give Your angels charge over us. My God, in You I put my trust. During this time of waiting, help me to guard this new life carefully and do nothing to hurt it in any way.Lord, Your word also says, Truly You have formed my innermost being. You have woven me in my mothers womb. According to Your Word, let my baby grow normally with all its requirements fulfilled. Take away all complications from my baby and me. Grant me and my baby good health. Lord, let my baby be perfect as You are perfect.Lord Jesus, You be present with me during all this time this baby grows and comes into this world. Lord Your Word says Before I formed you in the womb I knew you, before you were born I sanctified you. Please grant me a safe and normal delivery. Take away all blocks and barriers that are hindering this blessing in my life. Lord I also pray that You lead all pregnant women who are reading this prayer to safe and normal delivery. All this I ask in the name of Jesus, who is Lord of Life, now and forever. Amen.",
            "post_id": "10219515",
            "timestamp": "1397162443",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Wow God is sooooo good. I love to hear your story its soo inspiring. God bless you, faith makes a difference and you have lots of it. God is working on your miracle , amen I declare it in the name of Jesus. Blessings your way (:",
            "post_id": "10219522",
            "timestamp": "1397162569",
            "user_id": "user_7881789",
            "user_link": "/personal_pages/user/7881789",
            "votes": "0"
        },
        {
            "answer": "Im so sorry for the late response by the way!I need to turn on notifications!! Im now 23 weeks. Long road ahead but im confident!",
            "post_id": "10219552",
            "timestamp": "1397163152",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "That is a truly amazing prayer my dear. 13 years of catholic school and 27 years of being a practicing catholic and that pray is by far the most inspiring I have ever read. Its your faith in god that will carry you through this and bring your baby to your arms when she is ready...  thank you for sharing that",
            "post_id": "10219553",
            "timestamp": "1397163156",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "AMEN!!! I'll be reading this daily now!! (((: ❤",
            "post_id": "10219556",
            "timestamp": "1397163260",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "well that's wonderful, another week down.. another week stronger!!!so excited for you & your family!!!keep on cookin' baby girl!!prayers, prayers, and more prayers!! you've got this!! (((: ❤",
            "post_id": "10219564",
            "timestamp": "1397163356",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "Stay positive lady!!!  You can win this!",
            "post_id": "10219566",
            "timestamp": "1397163444",
            "user_id": "user_7349473",
            "user_link": "/personal_pages/user/7349473",
            "votes": "0"
        },
        {
            "answer": "I'm so happy to continue to read ur updates! By the way if u lose ur thread again just go to ur profile and click on ur posts :)",
            "post_id": "10219572",
            "timestamp": "1397163556",
            "user_id": "user_7365589",
            "user_link": "/personal_pages/user/7365589",
            "votes": "0"
        },
        {
            "answer": "Glad to hear good news!! Ur very strong mommas keep faith its all in God hands! :)",
            "post_id": "10219824",
            "timestamp": "1397167445",
            "user_id": "user_6151548",
            "user_link": "/personal_pages/user/6151548",
            "votes": "0"
        },
        {
            "answer": "I've Also Been Praying For You And Your Family. So Glad To Hear That Things Are Going Well For You And Baby. God Is Truly Good And That Prayer You Shared With Us Is Both Beautiful And Inspirational!!!",
            "post_id": "10219875",
            "timestamp": "1397168123",
            "user_id": "user_6344206",
            "user_link": "/personal_pages/user/6344206",
            "votes": "0"
        },
        {
            "answer": "Praying for you. God is great and im sure he is blessing you and your baby girl every day.",
            "post_id": "10220001",
            "timestamp": "1397169976",
            "user_id": "user_6505756",
            "user_link": "/personal_pages/user/6505756",
            "votes": "0"
        },
        {
            "answer": "I didn know that!! Wow thank u!!!!!!! =)",
            "post_id": "10220104",
            "timestamp": "1397171687",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "You dont know how happy I get when you post positive updates! Just think - youre 23 weeks down, only 17 to go! Each time you update us, its more positive each time. Its gonna be hard but youll get there especially with the TLC you're receiving. Your hospital and nurses sound fantastic, constantly monitoring you etc. You're both so strong, you just get plenty of rest and keep fighting! xxxx",
            "post_id": "10220916",
            "timestamp": "1397183265",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "I'm so happy to hear good news when I click on this thread! :) keep the little munchkin cooking :)",
            "post_id": "10221212",
            "timestamp": "1397187671",
            "user_id": "user_6929543",
            "user_link": "/personal_pages/user/6929543",
            "votes": "0"
        },
        {
            "answer": "Its so amazing how god works in mysterious ways! Your story is very inspiring and im very proud of you for having faith in this difficult time. Ill be praying for you. GOD IS GOOD ALL THE TIME!",
            "post_id": "10221297",
            "timestamp": "1397188825",
            "user_id": "user_8091701",
            "user_link": "/personal_pages/user/8091701",
            "votes": "0"
        },
        {
            "answer": "I came back to see how well your doing,  I'm glad you received the steroid shot. The first time I read your post I was also in the ER myself due to some spotting, I got really scared but after I read your post I couldn't help but cry for you. I can't imagine how you must have felt. I am 22 wks + 5d and doing well, with our first boy and I plan to read your prayer every night because he is my blessing. Thank you for sharing your journey through this, you've been an inspiration to many of us and I absolutely love how positive you've maintained yourself. My prayers are still with the both of you, looking forward to  share our labor stories! Sending you lots of love and support from Texas. ;) ♡",
            "post_id": "10223520",
            "timestamp": "1397235566",
            "user_id": "user_7128540",
            "user_link": "/personal_pages/user/7128540",
            "votes": "0"
        },
        {
            "answer": "Yay I'm glad to hear you and your baby girl are doing good keep it up ^__^ every minute second hour day she grows more and becomes stronger I bet she proud to have such a strong mom willing to do anything to fight for get",
            "post_id": "10223584",
            "timestamp": "1397237076",
            "user_id": "user_2170635",
            "user_link": "/personal_pages/user/2170635",
            "votes": "0"
        },
        {
            "answer": "Thank you sooo much i wouldnt have been this strong without the extra love and support that i receive from you and all the ladies. I pray for each and everyone of you each night. Keep me posted on your baby boy and definitely labor stories will come!!! Yayyyy!!!! Wishing you nothing but happiness!!!",
            "post_id": "10223644",
            "timestamp": "1397237971",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "So i got my second steroid shot this morning! Kinda really stung this time. Probably since i was half sleep it caught me off guard! Lol. I noticed when i went to the bathroom and when i wiped i had some blood. Not much! Just some! Since my baby is breach and she's kicking my vagina, my nurse said my uterus is probably getting irritable which can cause some spotting.An obg came in to do a check-up just in case. Just an ultrasound she did. Get this she says it looks like im 2 cm! Remember i went from 1 cm to 4 cm dilated? Well now it looks like im just 2!!! Your prayers, love, and support is working so good!!! When she said that i repeated what i just told you ladies just in case i heard wrong and she said it looks like 2! I was so happy! She said to monitor the blood spotting and just said relax!Thank ALL of you ladies for the kind words, advice, sharing stories, the beautiful inbox messages, and i love how you ladies have been such a support system since day one.I love when you update me on whats going on in your life pregnancy related or non pregnancy related. You all are my family and i love to hear whats been up with you.Im here for you as well and i pray every day for YOU.I cant thank you enough!!! <3",
            "post_id": "10223703",
            "timestamp": "1397238878",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "And yes no pain, contractions, and no real bleeding!!!! No high blood pressure, no high temp, no chills, fever etc! 23 weeks one day! Lets make it 23 weeks and two days!!!Nurses been awesome!!! There going to move me into a bigger and better room down the hall! Deal is i gotta stay pregnant lol GLADLY TOO!",
            "post_id": "10223731",
            "timestamp": "1397239288",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Yay I'm so glad everything is going oh so gopd. That's the work of God right there in your life. God is good all the time and all the time God is good",
            "post_id": "10223760",
            "timestamp": "1397239878",
            "user_id": "user_7494125",
            "user_link": "/personal_pages/user/7494125",
            "votes": "0"
        },
        {
            "answer": "Yay Such good news for you :) :) :)",
            "post_id": "10223840",
            "timestamp": "1397241380",
            "user_id": "user_6832165",
            "user_link": "/personal_pages/user/6832165",
            "votes": "0"
        },
        {
            "answer": "Amen God is good !! Blessings (:",
            "post_id": "10224172",
            "timestamp": "1397247435",
            "user_id": "user_7881789",
            "user_link": "/personal_pages/user/7881789",
            "votes": "0"
        },
        {
            "answer": "Hi ladies!Im having such a relaxful day! My husband surprised me and brought pizza! So happy!!!! I been having a huge appetite lately, hey im pregnant! LolBaby is fine,great heartbeat!Im just so thankful!!!!!Hope everybody is doing great!Anybody cooking?? Going out?",
            "post_id": "10228534",
            "timestamp": "1397339871",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "So glad to hear!!",
            "post_id": "10228561",
            "timestamp": "1397340550",
            "user_id": "user_7954303",
            "user_link": "/personal_pages/user/7954303",
            "votes": "0"
        },
        {
            "answer": "Glad That All's Well With You And Baby!!!",
            "post_id": "10228573",
            "timestamp": "1397340799",
            "user_id": "user_6344206",
            "user_link": "/personal_pages/user/6344206",
            "votes": "0"
        },
        {
            "answer": "Yay yay yay! That's such fantastic news! You must be overjoyed. Keep the fight up, you're winning! Xx",
            "post_id": "10230100",
            "timestamp": "1397367382",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "Very happy to hear your beginning to have good days again! The pizza you mentioned sounded yummy, >_< Enjoy being pampered and continue to update us ;)-DH took us out to dinner and watch Rio 2 this evening and my girlies loved it, but my hips haven't been too cooperative lately I managed to waddle my way. Such joys of pregnancy! ;)",
            "post_id": "10230253",
            "timestamp": "1397371301",
            "user_id": "user_7128540",
            "user_link": "/personal_pages/user/7128540",
            "votes": "0"
        },
        {
            "answer": "Yay! So happy for more good news from you :)I'm so glad that you're okay and baby girl is too. And you seem in such good spirit. You're an amazing woman! Keep up that fight, you can do it!! Much love xx",
            "post_id": "10230340",
            "timestamp": "1397374182",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "Praying for you and your little angel. Jesus can heal you completely and your baby. Just keep up the faith. God loves you and your little one soo much and you both mean so much to Him. Keep us updated. Sending lots of love from Egypt. Will keep you and your family in my prayers.",
            "post_id": "10230901",
            "timestamp": "1397396133",
            "user_id": "user_8030825",
            "user_link": "/personal_pages/user/8030825",
            "votes": "0"
        },
        {
            "answer": "I check this post all the time, I'm so happy to hear good news :) thoughts and prays are with you",
            "post_id": "10232282",
            "timestamp": "1397418411",
            "user_id": "user_7763083",
            "user_link": "/personal_pages/user/7763083",
            "votes": "0"
        },
        {
            "answer": "That is great news to hear keep it up :)",
            "post_id": "10233211",
            "timestamp": "1397433509",
            "user_id": "user_2170635",
            "user_link": "/personal_pages/user/2170635",
            "votes": "0"
        },
        {
            "answer": "I hope you're doing much better! Prayers are still with you, take care hun. :D",
            "post_id": "10235850",
            "timestamp": "1397484739",
            "user_id": "user_7128540",
            "user_link": "/personal_pages/user/7128540",
            "votes": "0"
        },
        {
            "answer": "I'm so happy for you && your baby ! All your posts bring me to tears . You're an inspiration to all of us . Your strength amazes me && I feel honored to be apart of this moment in your life . Keep up the good work , keep us updated && don't forget we love && support you !",
            "post_id": "10235894",
            "timestamp": "1397485181",
            "user_id": "user_7463033",
            "user_link": "/personal_pages/user/7463033",
            "votes": "0"
        },
        {
            "answer": "I been keeping up with your forum. I'm only 10 weeks and 4 days and it scared me to hear some news like that... I'm praying hard for you and baby! Just remember, with God anything is possible :)",
            "post_id": "10237529",
            "timestamp": "1397506908",
            "user_id": "user_7901881",
            "user_link": "/personal_pages/user/7901881",
            "votes": "0"
        },
        {
            "answer": "just checking in on you! I'll be 13 weeks this Friday, yayyyy!!!next doctor's appointment is the 24th, I'll be 13w6d.. I'm soooo nervous, but reading your posts make me feel so confident that God is taking care of our sweet baby!He has performed a miracle right in front of our eyes with you and your sweet baby girl.. you two are truly an inspiration!keeping you & your family in our prayers!! stay strong, and bake that baby for a little while longer!!! ((((:",
            "post_id": "10238007",
            "timestamp": "1397514527",
            "user_id": "user_7721203",
            "user_link": "/personal_pages/user/7721203",
            "votes": "0"
        },
        {
            "answer": "Glad to hear good news. Keep praying god will keepyou and your baby safe. Hope you have a good day! You are truly inspiring ♡",
            "post_id": "10241429",
            "timestamp": "1397573875",
            "user_id": "user_7455663",
            "user_link": "/personal_pages/user/7455663",
            "votes": "0"
        },
        {
            "answer": "Been a few days since you've posted - hope everything is well and hope you're on the mend. Xxx",
            "post_id": "10241585",
            "timestamp": "1397575664",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "Still praying for you! Hope that things are still going well!",
            "post_id": "10241587",
            "timestamp": "1397575677",
            "user_id": "user_6583691",
            "user_link": "/personal_pages/user/6583691",
            "votes": "0"
        },
        {
            "answer": "Your doing great ladyy ;) that baby is with you on this and im pretty positive things are gonna be ok & you will make it to the end of the tunnel :) babies are a blessing from god &he doesnt just give anybody a baby ♥ ill keep you in my prayers ♡",
            "post_id": "10241720",
            "timestamp": "1397577285",
            "user_id": "user_6498478",
            "user_link": "/personal_pages/user/6498478",
            "votes": "0"
        },
        {
            "answer": "I just spent forever finding this post & getting updated! So happy for you & your baby girl! I have been praying for a safe journey/delivery for u both. You are so humble & strong...I admire your courage & faith. I will keep u in my prayers love. I know everything will work out for your family. This was just a hurdle & by god u are overcoming it without struggle. Know that all of us have u in mind & you are not alone. I recently had a scare because I was in a car accident but after days of being worried (he wasnt very active) I went the the er & my baby boy was fine just a little shaken up. It taught me how soon we actually become mothers & I just wanted to say thank you for trusting yourself/baby & not giving up but following your instincts as a mommy.. god bless @ladyedmonds. I will stay posted so update us all please!",
            "post_id": "10241839",
            "timestamp": "1397578396",
            "user_id": "user_6706619",
            "user_link": "/personal_pages/user/6706619",
            "votes": "0"
        },
        {
            "answer": "I just found your post and while reading through everything I want you to know I am praying that you and your family be blessed.",
            "post_id": "10241913",
            "timestamp": "1397579197",
            "user_id": "user_7112728",
            "user_link": "/personal_pages/user/7112728",
            "votes": "0"
        },
        {
            "answer": "Praying for you♥",
            "post_id": "10242115",
            "timestamp": "1397581821",
            "user_id": "user_6115632",
            "user_link": "/personal_pages/user/6115632",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies!!!I hope all of you are doing great! Its been a couple of quiet days. Just been catching up on rest. Ive been getting so great sleep these last couple of days.Yesterday, i had an ultrasound. Everything looked normal. My Aminiotic Fluid level was normal. The only thing the doctor was concerned about was her position. She's currently breach and she was sticking her foot out of ths cervix however she pulled it back. So they were happy that she pulled her foot back in.Other than that things have been great! Omg so i also been PIGGING OUT! my father brought me a polish from the famous Hoagey shop here in Chicago....omg my baby was soooo excited!!!!!!! I grew up eating their food and just seeing that my baby enjoyed it!!!! I love her so much. And i can really start seeing her facial structure in the ultrasound! She looks like my mom! Lol.Before all this i never knew about an incompetent cervix. I never knew how common this was with women. My doctor never mentioned anything about it. This is a serious issue that needs to be discussed in doctor's offices. Or maybe just in mine. But i had NO clue that this can happen and how often it does happen!!Im currently 23 weeks and 5 days! It seems so long since my birthday April 3rd. I was only 22 weeks then and i felt like my world was ending. With the help of God, Family, friends, and the love and support here from all of you, i was able to make it this far. I am so happy and thankful for all your love and support. I love each and every one of you. I love hearing from you all and seeing how things are going in your life. I pray all the time for you ladies and wish you all the best.",
            "post_id": "10242551",
            "timestamp": "1397587626",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "I love you all!!!!!! Thank you for giving me strength each and every day!!!!!",
            "post_id": "10242600",
            "timestamp": "1397588394",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        },
        {
            "answer": "Just took me forever to find this post but I'm sooo glad to hear you and bubs are still doing well... keep up the good work ;-)",
            "post_id": "10242618",
            "timestamp": "1397588758",
            "user_id": "user_6693667",
            "user_link": "/personal_pages/user/6693667",
            "votes": "0"
        },
        {
            "answer": "23+5!!! In 2 days you'll be 24 weeks and that's the week your baby can officially survive outside the womb (with lots of TLC of course) keeping my fingers and toes crossed that she cooks until full term though! You must be getting happier by the day! X",
            "post_id": "10243183",
            "timestamp": "1397595948",
            "user_id": "user_7081287",
            "user_link": "/personal_pages/user/7081287",
            "votes": "0"
        },
        {
            "answer": "So glad things are going well for you and your princess! I am 31+4 today and at my appointment I was measuring at 36 weeks! Have an ultrasound scheduled for next Friday to do a growth check. I'll be anxiously waiting to see why I'm measuring so big! 1.5 weeks until baby shower and 3.5 weeks until I defend my masters thesis. As long as my boy. hangs in there for 4 more weeks everything should work out. Fingers crossed!",
            "post_id": "10243226",
            "timestamp": "1397596535",
            "user_id": "user_7889426",
            "user_link": "/personal_pages/user/7889426",
            "votes": "0"
        },
        {
            "answer": "I've been balling reading all of your updates I'm only four weeks today and everyday is so hard for me because I want to get past the 3 months no miscarriages its my second child i get so worried every day I jus want to hear a heart beat and get a tummy so I can feel better but this is scary I started crying even harder when I started reading you and your baby girl are doing so good I will and am praying for you guys I'm sure you guys will be just fine hang in there mommy",
            "post_id": "10243283",
            "timestamp": "1397597420",
            "user_id": "user_8265691",
            "user_link": "/personal_pages/user/8265691",
            "votes": "0"
        },
        {
            "answer": "So happy to hear things are looking up! Keep that positive energy!!",
            "post_id": "10244688",
            "timestamp": "1397616856",
            "user_id": "user_7901881",
            "user_link": "/personal_pages/user/7901881",
            "votes": "0"
        },
        {
            "answer": "Yay more good news! I love reading your updates and get excited when I see the post come up! Only 2 more days until 24 weeks!! That's gotta feel good momma!! I'll keep praying, I know you can keep that girl in there. You are an amazing woman!What's her name going to be?Much love",
            "post_id": "10246382",
            "timestamp": "1397656399",
            "user_id": "user_7520331",
            "user_link": "/personal_pages/user/7520331",
            "votes": "0"
        },
        {
            "answer": "Today i made 24 weeks!!!!!! Yayyyyyy!!!! I feel like we accomplished sooo much!!!! Ive been on baby monitors since yesterday and the doctor told me today how impress he is with how everything is looking. I am soooo happy. Still no contractions, pain, no leaking, and i have very little bleeding which they are not worried about.I had an ultrasound which showed my adorable baby girl with her feet in the air and her foot in her mouth! Omg i laughed out loud when i saw that. She was then opening and closing her lil hand and it looked like a flower blossoming! She then had one hand behind her hand and it looked like she was giving herself bunny ears! It was so amazing seeing her just being her, learning, listening, and being the active child i know she'll be.Thank you everyone for the continue support and saying just the kindest words that brightens up my day. I feel so close to you all and i pray all the time for each and every one of you ladies. I pray for your babies, families, and pray that He continues to bless these wonderful people.I am truly thankful and love you all!Please keep me updated with your stories!I hope i can be there just as much as you ladies are there for me!Love you All!! <3",
            "post_id": "10253260",
            "timestamp": "1397759858",
            "user_id": "user_7732717",
            "user_link": "/personal_pages/user/7732717",
            "votes": "0"
        }
    ],
    "post_id": "10190056",
    "question": "Yesterday April 3rd i woke up feeling great. It was my birthday and i was going to celebrate with my family. I got a call from my doctor that i have a short cervix and i need to go to the hospital right away. Long story short i found out that i have an incompetent cervix. The only choice i had was to terminate my healthy baby girl. Im 22 weeks and at this time an emergency cerclage wasnt going to solve my problems.Still at the hospital and im pondering how come my doctor did not catch this sooner like around 12-13 weeka of my pregnancy?? My husband and i are so upset and just left with why....our first pregnancy, our first child .....everything was perfect and still is because she's healthy ...i see her on the u/s and shes great it just feels so wrong to let her go. Why didnt my doctor catch this. I always said my visits were short and not very informative. She always seemed in a rush.I just cant go thru with this",
    "timestamp": "1396613623",
    "title": "short cervix part two: no good news",
    "user_id": "user_7732717",
    "user_link": "/personal_pages/user/7732717"
}