{
    "answers": [
        {
            "answer": "i got pregnant 5 months after delivering my twins at 21 wks that also passed. now i have a beautiful baby girl. good luck to you and be sure to let yourself heal emotionally and physically",
            "post_id": "4685035",
            "timestamp": "1248273287",
            "user_id": "user_554628",
            "user_link": "/personal_pages/user/554628",
            "votes": "0"
        },
        {
            "answer": "well ive gone through a similar situacion i lost my baby when i was 16 weeks pregnant it was a horrible expierence i guess i havnt healed all the way people who were around me didnt really understand me so i had to pretend i was ok when i was dying in the inside i felt empty and lonley... i had a son who is about to turn 2 in november so happy god gave my this lil angel that is the highlight of my life... i am currently pregnant and iam 15 weeks still scared because of my 16 weeks miscarriage so wont calm down till iam really far along i pray everynight to god for my baby inside me to be born healthy... but i think about the daughter i lost and she would be turning 3 in november i guessed i havent healed all the way.. best wishes to you take care and remember to let yourself heal and give yourself time good luck.....",
            "post_id": "4790745",
            "timestamp": "1250827024",
            "user_id": "user_915890",
            "user_link": "/personal_pages/user/915890",
            "votes": "0"
        },
        {
            "answer": "i am so sorry for all you guyses losses. i haven't lost a baby yet but have had this condition during pg. it started preterm labor and i had to have shots in my thighs for the babies lungs. i continue to this day to keep having kidney problems and have been warned that another pg would leave me dead, the baby dead or both of us dead. how are your kidneys now?",
            "post_id": "4872058",
            "timestamp": "1252983656",
            "user_id": "user_1037710",
            "user_link": "/personal_pages/user/1037710",
            "votes": "0"
        },
        {
            "answer": "At my 21 week ultrasound of my twin girls I found out I had a short cervix and over the next two weeks it got shorter and shorter. I went into labor at 24 weeks and delivered via c section. My first twin Mia passed within 20 mins of birth and Melody passed two days later from suffering a massive brain bleed. This all happened less than 3 weeks ago. I am devestated. But, I have to look into the future. The dr said that we can start trying in 3-6 months. We have to believe that god has a plan. Even though we can not see it now. If anyone would like to chat about this please email me***@****I still have another month until i go back to work and am bored. I'd love to chat to someone who has been through this horrible pain too.Stay strong!",
            "post_id": "4881543",
            "timestamp": "1253211781",
            "user_id": "user_1043093",
            "user_link": "/personal_pages/user/1043093",
            "votes": "0"
        },
        {
            "answer": "My water broke at exactly 17 weeks in October of this year.  I was told by the doctors that our baby wouldn't survive because his lungs were not developed.  The doctor also explained that my cervix was short (2cm).  I'm depressed and I feel like no one understand what i'm going through.  I have a 4 year old, whose weight was 9 lb. 11 onces at birth and I wonder if that could have affected my cervix.  has anyone had a successful pregnancy with a shor cervix?  will my cervix function differently with another pregnancy or should I expect the same results?",
            "post_id": "5073296",
            "timestamp": "1258057032",
            "user_id": "user_1105994",
            "user_link": "/personal_pages/user/1105994",
            "votes": "0"
        },
        {
            "answer": "I just read your post.....I sit here with tears in my eyes......I just lost my baby girl at 22 weeks less than two weeks ago.....every indication we had was that everything was going fine and she was developing on track.....we went in on a Monday and had our u/s and she was moving around and the pictures were fabulous.....that Friday I got a horrible pain in my backside and thought i had a horrible case of constipation from the lower back pains......I never expected I was in labor.......but i was.....I laid in bed and cried from the pain.....by 9 that night i had delivered my baby girl in the bathroom almost entirely by myself.....the paramedics got there after she had already been delivered......she lasted for two hours after we got to the hospital.....the doctors can't tell us why she didn't survive, and are not sure why i was in such bad pain.....I feel for you.....I will be praying for you......I wonder what could have caused such ahorrible thing to happen.....please let me know if you need anything.....my email is ***@**** know sometmes talking helps....",
            "post_id": "5319245",
            "timestamp": "1264724145",
            "user_id": "user_1065941",
            "user_link": "/personal_pages/user/1065941",
            "votes": "0"
        },
        {
            "answer": "I feel were  ur cuming from. I had my baby girl when i was 26 weeks. For about a week i had severe back pains not know it was labor pains. I went in the hospital dialated at 4. Scared and not know what was next it being m 1st. 15 hours later i had her on Nov.23,2009 at weighing 1lb 14oz  she was born healthy everything thing went good for a while  about a month then out  now where she became severy sick in her intestines. And she passed  on December 25,2009. That was one of the hardest day id ever went threw and hope i never have 2 go threw agin. And i pray no other mother have 2 go threw. And still haveing hard times with it all. I want another baby so bad i just feel like other people will think im rushing it all. What do u think i should do?",
            "post_id": "5382321",
            "timestamp": "1266366683",
            "user_id": "user_1214736",
            "user_link": "/personal_pages/user/1214736",
            "votes": "0"
        },
        {
            "answer": "Hi everyone I am sorry sorry about all your sleeping babys.... I feel for you.. I was just wondering if somebody can help me out I have to write an essay an I picked still birth, as I was a twin but I was the one to survive my mum doesn't talk about this topic at all it's all to hard for her, so I was just wondering if anyone can help me out I need to know if you must have a funeral for the sleeping baby, and how long you can stay in hospital or have to stay in for and I have read about getting pictures n stuff of your bub but do you have to do all of this ?  ... I am sorry if this comment affends anyone I did not mean it but you cannot get a straight answer anywhere,",
            "post_id": "5799508",
            "timestamp": "1276662913",
            "user_id": "user_1348848",
            "user_link": "/personal_pages/user/1348848",
            "votes": "0"
        },
        {
            "answer": "Hi everyone I am sorry sorry about all your sleeping babys.... I feel for you.. I was just wondering if somebody can help me out I have to write an essay an I picked still birth, as I was a twin but I was the one to survive my mum doesn't talk about this topic at all it's all to hard for her, so I was just wondering if anyone can help me out I need to know if you must have a funeral for the sleeping baby, and how long you can stay in hospital or have to stay in for and I have read about getting pictures n stuff of your bub but do you have to do all of this ?  ... I am sorry if this comment affends anyone I did not mean it but you cannot get a straight answer anywhere,",
            "post_id": "5799509",
            "timestamp": "1276662913",
            "user_id": "user_1348848",
            "user_link": "/personal_pages/user/1348848",
            "votes": "0"
        },
        {
            "answer": "I went into pre-term labor at 22 weeks as well. I had severe low back pain for about a week prior. I called the doc because I was having Braxton Hicks left and right and they said it was nothing to worry about unless they became more than 4 an hour. That night I woke up and went to the bathroom to find I was bleeding profusely. By the time I arrived to the hospital I was 4cm dilated. An hour and 45 minutes later I was 10cm. 2 hours after arrival, my son was born weighing 1lb and 11 inches long. He only lived for a few minutes. I was told that all his genetic studies came back with no abnormalities. I had no sign of infection in blood or urine. There was no explanation for what had happend. That was in December of 09. I am now 8 weeks pregnant and as anxious as could be. But I understand what you're going through. All that can be done is crossing fingers for now. Good luck to you!",
            "post_id": "5833746",
            "timestamp": "1277402163",
            "user_id": "user_988003",
            "user_link": "/personal_pages/user/988003",
            "votes": "0"
        },
        {
            "answer": "Hello every one, I am completely crushed. I lost my baby boy 2 days ago at 17 weeks, and I lost his twin 6 weeks ago. I  feel so low and drained, I'm not sure I know how to carry on. I had dreadful tummy ache, so I laid down on the sofa, but then I realised this was a \"hospital situation \". I stood up, and the blood poured out, and the pain was unbearable. I delivered my baby boy 10 minutes after I got to hospital. We called him Charlie, and we are having a little funeral for him. Please can somebody help me get through the next few days.",
            "post_id": "6267328",
            "timestamp": "1287582534",
            "user_id": "user_1480932",
            "user_link": "/personal_pages/user/1480932",
            "votes": "0"
        },
        {
            "answer": "I completely hear you. I was pregnant with twins (IVF pregnancy) and I lost the first one in 8 weeks and second one in 15 weeks. I didn't have any symptoms and my water broke suddenly. We rushed in to the hospital and the ultrasound showed no heartbeat and I had d&c the next day. I've been crying for the past two weeks and the doctors wont give me an answer since everything was looking good (but we're still waiting for the genetic test results even thou the first test in 11 weeks came out negative). I'm taking yoga classes now and hoping it would help.",
            "post_id": "6345724",
            "timestamp": "1289500130",
            "user_id": "user_1503793",
            "user_link": "/personal_pages/user/1503793",
            "votes": "0"
        },
        {
            "answer": "i lost my daughter at 24 weeks and i went into labor at work and they almost had to life flight me to a different hospital but i diolated from 3 to 8 in less than ten mnutes i want to get pregnant again but it seems like it's not happening i havent had my cycle since th e11 of  december and i'm like hopefully i am but test say not pregnant i know how it is i lost my daughter Dusteigh on the 15th of October of this year.",
            "post_id": "6721313",
            "timestamp": "1299718434",
            "user_id": "user_1630450",
            "user_link": "/personal_pages/user/1630450",
            "votes": "0"
        },
        {
            "answer": "i last week lost twins boys both born at 22 weeks both came out after 35 hours in labour one lasted an hour the other 20 mins my hearts broken ive had such a healthy pregnancy till now and only had an ultrasound 4 days before, the dcs think i may hace incompetent cervix im so worried it may happen again or i wont get pregnant again i miss my bump so much i need answers i go back the hopsital in 6 weeks xx",
            "post_id": "6908688",
            "timestamp": "1305486062",
            "user_id": "user_1686338",
            "user_link": "/personal_pages/user/1686338",
            "votes": "0"
        },
        {
            "answer": "on the 7th April 2011 we had the most beautiful baby girl named her Jessica she was born with lots of heart problems that we did not kno about whilst I was pregnant. We were refferred down to hospital and said she would need major heart surgery between 3-6 months. But a couple of weeks of being home we got rushed bk into hospital where she needed an operation to help her oxygen levels to get back up. After her opertaion she looked fine and 3 hours later we lost her. I feel so lost and alone and I miss her everyday. I don't feel like doing anything or seeing anyone, I was so good in pregnancy no smoking not even one drop of alcohol. It has been 7 weeks since giving birth and I want to try and have another baby again. I feel bad for feeling like this. I would never forget my gorgeous first born baby but I am scared about having another child. has anyone been on to have a healthy baby after losing one?",
            "post_id": "6943213",
            "timestamp": "1306621772",
            "user_id": "user_1696773",
            "user_link": "/personal_pages/user/1696773",
            "votes": "0"
        },
        {
            "answer": "I just cry over all of these losses I am reading about here.  My heart goes out to each and every one of you!!!If any of you are diagnosed with an incompetent cervix, it could very well happen again, BUT there is something that can be done to help.  The doctor can put what is called a cerclage in the cervix.  This is basically a stitch to keep the cervix from dialating prematurely.  It is possible that you may also require some bedrest, but maybe not.  Once you reach a safe place in the pregnancy, the cerclage is removed.Again, I am so sorry for you all and honestly cannot imagine loss like this.",
            "post_id": "6961997",
            "timestamp": "1307238296",
            "user_id": "user_287246",
            "user_link": "/personal_pages/user/287246",
            "votes": "0"
        },
        {
            "answer": "I lost my son 2 weeks ago, he was born at 22 weeks he was absolutely perfect. It's taken a big toll on me and my partner ive become totally paranoid that he is going to leave me now aswell. I put on a brave front to friends and family to stop them worrying but inside something died after i lost him, i miss him so much im just hoping wen i go bk to the hospital they can tell me why this happened. I already have a 4 yr old son who is my world and the only thing that's keeping me going. Has this situation made any1 else really paranoid to the point your convinced ur bf has cheated? X",
            "post_id": "7210561",
            "timestamp": "1315157222",
            "user_id": "user_1789204",
            "user_link": "/personal_pages/user/1789204",
            "votes": "0"
        },
        {
            "answer": "Its terible what life throws at you sometimes totally cruel unfair and unprodictable, my sister is 18 an was rushed into labour yesterday att 22weeks! Shed had a terrible pregnancy anot bein able to keep any food atall down an she's extremly thin but we just don't. Understand he's u/s 2weeks ago showed him. Perfect an healthy. Then 2weeks later her waters broke the umbilical called. Had detactched from him an he was starved of oxygen she then had to give birth tto him she had to dress him tttoday an say goodbye an will be arranging the funeral this week I was there every step of ttthe way through her labour an my heart is breaking for her its the hardest fing any one could ever do she seems to be coping really well at the moment but think she's in extreme shock what do we do whatt do we say! I'm a state myself atm had to explain to my 5year old daughter that he's in heaven with the angels its all happend so quik with no. Reason. I love my sistter an justt wana help to take the pain away! Please help",
            "post_id": "7780900",
            "timestamp": "1332105890",
            "user_id": "user_2080321",
            "user_link": "/personal_pages/user/2080321",
            "votes": "0"
        },
        {
            "answer": "Its terible what life throws at you sometimes totally cruel unfair and unprodictable, my sister is 18 an was rushed into labour yesterday att 22weeks! Shed had a terrible pregnancy anot bein able to keep any food atall down an she's extremly thin but we just don't. Understand he's u/s 2weeks ago showed him. Perfect an healthy. Then 2weeks later her waters broke the umbilical called. Had detactched from him an he was starved of oxygen she then had to give birth tto him she had to dress him tttoday an say goodbye an will be arranging the funeral this week I was there every step of ttthe way through her labour an my heart is breaking for her its the hardest fing any one could ever do she seems to be coping really well at the moment but think she's in extreme shock what do we do whatt do we say! I'm a state myself atm had to explain to my 5year old daughter that he's in heaven with the angels its all happend so quik with no. Reason. I love my sistter an justt wana help to take the pain away! Please help",
            "post_id": "7780901",
            "timestamp": "1332105891",
            "user_id": "user_2080321",
            "user_link": "/personal_pages/user/2080321",
            "votes": "0"
        },
        {
            "answer": "I know this is an old post, but I relate a lot to your situation. I am 20 yrs old and i was pregnant with my first child and also at 22 weeks I had lost my daughter on June 22. Results later had showed there was absolutely nothing wrong just went in for a check up and there wasnt a heart beat and nobody could tell me why but they had to induce my labor and i had to give birth to her. I also have an older sister she is 21 and has two kids of her own. While i was in the hospital my sister had sent a mass text to everybody (im from a small town so word gets around quick) saying i had lost my child and had to diliver vaginally and had also taken a picture of my daughter, Lilly Cierra, and had sent it out in a mass text also. I had no idea that she did that until i was planning the cremation of Lilly when a friend had showed me the msgs. It was very hurtful and still to this day cannot get over that she did that, my mom or nobody showed any concern for the situation and just thought what she did was fine and pretty much told me to get over it.  Being in a situation like your sister, there really aren't any words or really anything anybody can do to make you feel better. What does help is knowing somebody is there for you, somebody you can trust not just anybody. My step dad who has been in my life since i was 2 didnt say anything to me never said sorry he didn't even act like anything occured which also was very hurtful. My advice is just to let her know youre there for her if she wants to talk about it, sometimes its hard to talk about so wait for her to come to you. I'm really sorry for the loss it's really a tough thing to go through and is something we'll never get over but having friends and family that are willing to help is the next best thing. I wish you guys all the best that goes to anybody who has lost a child, neice, nephew, grandchild, or cousin, things will hopefully start to look up its been a few months and yet its still hard to see the light at the end of the tunnel, but its there and we'll get there I truely believe that.",
            "post_id": "8262217",
            "timestamp": "1345693020",
            "user_id": "user_3211265",
            "user_link": "/personal_pages/user/3211265",
            "votes": "0"
        },
        {
            "answer": "Hi,I have gone through miscarriage at 22weeks and 7 days in June, 2012. It was my 1st pregnancy after IVF. I got pregnant after 6 yrs of trying. It was a boy and a girl. This event just ripped be off. I delivered them vaginally and both were alive for 2 hrs. Sinc ethey were in non-viable state doctors couldn't do anything to help my angles survive.I am looking for support to help me heal. I am just concerned and having questions as to when I will get pregnant again and even if i Get pregnant how to stay strong during my next pregnancy",
            "post_id": "8320120",
            "timestamp": "1347388822",
            "user_id": "user_3453028",
            "user_link": "/personal_pages/user/3453028",
            "votes": "0"
        },
        {
            "answer": "Hello everyone, is so nice to real different people with the same feelings. Everione around me tells me that they understaand wat I've been going tru but they don't realli feel our pain. When I was 18 weeks pregnant the doc told me I had a short cervix so they had to do a fast circlage. I was 24 weeks when I deliver she ws 1 pound nd 9 ounces she survived for 10 days I know she wasn't well developed but I never thought she was going to pass. I don't think I will ever be ober that nd now after a year we are trying again, its a horrible feeling I think it will happen again and mi doc sais I will alwais have an open and short cervix. But I believe God make miracles and I noe he has one for me. So I hope next time I post somethng it will be a miracle inside me =) I will have u all in my prayers nd jus have faith. God always has a plan.",
            "post_id": "8353774",
            "timestamp": "1348361289",
            "user_id": "user_3856348",
            "user_link": "/personal_pages/user/3856348",
            "votes": "0"
        },
        {
            "answer": "I've also gone thro that on 16may i was 30 wks preggo i started feeling uneasy when i went to the restroom there wr stains of blood on ma pants.i went to the hospital,ma cervix was 7cm dilated and after an hour i deliverd a baby girl.after 2 mins she started breathing with a wheezing sound then she passed after one day.its very hard to come over it bt am trying.please try hard en God will help u.right now am 9wks pregnant and i pray that he will help me have this child",
            "post_id": "8568666",
            "timestamp": "1354269007",
            "user_id": "user_4116090",
            "user_link": "/personal_pages/user/4116090",
            "votes": "0"
        },
        {
            "answer": "hi every1 i lost my little boy 3 days ago i was 20 weeks 5 days my cervix dilated 3 cm at 19 weeks when i went to the drs office he saw i was bulging i couldnt have an emergency cerclarge my cervix was too thin i went on bedrest and had progesterone shots but it didnt worj i went into labor i was so devastated i held my son until his heart stopped beating almost 2 hrs after he was born i feel so empty now i dont know what to do and now my breast started leaking can any1 who has been through this offer me any advice on how to cope",
            "post_id": "8651801",
            "timestamp": "1356299225",
            "user_id": "user_4540262",
            "user_link": "/personal_pages/user/4540262",
            "votes": "0"
        },
        {
            "answer": "Hello, i wanted to let you know that I just experienced the same pain you are going through a week ago. I was 25 weeks pregnant and went to the hospital bleeding. They were going to try to hold of labor as long as possible but I just kept bleeding, had alot of back labor and then they were losing our vital signs. I had an emergency c-section and my baby girl was born at 25 weeks. She lived for 36 hours and my husband and I just laid her to rest yesterday. I feel your pain and understand what you are going through. I do not know how strong in your faith you are but for me and my husband, we are leaning on the Lord to help us heal and grow to find our way through this tough point in our life. I have been talking to friends, keeping occupied. Im not sure what else to say because I am still coping and just starting the grieving process myself. I will say I found some closure by writing my feelings about my little angel. If you write to your little angel it might help find some closure, maybe not take away the pain but help knowing you are talking about it out loud. Hope this helps. if you find anything that helps you, please let me know",
            "post_id": "8730575",
            "timestamp": "1358124430",
            "user_id": "user_4699635",
            "user_link": "/personal_pages/user/4699635",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry for your loss. I went 25 weeks pregnant with twin boys and at work (a phlebotomist at a blood bank) was on my feet all day. At the end of my shift I sat down and when I got up I start pee-ing on myself, so I thought. I could not stop no matter how hard I squeezed. I went to the bathroom and it was still going, that's when I realized my water bag might of broke. I went to the hospital and one of the bags did break. Stayed in the hospital for a week the had an emergency C-section due to me having a fever. First baby died 5 hours later and 2nd baby died a day later. This is the hardest thing I had to go through. This happened in 2009, and to this day I still cant get over it.But to cope through this, I feel family and close friends are very important. I lost my religion and almost lost my husband because I just completely shut down. I do have two boys before this pregnancy. And to everyone's surprising this past year,I am now a Sunday school teacher and I am no longer mad at God.  if you can see a psychologist t that is also a big help. Keep your family close but also let them know when you just need your time so they can respect that and give it to you.another thing we do in our family to keep our twins memories with us, is we celebrate the three days they were with us ever year. something simple...I take out their urn and light a candle. And I am Mexican and we have a celebration that we celebrate our loved ones that has passed away. Dia de los Muertos, Nov. 1 and 2. and that is a big celebration. By doing this has helped my whole family and especially my boys understand death and to celebrate the love we still have for them. They always say we have two angels looking over us.Your in control on how you want to handle this. This sounds Mad, cuz I thought so too, but the more you talk about it the easier it gets.I will pray for you and your angel.",
            "post_id": "8736900",
            "timestamp": "1358263068",
            "user_id": "user_4711956",
            "user_link": "/personal_pages/user/4711956",
            "votes": "0"
        },
        {
            "answer": "I was 22 weeks 2 days pregnant with identical twin girls and I woke up with back pain and cramping a little and I got in the shower and it got alot worse. I had an ob appointment around 2 so I just waited it off. By the time I got to the dr I was 3 cm dilated. I went straight to the hospital and was fully dilated within 15 min. I had my babies that night and they passed away between 10 and 15 min. That was not even 3 weeks ago and I'm so devastated. My heart is broken and I don't know what to do. I wonder if having another baby would help but then I also wonder if that could make the pain worse??",
            "post_id": "8967675",
            "timestamp": "1364338204",
            "user_id": "user_5150314",
            "user_link": "/personal_pages/user/5150314",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm sorry to anyone who has suffered from early/late misscariges or even stillbirths as I know how you feel. My pain is still so raw. I was diagnosed with pcos when I was 19 and then at 24 I fell pregnant with the love of my life. I had probably one of the easiest pregnancies known to man as everything was perfect, no morning sickness, no bleeding, no pain, no weight gain, no nothing, some people didn't believe I was pregnant until they saw my bump. My daughter was due 15/9/13, I made it all the way to 37weeks to the day where I went to the hospital as I didn't feel her move for a couple hours. Where it takes 3midwives for them to tell me that they couldn't find my daughters heartbeat. She had passed away 3weeks before she was due, born 2days later on the 28/8/13. After going for my hospital check up to find out that there's was nothing wrong with me or my daughter, our bloods were fine and her placenta was perfect, they believe that her heart skiped a beat and just didn't start beating again. Like I said its still so painful and raw and I'd do anything to have her back. I have already asked my partner if we could have another baby, not to replace Hope but to have what we've always wanted. He wants another baby as much as I do but both of us are so scared that it might happen again, neither of us nore our families can go through this again. I don't know if it will be easier to conceive after having Hope, regardless of my pocs which is not a bad case.Has anyone been through something similar and had a healthy pregnancy and baby after a loss so close to the end? If someone could please help or reply I would be most grateful.",
            "post_id": "9585317",
            "timestamp": "1382276401",
            "user_id": "user_6542349",
            "user_link": "/personal_pages/user/6542349",
            "votes": "0"
        },
        {
            "answer": "I lost my sweet baby boy on October 27, 2013 at 18 weeks. I had been having slight bleeding and severe abdominal pains for a couple of weeks. I went to the emergency room on October 18. I was told everything was fine with the baby, but that my cervix was soft and that I was severely constipated. I was told to follow up with my Obgyn ASAP. Which I did. Unfortunately my OB was not enthusiastic or concerned about my cervix and refused to perform a pelvic exam on my follow up visit. He listened to my baby's heartbeat with the Doppler and told me my cervix being soft was normal and sent me on my way! 7 days later I was still experiencing bleeding and went back to the ER. This time I was told I was dilated to 9cm and my water broke a few hours later and I had a boy that 6.8 oz. I was DEVASTATED. What has helped me to cope is writing to my baby when I'm feeling sad and missing him. Talking to friends and family about my son and using his name out loud. (Kayden). I'm not yet ready to take out his urn and look at keepsakes that I have of him. It is still too painful. But I take solace that Kayden is in a better place and is watching over me and that eventually I will be with him in heaven. Plus Kayden will always be in God's memory. I have no doubt about that. I'm still looking for someone to blame (including myself) for my baby's death. I feel if I would have done anything different in my prenatal care my child would still be alive. Now I am having baby fever and want to get pregnant again. Not to replace my child, but to feel a void. I know it might sound crazy to some. Love and prayers going out to anyone who has ever had to go through something of this nature. God is with you. Take care.",
            "post_id": "9653802",
            "timestamp": "1384288025",
            "user_id": "user_6738384",
            "user_link": "/personal_pages/user/6738384",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm so sorry for you lost. I lost my lil Angel as well on October 29, 2013, after 23 weeks of pregnancy he lived for 2 hours. I am so devastated not a minute goes by that I don't think of him I want to hold him so badly.. he looked so perfect his heart beat was so strong. I was admitted on Oct 14, with a cervix measuring 1.5cm and an infection.  I so badly want to  fill this void, I feel so empty.",
            "post_id": "9733393",
            "timestamp": "1386460076",
            "user_id": "user_6956835",
            "user_link": "/personal_pages/user/6956835",
            "votes": "0"
        },
        {
            "answer": "I just lost my first child, my baby girl Corina at exactly 20 weeks. I tried to take such great care of myself for her. I wouldn't even have caffeine, but I somehow feel like its my fault. I started cramping and spotting on Monday and I went to the ER where the doctor didn't perform a pelvic exam or sonogram, checked my blood and urine and basically told me I was overreacting and sent me on my way telling me just to take it easy. The next day at work I used the bathroom and started bleeding excessively and rushed to the ER where they did a sonogram and my baby was fine and moving around, but my cervix was thin and opened and I was already dilating. They said there wasn't anything to do and less than 24 hours from my first ER visit I gave birth to a silent baby. My boyfriend and I are devastated. They think I have incompetent cervix but they don't know. I won't go back to the doctor for 6 weeks. Its my greatest desire to have kids but I'm so scared something like this will happen again. I'm also just scared that I won't be able to deal with my grief and it'll hurt my relationship with my significant other. We just buried our child yesterday. Reading all these stories helps me feel that I'm not alone. I just feel like I have no purpose in life anymore and I don't know how to move on with my life.",
            "post_id": "9875444",
            "timestamp": "1390616870",
            "user_id": "user_7406976",
            "user_link": "/personal_pages/user/7406976",
            "votes": "0"
        },
        {
            "answer": "My fiance and I are going through the same situation. I actually did not know that I was pregnant and I went into the E.R for heavy bleeding and extreme cramping and I found out that I was 22 weeks pregnant and also in labor already. I gave birth to our baby boy Oliver Matthew, and he survived for about 2 hours in NICU. We are heartbroken but being strong by the grace of God. I am so ready to get pregnant again, but we have not tried yet. Praying for all you ladies who lost your sweet little ones.",
            "post_id": "10528175",
            "timestamp": "1402108518",
            "user_id": "user_9170158",
            "user_link": "/personal_pages/user/9170158",
            "votes": "0"
        },
        {
            "answer": "I feel your pain :-( I had my twins at 22 weeks this Saturday and they only lived for a few minutes. I am so devastated. I will be praying for you and your family. I heard that you should wait at least 4-6 months before trying again. Good luck with everything.",
            "post_id": "10897582",
            "timestamp": "1407735282",
            "user_id": "user_10090807",
            "user_link": "/personal_pages/user/10090807",
            "votes": "0"
        },
        {
            "answer": "I've lost my twins also last month @ 19w and its the most heart shattering experience a mother can ever go through. I pray everyday. Through the doctors, the memories, and all of the things that bring us to our knees the only thing that's pulling me through is God. I pray for all of the moms that lost because our hearts will always be missing a piece. The lord will give us our motherhood back... as always he has a plan. And we may not see it now.. but we will one day. Remember, they are in heaven... the best place possible. Keep your head up doll... for we are extraordinary mothers and that's a blessing in itself. XX",
            "post_id": "10952674",
            "timestamp": "1408463192",
            "user_id": "user_10198819",
            "user_link": "/personal_pages/user/10198819",
            "votes": "0"
        },
        {
            "answer": "I found out I was pregnant very early. I was sick and it continue through my first and entering my second trimester. My son was doing fine. At 18.4 weeks I being to swell in my feet, ankles, legs, and eyelids. and my blood pressure was elevated. I contact my doctor went to ER and was sent home and told to continue to do what I was doing for the swelling. I return to ER at 19.3 weeks because the other swelling and my blood pressure. I stayed a few days  and was sent home with high blood pressure medicine. At 20.5 weeks and my next doctor appointment, I was diagnose with preeclampsia with hypertension.  I continue taking the medicine, monitor my blood pressure and doing what the doctor instructed. At 22 weeks, my blood pressure spiked, I was sent to labor and delivery to be observed. The next morning at 7:18 am, I delivery my baby boy Jayce. Jayce passed away moments after but will live in my heart forever.At 22.1 weeks, Jayce weighed 1lb. 5oz. and 8 inches. The pain is so strong. Although, we have other children it doesn't take away from our baby Jayce. Now we want to try again... Not to replace him but, simple to love another.",
            "post_id": "13421154",
            "timestamp": "1446326616",
            "user_id": "user_16233768",
            "user_link": "/personal_pages/user/16233768",
            "votes": "0"
        },
        {
            "answer": "Good site to choose name for baby!babynamesgab.com/",
            "post_id": "13432433",
            "timestamp": "1446651164",
            "user_id": "user_16279308",
            "user_link": "/personal_pages/user/16279308",
            "votes": "0"
        },
        {
            "answer": "I lost my first child on the 30th of January 2016,some hours after she was delivered,though she didn't cry but she was breathing and the mid wife told me she will be fine. she never did cry till she gave up.I gave birth to her at 42weeks and she was doing great till I delivered her.the ultrasound shows that my baby was doing great and I didn't have a clue of losing such a beautiful baby.I'm still grieving and I dunno when I'll get over it.I'm just praying to get pregnant soon probably that will make me get over it.",
            "post_id": "13669054",
            "timestamp": "1455172696",
            "user_id": "user_17273809",
            "user_link": "/personal_pages/user/17273809",
            "votes": "0"
        },
        {
            "answer": "Thank you for being brave & reaching out. I too am going through a roller coaster of emotions & live each day the best I can for my beautiful 3 yr old son but some days are hard. On the 13th November 2014 i gave birth to my beautiful baby boy Enoch. He was 19wks 5days. At 18 wks i started bleeding while I was at work and was rushed to the hospital. Unfortunately I had a incompetent cervix & all the amniotic fluid surrounding baby had leaked. Drs told me the devastating news that there was slim chance of survival for my precious son. He was still kicking strong, so I still kept hope & stayed on hospital bed rest drinking lots of fluid in the hope it would replenish what was lost. On the night of the 13th November i went to the toilet & felt a strong kick then pressure fall between my legs, i shut my legs tightly & called for the nurse. The nurse placed a bed pan in the toilet and my precious son was born into it. He was so perfectly formed & I loved him so much.18 mths later we found out I was pregnant again. We were so overjoyed but also apprehensive. We announced the news just to immediate family and asked them to keep it to themselves. I made sure to attend all hospital apts & stitched my incompetent cervix as extra precaution. All was going well & by week 20 I was feeling more confident as I had passed the apparent dangerous stages of pregnancy.  We found out she was a girl & we were filled with so much joy that my mind started planning for her future...decorating her nursery, buying dresses, where she would sleep. My son would kiss my tummy every night and say \"love u my sister\" I was just over 23 wks when I started to feel sick, sore back & found bright yellow discharge. I went immediately to the hospital & they admitted me in. Internal examination was done & they found that my cervix was only 1mm & that was being held by the stitch. I had also contracted a infection which was making matters worse. On my 2nd night at the hospital my waters broke, I was panicking on the inside but appeared calm on the outside. Drs told me that keeping my baby girl inside me would be too dangerous as she may contract the infection i had & recommendation was to cut the stitch & allow her to come out naturally. I gave my consent to remove the stitch & - flurry of NICU doctors & nurses began to prepare. I was so scared but I wanted to be strong for my baby so i kept smiling & being positive. 2 hrs after removing the stitch my princess arrived into the world. She was born 24wks & weighed 760g. We named her Graceline Hope. She came into the world breathing on her own & then they whisked her away placing her on CPAP. We were in the NICU everyday from morning till night. Talking, singing, praying for her. Kangaroo holds were few but when we had the opportunity we always held the memory close to our hearts. We changed her nappy & even wiped her down. I pumped out milk for her every 4 hrsx Everyday was a miracle & I refused to accept that she would not survive. On day 17 her breathing started to deterioate & she was placed on the ventilator. She had also contracted an infection which was what we were praying that she would not get. Her heart rate started to go down & the next night we were given the heartbreaking decision to allow her to go in peace & not be in pain. She survived 19 days & then graduated to heaven on the 31/8/16 in my arms. It was the hardest thing I have ever had to endure & even now I struggle to understand why me? Why did I have to loose 2 angels? Most nights I cry myself to sleep but I still live in hope & have faith that God has my angels wrapped in His arms. I hope & pray my story helps some other parent that is going thru the same thing.Don't give up hope & keep the faith. Even though it may feel like the end of the world, the sun will always shine thru the next day. Love you my angels Prince Enoch & Princess Graceline",
            "post_id": "14036010",
            "timestamp": "1477054903",
            "user_id": "user_19401880",
            "user_link": "/personal_pages/user/19401880",
            "votes": "0"
        }
    ],
    "post_id": "4679095",
    "question": "On June 11th I gave birth to my first child..a son at 22 weeks of pregnancy.  He did not survive.  I have so many questions and I'm still so very sad.  Has anyone experienced something similar?  My pregnancy was fine until week 20 then everything went down hill.  20 week u/s was fine but I started having back pain.  The pain got very severe to where I could not sleep or eat and I ended up in the hospital to find I had hydronephrosis.  I was sent home with a follow up appt scheduled with a dr to talk about stenting my kidney.  Not even a week later I started bleeding and went back to the hospital to find I was 8 cm dilated already.  My severe back pain prevented me from knowing I was in labor.  Has anyone ever had hydronephrosis during their pregnancy?  How about pregnancies after having a preterm baby?  Any help or advice is appreciated.  I think I really just want someone to talk to who understands what I am going through :)",
    "timestamp": "1248126867",
    "title": "Successful pregnancy after losing a baby at 22 weeks",
    "user_id": "user_975679",
    "user_link": "/personal_pages/user/975679"
}