{
    "answers": [
        {
            "answer": "Yes, I did.  I did that in the summer of 2004.  Suddenly, my blood pressure was running regularly at about 190/150, bloating, pain, bleeding, and other assorted aches and pains, including the constipation runs alternation.  I also found diverticulitis and had a foot of my colon removed in June, but I think this is ALL interconnected.  I think if they would have looked for cysts prior to this last December, they would have found them.  I also had an endometrial ablation in 2004 which I believe was a total failure.Anyhow, there are too many women coming up with the same laundry list of complaints, some in menopause range, some younger, older, all over the age spectrum.  I'm really beginning to think there is some unidentified bacteria or virus or other agent that is getting into our bodies and wreaking havoc with our immune systems.  All of these things could be considered autoimmune in nature, in my opinion.  Something is tripping our autoimmune systems so they are going berserk and creating cysts, tumors fibromas, whatever.  This is just a theory of mine.  I've had just about every system in my body give me some kind of heck in the last two years and prior to that, I had been healthy as a horse.  To me, there has to be something to this and I'm hoping, if there is, there's some kind of resolution figured out before I lose anymore body parts.Take care, love, hugs and God bless, Barb",
            "post_id": "1351121",
            "timestamp": "1140242400",
            "user_id": "user_113087",
            "user_link": "/personal_pages/user/113087",
            "votes": "0"
        },
        {
            "answer": "Barb, I'm with you on your autoimmune theory!  Endo is an autoimmune disease and it seems like it was only recently recognized as such.  It's so wierd that you mentioned your theory b/c it is also my immunologist's theory.  My son has autoimmune disease and I have been tested w/ him over the years in various research projects and come up w/ a similar profile to his (but w/o having developed autoabs yet).  Hopefully I am going to get some testing along these lines next week and I will let you know what I find in case it may help you.I think one big problem is in the way the medical system is set up: it's artificially divided into body system specialties & subspecialties, and the specialists all stay tightly focused on one system and no one ever looks at the big picture - we are, after all, one big system that is interconnected.Was your hypertension resolved w/ the removal of your cyst and was your cyst benign I hope?    Thanks!",
            "post_id": "1351122",
            "timestamp": "1140242400",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "Nope, my blood pressure is being controlled with Atenelol, exercise and diet changes.  But there are times when no matter what, it goes up.  Recently I went 155/115 with 100 mg of atenelol in my system.  And it always seems to coincide with when my cycle is doing this crazy thing again.  I've bled 19 out of the last 22 days.Yesterday my blood pressure was 145/98 which isn't horribly scary, but that's with the meds.  When things were working right, I usually ran a little bit low and the meds usually keep me about 118/78.  I just took my atenelol at around 9:00 last night, and again this morning and I'm running 138/82.  Again, not startling, but in my opinion it shouldn't be elevated at all.I'd be very much interested in finding what you learn from the immunologist.  I actually called an old friend from Chicago who is an internist and told him my story and right away, he suggested that there is something that is hitting up my immune system.  I have active titers for three different viruses that while normal in the general population to have antibodies against them, they are normally suppressed and active titers will not be found.  Epstein-Barr, Cytomeglavirus and Herpes-Zoster.  He actually suspected HIV or Hep C perhaps, but I am negative for both of those, thank God.  My ex-husband has Hep C.  I honest to God think this is all related.I think there just might be some undectected nasty that former IV drug users are passing around, some as only carriers, some only now becoming ill in their older age.  My ex is 57 right now, was healthy as a horse until about 6 years ago himself having left the IV drug use long behind.  He was very ill with hepatitis in 1985 but they still had not identified the C virus.  My daughter, only had one at the time, and I were treated with gamma globulin as a precaution and I've had one weird episode after another since that time.  He became actively ill again in 1999 and I don't think he'll be around another five years.  And I'll repress the comment concerning his deserving that fate. . .  I never used IV drugs ever, never, at all, but I honestly think that I might be paying the price.All this autoimmune nonsense going around these days, it seems like everything is being named autoimmune - endo, diabetes, different thyroid disorders, etc., etc., etc.  I just have to think there is some baddy out there that hasn't been found.  There's just too many people, especially women, who are saying the same things and experiencing the same things for us ALL to be just hysterical menopausal women.How's that for up on the soapbox???",
            "post_id": "1351182",
            "timestamp": "1140242400",
            "user_id": "user_113087",
            "user_link": "/personal_pages/user/113087",
            "votes": "0"
        },
        {
            "answer": "Bravo Bravo!!!!!!!!!~Tascha",
            "post_id": "1351185",
            "timestamp": "1140242400",
            "user_id": "user_117289",
            "user_link": "/personal_pages/user/117289",
            "votes": "0"
        },
        {
            "answer": "Oh, and I haven't had a cyst removal.  I'm in the wait and see boat right now.  I'll see the doctor on Thursday for an endometrial biopsy and I intend to ask for the ultrasound to be done sooner than another month or so from now.",
            "post_id": "1351190",
            "timestamp": "1140242400",
            "user_id": "user_113087",
            "user_link": "/personal_pages/user/113087",
            "votes": "0"
        },
        {
            "answer": "Sorry  - one more question, Barb:  Did you by chance have toxemia/eclampsi/preeclampsia with any of your pregnancies?  I had it w/ my 1st and I can't help thinking about this w/ the high BP and hormone/reproductive problems all coming up together.  The Drs I asked about a possible tie-in/clue said there was no relationship. But eclampsia seems pretty poorly understood (not to mention BP causes).  Hormonal changes and immune suppression are 2 major things going on during pregnancy.  Just wanted to check if we had this in common too - thanks!",
            "post_id": "1351197",
            "timestamp": "1140242400",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "Nope, no preeclampsia.The only problems I had with my pregnancies was low hemoglobin, b-12 and anemia with all four and some adema with just the last one.I hope you don't end up going on and on like I have the last several years.  Take care, and let's keep in touch on this.  I really think there is something causing all these common symptoms in so many of us.  You'll maybe have noted that Sonie is active EB virus too.  I don't know for certain that it's my ex-s fault.  I just enjoy blaming him for everything. . . just ask him!!!  :) Love, hugs and God bless, Barb",
            "post_id": "1351201",
            "timestamp": "1140242400",
            "user_id": "user_113087",
            "user_link": "/personal_pages/user/113087",
            "votes": "0"
        },
        {
            "answer": "I hear you Barb. I think there is definitely something going on - there are just so many more autoimmune and neurological problems even in children.  I had thought it was the more aggressive childhood vaccination program that was pushing young children's immune system over the edge; my child was in the ER after 4 of his vaccinations.  But it seems like adults are getting more autoimmune diseases too.I think the immune system and endocrine and adrenal systems are much more tied together than is generally recognized.  I have wondered if there isn't some tie-in w/ environmental endocrine disrupters that mimic hormones causing some of this?Certainly herpes class viruses like EBV, CMV, HSV can cause major problems in some people.  In the past, I have mostly gone after my son's medical problems.  Through people I met doing this, I found 3 children who made a major turnaround when their HSV or EBV or VZV were controlled when they flared up (they use zovirax).  I wish I could find something that straight-forward for my son and me.  Have you done serial titers of these to see if they are going up again when you flare up?  This may give you a clue.  One friend would test her kid's EBV early antigen and do serial titers when she started going south.  She also would get frequent yeast infections when the EBV was re-flaring. This is in a young child.  But zovirax and diflucan or nystatin really turned her around.That's awful that you were exposed to the risks your ex took on w/ his IV drug use.  I never used IV drugs and don't have any risk factors for HIV or Hep thankfully.  My ex brought a lot of misery, but at least he spared me on this front.Atenelol is the first BP med I tried and I had so much trouble w/ it. It dropped my HR down into the 40s and I kept fainting and it didn't control my BP well enough.  Do you feel OK on it beyond worrying about the BP control issue?I am getting pretty good control w/ minimal side effects using Lisinopril and Hydrochlorothiazide.  THe BP meds are awful in genral - aren't they?!  I had to try 7 different meds before I found 2 that worked decently and didn't make me a basket case.  I don't know what's doing what any more - is it the meds, my high BP, whatever is causing the high BP or that ovarian nightmare or my fear factor?The only reason I had to hold off getitng the ovary removed was that they were looking for an adrenal tumor - which turned out to be a go-nowhere wild goose chase.  I can't wait to just get it over with even though I'm scared.  I will have had it hanging over me for 4 mos by the time they finally remove it.  Arghh!I will certainly let you know whatever I find out that may be helpful in your case.  I sympathize w/ going from being perfectly healthy to having one thing roll into another suddenly.  I've seen more Drs and had more tests in the past 4 mos than I did the whole rest of my life. It's awful and it's scary.  Best wishes",
            "post_id": "1351193",
            "timestamp": "1140242400",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "Wow ladies.  You have been through a lot!  My applause to you for being so strong and patient although sometimes not!)I had a cyst removed in July 2005 which was totally asymptomatic. It was a large serous cystadenoma.  I was told very unlikely to return.  Thought it was all done with.Until... I hurt my back doing a very minimal bending activity over 2 weeks ago (Similar thing ocurred a couple of weeks prior to discovery of the cyst).  Only yesterday did I start to feel like I could walk, stand and lay correctly again.  When I had gone to the doc 2 weeks ago he noted I have hypertension (never been a problem before.. I'm thinking possibly due to the back pain!?) and also discovered a UTI which I had no idea or symptoms of.  Well, he put me on antibiotics and HCTZ and the blood pressure has been moderate but still high mostly.  I dipped my urine the day after completing the antibiotic and it was negative.  However, has been positive since then for trace protein and leukocytes (I dipped it at work).  Of course, this indicates a recurrent infection.I convinced my wonderful ARNP-gyn to order some tests (for some reason my doc did not find it necessary), one of which was a serum aldosterone/renin ratio. The renin came back high.  In my mind this could explain the HTN. So, I went back to the doc today to tell him my back is just now (17 days later) feeling better; my period is (for the first time EVER- even when the cyst was happening) 10 days late, pregnancy test done tonight negative; my blood pressure is not better; I am gaining weight; cannot wear my wedding ring due to bloated fingers; and just feel tired a lot.  He chalks it up to poor diet.  \"No further tests necessary, I doubt there is a correlation to another cyst growing, lets see you again in May.  I don'tknow wht is wrong with you\".  Well, his nurse could have told me that on the phone!  I do it all day long!I feel like a hypochondriac!!  Am I simply getting fat for no reason?  Well, my husband has some \"unknown and undiagnosed arthritic condition\" for the last 2 years and I too, cannot help but think this stuff is virus related.  No way to tell of course, without blood tests.  I'm getting really discouraged.",
            "post_id": "1351680",
            "timestamp": "1140501600",
            "user_id": "user_121073",
            "user_link": "/personal_pages/user/121073",
            "votes": "0"
        },
        {
            "answer": "Hi - I also had a high renin level and high aldosterone.  I am also on HCTZ.  It lowered my BP better than some much nastier BP meds, but like you - not enough.  Adding lisinopril really helped and it also has the benefit of no side effects (for me at least) and being potassium-sparing (which is nice b/c the HCTZ can lower your potassium - I had this problem at first).You can have renin-secreting tumors even on your ovary or the renin can be elevated b/c of the HCTZ.  I have had it tested 3 x and have seen 5 different Drs (2 endocrine, 2 gyn, 1 internist) and all sort of dismissed it.  My BP also got high very suddenly and I just happened to catch it going up. I am so sure it has to be connected to the cyst.  I went on a wild goose chase looking for a pheochromocytoma (adrenal tumor, which secretes adrenaline and can raise BP) b/c I had high normetanapharine and high total metanapharines (b/c of nor being elevated).  I feel like all of me has been scanned and they never could find anyting - so now finally I am getting the ovarian nightmare removed.  I have high hopes that this may solve my problem?Anyway, I agree w/ you that you deserve a much better workup.  It's good that at least you have some contacts to have gotten some testing done.  I think I had a pretty thorough workup, but ultimately, no one could figure out how things fit together - which is so frustrating.  And when all is said and done, I'm just left going w/ my guy instincts and  going after getting rid of the ovarian cyst/ovary.  If there is more endo present than that cyst (assuming it is endo...), I will get everything out.moosie - I was just reading a couple of articles about diverticulitis and endometriosis - one case history where Drs did not recognize colonic endometriosis and the patient suffered for it.  I thought it may fit in with your assorted problems?  Here is the link for the case history:http://arpa.allenpress.com/arpaonline/?request=get-document&doi=10.1043%2F0003-9985(2002)126%3C0867:PQCACM%3E2.0.CO%3B2I feel very strongly that there is a connection.  I just hope it pans out when i get that danged ovary removed and that we all find a unifying central dx that is treatable.  Best wishes",
            "post_id": "1351690",
            "timestamp": "1140588000",
            "user_id": "user_123166",
            "user_link": "/personal_pages/user/123166",
            "votes": "0"
        },
        {
            "answer": "Thanks for your insight and sharing yor experience.  I had the labwork done prior to starting the HCTZ.  It sounds like getting bunches of labs won't really help anyway, huh?  We could use a doc on this site.  I wonder if one is lurking out there...",
            "post_id": "1351875",
            "timestamp": "1140674400",
            "user_id": "user_121073",
            "user_link": "/personal_pages/user/121073",
            "votes": "0"
        },
        {
            "answer": "Just a tip to anyone in their forties that suddenly has cysts appearing on one or both ovaries, please suggest to your ob/gyn to look for adenomyosis.Quick info from Mayo Clinic about it:  Adenomyosis: The tissue that lines the uterus (endometrium) grows within the uterus' muscular outer walls. This is most likely to happen late in your childbearing years and after you've had children.  Although the cause of adenomyosis remains unknown, the disease typically disappears after menopause. For women who experience severe discomfort from adenomyosis, there are treatments that can help, but hysterectomy is the only cure.So in other words, the uterine lining tissue gets into the uterine muscle and there is no way out.My first hint that I had adenomyosis was in my early forties with the appearance of a small (very painful) cyst that only one ovary.  After three or four years, it progressed to a cyst every two or three months and the pain (ovary and low back) was terrible by that time.   I was not in menopause but was probably perimenopausal.The ob/gyn will look for an enlarged and/or boggy uterus but I did not have those symptoms at all.  Ever.   I have been told that quite a bit of the time they can find adenomyosis with an MRI but not always.  For me, anemia and breakthrough bleeding were my only other symptoms and those appeared three months before my hysterectomy.  But I still did not get the diagnosis of adenomyosis until after the pathology report came back after the uterus was removed (and I had that pesky ovary removed but kept the normal ovary).  I think my doctor did the hysterectomy because he didn't know what else to do to stop the pain I was in.  He admitted later that he was completely shocked that I had adenomyosis.In talking with other women who had it, I discovered that many women with adenomyosis have similar ob/gyn histories: tubal ligations, pelvic inflammatory disease, large babies, pain in the mid to lower back, chronic pelvic pain and cysts.  But not all of them.  Some had no symptoms at all.Anyway, anytime I run into a forum where a woman mentions the sudden appearance of cysts, I like to jump in and mention this so that it is not overlooked in their ob/gyn appointments.Just in case you are wondering, no problems with hysterectomy, recovered nicely, no new cysts on remaining ovary, no more pain - especially in the back, no hormone therapy because I kept one ovary and I kept my cervix too (personal choice).  Felt like a new woman after healing up. The only thing I would change is that I wish I'd done it ten years earlier.Alaina",
            "post_id": "2250893",
            "timestamp": "1198053209",
            "user_id": "user_307773",
            "user_link": "/personal_pages/user/307773",
            "votes": "0"
        }
    ],
    "post_id": "1336628",
    "question": "Hi - I am new to this forum.  Starting a few mos ago, I had sudden onset malignant hypertension (250/150!) - always had low BP before this.  Coincidently, also developed a 7cm ovarian cyst on left ovary.  I have had US (both kinds), CT, and MRI and some descriptions were simple cyst, hemmoragic cyst, complex cyst, endometrioma (depending on who was reading it).   Every Dr I've spoken to has acted like it was a something we could wait and watch while they searched for a cause of my sudden-onset hypertension.  However, I also stopped having periods since Sept (the hypertension started in mid-summer) and my FSH and LH are very high, so the Drs say I am in menopause.  I just turned 44, which I realize isn't young, but sudden menopause? and why is it a functional cyst if I'm in menopause?  Also, my estrogen and testosterone are in the range of someone in normal reproductive years.I keep thinking all these things are related, but the Drs act like they are all unrelated coincidences (one guy actually said I simply had incredibly bad luck - rofl).  Has anyone else developed hypertension w/ an ovarian cyst or ovarian cancer?  My CA125 was 15 and I have a history of endometriosis on the same ovary (endometrioma removed 12 yrs ago).I also have the creepy bloating that many people on here have mentioned and alternating constipation and diarrhea.Has anyone else else had this sort of combination of things happen suddenly?  Especially the hypertension?Thanks in advance for any insights any of you may have.  This is the best site",
    "timestamp": "1140156000",
    "title": "Sudden hypertension and 7cm ovarian cyst",
    "user_id": "user_123166",
    "user_link": "/personal_pages/user/123166"
}