{
    "answers": [
        {
            "answer": "We lost our precious ^^Lilliana Gabrielle^^ @ 37 weeks  (9 months) exactly 1 year ago...will miss and remember her forever...her 4 sisters and 1 soon to be(edd 5/19/06) miss her soooooo much. Her father and I will be forever devastated!Cant wait to see you sweetiexoxoxo",
            "post_id": "1147234",
            "timestamp": "1139378400",
            "user_id": "user_103618",
            "user_link": "/personal_pages/user/103618",
            "votes": "0"
        },
        {
            "answer": "me-25dh-28angel baby #1 2/22/99 EDD 9/20/99angel baby #2 1/5/06 EDD 7/30/06Waiting for AF after D&C then TTC#3 Hoping for December baby :-)Neylia,I am so so sorry about the loss of you daughter..  I just wanted to tell you that I love her name.. Good luck with your pregnancy!!",
            "post_id": "1147243",
            "timestamp": "1139378400",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "Lost our baby at 6w2d in July '05.  EDD would have been 2-23-06...this month.  Makes DH and I very sad to think we would have been new parents this month.",
            "post_id": "1147250",
            "timestamp": "1139378400",
            "user_id": "user_66799",
            "user_link": "/personal_pages/user/66799",
            "votes": "0"
        },
        {
            "answer": "Me 38Dh 35Lost our first Dec.20th at 8 weeks. no fetal HBIm ready to move on!Currently TTC!!Baby wishes!!",
            "post_id": "1147263",
            "timestamp": "1139378400",
            "user_id": "user_115299",
            "user_link": "/personal_pages/user/115299",
            "votes": "0"
        },
        {
            "answer": "Sorry, that should of been written miscarried ANGEL would of born on August 25th 2000.",
            "post_id": "1147272",
            "timestamp": "1139378400",
            "user_id": "user_114594",
            "user_link": "/personal_pages/user/114594",
            "votes": "0"
        },
        {
            "answer": "Nice idea, is it allowed!!!...I lost my first baby at 12 weeks, I also have three children but you still think of the baby you lost, what he /she  would be like, etc...",
            "post_id": "1147278",
            "timestamp": "1139378400",
            "user_id": "user_113726",
            "user_link": "/personal_pages/user/113726",
            "votes": "0"
        },
        {
            "answer": "Me 31Dh 32Dd 2 1/2We lost our little angel at 8.5 weeks after seeing the h/b one day and the next day it was gone. D&C November 8, 2005.Someone asked if it's any easier to lose our babies if you already have one and I would say most definitely yes for me. Every time I would get really depressed about the loss, I just looked at my precious daughter, the love of my life, and thank g-d for thos blessing. While I feel for everyone who has suffered this type of loss, my heart really goes out to those who have never experienced the miracle of birth.Dh and I have been ttc ever since we lost our angel and officially in our 1ww. I would love nothing more than to wrap up a BFP in a cute little box and present it to dh for Valentine's day.",
            "post_id": "1147284",
            "timestamp": "1139378400",
            "user_id": "user_105544",
            "user_link": "/personal_pages/user/105544",
            "votes": "0"
        },
        {
            "answer": "My first little angel was lost in May of 2002. I had just told my family and that night he was gone.",
            "post_id": "1147290",
            "timestamp": "1139378400",
            "user_id": "user_116306",
            "user_link": "/personal_pages/user/116306",
            "votes": "0"
        },
        {
            "answer": "I have 3 angel babies......First daughter was lost at 16 weeksSecond daughter was lost at 9.5 weeksThird angel baby was lost very early.........It was tough with each one. I just hope I/anyone else has to go through that again! (((Sending hugs to all the angel babies))))",
            "post_id": "1147291",
            "timestamp": "1139378400",
            "user_id": "user_59030",
            "user_link": "/personal_pages/user/59030",
            "votes": "0"
        },
        {
            "answer": "I lost 2 angels. I lost one in Oct,05 at 8w and one in Nov,05 at 4w.They will always been a part of my family and heart.",
            "post_id": "1147296",
            "timestamp": "1139378400",
            "user_id": "user_105967",
            "user_link": "/personal_pages/user/105967",
            "votes": "0"
        },
        {
            "answer": "We lost our baby on August 11, 2005.  Our due date is next Saturday (18th).I think of our baby everyday :(",
            "post_id": "1147300",
            "timestamp": "1139378400",
            "user_id": "user_104592",
            "user_link": "/personal_pages/user/104592",
            "votes": "0"
        },
        {
            "answer": "It'll be tough next weekend.  We did just get our BFP, which will make things a little easier knowing that I'm pregnant again.  I do think about it all the time though, especially because one of my co-workers is due a week after our due date.  I got to watch her grow over the last few months....made me sad some days - thinking that should have been me.  Are you going to do anything special on your EDD?",
            "post_id": "1147319",
            "timestamp": "1139378400",
            "user_id": "user_104592",
            "user_link": "/personal_pages/user/104592",
            "votes": "0"
        },
        {
            "answer": "lost my 22 mo old daughters twin after 16 hours fighting the ventilator.  she was a 24 weeker as is my living daughter.  we miss her terribly.  i still cry every week.  she is our little guardian angel.",
            "post_id": "1147330",
            "timestamp": "1139378400",
            "user_id": "user_117302",
            "user_link": "/personal_pages/user/117302",
            "votes": "0"
        },
        {
            "answer": "I hope you don't mind me asking but what happened?  I cannot even imagine how devastated you must have been.  It's like you feel like you've gotten that far and then something happens...",
            "post_id": "1147332",
            "timestamp": "1139378400",
            "user_id": "user_118703",
            "user_link": "/personal_pages/user/118703",
            "votes": "0"
        },
        {
            "answer": "I know how you feel.  Like I said above, my edd was 2-23.  Ever since 2-1 I've been doing the \"What would we be doing now to prepare for the baby coming\".  So sad.  I'm really hoping this is my month for bfp.  I'm hoping the same for you and everyone else here.",
            "post_id": "1147341",
            "timestamp": "1139378400",
            "user_id": "user_66799",
            "user_link": "/personal_pages/user/66799",
            "votes": "0"
        },
        {
            "answer": "angel baby lost july 2004new bundle on way... Ivy sky is due march 31st 2006, i cant wait!!",
            "post_id": "1147359",
            "timestamp": "1139378400",
            "user_id": "user_108751",
            "user_link": "/personal_pages/user/108751",
            "votes": "0"
        },
        {
            "answer": "Lost angel baby boy Dylan 11-11-05 EDD 3-24-06 21 weeks along.waiting on some tests and hope to ttc soon after my next AF in 8 days.ME - 25DH - 27",
            "post_id": "1147364",
            "timestamp": "1139378400",
            "user_id": "user_118345",
            "user_link": "/personal_pages/user/118345",
            "votes": "0"
        },
        {
            "answer": "I'm trying to think of something but nothing seems worthy.2WW is the hardest time of the month!!!!  I'll check in and see how your doing....keep busy and don't test too early.Tons of sticky baby dust your way**************",
            "post_id": "1147371",
            "timestamp": "1139378400",
            "user_id": "user_104592",
            "user_link": "/personal_pages/user/104592",
            "votes": "0"
        },
        {
            "answer": "I know what you mean.  I still have all my baby stuff from the m/c.  We found out I was pg the Sat. before Father's day, so my dh's family gave him tons of \"I love my Daddy\" stuff.  We also have an us picture and a baby book.  I've thought about burying it all for the edd but I can't bear to part with any of it.  Thanks for the baby dust.",
            "post_id": "1147374",
            "timestamp": "1139378400",
            "user_id": "user_66799",
            "user_link": "/personal_pages/user/66799",
            "votes": "0"
        },
        {
            "answer": "Hey you 2.. sorry about your losses.. SOmething i wanted to do to remember my m/c is a tattoo.. I am hoping to be around 20 wks pg when my baby's due date shows up.. Ah.. this is tough.  I only bought 1 onesie for this baby.. I wanted to buy a baby book and i was ready for maternity pants but i didnt and I am glad.  On christmas i made a video of our christmas tree and me and DH were talking about the baby.. I have yet to replay it.. but i will follow it up with the next BFP!! and a story of course.  Good luck to you both!!! BABY DUST",
            "post_id": "1147377",
            "timestamp": "1139378400",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "Just wanted to add...I did get a tattoo to remember my baby. I'm glad I did. Dh told me not to get anything depressing, like a baby with angel wings. So I didn't, I got a dove with a single daisy. DH wants to get one but isn't sure what to get...",
            "post_id": "1147460",
            "timestamp": "1139378400",
            "user_id": "user_108334",
            "user_link": "/personal_pages/user/108334",
            "votes": "0"
        },
        {
            "answer": "Wow I am about to cry now hearing about everyone's losses. I also had a m/c in nov. Dont really know how far along I was. Probably on 4 weeks. Good luck to all who are still ttc and those who have already.Me-32dh-32ds-12dd-5Hopefully I can add one more here!!",
            "post_id": "1147390",
            "timestamp": "1139378400",
            "user_id": "user_110622",
            "user_link": "/personal_pages/user/110622",
            "votes": "0"
        },
        {
            "answer": "thank you for your condolences....^^Lilliana Gabrielles'^^ older sister (4 yrs old) is Gabrielle Lilliana...we named our angel the opposite for memory sake. Sorry for your loss too..they are all horrible I felt like I had been hit by a train ....we are still picking ourselves up!",
            "post_id": "1147409",
            "timestamp": "1139378400",
            "user_id": "user_103618",
            "user_link": "/personal_pages/user/103618",
            "votes": "0"
        },
        {
            "answer": "doctor would not listen I said something was wrong....I was seeing spots, gained 15 lbs in 2 weeks, was swollen but doc said becuz blood pressure wasnt high it wasnt preeclampsia. On the 10th of Jan 05 I went to doc and told him the baby wasnt moving like she should be he had me go in for a bio physical profile and a NST everything was fine according to them only to have her die 2 days later. Later I found out that they knew she had the cord wrapped around her neck and didnt tell me becuz they say it usually doesnt cause a problem. well hello if mamma is telling you the baby is not moving enough then maybe it is and half an hour of monitoring may not reveal it.Hell I was 37 weeks he could have induced just to be on the safe side..she was 7lbs 6oz. After all was said and done I asked be dischared the same day I delivered only to be admitted again the next day. The preeclampsia they said I didnt have.... I went back into the hospital with Post Pardum preeclampsia I had it... it just reared its ugly head as far as high bp goes after. Doc didnt even try to fight the law suit..needless to say he learned a pricy lesson....all of his education will never compare to my education as a pregnant woman....and his education is worthless without my input as a pregnant mother.His lesson = pricyOur lesson = pricelesslove to all...Im tired",
            "post_id": "1147410",
            "timestamp": "1139378400",
            "user_id": "user_103618",
            "user_link": "/personal_pages/user/103618",
            "votes": "0"
        },
        {
            "answer": "Wow.. I am glad that you sued him.  Not that any amount of money could even come close to what you lost.. You did everything right.. and still you had to suffer..  I am so so sorry that you had to lose your baby girl because this doctor thought he knew it all.  It seems like these doctors lose their sensitivity because they have been doing this for so long.  You dont need to be a doctor to know that the symptoms added up to a problem.  Yeah, a cord around the neck doesnt NORMALLY hurt a baby.. but when you felt her moving less that should have been a clue.. you dont need an MD after your name to know the obvious.. I am getting chills up and down my back thinking of the suffering your family, and especially you, have endured in the past year.  Well, I wish your baby a sweet Happy Birthday in Heaven.  HAPPY BIRTHDAY IN HEAVEN SWEET LILLIANA!!",
            "post_id": "1147414",
            "timestamp": "1139378400",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "Thank you soooo much.......it means so much to me ...God Bless you and yours!",
            "post_id": "1147416",
            "timestamp": "1139378400",
            "user_id": "user_103618",
            "user_link": "/personal_pages/user/103618",
            "votes": "0"
        },
        {
            "answer": "I don't know if dh's heart could take doing something special.  He took the news of the m/c even harder than I did.  I'm so happy for you and your bfp!  Maybe I'll get lucky this month too.  I'm praying this is a super sticky pg for you!  I'm in the 2ww.",
            "post_id": "1147430",
            "timestamp": "1139378400",
            "user_id": "user_66799",
            "user_link": "/personal_pages/user/66799",
            "votes": "0"
        },
        {
            "answer": "I thought of a tatoo....then I remebered how much the one I have hurt!!!!Staci - I also bought 1 onesie for our baby and hung it where I could look at it everyday.  The day we lost the baby my sister hid it from me.....I still have no idea where it is.  I'm pretty thankful for that actually.The one thing I have done that has been a HUGE help is write in a journal.  I started one just a couple weeks ago and I have to say it's been very therapeutic.",
            "post_id": "1147454",
            "timestamp": "1139378400",
            "user_id": "user_104592",
            "user_link": "/personal_pages/user/104592",
            "votes": "0"
        },
        {
            "answer": "you knw what is funny??? I was pg for 10 weeks, i bought the onesie on the last day of my vacation (disney world) I hesitated buying it.. I was 6 weeks pg.  I brought it home in the bag, rolled it up and kept it in my night stand.  I never showed anyone.  Weird huh??  It is still in the bag.  I think in the back of my head i knew something bad was going to happen.Tattoos do hurt real bad.  I am just at odds where i would want to put it.  I have 3 little ones right now. A habiscus flower on my left foot, roses on my right ankle and angel wings on my lower back.  Maybe i could add to that but i wanted it where i can see it.  I have the exact opposite feeling.. i want to always remember this baby. which i know i will.  Even though s/he was only in my life for 10 weeks, i loved it to death.  I picked out a name for a girl (i believed this is what she was) and now i dont even know if i would want to use it if i have a girl next time.  I do love the name a lot.  I dunno.. i guess i will cross that bridge when i come to it.",
            "post_id": "1147457",
            "timestamp": "1139378400",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "My dh was thinking of getting a tatoo in remembrance right after the m/c but I don't think he is now.  I think he's doing his best to move on and the tatoo may be a constant reminder.  He may still do it though.  He hasn't talked about it in a while.",
            "post_id": "1147387",
            "timestamp": "1139378400",
            "user_id": "user_66799",
            "user_link": "/personal_pages/user/66799",
            "votes": "0"
        },
        {
            "answer": "Oh, you guys. I dont know what to say. I am so, so, so, so very, very sorry. Life is so hard sometimes, and the more you care the more it hurts. I am so sorry. Denise",
            "post_id": "1147444",
            "timestamp": "1139464800",
            "user_id": "user_119572",
            "user_link": "/personal_pages/user/119572",
            "votes": "0"
        },
        {
            "answer": "Hey girls, good morning.  For some reason MEDHELP isnt letting us post new questions this morning.  I just got a painful reminder.  I normally dont dry my  hair in the mornings and there is this 1 co-worker of mine who teases me about it especially in the winter.. WELL she just came up to me and said, \"So Are you going to at least dry your hair now that you are pregnant?\"  So.. had to tell the story.. OUCH.. Yep still hurts.  <<tear>>",
            "post_id": "1147445",
            "timestamp": "1139464800",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "haha.. Denise, you made me laugh.. i was picturing a little 1 inch fetus shaking his/her fist at someone.. I am sick in the head.. How are you feeling?? when is your next u/s???? Soon right??",
            "post_id": "1147530",
            "timestamp": "1139464800",
            "user_id": "user_117004",
            "user_link": "/personal_pages/user/117004",
            "votes": "0"
        },
        {
            "answer": "Well, is she at least going to see what time ediquette classes start in case she has time to attend now that she's divulged she has no decorum?? (as your baby shakes his/her little fist up at her rude self \"hey, don't pick on my mommy!!)",
            "post_id": "1147512",
            "timestamp": "1139464800",
            "user_id": "user_119572",
            "user_link": "/personal_pages/user/119572",
            "votes": "0"
        },
        {
            "answer": "I started bleeding feb. 4th and had a miscarriage.  Even thogh I was only 9 weeks I still miss my baby so much. It seems like I wont get over it, but I know I will.",
            "post_id": "1147705",
            "timestamp": "1139551200",
            "user_id": "user_122059",
            "user_link": "/personal_pages/user/122059",
            "votes": "0"
        },
        {
            "answer": "i lost my li'l one at 10 weeks on 22nd dec 05. i had a good feeling li'l one would be a girl (god knows why!) so we decided gracie very early on. hoping to find out i'm prg on the 19th feb fingers crossed.... baby dust to all.. *******************",
            "post_id": "1147733",
            "timestamp": "1139637600",
            "user_id": "user_122029",
            "user_link": "/personal_pages/user/122029",
            "votes": "0"
        },
        {
            "answer": "I Had my baby boy George On wed 8th Feb 06 at 19 weeks. A Perfect Angel Never forgotten. His big sister said ' but mummy we forgot to put cream on his bum' She said George is on the moon looking after us :).  Its so hard to move on I hope i have the strength.Love to alltrishaMummy to Felicia 3.5 And My angel George 19weeks",
            "post_id": "1147783",
            "timestamp": "1139724000",
            "user_id": "user_122347",
            "user_link": "/personal_pages/user/122347",
            "votes": "0"
        },
        {
            "answer": "My husband were overjoyed to find out we were pregnant after news of uterine fibroids. But I carried 7 weeks. It was the most amazing time of my life. I had never felt more in touch with myself and who I was to be in this world.We had a heartbeat, we could see it blinking on the screen. It was the most awesome thing ever and we were so proud because it was ours and we had so many plans.I told my family April 10, 2004. Easter weekend. And the next night, it was all over. It was our first pregnancy and my heart broke that night. Because of a previous D&C for fibroids and the unfortunate realization that it may not be my last miscarriage that I would need a D&C for, my doctor wouldn't give me a D&C. Instead, he prescribed something for the pain and told me I would need to 'pass' it. He assured it would take 4 days, max. Well, I could have kicked him. It took 9 days of horrible emotional trauma. Oh, and of course, then there was the actual physical miscarriage itself. It was so hard to cry like that every day, with my heart breaking.But I know that I was meant to be a mother and I am actively TTC. My husband has been wonderful, and he has been there for all the false alarms and the endless HPT's.We will conceive. I have no doubt. We will see those 'two lines' again! We will never give up! But we will NEVER forget our little angel. April 11 will always be a day I remember, but now, it's a reminder of the baby I will hold someday.",
            "post_id": "1148196",
            "timestamp": "1139983200",
            "user_id": "user_122943",
            "user_link": "/personal_pages/user/122943",
            "votes": "0"
        },
        {
            "answer": "hello everyone,sorry for your losses. we lost our baby girl quincy on jan 10,2006 at 21 weeks. we were told it was because of an incompetant cervix.  I went to the doctors office because i was leaking and i was already 2cm dilated.  my bag of water was starting to come out she sent me to the hospital and the next day my water broke and i delivered my baby girl, stillborn.  she will never be forgotten, at least i got to hold her, i will never forget her sweet face.  Baby dust to all!!!!ttc",
            "post_id": "1148815",
            "timestamp": "1140242400",
            "user_id": "user_118512",
            "user_link": "/personal_pages/user/118512",
            "votes": "0"
        },
        {
            "answer": "We are ttc again after 2 miscarriages. The first Aug. 18/2000 and the second Feb. 8/2002. Both lost at 10 wks, 2 days. Personally I think it is due to my fibroids which the doctor discovered after the first miscarriage. The first pregnancy was a \"blighted ovum\" the second was not. I saw the heart beat on Jan 16/02 but then suddenly 3 weeks later, nothing...I could not believe it happened again!  I had a D & C & hysteroscopy on my gyn's advice.  Maybe would that help with the fibroids? My other thought was that my body was not producing enough progesterone however I live in Canada and found out that Progesterone cream is banned here!  Figures...I've also read that NSAIDS (Advil etc.) can stop the heaviness of the periods with fibroids. Mine are extra heavy, but I went back on the pill to counteract them for the past 4 years. Now we want to try again (the final time of trying as I'm 39) so this is it! I'm off the pill as of Feb. 23 and so praying that the miscarriage doesn't happen again and we can successfully get pregnant.  Any support/help would be appreciated. I'm very nervous about 1) trying again 2) miscarrying again and 3) those awful heavy periods!  I'm up for any pre-conception herbal & vitamin remedies if anyone knows of any or the proper way to use NSAIDS to make the bleeding less heavy, or pretty much anything to help us have a successful full term pregnancy.  Thanks and good luck to everyone here!!",
            "post_id": "1149833",
            "timestamp": "1140933600",
            "user_id": "user_124403",
            "user_link": "/personal_pages/user/124403",
            "votes": "0"
        }
    ],
    "post_id": "1059949",
    "question": "Good morning ladies, I thought it a very good idea to have this day as a memorial for all the babies that were miscarried, I know they are in heaven up there waiting for us one day. Please share your miscarried story. I start with mines, I have lost, baby ANGEL @ 2 months on January 11th 2000, oh how I am so sorrowful about that and think about him/her everyday, I have 3 other beautiful kids, but I will always remember my little Angel. I have found this poem written by Isabella, everyone can say it and remember their little ANGEL, God bless you ANGELS, and we'll always remember all of you. You are not here with us, but you will always be in our heart.You Are My Little Angel,Up Above In Heaven Now,I Wish That I Could Hold You,If Only There Was A Way How...You Are Still My Little One,I Keep You In My Heart,I Know Someday I'll See You,And We Wont Be Apart...But Until Then I'll Think Of You,In The Rain Or Shine,I Will Keep On Loving You,You'll Always Be Mine...So Take Care My Darling,In Heaven Up Above,And Until I See You,I'll Send Up All My Love...ME 30DH 33DD 14DD 10DS  3Miscarried ANGEL would of born on August 25th 2005 ( We missed you and we'll always remember you).",
    "timestamp": "1139378400",
    "title": "This is in rememberance of all the ANGEL BABIES whom we have lost by miscarriage",
    "user_id": "user_114594",
    "user_link": "/personal_pages/user/114594"
}