{
    "answers": [
        {
            "answer": "I think its time for you to go beyond your PCP and be referred to a neurologist - they can get your entire history and get a good neurological examination - they will also be able to follow and interpret the results of any testing like MRIThe widespread nature of the tingling in both arms and legs might suggest a problem in the cervical spinal cord, the sneeze worsening it or the electric shock like sensation would support this. One of the possible causes is MS among other things, your age, gender, and family history makes MS a bit more likely. HOwever this post cannot take the place of a complete opinion as I do not know your full story etc.MS is a treatable condition so it should be identifies and looked for along with other possible causes, for example, Vitamin deficiency, sarcoid, syrinx, or growths. Usually to identify MS, and MRI of the brain and cervical spinal cord is done, and also a spinal tap for analysis of the cerebrospinal fluid, and visual evoked potentials (an electrical test of vision). All these can be done through your local neurologist.Good luck",
            "post_id": "1820234",
            "timestamp": "1128229200",
            "user_id": "user_264495",
            "user_link": "/personal_pages/user/264495",
            "votes": "0"
        },
        {
            "answer": "I need to hear from anyone who has a similar problem!!!  I'm barely functioning for this \"thing\" going on in my head is nearly impossible to deal with on a daily basis.........Let me first give some backround...........I'm a jr. high school teacher and mother of two.  I have suffered from migraines since the age of 14.  I get the kind with severe pain....light sensitivity..........etc.  When I'm \"in the Migraine\" I must lie down on my back and stay still.  The pain is terrible and I'm extremely sensitive to light, sound and movement.  I place a cold rag on my head, take meds and wait for it to go away.  This, I can deal with.......I don't like it, but I can deal with it..............I have a new sensation that I cannot deal with.  This is what is happening:  I have a \"magnetic\" or \"electrical\"/tingling sensation reverberating through my face 3-4 times every five minutes ( at times, it feels almost constant...at others, I get a bit of a break).......My left eye isn't focusing correctly.........It feels numb and goes out to the left........especially when I'm driving.............My face feels numb in places, but mainly on my left side..........My left arm and my hand do, periodically, go numb.............I cannot sleep well....and I'm often dizzy.....I cannot focus...........I'm sick to my stomache at times.....I dread waking up for I know that it will be another day like the one before..........This is a horrible thing to deal with and I feel like I'm simply existing....I dread going to work.............and it is hard to fully enjoy my kids..................(Working in a \"difficult\" district doesn't make things any easier.........)........I've also been having more of the painfull migraines lately..........When I saw this site this morning...I cried......I'm so hoping that someone will be able to help me or at least relate............Thanks............",
            "post_id": "1838048",
            "timestamp": "1127883600",
            "user_id": "user_103686",
            "user_link": "/personal_pages/user/103686",
            "votes": "2"
        },
        {
            "answer": "I can relate, although I haven't had children by ceasarean, I did have a c section type incision in 2003 to remove fibroids.  For the past 3 months, I've had incredibly similar sensations of tingling and numbness as you described throughout my body, but particularly in my legs and arms.  I hope the neurologists respond to your question but in the interim, I would recommend you get a referral to neurologist for an office neurological exam and an mri of your brain and cervical spine, preferably w and w/o contrast.  My neurologist had me have a brain mri w & w/o contrast and a cervical mri w/o contrast.  Both were clean, no signs of lesions or tumors, although I'm a little concerned about whether not having contrast on cervical would have missed anything. Regardless, particularly given your mother having ms, it is good to get an mri to make sure that is not a factor. From these forums, you can gather there are a lot of things that cause the sensations you are experiencing, it is important to rule out more serious problems.  I'd be curious to know if c-sections could cause such sensations.  I also know anxiety can make symptoms MUCH worse (as can too much searching on internet!).  Thanks to the doctors and my apologies for intruding on thread!",
            "post_id": "1838049",
            "timestamp": "1127883600",
            "user_id": "user_103512",
            "user_link": "/personal_pages/user/103512",
            "votes": "0"
        },
        {
            "answer": "I forgot to mention that I had gestational diabetes while pregnant.  My sugar has been okay using the home monitoring system.  Although I was on a sugar kick when these problems started, but I have since cut back on sugar and blood sugar levels are okay.  I am still losing baby fat.  According to OBGYN I need to loose 4 more pounds to be within heathly weight range.  Also, I had a really bad cold two weeks prior to numbness/ tingling beginning.  I took bactrium to clear it up because my chest was really congested.  The numbness/tingling sensations are still occuring after infection has cleared up.",
            "post_id": "1838067",
            "timestamp": "1128056400",
            "user_id": "user_103579",
            "user_link": "/personal_pages/user/103579",
            "votes": "0"
        },
        {
            "answer": "WOW...been experiencing the same thing for several years now. Mostly off and on symptoms like face going numb and tingling, different parts of my body going numb etc. But lately getting more and more frequent. At times my legs feel like tree stumps and they just dont want to move. 6 years ago had similar sytoms and Dr's did a series of tests...they thought I had Lupus, but that was negative so they diagnosed me w/ Fibromyalgia & Chronic Fatigue after about 6 months or so the symptoms gradually lessend and for a short time went away...No MRI's were ever done and I am seriously doubting this diagnosis. Within the last year I have been experiencing bouts of forgetfulness and severe fatigue along with numbness in my face and feet that goes away and comes back, Dr. said it was depression and put me on Wellbutrin.(don't know how depression can make the side of your face go numb, but anyways) Not happy with that diagnosis. So have a Dr. appt. this Friday, going to demand he give me a refferal to a Neurologist so that I can try to figure out what is wrong with me. I am so tired of feeling this way. Wish me luck!I'm glad I found this forum...gives me room to vent :o)",
            "post_id": "1838076",
            "timestamp": "1128229200",
            "user_id": "user_104289",
            "user_link": "/personal_pages/user/104289",
            "votes": "0"
        },
        {
            "answer": "Best of luck to you!!!  Thank you for writing in and making me feel normal!!  I, also, feel disoriented and times............I see my Neuro on Friday!!!",
            "post_id": "1838089",
            "timestamp": "1128315600",
            "user_id": "user_103686",
            "user_link": "/personal_pages/user/103686",
            "votes": "0"
        },
        {
            "answer": "I sympothize with your situation. I began tingling in my head and face in June 2005. It was sporadic at first happening only a few times per week. then it would go away for a week or so only to return. Now it's  back, off and on for about two weeks until Friday when I had to go to the Dr. because it was so intense. In june my Dr. told me I had one of two rare cancers, which proved to be false after blood work. Then he told me I became allergic to NORVASC which I discontinued and was not releived of the tingling. I switched Drs and the new one told me I was experiencing stress and prescribed something that made me tired. It didn't relieve the tingling. Now I've been refered to a neurologist. I understand the frustration you feel with no real diagnosis and the fear that comes with the unknown.Good luck to you and I hope you find relief.",
            "post_id": "1838092",
            "timestamp": "1128315600",
            "user_id": "user_104346",
            "user_link": "/personal_pages/user/104346",
            "votes": "0"
        },
        {
            "answer": "hi there, I am also 28 mommy of one (4 months old).  Since my pregnancy, I have been having twitching/stiffness/pain in my body.  Crazy, I tell ya.  I have pain in my legs, back, arms along with tingling in my feet and hands.  I go to a chiropractor and it actually is helping to remove the pressure.  My hip goes out constantly and my leg gets tingly.  I get an adjustment and by evening, I'm good.  (I carry my daughter on my right hip) I saw a neorolgist while I was pregnant and he suspected myotonia congenita or a sodium channelopathy.  I still have to continue testing.  I don't think this is what is going on with you but a trip to the neor is warrented.  My mom has fibromyalgia so it's possible that is what i've got.  No idea.  I can tell you that when I worry and stress over what is wrong with me, I get all kinds of pain and tingling.  Keep us posted.  I'll pray for you.",
            "post_id": "1838100",
            "timestamp": "1128402000",
            "user_id": "user_99738",
            "user_link": "/personal_pages/user/99738",
            "votes": "0"
        },
        {
            "answer": "Went to see PCP yesterday, did a few motor skills tests and he suspects MS. Got me in today for an contrast MRI and an appt. with a Neurologist next Wed. Don't know why he never suspected it earlier...but I guess that I have kinda deteriorated in the last few months. Maybe he did suspect it and thats how he got me in for tests and Neuro appt. so quickley, I dunno. Whatever the reason I am glad that something is finally being done and I will have answers soon.Good Luck to you all!Rena",
            "post_id": "1838106",
            "timestamp": "1128488400",
            "user_id": "user_104289",
            "user_link": "/personal_pages/user/104289",
            "votes": "0"
        },
        {
            "answer": "Oh yeah, I forgot to mention that my left eye is not functioning well either. It's also drifting to the left....what is going on?",
            "post_id": "1838109",
            "timestamp": "1128488400",
            "user_id": "user_104679",
            "user_link": "/personal_pages/user/104679",
            "votes": "0"
        },
        {
            "answer": "Thank you....................I can't wait to go to the Dr's.........I've suffered from deep depression in the past and this is nothing like it..........Now, I'm having periods of time where I feel \"drunk\" and like I'm going to pass out........This is driving me nuts..........Especially because I have not felt depressed until this started happening.  If the Docs say that it's depression because they don't know what it is.........I'll srceam.......I'm to the point where I don't care what it is as long as I know what it is.....................I will pray for all of you.  Thank you!!!  You've given me a \"little\" sense of Peace.",
            "post_id": "1838107",
            "timestamp": "1128488400",
            "user_id": "user_103686",
            "user_link": "/personal_pages/user/103686",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm new here! I just googled \"my face feels numb\" and stumbled across this discussion. Shoot, shoot, shoot....I can so relate. What is going on? Let me first mention that I have been rear ended 6 times, had my head bonked by two very heavy objects, but that was years ago, like over 10 years now. Since then, I have been diagnosed with Fibromyalgia and just this year this awful dizzy feeling started to happen. I feel like I'm going to pass out, can't get a grip on myself, my face feels numb and so on. At first I thought it was just anxiety as I have suffered from it in the past, but I've STARTED taking xanax for it and it doesn't go away. So, I don't think it's just anxiety. Sometimes I feel like I'm going mad from this. I dread waking up, because I know what will I start to feel this. I have since seen a neurologist, an ear, nose and throat doctor and have had a CTscan and an MRI. Every test came back normal. My blood tests were normal. I do have a bulging disc right above my neck bone, forgot the numbers. I get migraines and dizzy spells and I FEEL LIKE I'M GOING CRAZY!!! Please know you are not alone. I am so sorry you all are going through this also. Geri",
            "post_id": "1838108",
            "timestamp": "1128488400",
            "user_id": "user_104679",
            "user_link": "/personal_pages/user/104679",
            "votes": "0"
        },
        {
            "answer": "Oh, my email is ***@****",
            "post_id": "1838133",
            "timestamp": "1128574800",
            "user_id": "user_104679",
            "user_link": "/personal_pages/user/104679",
            "votes": "0"
        },
        {
            "answer": "I'm wondering that myself ( the left eye )..........the dizziness and the feeling of being drunk along with the electronic feeling.  I have not gotten the results of my MRI ( of my lower back w/out contrast)....I figure if it were MS they would have called me..............I just don't know and I too am feeling crazy!!!   My question is this: Could you get a \"clean\" MRI and still have MS...............?? At this point, I just want to know what is going on with me..........I really don't care what it is............I just want to know...........This is horrible and I feel like a horrible person because I just can't function the way that I'm used to................Thank you all for letting me vent and GOD BLESS YOU!!!",
            "post_id": "1838129",
            "timestamp": "1128574800",
            "user_id": "user_103686",
            "user_link": "/personal_pages/user/103686",
            "votes": "0"
        },
        {
            "answer": "I have started to feel better and I was really silly not to remember this fact. Everytime I start to feel extra dizzy, weak and craving sugar, I have a systemic yeast infection. I started taking my yeast buster yesterday and felt better almost immediately. The dizziness is subsiding and I'm able to concentrate better. I'm wondering if any of you are craving sugar, have itchiness in addition to the dizziness and lightheadedness. If so, it's worth checking into, you may have Candida Albicans. Email me personally for more information. I do not work or belong to any type of pyramid nutritional/personal care product company, so this is not a marketing scheme! Take care, Geri",
            "post_id": "1838132",
            "timestamp": "1128574800",
            "user_id": "user_104679",
            "user_link": "/personal_pages/user/104679",
            "votes": "0"
        },
        {
            "answer": "RenaGood luck with your doctors visit and check back in and let us know how it went.",
            "post_id": "1838114",
            "timestamp": "1128661200",
            "user_id": "user_103512",
            "user_link": "/personal_pages/user/103512",
            "votes": "0"
        },
        {
            "answer": "brand new to all this so bear with me!!  Been diagnosed with degenerative disc disease in L-4 and L-5, and having surgery end of Oct.( not soon enough, according to regular M.d., but I'm just a patient)But before all this back problem started ( completely out of the blue,last Oct., 2004). I developed this numbness in my left upper thigh.  Runs from my hip to just above my knee.  Its basically permantly asleep.  Went to a neurosurgeon who did a EMG, and said that it was from a sensory nerve, that could last the rest of my life or suddenly stop.  Well its still asleep and drives me nuts,because, you know its there, but you can't feel it.  I was told by a tech giving the EMG that this happens alot to the elderly, or in plain English, as you get older.For a Doctor out there, especially Neuro, I've had two severe head traumas, including a brain aneurysym in '90!!  Along with all the head traumas and now this back problem could this sensory nerve be connected to all the  current problems???",
            "post_id": "1838123",
            "timestamp": "1128747600",
            "user_id": "user_105154",
            "user_link": "/personal_pages/user/105154",
            "votes": "0"
        },
        {
            "answer": "I am having tingling and numbness in my right arm and leg and then starting this weekend I started getting it in my face, both sides.  I went to the Dr. today and he wants to do an MRI, but I have no insurance!  I don't know what to do!  I'm really scared.  He drew blood and said that we could rule out some things, but he really wants to do the MRI.  I guess I should just do it, huh?",
            "post_id": "1838155",
            "timestamp": "1128920400",
            "user_id": "user_105346",
            "user_link": "/personal_pages/user/105346",
            "votes": "0"
        },
        {
            "answer": "Hello I am a 32 female. I started with severe hip and back pain after the birth of my 1st child. I was then dx with a rare mycobacterial infect. I was tx empirically with antbx for 7 mo I was suppose to cont for 18mo but became pregnant with my 2nd child. About two months ago five mo postpartum I had developed a fever of 103 then about a wk later started with numbness tingling of my legs arms chest and face. The primary area bothered the most is my R hand, it goes numb periodically with weakness of fine motor in that hand. I saw a neuro all labs normal, MRI normal. Years ago an cervical MRI showed a lesion on C4 C5. I dismissed this at the time even though the Dr. seemed concerned questioning wether I have more problems with neck, arms ect. I did not back then. I now continue with pain in my back, arms, legs, but mostly hips especially in humid, damp weather. Heat really aggravates my symptoms. I have been getting what I thought was recurrent conjunctivitis. My Rhuem. wants me to see a opthmalogist to r/o a uveitis. He is thinking a possible inflammatory process which could be associated with the back/hip pain. I am an RN with a med background so I have certain thoughts and dx going through my head. Does anyone have any thoughts, advice??? I want to seek a 2nd opinion from a Nuerologist whom I work with. What could this be???? Thanks so much for any ideas or similar problems...",
            "post_id": "1838149",
            "timestamp": "1128920400",
            "user_id": "user_97946",
            "user_link": "/personal_pages/user/97946",
            "votes": "0"
        },
        {
            "answer": "An MRI can be costly with out insurance but it is your health and that if you can possibly do should be done if your Dr suggest's it. Goodluck.",
            "post_id": "1838160",
            "timestamp": "1129006800",
            "user_id": "user_97946",
            "user_link": "/personal_pages/user/97946",
            "votes": "0"
        },
        {
            "answer": "Yes MRIs are costly, but many places will work out payment plans or work with you based on income.  It definitely is worth it to get some peace of mind about what might be causing your problems. Even if it does end up being MS, there are potential treatments out there to help you cope.  I'm hoping that whatever I may end up finding out about my symptoms that I can at least get something that helps me deal with them better.",
            "post_id": "1838163",
            "timestamp": "1129006800",
            "user_id": "user_103512",
            "user_link": "/personal_pages/user/103512",
            "votes": "0"
        },
        {
            "answer": "WOW!!! Am I ever glad I found this site!!!!  I am a 33 year old female who has been thru a great deal of what you are all describing. All of my symptoms started just after the birth of my first child 2 and a half years ago(via section as well). After some severe complications I came home with my baby and thats when the timgling and numb feelings started in left side and face(left side as well). I was also experiencing postpartum and panic brought on by post traumatic stress from the complications in hospital although I did not know this at teh time. Anyhow, I went to the ER whrethey ruled out stroke and saw a neuro who ordered an evoked potential, MRI, etc and ruled out MS. As soon as all teh tests came back clear, my symptoms seemed to subside. Anyhow, during my pregnancy last summer I experienced the same life threatening problem and went thru a great deal of stress but delivered (via section again) my daughter with no complications. Then the say of her first birthday(3 weeks ago) my left eye started to twitch every 10 minutes and continued to do so for 5 days before pain in the eyeball set in. I saw an eye doctor who ruled out optic neuritis and said that teh problem wan't occular. The next day started with the numbless/tingling in left side all over again, although this time worse than last/ As well there was little shock sensations every few seconds all over my body. The tingling moved over to the right side as well and then in teh same week I experienced a \"feeling\" of weakness in my legs when I was walking and my hamds. AlthoughI felt this weakness I could still physically walk and lift things. I went to teh hiospital because my MD has been away for 3 weeks and at first they thought I had a viral nerve infections and said to come back if it got wores. When I went back a few days later they thought I may have Ebstein Barr and did some blood work that is still not back. Then another doctor told me it may be early MS, and that I need to see a neuro, so he made the referral. Anyhow, it semed like new symptoms were popping up each day. First the eyelid, tehn the pain in eye, then the numbness/tingling, then the shock sensations, then the wierd feelings in my head and the fuzzy thinking. My appt. with the neuro is still not for 6 weeks and I am going nuts here scared to death. There were 3 days whenn I felt I couldn't even function but had no choice bacause of teh babies. My symptoms have seemed to lessen in teh past few day although teh tingling in my face and neck are present as I write this. There has beeen a great deal of emotoional stress on mr for many months preceding this and I wonder if it could all be anxiety/stress related as I was trying to rid myself of some stress. And this episode did start(the eye twitching) after an argument with hubby. Anyhow, if anyone wants to chat about all this please feel free to contact me at ***@****   Thanks and god luck to you all.",
            "post_id": "1838158",
            "timestamp": "1129006800",
            "user_id": "user_103650",
            "user_link": "/personal_pages/user/103650",
            "votes": "0"
        },
        {
            "answer": "I am a 37 year old female and for the past 4 months I have been experiencing tingling and burning sensation in my hands, toes and scalp...It had gone away and now its back again.. The last month or so I feel like someone is pricking me all over my body.. I can go days with no symptoms and then its back again.. I do suffer from migraines and am positive for factor 5 leiden which was discovered wo years  ago after an extremely difficult pregnancy which resulted in preeclampsia..Just wondering if Anyone would know what i could be suffering from?",
            "post_id": "1838185",
            "timestamp": "1129179600",
            "user_id": "user_105703",
            "user_link": "/personal_pages/user/105703",
            "votes": "0"
        },
        {
            "answer": "As you probably can see from reading through posts here, there are a lot of things that could be causing your symptoms.  It is a good idea to visit your regular doctor and see if a visit to a neurologist is warranted for further exam.  Some simple things to consider are anxiety, reaction to an antiobiotic or other medication (I just had a horrendous reaction to Levaquin that worsened my existing tingling and numbness symptoms PLUS added joint and muscle pain which I get to see neurologist about next week).  Also some vitamin deficiences or recovery from flu/infection can cause those sensations.  But you should definitely see a doctor when you are having persistant strange symptoms such as this.",
            "post_id": "1838188",
            "timestamp": "1129266000",
            "user_id": "user_103512",
            "user_link": "/personal_pages/user/103512",
            "votes": "0"
        },
        {
            "answer": "Your internist PCP will refer you to a neurologist if you c/o of sensory symptoms. A side effect of levaquin is joint and bone pain the quinlones cause that. Did you have a rash or other signs of an allergy? Also numbness and tingling can be from a post viral syndrome you are correct. My point in mentioning my infection and my antbx therapy was to show the significance of the infection I was dx with. It is a rare mycobacterial infection 2 of 100,000 people are dx with a yr. that needed long term antbx tx, not that I thought I was having the sensory symptoms from the antbx itself. I would just like to mention that. They used me as a study at a University hospital because they feel I have an underlying autoimmune d/o. I guess, I was questioning has anyone else been in this type of situation from being immunosuppressed after the birth of their child? or Have they been told that birth and labor itself leaves the body in a comprimised state which places you at risk for infection/ virus that could leave you with these types of symptoms. I have been tx with 3 different doctors an Infectious disease Dr., A Rheum, and a Neuro Some things are starting to come together but there are still alot of unanswered questions I wish could be answered. Goodluck again to all of you. I think it can take a long period of time to figure things out.",
            "post_id": "1838196",
            "timestamp": "1129352400",
            "user_id": "user_97946",
            "user_link": "/personal_pages/user/97946",
            "votes": "0"
        },
        {
            "answer": "Hi everyone. I can sympathize with all of you suffering from all these strange sensations! In November of last year, I started experiencing these electric-like shocks and body twitches all over my body. They were not painful at all, but they just felt very weird. I had them in my legs, arms, back, chest, neck, eyes, and lips. I also had tingling sensations EVERYWHERE, even in the occipital(back) part of my head, my face, just everywhere. My legs and arms felt numbed if I sat still in one place for more that 2 minutes. My toes went numbed all the time (walking, standing or laying down). Other symptoms I experienced were burning sensations e/w but mostly in the shins, thighs, and shoulders. The back of my head (inside) felt very cold at times and in my head I kept having these bizarre nerve/ electric shocks-like pains. I was also very dizzy. In the mornings upon awaking, I felt very stiff (in my joints) and swollen all over. I had ringing in the ears. My throat felt very tight all the time, but it did not make it difficult to eat. All these symptoms appeared after taking amoxicillin on three different occasions (in a period of 4 months) or so to treat a  re-occuring strep throat. I have no idea if the medicine had anything to do with my symptoms, but it was the only thing I could think of. By the way, all of these systemic symptoms I have mentioned continue to this day. All my life I've been a super healthy person; not only physically, but mentally as well. I have never had any episodes of anxiety. No depression what so ever, and no major fears or negative thinking. People know me for the super-happy-go-lucky/positive person I am. So these symptoms have nothing to do w/ anxiety or depression.I went to see my general doctor about a week after I experienced my first symptoms (the tingling and burning all over). The doctor did a physical examination and concluded I must have a viral infection. She told me to go home to rest and return in two weeks if I wasn't better. Then, two weeks later I was feeling worse. Same symptoms, but with a lot more intensity. So the doctor ordered a complete blood count. They also checked for thyroid disease, diabetes, lupus, and even certain types of cancers. The results were ALL normal. No signs of a bacterial infection either. The doctor then prescribed advil for my headache, and diagnosed me with \"atypical migranes\". I was furious because I knew that someone with an atypical migrane would not be experiencing all the systemic sensations I was experiencing. But I went home and took a dose of advil every 6 hours to see if that would help. It did NOTHING. The following week, I consulted with another general doctor and she referred me to a neurologist. The neurologist did conduction nerve tests, an MRI of the head and the neck. Results were again all normal. So the neuro ruled out MS and ordered more blood work. They tested me for Hepatitis B & C, HIV (and all poss. STDs), other types of cancer, more tests for lupus, arthritis, heart-related proteins, and a whole bunch of other things. EVERY single thing came back normal! Now, the doctors had no idea what to tell me. THe neuro prescribed some anti-anxiety medicine to treat restless leg syndrome ( but this would not explain all my other symptoms), I went home and took the med for 10 days anyway. The medicine didnot do anything to treat my symptoms, but it did give me some bad side-effects. So neuro took me off the med. and reffered me to a rheumatologist because he thought I may have an auto-immune disease. The rheumatologist saw me twice and did a WHOLE bunch of more blood tests. They ALL came back normal. Everyone was puzzled. Thankfully, none of the doctors blamed my mind (thought I was crazy) and kept searching for possible explanations. After seeing about 6 different doctors, my rheumatologist finally diagnosed me with fibromalgia, although he did tell me I was a rare case since I did not have those tender spots that people with fibro usually have. I'm afraid now the doctor just wanted to put a name to all of my symptoms, and that I really do not have fibromalgia. I keep reading books about it, and it just doesn't make sense to me that I have fibro. Like I said before, I am a very happy and positive kind of person, and though I know the doctors have not yet found a real explanation to all of my bizarre symptoms, I go about life with a positive attitude and try to enjoy and make the best of every single day. To all of you who are going through a similar situation, please do not dispair! It is very important that you keep searching for possible explanations. But if you do not find them, then try alternative routes. Do yoga, eat healthy, exercise, socialize, try acupuncture, homeopathic remedies, etc. The point is to feel like you are doing something for yourself (when traditional medicine has let you down). Good luck to all of you. I'd love to hear from anyone with similar symptoms. Thank you!",
            "post_id": "1838278",
            "timestamp": "1129870800",
            "user_id": "user_106728",
            "user_link": "/personal_pages/user/106728",
            "votes": "0"
        },
        {
            "answer": "Do not know how to start a new question to hear from an Md. I see this falls under comments from original question. How do I do that.?",
            "post_id": "1838312",
            "timestamp": "1130216400",
            "user_id": "user_107458",
            "user_link": "/personal_pages/user/107458",
            "votes": "0"
        },
        {
            "answer": "I have numbness and tingling mostly in the top of my head, the past 2 days haveing severe headache.  Have tenderness in temple regions. Also having face burning and cheek bone discomfort.  Sinuses seem clear and no congestion.  I was thinking about going to chiropractor, and also starting a refill antibiotic. Last sinus infection about 6mounths ago.  Although this does not seem like an infection.  I have no fever.  I was diagnosed with fibromyalgia several years ago but general discomfort seems managed with cymbalta.  I take 30mg/60mg alternating days. Can someone help me with where to start with this numbess and tingling pain in my head.",
            "post_id": "1838311",
            "timestamp": "1130216400",
            "user_id": "user_107458",
            "user_link": "/personal_pages/user/107458",
            "votes": "0"
        },
        {
            "answer": "In August we were in Lk. George NY when we returned I became very ill with a high fever, weakness and sore throat. A few weeks later I did not feel better. In the middle of September one of my son's had a high fever, weak, sore throat. I took him to the doctor, he did a strep test, it was negative. He said it was viral. He continued to feel worst. The week after he was sick, I got very weak, couldn't walk, tired etc. I went to my doctor he said it was also viral. One day after that we both took Echinechea to maybe speed up the immune system. The day after that we both got weak, tired, sore muscles, headaches, tingling sensations all over, numbness, uncoordinated, lower back pain, joint pain all over, stiff neck and daily dizziness. I took both of us to infectious disease doctors. Both doctors ran many, many tests, all tests came of negative. We were told if the symptoms get worst to see a Neurologist. (I did see one earlier for a quickie reflex test, doctor said he didn't believe it to be neurological in origin. My son's doctor did many relfex tests also and he passed. We were told if the symptoms are slowly leaving the body no need to see a neurologist. If the symptoms are getting worst definately investigate further. The symptoms have subsided we are left with occasional symptoms. However, both of us have just been diagnosed with sinus infections. We are both on Biaxin. I feel 100% better since the antibiotics. My son feels better too. I wonder if what wwe had was not viral at all and maybe a bacteria which started all this. Also, both doctors said there are thousands of viruses that there are no tests for and no names for. We were diagnosed with post viral syndrome which could last a few months or years. I no longer believe that doctors are using a cop out when they say it's a virus. But I do believe that our virus was bacterial in nature and we should have been given antibiotics. Unfortunately, we may never really know what caused this, that is the frustrating part for us. Also, I highly doubt both of us came down with MS at the same time. I no longer worry about it, I take life as it comes. Many not so bad illnesses can cause tingling and numbness such as Hashimotos Thyroiditis, Viruses, Flus, Sinusitis, Back and Neck problems, Stress, Migraines, Lyme Diease, even too many of a certain vitamin like B6 or selenium can cause these symptoms, diabetes too. Zinc and herbs can do things too. We try not to pay so much attention to the symptoms unless they get worst. Good luck to all. Feel free to comment.",
            "post_id": "1838345",
            "timestamp": "1130475600",
            "user_id": "user_107919",
            "user_link": "/personal_pages/user/107919",
            "votes": "0"
        },
        {
            "answer": "I am 38 years old and have been experiencing painful tingling and burning sensations throughout my body.  It started in April 2005.  The tingling was sporadic at first, then it progressed.  The pain is on my arms, legs, fingers, toes, cheeks, forehead, lips, tongue, etc.  I went to my physican and was put on neurotin and that is not working.  I was going to physical therapy twice a week for a month and that did not help either.  I have gotten bloodwork done and everything is normal.  I gotten a MRI of my brain and that was normal.  I have an appointment with a neuroligist on November 28th.  The sad thing is the appointment was made in September.  I have tried to get appointments with several neuroligists and I cannot get in any sooner.  I am sensitive to sound.  I cannot go to a restaurant because when I hear the music, the tingling starts.  I cannot go to a theatre or listen to the radio.  There are times when I cannot watch television because of the sound. I get tingling, itchy feeling around my eyes.  It is so frustrating.  I awake every morning to tingling sensations.  Any advice as to what I can do until I see the neuroligist would be very helpful.  Thanks and bunch!",
            "post_id": "1838371",
            "timestamp": "1130562000",
            "user_id": "user_107961",
            "user_link": "/personal_pages/user/107961",
            "votes": "0"
        },
        {
            "answer": "I had really bad anxiety a couple years ago, and after taking a medication (celexa)for about a month I stopped and the anxiety seemed to subside.  Recently (about a month and a half ago)the anxiety has come back full force.  I have been to the emergency room about 3 times now for it thinking I was having a heart attack...they did an ekg, blood count everything was fine.  I'm pretty sure after they told me everything on that end was fine, I found out I was pregnant and started experiencing, what I think to be anxiety from the chest up.  I;ve had tingling in my hands and face, mostly on my left side but then it will move.  I am only 22 and am scared that if I see a neurologist they will tell me something is wrong.  I started becomming very anxious I think when I got pregnant and am hoping that its just the pregnancy that is making it happen?  I can feel tension in the back of my neck that kind of makes my head shake when I try to focus on something.  I was at church last night trying to watch the pastor and it was happening, then the numbness in my forehead?  Can anyone advise me?Thank you",
            "post_id": "1838387",
            "timestamp": "1130648400",
            "user_id": "user_108206",
            "user_link": "/personal_pages/user/108206",
            "votes": "0"
        },
        {
            "answer": "IM SOO GLAD WE HAVE THE INTERNET. THANK GOD IM NOT ALONE.GOSH I FEEL LIKE IM GOING CRAZY TOO, LAST NIGHT I WOKE UP WITH NUMBING AND TINGLY BURNING SENSATIONS IN MY RIGHT ARM AND HAND.THIS IS NOT THE FIRST TIME THIS HAS HAPPENED. THEN TODAY I WAS GETTING THESE WEIRD ELECTRIC LIKE SHOCKS IN MY WHOLE BODY, IT WAS SOO WEIRD, I HAD THIS BEFORE BUT THAT WAS WHEN I WENT COLD TURKEY OFF MY MEDS BUT THIS TIME IM ON MY MEDS AND THIS IS HAPPENING SO I DONT KNOW WHAT THE HECK IS WRONG W/ ME.AND THE PAST WEEK ALSO I'VE BEEN HAVING THIS WEIRD SWOOSHING NOISE IN MY RIGHT EAR AND I ONLY HEAR IT AT NIGHT WHEN ALL IS CALM LIKE NOW. I HAVENT WENT FOR ANY TESTING YET BUT IM GOING TO GO SEE MY DOC TO SEE WHATS WRONG W/ ME. PLEASE PRAY FOR ME.I JUST KEEP WONDERING WHEN I HAVE THESE FEELINGS, AM I GOING TO PASS OUT OR DIE FROM THIS?    JOHNA",
            "post_id": "1838451",
            "timestamp": "1130824800",
            "user_id": "user_108381",
            "user_link": "/personal_pages/user/108381",
            "votes": "0"
        },
        {
            "answer": "Hi all,I know exactly how you all feel. I too have been experiencing constant tingling and numbness in my hands/arms and feet/legs. I have been sick now for several months, had all sorts of blood work done and all that came back fine except for elevated white blood cells which were attributable to a viral infection. My biggest symptom was SEVERE fatigue, could not get out of bed for a week. After a complete examination by an ER doctor I was told I had 'post viral fatigue' and that slowly I should start getting better. I did for a week and now I have this tingling and numbness and the fatigue has returned. The whole time no one has even suggested a MRI and Im so scared that I could have MS.But, my only symptom that makes me think MS is the numbness/tingling. I only have slight visual disturbances which manifest themselves as eye discomfort (not focussing issues)and sometimes when I go out grocery shopping my legs get heavy and I feel tired. However I have also been told that numbness/tingling is a side effect of post viral fatigue. Anyone else in a similar situation???I hope all goes well Rena, and keep us posted on the outcome.",
            "post_id": "1838516",
            "timestamp": "1131343200",
            "user_id": "user_104716",
            "user_link": "/personal_pages/user/104716",
            "votes": "0"
        },
        {
            "answer": "My twelve year old son and I have been sick, as you say since August of this year. We've been to regular MD's, eye doctor's, infectious diease doctor's and all the blood work comes back normal. I've seen a neuro for a quickie reflex test, watched me walk, talked to me and said he did not believe the problem was neurological in origin. We have joint pain all over, tingling or what you would call quick starburst type of sensations all over even on the back of our heads. We had headaches, fatigue, low grade fevers from time to time. We were tested for Lyme among many other tests, all negative. Both my infectious disease doctor and mine said as long as the symptoms are not getting worst and they are slowly leaving the body they beleive it to be post viral syndrome. If the symptoms get worst or plateau they suggest seeing a neuro. Slowly we are getting energy back. We were told that it could take two months or maybe a year. I also have Hashimoto's Thyroiditis which could cause these symptoms, my son however, does not. Our symptoms came on around the same time. We both noticed that when we are active we don't notice them as much. In fact I wonder sometimes are we concentrating on them? Both of us were sick for a while with a virus prior to these symptoms. The majority of symptoms came two weeks after being sick and have lingered till today. After all these symptoms I did much research on MS and it is not the death sentence I made it out to be. Of course we don't want MS however, I don't believe I am as scared as I once was. Over 70% of people never need a wheelchair. Many times patients use canes, braces and chairs to battle fatigue and help them get around. Don't be so afraid, we are all going throught he same thing. We are here for each other. Talking is a great way to feel better. Feel free to email.",
            "post_id": "1838503",
            "timestamp": "1131429600",
            "user_id": "user_107919",
            "user_link": "/personal_pages/user/107919",
            "votes": "0"
        },
        {
            "answer": "Hey dreamlife,sorry to hear of your problems as well, i understand exactly where you are coming from. In the past 4 months I have been to 4 GP's, optomertrist, ER twice, a ENT specialist and my own GP about 5 times. Its interesting that some days I feel great and people tell me how well I look and then I have these days where it is a struggle just to get out of bed and no one understands, people think im lazy. I live with my parents and they are always worried about me, especially when I get home from work at 5.00 and then im in bed by 7pm. I keep thinking that the worse thing I ever did was google my symptoms, for several weeks I was CONVINCED 100% that I had a brain tumor and now I am convinced that i have MS. Its funny you seem to look at the symptoms and then say to yourself, \"well two weeks ago I noticed that I had this, and this and this\" and you convince yourself that you are sicker than you probably are. I have now convinced myself that i have urinary frequency and urgency (another symptom of MS) becuase I go to the toilet about every 2 hours during the day, but then I realise that I have done this my whole life!!!!I guess my only worry is that having a tingling sensation in the extremeties is NOT normal and that it indicates something no matter how minor or major is wrong. But its funny because the whole time I have been writing this I have not had any tingling sensations, as soon as I thought about it I noticed that i do!! Strange.....If you want to discuss  any problems further I am more than happy to hear from people in a similar situation (in fact I want to, so i know that I am not abnormal) please email me at ***@****",
            "post_id": "1838525",
            "timestamp": "1131516000",
            "user_id": "user_104716",
            "user_link": "/personal_pages/user/104716",
            "votes": "0"
        },
        {
            "answer": "Hi everyone;I am going through the same thing! But mine has been going on for TEN YEARS. It all started in 1996 with slight tingling in my fingers, and some numbness in 2 fingertips. I was just out of college, starting my new job, etc, and didn't even know about MS. I blew it off, but when the tingling and numbness recurred over the years in my feet, toes, hands, and legs, I picked a nuero out of the yelow pages in 1999 (big mistake!). First he told me I had \"female hysteria\" (ya gotta love that), and then he called me THREE MONTHS LATER, at work nonetheless, and said \"I reviewed your MRI again and actually think you have MS. We need to start you on medication right away.\" This was over the phone, at my job. He was a real winner.I immediately sought a second opinion--and saw a specialist at the Cleveland Clinic's Mellen Center. He was wonderful--and also said \"absolutely NOT MS.\" At that point, according to the Cleveland Clinic, I had a very normal MRI (brain and spine), borderline VEPs (108 and 112), and normal evoked potentials. They explained the VEPs as possibly caused by my astigmatism, and said they weren't delayed enough to be concerning.Over the years, my sx continued to wax and wane: a small spot of numbness on the bottom of my foot would last a month, then disappear. My palm would burn for a few weeks. A small tingle in my face. I live in Seattle, where the MS Centers are excellent, and have been seeing the Director of an MS Center here since 2001. I have had 3 more MRIs of brain and spine, all clear. My VEPs remain mildly abnormal, though I have never had optic neuritis. This summer, I had what seems to be my first real exacerbation--it all started in August, and is STILL going on--lots of patchy numbness, tingling, in feet, legs, hands and face, mostly on the right side of my body-- and this time, fatigue that feels like 10 trucks hit me and then backed up to park on me. I repeated all tests (normal), including b12, lyme, thyroid, and now I have my first LP scheduled in a few weeks.My neuro is evasive about answering me directly. She calls this \"very possibly MS,\" but when I asked what this could be if NOT MS, she had no answer. With clear and stable MRIs of brain and spine over 10 years, I am somewhat reassured, yet my symptoms are classic MS and can be explained by nothing else. Grrrr. So frustrated, so hard to live with such uncertainty. I am female, 31, about to get married. I like my job, eat well, exercise, take supplements, and do everything I can to minimize stress in my life. I am doing acupuncture, yoga, gentle chiropractic work, and meditation. What else can I do???Is anyone else in a similar situation? Sorry this post is so long--I am just tired of living with this \"probably MS but we may not know until it gets really bad and shows up\" condition.",
            "post_id": "1838555",
            "timestamp": "1131602400",
            "user_id": "user_104646",
            "user_link": "/personal_pages/user/104646",
            "votes": "0"
        },
        {
            "answer": "Hi again,I forgot to say that 2 months ago I also started getting these round red crusty patches on my skin. I've had 1 on my shin and 3 on my upper arm, and not at the same time. Each came out one at a time and lasted about 10 days.Thanx,Neen",
            "post_id": "1838570",
            "timestamp": "1131688800",
            "user_id": "user_109884",
            "user_link": "/personal_pages/user/109884",
            "votes": "0"
        },
        {
            "answer": "Hi,I'm new here and I can't beleive there's others like me! I thought that I was going crazy! My Symptoms started 4 years ago.I started having slight numbness in my arms and legs. I freaked and thought I was having a stroke so I went to the ER. All test came back ok. I felt like a jerk for going. As the years went by I still got my 2 or 3 migraines a year. This feeling would not go away. I just got worse. I have suffered from Vertigo since 1992 and would get attacks about 1 time a year lasting 1 day to a week. I also had hearing loss over the years. I started having severe back pain in 2002 and taking alot of pain meds. I decided in 2004 to have my back fused in July. Everything went great. My symptoms seem to be gone while I was on pain meds. By August I was off all meds except for Birth control. I got severe vertigo that lasted for 1 month. I also lost 80% of hearing in my right ear and 25% in my left. So I now at 40 were hearing aids in both ears. The numbness and tingle has spread to my face and seems to move around. I have felt so sick and tired for a year I can't stand it. I have had several MRI's in the past 3 years of my brain I glow! I went to my Neurolgist, he just scratched his head. All MRIs and test came back negative. Then I started having weird feeling in my eyes. Eye Dr. said things look good.I went back to my Neuro, he sent me to the Cleveland Clinic.Went through more test. All came back NEGATIVE! That was in March of this year, so I gave up and am coping with whatever this is. The Cleveland Clinc said it's probably stress. STRESS!I have no stress. I have an easy life! Now what? I am so tired of feeling the Numbness, Tingles, Severe Fatigue, Tightness in my muscles, Sick feeling, Eyeballs feeling weird, Shoulders and neck hurting and tension headaches.I'm so glad I found you guys. Hopefully someone will give us an answer.Thanx 4 listining,Neen2",
            "post_id": "1838595",
            "timestamp": "1131688800",
            "user_id": "user_109884",
            "user_link": "/personal_pages/user/109884",
            "votes": "0"
        },
        {
            "answer": "Hi everybody.I am an older man age 69 and have been in good health up to now. A few weeks ago I started to have a tingling sensation in my right hand and right side of my neck and face. I also am starting to have headaches at times, although not severe. I do have a few tender spots on my lower right leg down by the ankle area. I am wondering if I should see a neurologist, an internist or a orthopod. Could this perhaps be MS? And if so just how bad is MS and can it be controlled? Anyone out there have any suggestions to offer up?Dave in WV",
            "post_id": "1838574",
            "timestamp": "1131775200",
            "user_id": "user_110237",
            "user_link": "/personal_pages/user/110237",
            "votes": "0"
        },
        {
            "answer": "A related discussion,/posts/show/509255was started.",
            "post_id": "2861807",
            "timestamp": "1209849535",
            "user_id": "user_497520",
            "user_link": "/personal_pages/user/497520",
            "votes": "0"
        },
        {
            "answer": "A related discussion,/posts/show/604245was started.",
            "post_id": "3306380",
            "timestamp": "1219288165",
            "user_id": "user_596029",
            "user_link": "/personal_pages/user/596029",
            "votes": "0"
        },
        {
            "answer": "A related discussion,/posts/show/1187804was started.",
            "post_id": "5436204",
            "timestamp": "1267720131",
            "user_id": "user_1233610",
            "user_link": "/personal_pages/user/1233610",
            "votes": "0"
        },
        {
            "answer": "A related discussion,/posts/show/1478631was started.",
            "post_id": "6722574",
            "timestamp": "1299762269",
            "user_id": "user_1625646",
            "user_link": "/personal_pages/user/1625646",
            "votes": "0"
        }
    ],
    "post_id": "1820233",
    "question": "I am a 28 year old stay at home mom of two.  Both births were done by caesaran.  For five weeks I have been experiencing numbness and tingling.  The numbness and tingling started in lower arms and legs and has progressively spread to entire arms and legs.  Also I feel tingling on the top of my head and sometimes the sides of my face.  A couple of days ago the left side of my face including left nostril went numb for a few minutes like I was getting a cavity filled.  This happed twice in the same day.  When I sneeze I feel tingling all over.  Sometimes the tingling feels like electric shocks and pins and needles.  My youngest is almost 10 months old and weighs 26 lbs.  I hold him on my left side.  On a daily basis a have a traveling numbness/pins and needles pain from the right side of my chest up to my shoulder and down to above the center of my back. All of my symptoms are progressively getting worse and getting my intense.  The past few days when my baby lays on my arm it has been \"falling asleep\" and this never happened before.  I don't think fatique or stress is causing symptoms because I am more rested now than I have been in months.  My PCP suggest a MRI but I have read that different things can cause symptoms.  My mother has MS.  Also my symptoms occur in motion and at rest.  Thank you for any advice you can give me.",
    "timestamp": "1127797200",
    "title": "Tingling and Numbness",
    "user_id": "user_103579",
    "user_link": "/personal_pages/user/103579"
}