{
    "answers": [
        {
            "answer": "I have hypothyroidism and have 4 chidren. Lost several but they also didn't know I had it until after the birth of my 2nd. So take comfort in the fact that they are working to regulate the hormones, and a little tip: stressing too severely will keep the hormones messed up, and wou'll have a problem getting them regulated! Also, there is a woman on this forum that is in , I believe, her 2nd trimester now, who has hypothroidism. I am almost certain that she will respond to you. Good luck, you will suceed at this, I'm sure! Just take the meds,and try not to stress too much!",
            "post_id": "1102704",
            "timestamp": "1086152400",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "LOL I wonder if Stinasmom is referring to me!! ;)Yes I too have hypothyroidism and have had 2 m/c, but that was before it was noticed and treated. I got pg with this one and it was noticed and treated ASAP!  I am now on med's for it and my preg has progressed beautifully.Just be sure to let your OB know when you go in for your first OB visit that you do have it so that your levels can be monitered regularly. My OB tests me every 4-6 wks. He said that during pregnancy, thye fluctuate alot.Good luck and don't stress!",
            "post_id": "1102711",
            "timestamp": "1086152400",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "Oh that gives me great hope and I def. wont stress. I am a teacher and will have the summer off soon. Once the 6 weeks is up and my levels are ok We will begin trying and I will have less stress with the time off and all. This is our 1st and we have been married for 1 year this June 14 so we are looking forward to starting our family.I have another question. Have you been extremely tired during your pregnancy? I have been reading that you can have some side effects during the pregnancy. I cannot wait for the OK.Actually, I have another question. Since you were Hypothyroid and didnt know it, were you missing your periods? or did you not have that symptom? I went off the pill last Septemeber and have had only 2 periods since. Since I have been on meds for 6 weeks I still have not had one so I am getting worried.",
            "post_id": "1102726",
            "timestamp": "1086152400",
            "user_id": "user_70872",
            "user_link": "/personal_pages/user/70872",
            "votes": "0"
        },
        {
            "answer": "Yes, your thyroid will affect your periods. I actually went 6 years without one but then they increased my synthroid and they started again! I swore it was ALL menopause!",
            "post_id": "1102730",
            "timestamp": "1086152400",
            "user_id": "user_67496",
            "user_link": "/personal_pages/user/67496",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroid and 1 dd (21mo).  I had one miscarriage and it took us two years to conceive dd(dear daughter).  I didn't know I had any problems, but had I known and been medicated I wouldn't have had such a long wait to meet her.  They put me on synthroid (I have recently switched to armour thyroid) immediately and everything went find.  As long as you are being cared for, your baby should be absolutely fine when you do get pg.  It may take you a little while to actually get pg and I highly recommend charting your temperature and checking your cervical mucus and cervix position--it can greatly increase your chances of getting pg sooner.good luck!Sarah",
            "post_id": "1102763",
            "timestamp": "1086238800",
            "user_id": "user_70865",
            "user_link": "/personal_pages/user/70865",
            "votes": "0"
        },
        {
            "answer": "My cousin has hypothyroidism and she is on her 3rd child.  She had a baby last July and 2 months later discovered that she had it and a month later (3 months after her 2nd was born) she got pregnant with her third.  She said her cycle was a bit messed up but it could have been because she was breastfeeding.",
            "post_id": "1102767",
            "timestamp": "1086238800",
            "user_id": "user_22533",
            "user_link": "/personal_pages/user/22533",
            "votes": "0"
        },
        {
            "answer": "HiI had a little girl almost 3yrs ago (pregnant first time of trying) and was diagnosed as hypothyroid about 7 months after her birth with a TSH of 107. As soon as I knew I was started on thryroxine as advised by my GP and an endocrinologist and this was gradually increased until my TSH was around 2 and well within the normal range (this took over a year). I was then given the go ahead to get pregnant but it took over 10 months. I was also anxious that I may not be able to get pregnant.Since being pregnant my Thyroxine has been increased from 200 to 225 mcg daily and I have regular blood tests. I am now about 33 wks and I am hoping for a normal? birth! I have not had any pregnancy problems related to the hypothyroidism although this has been a more uncomfortable pregnancy than the last and I have developed fairly extensive excema.I have recently moved house and my new Local Health Authority does not deem it necessary to see an endocrinologist while pregant so a midwife does the blood tests.",
            "post_id": "1103774",
            "timestamp": "1087707600",
            "user_id": "user_71981",
            "user_link": "/personal_pages/user/71981",
            "votes": "0"
        },
        {
            "answer": "what is hypothrodism and how odes it work ? ? ?",
            "post_id": "1104388",
            "timestamp": "1088312400",
            "user_id": "user_72317",
            "user_link": "/personal_pages/user/72317",
            "votes": "0"
        },
        {
            "answer": "I am hypothyroid for 3.5 years and now I am 6 weeks pregnant.The main thing is to bring your TSH and T4 wihtin normal range.Does anybody know  what the TSH should be in the first trimester?Good luck to you",
            "post_id": "1104481",
            "timestamp": "1088398800",
            "user_id": "user_72442",
            "user_link": "/personal_pages/user/72442",
            "votes": "0"
        },
        {
            "answer": "sdfgd",
            "post_id": "1108888",
            "timestamp": "1093410000",
            "user_id": "user_75570",
            "user_link": "/personal_pages/user/75570",
            "votes": "0"
        },
        {
            "answer": "Hi! im new to this site, but not new to hypothyroidism! im only 20yrs old i have not had a regular period since i was 17, ever since then i get it rarly but know it's been a yaer i haven't gotten anything, anyway, i've been married for one year already and no baby, the dr. put me on some rx for my thyroid and to get my period, well i took the 2mth supply and got my period for two months that was back in october of last year, not preg. now he stopped my rx for thyroid and put me on weight loss pills?!?!? he asaid i should loose weight before i try and get pregnant?!?!? is this true? well i really want a baby but i figure if you don;t have a period you don't have eggs and you can't get pregnant. true right?? am i wasting my time hoping to get pregnant or do you think i should keep with the faith?also has anybody else gained weight fast with their hypothyroidism, cause i gained 60lb in 2 yrs and i was never big, and could never gain weight that fast. but i was always able to loose wight fast if i gained like 10 lbs, but know @ 210lbs and with the pills i have lost weight, but i still always feel tired and lazy? am i the only one??",
            "post_id": "1108887",
            "timestamp": "1093410000",
            "user_id": "user_75570",
            "user_link": "/personal_pages/user/75570",
            "votes": "0"
        },
        {
            "answer": "I am 21 years old and have had hypothyroidism for almost 2 years. I have never had a regular period. Me and my husband are trying to have a baby, but I don't know if I can with my period so messed up. It was March 2003 when I had my last one. Is it possible to get pregnant under these circumstances?",
            "post_id": "1111060",
            "timestamp": "1096434000",
            "user_id": "user_77626",
            "user_link": "/personal_pages/user/77626",
            "votes": "0"
        },
        {
            "answer": "I'm so glad I got this website!  I was diagnosed with hypothyroidism when I was about 10-years-old.  I am now 18 going on 19-years-old and have not had a period since I was 15.  When I did have that period, though, it was just for a few days and for only that ONE month.  I am obese, but is that the reason for no period?  I have been on Synthroid forever, but it has never regulated my cycle.  For some reason, I cannot have my mgs. too high because if they are I tend to feel very sick.  Right now I'm only taking 25mg. because even 50mg will make me feel disgusting!  It's very frustrating! :(  If anyone would like to add me on Yahoo! Messanger to discuss more about this topic, feel free to add me!  My user ID is:  skrinkle25       My name is Ashley :)",
            "post_id": "1855524",
            "timestamp": "1188918581",
            "user_id": "user_268617",
            "user_link": "/personal_pages/user/268617",
            "votes": "0"
        },
        {
            "answer": "Ashley, what kind of doctor has been managing your disease all these years?  A normal endo or a pediatric one?  What was the cause, do they know?  Being overweight by extensive pounds can stop periods (just as being too thin can).  Perhaps they can try a new medication?  Do you exercise?",
            "post_id": "1856116",
            "timestamp": "1188932612",
            "user_id": "user_175662",
            "user_link": "/personal_pages/user/175662",
            "votes": "0"
        },
        {
            "answer": "I am 31 yrs and two years ago after trying for seven years i got pregnant.   Four month into my pregnancy i had a miscarriage my husband and i were devastated.   I found out one year later that i have hyppthyroid.   I am now on medication eltroxine.   My husband and i have been trying for two years and have not conceived as yet.   Is there anyone who is experiencing the same problem?",
            "post_id": "1935474",
            "timestamp": "1191098655",
            "user_id": "user_288320",
            "user_link": "/personal_pages/user/288320",
            "votes": "0"
        },
        {
            "answer": "I AM 24 YEARS OLD, AND I AHVE A 4 YEAR OLD SON. I HAVE BEEN TRYING TO GET PREGNANT AGAIN BUT NOT HAVING ANY SUCCESS. I AM TRYING SO HARD TO LOSE WEIGHT BUT I AM VERY STRESSED AND NOT VERY MOTIVATED. WHAT CAN I DO?",
            "post_id": "1946408",
            "timestamp": "1191382815",
            "user_id": "user_290885",
            "user_link": "/personal_pages/user/290885",
            "votes": "0"
        },
        {
            "answer": "I am 24 years old and a year ago i found out i have Hashimotos disease which then turned into Hypothyroidism... my husband and i found out a yr ago we were pregnant and then at my first docs app. found out the baby didnt survive... i have had the hardest time keepin track with taking my medication.... some months i never miss a day and others its like my brain is fried and i cant remember for the life of me.... my husband and i were talking about going to the doc to talk about upping my dose for a while just so that in the next 4 months or some i can get pregnant again.... does anyone have any advice on how much dosage i should take for a safe pregnancy and how long i should be taking it before we try to get pregnant.. im going to talk to my doc about it but i cant get in for another 3 weeks.... so if anyone has any advice, i would appreciate it.",
            "post_id": "1987462",
            "timestamp": "1192498361",
            "user_id": "user_301595",
            "user_link": "/personal_pages/user/301595",
            "votes": "0"
        },
        {
            "answer": "Does anyone on this post with treated hypothyroidism chart your basal body temperatures each morning? I have been struggling with Hashimoto's for the last 2 years, and every couple months have to keep increasing my thyroid medication because the numbers get in the OK range and then TSH starts to climb up again. I've read that I will be able to conceive once getting my thyroid condition under control, however, my basal body temperature is EXTREMELY low with barely and increase after ovulation. I go from about 96.3 to 96.8 degrees pre-ovulation to right around 97.0-97.2 degrees post-ovulation. I'm seeing an endochrinologist in three weeks, but I was wondering if anyone who has successfully conceived has  temperatures in this low of a range? Please write back and let me know where your BBT's are at! Thanks a ton =)",
            "post_id": "2033759",
            "timestamp": "1193524073",
            "user_id": "user_315292",
            "user_link": "/personal_pages/user/315292",
            "votes": "0"
        },
        {
            "answer": "I also have Hashimotos disease with hypo..... We have been TTC for 3 years and finally got pg, naturally (after 7 IUI's and 3 IVF's!!!).... I am on Synthroid and get my levels checked every month.... I am now in my second trimester too!!! I am actually 15 weeks and feel pretty good.... I also have other issues as well....MTHFR...so taking lovenox shots and projesterone too....good luck to all you girls...it will happen for you too!!!  Jacquie",
            "post_id": "2033839",
            "timestamp": "1193526175",
            "user_id": "user_143166",
            "user_link": "/personal_pages/user/143166",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroid and trying to conceive for last 4 months. no luck. my TSH is 5.36 and it is under normal range. I had a pelvis ultrasound and everything is normal except that I have a tipped uterus. My doctor said tipped uterus won't affect fertility. I am really frustrated that I can't get pregnant. Does any one know if my TSH(5.36) is too high to get pregnant?",
            "post_id": "2396568",
            "timestamp": "1201065156",
            "user_id": "user_396620",
            "user_link": "/personal_pages/user/396620",
            "votes": "0"
        },
        {
            "answer": "I have bee seeing an endochrinologist about my hypothyroid issue and asked her why it can lead to fertility problems as I have been trying to get pg for over a year and a half. She said the problem is when the hypothyroidism causes you to stop ovulating, but ideally you want to get your TSH down to about 2 and keep it there. I know a lot of lab reports will say that 5.3 is OK, but I guess some Drs. think that is still too high. On another note, she did tell me that she has had patients who accidentally got pregnant with VERY high TSH levels (above 100) - which of course is not idea. It does however show that it is possible I guess, so 5 shouldn't be unreasonable.Hopefully we will both have good luck very soon! =) Staphylea",
            "post_id": "2402914",
            "timestamp": "1201150628",
            "user_id": "user_315292",
            "user_link": "/personal_pages/user/315292",
            "votes": "0"
        },
        {
            "answer": "hey i have thyroid disease and i have been trying for ever now but the doctors told me that there is a 99% chance i wont be able to have any kids but she told me that if i ever get pregnant then most likely there would be something wrong with my baby and i would have to get a shot like once every week.. don't get me wrong i love kids but i don't think i would want to put a kid through that you know help problem well i hope i helped you out byefrom Kristy",
            "post_id": "2406750",
            "timestamp": "1201210544",
            "user_id": "user_398447",
            "user_link": "/personal_pages/user/398447",
            "votes": "0"
        },
        {
            "answer": "Hi there, I'm new to this and a little confused.  My doctor just told me yesterday that I have hypothyroid, my TSH level is 12.4 which is \"very high\" and my husband and I should immediately stop trying to get pregnant because we will most likely miscarry if we can even manage to conceive.  We have been trying for 4 months with no luck and no periods.  It sounds like some of you have had levels waaaay higher than that though and have managed to concieve and even carry to term.  How long after you start taking the meds daily do you start to ovulate again?  And does this mean that 12.4 is not really a big deal and may take less time to bring back to normal?from Leslie28",
            "post_id": "2469712",
            "timestamp": "1202228525",
            "user_id": "user_410312",
            "user_link": "/personal_pages/user/410312",
            "votes": "0"
        },
        {
            "answer": "I am amazed at the different doctor's information stated on some of these postings.  I have hypothyroidism, as well as three of my sisters.  Both of my older sisters have had it for years and have had healthy, beautiful children (after being diagnosed and on meds).  I have been on meds for almost 1 1/2 years and have been trying to get pregnant for almost the same length of time.  I have had two miscarriages.  My personal opinion (and by some of your postings some of you feel the same way) it's just a matter of time before your body adjusts to the meds and starts functioning properly again.  So I say, good luck to all of you that want to get pregnant and try to enjoy the trying!",
            "post_id": "2697606",
            "timestamp": "1206580179",
            "user_id": "user_462179",
            "user_link": "/personal_pages/user/462179",
            "votes": "0"
        },
        {
            "answer": "Your TSH is too high and your dosage needs to be upped. Most labs still use the old levels of normal TSH from 1-5, but that information is outdated, and has changed. The American Thyroid Assoication has come out with a new \"high \" TSH range. Anything above a 3 is too high and needs treatment, or med re-adjustment. Most endo's want your levels to be between .2 and 2, but no higher than 2. Most endo's now want you as close to the .2 as you can get without going hyper.I'm 34 and have hypothyroid. Mine was diagnosed 1 yr after the birth of my son. (normal pregnancy, and delievery, however i was unable to maintain a milk supply and had to stop Breastfeeding. it was determined that i probably had undiagnosed hypothyroidism soon after his birth, thus the reason for the lower milk supply.) I have been on meds for the last 2 yrs, and it took almost that long for me to get properly adjusted. I'm seen every 6 months now for blood draws to make sure that my levels stay at a good range. ON my last draw, my TSH were 0.4, and my GP was estatic with that. so, i was given the green light to start TTC again ( I had to stop for about 3 months when my TSH levels rose and my meds had to be re-adjusted) I take synthroid 112 mcg daily. I'm hoping to get pregnant again soon and hope to not have many problems during the pregnancy due to my hypothyroid.I would urge you to get your levels re-tested. take this information with you to your doctors http://thyroid.about.com/cs/testsforthyroid/a/labs2003.htmHTH",
            "post_id": "2703242",
            "timestamp": "1206678182",
            "user_id": "user_463486",
            "user_link": "/personal_pages/user/463486",
            "votes": "0"
        },
        {
            "answer": "hey guys... i was actually born without a thyroid so i have been on synthroid since i was 2 days old... its funny cuz i never knew what the symtoms were and my parents and the doctors always told me something different i am now 21 years old i i have finally realized what it affects... but i constantly forget to take my medicine... you would think that after 21 years of having to take it i would remember... but my question to anyone that knows. is will it be hard to get pregnant knowing that i have gone 2 years straight not traking it. am i already screwed?? i have been on it for a couple months straight now... im just hoping in the future it will not be impossible... yea you probaby all will be thinking im stupid for not taking care of myself... but i just realized the importance of all of it. anyone else born without one>>>?",
            "post_id": "2872322",
            "timestamp": "1210090337",
            "user_id": "user_500555",
            "user_link": "/personal_pages/user/500555",
            "votes": "0"
        },
        {
            "answer": "I am 33 yrs old. I have been hypothyroid for about 11 years. This occurred after I had radioactive Iodine treatment. I have been trying to get pg for a little over a 1.5 yrs. I have been unsuccessful I have had 2 miscarriages. I am getting very fustrated!! I am taking 175 of levoxyl and seeing a Endo regularly. I am also seing a fertility spec also. I'm reading all the success stories on this site and it makes me feel encouraged. Is there anything more I can do to increase my chances of getting pg.",
            "post_id": "2896611",
            "timestamp": "1210617360",
            "user_id": "user_506003",
            "user_link": "/personal_pages/user/506003",
            "votes": "0"
        },
        {
            "answer": "Hello, I am 27 yrs old. I've had Hyper active thyroid as a child growing up and I didn't know it. I got married @ 22 and I got pregnant with  my first pregnancy, my thyroid change from hyper active to hypo thyroidism. It wasn't until my second pregnancy that I found out that I had Thyroid problems and again I had stillbirth @ 6 months with my second child. I've been taking my meds since I found out about my thyroid and I am @ normal range but my husband and I want to have a child as well but yet scared at the same time. I pray and have faith in the LORD and we're going to keep trying.I am thankful that I have read alot of everyone's comment on here because it encourages me to keep trying. thank you and to all GOD BLESS...",
            "post_id": "3011330",
            "timestamp": "1212904171",
            "user_id": "user_530476",
            "user_link": "/personal_pages/user/530476",
            "votes": "0"
        },
        {
            "answer": "I was recently diagnosed with hyopthyroid as well. My TSH levels are 46.8 which is high. It's strange though because I ovulate every month and have regular periods. I have been trying to get pregnant for a year now and am getting annoyed. I am reading that if I ovulate normally and have periods regularly that my thyroid isn' t the reason I can't concieve...I guess I'm wondering if anyone else has a similar situation with regular periods and ovulation w/hypothyroid?",
            "post_id": "3053751",
            "timestamp": "1213810652",
            "user_id": "user_539462",
            "user_link": "/personal_pages/user/539462",
            "votes": "0"
        },
        {
            "answer": "i've been ttc for 2 years. just last month i discovered that i have hypothyroidism. TSH level of 11.5. so the dr put me on thyroxine 50. i've had very regular periods but my cycles are only 24 days (short lutel phase). i know that i ovulate each month because i use opk. i read that thyroid malfunction has a big impact on hormonal balance especially the progesterone and estrogen. in my case i think that my progesterone levels do not get high enough to sustain a pregnancy. so even when the egg gets fertilized, conception is interrupted by the progesterone drop which end up in a miscarriage that occurs at the same time periods are expected. i will test my TSH next week and if it's less than 5 i will ttc again, but this time i will start using progesterone cream right after ovulation. i used the progesterone for one month before i discovered i had thyroid problems and my cycle went to 26 days. i also read that progesterone helps with thyroid problems. good luck everyone.rasha",
            "post_id": "3089043",
            "timestamp": "1214537930",
            "user_id": "user_547088",
            "user_link": "/personal_pages/user/547088",
            "votes": "0"
        },
        {
            "answer": "I have hyperthyroid that deveploped while pregnant with my 2nd child I was told I could not get preggers until it was taken care of and I am now preggers with #4 my last 2 had no issues with their thyroids or anything else my 3rd was a preemie but that was from preeclampsia. Believe me I really thought I could  not and would not get preggers but it happens. They probably said that as a worse case scenario or to divert you from trying while ill",
            "post_id": "3089066",
            "timestamp": "1214538587",
            "user_id": "user_546306",
            "user_link": "/personal_pages/user/546306",
            "votes": "0"
        },
        {
            "answer": "hi i will be 21 here soon married for about a year... i was raised in a big family... the oldest of 8 and i have always wanted children of my own... i was diagnosed with hypothyroidism about 2 years ago... my husband and i have been trying for about 3 months and still no results... i feel like giving up... my mother actually has the disease too so she is a source of comfort but my husband doesn't understand the emotional toll it takes on a girl... he doesnt understand that when you want kids you want them and it hurts when you try and you dont get the results you are looking for.. i have never been pg. but i really want them does anyone have any suggestions on how to boost your fertility with this disease?",
            "post_id": "3102925",
            "timestamp": "1214878407",
            "user_id": "user_550140",
            "user_link": "/personal_pages/user/550140",
            "votes": "0"
        },
        {
            "answer": "Hi I'm 33 and have also been hypothyriod for 2 years. I've had the symptoms of subclinical hypothyroidism for years at TSH 5-10 and have always had very heavy and painful periods, but they are regular as clockwork. My Mother also has the disease for 5 years.It wasn't until my after firstborn was 9 months old that my TSH levels were high enough to treat (TSH 30). Doctors initially put me on levothyroxine 50ug then it was increased to 75ug. I breast fed my son until he was 1 year  and at that point got pregnant. (1st time try) with my second pregnancy. During my pregnancy I was refered to an endocrinologist, and they managed my medication throughout. My TSH levels were managed to below 2, and my thyroxine dose put up to 150 ug. My pregnancy was uncomplicated, and thankfully, my daughter was born at 41 weeks healthy, and naturally without complications.When she was 6 months, we tried for a third child but have had two consecutive miscarriages. I was still breast feeding at the time.The hospital has told me that although statistics say 1 in 5 pregnancies end in miscarriage, they see 1 in 3 and that it was just bad luck that I had two in a row. They didn't seem to think that there was any reason that the Hypothyroidism would be a reason why I had miscarried. My TSH is now 0.30. Medically they will not investigate until there has been 3 consecutive miscarrages. Doctors have advised that I have two menstrual cycles before we try again. Lifestyle wise, I don't have any other medical complications, try to look after myself as best as possible, keep stress to a minimum, don't drink alchohol or smoke, avoid too much soya (connection to endocrine complications) try to eat a healthy diet and excersize when I can. Take multi vitamins, I'm slightly overweight (definately due to overconsumption of ice creams!!) but am otherwise fit and healthy. I hope something in the above helps someone somewhere!! Good Luck X",
            "post_id": "3161429",
            "timestamp": "1216201185",
            "user_id": "user_562732",
            "user_link": "/personal_pages/user/562732",
            "votes": "0"
        },
        {
            "answer": "Hi my situation is exactly like yours...i TSH  shot upto 42 and after 3 months of thyroxine 50 mcg..it has come down to 5.5....and now would hav come down even furthur...i am 27 yrs old and want to get pregnant...i have always had regular periods....i am crossing my fingers that i get pregnant soon...its been 2-3 months we have been trying...any suggestions?? i hope u get preg soon",
            "post_id": "3172024",
            "timestamp": "1216404199",
            "user_id": "user_564936",
            "user_link": "/personal_pages/user/564936",
            "votes": "0"
        },
        {
            "answer": "HELLO!I was diagnosted with HYPO when I was like 7. I am 19 yrs old nowWell, long story short for the past 4 yrs my periods were every 3 months, this year its been different. from 27-33 days. But this month, july I got it 20 days after the last day of my cycle (Period: June 24-30 nex period July 20)  Can anybody get pregnant like this??THIS IS NOT NORMAL, I KNOW, DOES THIS HAPPEN TO ANY OF U!BY THE WAY I HAVE NOT BEEN TAKING MY PILLS FOR A COUPLE OF MONTHS.IF ANY OF U WANT TO CHAT ABOUT THIS EMAIL ME AT ***@****THANKS",
            "post_id": "3179991",
            "timestamp": "1216610063",
            "user_id": "user_566596",
            "user_link": "/personal_pages/user/566596",
            "votes": "0"
        },
        {
            "answer": "I am 30 y/o I am a mother of 5 I have hypothyroidism and have had it after my first child. I have never had a hard time getting pregnant as you can tell. With the help of your OBGYN regulating your  thyroid and making sure she test your levels around  every 3 mos you should be fine.hope this helped.",
            "post_id": "3235492",
            "timestamp": "1217803012",
            "user_id": "user_579208",
            "user_link": "/personal_pages/user/579208",
            "votes": "0"
        },
        {
            "answer": "Have no period for a few years. just started Provera and Prenatal vitamins a week ago and I  found out today that my thyroid levels are high , FSH and LH are all normal and all other labwork done was normal...so will be starting on thyroid medication tomorrow.  I have 3 other children from my1st  marriage of 21 years.... am in a new relationship and we desperately want a child together.. Does Hypothyroidism cause you not to ovulate? What other things can I do to help me get pregnant?",
            "post_id": "3268251",
            "timestamp": "1218506164",
            "user_id": "user_587061",
            "user_link": "/personal_pages/user/587061",
            "votes": "0"
        },
        {
            "answer": "I meant that my Thyroid levels are LOW not high... :)",
            "post_id": "3268334",
            "timestamp": "1218507433",
            "user_id": "user_587061",
            "user_link": "/personal_pages/user/587061",
            "votes": "0"
        },
        {
            "answer": "I guess my situation is a little different..so far.  I see my GP tomorrow for a few issues I'm having (foot, wrist) and I want my TSH drawn.  After reading about symptoms of hypo I am thinking I am as well.  I have 5 kids and we want 1 more but I've had 2 m/c's back to back and although I was first thinking some of my symptoms were menopause-related, I'm now thinking thyroid.  My blood pressures were high after the last m/c and a NP said my thyroid was \"fine\" though I don't know what exactly she had drawn.  I will be looking into that tomorrow.  All your success stories give me reassurance but I guess we have to see if it's even a thyroid issue.  I have always had normal cycles, have been charting temps for years and I have noticed my temps a little lower and on the short side.  GL to you all on achieving pgcy!  I'll come back to post what I find with my doc tomorrow.Julie",
            "post_id": "3321605",
            "timestamp": "1219644804",
            "user_id": "user_599796",
            "user_link": "/personal_pages/user/599796",
            "votes": "0"
        },
        {
            "answer": "i just found out i was hyperthyroid 2 days ago and am freaking out a bit. I just got married last june and got off the pill early july. My dr told his nurse he wants me to wait 3-6 months to try to concieve. He said he will discuss this with me on our next appt in 3 weeks. He put me on a beta bloker for now and will test my levels nov 4. But i'm want to try to concieve now. And besides that, i have been trying already this month. Is it dangerous to my and possible baby's health if i were to become pregnant in these early stages of finding out i am hyperthyroid?",
            "post_id": "3530291",
            "timestamp": "1224017061",
            "user_id": "user_650885",
            "user_link": "/personal_pages/user/650885",
            "votes": "0"
        },
        {
            "answer": "I just got married and my husband and I want to start a family. Almost a year ago I was diagnosed with hyperthyroidism. Mine isn't to severe at all and the doctor put me on medication to try to regulate my thyroid for 18 months. Problem, I don't take my meds regularly because I either forget, since I have to take 3 a day, or I don't have the money right when I run out and I have to wait a week or so. Now we are trying to have a baby and have been trying for about 4 months now with no luck. Since my hyperthyriodism isn't that severe could it still effect my fertility? Back in march I did get pregnant, but misscarried, while on medication for my thryoid issue. Do you think I will be able to get pregnant?",
            "post_id": "3607283",
            "timestamp": "1225663063",
            "user_id": "user_669916",
            "user_link": "/personal_pages/user/669916",
            "votes": "0"
        },
        {
            "answer": "hi,im also suffering with hypothyroidism.it was diagnosed 4 me jst before  month nd im using meds 4 last 15 days  nd i was married before 1 year me nd my husband were hardly trying 4 a baby but me having irregular periods with heavy blood clotting nd more over my doctor told 2 me that my uterus size nd everything is normal  but my 2 ovaries were heavy nd bulky with some peripherel follicles.im so stressed nd worried abt this people tell that it is really very difficult nd hard 4 a women wth thyroid 2 get pregnant.anyone in this site please help me nd suggest me the tips nd advices to resolve my problem.waiting 4 the reply nd help.",
            "post_id": "3613892",
            "timestamp": "1225796206",
            "user_id": "user_671550",
            "user_link": "/personal_pages/user/671550",
            "votes": "0"
        },
        {
            "answer": "i m 27 yrs old..i have hypothyroid but its now normal n still using the pills.now i wann b pregnant n i never used any contraception .mmy periods r not regular now ,its skipping 2 months...it makes me thinking that im pregnant n i start testing hoping for positive result but always negative :(......is it really difficult to b pregnant for me...n next feb ill b 28.pls someone clear my doubt",
            "post_id": "3668370",
            "timestamp": "1226939961",
            "user_id": "user_685428",
            "user_link": "/personal_pages/user/685428",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroid, I found out like 3- 4 weeks ago and Im taking synthyroid  but b4 I found out I was pregnant but sadly had a misscarrieg at the end of September 2008. My Doctor said I can still try for a baby but its best that my levels are normal and no my period was never messed up, thank god. My period is only due the 20th but I have bad cramping like I`m going to start my period but I only have lite brownish red stuff when I wipe and some times I have nothing when I wipe its weird. I hope it isnt Aunt Flow, I so want a baby like now!!!...thanks in advance!Jenny!",
            "post_id": "3669391",
            "timestamp": "1226952260",
            "user_id": "user_685671",
            "user_link": "/personal_pages/user/685671",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroid and have had it since 06. I am 25 and I am on 125mcg. I have been with my fiance for 5 1/2 years and we have not got pregant or that I know of.  I have very bad periods.....I dont ever stop I have had my period since Aug 08 and it is now Dec08 and still does not go away...I went to the doctor and they gave my birth control pills which does not mix well with the medication. Does anyone expericence prolong periods??? IF so what did you do to help it and did you have a baby?? I want to have a baby so bad but no luck!! PLEASE ANY BODY OUT THERE WITH SOME ADVISE.....I really need it!!Please send me an email  ***@****ThanksGod Bless!!",
            "post_id": "3740782",
            "timestamp": "1228544711",
            "user_id": "user_703597",
            "user_link": "/personal_pages/user/703597",
            "votes": "0"
        },
        {
            "answer": "7 months after having my daughter (just stopped bfeeding) my face got puffy, I was depressed and SUPER tired.  I had my blood tested and my thyroid level was a 154!  I've been taking synthroid since then, but my levels were just 6.4 (still too high).It's been 5 months and my endocrinologist (very reputable) said that until my levels were stable, TO NOT GET PREGNANT.  He said that my child could be mentally retarded.  NOW I'm FREAKING!  It took us two years to get pregnant with our daughter (after two surgeries, millions of doc appointments and fertility drugs), now it looks like she may be our only child!  SAD!    Can anyone give info on whether or not this is true.  Also, I am about 15 pounds heavier than after I gave birth.  Could this be from my thyroid?  THANKS GUYS!",
            "post_id": "3790937",
            "timestamp": "1229745143",
            "user_id": "user_715088",
            "user_link": "/personal_pages/user/715088",
            "votes": "0"
        },
        {
            "answer": "You can also post on the Thyroid Disorder community, found here:http://www.medhelp.org/forums/show/152While not specifically geared towards trying to conceive or pregnancy, the people there can be a wealth of knowledge about thyroid related issues.",
            "post_id": "3791989",
            "timestamp": "1229788476",
            "user_id": "user_172023",
            "user_link": "/personal_pages/user/172023",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm 32 and have a beautiful baby boy. 6 months after i had my baby i was diagnosed with Hyperthyroidism. I was told to wait a year before trying for a baby, i did so, but recently i felt bad again and was put back on medication. I don't know what to do, keep trying for a baby or wait till i'm sorted. My baby is 20months now and i don't want too big a gap between them. Any advice???",
            "post_id": "4075817",
            "timestamp": "1236693367",
            "user_id": "user_789186",
            "user_link": "/personal_pages/user/789186",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with hashimotos thyroiditis and hypothyroidism when I was 18yrs old and battled with it until last year when I turned 22! It was and still can be one of the worst things I have ever had to deal with(mood swings,fatigue,cold intolerance)! In May of 2006 the doctors found cancer cells and a goiter on the left side of my thyroid. This was treated with surgery to remove the left side. I have been on several different medications with lots of various dosages and doctors. I started seeing a endocrinologist in Jan. of 2007. He put me on a mixture of Synthroid and Cytomel and within that year my levels were normal and have remained normal.I only have to see my doctor once every six months for my labs and follow up now. My husband and I will have been married 1 year in Aug. and we are starting now to try to have a baby. We pray the Lord will bless us with no complications but I will have to see my endo. every month to have my levels checked once I get pregnant. Pray we dont have problems! I also heard women with hypothyroidism cannot breast feed because the baby will not get the hormones it needs and will develope hypothyroidism. Does anyone know if this is true?",
            "post_id": "4115387",
            "timestamp": "1237642385",
            "user_id": "user_800131",
            "user_link": "/personal_pages/user/800131",
            "votes": "0"
        },
        {
            "answer": "I was gaving problems with my period and the doctors suggested for my to go on birth control pills which did not mix well with my medication either. The doctor decided to switch me to the Nuvaring instead of pills and my periods have been normal and it has helped my mood swings and cramps. Talk to you gyn about it!",
            "post_id": "4115416",
            "timestamp": "1237643231",
            "user_id": "user_800131",
            "user_link": "/personal_pages/user/800131",
            "votes": "0"
        },
        {
            "answer": "i am 24 and i have had hypothyriodism since i was 18. i had very high level when i seen the dr and didnt have a period for a year. it took me 4 years to get pregnant with my little girl. I had 3 miscarraiges before her , but had no clue i had the disorder. dont get discouraged it will happen give it time.",
            "post_id": "4525389",
            "timestamp": "1243994959",
            "user_id": "user_925906",
            "user_link": "/personal_pages/user/925906",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroisism that was diagnosed 4 years ago. I miscarried before having my little boy who is 7 now and 3 times sionce, the worst being at 11 weeks. We now have a little girl who was born in April 2009. My thyroid has never been stable but i still can not gain any weight. The dose of thyroxine was actually dropped twice while i was pregnant. It took us  5 months to concieve our little girl and im hoping to have another close as we never planned to have a 7 year age gap. My hypothyroidism is hereditary. My nan had it but my mom dooesnt.",
            "post_id": "4632872",
            "timestamp": "1246947108",
            "user_id": "user_960249",
            "user_link": "/personal_pages/user/960249",
            "votes": "0"
        },
        {
            "answer": "I AM 24 AND I HAVE HAD HYPOTHYROID SINCE BIRTH I HAVE 2 KIDS WITH NO PROBLEMS AT FIRST I HAD 1 MISSCARGE BEFOR I HAD MY SON I STOPED TAKEING MY MEDS BECUASE THAY MADE ME BIGGER AND BOTH MY KIDS CAME OUT HEALTHY AND I FEEL GREAT JUST HAVE FAITH IN GOD .AFTER I GOT OF MY MED I HAD NO PROBLEM GETTING PREGO ME AND MY HUSBEN THINK IT WAS THE MED THAT MADE ME HAVE THE FIRST MISSCARGE",
            "post_id": "4946567",
            "timestamp": "1254834829",
            "user_id": "user_1064473",
            "user_link": "/personal_pages/user/1064473",
            "votes": "0"
        },
        {
            "answer": "If you are hypothyroid and have PCOS can that cause major infertility and what are the best steps to take to fix this problem also I was told that one of my tubes are blocked been married to my husband for almost 9 years and still have not conceived yet and I am really frustrated and dont know what to do @ this point I went to the dr. and they said that my thyroid level was really abnormal is was a 0.3 and they put me on 100mcg levothyroxine and then I have my 1 st OB appt on Nov11th what are some of the question I need to address with my dctr. I have seen an infertility dctr before and had an ovary torsion from being overstimulated with my ovaries so I had to have laproscopic surgery to correct that I am just tryna figure out what I need to do @ this point I am so desperate to have kids riii now",
            "post_id": "4970469",
            "timestamp": "1255446611",
            "user_id": "user_1072160",
            "user_link": "/personal_pages/user/1072160",
            "votes": "0"
        },
        {
            "answer": "I am 24yrs old and have Hypothyroidism, I have got diagonsted at age 17yrs and have had my thyroid regulated by meds: 75mcg of levothyroxine. Me and my Husband have been trying for a baby for about 2yrs now and no luck. I have very irregualar periods sometime they are 2 month in a row, others i skip like 3moths and sometimes I bleed for a month straight. I jsut dont no what to do anymore...I have also been buying ovulation tests and I have never got it to \"say\" that I was ovulating. Any Advice would be greatly appreicated!!! Thanks for reading =)",
            "post_id": "4995453",
            "timestamp": "1256081947",
            "user_id": "user_1080521",
            "user_link": "/personal_pages/user/1080521",
            "votes": "0"
        },
        {
            "answer": "I am 27 and found out earlier this year I have hypothyriod.  I have no clue how long I may have been before this time due to being on the pill and never noticing any symptoms.  Oh course when the husband and me decided to try and start a family is when I didn't get my period for 4 months.  I just found out that my medication has to be adjusted for the third time.  I'm guessing due to my unstable levels I haven't been ovulating at all....not really sure? Any thoughts?  I bought the clearblue easy ovulation kit to see but haven't been registering any peak fertility days.  I just feel frustrated because I asked my old obgyn to retest my level due to my periods becoming irregular again didn't do it...needless to say I found a new docter. I'm hoping this time I'll get the treatment I need.I'm really happy to see people posting their success stories here. It gives me much needed hope.",
            "post_id": "5021658",
            "timestamp": "1256737427",
            "user_id": "user_1089125",
            "user_link": "/personal_pages/user/1089125",
            "votes": "0"
        },
        {
            "answer": "I have discovered I have hypothyroid for about 1 year. I was on birth control for 1 yr and a half and it made me miss alot of my periods for like a year. Now i just got off of it and got my period right away. I am worried that later on in life when I want to have a baby I wont be able to because I have hypothyroidisms..should I worry??",
            "post_id": "5040211",
            "timestamp": "1257220945",
            "user_id": "user_1095086",
            "user_link": "/personal_pages/user/1095086",
            "votes": "0"
        },
        {
            "answer": "I`m recently 26 have been diagnosed with hypo about 2 years ago and my periods when normal last about 5 days. My last period was well over a year ago.About 4 months ago I had what I call Evil Confused Cousin Flo because Aunt`s on a long extended vacation lmao and she stayed for 2 week with no cramps and was light-light mediumShe left for a week and came back for 2 days? and was lighter than usual. I`ve been told my thyoid levels are fine but weren`t told what they were. I`m ignorant when it comes to medical stuff I must admit. Anyways, with this screwed up half cycle, how do I know when to try? I`ve been trying for 4 years and wanted to start a family right away as we want a large family (both bio and adopted) Help please, I`m desperate and I loose sleep and confidence over this.",
            "post_id": "5044503",
            "timestamp": "1257328902",
            "user_id": "user_1096511",
            "user_link": "/personal_pages/user/1096511",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm a 27 y/o female with hypothyroidism. I was diagnosed in Dec. 2008 and started taking Levothyroxin.  Until June of 2008, I had always had normal periods.  Since then, I go months at a time without a period at all.  I had not had one until June 2009.  Starting in June, I have been having periods for 2-3 weeks at a time.  Mostly light bleeding to start, then heavier for about a week, then very light again.  Has anyone else experienced this?  My husband and I would really like to start a family, but it is difficult to tell when I am ovulating when I'm on my period all the time.  Please advise.  Thank you!",
            "post_id": "5062568",
            "timestamp": "1257808783",
            "user_id": "user_1102395",
            "user_link": "/personal_pages/user/1102395",
            "votes": "0"
        },
        {
            "answer": "i have hypothyrodism and didnt find out about it until a month ago i have a son who is almost 7 and i am 17 weeks pregnant now they did lab work at the obgyn office and found out i had hypothyroidism so i didnt even know about it when i got prego but i guess it happens when it's time to happen",
            "post_id": "5062994",
            "timestamp": "1257815930",
            "user_id": "user_1102413",
            "user_link": "/personal_pages/user/1102413",
            "votes": "0"
        },
        {
            "answer": "Hi, I am 33 and have been Hypothyroid since after my daughter was born in 1998. I am currently taking 150mcg Eltroxin and my levels are now somewhat normal.I decided to ttc my 2nd child in 2006, we started trying in August 06 and thought it was going to be a problem with having a thyroid disorder but 6 months later was pregnant. My son was born in September 07 weighing a healthy 9lbs 4oz. One thing I wasn't warned about was the fact that being Hypothyroid could mean a big baby! Just thought I'd add that I've had no miscarriages either so trying to conceive with Hypo is not all doom & gloom.Good Luck!",
            "post_id": "5063944",
            "timestamp": "1257851657",
            "user_id": "user_156383",
            "user_link": "/personal_pages/user/156383",
            "votes": "0"
        },
        {
            "answer": "So I just realised this thread was started a LONG LONG time ago! I'm such a dork, lol!",
            "post_id": "5064182",
            "timestamp": "1257859488",
            "user_id": "user_156383",
            "user_link": "/personal_pages/user/156383",
            "votes": "0"
        },
        {
            "answer": "i had a pregnancy at a young age my son is 6 now and im 23 i was diagnosed with a hyperactive thyroid when he was 8 months old. i have been in remission for about3yrs now and have been wanting another child i have had no luck. ever since i was diagnosed i have delt with weight issues and i know im too thin its still sooo hard to keep weight on... its like i never actually got better. the worst part is for the past 3 years i have wanted to have another child sometimes i blame it on myself and start binge eating so i can put on weight because i feel thats why i cant get pregnant. plus the fact that every person in my family are all baby factories. you know when im at home by myself i could not tell you how many times i see those weight loss commercials and stuff and think to myself i need to gain weight wheres the commercial for me? sorry let me get the question out before i talk your ear off.. does anyone believe that the hyperthyroidism had something to do with me not being able to get pregnant again? thanks melissa",
            "post_id": "5087431",
            "timestamp": "1258432235",
            "user_id": "user_1110715",
            "user_link": "/personal_pages/user/1110715",
            "votes": "0"
        },
        {
            "answer": "i have hypothyrodism and i have 2 kids.. and both were concieved ON birthcontrol pills..im also on med that help control my thyroid!! good luck!",
            "post_id": "5087610",
            "timestamp": "1258437268",
            "user_id": "user_1110358",
            "user_link": "/personal_pages/user/1110358",
            "votes": "0"
        },
        {
            "answer": "I am 27yrs have i child and just found out i have hyperthyrosdism if anyone can help what should i do.",
            "post_id": "5124119",
            "timestamp": "1259427450",
            "user_id": "user_1122044",
            "user_link": "/personal_pages/user/1122044",
            "votes": "0"
        },
        {
            "answer": "Hi I am having hypothyroidism for the last one year now.I am on medication from the time it was detected. I am planning to conceive and am scared for the effects it would have on my pregnancy ..can anyone tell me if me being on medication will still have any effects on pregnancy???is it true dat miscarriages happen with hypothyroidism and abnormal birth of children is what i have read some were is it really true???",
            "post_id": "5132944",
            "timestamp": "1259687667",
            "user_id": "user_1125076",
            "user_link": "/personal_pages/user/1125076",
            "votes": "0"
        },
        {
            "answer": "im also in that boat. i havent had a period in two months. im ovulating and im not even having a period. i want to have a baby. but this have stress me out. i have signs of pregnancy but be so scared totake a prenancy test. cause i know how mush its going to hurt when it come back negative. i havent had a miss carriage and dont think my nerve could take it. but i do wish everyone luck on getting pregnanet. that bless will come. i hope.",
            "post_id": "5171976",
            "timestamp": "1260756345",
            "user_id": "user_1137871",
            "user_link": "/personal_pages/user/1137871",
            "votes": "0"
        },
        {
            "answer": "hey i also have a hyperthyroid i not bless to have a kid . your blessed. im 24 years old and i just dont know what to im on 50 mg of synthroid. and my nerves are shut . im so depressed that i dont have a kid. i feel like im being punish. i think once my level get stable i might able to get prego. pray for me. im prayin for all of you.",
            "post_id": "5178533",
            "timestamp": "1260930108",
            "user_id": "user_1137871",
            "user_link": "/personal_pages/user/1137871",
            "votes": "0"
        },
        {
            "answer": "I have hypothryodism & I am 26, My TSH started at 6 and we haven't been able to get my meds right yet. I want to start TTC and am tired of waiting, its been almost a year and the meds still aren't right.Is it too risky to start trying? I know my TSH is under 6 but I am not sure what number it is at.",
            "post_id": "5195511",
            "timestamp": "1261433024",
            "user_id": "user_1145791",
            "user_link": "/personal_pages/user/1145791",
            "votes": "0"
        },
        {
            "answer": "hey well im in that how i feel. im scared that if i get pregnanet that something my be wrong with my child. i want to start trying to have a baby but im scared. but i am going to start taking prental vitamins . and i hope you get ur meds . because im thinkin about askin my doctor to higher my meds so i can start trying to have a kid. im 24 im getting any young good luck.",
            "post_id": "5202077",
            "timestamp": "1261623744",
            "user_id": "user_1137871",
            "user_link": "/personal_pages/user/1137871",
            "votes": "0"
        },
        {
            "answer": "Hello. My husband and I have been TTC since May of 09. We found out we were prego on August 26th, the same day that a nurse practitioner told me that I have tested + for Hashimotos. My TSH levels were normal, but she put me on .05 mg of levothyroxin. I had a miscarriage in mid sept. I went to my reg dr. who took me OFF of levothyroxin and told me that I didnt need meds. Since then, I have started tracking my BBT to TTC. My temps are way low - I average around 96.7. I read online that some Doctors look at BBT temps and NOT blood work to determine the need of meds. Has anyone had this happen?? I am so frustrated b/c I cant conceive and when I do I will most likely m/c. Please help. I have a Dr. appt with my OB in two weeks. Any info or advice can help!!!",
            "post_id": "5221109",
            "timestamp": "1262278766",
            "user_id": "user_1155262",
            "user_link": "/personal_pages/user/1155262",
            "votes": "0"
        },
        {
            "answer": "I have 2 wonderful little boys & hypothyroidism i found out after the 1st 1 10 years ago & have been on medication ever since now my youngest just turned 1 & he is progressing well no worries jus make sure you do tell you ob-gyn because they will have to check you levels often very often i started at 25 mcg and at the time of delevery i was at 100 mcg & that is very normal i work at a doctors office and it takes about 6 weeks for the medication to work so dont be in too much of a tizzy because its only harmful to your unborn child if it is not monitored hope this helps ease your mind a little & GOOD LUCK!!!!!",
            "post_id": "5249219",
            "timestamp": "1263010602",
            "user_id": "user_1165694",
            "user_link": "/personal_pages/user/1165694",
            "votes": "0"
        },
        {
            "answer": "I have 2 wonderful little boys & hypothyroidism i found out after the 1st 1 10 years ago & have been on medication ever since now my youngest just turned 1 & he is progressing well no worries jus make sure you do tell you ob-gyn because they will have to check your levels often very often i started at 25 mcg and at the time of delivery i was at 100 mcg & that is very normal i work at a doctors office and it takes about 6 weeks for the medication to work so dont worry because its only harmful to your unborn child if it is not monitored hope this helps ease your mind a little & GOOD LUCK!!!!!",
            "post_id": "5249238",
            "timestamp": "1263011051",
            "user_id": "user_1165694",
            "user_link": "/personal_pages/user/1165694",
            "votes": "0"
        },
        {
            "answer": "if u have any questions feel free to email me ***@****",
            "post_id": "5249240",
            "timestamp": "1263011119",
            "user_id": "user_1165694",
            "user_link": "/personal_pages/user/1165694",
            "votes": "0"
        },
        {
            "answer": "well it wouldnt post like tha its my screen name at yahoo",
            "post_id": "5249258",
            "timestamp": "1263011728",
            "user_id": "user_1165694",
            "user_link": "/personal_pages/user/1165694",
            "votes": "0"
        },
        {
            "answer": "I have  hypothryodism and polycystic ovary . can  anyone suggest a good doctors in chennai to consult.Mini. Chennai",
            "post_id": "5371438",
            "timestamp": "1266055895",
            "user_id": "user_1210767",
            "user_link": "/personal_pages/user/1210767",
            "votes": "0"
        },
        {
            "answer": "i have hypothryodism i was diagnosed with hypothyroidism when I was 17 + finding it really hard too get pregnant. but then i fel pregnat ater it taking  me two years  but i miscarried it at 12 weeks :(",
            "post_id": "5373374",
            "timestamp": "1266114214",
            "user_id": "user_1211418",
            "user_link": "/personal_pages/user/1211418",
            "votes": "0"
        },
        {
            "answer": "So I went to the doctor two months ago because i felt horrible. My TSH Level was 406.5 I have been tryin to get pregnant for a year and a half and no luck...How long will it take while taking medicine for me to be able to get PG",
            "post_id": "5387092",
            "timestamp": "1266485528",
            "user_id": "user_1216232",
            "user_link": "/personal_pages/user/1216232",
            "votes": "0"
        },
        {
            "answer": "I've been trying to get pregnant for years. Nothing ever seem to happen. I was diagonsed with PCOS years ago and my chances of getting pregnant when I found it basically crushed me. Now I'm 28 years old and just got married last year. Was also diagonosed with Hypothyroidism last year when I went in for my yearly woman check up. The husband and I are trying sometime to get pregnant this year even though there is a certain person I won't say who right now who doesn't want me to get pregnant but rather adopt a kid. Anyways so if its not that difficult getting pregnant then why am I not already? My doctor has up the dose on my Levothryoxine medication from 25 mcg to 75 mcg. My levels are still a little to low which honestly doesn't make any sense. So I was just wondering how many tries or whatever is it going to take to get me pregnant with my husband and I's first child?",
            "post_id": "5446875",
            "timestamp": "1268025106",
            "user_id": "user_1237600",
            "user_link": "/personal_pages/user/1237600",
            "votes": "0"
        },
        {
            "answer": "i to just received from my gp that my thyroid was high. i was diagnosed with pcos years ago and i am 27 now i have been married for 6 years this year with no luck of getting pregnant. i am constantly tired all the time and i have my period close to 25 days out of 30. i know this is deff not normal so i have to go to by ob/gyn for more testing and i have an appt next week with the endocrinologist.  can anyone give me any insight on this my husband is really wanting to conceive and i do to but i dont want to get my hopes up for something i cant have.  any insight on this will be greatly appreciated!",
            "post_id": "5456834",
            "timestamp": "1268269199",
            "user_id": "user_1241310",
            "user_link": "/personal_pages/user/1241310",
            "votes": "0"
        },
        {
            "answer": "hi I am 27yrs old, I just found out that I have hypothyroidism, my TSH level is 20. We are planning to start a family soon..is it advisable to try and concieve with these TSH levels or is it better to first get it under control? pls help..i have mostly had regular periods..nj",
            "post_id": "5471460",
            "timestamp": "1268677197",
            "user_id": "user_1246411",
            "user_link": "/personal_pages/user/1246411",
            "votes": "0"
        },
        {
            "answer": "Hi, I am 24 years old and I found out I have hypothroidism about 4 months ago. I have been married going on 5 years now and we haven't gotten pg. I do understand that being hypo of course can affect pregnancy, but after I read all of these posts about still birth, miscarriages, and just the disappointment of not getting pregnant it just makes me wonder if trying is the right thing to do. There are so many complications. And not only that but the emotional part of it. I want nothing more than to hve a child, I'm just really scared.",
            "post_id": "5517251",
            "timestamp": "1269874080",
            "user_id": "user_1262356",
            "user_link": "/personal_pages/user/1262356",
            "votes": "0"
        },
        {
            "answer": "Hi there,I was diagnosed with Hashimoto's after an ectopic pregnancy last April.  My TSH was at a whopping 125! It took about 6 months for them to get back into the normal range and I got pregnant 2 months later.  When I got pregnant my TSH was at approx. 2.3.  I am on .112 of levothroxine (synthroid brand).   I have my levels checked every 2 months.My pregnancy so far has been uncomplicated and progressing normally (I am 5 months).Good luck to all you ladies trying to conceive and know that once your TSH levels are under control your chances of conceiving are as great as anyone elses!Take Care",
            "post_id": "5673817",
            "timestamp": "1273693461",
            "user_id": "user_879598",
            "user_link": "/personal_pages/user/879598",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hypothyroidism when I was 23 weeks pregnant with my son. My doctor did not explain to me the effects it could have on a baby. All he said was take your medicine. Since that was all he said I did not take it seriously enough meaning that I did not take my medicine every day like I was told to. My son was born at 38wks and 1 day...beautiful, healthy baby boy there were no problems with my pregnancy or delivery. He passed away when he was fifteen days old. That was on December 25, 2009 and today is May 22, 2010. The autopsy could not find a cause of death. He was being held and went into respiratory distress. He had no symptoms that anything was wrong during his two weeks of life. I did not have a period the first two months after he was born and since then they have been far a part and short..nothing like before he was conceived. I had a positive pregnancy test and then five days later got what I think to be my period. I think it was an early miscarriage. I have done so much research on hypothyroidism over the past few days and I think that I might still have it. (I was tested for it when I was pregnant with my daughter, she is now 2, and did not have it.) Hypothyroidism can cause anovulation-failure to ovulate meaning that a follicle on your ovary does not mature and release an egg! No egg=No period if it is treated correctly you should ovulate like normal and have no fertility problems that are a result of hypothyroidism. If untreated it can cause lower I.Q. scores in your child in the future and developmental problems. I will never know if an early diagnosis of this disorder and taking my meds correctly would have saved my son all I can say is please take your medicine the DR.s know what they are talking about.",
            "post_id": "5712030",
            "timestamp": "1274590683",
            "user_id": "user_1322724",
            "user_link": "/personal_pages/user/1322724",
            "votes": "0"
        },
        {
            "answer": "hi there i was born without a thyroid gland. im 21 and only this year have learned what is actually wrong with me i always knew just didnt see it as anything important., so i have never seen my thyroxine important until now when i realised my levels were all over the place i am on 300mg of thryroxine have been for a while but still rubbish with remembering to take it. my partner and i have decided on having a baby my periods have always been normal but i still want to know wherther its going to affect me because after reading all these comments i dont think i could go through the heart ache of having a miscarrage or not knowing if i can get pregnant or not so can someone please tell me if u can or not and give me a lil hope thanks",
            "post_id": "5719840",
            "timestamp": "1274799575",
            "user_id": "user_1325128",
            "user_link": "/personal_pages/user/1325128",
            "votes": "0"
        },
        {
            "answer": "For anyone wanting to get pregnant that has been unable to, run to a RE (reproductive endocrinologist)!!! Your primary care doctor is only casually versed on the reproductive systems and an problems associated with them. An OB is more suited to once a woman is already pregnant. An RE is what is needed for anything having to do with infertility. I also recommend a book called \"A Few Good Eggs\" by Julie Vargo and Maureen Regan.Had I learned this lesson when I was younger, I may have already had the child I have so long been dreaming of.History of me; I was 20 when I got married and my DH (dear husband) and I decided to wait till we were older and better prepared before we had children. I have always been heavy set and have never had the greatest insurance, if I had any at all. So, the few doctors I'd seen when I was young had always told me to eat less and exercise more and my other problems would disappear! Yeah, right.At 24 I was diagnosed with depression right in the middle of my DH and deciding to start trying for a baby. At this point I was just going off of the pill and starting medication for depression, but still not losing weight despite best efforts on my part.At 27 I start going to OB's because we've been unable to get pregnant and are becoming concerned. At this point my periods have become increasingly erratic and I'm told (again) that I just need to lose weight. One OB even told me she wouldn't even see me until I'd lost weight. I was also told that my DH and I hadn't been \"actively trying to get pregnant\". Meaning at 27 I was dumb and didn't know as much as I thought I did about ovulation cycles and when a woman can actually conceive. Thank goodness for the internet, because I started to educate myself.I am now 32 and I still do not have a baby. A lot of this has had to do with my life being turned upside down a few times over the last few years and me going without a job and insurance from either myself or my hubby. But, as of yesterday I was (finally) diagnosed with hypothyroidism and told that it is likely I have had this for many years and doctors brushed it aside. The problem with that is, that it allowed it to continue and get worse. The new PCP I have has also gone through a lot of what I have herself and understands so much of what I'm going through. She has started me on thyroid medication and given me a plan. I go back in 6 weeks to get my numbers checked. Once those are normalized I can hopefully actually start losing weight instead of only holding steady or actually gaining weight! And, I can start trying to conceive again. If after 3 months of actively trying to conceive I am not pregnant then I will be going to an RE.I hope that by sharing a little bit of my story you'll know that you're not alone in your journey. There are many other women who are also struggling. Some with maintaining pregnancies, others with getting pregnant in the first place. It doesn't matter... We all have this little gland in our bodies that want to try and take control of our lives. Forget that buster, I'm in charge here!Also, please remember to never be ashamed of what you're going through. I remember when I was younger not wanting to tell anyone about my problems getting pregnant or with my body. I was embarrassed and ashamed. Now, I have spoken with other female friends and found that so many of them are also struggling with health issues and also felt as I did. We now have each other to lean on and to ask questions of. Build your network of support and don't be afraid to use it!Best of luck to all of you out there who are struggling with their thyroid condition and with trying to have a baby!!!",
            "post_id": "5748833",
            "timestamp": "1275514092",
            "user_id": "user_1334080",
            "user_link": "/personal_pages/user/1334080",
            "votes": "0"
        },
        {
            "answer": "hi guys,i am the complete opposite, i am hyperthyroid instead of hypo, and have been trying to get pregnant for the past 2 years, but no luck thus far. i'm super worried, but i am still on my thyroid meds (methamazole). I wonder if any of you guys have gone through this tough time and if someone/anyone with hyperthyroidism has been able to conceive, because i am afraid to admit and find out that i may never be able to conceive....I hope this is not the case. please share your stories to give me some hope, thanks so much.",
            "post_id": "5779100",
            "timestamp": "1276203857",
            "user_id": "user_1342975",
            "user_link": "/personal_pages/user/1342975",
            "votes": "0"
        },
        {
            "answer": "Same here i was diagnosed hyperthyroid around may last year and it all clear now  currently i don't take any more medication but still do regular blood test to check my thyroid level if it stay under control.I have a beautiful daughter she nearly 5 yrs old i would love to have another one so desperately we been trying for last 3 months but no luck i guess we just keep on trying ...",
            "post_id": "5861674",
            "timestamp": "1278037205",
            "user_id": "user_1366902",
            "user_link": "/personal_pages/user/1366902",
            "votes": "0"
        },
        {
            "answer": "Hi frnds,I was diagonised to have thyroid with TSH 18.22. It is past one year i am married and we have no child. We are trying. I am talking 200mcg tablet everyday...Please give me hope...Will i be able to succeed in getting pregnant???",
            "post_id": "5862364",
            "timestamp": "1278056005",
            "user_id": "user_1367094",
            "user_link": "/personal_pages/user/1367094",
            "votes": "0"
        },
        {
            "answer": "Hi there,I was diagnosed with Hashimoto's after an ectopic pregnancy last April.  My TSH was at a whopping 125! It took about 6 months to get my levels back into the normal range.  Once my TSH was back to normal (under .3) I got pregnant 2 months later.  When I got pregnant my TSH was at approx. 2.3.  I am on .112 of levothroxine (levothyroxine) (synthroid brand).   I have my levels checked every 2 months and they have stayed in the normal range.My pregnancy so far has been uncomplicated and progressing normally (I am in my 6th month).Good luck to all you ladies trying to conceive and know that once your TSH levels are under control your chances of conceiving are as great as anyone elses!Take Care",
            "post_id": "5870848",
            "timestamp": "1278272250",
            "user_id": "user_879598",
            "user_link": "/personal_pages/user/879598",
            "votes": "0"
        },
        {
            "answer": "Hi guys even i have thyroid too actually when i got newly married i got pregnant with in  a month thought not go with that ...later one year we planned for kids i had m/c at that time when i am 7 weeks 3days after that because of Recession my husband got project done so thought not best time to try right away after 9 months we started planning again i got sever fever went to doctor she said i got hyper procaltoima my TSH-5.7 and my PROLACTIN - -18 ,doctor put me on medication and MY T4 is 0.87 at that time she gave 88 mcg medicine after one month my TSH-1.470 , T4 -1.13 and PROLACTIN -- \t12.5 look everything is normal and  i dont have any ANTI THYROID ANTIBODIES  still i didnot get pregnant i am trying since 11 months and my periods are regular like 28 days to mostly 34 days still no luck every month i keeps on crying waiting is too hard any people can suggest what the best way to get pregnant ?? any one thinks best way to go fertility center please any one help me,or i have to stop taking medicine??/ thanks",
            "post_id": "6002386",
            "timestamp": "1281220981",
            "user_id": "user_1406410",
            "user_link": "/personal_pages/user/1406410",
            "votes": "0"
        },
        {
            "answer": "Hi, I'm 28 years old and I was diagnosed with Hashimoto's hypothyroidism after delivering my 3rd baby 2 years ago. I'm on levothyroixine and it is working fine with me, my periods are regular, they were not at first, but now they are regular. The only problem I'm having is the unbelievable hair loss. My TSH and T4 levels are normal, I don't have any other deficiencies, my lab tests are all normal so my endocrinologist is confused because he said i shouldn't be having hair loss no since everything is normal. Honestly I don't know what to do about it, I even started mesotherapy for my hair and my dermatologist is banging his head against the walls because it doesn't seem to be working...any ideas of how I can stop my hair from falling?",
            "post_id": "6055420",
            "timestamp": "1282474279",
            "user_id": "user_1421483",
            "user_link": "/personal_pages/user/1421483",
            "votes": "0"
        },
        {
            "answer": "Im 20 years old and been married for a year now. I was diagnosed with hypothyroidism at 17 and put on 75 mcg of synthroid. Weve been trying for 5 months now and still cant concieve. I have a low basal temp of 96.7 on average and I dont think I ovulate. Do I need to go back to the doctor and get it re-checked? please help",
            "post_id": "6089162",
            "timestamp": "1283263697",
            "user_id": "user_1431127",
            "user_link": "/personal_pages/user/1431127",
            "votes": "0"
        },
        {
            "answer": "Can i get pregnant with mild-hypothyroidism?we r planning for baby from last six mnts, but coudnt get success.then my dr suggested for some blood test.my t3-111.49 ,t4-7.10 ,tsh-8.75. i have started taking medicine thyronorm of 50 mcg.my husband's semen analysis report is - sperm count-21.4 millions/ml , motility at 1/2 hr.-40%. and he has some infection too.should we wait for some months or we continue to plan for baby.should we do intercourse or not???plz suggest..........",
            "post_id": "6146647",
            "timestamp": "1284621125",
            "user_id": "user_1447533",
            "user_link": "/personal_pages/user/1447533",
            "votes": "0"
        },
        {
            "answer": "I'm 23 years old, have been married for about 2 and half years. My husband and I have been trying to get pregnant for almost 11 months. I found out about a month ago that I have hypithryoidism. Ever since the first time I have gotten my period it has never been normal. Like there were months that I would never get or then there was months I got it, and it would really heavy and it would last for longer than a month.I have my period for over a month now, and no matter the doctor gave me didn't work to get rid of it. So now she has put me on birth control, so I guess I have to put of getting pregnant for awhile.All I want to know, is that there is someone out there that has the same crazy problem and has gotten pregnant?",
            "post_id": "6366304",
            "timestamp": "1290019002",
            "user_id": "user_1509750",
            "user_link": "/personal_pages/user/1509750",
            "votes": "0"
        },
        {
            "answer": "HI LADY'S IVE BEEN TRYING TO GET PREGNANT FOR TWO YEARS NOW. I FOUND OUT THAT I HAVE HYPOTHYROIDISM ABOUT 4 WEEKS AGO, IVE BEEN TAKING MEDICATION TO REGULATE MY THYROID I JUST WANTED TO KNOW HOW LONG AFTER YOU START TAKING THE MEDS CAN YOU GET PREGNANT? CAN IT HAPPEN RIGHT AWAY OR DOES IT TAKE A WHILE? IM SCARED THAT I WILL NEVER BE ABLE TO HAVE A BABY!!!!!!!!!!!!! =(  WHAT CAN I DO!",
            "post_id": "6408278",
            "timestamp": "1291170012",
            "user_id": "user_1521867",
            "user_link": "/personal_pages/user/1521867",
            "votes": "0"
        },
        {
            "answer": "Hi my name is Angela and I am 14 weeks pregnant. I am very stressed out because I just now found out through blood work that my thyroid has been low my entire pregnancy and that the medicine(armour) I was taking stopped working. I'm worried about the baby and her developing normally. Has anyone out there had a baby while having undiagnosed hypothyroidism? Can you tell me if your baby is normal? Thank you very much.",
            "post_id": "6462833",
            "timestamp": "1292621669",
            "user_id": "user_1537219",
            "user_link": "/personal_pages/user/1537219",
            "votes": "0"
        },
        {
            "answer": "Hi guys. I'm Angela. I'm 14 weeks pregnant and am very worried for my baby because I just found out that my thyroid is extremely low and that the meds I was taking weren't working. I'm concerned for the baby. Has anyone out there been pregnant and undiagnosed for hypothyroidism? If sonhow is your baby now? Thanks so much.",
            "post_id": "6462862",
            "timestamp": "1292622096",
            "user_id": "user_1537219",
            "user_link": "/personal_pages/user/1537219",
            "votes": "0"
        },
        {
            "answer": "I found this forum looking for side effects of Synthroid in pregnancy.  I was dx with hypothyroid 7 months ago, and have been on Synthroid (50 mg) ever since.  My levels, at last check, were at 3.0.  I felt the need to comment here because through all of the posts, I have not once seen anyone talk about the effects to the baby that conceiving with high levels can cause.  Your thyroid produces a hormone that is essential for the baby's brain development, which occurs in the first few weeks following conception.  I was told by my endo that babies conceived while levels were above normal can end up with neurological and developmental abnormalities, and that it also leads to an increased risk of miscarriage.  My husband and I were also actively trying to get pregnant, until I learned this.  We immediately stopped, and are now waiting for my levels to be acceptable by my endo before we begin trying again.  The risks to your child are too great!",
            "post_id": "6531833",
            "timestamp": "1294688312",
            "user_id": "user_1558519",
            "user_link": "/personal_pages/user/1558519",
            "votes": "0"
        },
        {
            "answer": "I am 19 years old and have had hypothyroidism for 19years, I was diagnosed when i was 2 days old. I am getting married and plan to start a family. I spoke with my doctor about the complications and he said that as soon as you find out you are pregnant you have to let them know due to the fact that you estrogen(?) and your thyroid hormones bind together, canceling out your thyroid hormone, which can cause difficulties. My fiance and I haven't started trying yet, but hopefully when we do it will be easy.",
            "post_id": "6745418",
            "timestamp": "1300424738",
            "user_id": "user_1638430",
            "user_link": "/personal_pages/user/1638430",
            "votes": "0"
        },
        {
            "answer": "Hi,I have had hypothyroidism for 10 years now, i am now 27 and trying to get pregnant.  From the first day I was diagnosed I was put on levoxyl 150 mcg daily.  I have never missed a period since i got my first one when i was 12.  They are always every 29 days, and boy do i feel my ovulation.  I am amazed that my periods have always been so regular ( i would say more like right on the minute, not day).  We have been trying for 2 months now, and nothing is happening yet.  My gyn and endocrinologist both told me to try for a year before worrying about infertility.  I believe that stressing out about getting pregnant is the biggest problem.  So we are just trying to relax and have fun with it!   We want a baby more then anything. Good luck to all of you trying!  I would also advise that when you go for your yearly physical to ask ur dr to check your TSH and T4 levels regardless of your health status.  What can you loose? Hyperthyroidism and hypothyroidism is not at all uncommon in this stressful world we live in today.",
            "post_id": "6786443",
            "timestamp": "1301621136",
            "user_id": "user_1651138",
            "user_link": "/personal_pages/user/1651138",
            "votes": "0"
        },
        {
            "answer": "Tihana, your situation sounds almost like mine. Im 28 yrs old. The only difference is that i had a MC last Oct. '10 at 10weeks due to Blighted Ovium.I first got tested with thyroid problems when i was about 17 yrs old. I took medication for a year but i cant seem to remember what was it and how much. After a year i stopped taking it as my levels supposedly regulated. I did get checked at least once a year. My husband and I TTC for a year back in 2008 but nothing happened.Last year in may 2010 my levels got a bit off when i went for my thyroid check. I took medication for a month or so and then in September '10 found out i was pregnant out of nowhere. Could me taking the meds help get me pg?  We were not even trying. I stopped taking thyroid med not knowing that i should have been taking them all along. NO ONE not even OBGYN said anything because when they checked me the levels looked fine. Im no doctor i didnt know. My first reaction was to not taking anything since i found out i was pregnant.After my second visit to OBGYN she told me she saw the g sac but that was it. Week after week she kept checking me and nothing was changing. Meanwhile i was going through all the pregnancy symptoms. The OBGYN gave me two options. She told me it was a Blighted Ovium and i was going to MC. She said to either let it happen naturally or do DC. I waited and MC naturally at 10 weeks.Now we want to have a baby since we felt how wonderful it would be to be parents. We waited two cycles for my body to heal and started trying again. It has been three months and nothing.I read a lot about thyroid having an affect on you TTC. My last thyroid test from November said my TSH level was 1.902 and T4 was .73I called my endocronologist today to discuss if i should go back on my meds again since my levels can go up and down as they wish. My next appt is May 12 and i do feel like my result could be not leveled because i feel tired a lot. No one can tell me if my MC happened because of disregulated thyroid or something else. Im starting to believe it has to do with it because until i started taking my meds last year i never got pregnant. My period is regular and i can definitely can tell i ovulate. I used ovulation tests as well and they become positive right about when they should.",
            "post_id": "6798458",
            "timestamp": "1302014213",
            "user_id": "user_1654836",
            "user_link": "/personal_pages/user/1654836",
            "votes": "0"
        },
        {
            "answer": "Hello I am actually going thru the process of getting blood tested and having my levels checked. For the past year hubby and I have been ttc. I do have a 4 year old son which we have been blessed with and I had a MC in january 2010. So after that we decided to try and since then I've had irregular menstruals. Nothing! I have went to see the endocrinologist and I am awaiting the result....he says maybe p.c.o.s.  or hypothyroidism ... I have had cyst on my ovaries but the hospitals don't seem to worry? What do u guys think?",
            "post_id": "6808212",
            "timestamp": "1302283729",
            "user_id": "user_1657653",
            "user_link": "/personal_pages/user/1657653",
            "votes": "0"
        },
        {
            "answer": "Reading all of these comments are so inspiring. I am 26 years old and my mother has Hypothryroidism and I am more then sure I do too (new jobs for hubby and I so insurance kicks in next month and I will be at the doctor soon to confirm). I have all of the syptoms and to top it all off hubby and I have been trying to conceive for almost 2 years now with not so much as a hope to getting pregnant. I've seen a doctor about why I can't get pregnant and he says that I need to lose weight but, I work out and watch what I eat and it doesn't happen! I was even given a fertility drug to try and see if it would work and nothing. My thyroid hasn't been checked in a few years and I'm pretty positive that that is the issue. I just wanted to let you all know how much hope and motivation you are giving me to continue trying and to see  the doctor and make me feel like I have a chance to live my dream of being a mother and being healthy and happy. Thank you all.",
            "post_id": "6818954",
            "timestamp": "1302637949",
            "user_id": "user_1661090",
            "user_link": "/personal_pages/user/1661090",
            "votes": "0"
        },
        {
            "answer": "I am 22 Years old and i was born with hypothyroidism. Me and my boyfriend are trying to conceive but i am always scared that i cant get pregnant. I haven't had a regular period all my life. We have recently started trying and i usually have cramps a week before my actual period starts but i have none.I feel bloated and not very hungry but i have not had morning sickness either. My period usually starts at the end of the month but haven't had it yet. I am on 0.025mcg and 0.2mcg until i go again to increase my meds. I get light dull cramps and im soar in my chest but that's it. Im just wondering since i have hypothyroidism if i could be pregnant without any symptoms at all? and would anybody know how to go about being sure i could get pregnant?",
            "post_id": "6929584",
            "timestamp": "1306184760",
            "user_id": "user_1692841",
            "user_link": "/personal_pages/user/1692841",
            "votes": "0"
        },
        {
            "answer": "i have had hypothyroidism since i was 8. i am 20 yrs old but although i dont want a kid at this moment in time, i am worried that within like 2 yrs i wont be able too. my thyroid was so bad that it is completely gone now so i have to take synthroid to even have one. i lose alot of my hair, which in turn freaks me out. but i was just seeking advice because i recently got engaged and now with all this wedding stuff and after comes a baby and my mother keeps telling me that i will probably have more miscarriages then kids. so i just wanted to know wht steps to take in being able to conceive.",
            "post_id": "6960759",
            "timestamp": "1307194505",
            "user_id": "user_1701817",
            "user_link": "/personal_pages/user/1701817",
            "votes": "0"
        },
        {
            "answer": "I was also born without my thyroid gland.  I was diagnosed at 10 days old.  I've been on synthroid for as long as I can remember and will be on it for the rest of my life.  My husband and I are trying to get pregnant again. I already have a 6 year old son.  The first time around was an accident and I honestly didn't regularly take my medication. I would forget so often.  Now, I take my medicine every single morning as soon as I wake up and it has made a HUGE difference in the way my body works.  I feel like a different person just by taking my synthroid like I should.  Everyone keep your fingers crossed that we get pregnant again.  It can happen for you, too...just please make sure you are managing it the way it should be.",
            "post_id": "7012508",
            "timestamp": "1308857319",
            "user_id": "user_1716617",
            "user_link": "/personal_pages/user/1716617",
            "votes": "0"
        },
        {
            "answer": "I am a 35 year old mother of a beautiful 17 1/2 month old little girl and was diagnosed with hashimotos thyroiditis and hypothyroidism about 3 months before I conceived the first time, I have my blood drawn every 2 months and had my medication adjusted from 175mcg daily to 200mcg daily 1 month ago. My husband and I are trying to conceive baby number 2 and have been for the past 6 months, but not having any luck and I'm starting to get concerned--Can anyone give me some advice?  Thank you in advance",
            "post_id": "7105363",
            "timestamp": "1311895651",
            "user_id": "user_1750548",
            "user_link": "/personal_pages/user/1750548",
            "votes": "0"
        },
        {
            "answer": "I am  28 yr old, I found out in the beging of june i have Hypothyriodism and it is now under controll and was wanting to know if anyone has been able to get pregnant right after getting there hypothyriodism undercontrol if not how lond did it take",
            "post_id": "7109959",
            "timestamp": "1312062572",
            "user_id": "user_1751854",
            "user_link": "/personal_pages/user/1751854",
            "votes": "0"
        },
        {
            "answer": "I have had hypothyroidism my entire life. i am 22 years old I was born without a thyroid and me and my boyfriend are trying to conceive. How do i go about asking my doctor about this? How long will it take after i get my thyroid under control?",
            "post_id": "7135781",
            "timestamp": "1312909489",
            "user_id": "user_1692841",
            "user_link": "/personal_pages/user/1692841",
            "votes": "0"
        },
        {
            "answer": "Hi. I have hypothyroidism too and is on meds. I wanted to know were you ever successful in getting pregnant?",
            "post_id": "7214245",
            "timestamp": "1315280094",
            "user_id": "user_1791389",
            "user_link": "/personal_pages/user/1791389",
            "votes": "0"
        },
        {
            "answer": "I have been trying to get pregnant for almost 2 years now and only recently did they found out that I had an underactive thyroid.  I am on meds and my levels have come down tremendously, but I was wondering if I can still fall pregnant even though my levels are not quite there but almost.Thanks",
            "post_id": "7235666",
            "timestamp": "1315918119",
            "user_id": "user_1801602",
            "user_link": "/personal_pages/user/1801602",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hypothroidism in June 2010 after I had a miscarriage. I had three miscarriages prior to that. I do have a 13 year old daughter so I know my thyroid was not underactive then. However, my doctor said it is possible to get pregnant it just might take awhile or I might need fertility treatments to help.  My periods are irregular as well so it makes it hard to figure out when I am ovulating. I track my periods every month to see how long my cycles are and when I will possibly ovulate. I heard you should try to have intercourse every other day for the 2 weeks before you ovulate. Some months you might not even ovulate! Now that I am tracking monthly I will try for 6 more months but if nothing happens I think I might get some help. Has anyone had a successful pregnancy AFTER diagnosis of hypothyroidism? Also, does having this affect the baby in any way?",
            "post_id": "7237174",
            "timestamp": "1315947627",
            "user_id": "user_1802259",
            "user_link": "/personal_pages/user/1802259",
            "votes": "0"
        },
        {
            "answer": "i was diagnosised with hyper after i lost my baby at 18 weeks sept 02.10 had two m/c shortly after decided to do radation and now i have hypo i am 27 weeks pg. with lost of pg. problems but nothing to do with being hypo. So yes you can get pregnant with hypo and even though I have it it seems like it hasn't slowed down anything for me.",
            "post_id": "7237416",
            "timestamp": "1315953051",
            "user_id": "user_561393",
            "user_link": "/personal_pages/user/561393",
            "votes": "0"
        },
        {
            "answer": "hey guys im 20 years old and have just been diagnosed with hypothyroidism, i came of the pill 5 months ago and havent hadf a period since they sent me for blood tests and realised i have hypothyroidism. my partner and i have been trying to get pregnant for 5months and have had no joy is this down to the no periods or the thyroid any tips or advice please!!! very stressed and worried! x",
            "post_id": "7323640",
            "timestamp": "1318614499",
            "user_id": "user_1840655",
            "user_link": "/personal_pages/user/1840655",
            "votes": "0"
        },
        {
            "answer": "hey guys im 20 years old and have just been diagnosed with hypothyroidism, i came of the pill 5 months ago and havent hadf a period since they sent me for blood tests and realised i have hypothyroidism. my partner and i have been trying to get pregnant for 5months and have had no joy is this down to the no periods or the thyroid any tips or advice please!!! very stressed and worried! x",
            "post_id": "7323652",
            "timestamp": "1318614710",
            "user_id": "user_1840655",
            "user_link": "/personal_pages/user/1840655",
            "votes": "0"
        },
        {
            "answer": "hi, i am 21 and i have hypothyroidism my whole life, i am now engaged and my fiance has hypothyroidism aswell, any one now wat are my chances of having i child as we been trying for a yr and hlf and nothingthanks",
            "post_id": "7338645",
            "timestamp": "1319063621",
            "user_id": "user_1847401",
            "user_link": "/personal_pages/user/1847401",
            "votes": "0"
        },
        {
            "answer": "I am 6 weeks pregnant and having thyroid.My levels areTotal Triiodothyronine (T3) - 1.21 ng/mlTotal Thyroxine (T4) - 11.50 ug/dlThyroid Stimulating Hormone (TSH) - 0.01 uIU/mlPls suggest me solution....Santhi",
            "post_id": "7343094",
            "timestamp": "1319196513",
            "user_id": "user_1849178",
            "user_link": "/personal_pages/user/1849178",
            "votes": "0"
        },
        {
            "answer": "Does it mess up your periods and is it like menopause?",
            "post_id": "7428371",
            "timestamp": "1321837551",
            "user_id": "user_1906192",
            "user_link": "/personal_pages/user/1906192",
            "votes": "0"
        },
        {
            "answer": "Hi i have hyperthyroidism,was diagnosed 2weeks ago, we've been trying for a baby for 3months now but with no success, just wanted no if any one else is trying an its not working. oh i have 3 children so i no i can have them. Thank you in advance",
            "post_id": "7441662",
            "timestamp": "1322230515",
            "user_id": "user_1913286",
            "user_link": "/personal_pages/user/1913286",
            "votes": "0"
        },
        {
            "answer": "Hi everyone, i was diagnosed with Hashis last year and have finally got my hormone levels under control. I was on the pill (contraceptive) for 2 years and now have stopped as i would like to have a baby. One thing my specialist told me was that some woman with hashis develop premature ovarian failure (POF) (no ovulation, therefore no period and no baby). i havent had my period since stopping the pill and im worried it could be POF. Has anyone heard about this?",
            "post_id": "7476928",
            "timestamp": "1323248450",
            "user_id": "user_1931483",
            "user_link": "/personal_pages/user/1931483",
            "votes": "0"
        },
        {
            "answer": "I had hyperthyroidism, til I had the surgery 6 yrs ago. Before that I have problems even getting pregnant. Once they removed my thyroid glands, I got pregnant within that next year, but miscarriaged, also miscarriaged two more times after that period as well. I couldn't believe it, cause my ob/gyn knew I had thyroid disease n did nothing to prevent me from miscarring. So stay on top of your ob/gyn to montior your thyroid before you try and after you succeed... By 3 loses.",
            "post_id": "7483557",
            "timestamp": "1323434990",
            "user_id": "user_1934423",
            "user_link": "/personal_pages/user/1934423",
            "votes": "0"
        },
        {
            "answer": "i to have hypothyroidism i found out after a year of trying to get pregnant with no luck. my ob found out and before i could start meds i had finally got pregnant however four months along i mc. i noticed one of ur questions was about irregular periods i two only had maybe two periods in a year time span! but since my mc i have had a normal period first and now month two im having a period that has seemed to stay for two weeks! doc says that my thyriod is off track yet again. ill be praying for you i understand the pain that goes with the desire to have a baby!!! good luck",
            "post_id": "7518238",
            "timestamp": "1324515044",
            "user_id": "user_1950440",
            "user_link": "/personal_pages/user/1950440",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with Hashimoto's disease in March 2009 and began taking Synthroid. It took them a little while to regulate me, but I eventually did become regulated around July 2011. My boyfriend and I started trying to have a baby in August and conceived 6 weeks later. Thankfully, my levels remained stable so far without having to increase my meds. I am 15 weeks pregnant and baby is measuring big and doing well. I definitely recommend regulating your levels and then getting them checked the moment you become pregnant and every 6 weeks after. If you stay medicated your pregnancy will progress fine.",
            "post_id": "7525127",
            "timestamp": "1324765594",
            "user_id": "user_1953397",
            "user_link": "/personal_pages/user/1953397",
            "votes": "0"
        },
        {
            "answer": "I have Hashimoto's and am 27. I was diagnosed 11 years ago at 16. I have had two children and actually had to decrease my synthroid with the first pregnancy so I stopped taking it. After my first child, my periods were irregular, not breastfeeding, and had about 4 in 9 months when I got pregnant with number two. Had a normal pregnancy off of meds but about 2 months after I had number two I crashed. My tsh was 97 and I couldn't keep my eyes open. I started taking the synthroid again. My youngest is now 6. I had one mc about 4 years ago and have been ttc for over a year this time. I found a pcp who lets me adjust my meds by my levels and how I feel. She let me start taking cytomel along with synthroid and feel better then ever. Except my cycles kept getting longer, between 33-45 days between periods. I adjusted my meds after having labs drawn last month and this cycle was actually 31 days!!! I'm so excited, I was able to take my thyroid into my own hands and adjust meds based on what I think my levels should be and it worked!!! I can't wait to see how long it takes to get preggo now that my levels are better. Do your research, join a thyroid forum and find a doctor who is willing to work with you. Of course I am a RN so that might be why my doctor lets me change doses when I ask!!! I'm so proud of myself though!!!",
            "post_id": "7527967",
            "timestamp": "1324920863",
            "user_id": "user_122642",
            "user_link": "/personal_pages/user/122642",
            "votes": "0"
        },
        {
            "answer": "Hi..My situation is similar. Can you please let me know about the delivery and health of your baby?--Minipriyanka",
            "post_id": "7557623",
            "timestamp": "1325760698",
            "user_id": "user_1896381",
            "user_link": "/personal_pages/user/1896381",
            "votes": "0"
        },
        {
            "answer": "i am also hypothyroid, i have 2 healthy babies, i didnt not know i was hypothyroid until after my first was born and he was fine i had a great pregnancy with no problems. my doc didnt act like it was a huge deal so i ofcorse NEVER took my synthroid like i was supposed to the low and behold i was on birth control and PREGNANT even with my messed up periods (maybe one every 4 months) had yet another safe easy and full term pregnancy. i think it is just that everyones body is different! i wish you good luck!",
            "post_id": "7601791",
            "timestamp": "1326919721",
            "user_id": "user_1991942",
            "user_link": "/personal_pages/user/1991942",
            "votes": "0"
        },
        {
            "answer": "HI, I'm 22 and I have had hypothyroidism since I was 15. I get my levels checked often. I'm just wondering if I'm on the correct dosage will I still have a hard time getting pregnant? Will I still have a high risk of having miscarriages?? Thanks for your help!!",
            "post_id": "7612008",
            "timestamp": "1327217761",
            "user_id": "user_1996879",
            "user_link": "/personal_pages/user/1996879",
            "votes": "0"
        },
        {
            "answer": "How long were you on medication before you got pregnant?",
            "post_id": "7638135",
            "timestamp": "1327956754",
            "user_id": "user_2009918",
            "user_link": "/personal_pages/user/2009918",
            "votes": "0"
        },
        {
            "answer": "Hey I'm 21 years old and was diagnosed with hypothyroidism when I was 18. I have I guess an unusual case I suppose you would say, instead of being over weight I'm underweight, I'm only 100 pds an 5'5.. I just wanted to know if anyone else is like that and are able to have children? I really want them one day in near future, I hear so many horrible stories about not being able to get pregnant with this disease..?",
            "post_id": "7690159",
            "timestamp": "1329454186",
            "user_id": "user_2034189",
            "user_link": "/personal_pages/user/2034189",
            "votes": "0"
        },
        {
            "answer": "Brooke1717,I just got diagnosed several months ago too and I'm in the same boat. I'm 5'7\" and only 105 lbs. I lost a lot of weight. And I'm only 24 years old so I'm wondering the same exact thing!",
            "post_id": "7698714",
            "timestamp": "1329710004",
            "user_id": "user_2038066",
            "user_link": "/personal_pages/user/2038066",
            "votes": "0"
        },
        {
            "answer": "I am 36 years old and am about 7 weeks pregnant (totally unexpected).. I have Hashimoto's and high blood pressure.. both controlled by meds.. but I think my hashimoto's is acting up.. my thighs and hands go numb.. I have 3 beatiful children a 14 yr old son, a 7 yr old son (whom we just found out has hashimoto's too with a tsh of 686.2!) and a 6 year old daughter.. I am scared to death!  Not only for this pregnancy but for myself (I know that sounds selfish).. I don't know why I feel so nervous about this pregnancy.. I just don't feel good about it at all.. my husband isn't helping matters much.. he told me he's scared something is going to happen to me.. and he is not capable of taking care of them (especially the way I do)..  Am I over thinking..  Am I silly to worry about this?  I was not worried about like this with any of my other pregnancies.",
            "post_id": "7714912",
            "timestamp": "1330138716",
            "user_id": "user_2046945",
            "user_link": "/personal_pages/user/2046945",
            "votes": "0"
        },
        {
            "answer": "hi, i'm 17 years old and i have a over active thyroid, i know all the facts about hypothyroidism, and i am extremely scared in many ways, i know i am very young to have a baby, and i accept that i have to wait, i have always wanted to be a mummy, and i am scared now i wont be able to be, or that i will be effecting my baby through my illness, i like everybody want a healthy baby, but im so scared i wont, as soon as this medication is settling, in 2 years ish me and my partner have said we will try, i'm young yes, but im already living with him and we are planning of getting engaged soon, so we are very strong, i have explained to him that i don't know how i would deal with a miscarriage knowing how common they are with this illness, is there a chance i will go through pregnancy and birth normally and will have no problems and my child will be fine? thank you. sophie x",
            "post_id": "8078989",
            "timestamp": "1340535788",
            "user_id": "user_3059209",
            "user_link": "/personal_pages/user/3059209",
            "votes": "0"
        },
        {
            "answer": "I have hyper thyroid too and i have had 3 miscarriages and i was told it would take awhile as well i don't know what to do. I have been trying for 2 long years. Anyone have any suggestions?",
            "post_id": "8117760",
            "timestamp": "1341656770",
            "user_id": "user_3110285",
            "user_link": "/personal_pages/user/3110285",
            "votes": "0"
        },
        {
            "answer": "I am 22 years old and my husband and I have been trying to get pregnant for the past 5-6 months. We found out at that beggining that I have hypotyroidism. My levels were normal but them shot up to 44.9 within three months! then they lowered to an 8 and are now a 4. Every month is another dissappointment because nobody else we know has this conditon and i'm just looking for support. I also have type 1 diabetes and have been keeping that under perfect control. I go ever 4 weeks to have my blood pulled to check my thyroid. I am just hoping that by the end of this month everything will check out ok and by next month we'll have a positive pg test. I sympathize for everyone who is going through this exact same thing and God bless the ones who have suffered misscarriages.",
            "post_id": "8131767",
            "timestamp": "1342053952",
            "user_id": "user_3120274",
            "user_link": "/personal_pages/user/3120274",
            "votes": "0"
        },
        {
            "answer": "hi i m cherry i m 21yrs old , by birth i m suffering frm hypothyroidism i m getting fear that i will become pg or not aftr marriage plz reply me",
            "post_id": "8218188",
            "timestamp": "1344429732",
            "user_id": "user_3178671",
            "user_link": "/personal_pages/user/3178671",
            "votes": "0"
        },
        {
            "answer": "I'm not sure if you have managed to get pregnant or not, but you need to get your TSH below 2.5 before you get pregnant. I had 2 miscarriages before I found out that I have hypothyroidism. Within 2 months of stabilizing my dose, I got pregnant for the third time and now have a 2 year old little girl. You will need to have your levels checked every 4-6 weeks and 4 weeks after any adjustment to your dose. During your first trimester your dose may increase by about 25% to 30% or about 2 extra doses a week. And here's a tip, the morning that you get your Big Fat Positive pregnancy test, double your dose and take 2 pills and call your doctor to have blood work done. I was diagnosed with hypothyroidism about 4 years ago, but I'm also a pharmacist so I've done the research too! I'm now pregnant again and keeping my fingers crossed....I hope this helps you and I'm wishing you so much luck!  Take care.",
            "post_id": "8299403",
            "timestamp": "1346778981",
            "user_id": "user_3242048",
            "user_link": "/personal_pages/user/3242048",
            "votes": "0"
        },
        {
            "answer": "i only read the first couple of posts so I appologize if I'm repeating someone but this is what I have learned...first of all I am 28 and I was diagnosed as hypothyroid at 11 months old. My endocrinologist told me to take my synthroid when I first get up in the morning and 30 minutes before I eat or drink ANYTHING except water and at least 4 hours before taking any vitamins and minerals. Food and water can disrupt the proper absorption of synthroid. i am getting married in 2 weeks and we want to start trying to have a baby ASAP just incase I cant so that we can find that out sooner than later.",
            "post_id": "8336551",
            "timestamp": "1347894512",
            "user_id": "user_3692027",
            "user_link": "/personal_pages/user/3692027",
            "votes": "0"
        },
        {
            "answer": "My main symptom for hypothyroidism was weight gain.  I knew that something was wrong when I started working out a lot (P90X) 7 days a week and was still gaining weight.  After I was diagnosed I realized that the daily naseau and the aches and pains were caused by hypothyroidism as well.",
            "post_id": "8431767",
            "timestamp": "1350581290",
            "user_id": "user_4171530",
            "user_link": "/personal_pages/user/4171530",
            "votes": "0"
        },
        {
            "answer": "Im 26 years old and hadthe radioactive iodine pill to kill of my thyroid, worst mistake id rather be hyper than hypo.  been taking synthroid for 3 to 4 years now and just reacently got my birth control implant taken out.  took  hormone pills to bring on a period.  it took a month after that to have a peroid that only lasted 4 days and was lite. then a month past and no cycle. just had a cycle.  me and my husband want to have a  baby together . i had two boys when i was in my teenage years 14 and 16 yrs old.  but want  to be able to give my husband  a child  of his own.  im so scared i wont be able to do that please help me out with any advice tha nks  amanda",
            "post_id": "8545829",
            "timestamp": "1353732380",
            "user_id": "user_4381370",
            "user_link": "/personal_pages/user/4381370",
            "votes": "0"
        },
        {
            "answer": "Finally someone with similar problems as me. We are also TTC for about a year, I have been getting regular periods since forever although i had a long adjustment time after going off the pill, not sure if Im ovulating (dr said chances are that i am, because I can set a clock to when my period starts). Last time my TSH levels were checked they were alright. Whats really upsetting me is everyone else seems to be popping kids out no probs, but we've practically been trying for longer. Are you going to a doctor or specialist yet?",
            "post_id": "8713102",
            "timestamp": "1357755454",
            "user_id": "user_4666844",
            "user_link": "/personal_pages/user/4666844",
            "votes": "0"
        },
        {
            "answer": "Hi i have hypothyroid since 2010 but first i was hyperthyroid  ive been trying to get prego n nothing docs. Told me i cant get prego cause of my hypo.  i really lost hopes ob getting prego i mean i thank god i have one 6yr old boy but just wanted aleast one more do u think its true what the docs told me",
            "post_id": "8772019",
            "timestamp": "1359003069",
            "user_id": "user_4774901",
            "user_link": "/personal_pages/user/4774901",
            "votes": "1"
        },
        {
            "answer": "Hi i have hypothyroid since 2010 but first i was hyperthyroid  ive been trying to get prego n nothing docs. Told me i cant get prego cause of my hypo.  i really lost hopes ob getting prego i mean i thank god i have one 6yr old boy but just wanted aleast one more do u think its true what the docs told me",
            "post_id": "8772026",
            "timestamp": "1359003118",
            "user_id": "user_4774901",
            "user_link": "/personal_pages/user/4774901",
            "votes": "0"
        },
        {
            "answer": "hey my name is Melony an i have hypothyroid as well everyone is a little different when it comes to levels only YOUR doctor will know your body like my doctor says I'm fine but my levels are well over 200.0 which is suposable  fine lol i cant conceive or ever have kids she said and if i do ill have a miscarige or the child will have a birth defect. i found out i had hypothyroid when i was 16 and i am about to be 21. and i only weigh 120 so everyone is a little different, come to find out you can switch as well. people can be hypothyroid for year then become hyperthyroid. it all depends on what your body can handle to regulate your body to what your body considers normal. if that makes sense i hope what i said helped an didnt confus you even more",
            "post_id": "8886899",
            "timestamp": "1361996852",
            "user_id": "user_4989016",
            "user_link": "/personal_pages/user/4989016",
            "votes": "0"
        },
        {
            "answer": "Your post matched me perfectly. I am going thru the same things you were going through back in 2004. I was told I had hypothyroidism about 6 weeks ago and my meds were just recently increased. I will have been married a year in June and went off of my birth control in September! Its crazy that we have almost the exact timeline!My doctor never told me that I needed to wait or anything. As a matter of fact, my doctor never told me anything about it :( I've found out everything by searching on the internet.I was just curious if you had any problems conceiving after you had made yours posts? And if you had a perfect, heathy, pregnancy?",
            "post_id": "8952266",
            "timestamp": "1363901250",
            "user_id": "user_5121548",
            "user_link": "/personal_pages/user/5121548",
            "votes": "0"
        },
        {
            "answer": "I gained 65 pounds in 6 months :( Thats how I knew something was wrong. Went to the doctor an bam - I have the hypothyroidism. I feel like crap all the time. Always tired, sluggish, kind of moody. My DR just recently increased my meds as my hormone level was still too high but I feel worse being on this new dose. I felt a lot better on the previous dose but im guessing my body is just still trying to regulate. I am hoping to get it all straightened out. I am wanting to soon have a baby. Have been slowly trying and nothing..",
            "post_id": "8952285",
            "timestamp": "1363901555",
            "user_id": "user_5121548",
            "user_link": "/personal_pages/user/5121548",
            "votes": "0"
        },
        {
            "answer": "I have Hypo Thyroid and I was pregnant but I didn't know. I had a miscarriage and since I haven't thought about having a baby,  if it happens it happens if not only God Almighty knows. Put one thing I will tell those who want to conceive...Just dont think about it and let it happen naturally. I thought i was pregnant when i saw my period only for 3 to 4 days and its was light and dark brown. I read so much about stories of short brown and light periods and negative pregnancy...Sometimes you have to not think about it and let God give you a baby girl or boy...Just in his time. I have faith.  I will someday no matter how old i am I will have a baby.  Blessing to those who are planning. Be Blessed and think positive.",
            "post_id": "9089947",
            "timestamp": "1367893329",
            "user_id": "user_5433069",
            "user_link": "/personal_pages/user/5433069",
            "votes": "0"
        },
        {
            "answer": "My first pregnancy was ectopic.docters removed my baby and close my right tube.from three years iam waiting for another pregnancy and I have hypothyroid.is there any chance for pregnancy and what should I have to do? Pls help me",
            "post_id": "9090177",
            "timestamp": "1367899247",
            "user_id": "user_5433473",
            "user_link": "/personal_pages/user/5433473",
            "votes": "0"
        },
        {
            "answer": "Im clarissa 24 years old i have Hypothyroidism.. since i was 17... got operated and Radio active iodine.. i am planning to settle anytime but i have  problem getting pregnant.. we really wanted to have a baby.. but until now i am not getting pregnant yet.. :(",
            "post_id": "9135596",
            "timestamp": "1369293143",
            "user_id": "user_5529098",
            "user_link": "/personal_pages/user/5529098",
            "votes": "0"
        },
        {
            "answer": "I was just increased in my thyroid medication from 150 to 175 how lng will it take to start working so we can get pregnatn?",
            "post_id": "9271611",
            "timestamp": "1373321283",
            "user_id": "user_5735799",
            "user_link": "/personal_pages/user/5735799",
            "votes": "0"
        },
        {
            "answer": "Hello, My name is Ashley and I was just reading on your comment that you have Hypothyroidism and I was just wandering how you got pregnant with it? I have it and am having problems conceiving, I'm really wanting to become pregnant. But I just don't know what to do to help me :/. Is there anyway you can give me some ideas or tips on how to? I would love it!!",
            "post_id": "9389104",
            "timestamp": "1376525182",
            "user_id": "user_5910525",
            "user_link": "/personal_pages/user/5910525",
            "votes": "1"
        },
        {
            "answer": "Hello Everyone,  I am 30 yrs old and I have Hypo disease. I have had this for a few years now and I have been unsuccessful in getting pregnant for the past 2 yrs now. According to the dr's my level are normal and where they want them to be, but I have not had a MS for 4 mths now. I don't know what to do. I really want to conceive because my husband and I love kids, but it seems impossible.",
            "post_id": "9405163",
            "timestamp": "1377017509",
            "user_id": "user_5937725",
            "user_link": "/personal_pages/user/5937725",
            "votes": "0"
        },
        {
            "answer": "hi i was also diagnosed with hypothyroidism 6 months ago, i am getting treated for it and manage to stabolise my TSH level, i have always ovulated and my period was regular (some months late) but always there, however now that i am stable i have been trying to get pregnant for 4 months and no luck, i do have a 20months old daughter but desperately want another one. i was told by the doctor that it could take a while for the body to get back to normal state even with a normal TSH so, i hope that answered your question, dont worry too much beacuse that could effect your chances even more,  and best of luck to both of us",
            "post_id": "9598841",
            "timestamp": "1382647440",
            "user_id": "user_6581984",
            "user_link": "/personal_pages/user/6581984",
            "votes": "0"
        },
        {
            "answer": "I have hypothyroidism and before I found I had been trying to conceive well I never could and it took over my whole life I was always wandering why, until about a month ago. Im taking meds for it and also birth control but I want to try to conceive again but ive only been taking birth control for about a month... And dont know weather my periods will stay regular or if i will go back to going a year or more without having one and truly dont know if i could even have a baby only being on my meds for a month? can someone give me some advise... thanks",
            "post_id": "11029478",
            "timestamp": "1409464107",
            "user_id": "user_10344932",
            "user_link": "/personal_pages/user/10344932",
            "votes": "0"
        },
        {
            "answer": "hi i want to get pregnant and I am hypo. i was wondering how long did it take you to realize you were pregnant?",
            "post_id": "11769604",
            "timestamp": "1420235609",
            "user_id": "user_11660780",
            "user_link": "/personal_pages/user/11660780",
            "votes": "0"
        },
        {
            "answer": "I am 27 years old, I was actually born with out a thyroid and I never knew that it could cause you to not being able to conceive, until I started to try and get pregnant. All of this information is so interesting. I am going to the gyno. Monday so wish me luck, I am hoping they can do something and we get pregnant soon, so beyond ready to make my family bigger (3 furbabies)... haha",
            "post_id": "12790926",
            "timestamp": "1434086511",
            "user_id": "user_14353862",
            "user_link": "/personal_pages/user/14353862",
            "votes": "0"
        },
        {
            "answer": "Hi everyone.these forums are new to me this is a first for me anyway here goes...We had ivf second lot one child from first.I had 2 embryos put in with a frozen embryo transfer.I bled on day 8 and also through to day 11- present 1 week today.mild period pain cramping one day after transfer.Pregnancy test on day 14, faint positive but noticeable.hcg done day after came back as 69 was told its fine.I knew it was low  progesterone 17.second hcg 2 days later 18 was told I'm having a miscarriage.I tried to say could I be losing a vanishing twin was told no.they Wont take any more hcg tests,no u/s nothing.I have a belly that's expanding at 4 weeks.now would be 4 weeks 4 days.not sure what to do.I'm on ivf climaval and progesterone and was told to stop treatment yesterday when told I was miscarrying.I'm thinking I have lost a twin and one is still inside so have kept going with the climaval and progesterone just in case .has anyone else had this? Also I have underactive thyroid am on levothyroxine now 100mg and hydrocortisone tablets 20mg a day.Would love there still to be a baby in there.",
            "post_id": "12840572",
            "timestamp": "1434894068",
            "user_id": "user_14493495",
            "user_link": "/personal_pages/user/14493495",
            "votes": "0"
        },
        {
            "answer": "I have had hypothyroidism since my middle 20s, now in my upper 30s. After a few months of getting married, I noticed my hair falling out a lot again. Went to the doctor to find out that my thyroid levels were very low. He doubled the dose of my medication and and within a month and a half I was pregnant. Not sure if that had anything to do with it but possibly. My periods are pretty regular, between 24-28 days never late. So the one day I was late, woke up extremely early to check and had a bright positive. I was only 4 weeks at the time. I was high risk during pregnancy and my doctors were all very worried for me and my baby cause I got hypertension and gestational diabetes. They didn&#39;t think I&#39;d make it past 30 weeks but I delivered a beautiful healthy baby boy naturally and am so blessed! All I can say is, don&#39;t give up hope! Miracles do happen!",
            "post_id": "14001280",
            "timestamp": "1473717901",
            "user_id": "user_19192500",
            "user_link": "/personal_pages/user/19192500",
            "votes": "1"
        }
    ],
    "post_id": "1055366",
    "question": "Just wanted some feeback on anyone who has hypothyroidism or knows someone who has it and was trying to get pregnant. I am waiting for my levels to come down before I start trying however I dont want to get my nerves in a tizzy about this before I know more about it. I just found out about this 6 weeks ago and have been on meds. The doctor just increased my meds to help bring the levels down even more. I wanted to start trying this month but need to wait 6 more weeks. Let me know of any stories (good or bad) with anyone with hypothyroid. Thanks",
    "timestamp": "1086152400",
    "title": "Trying to get pregnant with Hypothyroidism",
    "user_id": "user_70872",
    "user_link": "/personal_pages/user/70872"
}