{
    "answers": [
        {
            "answer": "You said at the beginning that you had a pituitary cyst - I'll bet that is what it is - I'm surprised that no Doctor you have has followed up on this!",
            "post_id": "11321239",
            "timestamp": "1413007351",
            "user_id": "user_80052",
            "user_link": "/personal_pages/user/80052",
            "votes": "0"
        },
        {
            "answer": "I had most of those symptoms you list and many more personally due to magnesium deficiency.  I've still have dopamine deficiency symptoms despite treating a ridiculously long list of nutrient deficiency states, hypothyroidism, adrenals, and exercising to help improve levels. I have noted some improvements but there might be some genetic element perhaps since my father has Parkinson's (depleted dopamine).***Easy Immune System Health - Nearly Everyone has Signs of Magnesium Deficiency But They Don't Know It...\"What are some Signs of Magnesium Deficiency...So lets see what these magnesium deficiency symptoms look like:ConstipationHypertension or high blood pressureAnxietyDepressionInsomniaFatigueSound like anyone that you know?? It's practically the definition of all of the Symptoms of Fibromyalgia! Even high cholesterol, diabetes and osteoporosis are related to low levels of magnesium.Even some so-called 'Side Effects' of substances are actually due to the Magnesium Depletion that they cause- and are not really 'side effects' in and of themselves. For instance, you should ALWAYS take Magnesium and Vitamin D together to avoid any of the Vitamin D Side Effects that are (almost always) due to low magnesium!!Pain as one of the Signs of Magnesium DeficiencyPainful conditions can be due to magnesium deficiency. Especially conditions that are due to tenseness and tightness- even if you don't know that you are tense or tight, if you have these pain conditions, it's likely that you are. Conditions like:Muscle CrampsChronic Back PainMagnesium for MigrainesMuscular PainTendonitisANYTHING that makes you tense and tight could potentially be due to magnesium deficiency. Even anger, aggression, ADHD, insomnia and obsessive compulsive disorder are Signs of Magnesium Deficiency until proven otherwise. If you can’t relax or you can’t stop, then it is likely that this is a symptom of magnesium deficiency.\"Similarly, patients with diagnoses of depression, epilepsy, diabetes mellitus, tremor, Parkinsonism, arrhythmias, circulatory disturbances (stroke, cardiac infarction, arteriosclerosis), hypertension, migraine, cluster headache, cramps, neuro-vegetative disorders, abdominal pain, osteoporosis, asthma, stress dependent disorders, tinnitus, ataxia, confusion, preeclampsia, weakness, might also be consequences of the magnesium deficiency syndrome.\"***Nutritional Healing - Dopamine Deficiency\"Dopamine deficiency signs/symptoms:Reduced ability to feel pleasureFlat, bored, apathetic and low enthusiasmDepressedLow drive and motivationDifficulty getting through a task even when interestingProcrastinator/little urgencyDifficulty paying attention and concentratingSlowed thinking and/or slow to learn new ideasCrave uppers (e.g. caffeine/nicotine/diet soft drinks)Use these to improve energy/motivation/moodProne to addictions (e.g. alcohol)/addictive personalityShy/introvertLow libido or impotenceMentally fatigued easily and physically fatigued easilySleep too much and trouble getting out of bedPut on weight easilyFamily history of alcoholism/ADD/ADHDDopamine levels may be low due to a combination of genetic and acquired reasons. Dopamine can be raised effectively using either nutrient based therapies or medications. Dopamine is synthesized form the amino acid tyrosine.Factors which reduce dopamine levels:Chronic stressInadequate sleepHypothyroidismLead, arsenic and cadmium exposureUnder-methylationTyrosine (precursor) deficiencyMagnesium, iron, zinc & vitamins B3/B6/C/D deficiencyExcess copper levelsGenetic dopamine receptor abnormalitiesChronic opioid, alcohol & marijuana useAdrenal insufficiencyGlutathione deficiencyParkinson's DiseaseInfluenzaEstrogen deficiencyHuman growth hormone deficiency\"",
            "post_id": "11321538",
            "timestamp": "1413013912",
            "user_id": "user_1756321",
            "user_link": "/personal_pages/user/1756321",
            "votes": "0"
        },
        {
            "answer": "A lot of your problems sound like exposure to a toxin of some sort that was able to cross the blood/brain barrier.  It could be reaction to psych meds in the tranquillizer class like Haldol, thorizine or even mild ones like respiradol (pardon my spelling), or an exposure to industrial toxins in the workplace, or even parasites that can attack organs including the brain and nervous system.  All of these will present with ticks, tremors, chronic nonspecific pain, problems walking (coordination) skin conditions, etc.  I would make an appointment with a Toxicologist. They specialize in your every symptom. I would at least try to rule out Toxins given your presentation.  A lot of doctors simply don't check for toxins or parasitic exposure.  I have Hepatic Encephalopathy, which causes ammonia toxicity and other toxins to build up in my blood and pass thru the blood/brain barrier, due to a cirrhotic liver, and it presents very similar to your symptomology. I wish you the best. Andy",
            "post_id": "11325512",
            "timestamp": "1413079258",
            "user_id": "user_10805050",
            "user_link": "/personal_pages/user/10805050",
            "votes": "0"
        },
        {
            "answer": "**Update**Well, I found out this last weekend that my Grandmother has a borderline thyroid issue, her sister has Hashimoto's disease, and their mother had a thyroid issue and a pituitary cyst (like me) that led to lymphoma cancer. After finally getting a call back from my GP's office, I informed them of this information and they still didn't want to do anything, so I had to ask for a T3 and T4 test to check those levels. I have not received the results yet, but my GP's nurse got to see how bad my tremors where and was mildly concerned. We also discussed my concern of the pituitary cyst and as they didn't have any record of it because it hadn't been transferred over, they would need that before doing any kind of testing or MRI scans. I turned that in earlier today but we will see.I also went to the Mental Health clinic in my area because I was refereed by my GP as he though I had somatoform disorder or bipolar or major depressive disorder. My consult counselor confirmed my thoughts that he was not doing his job and was deeply concerned about his lack of communication with me about my history, lacking of previous medical records. and my current medical records. They said my symptoms definitely seemed neurological or endo. based and would help me get the help that I needed whether it be referrals or meds to help with my symptoms but my intolerances will be considered while I am readjusting to all of these issues. They did rule out all of the above comments my GP had stated which was nice. Now to find a different GP who I can trust! lol Today has been a mild triumph in all respects. :)",
            "post_id": "11358244",
            "timestamp": "1413532329",
            "user_id": "user_10808136",
            "user_link": "/personal_pages/user/10808136",
            "votes": "0"
        },
        {
            "answer": "I have Hashimoto's thyroiditis (as mentioned I have hypothyroidism in my first answer). It was one of my causes of internal tremors and other neurological symptoms as well. I also had notable hand tremors when I was hyperthyroid. Other causes of internal tremors for me was magnesium deficiency and kidney failure.My TSH, free T4 and free T3 were in \"normal\" range for about 4 years although they weren't my normal.  Other labs showing my thyroid hormones in the blood weren't optimal included AST and ALT (liver enzymes) elevated, and my cholesterol started to rise as well.  Both my thyroid antibodies were elevated showing I had Hashimoto's thyroiditis. If you haven't requested thyroid antibodies I highly recommend doing so - thyroid peroxidase antibodies (TPOAb) and thyroglobulin antibodies (TgAb).",
            "post_id": "11358663",
            "timestamp": "1413544346",
            "user_id": "user_1756321",
            "user_link": "/personal_pages/user/1756321",
            "votes": "0"
        },
        {
            "answer": "Just got my last blood test results today but the doctor or his nurse will not be available till tomorrow to talk about it. Maybe someone here can help shed some light on these results:Anemia Results:IRON - 90 ug/dLTIBC 348 ug/dLCBC Results:BASO# - 0.10 K/uLBASO% - 0.6%EOSIN# - 0.00 K/uLEOSIN% - 0.4 %HCT - 51.0% - HIGHHGB - 17.3 g/dL - HIGHLYMPH# - 2.5 K/uLLYMPH% - 23.6%MCH - 31.0 pgMCHC - 33.8 g/dLMCV - 91.6 fLMONO# - 0.70 K/uLMONO% - 6.9%NEUT# - 7.20 K/uLNEUT% - 68.5%PLATELETS - 220 K/uLRBC - 5.57 M/uL - HIGHRDW - 12.6%WBC - 10.5 K/uLChemistries Results:ALBUMIN - 5.0 g/dLALK PHOS - 83 U/LANION GAP - 13 mmol/LALT (SGPT) - 144 U/L - HIGHAST (SGOT) - 66 U/L - HIGHBRILIRUBIN TOTAL - 1.1 mg/dLBUN - 10mg/dLBUN/CREAT RATIO - 11.8 RatioCALCIUM - 9.7 mg/dLCHLORIDE - 106 mmol/LCO2 - 22 mmol/LCREAT (IDMS tracable creatinie) - 0.85 mg/dLGLUCOSE - 89 mg/dL - not fastingPOTASSIUM - 3.8 mmol/LPROTEIN, TOTAL - 8.1 g/dLSODIUM - 141 mmol/LHepatitis Results all non-reactive:HEP BSAGHAV AB, (IGG,IGM)HBC, AB (IGG,IGM)Iron/IBC Results:%SAT - 26%FERRITIN - 71 ng/mLThyroid Results:TSH - 1.68 uIU/mLT4 FREE - 1.2 ng/dLT3 FREE - 3.5 pg/mL",
            "post_id": "11377096",
            "timestamp": "1413827275",
            "user_id": "user_10808136",
            "user_link": "/personal_pages/user/10808136",
            "votes": "0"
        },
        {
            "answer": "My sister was just diagnosed with Hashimoto's thyroiditis and her TSH was 0.4 mU/L with low in the range free T4 (TSH not responding properly to her free T4 levels). Not sure of your reference ranges for your free T4/T3. I had both AST and ALT (liver enzymes) elevated for years due to untreated Hashimoto's thyroiditis actually.Info from Dr Kaslow's article Red Blood Cell Count...\"The number of red blood cells is increased in:Chronic Respiratory InsufficiencyEmphysemaRespiratory distressLiving at a high altitudeCystic fibrosisNon-respiratoryAdrenal cortical hyperfunctionPolycythemia vera(often a hereditary problem)Anabolic Metabolism (testosterone use)Hemoglobin is increased in:Dehydration as might occur with prolonged or severe diarrhea.Emphysema, severe asthma, and other forms of long-standing respiratory distress.Macrocytosis (deficiency of B6, B12, folic acid, or hypothyroid)Adrenal cortex overactivity.Polycythemia vera.High altitude adaptationSplenic hypofunctionTestosterone supplementationThe conditions associated with an increased or decreased hematocrit are the same as for hemoglobin.\"",
            "post_id": "11381740",
            "timestamp": "1413879624",
            "user_id": "user_1756321",
            "user_link": "/personal_pages/user/1756321",
            "votes": "0"
        },
        {
            "answer": "Just an update:They think the elevated HCT, HGB, and RBC are due to living in an elevated area as they are just out of range. However they do not know what is causing the elevated levels of ALT and AST to be so high but not like with someone who has liver damage or liver/kidney dysfunction.I had an MRI with and without contrast on Monday evening. Everything was great until they added the MRI contrast which felt oddly warm and circulated my entire body. It was an odd sensation. I left feeling a little light headed and tired. After almost an hour later, I find that I have hives all over my stomach because I felt itchy. I'm still a little itchy. I took a warm bath which seemed to help a little but not a lot. I didn't let myself freak out but I did wonder what caused it. I stayed itchy and had hives and diarrhea most of the night. I finally figured out that it might have been the MRI contrast but I didn't think it was possible. I called up the facility Tuesday morning and they said yes, that was an allergic reaction. The hives were gone and the itching less and all seemed fine.I get up for my grave shift again  and I feel like crap. Just worn down, tired, and just had no energy. I noticed half way though my shift that I felt like I was breathing ice in a very warm room and my chest was mildly but noticeably constricted. I had an inhaler from the year prior that I kept in my purse so I wouldn't loose something so expensive but keep it clean. I had it for a really bad respiratory infection that developed over a couple week period but that's been it. The inhaler helped a lot but I was still worried. I called up the radiology department to see if this could be related. They said that this set of symptoms were outside of the time frame for the MRI contrast to be affecting me and to follow up with my Primary.I talked with my Primary who had just heard about the MRI contrast reaction about my current symptoms. He said my body could just be freaking out even though the MRI contrast was out of my system. He put my on 3 days of prednisone 40 mg (no tapering) and 2 antihistamines for now.I also had an appointment with a med provider who went over my symptoms to medications and was totally confused as to my reactions to most of the antidepressants at so low of dosages. She said most of the reactions my doctors had seen with my \"mania\" and \"depression\" were in fact caused by the medications themselves and antidepressants were not necessary at this time.",
            "post_id": "11443828",
            "timestamp": "1414780337",
            "user_id": "user_10808136",
            "user_link": "/personal_pages/user/10808136",
            "votes": "0"
        },
        {
            "answer": "***Another Update***So after a second appointment with the med provider, I found she was totally disregarding everything the previous therapist said in me having any kind of somatic disorder and wrote some really nasty things about me in my records. I promptly stopped seeing her but decided to see a counselor for someone to talk to while I am trying to deal with all of this. It's been really nice because she had medical issues herself prior and had to fight for treatment over several years.I also found two different primary's to see and will work in conjunction with as they each have their own specific backgrounds. The first is a N.D. who really knows her stuff and relies on her patients doing their homework on how to keep well. She focused on the endocrine system specifically the thyroid. The other doctor works for the hospital in their internal system and has more of a background in long term care and treatment/prevention of diseases.I met with the N.D. first and she was super laid back, interested, actually read my files and didn't have to really look at my records while we spoke. It was awesome. She thought that part of my issue was that my sensitivity to medication might be part of a genetic defect with MTHFR which can cause low methyl folate absorption and make the brain blood barrier thinner causing medications to affect me on a greater scale than the average person. In-order to prove this however, I would need a genotyping test which I am currently wait for results on from 23andMe.We also discussed some of the blood tests that had not been done and she would like done which were ANAb, TPOab, and Vitamin D. A couple days before I had a voluntary blood test provided by my work where anyone could come in and get tested. Everything was normal for the voluntary one except my C-Reactive Protiens were mid level \"Average risk\" and Vit D. was at 13 putting me at insufficient where 20-100 is acceptable but 60-100 is healthy.When I did the blood tests for the N.D. my Vit.D. was 10 putting me in deficient levels, my TPOab test was at 32 with some clinical averages being 35 for a thyroid autoimmune diseases, and my ANAb were a 1:80 with a speckled pattern but no definable grouping of specific antibodies.I was put on 15,000ui a day in-take of Vit.D with a 50,000ui shot each week for 6 weeks. This got cut short on the visit for week 3 as I had developed a rash on the injection sites on both hips. They think I had a reaction to the benzoic acid or the sesame oil in the shot and upped my daily intake to 20,000ui. I've also been 100mg taking phosphatidyl serine two times a day (two in the morning, and one at night) which has helped with the tremors and shakes and really calmed them down. I also have been taking an anti-viral solution as my N.D. can make her own herbal supplements. It contains Hypericum, Melissa, and licorice root which has really helped with the pain levels even though they still come and go. The only thing that ***** is that I can't miss a dose or delay it by more than a couple hours of everything starts to come back.I'll be meeting up with my N.D. this next week to discuss these results further and to potentially discuss seeing a rheumatologist.When I saw the hospital doctor the week after the N.D. he was totally thrown for a loop and said that my symptoms might warrant another check from a neurologist. I was told this neurologist does more testing than not and who's opinion is highly respected. I guess he's also a major springing board here as well to get to a major clinic if the need is seen. I get to see him in January.I'm also starting with a physical therapist to work on my gait issues and make sure my muscles do not continue to waist away.I've been doing research into my results above and found that there is a possibility that I might have hashimoto's thyroiditis at an early stage (also hinted at by my N.D.) which is totally manageable. I also did some research on the MTHFR potential issue and found that it could be located on the same gene as one of the many hashimoto's thyroiditis markers as well as one of the FaS gene which belongs to the tumor necrosis factor (TNF) family which can cause thyroid lymphoma.The MTHFR potential issue could also affect histamine destruction (created by low SAM levels) in the body causing psuedo-allergic reactions to anything but commonly to histamine rich foods.  It has been theorized so far that there is a very strong correlation between the MTHFR genetic defects (c677t being the most common) and auto-immune thyroid diseases such as graves disease and hashimoto's thyroiditis. Folate methylation is a huge part of your body's function and warrants in-depth research into many of the different ways it affects your body.Any and all of the above can be caused by a frame shift or deletion in the gene anywhere in the chain moving down. All of the above can be proven or dis-proven by the results from 23andMe which I am really excited for.Here are some of the studies/research I have found:http://www.ehrs.org.uk/schwelberger.pdfhttp://ajcn.nutrition.org/content/85/5/1185.full.pdfhttp://www.ncbi.nlm.nih.gov/pubmed/17490952http://www.ncbi.nlm.nih.gov/pubmed/21618891http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1429869/http://mthfr.net/forums/topic/histamine/http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3199434/http://mthfr.net/mthfr-and-thyroid-disorders/2013/07/18/https://www.youtube.com/watch?v=7WxQOn_CAHI#t=560http://www.snpedia.com/index.php/Rs652625http://www.snpedia.com/index.php/Rs80358238http://www.snpedia.com/index.php/Rs80358236http://www.snpedia.com/index.php/Rs80358237http://www.snpedia.com/index.php/Rs976881http://www.snpedia.com/index.php/Rs1061622http://www.snpedia.com/index.php/Rs5030772http://www.snpedia.com/index.php/Rs763110http://www.snpedia.com/index.php/Rs1801133http://www.snpedia.com/index.php/Rs1801131http://www.endocrineweb.com/conditions/hashimotos-thyroiditis/hashimotos-thyroiditis-complicationshttp://www.ncbi.nlm.nih.gov/pubmed/3141260http://www.ncbi.nlm.nih.gov/pubmed/2220394",
            "post_id": "11671795",
            "timestamp": "1418564770",
            "user_id": "user_10808136",
            "user_link": "/personal_pages/user/10808136",
            "votes": "0"
        }
    ],
    "post_id": "11317330",
    "question": "Hello, I apologize for this novel but I felt I needed to talk to someone about these issues. I have been having a host of issues for a year and a half now with symptoms such as an intermittent ataxic (almost spastic) gait, intermittent vertigo, chronic pain that radiates from the base of my skull to the tips of my fingers and toes that can be mild (like the sensitivity felt when sick) to the inability to have anything touch skin. I have also suffered from intermittent mild tremors, muscle twitches and jerks that occur all over my body. I have seen two general physicians, two neurologists, an ENT and an ENT specialist in vertigo. I have had a lot of workup for my issues but no solid diagnosis has been found. I have had several x-rays taken (head -sinus related, chest -pain related, abdominal - pain related) which were all clear during the begining of my illness. I have had an MRI that found a pituitary cyst that did not seem to be pressing on anything (also at the beginning of my illness) and I have had a whole host of blood tests that have come back within normal limits except for when my illness first started which was low dopamine levels. I had a hearing test denote partial low tone hearing loss(which has recovered). From March 2013 to August 2013 it was believed I suffered from sever viral labyrinthitus but they were unsure of what was causing my ataxic gait (before the tremors, twitches, jerks and extreme pain started). During this time I also developed dyshidrotic eczema that was thought to be athletes foot until this summer. I started taking physical therapy for vestibular rehabilitation. The tremors started the next month along with migraine like headaches where it felt as if my spine was being ripped from my head. After taking tylenol 3 to deal with the pain, my last neruologist suspected it had been a mild case of Miller Fisher Syndrom/bickerstaff encephalitis but the time for a spinal tap had long passed and would cause more harm than good and said at the rate my muscular weakness was that I should be completely recovered in about 6 months, but no other medications should be added into my cocktail of issues as it could just worsen them and inhibit my recovery. That was in October of last year. Life changes dictated that I had to move to a different town from where I was originally being seen and I was able to change my life style to a more comfortable one. By June I had felt as if I was up to 75% of my original health before my illness, by personal opinion with the occasional pain while attempting to work out. Mid june my dyshidrotic eczema spread to my hands and became unbearably scratchy so I sought treatment. I was given an anti fungal/coritcosteriod cream that cured most of it but switched to a pure coritcosteriod cream for consistent treatment. At the end of July, I encountered a significant relapse of inconsistent tremor and pain symptoms and felt devastated as all the progress I had made had deteriorated. My doctor said that beta-blockers and anti-depressants have been used successfully in pain management and would help with any depression I might be feeling. I have had horrible experiences with anti-depressants in the past and was reluctant in taking them but decided to give it another shot. He prescribed me ecitalopram to see if it would help. I suffered from insomnia and only being able to get 4 hours of sleep a night and an extremely elevated libido but no successful pain management after 3 weeks. We immediately stopped that one and proceeded to try wellbutrin xl for 3 weeks but he heavily focused on any depression I might have that appointment which concerned me because it was no longer focused on pain management. I tolerated wellbutrin xl well for the 3 weeks I was on it but it pushed my tremors from inconsistent mild to inconsistent moderate and impeded driving and everyday functionality. My last follow up appointment (three weeks after) almost focused solely on depression and none on pain management and he made a mistake on my medical record (which I feel very violated by and very concerned about). As we had not seen any improvement in mentality and pain did not seem to be affected with visible tremors, he said that there  was no reason to continue taking wellbutrin. I said that seeing as it was well tolerate and it seems to be generally used as a long term treatment that I would not mind trying to see if we received better results over the next month. He said that if we weren't seeing results now, we wouldn't seem them next month either and so to stop taking them and that I should go see a counselor/psychiatrist as they might have a better idea as to what is wrong with me. I stopped taking them on Friday and started to have anxiety for no reason and a sense of hopelessness as I was still dealing with pain and tremors and feeling that my doctor did not believe all my previous work up and symptoms. My symptoms worsened over the next couple days that included muscle cramps in weird areas such as the back of my skull, the knee cap, my neck, and my heels. I started having trouble sleeping more than four hours at a time where I would wake up with a racing resting heart (102) and high blood pressure (143/89) but was alleviated by sitting up. I felt very slow and had an inability to concentrate on anything due to lack of sleep. I developed a head twitch/tremor that I could not suppress by Monday evening. My muscle twitches, jerks and tremors became worse with the head twitch. I tried to deal with these symptoms till yesterday when my blood pressure no matter what was at or above 134/79 and heart rate was at or above 89bpm (my average heart resting blood pressure is 110/90 if not lower some times at usually 70 bpm) and my ataxic gait had returned full force. I called my doctor's facility about my symptoms and that I thought they were related to coming off the Wellbutrin and I was looking for ways to combat it. I found out that he had put in my records that I was going to continue to take the wellbutrin but he had never sent in a prescription refill (which would have been needed) which I get automatic updates for. I recounted this to the office with all of my symptoms and now my doctor wants me back on wellbutrin but will not see me in person and would like to do follow ups over the phone only. I have insisted this discrepancy be made clear on my record as it was not what was discussed and the effects it has had on me. I am still in the process of getting into a counselor/psychiatrist but I am not sure of what good this appointment will have.  I am currently back on wellbutrin but due to the affects it had on me, I'm not sure I would like to continue its usage. It has alleviated my symptoms of really high blood pressure and rate but not by a whole lot . So my questions are as followed: Is it legal or even standard practice to have follow appointments over the phone without being seen by your general physician while on anti-depressants or other drugs that should be consistently monitored? Why would my doctor be avoiding me coming to the office and not schedule a follow up with me when having me go back on wellbutrin again? Do you think my still trying to get into a counselor/psychiatrist will bring any insight or potential results to my symptoms? And last question, do you have any ideas or suggestions as to what could be causing my symptoms or things that I should bring up to present and future doctors to help me find a diagnosis? I am loosing hope that my life will ever be the same again and my range of mobility will be seriously impacted if not treated.",
    "timestamp": "1412959452",
    "title": "Undiagnosed symptoms - I need your help for health and legal questions",
    "user_id": "user_10808136",
    "user_link": "/personal_pages/user/10808136"
}