{
    "answers": [
        {
            "answer": "Im glad u have ur gestational diabetes undercontrol hun!well im 28wks along now, i have my antenatal tommorow which i am suppose to take the glucose drink etc, which i cant due to my silly alergies, so i will be having blood tests, wee wee tests and the pin pri ck test, i dont no how its going to work i think they are going to have to do the normal pri ck test quite often since they cant do the full normal testim going well it was my bday yesturday which i had been looking forward to for ages! and i am having a party on sat with all my family and friends so it will be nice to see them all before i have the babyim not too scared about the labour more about the baby being safe through it, and avoiding having to get a c-section or anything like that, i just want it to be natural and not complicated! loli REALLY dont want an epidural no way do i want one over my dead body do i want one! and i will not be allowed one unless there is specific reasons for a doctor to come in and give me one, it would only happen if there are complications i have been tolddo u get a choice nsrc?? i guess its different here it seems alot of stuff is! im just having my midwifes no docs unless there is a reason for them to get involved all of a suddenim still deciding weather or not to try to go away in may for a few days driving and going on a boat to the location no flying involved, its just a matter of if i will have energy and if its a good idea when im that far alonganyway enough of me blabbing i just woke up so sorry if this is a bit unreadable lol!xxxx love all u girlies hope ur all doing well!!",
            "post_id": "4229147",
            "timestamp": "1238540214",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "Well I am now at risk for preterm labour. It's been a rough 2 weeks but we are still hanging in. Last week I woke up to having contractions and spotting. The contractions were staying a steady 15 minutes apart but the spotting stopped within the first hour of waking. It then began again a few hours later and stopped within a half hour. I saw my doctor the following day. I was still having contractions but they were irregular. He confirmed that they weren't just BH, unfortunately. My water hasn't broken though which is deffinately a plus. I am on watch though and luckily, haven't been put on bed rest as I haven't dialated at all. But we can only pray that baby stays put for another couple months.Other than that though, baby is doing good. She is estimated to be 3 1/2 lbs already which is amazing as I have only gained 12 lbs this pregnancy so far. So my doctor is happy and is hopeful.",
            "post_id": "4229450",
            "timestamp": "1238544997",
            "user_id": "user_325289",
            "user_link": "/personal_pages/user/325289",
            "votes": "0"
        },
        {
            "answer": "Everything is good here.  I go on the 7th for my GD test and also for another ultrasound.  My daughters cord was very long and narrow at one end which is most likely why she went into soo much distress during labor and why she was only 15 3/4 in long and only  5 lb 3.5 oz and full term.  I ended up having a c section with her but it was an emergency one and unfortunately I wasnt totally numb and could feel it all till they knocked me out.  I am planning another c section this time just because I have fears of the same thing happening again.  At least this time I can go in and they wont be in such a rush and make sure I am numb.  I can tell you that when I was having contactions with her that when I got the epidural it was the greatest thing ever... of course I understand if you opt not to have one but I can tell you I didnt feel the needle going in and it helped SOOOOOOOOOOO much and it was sooo relaxing.  We are going to have a c section on June 17th.  I wish you all the best of luck.  I have only gained a pound and a half (I gained nothing with my daughter).",
            "post_id": "4230949",
            "timestamp": "1238589569",
            "user_id": "user_649670",
            "user_link": "/personal_pages/user/649670",
            "votes": "0"
        },
        {
            "answer": "Hello ladies,Im 70 days today!!!!!! Ten weeks, ten weeks, cant wait!!!! This weekend Im going to get her furnitures, Im so happy. Dont know yet when I will have baby shower, oh well.Yesterday I had app with sugar doc and Im doing fine, my sugar is under control, diet works so far and hopefuly will stay this way, the I had app with midwife and everything looks OK. Due to GD and some blood cloth on my placenda I will have another US in few weeks, Im so happy about this. I will be able to see how is she growing. This month will be very busy for me, next weekend is Easter, then I will have one weekend off- probably I will be doing something in my back yard and the following one will be my sons firt communion. Just after this the guy is coming do our floor in living room and kitchen so my house will be a mess for a week or so, my DH will put new cabinets in the kitchen and I will be ready to go to hospital!!!!I was scarred when they told me I have GD because very often they need to do C section and I dont know why Im so scared of this. I had my son with epidural and it was so good, i want have it again. Its puting less stess on mother and a baby. Nsrchofbaby- dont worry, tell them u are thinking about epidural so they will keep this in mind and they will ask u if u need it when the time will come, u always can say no. Midwife will know when they will be able to give it to u, its ussually about 1-3 hours before the delivery when the pain is the worst and when your body is ready to start pushing soon.Lissyloo- u can choose if u want have epidural or not (of course here, in Poland where Im from u can forget, they will not give u unless u will pay- big money). About doc and midwifes its your choice, if u have no problems u can go to midwife, if there will be any medical concern she will be not sure she will contact with doctor otherwise they are able do the whole pregnancy. I have a midwife- for few reasons, they have more flexible hours then doc but my friend she has a doc, she had in-vitro and she has a twins so a doc needs to really care about her. Durning the deliver (of course depends from hospital as well) there is ussually only midwife, doc come if there is any problem. When my son was born there was only midwife, doc came when my water didnt brake, she took care about this and left, she came back few minutes before my son was born, thats it.Good luck to all of u, keep in touch.I cant wait to hold my little girl, smell her and know she is OK.",
            "post_id": "4231029",
            "timestamp": "1238591978",
            "user_id": "user_686463",
            "user_link": "/personal_pages/user/686463",
            "votes": "0"
        },
        {
            "answer": "It's good to hear everyone's doing okay.  I am 28 weeks and counting down.  The glucose test results were good, so I am just waiting for another visit in 2 weeks to get my rhogam shot for rh negative blood.  I am having to take iron supplements in addition to prenatal vitamins, but otherwise things are fine.I was induced with my ds because they were afraid he was growth-restricted, so my hopes of no epidural quickly went out the window.  If I get induced again, I will DEFINITELY do an epidural, but if not I will probably try to go without one.  It wasn't a bad experience, but I would like to do it without one if possible.  It's funny because I was induced last time and I NEVER felt a contraction until the day I delivered, so I wonder what it would be like to go into labor in your own.  Take care, and it's great to hear from everyone.",
            "post_id": "4231660",
            "timestamp": "1238602948",
            "user_id": "user_552389",
            "user_link": "/personal_pages/user/552389",
            "votes": "0"
        },
        {
            "answer": "Lissyloo - We actually do get to choose whether or not we get an epidural or other form of pain medication unless there's a medical reason why we shouldn't. I think I'm definitely gonna try to tough it out as long as I can and hopefully I'll be able to make it all the way through. If things get to be too much, I'll probably ask for the epidural. I really hope that you aren't diagnosed with Gestational Diabetes, it's a tough road to take. It's worth it, but definitely difficult. I remember crying several times the first week on my new diet because it seemed like everyone was eating cake and cookies and all the good stuff and I couldn't. But now I'm amazed at how easy it is for me to say, \"sorry I can't have that.\" As far as travel goes, only do it if you feel 100% comfortable. Oh and I hope you have a blast on Saturday!!! :)bryanarae - I'm so sorry that you're going through all this during a time that should be happy and stress-free. But you're a strong girl and I'm sure you will do whatever is necessary so that your little one is nice and healthy. I will keep you in my prayers and hope that the little one stays in there as long as possible so that you don't have to deal with any complications at birth. Be strong and take it one day at a time. As far as weight gain goes, I've only gained 4 lbs to date and my dr doesn't seem worried at all. I'd gained 6 but then lost 2, I guess because my GD diet really sped up my metabolism. Anyhow, it sounds like your baby girl is doing really well. Take really good care of yourself to ensure that you're both healthy the day you finally meet. :)Kisstin - Your first delivery sounds like it must've been a nightmare! Awe, I'm so sorry you had to feel all that pain. But I'm sure all that seemed like a distant memory as soon as you met your little girl. It's good that you have a plan ahead of time for this delivery and that you kind of know what to expect. Hope this one runs a lot more smoothly. I think my main fear with the epidural is the needle itself. I hate them!! But for some reason I feel I've been really brave now that I'm pregnant, I've even watched my techs draw blood where before I would start crying and give myself a fever...LOL. Well I hope everything goes well for you through delivery and good luck on June 17th! :)asia4 - Exciting, exciting, exciting! I remember feeling that exact same way when I hit 30 weeks! It's kind of like you're finally on the homestretch. It sounds like you're gonna be extremely busy these next two months so they'll probably go by a lot faster for you. That's awesome. My husband and I have been discussing the possibility of getting the epidural to make labor a more pleasurable experience, I don't think my hubby wants to see me crying and in pain...LOL. But I also want to see what it's like to go all natural. So I guess we wont find out until that day. I'm so glad to hear that your GD is also under control, it actually means that you're less likely to require a c-section due to a large baby. So just keep at it and hopefully everything will go well for you through delivery. Good luck at your ultrasound, can't wait to see the pics!!! I'll be having another one in about 2-3 wks as well just to see how the baby is growing. I hope I get pics this time. I haven't gotten a pic since my first ultrasound! Well, good luck and keep in touch! :)We're almost there ladies, soon we'll be sharing baby pics with each other and hopefully we'll all remain this close and get to witness each other and our children grow. Take care.",
            "post_id": "4231736",
            "timestamp": "1238603979",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "So glad to hear that everything is going well for you! I hope you get to go into labor on your own this time so you get to choose whether or not you get the epidural. I'm also glad to hear you don't have GD. It's kind of tough. Take care. :)",
            "post_id": "4231756",
            "timestamp": "1238604259",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "Update on my antenatal app todayso ladies im 28wks and i had my antenatal todayi had a blood test since as i have said lots i cant have the glucose drink etcthe appointment went fine apart from me feeling a bit worried that they arnt testing things as much as they shouldi havent had a urine test since my first antenatal! i said today, i drank a bottle of water before i came in incase i need a urine test to check for pre eclapsima or what ever it is yada yada yadaand she said no we dont need to do a urine test... but i read that every antenatal u get a urine test?i dont no maby its not necissary but i just feel a bit worried that if somethings wrong they wont know itbabys heart beat is fine, i measured at 30 so i guess only a tiny bit bigger then how far along i amno need for an ultrasound or anything just another app in 1 month, then every 2wks after the next one then every wk...owel hopefully there is no need for them to check on things hopefully its a sign that all is wel...!",
            "post_id": "4234704",
            "timestamp": "1238672512",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "Glad to hear everything went well at your dr's appt. I do have to provide a urine sample at every appt so that it can be checked for protein. I think that's one of the ways they determine if you're at risk for preeclampsia but not too sure. I'm sure your dr just has his/her way of doing things but it's good that you also ask whenever you're in doubt about something. Hope everything continues to go well for you. :)",
            "post_id": "4235602",
            "timestamp": "1238691360",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "Hello all,I have exactly 10 weeks to go tomorrow....I can't wait.  This is my first one so I'm not real concerned about the labor but worried about being a good mom....I just hope I know what to do when the time comes :-)  I am 39 y/o and everything is going good so far.  No GD and my blood pressure seems to be holding up.  I have my last 4 week appt. with the ob/gyn today.I am definitely going to get an epidural.....I am too much of a wuss to go naturally.Good Luck to you all!!!!!",
            "post_id": "4235609",
            "timestamp": "1238691508",
            "user_id": "user_645849",
            "user_link": "/personal_pages/user/645849",
            "votes": "0"
        },
        {
            "answer": "Haha...I love your honesty about the epidural. I think we all worry about being good moms and knowing what to do. The fact that you're thinking about it this far in advance just means you'll probably do a great job when the time comes! Do you know if you'd like to have more than one child or are you going to wing it and decide as time passes?",
            "post_id": "4235876",
            "timestamp": "1238695478",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "as if u want an epidural IM SCARED OF THEM lol!!!i am not scared of needles just becoming a vegetable or paralised or something which i no is like 1 in a million chance that that would happen but yea im just paranoid loli dont get a choice in getting one anywayi guess ur rite nsrchofbaby the midwife team seems to do things a bit differently but i am still happy with them i cant wait till i go into labour i just wish the next few wks would fly by already lol",
            "post_id": "4242547",
            "timestamp": "1238731211",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "I'm 29 weeks 3 days as of Friday the 3rd April. I haven't had a GTT done on me yet for my risk of gestational diabetes. Strangely enough, it's not compulsory here in Germany, I only get it done if I request it, which I might do, since my little girl is measuring quite big, but they may also be because her father is big (and he was a big baby 9.5 lbs born with a big head auch!!!!).Regarding the birth, I'm really relaxed about it, it's my first child. If I can do a labour birth, will go for as long as possible without painkillers, I do believe your psyche plays a big role in pain. Am considering a water birth, but will definately like to use a tub in between.It's getting even more difficult to sleep as she is also quite active my little gymnast in there and she is fussy, doesn't like it when I lie in certain positions, then she protests a fair bit, which is rather cute I have to admit.I have been seeing a chirotherapist regarding my twisted pelvis, the pain has unfortunately come back so I will go again to see him soon, and hopefully this treatment is reducing my risk of having a c-section.The baby bed will come today or tomorrow, she will be staying with us for the first year, can't imagine leaving here on her own especially when I breastfeed. I will be working until start of 34 weeks and then the German law doesn't allow pregnant women to work, but they can if they want. I get paid full maternity leave from 34 weeks onwards until 8 weeks postpartum.Good luck to everyone ;.)",
            "post_id": "4242871",
            "timestamp": "1238744171",
            "user_id": "user_615752",
            "user_link": "/personal_pages/user/615752",
            "votes": "0"
        },
        {
            "answer": "To nsrchofbaby,Nope this is my one and only child....my motto is \"one and done\"!  :-)  The baby will have two older Half Sisters....so I'm okay with that.",
            "post_id": "4243280",
            "timestamp": "1238764214",
            "user_id": "user_645849",
            "user_link": "/personal_pages/user/645849",
            "votes": "0"
        },
        {
            "answer": "Im so happy everybody doing well. Next Tuesday I will start my single digit weeks, wow, 9 weeks to go!!! In one hand I want that happen tomorrow in the other I have so much stuff to do!!!!I dont know what is going on but all my bad symptoms came back- back pain, stomach problems, yesterday I thought I will end up in the bathroom!!!! Oh well, couldnt bo too good- right? And the worst is that sudenlly my sugar went high yesterday, was over 135 after each meal. Hope this was only one day thing and will not repeat.Idivecch5- u will be a good mom dont worry. I remember when I came back home with my son (8 years ago wow) and sit in my bed, I started crying, I didnt know anything, I had a problem with feeding him, changing, everything. I thought- Oh God what now??? I dont know how to take care about baby, I didnt have anybody there, my mom was in Poland and my ex-husband turned to be a jerk, not helping at all. All the time tired, sleepy, not sure if doing the right thing and guess what? my son is fine and he thinks he has the best mom in the world (well this is TRUTH!!) even with the pink hair (I just color my hair and instead get nice blond color I have something what is between pink, orange and strawberie). Now 8 years later I will have a baby again and what? Im scarred again if I will be a good mom, if I will know what to do and this fear its the same, not smaller.About epidural- I want one too, I had with my son and I want with my girl. Its true what they saying- happy mother happy kids. If u will be happy your baby will be too, baby can feel your paind, happines, everything. If you will be relaxed and happy so and your baby and remebr this. If any time in your life u will need to make any choice, any decision think first about yourself, as long you will be happy your kid will be too. I learend this in hard way but it was worth it.",
            "post_id": "4243370",
            "timestamp": "1238766535",
            "user_id": "user_686463",
            "user_link": "/personal_pages/user/686463",
            "votes": "0"
        },
        {
            "answer": "my new update i fell down the stairs yesterday anf fractured my left wrist or it could be broken. we couldn't xray maybe i get an mrt done",
            "post_id": "4246231",
            "timestamp": "1238827739",
            "user_id": "user_615752",
            "user_link": "/personal_pages/user/615752",
            "votes": "0"
        },
        {
            "answer": "Lissyloo - I hadn't thought about any of the possible negative side effects until you mentioned it, LOL. Maybe I wont get the epidural after all. My plan is to go as long as I can without meds and agree with zazou, your psyche going in plays a huge role! So I think we'll be fine either way. How has your experience been with the midwives? I think I would love to have all that personal attention. My dr's not too bad though, I always see him and only him.zazou - First off, I am so sorry you had that horrible fall yesterday! Is everything okay with the baby? And how are you feeling? I can't imagine dealing with all the little pregnancy pains plus a fractured wrist! Also, I think it would be a good idea for you to request the GTT just to make sure that your baby's size isn't attributed to uncontrolled GD. This could later lead to breathing problems with the little one and other medical complications at birth so it's just better to play it safe. Oh, I think I'd like to move to Germany, your maternity laws rule!!! LOL.ldivecch5 - Awe, so your baby will be very blessed at birth having two big sisters already. I think I'd like to have at least one boy and one girl but who knows? I'm hoping for two but I guess we'll see what my husband and I decide on down the road.asia4 - You're getting closer...exciting! I remember telling my husband \"only 8 or 9 more weekends of just you and me and then we'll have another little life to watch over.\" That really put things in perspective...LOL. I love the wisdom and the calm that comes with you being a second time mother, it just makes me feel like everything's gonna be okay. You just have this amazing attitude towards childbirth and parenting that kind of calms my fears. I'm glad someone is keeping it together because I may start to panic soon...haha.I'm so glad you're all doing well and are in good spirits. :)",
            "post_id": "4247850",
            "timestamp": "1238879029",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "Oh quick question for all of you:Do your baby's movements ever feel like he/she is shivering? I've noticed my little one does that quite often now, mostly when I'm in bed. Just wondering.",
            "post_id": "4247861",
            "timestamp": "1238879354",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "I have so little time to get on here anymore--I forget about this June forum! Sad! But I do have some updates--I will be 29 weeks tomorrow.I had my Gestational Diabetes test last Tuesday and do NOT have it--thank goodness. My number was 86 and the nurse said that was quite good. My Iron is good, and I was measuring 29 weeks. So a few days bigger, but not much.I also got my RhoGam shot since I have A- blood.I went and got a 4-D ultrasound which was amazing! If you havent done this, you really should! It is SO much neater than the 2-D. It looks just like a real baby! lol I mean I know it is--but it LOOKS like it with the 4-D, instead of looking like a skeleton the way it does on the 2-D. I felt so much more love for it, seeing it as a tiny real looking newborn!I did NOT find out the sex--though it is on the DVD. I turned away while she recorded that part! It yawned and it was SOOOO darling!! It was laying its head on the placenta like it was a pillow. lolI am feeling alright, just very tired. But what can I expect---being pregnant at 38, with an 18 month old toddler, and six other children too! ha ha ha",
            "post_id": "4248054",
            "timestamp": "1238884163",
            "user_id": "user_162279",
            "user_link": "/personal_pages/user/162279",
            "votes": "0"
        },
        {
            "answer": "i have also been told that if u have the drugs for the labour u feel so out of it and so does the baby after the birth, and i want to be as with it as possible when he arrives LOLbut the main thing with me is them stuffing the epi up because i know people that have had it happen but i no its not common so dont let it put u off if u need it or want ithas anyone been getting agonising cramps?in bed when ever i stretch my legs at night my calf musscles spasam go rock hard and cramp up to the point where ill be swearing and yelling waking my partner up! i read that its common to get leg cramps now and to try to eat a banana or milk before bed to help etc but i wanted to no if u guys have the same probits always my calf muscles and its sooo painful!",
            "post_id": "4248664",
            "timestamp": "1238900359",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "I've had the leg cramps several times in the last several weeks. I find that if you flex your muscle (point your toes towards your tummy instead of straight out) it passes really quickly or you can avoid it altogether. You can usually feel these cramps coming on so next time just flex your calf muscles right away and hopefully you wont have to wake your partner up for a massage and comforting. LOL.Jenny100 - I'm so glad you don't have Gestational Diabetes, it really is hard. I'm thinking about getting the 4D ultrasound done too, hopefully soon. I can't imagine how great it must be to see what your little one looks like before it arrives. I can't wait. Glad all else is well with you! Take care and keep in touch. :)",
            "post_id": "4248855",
            "timestamp": "1238905965",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "Had another ultrasound today and again he said it was a girl. THey were 90 percent sure last time.  C section is scheduled for June 17th... cant wait.",
            "post_id": "4329900",
            "timestamp": "1239143173",
            "user_id": "user_649670",
            "user_link": "/personal_pages/user/649670",
            "votes": "0"
        },
        {
            "answer": "Woohoo, Congratulations on the baby girl and your new due date!!! Go Pink Team! Okay okay and blue team, LOL. All our little bundles are amazing!Anyone know the official count of girls vs boys due on this forum? Last time we updated it was pretty even. :)",
            "post_id": "4332662",
            "timestamp": "1239212265",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "Ok ladies so I need some suggestions.  I am torn between 2 names for my baby girl.  Keep in mind my daughters name is Peyton.  What name do you like better?  Piper or Raegan?  I want to be different and I am leaning towards Piper because it goes well with Peyton.  Let me know.  Thanks.",
            "post_id": "4335853",
            "timestamp": "1239289176",
            "user_id": "user_649670",
            "user_link": "/personal_pages/user/649670",
            "votes": "0"
        },
        {
            "answer": "I think Piper and Peyton sounds adorable! You may want to post a poll on the forum so you can keep track of the votes. Oh, you could even use Raegan as the middle name, Piper Raegan sounds cute as a whole. :)",
            "post_id": "4336606",
            "timestamp": "1239302697",
            "user_id": "user_218701",
            "user_link": "/personal_pages/user/218701",
            "votes": "0"
        },
        {
            "answer": "well i am now 31 weeks 6 days... 32 weeks tomorrow... and so far all is going well. passed the 1 hr glucose test without a problem... havent had any issues to speak of aside from the recent bad heartburn and the feeling of my belly being hard CONSTANTLY which the doc said must just be stretching because if it was BH or real contractions then they would last for a few seconds and then subside... went to doc appt on wednesday april 8 and they did a ultrasound... which is estimating baby weighing about 4lb 11oz at that point. and now after 2 months they are telling me that i bought all of the pink stuff for nothing that i am actually having a boy. i am having another u/s next month and i will just wait until after that one before i start taking stuff back and putting things into consignment...lolother than that shocker all is going well.....leaking colostrum ALOT but that is normal i guess.",
            "post_id": "4341123",
            "timestamp": "1239405190",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        },
        {
            "answer": "oh my gosh is anyone els getting really annoying cravings now? mine have officially settled in and are driving me nutty lol",
            "post_id": "4354666",
            "timestamp": "1239757114",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "ok so Im 32 weeks today. Yesterday I had my regular appt and guess what? I told her that I had few really good contractions in past few days and I feel a presure down, like baby is very very low. She dicided to check this. Her eyes went very very big when she realized how low the baby is and my survix is so short. She send me right away to delivery department to be monitored, first 30min nothing and then I had like 12-15 contarctions, 2-3 minutes appart. They did all tests and it looks I will not go to labor in next 2-4 weeks but I have UTI and this costing me contractions. Of course I was also told to not to do anything, they alowed me to go to work and thats it otherwise they will put me in bed rest. Just great!!! I have the floor guys coming in couple of weeks to do my livingroom and kitchen!!! Oh well my hubby will have to take care about this.Im tired all the time, sleepy, yesterday I almost fall in sleep at work. My sugar is OK, its low, diet works.My baby shower is May 17th, hope I will make it!!!!Next Friday I will have another US, cant wait to see my little one again. She sound good yesterday, besides she kicks really good!!! My mather in low was loughing today that little girl is very acctive, it was a second time I was addmited to hospital with her, that we will have hands full after she will be born!!! I hope, that means she is healthy.Oh and I forgot to tell u - my hubby is depresed!! His dog is missing for almost a week now. We dont know what happened to her and he loves her so much, she was his baby, he had her before we meet, after he came back from Marines and she was his best friend and terapist. I feel so bad for him, I know how much he loves her.Im still hoping she will come back.",
            "post_id": "4356128",
            "timestamp": "1239800980",
            "user_id": "user_686463",
            "user_link": "/personal_pages/user/686463",
            "votes": "0"
        },
        {
            "answer": "im so sorry about everything asia and ur partner too i cant imagine how he feels because my dog is like my baby and i know how much id not cope if anything ever happend to him :( i really hope u guys get her backhopefully u get ur baby shower im worried i wont see mine on the 24th of may either!i had to go into the hospital last night they asked me to go in for a check up...i am having bh contractions, my groin really hurts and a few other things they just wanted to check onim carrying pretty low, and i got a call today from a midwife wanting to see me soon she thinks that because i was born 4wks early and my brother was 8wks early that i have a higher chance of being early tooand then to top it all off, my mother who has a scary 6th sence said wks ago to my auntys that they need to be at the hospital if i go into labour while shes away in may... then my mother inlaw calls up last night and says shes going away in may but she has a bad feeling ill have the baby while shes goneEVERYONE IS MAKING ME PARANOID!!!!!!i have to go to an appointment with the midwife that called me today they think that i need to talk to someone since im not coping to well with everythingdoes anyone els feel like this pregnancy has gone way to fast?I dont have anything ready yet!!!",
            "post_id": "4363563",
            "timestamp": "1239946605",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "I dont have feeling that everything went to fast however I dont have everything ready yet. I still dont have crib but If the worst will come my husband will go to the store and get it. I dont worry about this. I worry about not going to the labor in May. Between my GD and contarctions I have, with short cervix and the baby being so low I have pretty big chance on premature baby. I really dont want premature baby, I dont want leave my baby at hospital for few weeks.Im on the phone right now with doc office. After I was admited to hospiatal they told me I have UTI, then next day they told me I dont have one. Im calling to find out what is going on. In the hospital they explained to me I have a contarctions due to UTI, if I dont have UTI why I have contractions? My doc wants to see me every week now. Hope I will not go fo ranother 4-6 weeks.",
            "post_id": "4364073",
            "timestamp": "1239972113",
            "user_id": "user_686463",
            "user_link": "/personal_pages/user/686463",
            "votes": "0"
        },
        {
            "answer": "im exactally the same as u asia i dont want mine left at a hospital! i live 30min away from the hospital and i dont drive! i want to be with it 24/7! it will be SO hard if i do have him early :(arghh im going bonkers at the moment",
            "post_id": "4364450",
            "timestamp": "1239979159",
            "user_id": "user_519260",
            "user_link": "/personal_pages/user/519260",
            "votes": "0"
        },
        {
            "answer": "Went for my 3d/4d ultrasound yesterday.  Definitely a girl (confirmed 3 times now).  Haha.  But this time I actually saw the parts and I am sure now.  Baby is totally laying on my back (head down), which explains my back and hip pain.  She was sucking her toe and then her thumb.  It was wonderful.  I was there for over an hour trying to get her to cooperate.  Drank some orange juice to get her moving and then she decided to turn towards my back and go to sleep haha.  She did finally wake up after some time.  Cant wait to hold her.  My 2 yr old wasnt very interested lol.",
            "post_id": "4386760",
            "timestamp": "1240498998",
            "user_id": "user_649670",
            "user_link": "/personal_pages/user/649670",
            "votes": "0"
        },
        {
            "answer": "I had my US done yesterday. Its still a girl!!! Im so happy, I have a boy and I will have a little princes. I got a lot of stuff for her already, have some furnitures as well. For the rest Im waiting for my baby shower on May 17th. I have a lot of ladies coming so probably I will get everything I need. My husband's grandfather buying her a crib. He is so exaited, specially that she will be having his wife name- Lucy. She pass away 2 months ago after years of ilness, I didnt even have a chance to know her. She was already in different world when I meet her but everybody in her family saying Im like her and my hubby is lucky!!! Even his mother (and her doghter) said so.Anyaway she is doing fine, she is 4lb 15 oz so pretty big for 33 weeks, hope she will slow down a bit:) My GD is under control with diet, UTI is gone and Im doing really good now..........but not my moods!!! OMG!!! One second Im crying next and Im smiling, I hope this will be over soon, specially that my hubby dont understand that is due to the pregnancy, he thinks its something more. Oh well.One more big thing, our dog after missing for 14 days was founded!!!! She lost some weight and thats it. No injuries, nothing.Tomorrow is my son first communion, we will have a party for over 30 people, thanks God everybody helping me so I end up doing nothing:) The only thing that its not nice about this is that my ex coming to the church. Suddenly he wants to be a good father. I hope he will behave and not argue with me.Hope all of u are doing good.",
            "post_id": "4393440",
            "timestamp": "1240661071",
            "user_id": "user_686463",
            "user_link": "/personal_pages/user/686463",
            "votes": "0"
        },
        {
            "answer": "updates...hmmm ok well 34 weeks today... whoo hoo had a u/s at 31wk 4days and baby was already measuring 4lb 11oz... wow gonna be a big one... in feb the doc did a in office u/s(older machine) and told me that it was definately a girl... well at the last scan the tech(with a much newer machine) said that she saw a penis... soooo i have another u/s scheduled for May 15th... and hopefully they can confirm whatever sex it is... i dont want to put ALL of the pink stuff away right now.... until i know for sure what i am having...lol",
            "post_id": "4393627",
            "timestamp": "1240666753",
            "user_id": "user_514585",
            "user_link": "/personal_pages/user/514585",
            "votes": "0"
        }
    ],
    "post_id": "4228849",
    "question": "I haven't heard from many of you ladies in some time and was just wondering how all of you were doing at this point in time. Hope all of you are doing well and preparing for the arrival of your little ones, we're oh so close to the finish line!!! And then comes a new beginning. Hope to hear from you soon. :)My update:I am currently 31wks 1 day along, feeling good, coping with my Gestational Diabetes, and getting anxious for my little one's arrival! I had a dr's appt today where I was informed that because my GD was under control, my risk for a larger baby was greatly reduced and I'll likely make it to full term. What a relief! I am getting a little nervous, I must admit, with the thought of finally becoming a mommy and all the responsibility that comes with it. I guess I just want to do all that I can to give my daughter a better life and raise her the best we can. Another thing I keep thinking about is the actual labor. To have an epidural or not? Will things run smoothly? Will I even know when it's time? All these thoughts can become a little overwhelming but then I think of the big picture which will hopefully be a healthy child, and all my fears subside. We're almost there, we're almost there, we're almost there!!! I'm hoping everything goes well for every single one of you ladies in the weeks to come. Let's stay connected!",
    "timestamp": "1238534920",
    "title": "Updates?",
    "user_id": "user_218701",
    "user_link": "/personal_pages/user/218701"
}