{
    "answers": [
        {
            "answer": "Your not alone. I am having the same thing happen to me. Please let me know what you find out I am having a similar problem exepet i have not been told i have Endomertiosos and Adenomyosis.3 years ago i started getting 2 periods a month. Nobody could figure out why. Hormonoal imbalance was occuring. I wanted to find out what was causing this and solve the problem not cover up the symptoms by taking birth control pills to get regulated or fertility drugs to have kids. I know i was exposed to some chemicals in my environmental consulting career that could be causing an imbalance.I started taking herbal supplements and changed my diet to eating all organic meats and vegetables and cut out eating beef altogether. My periods are back to normal since i have done this.But now i am bleeding during and the day after i have sex, and also when i make a bowel movement from the vagina. Just went to obgyn and said my cervics is \"friable\" in nature and bleeds to the touch.She said it could be a number of things like bacteria infection, STD or PID or cervical cancer, or partner could be just hitting my cervics.She said that the blood when i do NO2 might be coming from by anus and to make sure by putting toliet paper inside after making a bowel movement and get back to her when it happens. It is not coming from the anus.My boyfriend thinks i should stop looking things up on the internet because it is just getting me more worried and wait to find out from the doctor.",
            "post_id": "157617",
            "timestamp": "1153890000",
            "user_id": "user_149619",
            "user_link": "/personal_pages/user/149619",
            "votes": "0"
        },
        {
            "answer": "can you see another doctor for a second opinion?  have you had a recent PAP test?",
            "post_id": "159468",
            "timestamp": "1155272400",
            "user_id": "user_143952",
            "user_link": "/personal_pages/user/143952",
            "votes": "0"
        },
        {
            "answer": "Great Questions!   I have had vaginal bleeding during bowel movement too.  It occurs only once per month but very predictably a couple days before my period.  This has  been going on for several years. ( as backgound, I am 40, two kids, never had endometriosis and do not have it now.  Get regular colonoscopy and exams, thin prep and PAPs always negative, 28 day cycle)Ugly details:  After BM, bright red blood in commode and on toilet tissue.  (positive that it is vaginal, not rectal) the curious thing is that once it happens there is no residual bleeding at all.  No further spotting on the same day, no darker blood, nothing.  Happens once per cycle and that is it until next month.Diagnoses:  Had Uterine Hystosonogram done (ultrsound with water) to better see if any polyps present.  Found at least two tiny polyps in uterus. They were clearly visable even to my untrained eye. Scheduled day surgery to have them removed and to biopsy tissues just in case.Once doctor went in, could not find the polyps.  She took tissue samples for biopsy.Biopsy came back all clear for cancer, but pathology showed that I have a 'disorganized endometrium'.  This was explained as follows:  When looking at the cells of uterine lining, they should all present at pretty much the same stage of your cycle.  IE: if you are on the 10th day of your menstrual cycle,  all of the lining cells should look about 10 days old (for simplicity sake).  My cells were 'disorganized' with some presenting at 5 days, some at 15, some at 21 etc.This might explain the cause of the off cycle bleeding.  My doctor put me on birth control pills for 3 months and then wants to do another biopsy in November.  She said the BC pills should kick my lining back onto the right schedule.I am skeptical.  If this were the cause of the bleeding, then logically, I should be experiencing inconsistant spotting at least a couple times per month, rather than the very consistant 'two days before' situation I explained earlier.I started on the BC pills in July.  When I was close to the date that my period should start on the pill, I had the exact same bleeding two days before onset.I am now into the second month...we will see what happens next.I am interested in anyone else's experience and outcome which was diagnosed similarly or due to non-endormetriosis reasons.",
            "post_id": "160522",
            "timestamp": "1156050000",
            "user_id": "user_154424",
            "user_link": "/personal_pages/user/154424",
            "votes": "0"
        },
        {
            "answer": "aries19, it seems as if we are living similar lives. i have not been really diagnosed with anything yet. and all test came back great, NOTHING! so im confused. what the heck is the problem. ive been to 4 doctors and everyone seems dumbfounded. today a doctor told me i have prolapsed uterus. i dont think that is the problem since the only symptom of prolapsed uterus i have is the bleeding during intercourse. no lower back pian, no heavy feeling, no pain. but i do have the vaginal bleeding after a bowel movement. i go to another doctor tomorrow. ill let you guys know the outcome.",
            "post_id": "160963",
            "timestamp": "1156309200",
            "user_id": "user_154926",
            "user_link": "/personal_pages/user/154926",
            "votes": "0"
        },
        {
            "answer": "I know I am really late in this forum, but I was browsing my symptoms and this came up. Did you ever get this resolved? I am really worried because we are ttc and everytime I see this bleeding so early in my cycle it seems its impossible to get pregnant.I have pretty much exactly the same symptoms as you do. Please reply to ***@****",
            "post_id": "197171",
            "timestamp": "1183073260",
            "user_id": "user_222815",
            "user_link": "/personal_pages/user/222815",
            "votes": "0"
        },
        {
            "answer": "ive been experiencinglower back pain for2 months along with a trip to the ER in which the doctors told me they thought i had a kidney stone bc the pains got so severe.  but still, i have this aching pain in my lower back and it hurts more when i have a bowel movement.  i had sex 3 days ago and today ive had multiple bowel movements (with an abnormal color and appearance) and a brown discharge.  I am only on day 8 of this pack of Birth Control pills too.  does anyone know what this could be?",
            "post_id": "200318",
            "timestamp": "1183427410",
            "user_id": "user_224023",
            "user_link": "/personal_pages/user/224023",
            "votes": "0"
        },
        {
            "answer": "I also have vaginal bleeding after a bowel movement.. all very similar to your story.  This happens only a few days before my period.  I notice your post is over a year old.  Did birth control pills regulate you?  My doctor wants to put me on those too, but I've been on them in the past and they make my blood pressure to increase so I'd rather not.  I don't have anything else significant in my past medical history - I'm 31, 2 kids, no endometriosis etc.I'd be really interested in hearing follow up on your story.",
            "post_id": "200413",
            "timestamp": "1183433063",
            "user_id": "user_224052",
            "user_link": "/personal_pages/user/224052",
            "votes": "0"
        },
        {
            "answer": "I, myself  has not had sex in the last 3 weeeks, but I'/m bleeding just from my playtoy vibritor.. My husband has not touch me four 3 months now,  This is all the sex I have hade. I am bleeding internally, not on a pad. I want and need to have some natural sexaual contact so baddddddddddddd. Could it be the vibrater or is it me? I love my husband, but he does\"nt act like he still feels the same way. Help me. I need to have some natural sex soon.",
            "post_id": "200508",
            "timestamp": "1183441394",
            "user_id": "user_224096",
            "user_link": "/personal_pages/user/224096",
            "votes": "0"
        },
        {
            "answer": "I to have the same bleeding after sex and somtimes during a bowel movement.  I thought it was bleeding between periods, so I went to the doctor,  I also was put on birth control pills, had an pelvic ultra sound as well as blood work, sad to say this did not help and my pap came back good,  I live in a very small community and my Doctor actually was angry when I told her I no longer wished to take the birth control,  (I am 42 and my tubes have been tied,)shebasically told me to find another doctor ,  I have another appt.  in august,  unfortunately it will be at the same clinic with a different doctor.  Also, how do you get a obgyn to take a homone test.  I have asked, and both times I have been denied.",
            "post_id": "782243",
            "timestamp": "1184139033",
            "user_id": "user_228839",
            "user_link": "/personal_pages/user/228839",
            "votes": "0"
        },
        {
            "answer": "Off and on for the past two months I've been experiencing bright red bleeding vaginally with bowel movements as well - not sex though.   Getting really scared and going to make a doctor's appointment tomorrow.  Had normal pap in July but didn't mention the problem then because I thought it had stopped.  But I was wrong - it started again yesterday. I'm sure they won't be able to let me know what's going on without having lots of tests, but I'll let you what happens for those of you who are experiencing similar problems.",
            "post_id": "1767746",
            "timestamp": "1187566613",
            "user_id": "user_255139",
            "user_link": "/personal_pages/user/255139",
            "votes": "0"
        },
        {
            "answer": "I am very anxious to hear what you found out.  I am experiencing the exact same thing...only with bowel movements, not sex, and no other symptoms.  I am worrying myself to death.  Hope your news was good.",
            "post_id": "1850628",
            "timestamp": "1188740282",
            "user_id": "user_267251",
            "user_link": "/personal_pages/user/267251",
            "votes": "0"
        },
        {
            "answer": "I, too, have had vaginal bleeding after bowel movements.  I am 50 years old and this has been going on for many years.  The doctor's comment was \"Hmmmmm\".  My bleeding was occurring mid-cycle, for two or three days.  Recently, I have begun having a smaller amount of rectal bleeding in addition to the vaginal bleeding.  This month, it occurred a week before my period and not mid-cycle.  I am on the pill already, so that didn't help me with this problem.  I am so glad to see I am not alone.  With my doctor's reaction, I thought I was the only one with this problem.  The good news is that I have had this for many years and I have had no other problems.  I'm pretty sure it's not something to worry about or I would have had more problems.  Hang in there.",
            "post_id": "1934356",
            "timestamp": "1191068058",
            "user_id": "user_288074",
            "user_link": "/personal_pages/user/288074",
            "votes": "0"
        },
        {
            "answer": "Thank you for letting me see that I am not alone.  I have had vaginal bleeding during bowel movements for the last 6 months.  Normally 2 days before my cycle, but this month it started on the 2nd and hasn't stopped.  I did go and see my cancer doctor(as I had cancer surgery 3 yrs ago and my cycle has not been consistant since) and he said ct came back good.  Did an endo biopsy and should have results on Friday.  I will post the findings.",
            "post_id": "1973627",
            "timestamp": "1192114854",
            "user_id": "user_297942",
            "user_link": "/personal_pages/user/297942",
            "votes": "0"
        },
        {
            "answer": "Well just talked to my cancer doctor.  He said it was not cancer, but calling it dysfunctional bleeding.  Said that I had just ovulated.  I can keep a log, he could start me a drug that would give me a period in 10 days and then see what happens, or start me on birth control.  I told him I would get back to him with my decision.",
            "post_id": "1978580",
            "timestamp": "1192221237",
            "user_id": "user_297942",
            "user_link": "/personal_pages/user/297942",
            "votes": "0"
        },
        {
            "answer": "This is all very interesting as I too thought I was the only one with this problem. To start with I just had bleeding after intercourse and had to have my cervix cauterised but then several years later this is when I started bleeding from the vagina after bowel movements. My doctors are also a bit baffled. I have had normal smear (pap) tests and ultrasound including a vaginal one and nothing conclusive was found. I am 41 have 3 children (3 miscarriages) and I am on the mini pill. Like mmwhittem my problem has been going on for a while, probably 12 months so i kind if think if it was anything nasty then I would know by now. But who knows what it might lead to. Oh the joys of being a woman!!!",
            "post_id": "2009912",
            "timestamp": "1193052380",
            "user_id": "user_308626",
            "user_link": "/personal_pages/user/308626",
            "votes": "0"
        },
        {
            "answer": "I have all of the same symptoms with a few exceptions. I started my period on Sept. 5 and still today have some spotting from time to time.  Seen my Gyno. on Oct. 13 had a pap, pelvic ultrasound, and endometrial biopsy, etc.  All came back good. He said it was probley just a hormone inbalance and suggested a Mirena IUD (because I'm 35 and smoke). I had that done Nov. 7.  Now I have bleeding when I have a bowel movement.  I was just wondering if any of you had found out what was causing this?",
            "post_id": "2140195",
            "timestamp": "1195959180",
            "user_id": "user_343140",
            "user_link": "/personal_pages/user/343140",
            "votes": "0"
        },
        {
            "answer": "I have exerienced bleeding as most of you have described and am relieved that I am not alone.  After reading all your comments, I am guessing that it probably is hormonal, since many have been tested and had negative results.  It is very frustrating and stressful not having a definite answer.  Take some comfort though, that there are many of us going through the same thing and so far, it hasn't been something terrible.  I hope an answer will be found soon.  Please keep posting and letting us know what you find out.",
            "post_id": "2142355",
            "timestamp": "1196029695",
            "user_id": "user_343748",
            "user_link": "/personal_pages/user/343748",
            "votes": "0"
        },
        {
            "answer": "Wow!  This is much more common than I ever thought.  I have mid cycle bleeding that used to be brought on by a bowel movement.  After a colonscopy and other tests, it was determined that since the blood is brownish in color, it is old and is blood that isn't being shed during my period.  Depending on stresses through out the month, it is worse.  I am convinced it has something to do with my hormones.  There are months that I bleed for 1 week before and 1 week after my period - not to mention the back pain and severe cramps I've started to get as I've gotten older!  Being female is so much fun!   :)  Hang in there ladies and I hope you find some relief soon.",
            "post_id": "2142506",
            "timestamp": "1196032998",
            "user_id": "user_321769",
            "user_link": "/personal_pages/user/321769",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing the same symptoms as everyone else on this forum.  For the past 6 months my symptoms have worsened with dysfunctional bleeding.  I bleed during and after sex, when I have a bowel movement, and sometimes when I urinate.  I went to my gynecologist and he ran a bunch of tests...he claims that I have uterine fibroids.  I'm not sure if fibroids would cause all this dysfunctional bleeding. I also had extreme pain during my periods so my gyn gave me meds to help with that.  I know one thing tho...I am sick and tired of wearing a pad each and every day. I don't know when I will bleed so I have to wear one just in case.  It really sucks!  I hope we all get some relief soon....",
            "post_id": "2285039",
            "timestamp": "1198879361",
            "user_id": "user_372398",
            "user_link": "/personal_pages/user/372398",
            "votes": "0"
        },
        {
            "answer": "I see a year and a half of comments from 19 different women. Has anyone gotten any answers from their doctors reguarding this problem.  I too have had bleeding following intercourse any time after mid cycle to my period for 2 1/2 years. Doctors have done CT scans, ultra sounds, pap smears...I do have a uterine fibroid on the outside of my uterus but Gyn Doc says it would not be causing the bleeding due to it's location. Recently I have begun to bleeding vaginally during a bowel movement during the same time in my cycle. I have been on progesterone for 6 months now and it is not resolving the bleeding. I noticed how many women have posted with this same issue and in over a year no one has returned to comment on a specific cause. I was hoping there might be one.",
            "post_id": "2290523",
            "timestamp": "1198995795",
            "user_id": "user_373488",
            "user_link": "/personal_pages/user/373488",
            "votes": "0"
        },
        {
            "answer": "I too am trying to concieve and bleed vaginally after a bowel movement -- but only when it's a few days before my period starts.  Sometimes i have brown discharge (vaginal) a week before my period too and although i feel like this is probably normal from all the various posts i've read it makes it hard to know when the best time to concieve is.  Any advice?",
            "post_id": "2295226",
            "timestamp": "1199112310",
            "user_id": "user_374484",
            "user_link": "/personal_pages/user/374484",
            "votes": "0"
        },
        {
            "answer": "I had a baby 10 months ago. I went to the OBGYN in July. Everything was fine. My pregnancy was normal I have no history of anything. The last two months I have had vaginal bleeding around day 13 of my cycle...bright red. It doesn't get into my underwear so it's only coming out during straining (I have constipation a lot). Haven't called the doctor yet. Just now started searching on the internet.",
            "post_id": "2383263",
            "timestamp": "1200786879",
            "user_id": "user_393288",
            "user_link": "/personal_pages/user/393288",
            "votes": "0"
        },
        {
            "answer": "I am 23 yrs old, two children and have been having the bleeding between periods, after bowel movement (vaginal) and everytime after intercourse. its putting me off having sex my husband as it means i am always bleeding. I have been to the doctors and she thinks i might have somthing called polyops has anyone else been told this? I had the coil fitted a year ago but she does not think it has anything to do with my symptoms. can anyone help?",
            "post_id": "2468827",
            "timestamp": "1202209731",
            "user_id": "user_410102",
            "user_link": "/personal_pages/user/410102",
            "votes": "0"
        },
        {
            "answer": "I forgot to say that since i have been geting these symptoms i have been losing weight without trying, in the last two weeks i have lost 5lbs.",
            "post_id": "2468832",
            "timestamp": "1202210084",
            "user_id": "user_410102",
            "user_link": "/personal_pages/user/410102",
            "votes": "0"
        },
        {
            "answer": "Hi I am 27 years old, and I have experienced the same symptoms.  My gyno did a pap, an HPV test, a colposcopy, a transvaginal ultrasound, and an abdominal ultrasound.  All of these things cme back normal.  He's now testing me for a blood disorder. I also do not know what else could be causing these things. Have you gotten any new answers since your post?? I am relieved that all my tests are normal, but I am still scared and don't want to have sex anymore!!",
            "post_id": "2555044",
            "timestamp": "1203879993",
            "user_id": "user_430353",
            "user_link": "/personal_pages/user/430353",
            "votes": "0"
        },
        {
            "answer": "I'm so glad I found this forum.  I started with this whole bleeding after sex and bowel movements last week.  I was on vacation, what luck!  I got home and called my OBGYN as soon as I got in the door convinced I was dying of cancer.  I'm already scheduled for a colpo in a week and she felt it was ok to wait to be seen.  Her main concern was if I was having pain - and I'm not.  The worst bleeding occurs when I have a BM. I know that I have HPV and IBS as well.  I'm not sure if either of thoses things are causing the bleeding.  It's hard to stay calm.  I have my colpo on the 10th of march possible followed by and endo exam.  I'll let you know what I find.Oh - the MD wants to test me for claymadia (sp).",
            "post_id": "2593470",
            "timestamp": "1204596428",
            "user_id": "user_438863",
            "user_link": "/personal_pages/user/438863",
            "votes": "0"
        },
        {
            "answer": "I've had a similar problem for over a year. I went to the doctors and during my HPV test she discovered that my cervix was bleeding, but couldn't offer any explanation as she did not see any unusual cysts or anything that could be tested for cancer. The HPV test and other std tests came back normal. I have since noticed that the bleeding becomes worse during a bowel movement, and always seems to happen halfway through my cycle like many of the people on this forum. Has anyone been able to determine what the cause of this is?? Please post if you have found out... thanks.",
            "post_id": "2648263",
            "timestamp": "1205606579",
            "user_id": "user_451174",
            "user_link": "/personal_pages/user/451174",
            "votes": "0"
        },
        {
            "answer": "I have had this problem for more than a year.  My paps have been LGSIL and after a LEEP in Jan '07 CIN II was found (unclear margins) and the LGSIL paps persisted until Feb '08.  Now I have a ASCUS pap but the bleeding continues.  In Oct '07 I had a large polyp removed with biopsies of the surrounding area--all negative.  I also had a D&C which was normal too.  The oncology group that is treating me recommends a hysterectomy because the bleeding that I am having, and everyone else in this thread, is not that normal.  I am sure there could be different causes in each case.  I would really like to know what mechanism is triggering this.  My bleeding issues start after mid cycle, usually day 20 of my 28 day cycle and get worse until my period starts.  I will post after my hysterectomy to let those interested know if anything was discovered.",
            "post_id": "2652199",
            "timestamp": "1205703090",
            "user_id": "user_444073",
            "user_link": "/personal_pages/user/444073",
            "votes": "0"
        },
        {
            "answer": "It's bizarre how everyone has such similar stories and symptoms.  I have been having vaginal bleeding during bowel moments and sex for the past 2 or 3 years.  Three doctors later, I'm no closer to finding an answer.  I have had multiple pelvic exams and paps, a sigmoidoscopy, a diagnostic laparoscopy, a sonagram, and an endometrial biopsy, and the doctors cannot find anything.  I have been tested for STDs, all of which have been negative.  Each doctor I talk to has a hard time believing that the bleeding is vaginal and not rectal (hence the sigmoidoscopy), which makes me even more frustrated.  Also, each doctor starts out gung ho and assures me that they will find the reason, but then after a few paps and a minor procedure or two they brush me off and basically tell me to live with it.  The problem gets progressively worse as time goes by.  I am starting to experience pelvic pain (similar to menstrual cramps) after the bowel movements.  I am also now having menstrual cramps and PMS for the first time in almost 10 years (I've been on the pill for that long and am still on it).  I did recently switch pills from Trinessa to Low Ogestrel, but the bleeding and cramping started well before I switched.I don't want to just accept it and let it go because I am afraid that if there is a problem, I want to find it now and not later when it could be much worse.  I'm tired of bleeding and cramping without knowing why, and I'm tired of being dismissed by doctors who can't find a quick answer.  Please please post if any of you have found answers.  There has to be a reason as to why we are all having the same problem.",
            "post_id": "2690066",
            "timestamp": "1206464046",
            "user_id": "user_460506",
            "user_link": "/personal_pages/user/460506",
            "votes": "0"
        },
        {
            "answer": "Quick edit:  That line about being dismissed by doctors at the end was supposed to say \"I'm tired of being dismissed by doctors who give up because they can't find a quick answer.\"",
            "post_id": "2690336",
            "timestamp": "1206467136",
            "user_id": "user_460506",
            "user_link": "/personal_pages/user/460506",
            "votes": "0"
        },
        {
            "answer": "I am 28 yrs old.  I started experiencing blood coming out from my vagina during bowel movement like 2 weeks about.  In the first time, bleeding happens when I am straining my self.  Then I experimented as to just take my time and not to strain my self during bowel movement, little or no blood was spotted.  But I mean, this can't be normal. So, it's been 3 weeks now that every time I go, blood comes out from the vagina.  I am going to see my doctor soon to get me referred to a obgyne...  Because of this, I am so afraid to go do my thing now in the washroom..help.",
            "post_id": "2713626",
            "timestamp": "1206913361",
            "user_id": "user_465770",
            "user_link": "/personal_pages/user/465770",
            "votes": "0"
        },
        {
            "answer": "Wow. It's funny that our problems are considered \"unusual\" by doctors when they seem to be occurring fairly frequently...I've had bleeding during sex off and on for a few years. The past few months have gotten worse, and I bleed three weeks every month. I've been on eight different kinds of birth control pills since I was 18 (I'm 24 now). I found this forum when investigating bleeding during bowel movements, which is happening to me more frequently; it's bright red and full of clots. I've had normal paps all my life. Other tests (two colposcopies, pelvic ultrasound, transvaginal ultrasound, cervical biopsy, and endometrial biopsy) have all been normal.My general practitioner and OBGYN have noted a cervical ectropion...tissue changes on my cervix, probably brought on by birth control, are highly vascularized and bleed at the slightest touch. My doc's decided to prescribe me vaginal progesterone suppositories, once a day for a month. I'm hopeful this will fix it, and I am staying away from estrogen supplements in any form afterwards.",
            "post_id": "2719610",
            "timestamp": "1207009966",
            "user_id": "user_467058",
            "user_link": "/personal_pages/user/467058",
            "votes": "0"
        },
        {
            "answer": "Interesting, klouise.  After my last pap (which just a couple of months ago), my doctor told me I had \"damaged cells\" on my cervix and gave me a one-dose vaginal suppository antibiotic.  He was not able to give me a viable reason as to why or how it happened, and I'm confused as to how it was never noticed before.  I just had another pap to see if the antibiotic did any good.  But like you, my paps have all been normal.  I was told by a previous doctor that I had a \"friable cervix\", but her only suggestion was to cauterize it...ouch!  I've heard that procedure sometimes makes it even worse.  Ugh.",
            "post_id": "2728899",
            "timestamp": "1207168976",
            "user_id": "user_460506",
            "user_link": "/personal_pages/user/460506",
            "votes": "0"
        },
        {
            "answer": "I an 53 years old and on hormone replacement therapy.  I have been on therapy for at least 10 years and have not had a \"period\" in that time.  I do however, suffer from abnormal vaginal bleeding and have had every test in the book over the past two years.  Colonoscopy, numerous ultrasounds, paps, D&C, etc.  All they have found is a small fibroid, a tiny cyst, and an area of ademosis (sp?)  The doctors insist that it is a hormonal imbalance causing the bleeding and when I mention the bleeding during bowel movements they look at me like I am crazy.  Like they've never heard of it before.  I was gratified to see all the postings here because I too was convinced I must have cancer somewhere and that they just couldn't find it.  It seems we have all had the same tests with the same results - nothing!  That actually cheers me and makes me think perhaps it IS just a hormonal imbalance.  My doctor has suggested an endemetrial ablation and said that would stop any bleeding for good.  I may have to take her up on that.  Thanks to all for making me feel better.",
            "post_id": "2787029",
            "timestamp": "1208351358",
            "user_id": "user_482040",
            "user_link": "/personal_pages/user/482040",
            "votes": "0"
        },
        {
            "answer": "I too have been experiencing many of the same symptoms for about 2 1/2 years.  I've been to two gynecologists and a gastroenterologist, all of whom told me that I MUST be bleeding from the rectum and not vaginally.  Like all of you, they thought I was crazy until one of the gynecologists finally did a pelvic, saw the bleeding days before my scheduled period, and subsequently did some hormone titers and a transvaginal ultrasound -- both of which were normal.  The gastro also checked for blood in the rectum and found nothing.  What's got me completely freaked out now is that I'm about 6 weeks pregnant (first pregnancy -- I'm 31) and the bleeding after a bm (now light pink instead of red) is still happening.  Are there any answers for us?   Just as an aside, I never had problems like this until I took birth control.  It completely changed my body.  Anyone else begin to get symptoms after taking oral bc?",
            "post_id": "2816952",
            "timestamp": "1208959446",
            "user_id": "user_488680",
            "user_link": "/personal_pages/user/488680",
            "votes": "0"
        },
        {
            "answer": "I have the same symptoms as all of you and have had all the same tests, however, I also have Crohn's Disease. I found out that my symptoms are actually caused by my Crohn's because of the location of the bowel in relation to the vaginal area. The disease can irritate surrounding organs and cause fistulas and other issues.  I don't know if any of you have an irritable bowel disorder, but thats my cause,",
            "post_id": "2821048",
            "timestamp": "1209023060",
            "user_id": "user_489557",
            "user_link": "/personal_pages/user/489557",
            "votes": "0"
        },
        {
            "answer": "I was diagnosed with mild endo 6 years ago. I have 3 kids all conceived on clomid. After my first pregnancy i started spotting ( brown) a week before my period on every cycle, except when i was on clomid. Since my second pregnancy, I have noticed the same symtoms as you all. The red bloody show after bm and during sex, BUT only the week before my period. It comes along with my spotting. I had a laprascopy after my son was born, but Dr. found no Endo. I honestly think it has something to do with irregular cycles/ unbalanced hormones. My clcles are very irregular. But I am going to go to the Dr. to make sure evrything is o.k.  I also had my cervix stitched with all pregancies, so it could just be that we have very sensitive cervix's.",
            "post_id": "2851154",
            "timestamp": "1209621150",
            "user_id": "user_495894",
            "user_link": "/personal_pages/user/495894",
            "votes": "0"
        },
        {
            "answer": "I just started having the bleeding during bowel movements three days ago.  I was on birth control for 11 years and recently (6 months ago) stopped taking it so we could try to have a baby.  My periods are now two weeks long and now I have this weird bleeding when I go to the bathroom.  My period finished three days before this started.  I was going to wait and see what happens and maybe call the doctor, but after reading this forum, I don't think it will do any good.  Nobody seems to have a real answer as to what is wrong with them and that worries me.  I know I can't get pregnant as long as I am bleeding so much.  Oh, I also had HPV about 10 years ago and cervical dysplasia from that.  That has been gone for many years now.  It will be interesting to see if anyone has any real diagnosis or if we are all left in the dark.",
            "post_id": "2864075",
            "timestamp": "1209916975",
            "user_id": "user_498687",
            "user_link": "/personal_pages/user/498687",
            "votes": "0"
        },
        {
            "answer": "I just found out that I miscarried my pregnancy.  Though the doc couldn't (wouldn't) say exactly what happened, I think it has to do with this bleeding problem.  The fetus was too small for its developmental age and wasn't properly attached -- which I believe is due to undiagnosed endometriosis.  I had spotting and bleeding through the entire (unsuccessful) implantation process.  It's common for women with endo to have this problem.  I also read that sometimes women have a connection between the uterus and the colon/rectum that causes tugging and bleeding in the uterus when a bm passes through the colon/rectum.  That connection could be endo related.  Without laproscopy, we can't know if it's endo.  Regardless, I thought some of you may be interested in my theory.",
            "post_id": "2868833",
            "timestamp": "1210017510",
            "user_id": "user_488680",
            "user_link": "/personal_pages/user/488680",
            "votes": "0"
        },
        {
            "answer": "I found this forum while searching for my symptoms online. I have had vaginal bleeding (only requiring a panty liner - if that) during/after intercourse and/or a strong bowel movement. I do not have endometriosis or any other health issues. I went to the gynocologist today and he said that I have a friable cervix (which basically means it bleeds easily). It wasn't caused by HPV or any other STD and all my PAPs have come back normal. The doc said that as a woman ages, so does her cervix and that this should go away in a couple... wait for it... years! There's nothing he said that they do to treat it because the treatment might cause more damage than the problem.",
            "post_id": "2883464",
            "timestamp": "1210288075",
            "user_id": "user_502962",
            "user_link": "/personal_pages/user/502962",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear that cneu. :( I have been on bc for about 8 years but the bleeding started about 2 years ago now... I've tried different kinds of bc over the last couple of years (low estrogen, etc) and I've even stopped taking it to see if that did anything, but there was no change. Bleeding every month during the second week of my cycle like clockwork.I just had some blood work as well as an ultrasound and another PAP done... ALL of which came back completely normal. But, of course, when I ask why I am still bleeding the doc stands there with a blank look on her face. She has referred me to a specialist, but I'm really not expecting any answers.",
            "post_id": "2884503",
            "timestamp": "1210305403",
            "user_id": "user_451174",
            "user_link": "/personal_pages/user/451174",
            "votes": "0"
        },
        {
            "answer": "I posted back in March that I was having a hysterectomy due to all the problems I have been experiencing.  I have had dysplasia and abnormal paps for two years and even though I knew there was little chance all the strange bleeding symtoms were indicative of something more serious, I was unwilling to undergo any more procedures or surgeries to resolve this.  I had my hysterectomy and the only thing found was adenomyosis.  Aside from the bleeding, I have had a lot of problems with pelvic pain which is from the adenomyosis.  I am 45 years old and done with having children so this was a good option for me.  I no longer have to worry about dysplasia and paps every 3 months.  One thing to keep in mind, though, is that a negative pap smear does not mean that one does not have cervical cancer.  Please keep on top of these bleeding issues you are experiencing and make sure you are comfortable with the doctor treating you!Matina",
            "post_id": "2894680",
            "timestamp": "1210568670",
            "user_id": "user_444073",
            "user_link": "/personal_pages/user/444073",
            "votes": "0"
        },
        {
            "answer": "i have had a cyst in the past but my problem is that a week or so before i am suppose to start my period when i go to the bathroom and apply pressure(bear down) some times when peeing mostly when i have a bowel movement i will start to bleed vaginaly(and it is coming from my vagina not my rectum) its not period blood this is bright red fresh blood and i can look and watch it drip when i bear down it will turn the whole toilet red then when i am done it usally stops until i go back to the bathroom again it is really scary it has been going on for many months and my gyno dont know what it is can anyone help!!!!",
            "post_id": "2976834",
            "timestamp": "1212187699",
            "user_id": "user_522398",
            "user_link": "/personal_pages/user/522398",
            "votes": "0"
        },
        {
            "answer": "I too have had the same problem with bleeding after a bowel movement.  Bright red.. I have been dealing with this for quite a long time(10ys). I am 32, I just had a partial hysterectomy in april which also came back with adenomyosis.  I just called my Dr. As usual my doctor also seems to be shocked/confused as to why I'm bleeding after a bowel movement..and asks me 3 times am I sure its vagina.. I think we woman know which end we are bleeding from.. come on.. we're not 12.  Sooo now he wants me to have a colonoscopy done. Has anyone one had this done and had any answers??",
            "post_id": "3015686",
            "timestamp": "1213021448",
            "user_id": "user_531350",
            "user_link": "/personal_pages/user/531350",
            "votes": "0"
        },
        {
            "answer": "Did anyone ever get an answer???BTW, tracy32176, I had a colonoscopy 2 years ago...it is no big deal.I have been experiencing bleeding after a BM for months now, as well as after sex.  It is really annoying that there are no answers here after reading all of these.  I have IBS, have been positive for HPV in the past, normal PAP tests, I was just told that I have a hormonal imbalance causing polycystic ovaries and that midcycle bleeding/spotting is due to that.  I have not discussed the vaginal bleeding after a BM with my gyno, but will call them tomorrow.  I also have a retroverted uterus, this might have something to do wit it, but I am unsure.  Anyone have answers yet?????",
            "post_id": "3207246",
            "timestamp": "1217187678",
            "user_id": "user_572549",
            "user_link": "/personal_pages/user/572549",
            "votes": "0"
        },
        {
            "answer": "I spoke to my doctor and she seems to think that the bleeding is due to my tipped uterus.  She thinks that when the BM passes it pushes on my uterus an discharges blood that may be pooling there.  I guess it makes sense.  I don't know.",
            "post_id": "3215263",
            "timestamp": "1217357446",
            "user_id": "user_572549",
            "user_link": "/personal_pages/user/572549",
            "votes": "0"
        },
        {
            "answer": "After several years and many doctors I FINALLY found a doctor that has seen this problem before. After an examination, she referred me to a Women's hospital here in Vancouver to see if I was a candidate for cryo-surgery. After an exam with a camera the doctor determined that it was not my uterus bleeding, but my cervix was VERY sensitive and would bleed to the touch, and like many of you here during bowel movements, sex, even sitting too long. He mentioned that this cryo-surgery (freezing of the spot that is bleeding on the cervix) may only have an 85% success rate but assured me that I was a good candidate and it leaves very little scar tissue. We went ahead with the procedure right there in the exam room, it took about 10 minutes. It has been over 4 weeks, and since the healing process has been over I have had a NO problems, and NO MORE BLEEDING! I am so relieved, I have not seen a spot of blood since the surgery and I am able to continue my life as normal!!! I just wanted to give you all an update as I too was lost and confused for many years about this mystery that seems to be quite common and uncomplicated after all...",
            "post_id": "3225359",
            "timestamp": "1217551972",
            "user_id": "user_451174",
            "user_link": "/personal_pages/user/451174",
            "votes": "0"
        },
        {
            "answer": "I was amazed to actually find a place where ppl were talking about the very problem I have been experiencing.  Mine however has been a bit different as since I had my first child my periods have been very unpredictable.  Sometimes I bleed for one week, and sometimes for 3 months.  This time around it has been a month.  About a week and a half it finally came to what I thought was the end.  Then I had sex and started having what seemed like a full flow again for about 2 days.  Had a day break then after a rather odd bm started bleeding again.  Have never experienced that before.  I haven't even thought about calling the doc.  My previous experience with every doctor I have tried to talk to reguarding my odd cycle resulted in them telling me it's just because I am over weight.  However.... a few years back I lost 70 lbs and had the same problems.   Is it even worth going to the doctor about????  Seeing that only one other person here has had any luck in finding what the problem and solution are.",
            "post_id": "3262787",
            "timestamp": "1218395016",
            "user_id": "user_585770",
            "user_link": "/personal_pages/user/585770",
            "votes": "0"
        },
        {
            "answer": "I am currently waiting for an appointment with Gynae Consultant about diagnosed fibroids and heavy periods and another appointment for a colonoscopy for the bleeding after bowel movements. However, since seeing my GP I have had two episodes of vaginal bleeding during bowel movements - seems like quite a lot of blood loss.  Thought I was going mad so pleased to discover I am not alone!  My hospital appointments are in September and I will mention this then.  I will post the outcome in case it helps others.  Incidentally I am 52 and my periods have started to become irregular (every 3 months) over the last year or so.",
            "post_id": "3274897",
            "timestamp": "1218640816",
            "user_id": "user_588629",
            "user_link": "/personal_pages/user/588629",
            "votes": "0"
        },
        {
            "answer": "I have been having the exact same 'symptoms' of vaginal bleeding after bowel movements.Background: I have been on birth control pills since age 21. Switched to Evra (patch) at age 28. At age 30, started spotting mid-cycle and on strained bowel movement. This coincided with my moving to Canada and I thought that the patch in Canada might be a different type/ dose, hence causing the mid-cycle bleeding. Family doctor checked my pap results, said there are no problems and to live with it, since it's just an 'annoyance.' Went to another family doctor a few months later, who suggested I go off Evra and back on to a 'lighter dose' pill. This didn't help, but then I stopped taking the pill altogether (Jan 2008) in order to try to conceive. Took me 6 months.I am now 31 and 16.5 weeks pregnant. Early in the first trimester I had some light bleeding on and off. Had a pap smear at 8 weeks pregnant, and when the doctor removed the speculum, I bled a LOT, which totally freaked me out. Doctor said he could see blood pooling in my cervix. I had an ultrasound and the baby is fine.I had no further bleeding until 15 weeks, when the bleeding on bowel movement started again. It is bright red and I can feel it dripping in the toilet. I've now also started bleeding after sex. I have read this is due to a softened cervix during pregnancy. Whatever the reason, it's pretty scary especially when pregnant!My prenatal care has been transferred to an OB-GYN and had my first appointment today. Seems my pregnancy multivitamin is making me somewhat constipated, so my OB is switching me to another. She did not seem concerned otherwise about the bleeding, so we'll see what happens.",
            "post_id": "3413573",
            "timestamp": "1221601610",
            "user_id": "user_622177",
            "user_link": "/personal_pages/user/622177",
            "votes": "0"
        },
        {
            "answer": "I just got back from the OB, with the symptoms of bleeding with bowel movement about a week to a few days before period... She did a pap smear, and looking at the cervix she said that the end of my cervix has many blood vessels right there.  She said that with any amount of straining they would easily bleed.  Also she said sex could easily irritate and bleed. In fact when she brushed the giant Q-tip across it; it bled.  She said that I could have cervicitis.  I am not sure what the treatment is, but I will find out when my pap comes back.  I will post again.Side bar, when I looked up cervicitis, it showed the main cause we be a prior or recient STD, however I have only had 2 partners in my life so It also can be caused by other reasons... So don't rule it out if the common causes don't fit your description",
            "post_id": "3482180",
            "timestamp": "1222984816",
            "user_id": "user_638878",
            "user_link": "/personal_pages/user/638878",
            "votes": "0"
        },
        {
            "answer": "Finally after 13 monthes and 3 doctors, I finally have gotten an answer to why I have constant vaginal bleeding, and also after bowel movements. I have a mass of blood vessels on my cervix which makes my cervix bleed even with just a touch.  My options for stopping the bleeding were 1.To have them frozen several times over the next year, with no guarentee that it would be succesfull or that it wouldn't return. 2. To have a hysterectomy removing only my cervix and uterus leaving my ovaries.  I have opted for option 2.  I just want my life back  Hope this helps!!!!",
            "post_id": "3488626",
            "timestamp": "1223128512",
            "user_id": "user_343140",
            "user_link": "/personal_pages/user/343140",
            "votes": "0"
        },
        {
            "answer": "This forum is great, it's nice to know that I'm not alone.  I started bleeding after intercourse a couple of weeks ago and after bowel movements just a couple days ago. Also started to have irregular periods about 3 months ago. I'm worried that my pelvic organ might be starting to prolapse.  Have to wait another 10 days before I can see my doctor......",
            "post_id": "3498059",
            "timestamp": "1223342121",
            "user_id": "user_642864",
            "user_link": "/personal_pages/user/642864",
            "votes": "0"
        },
        {
            "answer": "same thing for me with the bleeding. I had a cervical polyp that was removed and have had the bleeding wtih bowel movements a few days before my period ever since. My gyn says that possibly there is a lot of blood flow to the cervix where the polyp was removed and with any straining it causes it to bleed. I wish there were a concrete answer as I see most all of these posts don't have answers. It is very frustrating.My husband thinks since the gyn says don't worry then I shouldn't. My vaginal ultrasound was normal. \"don't worry\" and \"it's normal\" don't always make me feel better though.",
            "post_id": "3527732",
            "timestamp": "1223959221",
            "user_id": "user_650187",
            "user_link": "/personal_pages/user/650187",
            "votes": "0"
        },
        {
            "answer": "This forum is so amazing.  I can't believe there are so many out there who are having the same problems I'm having.  Mine has been going on for abought a year now.  I bleed during a bowel movement, literally dripping a couple of drips, and also during any kind of insertion during sex.  Right now I have been bleeding since Oct. 3rd, have had my regular period during that time, and am still spotting. I had surgery 2 yrs ago, to remove some cancerous cells in my uterus, I have had regulars pabs,all good, I even was sent for an ultrasound inside and out, (caused some bleeding of course) and still nothing. Its frustrating.  I have scheduled yet another dr.'s appt for this Thursday, and I'm going to let my dr. have it.  I've had enough.If he tells me not to worry I'll lose it.  Sounds like to me a hysterectomy is the answer. I'll let you all know what my dr's response to that is.",
            "post_id": "3583978",
            "timestamp": "1225164880",
            "user_id": "user_664456",
            "user_link": "/personal_pages/user/664456",
            "votes": "0"
        },
        {
            "answer": "I can't believe there is no doctor reading this list.  I am also having vaginal bleeding during some, but not all, BM.  Sometimes it is brown, other times bright red.  This has to be blood left in the uterus, or something with the cervix.  There has to be a correlations between the pushing action and expelling blood.  It seems like someone should be able to reassure us crazy women.",
            "post_id": "3596423",
            "timestamp": "1225400816",
            "user_id": "user_209588",
            "user_link": "/personal_pages/user/209588",
            "votes": "0"
        },
        {
            "answer": "You know it really isn' t so inconvenient to me that I have the bleeding. It was just scary. But now that I see so many women have this and so many doctors aren't concerned it does make me feel kind of relieved.",
            "post_id": "3631155",
            "timestamp": "1226116654",
            "user_id": "user_650187",
            "user_link": "/personal_pages/user/650187",
            "votes": "0"
        },
        {
            "answer": "we have the same situations.. i am having a vaginal bleeding too during bowel movement.. is their cure for it??",
            "post_id": "3647427",
            "timestamp": "1226481490",
            "user_id": "user_680012",
            "user_link": "/personal_pages/user/680012",
            "votes": "0"
        },
        {
            "answer": "Hey there ladies,I've got the answer and it *****! We are women and this is all part of what are hormonal bodies go through. There is nothing wrong, it's just like getting a pimple on your face! it happens, goes away and then comes back again. more often than we want though! You probably notice that when you use force to pass your bowels, you have a greater amount of blood on the tissue or in the bowl...you are breaking capillaries. After sex, the walls and lining are thinner and well, there is alot of thrusting going on. You bound to break something!! ☺Let us all know...we are ok, we are not sick, it's just one of those things we are dealing with, hate it...but we are not contagious and we are not dying or on the road to a serious illness because of it. We have PMS and now so does are bowls, intestinal and vaginal walls...Merry Christmas and I truly hope one day that Men will go through what we do! ........wait, they are men, they can't handle the truth!! haha ☺be strong and be thankful we have eachother for advice and  that we are comfortable enough to share the most embaressing things with perfect strangers, but in the end we are all the same and it feels good to know your not alone!best wishes and i hope are symptoms one day dissappear!",
            "post_id": "3760185",
            "timestamp": "1228979150",
            "user_id": "user_586171",
            "user_link": "/personal_pages/user/586171",
            "votes": "0"
        },
        {
            "answer": "sorry didn't know you couldn't say a word that is just like Stinks.It stinks sometimes to be a woman...but we do bare life and that is an honor i wouldn't give up!!",
            "post_id": "3760189",
            "timestamp": "1228979272",
            "user_id": "user_586171",
            "user_link": "/personal_pages/user/586171",
            "votes": "0"
        },
        {
            "answer": "Sorry, but I'm so relieved to read that I am not alone with this very embarrassing issue!Here's my background:I'm 25, have been on BC pills since age 17. No history of Endo, HPV, or any STD. I've only been with 2 partners in my life; current partner for 6 years. Started with Ortho Tri-Cylcen, switched to OrthoTri-Cyclen Lo, and this year switched to Tri-Sprintec (generic of Ortho Lo). I've really only noticed this issue since I started Tri-Sprintec. I'm wondering if it is to blame. I'm seeing my doctor for my yearly PAP on December 23rd and I will post my findings then.",
            "post_id": "3787357",
            "timestamp": "1229658859",
            "user_id": "user_714335",
            "user_link": "/personal_pages/user/714335",
            "votes": "0"
        },
        {
            "answer": "I have the same symptons but I am not on bc.  I had the Novasure performed two years ago and have not had a period or spotting since then until about two months ago when I noticed after some BM and intercourse.  The amount is increasing as time goes on.  Anyone have these systems after going through procedure like Novasure?",
            "post_id": "3814478",
            "timestamp": "1230527467",
            "user_id": "user_720797",
            "user_link": "/personal_pages/user/720797",
            "votes": "0"
        },
        {
            "answer": "Hi ladies, I am somewhat relieved to know that others are experiencing the same thing I am.  I am 41 and we've been trying to conceive for a year.  My periods finally seem regular but suddenly I have this bleeding that is throwing my scheduling off.  (We have a 2-year-old already.)  I start with faint pink and/or brown spotting shortly after ovulation, so I get my hopes up that it is implantation spotting, then a week before my period, I start having more bleeding during sex and especially during difficult bowel movements.  I am less concerned with the bleeding than I am with it interfering somehow with my ability to get pregnant.  I had a PAP last summer and it was negative but perhaps I should see a doctor again.  Any thoughts, especially about my chances for conceiving (age aside) ?Thank you !",
            "post_id": "3875073",
            "timestamp": "1231966626",
            "user_id": "user_736344",
            "user_link": "/personal_pages/user/736344",
            "votes": "0"
        },
        {
            "answer": "An update on my side - my pregnancy has progressed without major complication. I am now almost 34 weeks along.Meg - if it's any consolation, I conceived relatively easily despite having this problem (see my background posted in September).Since September, the bleeding stopped for a few weeks, came back, went away, came back etc over the past few months, and is currently not a problem.My OB wasn't too concerned in first to mid-second trimester, but is a bit worried about bleeding in third trimester; so I was referred to Sunnybrook's Odette Cancer Centre, to the specialist in the colposcopy department.The specialist there had a look and did another pap smear (which came back as normal, as have all of my paps), and says he sees *normal* glandular changes, but it is unusual that I have quite a bit of mucous discharge and bleeding. However, due to my pregnant state he cannot do anything further or take a cervical biopsy, so I am scheduled to see him 4 weeks after delivery. All in all, though, he does not seem overly concerned yet, so that is heartening. I am now just awaiting the arrival of my baby and we'll see what happens from there.",
            "post_id": "3878032",
            "timestamp": "1232033875",
            "user_id": "user_622177",
            "user_link": "/personal_pages/user/622177",
            "votes": "0"
        },
        {
            "answer": "Thank you, sunshineshara, for your update.  I called my OBGYN yesterday and the nurse almost completely brushed off my concerns about the bleeding.  She was focused on whether I am having regular ovulation and periods, which I more or less am.  I made an appointment with my doctor anyway, just to check in with her (again) as to whether I should look into a fertility specialist.  I keep hoping I'll conceive naturally as I did the first time, and I always hear stories about people spending big bucks on AI and IVF only to get pregnant naturally.  It only took 5 months my first time, so after trying for a year for our second, I am pretty discouraged.Now that I think of it, I must have had some kind of odd in-between-cycle bleeding the first time I got pregnant, because I was way off on my estimate of the baby's growth.  I went in for what I thought was a 7-week ultrasound and it turns out he was already 11 weeks along !I'll keep you posted.  Good luck in the next few weeks, sunshine.",
            "post_id": "3878758",
            "timestamp": "1232044992",
            "user_id": "user_736344",
            "user_link": "/personal_pages/user/736344",
            "votes": "0"
        },
        {
            "answer": "im 42 and had hysterectomy in 97,my husband and i was having intercourse and some forplay and during my orgasm i had blood in my fluid,it came from my vagina my husband is a very sexual guy and he loves to watch me have one,thats how he knew where it came from,i call a physcian and told them what happened and they said that its a  first sign of mynopause,well i was tested a couple of months ago and was told i wqasnt in mynopause, so i called another doc. and they said as long as i didnt have any pain not to worry but when i can i need to have a pap. havent had one in 8 yrs. this is the cfirst time for this bleeding i dont have nothing there to bleed exept for overies so im just as bumfuggled as yall are,any ideas let me know",
            "post_id": "3880982",
            "timestamp": "1232083309",
            "user_id": "user_725553",
            "user_link": "/personal_pages/user/725553",
            "votes": "0"
        },
        {
            "answer": "Thank you all for posting your comments. I feel better. I got these same symptoms years ago when I was training for a half marathon and then again starting last summer training again.  I have had 3 children with no complications.  As I get older ( I am now 37), these symtoms seem to increase and my periods have gotten more painful and more frequent.  It is a HUGE relief to read that this is common and that not one of you have reported anything I can die from. Thanks!! I feel better already and way less worried.",
            "post_id": "3885523",
            "timestamp": "1232206103",
            "user_id": "user_738804",
            "user_link": "/personal_pages/user/738804",
            "votes": "0"
        },
        {
            "answer": "My gosh, I can so relate to most of the comments. I too have been in this boat of wonderment and inconclusive testing. I am 33 years old and have had two children and in July of 2007 I began having pain in my groin area. In October I was referred to a general surgeon who thought I probably had two small hernia's and would have to deal with the pain until they were big enough to repair...flash forward to July 2008 and alot of pain later. I had an exploratory Laprascopy and my OB/GYN found some endometriosis. My pain and issues since then have really been tough. I found out I was pregnant less than a month after my surgery in July of 2008 and my vaginal drainage and bleeding ceased for about 2 months during my pregnancy...but something still didn't feel right. We found out on Halloween of 08 that we had lost the baby. I was 12 weeks pregnant but the babys' heart had stopped at 10 weeks as well as it's growth. I opted to have a procedure the very next day to remove the baby and pregnancy. I proceeded to have continued bleeding/clotting/pain...my doctor kept reassuring me that it was normal and he had removed everything, even after me explaining that there was still tissue coming out. I finally convinced him to check my hormone level, which was still elevated. After a few more weeks of the same symptoms, he convinced me to come into the office and he would easily suck the rest of the pregnancy out, and that I could tough out the pain and it would be over in a few seconds. When I got to the office he ultrasounded and found the remaining tissue and when he tried to \"easily\" suck it out, it would not budge. The suction procedure turned into a D and C, which is an actually scraping of my uterus. This being the same procedure I had originally had under general anesthesia. This was painful. Even after that 3rd procedure it still took my body time time complete the loss. Overall, it was about 1 1/2 months of agony. With the dr trying to convince me that everything was ok and that I needed to just try to forget about it. Now my current symptoms are browninsh to bloody to light tissue type drainage, this happens everytime I sit on the toilet whether I am peeing or having a bowel movement. I do bleed heavy with intercourse as well and it last for days at a time. As you can imagine alot of days go by that I am not wanting my husband to touch me or think about having sex with me. I feel so guilty because I know how much he loves me and how much he wants to. At this point, he has told me to just let him know when I am ready. I have been back to the dr and his nurse midwife. They have said that I have a \"friable\" cervix and it's all normal. But have no ideas to help my situation. I am really insecure about the drainage and have to wear at least a panty liner on a daily basis. This has definitely gotten worse, yet they say it's normal. I feel like I am going crazy. My dr. made a comment to me, \"it's not like you have cancer or something\". I really don't feel heard but I don't feel too encouraged that any other dr would be able to help me either. I don't know where to go from here. We do plan on trying to get pregnant again but not until May or later. But that's kind of difficult when you aren't really having much of a sex life either. Awe, the difficulties of woman hood.",
            "post_id": "3916544",
            "timestamp": "1232934657",
            "user_id": "user_746368",
            "user_link": "/personal_pages/user/746368",
            "votes": "0"
        },
        {
            "answer": "What a relief to find you all!!  I hope most of you that haven't posted in a while have found relief or cure...Here is my story:I am 33 years old with no children.  I have had irregular periods my entire life but they had been regulated since the age of 16 by birth control pills.  No history of STD of any kind, but my PAPs have usually been irregular.  Colposcopy at the age of 21 with no abnormalities.  Continually been PAPed and taken every BCP in the book.At 29 I started bleeding MORE than normal, nearly 3 out of 4 weeks.  At this time I was not sexually active and not taking any BCP.  Contacted a OBGYN and was treated for nearly three years without much of an answer.  Every different BCP I tried did not help the situation.  I was told I had cervical ectropion due to taking the pill for so long: basically, the cervix's internal cells had begun to grow on the outside of the cervix and that was making it bleed to the touch.  Well, I'm certainly not touching my cervix but bleeding every other day it seems, especially when I have a bowel movement.  Usually the blood is bright red, with clots, other times it is darker brownish red.SO I WAS prescribed the Nuvaring vaginal ring and that did help quite a bit.  Much, much less bleeding between periods and none with bowel movements.  The doctor did not know why the Nuvaring worked, but thought maybe it had something to do with the drugs not having to go through the liver.  However, when the ring is removed for one week to allow for a period, the period does not come until I insert an entirely NEW Nuvaring to start a new 28- day cycle.  Weird.The unfortunate conclusion to this story is that Nuvaring is not covered by insurance and costs more than $50 per month out of pocket - which I do not have now that I'm unemployed.  SO I am once again bleeding every other day and with bowel movements.  Lets hope this economy gets back on track so that I can start living a 'somewhat' normal life again...",
            "post_id": "3939069",
            "timestamp": "1233429131",
            "user_id": "user_751714",
            "user_link": "/personal_pages/user/751714",
            "votes": "0"
        },
        {
            "answer": "I too have these same problems.  The week before my period is a mess spotting brown discharge, bleeding during sex and BM.  Had a lot of test to find nothing. No answer's yet.  But I am now wondering if it is my antidepressant (Lexapro).  Are any of you ladies on lexapro   or a antidepressant similar to lexapro?",
            "post_id": "3974105",
            "timestamp": "1234280503",
            "user_id": "user_761315",
            "user_link": "/personal_pages/user/761315",
            "votes": "0"
        },
        {
            "answer": "GOSH am I glad I found gthis site!  I have been to 2 GYN so far and one wanted to carterize the inside of my cervix and the others comment was \"I don't know\".  Frustrating.Symptoms: approximately 5 days before my period and I have a BM I bleed REALLY bad on the first day.  So bad I can bend over and see it pouring into the toilet.  Then I get weak.  Next day it is brownish.  This keep happening everytime I have a BM until my period BUT the weird thing is, the more I bleed BEFORE my period, the lighter my period flow is.  No bleeding during sex. No pain eitherwith BM or sex.  I am 36 and have been on different types of BC since I was 18.  Stopped bc in Novemeber and am currently trying to conceive.  Have a low thyroid that is being managed and am taking my prenatals ritually.  The spotting I have had has been going on for about 2 years but since June of 2008, it is pro progressing rapidly.  VERY annoying I may add.I go Feb 25 2009 to see another GYN.  I hope he can help.  I do not know if this is or can contribute to TTC or pregnancy in general.  My opinion is that it is either period comiung out as I bear down to have a BM or a very vascular, sensitive cervix.  My opinion but I don't think I am far off.  All of my paps have come back normal and first doc done a biopsy for endometriosis and came back negative.  Ultrasouns were all fine however one showed a slightly enlarged uterus which he said went along with endometriosis ( which he said I do not have due to negative test results).I am eager to see this doc on the 25th.  I will post my resulst from his visit.  Feel free to contact me   ***@****",
            "post_id": "3988091",
            "timestamp": "1234582427",
            "user_id": "user_765026",
            "user_link": "/personal_pages/user/765026",
            "votes": "0"
        },
        {
            "answer": "I too have vaginal bleeding after sex & bowl movements, but the weird thing is I had my cervix & uterus taken out in May (a Hysterectomy). I am now going back for laparoscopic surgery to see if I have any endometriosis the Dr. may have missed. I have also read these symptoms could be a sign of STD's. (My husband would be in MAJOR trouble)! I don't believe that's my case. Before my surgery I would drop to the floor with stabbing pains in my vaginal area. It would happen just a few days prior to my periods, might sound funny but Caffeine would make it worse.  I went in & they found that I had endometriosis on my right ovary that they were able to lazar out but as for my uterus it was completely dead.I probably won't be checking back at this web site again, but if you would like to chat feel free to e-mail me",
            "post_id": "3998412",
            "timestamp": "1234879127",
            "user_id": "user_767985",
            "user_link": "/personal_pages/user/767985",
            "votes": "0"
        },
        {
            "answer": "Today, Thrusday February 20, 2009 I found out I am pregnant!  OMG I am so excited.  I don't go to the doctor until March 20 now but he is still going to check my cervix.  I will post what he says.",
            "post_id": "4010180",
            "timestamp": "1235124506",
            "user_id": "user_765026",
            "user_link": "/personal_pages/user/765026",
            "votes": "0"
        },
        {
            "answer": "First of all congrats on the pregnancy atvlady!  I wish you and the little one the best of health and luck!I just found this discussion and I also have bleeding after a bowel movement.  It just stared over the last few weeks.  I was at the gyn and he said my recent pap was normal and my cervix looked fine.  He did some cultures and said to track my next 2 cycles and let him know.  He said it could be hormonal.  I do have a small complex cyst on my ovary that he said was most likely from ovulation.  Also, he said that if it continues I will need a endometiral biopsy.  That scared me alot since that looks for cancer.  I only just turned 30!  I do feel better seeing the posts from everyone here and learning that this is common and many of you had so many negative tests.",
            "post_id": "4014917",
            "timestamp": "1235236628",
            "user_id": "user_244154",
            "user_link": "/personal_pages/user/244154",
            "votes": "0"
        },
        {
            "answer": "I am so happy I've found this forum.  I have been having these symptoms for a few weeks and have had 4 dr visits to try to get to the bottom of the issue.  My story: 38 yo, 2 children ages 5 and 3 1/2. I've had my tubes tied and I'm not on bc.  Occasionally I've seen bleeding before my period that doesn't flow out, so I guess that means it's cervical.  At the beginning of the year, I started to have bleeding during/after sex.  At first I thought it was just bad timing and my period started, but that wasn't the problem. The blood is bright red and enough to make me wear a panty liner for a day or so until it stops. Then bleeding during bowel movements started about a week later.  I've had vaginal ultrasound, PAP tests, etc, and nothing shows up abnormal. At the beginning of Feb. I had cryosurgery (sp?) and my dr. \"was sure\" that this would stop the problem, but it began again about 10 days later, and  more blood than before.  Now I'm scheduled for a LEEP procedure on Thurs. and I'm concerned b/c it might not stop the problem, but I'm not sure what other options I have.  I'm glad I've found this forum b/c I've been thinking that I'm crazy, and my dr. doesn't seem to know what to do with me.",
            "post_id": "4027545",
            "timestamp": "1235535451",
            "user_id": "user_776037",
            "user_link": "/personal_pages/user/776037",
            "votes": "0"
        },
        {
            "answer": "Hello there, it has been a while since I posted.  I am currently undergoing some fertility testing, and today I had an HSG (Hysterosalpingogram) which is where they inject dye into your uterus to make sure it travels freely through your fallopian tubes.  Basically to see if everything is \"open for business.\"  Well, the left side looked normal, but the dye going to the right side got completely blocked by something in my uterus - possibly a polyp.  I have been trying to conceive for a year and this polyp might not only be blocking that one tube, but it may be creating a hostile environment for an embryo.  And, to the concerns on this list, it turns out that polyps can cause the kind of spotting and bleeding we have all been experiencing.  I am going to schedule a procedure to take it out as soon as possible and see where we go from there.  If you google uterine polyps, you'll find more information on this.  Incidentally, when I had an ultrasound a few weeks ago, the doctor also noticed a white mass that he thought was unusual and could be causing the spotting in between periods.  So hopefully we have found the culprit.  This is my second HSG (the first was before my son was born) and I highly recommend the procedure as it really shows whether you have any blockages or not.",
            "post_id": "4030296",
            "timestamp": "1235600868",
            "user_id": "user_736344",
            "user_link": "/personal_pages/user/736344",
            "votes": "0"
        },
        {
            "answer": "Hello everyone.  Just thought I would make a post cause I told you all that once I saw the doctor I would post his findings.  The GOOD news is I'M PREGNANT!!!!!!!!!!!!!!!  Also, since I have gotten pregnant, I have not had ANY of the bleeding or spotting when I poop or anything.  It's all stopped.  I did have implantation bleeding but that was extremley little.  I have not seen the doctor yet as I am only a little over 5 weeks now.  So I can say from my stand point that the spotting most of us here are having ( IMHO ) is us \"pooping\" the lining of our uterus out aka pre-period.  This is my assumption since I have had this inconvenient spotting for many months now.  I hope this helps.  When I do see my doctor I am going to still talk to him about this cause I know how irritating it can be esp to wear a pad for 2 1/2 weeks out of the month!   Maybe my findings can help a doctor.  I don't know.  Feel free to contact me on yahoo messenger under contact name deesa72  and the same is my email.  And all of you please mention this finding to your doctor as well.  Maybe this can help but my pregnancy has certainly ended my days of spotting a week before my period.  I was thinking I had a vascular cervix but that appears to not be the case.  Take care everyone and I will check back periodically!  Take care and hang in there!",
            "post_id": "4036240",
            "timestamp": "1235740003",
            "user_id": "user_765026",
            "user_link": "/personal_pages/user/765026",
            "votes": "0"
        },
        {
            "answer": "3 years ago I went to the GYNO due to prolonged bleeding problem (after having no period for 3 months with only spotting), could not do a pap and sent me for two inernal ultrasounds and wanted to send me for a third (all inconclusive). I beleive they said there was some thinking of the endometrum but they were no so sure if it wasn't normal since it was so close to the beginning of my period. Put me on progestin breifly just to stop the bleeding and i worked in a day or two...never went back to get the third ultrasound...have had regular period since except for last 8 months...first of these had regular flow and on time (but no symptoms). I usually always had breast pain a week before period...no warning signs. Then I had longer but lighter than normal periods for 2 months..then no period for 2 monts....then I had a period for 4 weeks (not tha  heavy but steady), it stopped for 2 immediately after passing several large blood clots, then started again...and now have been bleeding for 3 weeks...anyone have anything similiar?",
            "post_id": "4044176",
            "timestamp": "1235946429",
            "user_id": "user_780640",
            "user_link": "/personal_pages/user/780640",
            "votes": "0"
        },
        {
            "answer": "hi everyonei am really glad ive found this site,even though there ar'nt any conclusive answers it makes me a lot less stressed knowing i arnt the only one going through this,i am 34 not taking the pill,and have been bleeding during sex for the last few months,i have only bled after a bowel movement once when i was trying to rush,i eat a relitevly healthy diet and have regular easy movements, perhaps eating a healthier diet with more fiber could help some with the bleeding after movements, i was wondering if anyone is having other health issues aswell as this,also it would be interesting to know how many of you suffer from pms,or are on any medications involving hormones ,i am just wondering if this is something to do with an hormone imbalance,i have been experiencing bad pms for the past few years,mostly with symptoms the same as low blood sugar such as feeling sleepy or losing concentration if i dont eat every few hours,shaking a couple of hours after ive eaten a sugary meal,blurry vision speech problems headaches.i have been sorting this out by changing my diet to a low glycemic one but now this is happening .Its a bit strange this is happening to quite a few of you in the week before your period surely if it was'nt hormonal it would be occuring all month long, just my thoughts.if anyone could answer my thoughts about hormones it would be very much appreciated,thankstake care all and i hope you all get this sorted out",
            "post_id": "4047420",
            "timestamp": "1236025335",
            "user_id": "user_781079",
            "user_link": "/personal_pages/user/781079",
            "votes": "0"
        },
        {
            "answer": "Today I had a diagnostic hysteroscopy and it showed scar tissue blocking about 3/4 of my uterus.  This is why I have not been able to conceive a second child.  My son's birth was complicated by preeclampsia and my placenta didn't deliver.  The scar tissue is most likely a result of the doctor manually retrieving the placenta.  This scar tissue is also probably the cause of my between-cycle spotting.  I am having surgery to remove it in a couple of weeks.  I will post again after that ...",
            "post_id": "4051808",
            "timestamp": "1236119229",
            "user_id": "user_736344",
            "user_link": "/personal_pages/user/736344",
            "votes": "0"
        },
        {
            "answer": "Thanks for all your helpful comments.I am 45 years old and have 2 children. I have always had undiagnosed irritable bowel syndrome and recently this has got worse.I have had about 9 periods in 6 months. I think I am on a period now (but am not sure as this one started a week after my last one finished.)I have got it in my head that I have something  not very nice as this period is not the same as usual- have had  fluctulating bleed for 6 days, when my periods are usually 2 days, and bad IBS. Everytine I go to the loo and have a Bowel movement I am still having a  show and my anxiety levels are increasing cos I think it is not going to stop.I can see that people in this forum have suffered far more symptoms and worry than me but I just wanted to post my comments as I think it will help.K",
            "post_id": "4058549",
            "timestamp": "1236261752",
            "user_id": "user_784359",
            "user_link": "/personal_pages/user/784359",
            "votes": "0"
        },
        {
            "answer": "Hey ladies!  I just wanted to post and say that, like many of you, I had an endometrial biopsy and it was negative for anything abnormal.  While that is a relief, I am still nervous about the bleeding episodes that happen how and then.  I have a small complex ovarian cyst that my doc believes is a result of ovulation and will go away on its own.  I need another ultrasound in two cycles.   I hope all goes well.  For now I am on the watch and wait plan.  I love the wait part.  I will keep everyone posted if I get any answers.  Please let us know if any of you get any info also.Thanks.",
            "post_id": "4060422",
            "timestamp": "1236288432",
            "user_id": "user_244154",
            "user_link": "/personal_pages/user/244154",
            "votes": "0"
        },
        {
            "answer": "I am 31 with 4 kids and very irregular period.  I also have had the bleeding after BM and intercourse that just recently started.  I also have the worst very low back pain (anyone else have this?!!)  I went to the Dr and she felt my ovaries, uterus, checked my cervix and said it looked okay but that it could be polyps in my uterus.  Should I be concerned??!!  I don't know if I should see another Dr for a second opinion?  I had a normal pap in August.I do feel better finding this forum though like everyone else am still concerned.I see someone else posted about Lexapro, I'm also on Lexapro but have been for 4 years.",
            "post_id": "4098302",
            "timestamp": "1237245288",
            "user_id": "user_795513",
            "user_link": "/personal_pages/user/795513",
            "votes": "0"
        },
        {
            "answer": "I, like everyone else it seems, have been suffering with the same symptoms for 3-4 years off and on again. No doctor can pin point any particular cause and it seems to me that with so many women with the same problem, more doctors would be exploring the issues and getting answers instead of putting it off on us as just being a woman. If that were the case, all women would be suffering from it and one time or another. Most women I know dont have these symtoms and never had. I am now 30, had HPV when I was 20. I had cryo surgery to remove 2 small growths on my cervix soon after the HPV was found. I had 3 children within 7 years after that all happened. I did not experience any bleeding during intercourse or bowel movements until after my 3rd child was born. All paps have been normal since and I have not been on any BC since my 3rd child was born. (my husband got a vasectomy) I will keep monitoring the posts to see if anyone has answers besides a hysterectomy. I am not sure if thats the route I want to go at such a young age...",
            "post_id": "4099390",
            "timestamp": "1237268627",
            "user_id": "user_795836",
            "user_link": "/personal_pages/user/795836",
            "votes": "0"
        },
        {
            "answer": "Hi,I am 33 ,mother of two,I had very regular periods till I was diagnosed with hypothyroidism and put on levothyroxine. Got regular spotting in between periods esp after BMs which stopped once I stopped Synthroid. but this month a week after my periods (which were late by a week) I noticed slight blood streaked dscharge on the toilet paper and PMS like syptoms.It kept continuing and became bright red with bowel movements gradually.Can be hormonal imbalance due to hypothyroidism or early perimenopausal symptoms. Saw this great womens website with a syptom checker. See if this helps.here's the linkhttp://www.womentowomen.com/assessments/hormonalhealth",
            "post_id": "4108802",
            "timestamp": "1237488773",
            "user_id": "user_798504",
            "user_link": "/personal_pages/user/798504",
            "votes": "0"
        },
        {
            "answer": "Hello Everybody, The last time I posted on this blog was November of \"08\" I had the same problems as many of you on this board. I had what I was told was a lesion of blood vessels on my cervix which made them very sensitive to the touch. I was scheduled to have a hysterectomy on Dec. 2, which my insurance denied. I had to go through cryo-therapy and that didn't work. On Febuary 19 my Dr. scheduled a leep procedure (keep in my mind my 2nd Dr.) He wanted to perform it in the hospital because the bleeding had become so bad. When I woke up it was to the dreadful words of my Dr. telling me I had cervical cancer. When all of this began in Sept. \"07\" I had papsmear, ultrasound, endometrial biopsy. I was told that it was a hormonal problem and given a merina iud. The bleeding continued (keep in mind all of the test above came back good.)I was told that my body would take time to adjust to the iud. I wasted 11 precious monthes with this moron of a Dr. I thank God everyday that I finally went for that 2nd opinion. My 2nd. Dr. done all of the same test and all came back good once again. I guess I just want to warn everyone that papsmears are not always correct and you know when theres something wrong with your body so be persistent don't take the word of just 1 Dr. get a 2nd and a 3rd. if thats what it takes. I was reffered to a wonderful GYN Oncologist, who staged my cancer at 1B1. On March 12th. I had a radical hysterectomy. I'm happy to say that all lymphnodes were clear and my Dr. thinks I will be fine and I don't have to have any further treatment.  Ladies PLEASE don't take this matter lightly..",
            "post_id": "4120897",
            "timestamp": "1237781803",
            "user_id": "user_343140",
            "user_link": "/personal_pages/user/343140",
            "votes": "0"
        },
        {
            "answer": "Hello EveryoneWOW good to know Im not alone.  I have always had irregular periods. Started kinda late when I was 14.  After I had my first  child at 21 they kinda evened out.  I waited 7 years and got pregnant again. Had probs with Pregnancy from the beginning with Bleeading and Contractions.  Never really got a diagnosis though. My 3rd child had same issues but I ended up having a C Section.  I have had probs again with bleeding I had a period for 4 months. My doc put me on BC (first low dose) and then progressed to really strong doses. Nothing stopped the bleeding. He went in and catarized my uteris and scraped. I had a 70% chance of never having period again. Of course that was not the case. I am in the 30% that start having problems again. I have since started seeing a new OBGYN. I had a period for 1 month. Off 1 week. Started again for 3. I am only 34 so I cant imagine Im menopausal.  I am having bloating, pressure and Pain on my left side (ovarie).  Really bad at times. Now just the same as all of you I am bleeding when I have a bowel movemant. IT is bright red and then it turns brown. Just enough to wear a panty liner.  This has been happening for about a month now.  I am also mildly  constipated. But blood is defiantly coming from Vagina. I went to OB 2 weeks ago and we are doing a ultrasound in 2 days.  From the info everyone posted it sounds like it may not help find anything.  If it does I will post and let you all know if I find anything out.",
            "post_id": "4124951",
            "timestamp": "1237868375",
            "user_id": "user_802845",
            "user_link": "/personal_pages/user/802845",
            "votes": "0"
        },
        {
            "answer": "I have the same issues I am 30 have 3 kids and tubes tied 7 ad half years ago. But I have been also havig sever  pain with my periods and I have 2 a month also one of my ovaries have disappeared (they say it was from where they put the ring on my tube to tight and cut off blood flow to it). I have been to so many doctors ad to the er I have even had oe tell me that the pai was all in my  head I have an appt. Friday with another doctor I hope I can get some where with this doctor. This will make doctor number 8 I thik my big problem is that I do not have good insurance so they just don't care.  I can't do it any more. The pain gets so bad at times that it is worse than giving natural child birth all over agian.  I have cried ad begged the doctors to please do some thing to help but they keep telling me to take birth control pills that does not help. I hate it that there is so many of us suffering with this and have no answers. All we can do is grin and bare it like my 5th doctor told me but I am at the point of giving up I can not do sit ups with out bleeding lift any thing heavey or any thing else. But I have been going through it for almost 8 years in November.   Some times it depresses me so much I stay in the bed for weeks at a time. Please if any one finds out any thing lets us know. Believe me ladies it just get worse the loger it goes on.Jessie in West Virginia",
            "post_id": "4132950",
            "timestamp": "1238040807",
            "user_id": "user_805261",
            "user_link": "/personal_pages/user/805261",
            "votes": "0"
        },
        {
            "answer": "I don't understand how there are so many of us with this issue and you can't find any medical research sites talking about this.  Is there no one out there doing research into this issue because obviously it's an issue.  There are posts for two years on here and there is no data to help us.  Just a bunch of tests with luckily good results.  So why can't anyone explain this?  What is going on with our bodies?? More and more women can't conceive or have a very hard time conceiving, and now there's this mystery bleeding.  I wish we could all get some piece of mind by having a real professional come on here and let us what this is and how to treat it.  Congrats to all that were able to still conceive through this mess and thoughts and prayers out there to every lady going through this mess.  God bless all of us.",
            "post_id": "4149322",
            "timestamp": "1238462637",
            "user_id": "user_810421",
            "user_link": "/personal_pages/user/810421",
            "votes": "0"
        },
        {
            "answer": "I am 30, have had one child, age 4....and started bc pills soon after having my baby....was on bc for about 4 years, until my husband and I got married six months ago....since that month, have been off bc and trying for a second baby....however I have my period sporatically and every few weeks...all i do is bleed...sometimes heavy, sometimes light.....but also for the last four years, on and off, have had pain occasionally with sex---bleeding after sex and after bm...not every time  but sometimes....I am very afraid that I will not only never get pregnant again---but may have something seriously wrong with me....although seeing how many  women share these weird symptoms, gives me some hope that maybe it's just something that happens to some people....I think though, that I before getting pregnant and having my daughter, I had my period once a month....never knew exactly when, but it always lasted nine or ten days...never spotted between periods and never bled with bms.....this all occurred with me after having a child and after using birth control.",
            "post_id": "4351357",
            "timestamp": "1239686718",
            "user_id": "user_870265",
            "user_link": "/personal_pages/user/870265",
            "votes": "0"
        },
        {
            "answer": "The last time I posted was January 25th. Alot has happened since then...I was referred to an M.D., by a close friend, who specialized in \"holistic care\" or \"naturopathy type care. Before my first visit he had me fill out a 13 page questionaire and during my  1 1/2 hour, first visit, with him, he highlighted all the concerns he had with my symptoms and then proceeded to ask  me more about them. He didn't make me feel rushed and he seemed to enjoy the investigation part of the appointment. By the end of the appointment, he had about three different ideas and he then ordered about 15 different lab tests to verify what he thought could be wrong. The most different part of the appointment was at the end he said to me, \"I will be able to help you with these problems\". I had to question what he said, and he again assured me, \"yes, I will be able to help you\". I wanted to cry. I told him no one else had told me that in the past 1 1/2 years. It was more of \" well sorry you are having these things happen in your life/body, but there isn't anything we can do\". This really gave me newfound hope, strength and reinforcement that what was going on wasn't right and that someone else could actually help my symptoms. Some of the most significant lab tests results were my estrogen, progesterone and growth hormone levels. To remind you I was on birth control pills from age 18 to age 27. At that point I got pregnant and proceeded to either be pregnant or be breastfeeding for the next 4-5 years, including my miscarriage pregnancy. I didn't use any birth control pills during these years. In July of 2008, I had surgery for endometriosis. And then immediately got pregnant within that next month. I had my miscarriage in November. And then had two D/C's due to retained tissue. I had irregular bleeding as well as many other symptoms like pms-type symptoms, always feeling cold, exhaustion, mild depression, loss of appetite, nausea, irregular bowel movements, headaches, frequent illness to name a few. In December, I decided to go back on birthcontrol pills. My nurse midwife thought it would help my symptoms and I for sure didn't want to get pregnant at that point. So I was on Yaz up until this month. Typically, when you are on birth control pills it does decrease your own hormones like progesterone, estrogen, and growth hormone. A typical estrogen level while on birth control pills would be a minimum of 100 but optimal would be 200 level....mine was only 20. This blood test was done on day 20 of my cycle. My doctor told me that this would be a typical level of a man!! My progesterone and growth hormone were also much lower than they should have been.He suggested I stop my birth control pills at the end of this cycle. He also found that my serum iron level was extremely low as well as my vitamin D level and a thyroid level was off as well. My thyroid level has been checked before and it was always within normal limits but he took it a step farther and did many other thyroid checks along with my temperatures that he had me take during my period, this showed there is some insufficiency with my thyroid. Not enough to put me on Synthroid or the like but enough that it could be effecting my cycle and bleeding. So I am now taking many supplements here are a few....prometrium(progesterone), vitamin D, Iron, Zinc, prenatal vitamin, Iodine(for the thyroid issue), DHEA. Then once I finish this packet of Yaz I will stop taking them and start taking an estrogen gel from day 4-28. This is a gel that I will rub into my thigh. This will allow my own natural hormones to start building again and with the combination of the other supplements start regulating my entire system. I have also been checked for food allergies in the past and found to be sensitive to yeast both bakers and brewers. That alone can cause many multi system issues. So he has me on difulucan for 10 days to help kill any extra yeast in my body.He said it will take a few cycles to get me regulated and from that point on we will determine how healthy I feel to try to get pregnant again. I urge all of you to search for a M.D that will really \"hear\" what your concerns and symptoms are. It's amazing to actually have an appointment with an M.D. who is familiar with all of these things and is confident in being able to make a change for the better in your life. I have found since I have been taking the prometrium(progesterone) that I don't have the irregular bleeding, like during bowel movements and sex etc...I can only imagine what changes will take place once I get my estrogen level to a healthy number. I would like to mention my OB/Gyn never once checked my estrogen/progesterone level while I was under his care. Good luck to you all and I will keep you updated through this process.",
            "post_id": "4352991",
            "timestamp": "1239731029",
            "user_id": "user_746368",
            "user_link": "/personal_pages/user/746368",
            "votes": "0"
        },
        {
            "answer": "Hi,I'm new, and I've never posted anything to any forum before, but when I saw all your stories, I could totally relate!  Some info I received from my doc in February may help you.  I am 36 and my hubby and I have been ttc for 8 mos.  In February, 5 days after my ovulation predictor kit was positive, I was in the bathroom, having a BM and felt a gush and sure enough, bright red, definitely vaginal, not rectal, blood.  I panicked and wondered if I had an early ectopic pregancy burst or something like that.  I had no pelvic pain or pressure, just a regular bathroom visit.  It stopped fast but seemed like a lot of blood quickly so I went to the ER and an ultrasound showed I'd had a hemorrhagic ovarian cyst just burst.  I was surprised but apparently these are quite common, can re-occur (yippee) and are considered \"functional\". They are formed after you ovulate and the corpus luteum folds back on itself and traps blood which may continue to accumulate and can burst on its' own or during a bowel movement when there's more pressure in the pelvis.  The ultrasound also showed I have a subseptate uterus and we're being referred to a fertility specialist but our appt is not until June.  I have been having brown spotting usually the last 10 days or so before my period since I went off the Pill in September.  This was so different looking than that though.  Today, same thing happened again and I'm 10 days past the positive ovulation predictor kit, so I can only assume it's another cyst that just burst.  I just have some light brown spotting now, no blood.  Sigh. This is so frustrating but when I checked out some other internet sites about the hemorrhagic cysts, it does indeed say that it can happen over and over.  Grrrr.  I had no problems of any sort prior to going off the Pill.  This all started when I went off.  I am so anxious to conceive and we are so excited to have a baby so this is pretty scary, but I'm hoping it's \"just the hemmorhagic cysts\" and am very interested in what the fertility doc says when we see him in June.  Hang in there, everyone.  Maybe we are all okay after all?",
            "post_id": "4362516",
            "timestamp": "1239922746",
            "user_id": "user_873671",
            "user_link": "/personal_pages/user/873671",
            "votes": "0"
        },
        {
            "answer": "I  have had this same problem, bleeding with bowel movements, after sex, irregular menstrual cycle. This has been ongoing and bothersome for months.I found a doctor who listened, and did the appropriate tests- ultrasound of my uterus and a transvaginal  ultrasound. He has found I have a Uterine Polyp. This is how he explained it to me..The polyp is located on the fundus part of the uterus. Whenever I contract my uterus, for a bowel movement, sex, exercise,- it squeezes the polyp causing it to bleed. He is going to do a simple out patient procedure called a hystoscopy to remove it. So all should be well.I will post anymore information I learn after my procedure.Just be persistent with your physician for him/her to order the appropriate test, dont give up!!!",
            "post_id": "4511485",
            "timestamp": "1243603308",
            "user_id": "user_921206",
            "user_link": "/personal_pages/user/921206",
            "votes": "0"
        },
        {
            "answer": "I am having the same problem--vaginal bleeding after a bowel movement--usually just a day or two before my period, but this week I bleed and I'm nowhere near having my period.  So, from reading all of your posts it seems like the following are what have been diagnosed.disorganized endometriumfriable cervixTilted UteriusHemorrhagic CystsFor those of you who have received an actual diagnosis, has the problem cleared up for you?",
            "post_id": "4614506",
            "timestamp": "1246424038",
            "user_id": "user_954525",
            "user_link": "/personal_pages/user/954525",
            "votes": "0"
        },
        {
            "answer": "Hi all,Well, I last wrote in April and had been having that bleeding during BMs etc... and had a hemorrhagic cyst burst.  At the end of April, I found out that I'm pregnant.  I'm now 18 weeks along and guess what, every couple of days, I have a slight bit of bright red vaginal bleeding following a BM.  The High Risk unit is following my pregnancy as it turns out that I have 2 uteri!! (so weird!!)  They want to make sure the uterus that the baby is in will stretch enough so that they can watch for premature labour.  But, we managed to get pregnant on our own, after 8 mos and I still have the bleeding which has scared the heck out of me regularly since I sure didn't expect that to continue while pregnant.  Now the ob/gyn says it might be because I currently have a low-lying placenta or just some extra fragile new blood vessels on my cervix which may occasionally ooze.  That makes sense now, but not before, but I guess that was the cyst bursting.  Because we are being followed by the High Risk unit, we get an ultrasound once a month and our baby is growing really well, and is very busy.  I am thrilled and relieved by that.  As for the bleeding, it has not prevented me from getting pregnant or maintaining a pregnancy, so for all you gals TTC through this, I have my fingers crossed that it will happen for you too.  It did for me and I didn't do anything extraordinary.  Hang in there, everyone, through this frustration.  There must be answers for us.",
            "post_id": "4712876",
            "timestamp": "1248914777",
            "user_id": "user_873671",
            "user_link": "/personal_pages/user/873671",
            "votes": "0"
        },
        {
            "answer": "Hello everyone.  It has been a while since I posted on here.  Unfortunatley I had my baby in June.  June 6, 2009.  She was severeley premature and did not live.  I developed severe preeclampsia and HELLP syndrome.  I have all new drs now and I love them.  The main dr I am seeing was telling me that andemyosis has a link with HELLP syndrome.  Our daughter was only 20 weeks one day gestational.  They are running a slew of tests on me now to figure out what and if anything is going on with me.  I will keep all of you updated.",
            "post_id": "4716238",
            "timestamp": "1248987710",
            "user_id": "user_765026",
            "user_link": "/personal_pages/user/765026",
            "votes": "0"
        },
        {
            "answer": "Dear Atvlady,I am so incredibly sorry for the loss of your precious daughter.  What an awful time this must be for you.  I apologize for my cheerful post the day before yours which may have made you feel worse.  I am glad that you are in good hands now and that your doctors are on board and trying to help you so that your baby dreams can come true.  This has been an on-going struggle for so many of us and my fingers are crossed that you will have answers soon.  Please keep everyone posted and take good care.",
            "post_id": "4718698",
            "timestamp": "1249053851",
            "user_id": "user_873671",
            "user_link": "/personal_pages/user/873671",
            "votes": "0"
        },
        {
            "answer": "atvlady, I'm so sorry for your loss :(An update on my side - my baby was born end of February (full term) and she is healthy and beautiful! We had a bit of a 'scare' in that I had some bleeding 1 week before baby's due date and I passed a *huge* blood clot, but everything was fine except that I had started dilating. Baby went on to be born exactly on her due date.I saw the colposcopy specialist twice (3 weeks and 3 months after birth) and everything still checks out okay. He did one more pap smear and he's handed over care back to my family doctor, as all changes he's seen are expected though accelerated and tests come back normal.I've not had bleeding since the birth (and have yet to get my period since I'm breastfeeding). So for me, things are looking good.",
            "post_id": "4723349",
            "timestamp": "1249172772",
            "user_id": "user_622177",
            "user_link": "/personal_pages/user/622177",
            "votes": "0"
        },
        {
            "answer": "Wow, awesome news, Sunshine Sara!!I hope I am lucky enough to have a happy ending too.  You must be so relieved. Congrats on your new baby and enjoy.  I hope all goes well with your health from now on.",
            "post_id": "4731420",
            "timestamp": "1249393625",
            "user_id": "user_873671",
            "user_link": "/personal_pages/user/873671",
            "votes": "0"
        },
        {
            "answer": "I had vaginal bleeding during the bowel movement but it was the day when my period had to start and I am having period now. I am so worried about it because I am virgin I think my hymen is broken. Please help do you think I am not a virgin anymore? I wanna cry out lout :(",
            "post_id": "4809473",
            "timestamp": "1251328035",
            "user_id": "user_1018344",
            "user_link": "/personal_pages/user/1018344",
            "votes": "0"
        },
        {
            "answer": "I am so sorry for your loss!  I have a baby boy in heave Adam Tyler - he was born 18wks 5 days gestational in 2006.  I have two living children (full term and in elementary school now).  His delivery was the most difficult of them all - pain control, everything...  He was perfect, the umbilical cord was wrapped around his neck 3 times.  Something which is noticeable on ultrasound (of which I had 3 days prior to his slow death)  PLEASE CHECK OUT DR JASON COLLINS' INFO AT WWW.PREGINST.COM  LONG  story short I have \"healthy\" low blood pressure which runs in my family, my father has even been treated for low blood pressure - low b.p. is just as dangerous at high b.p., even more so since it goes unmonitored during our pregnancies.  I also have a thyroid issue... not discovered by the regular thyroid tests, only the more in depth test...May you find peace and hopefully answers too.  Also look at www.missinggrace.com and www.missfoundation.org.  Both have been very helpful in my grieving process.So I now found this web site and this list searching for information on my latest problem - vaginal bleeding after a bowel movement....  I go to a doctor in three days and am going to have my thyroid meds checked...  I'm hoping it is just an adjustment needed...  I haven't read all the posts yet, but has anyone with this issue ever had thorough thyroid testing done????  looking for another answer along this journey of life... until I hold my Adam in heaven :)",
            "post_id": "4941497",
            "timestamp": "1254701945",
            "user_id": "user_1062795",
            "user_link": "/personal_pages/user/1062795",
            "votes": "0"
        },
        {
            "answer": "I was reading the many posts on here because I am having the same symptoms, and first I want to say that I am sorry for both the mothers losses above....I can't imagine what that must be life for I have no children but it is really amazing to be able to have a community like this of suppport....Back to the subject-- I have been researching this for quite sometime due to my symptoms and I ran across several articles on mothers that were pregnant between the early 1900s (like 1930-1950) to 1971 were given DES if they were having complications with pregancy and well......this causes these very side effects in DES daughters who were exposed or had been given if you are the mother receiving DES.  I am asking my doctor tomorrow about this so I will let everyone know how that goes.  I'd be interested to know how many of our mothers were exposed to this drug.",
            "post_id": "4980992",
            "timestamp": "1255690059",
            "user_id": "user_1075511",
            "user_link": "/personal_pages/user/1075511",
            "votes": "0"
        },
        {
            "answer": "wow....sorry for all the grammatical errors above....geez, I need to slow down and pay attention to what I am typing.  It might make more sense. Sorry guys",
            "post_id": "4980997",
            "timestamp": "1255690193",
            "user_id": "user_1075511",
            "user_link": "/personal_pages/user/1075511",
            "votes": "0"
        },
        {
            "answer": "Hi there - well, as many of you - I'm glad that I found this forum.  Congratulations to all of you who are pregnant or had a baby!  And, I'm sorry to all of you who've had sad endings.As all of you - I'm very confused by my symptoms.  I just had a baby 6 months ago.  I had been on bc for about 9 years before conceiving my first child.  I got off bc, and a month later was pregnant for my first.  A month into the pregnancy, I began bleeding badly - but everything ended up fine, and I had my first perfect daughter.  And, then, all of the problems began.  After my first daughter, I would bleed A LOT after sex.  It really affected my sex life.  It was annoying.  Sex was uncomfortable - but nothing was wrong.  Tests came back clear - I was \"normal\".  I did, as all of you, baffle my doctors.  My husband and I decided to get pregnant again - and we did.  I needed a fertility monitor this time, and got pregnant the first month after using the fertility moniter (Clearblue Easy - AMAZING!).  I was bleeding during sex and everything - and it didn't matter.  At this point, I had found that I had a sensitive cervix, or at least that is what everything pointed to.  Once again, a month into my pregnancy I began to bleed badly - and once again, everything was fine.  I had another beautiful daughter.  It's been 6 months since giving birth - and obviously all of my pregnant hormones have gone away - because while pregnant, I wouldn't b leed at all - and now, it seems that I bleed all of the time.  I bleed during sex.  I bleed when I have a BM.  I sometimes think that I bleed when I sneeze!  I have a week of spotting before my period.  Very dark brown blood.  Then, I have a painful, long, and heavy week long period, and then another 3 or 4 days of spotting after that.  My doctor believes that since she put me on bc, it will all go away in a couple of months of being on the bc.  My doctor from Michigan told me to call her if this happens and she will send some sort of insert to take care of the problem.  WHO KNOWS???I'm happy that I'm  not the only one dealing with this.  Yet, pissed because, it seems that I have AWESOME pregnancies and deliveries, yet - I'm not normal in other cases.  I'm going to call my doctor in Michigan and see what she things.  She's a OBGYN and I think that she is WAY more knowledgable than my doctor here on the island.  Good luck to all.  I'll definitely keep you all posted.HeatherDutch Harbor, AK",
            "post_id": "4983998",
            "timestamp": "1255762486",
            "user_id": "user_1076503",
            "user_link": "/personal_pages/user/1076503",
            "votes": "0"
        },
        {
            "answer": "' i have strong cramping in my uterus,irregular periods,lower back pain,pain durring intercorse and sometimes i bleed after,frequent urination, irregular bowel activity, and im always tierd.whats going on with me. And i have a family history of uterine cancer. if someone else has these problems, PLEASE LET ME KNOW WHATS HAPPENING",
            "post_id": "4998285",
            "timestamp": "1256148294",
            "user_id": "user_1081415",
            "user_link": "/personal_pages/user/1081415",
            "votes": "0"
        },
        {
            "answer": "My bleeding has been completely gone for a few weeks now!My doctor didn't see anything and lab (pap and thyroid) tests were normal.  I started researching and thinking...  I found some posts about drinking beet juice and others about drinking apple cider vinegar to rebalance your system.  Thinking about the vinegar, how the doctor's use it vaginally after a colposcopy, douches have vineger, vinegar is a natural cleanser, vinegar is a natural anti-fungal ,etc...  I tried douching with half vinegar and half water.  The first week I did it 3 times and now once a week for a short while.  I do not have any vaginal bleeding anymore!!!  I don't see how trying this could hurt anyone!!!!  (FYI - the over the counter douches don't have much vinegar, so I used a OTC bottle and refilled it myself.  The Summer's Eve bottles were easy to refill, some have very small openings to prevent us from refilling.)  Good luck!",
            "post_id": "5015553",
            "timestamp": "1256589710",
            "user_id": "user_1062795",
            "user_link": "/personal_pages/user/1062795",
            "votes": "0"
        },
        {
            "answer": "After reading all these, I am relieved in a way to know I am not alone.  Here's my story and input.  I have had this abnormal bleeding (after BM and during/after intercourse) for about a year.  First they said I it could be polyps, which they removed.  Still bled.  Then they did a D & C because they said my lining was too thick.  Still bled.  Next they wanted me try BC pills.  Still bled.  So they did a MRI of my pelvis which showed that I have a condition called Adenomyosis.  This is a condition where the uterine lining grows back in to your uterine lining.  Which leads to shedding, which appears to be more prevalent during a bowel movemnt or intercourse.  This is common in women ages 35 and up who have already had children, and the only real cure is a hysterectomy.  However, I am only 28 and have no children.  So this is not an option.  Not sure what to do at this point.  I hope this helps!!!",
            "post_id": "5068880",
            "timestamp": "1257961552",
            "user_id": "user_1104617",
            "user_link": "/personal_pages/user/1104617",
            "votes": "0"
        },
        {
            "answer": "I have been trying to have a baby going on 5 years.  Spotting starts 10 DPO like clockwork.  Bleeding during B/W on the 10th DPO only and then it stops.  Like many of you the Dr.s said it was nothing - the spotting and bleeding during B/M.After 2 fertility dr's i started taking acupuncture, still have bleeding after B/M but the spotting seems to have shortened.  Acupuncturist said my hormones are WAY off balance which is why I am spotting. I am at a loss, as I have tried almost every herb for fertility out there & am now on a gluten free diet.  All tests/scans/ etc show normal and I fall into the \"unexplained\" category.  After 5 years i am ready to give up.  It does seem that bleeding during a B/M does not affect fertility though - any comments/ideas/suggestions?  I am not taking crampbark & false unicorn root ~ maybe that is my key.",
            "post_id": "5180072",
            "timestamp": "1260977551",
            "user_id": "user_768547",
            "user_link": "/personal_pages/user/768547",
            "votes": "0"
        },
        {
            "answer": "I was just diagnosed with GI Endometriosis.  Endometriosis can grow on any organ, including bowels, intestines, etc.  Many times when a woman has GI Endo it can cause bleeding with bowel movement.  Endo can also be the cause of fertility problems.  Just thought I'd let you all know that I finally found out what the heck was happening with my health!  It is a relief to know what the problem is!Best of luck to all.",
            "post_id": "5181879",
            "timestamp": "1261012982",
            "user_id": "user_954525",
            "user_link": "/personal_pages/user/954525",
            "votes": "0"
        },
        {
            "answer": "WOW.. I'm so glad I'm not alone... I thought I was dying I'm still freaked out.. I too have a lot of the same symptons.. I bleed after my morning BM not after sext not yet anyway.. then 8 days ago I had bled very light for 14 days straight.. very weird.. I have been irregular all of my life.. I tried getting on the pill but couldn't handle the sideeffects.. I'm 36 yrs old and can't wait til I don't bleed anymore..I am going to try what the girl suggested of douching w/ water and vinegar.. maybe that'll work..Good luck ladies.. let's keep in touch.. I'll pray for all of youMerry Christmas!!!",
            "post_id": "5201002",
            "timestamp": "1261594762",
            "user_id": "user_1147624",
            "user_link": "/personal_pages/user/1147624",
            "votes": "0"
        },
        {
            "answer": "I notice that most of you are still getting periods.  I have been in menopause for about 5 yrs, but recently had a large fibroid removed, and I just started with this symptom - slight vag bleeding after bowel movements.  In addition I have an itching/burning sensation in the lower abdomen after the BM.  The bleeding had stopped for the last 1 1/2 days, but I just had recurrence today after another BM. Went to my surgeon's office for urine culture yesterday, don't know results yet.  I thought the burning sensation was from the bladder, but I'm thinking now that it may be from the uterus/vagina.  I curious to find out what my surgeon thinks when I go for follow up, post op visit next week.  I've wanted to start HRT since menopause, and wonder now if this is also what is needed for this new symptom.  I've heard that your pelvic organs get a little weak, and bleed easily after menopause.  Unfortunately I went through this at a young age.",
            "post_id": "5201113",
            "timestamp": "1261597792",
            "user_id": "user_451186",
            "user_link": "/personal_pages/user/451186",
            "votes": "0"
        },
        {
            "answer": "First and foremost I found this while reading:I found some information online about those of you who have had children, pelvic surgery, or a hysterectomy, as far as the bleeding after BM's: sometimes the lining between the rectum and the vagina can stretch, strain, or tear, causing bleeding from the vagina.  It's called a rectocele or an enterocele.  Has anyone had this diagnosis?  It is pretty rare for those who don't fit into one of the above categories, but I suppose it's possible.  Treatment can be as simple as taking stool softeners, but can go all the way up to surgery.  Let me know!This is my story:I've been reading this thread, and like most of you am relieved that I am not alone.  Without retelling my whole story, basically I am the same as many of you: bleeding during or after intercourse (on and off for a few years, but not every time) and just recently bleeding after a BM.  I haven't gone to the gyno about the most recent symptom, but have been for the other.  I'm 26, no children, and have been on some form of BC for almost 8 years because off of it I have extremely painful and irregular periods.I've had all the tests you can think of, minus the endo procedure: Pap's, colonoscopy, ultrasounds, STD tests.  No polyps, cysts, STD's, etc.  My gyno told me that I may have a sensitive cervix, like many of you have also said, but I've done the silver nitrate and the cryo with little or no results.  It always comes back.Then my doctor said it may be from my birth control, so we changed that 3 times.  No lasting changes.Then they said I had minor yeast and bacterial vaginosis (BV) infections, to which they prescribed basic meds.  These usually don't cause bleeding though, so I was skeptical.  The symptoms came back, as always.I still don't have answers and have been to 3 doctors.  There is still always the possibility of endo, but I don't want to do that belly-button procedure :(  If anyone even has suggestions, I'd be happy to hear them :)  Good luck everyone!",
            "post_id": "5317869",
            "timestamp": "1264701134",
            "user_id": "user_1191502",
            "user_link": "/personal_pages/user/1191502",
            "votes": "0"
        },
        {
            "answer": "I can't believe how many people have had a similar problem.  I am a 29 year old female and I have had rectal bleeding after bowel movements for approx 4 years now.  First I attributed this to the fact that an ex boyfriend tried to perform anal sex which caused me to bleed.  I figured it never healed.  More recently I realized I might have a hemroid that causes the bleeding.  Within the past 4 month have had another problem.  I have been noticing spotting durring and after intercourse.  It happens around the same time every month which is about 7 to 10 days before my actual period starts.  It has really started to scare me.  I just recently started a relationship always use protection.  When googling my symtoms I have saw cancer, HPV, Polyps.  I know I have to make an appointment with the doctor but I am really scared.",
            "post_id": "5318379",
            "timestamp": "1264708802",
            "user_id": "user_1191662",
            "user_link": "/personal_pages/user/1191662",
            "votes": "0"
        },
        {
            "answer": "WOW.. Im amazed by this post.. and I like most of you have felt alone and relized were not.. I am a 29/f with Endomertiosos and Adenomyosis.. I have had it for 5 years now.. I have had 3 Laparoscopy to remove some of the endo and some they could not remove and they had asked if I wanted to get a Partial Hysterectomy  which I am all set with.. I have two children and had a misscage in between my daughters who are 8 and 5...It is hard to have children with this condition but depending on how bad you have it..I also have had miner bleeding during sex and after BM... The BM there thinking was due to a very small hemroid.. I have gone for all kinds of blood work and sono's ,ultro's, Sigmoidoscopy ( which said everything was healthy but small hemriod) all my other test came out normal. I have lower back pain which i know is due to Endo..bad cramp uhhh I feel for each one of you and I hope something is done for your comfort..!But one thing that recently happend to me is.. I had a new partner a few months ago where there was one time we didnt use protection and I got Chlamydia from.. well I went to the hospital becuase it made my condition so worse I felt like I was in labor with really bad low back pain and stomach cramps.. thought I was passing something.. That was the first time that i got a pap dont and it didnt hurt or feel weird but i bleed right after i had pap done which isnt normal for me.. Its scary the things that are out there .. so from one women to another please be safe..",
            "post_id": "5332298",
            "timestamp": "1265075800",
            "user_id": "user_1196539",
            "user_link": "/personal_pages/user/1196539",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies for posting!!!  I'm glad I am not alone.  I just turned 35 and I've been having abnormal bleeding for the past two months.  It usually occurs only when I'm straining with a bowel movement.  I've been having pain in my lower pack which sometimes radiates to my upper left shoulder.  At the same time, I've been having really bad lower pelvic cramps which sometimes radiate to my upper left breast.  Other symptoms I have are bloated lower abdominal area and flatulence.  At first, I could have sworn it was vaginal bleeding, but my gynecologist says that she saw blood in my rectum area and she suspects hemhorroids.  She gave me zypram(?) for the hemorrhoids (which I'm guilty of not yet using!).   I'm still confused as to where the blood is coming from since there's a lot of it and it's bright red.  I keep thinking I have endometriosis or colon cancer or ectopic pregnancy or diverticulitis.  I'm hoping this is easy to diagnose.  I'm too scared to see a doctor, but I know I need to go very soon.  I got scared reading everyone's posts.  Some still no diagnosis.  ...Many with endometriosis, friable cervix, tilted uterus, cysts, polyps, adenomyosis, IBS, etc... scary!    My pap tests, blood tests, and urine tests came out negative.  I'm now going to request an ultrasound.  ...SCARED....busy praying!!!!  love you all for sharing.....",
            "post_id": "5356505",
            "timestamp": "1265678974",
            "user_id": "user_1199184",
            "user_link": "/personal_pages/user/1199184",
            "votes": "0"
        },
        {
            "answer": "Hi, my name is tanya and I'm 25 with one 3yr old daughter have been trying to get pg for 2yrs and have been having many issues first I was missing periods from 2 to 6 months in a row in the past year I know I'm over weight I'm 5,7 and 251lbs but I have just latley been having werid stuff happening to me like since nov.of 09'I've missed my period up till jan 25 10'and this month feb6 I had sex and bled the next morning then it went away then two days later I had horible cramps and pain in lower abdomen the next day I had red watery bleeding then later that same day I got heavy bleeding I was like wow I had forgotten how it felt to get a full blown period rather than none or 3days very light so then the next morning I woke up in a small puddle of blood the size of a normal pankcake I was freakin out when I went to the restroom I peed and I was just a bloody mess I try to clean my self up but there was blood everywhere my pad was soaking wet I had blood running down my legs I took a shower and went to the hospital they checked to see if I was prego neg blood count was normal so they proceeded to a ultrasound had an enlarged uterus and uterus was slighty tilted to the right other than that everything was normal so the they send me home with disfunctional uteruin bleeding as a dyagnosis?????:(I now have to go to my obgyn and have no insurance I forgot to mention that its been 5 days and bleeding goes away but when I have a bowl movment I start bleeding again and get contraction like cramps I don't know what's wrong some one help me send me an email to ease my mind ***@**** please thank you god bless...",
            "post_id": "5396643",
            "timestamp": "1266728198",
            "user_id": "user_1201869",
            "user_link": "/personal_pages/user/1201869",
            "votes": "0"
        },
        {
            "answer": "well here is my story.. I've been spotting blood everyday for the last month, but when I have a BM it gets much worse.. I've just started getting testing done, so far tons of blood work and an ultrasound is scheduled.. I only feel mild cramping, but it's all the time.. I don't have any Endomertiosis or any other issues like that (that I know of) I have quite a bit of back pain.. I have 3 children and I'm 30 years old, there was never any problems during or after pregnancy with any of them. I haven't had my period since the everyday spotting has started yet (due soon) but the one before this was light except one day of really intense heavy painful bleeding, lots of clots and filled pads by the hour.. Good news is, my doctor is very concerned and is sending me for every test she can think of and won't stop until we have answers.. so I will add an update here if we find anything that might help any of you.",
            "post_id": "5428365",
            "timestamp": "1267538296",
            "user_id": "user_1230785",
            "user_link": "/personal_pages/user/1230785",
            "votes": "0"
        },
        {
            "answer": "wooow...i am not alone...i am a 33 yo female with a history of endometriosis and HPV...i've had this bright red spotting usually after a bowel movement and 3 days before my period!!! What the heck is the problem??? Could be stress and hormones i definitely believe that...definitely not pregnant...i see my gynecologist on March 23rd...any help or comments will be greatly appreciated...thanks for reading this girls! and GOOD LUCK...",
            "post_id": "5437509",
            "timestamp": "1267744874",
            "user_id": "user_1234075",
            "user_link": "/personal_pages/user/1234075",
            "votes": "0"
        },
        {
            "answer": "Hi like most of you I'm experiencing the same problems. I'm 23/f. I first started having bleeding with bowels back when I was 19 or 20. Went to the doc never found anything. So I started the nuva ring as a new contraceptive and had been on it until oct 09. About a year ago I noticed some spotting after intercourse but didn't really think it was a concern. I figured that my nuva ring may have just rubbed wrong and caused a little blood. Now within the last 3 mo since I took the ring out I have had more bleeding. Now I am either bleeding during intercourse or right after, and sometimes it will not come for a few hours after. Either way I bleed and its visible on toilet paper and my undergarment. I have been checked Pap's are clear, no std's, ultrasound, and colposcopy and biopsy. They didn't find anything. I was then referred to a OBGYN and he said its just some spotting on my cervix similar to cervicitis(causes abnormal bleeding). The only ways to get rid of this spot is by freezing or laser removal. My OBGYN explained he doesn't believe in that because if for some reason I ever had more issues the procedure would remove the spot they had been \"concerned\" with. I agree with him on that part, but I don't agree with him when he told me to just put the BC back in and see what happens. I am willing to try for a period of time, but with how much blood i've had with intercourse its very scary. One reason is because I've never had children and also because my Aunt(mother's sister) had vaginal cancer at 25. Within the last few days I have had bowel movements with bleeding from the vaginal area. I too have the chronic fatigue and back pains. The last symptom is I notice when I am pushing for the BM it hurts in my ovary area.I am planning on getting a second opinion, but am very scared. I'm glad im not alone in this.",
            "post_id": "5438532",
            "timestamp": "1267769458",
            "user_id": "user_1234417",
            "user_link": "/personal_pages/user/1234417",
            "votes": "0"
        },
        {
            "answer": "I am so releaved to have found this forum.  I have been having a problem with vaginal bleeding after bowel movements on and off for several months now.  My doctor is an oncologist gynocologist.  I've had all the tests, a D&C, laproscopic endoscopy, two polyps removed, and still have the problem.  Recommendation is for a radical hysterectomy (everything removed).  The syptoms stopped so I have put it off, but recently they started again.  I am in my 60s so it makes some sense to have it done and not worry, yet I've heard that even past menopause, this isn't always the answer.  Has anyone in my age bracket, or post menopausal taken this step?  And has it eliminated the problem totally? Thanks, in advance.",
            "post_id": "5490929",
            "timestamp": "1269186420",
            "user_id": "user_1253180",
            "user_link": "/personal_pages/user/1253180",
            "votes": "0"
        },
        {
            "answer": "Like most of the other women on here I am amazed at the number with undiagnosed symptoms. I am 42. When I was about 27 I started bleeding irregular and ran the course with the obgyn. Was put on birth control pills to correct it.  Took soooo many different kinds until they got me one with very low estrogen. Then I started having migraines. Went off birth control about 13 years ago.Hubby and I tried and tried finally had a child in 2002. I have not had any migraines for about 3-4 years. Now when I strain I bleed vaginally. Went to doc last week for internal ultrasound. Have a uterine polyp and 2 very small cysts on on ovary. I also get sharp pains in my abdomen. Would the pain be from the cysts or the polyp? Doc said cysts very very tiny. This time I had very bad back pain also. Go to specialist in April for treatment options. Anyone else have any hormonal history earlier before these problems happened? I am so relieved to have found this forum!!!!",
            "post_id": "5516108",
            "timestamp": "1269833661",
            "user_id": "user_1261893",
            "user_link": "/personal_pages/user/1261893",
            "votes": "0"
        },
        {
            "answer": "I too have been experiencing this for about a year now.  Irregular vaginal bleeding for many years and now in the last yr vaginal bleeding after bm's (not always) but a good share of the month.  I have to make an appt to discuss this newly aquired irritation w/my Gyno (family doc).  My best guess is that all of us have been or were on the pill for quite some time.  I had my cervix froze back in my mid-20s.  I think these 2 things plus having 2 children & 1 miscarriage probably do cause damage to blood vessels, etc on the cervix.  Last time I went for my pap/yrly checkup I too was told I have a very sensitive cervix.  My guess is that past history (cryro), long time on the pill & child bearing & now hormonal changes are the culprit.  All my past pap tests have come back normal, my intravaginal test showed a couple cyst which since have disappeared on their own (probably water filled), etc.  The one thing that does irritate me is how the doctor seems unwilling to test my hormone levels -- I see another poster said the same thing about her doctor.  This time I am insisting @ age 46 1/2 that she do as I ask or I will find a doctor who will.",
            "post_id": "5555599",
            "timestamp": "1270863799",
            "user_id": "user_1275032",
            "user_link": "/personal_pages/user/1275032",
            "votes": "0"
        },
        {
            "answer": "Like all of you, I am relieved that I am not the only one suffering from post BM bleeding.I am 51, have been menopausal for 2.5yrs, I have had 3 children, and never been on the oral contraceptive. This has started completely out of the blue, and like someone else, I am waiting to start HRT, but thought I should see my doc before doing so.I imagine, that not much will come of investigations, but I would be relieved if I can be told it's not cancerous in any way. In the past 6 mths I have had some very very light post-menopausal bleeding, and my doc said that unless it was heavy and continuous, or clots - it wasn't anything to worry about. The only thing is that I never did have heavy periods - even approaching the menopause. I just feel worried by it, because it doesn't feel 'normal' - I will let you know what, if anything, comes of my visit to the docs.Suziec",
            "post_id": "5563335",
            "timestamp": "1271088764",
            "user_id": "user_1277625",
            "user_link": "/personal_pages/user/1277625",
            "votes": "0"
        },
        {
            "answer": "I have the same problems, bleeding with BM and sex. I had hysterectomy Jan2005, Everything was fine and wonderful until Jun- July of 2009. I started bleeding sometimes during and after sex, not everytime. I went to Dr she gave me homone cream, it didn't help. I went back and got different hormone cream it still didn't work. Then Jan. 2010 started bleeding with BM and spotting at different times even when not doing anything. By the way I haven't had sex since Jan because of this. So when I went to the Dr before she told me it couldn't be vaginal bleeding because I didn't have a uterus to bleed from. BUT when she examined me she could see blood in my vagina! I don't know what to do now, I just wanted to warn the ones who were advised to have a hysterectomy that it is not a gaurentee for stopping the bleeding.",
            "post_id": "5566765",
            "timestamp": "1271168158",
            "user_id": "user_1278764",
            "user_link": "/personal_pages/user/1278764",
            "votes": "0"
        },
        {
            "answer": "Thank God I found this forum!  I have had weird periods since I quit breastfeeding my daughter who is getting ready to turn 5.  My dr. keeps changing my bc pills and all it does is change my mood, kill my sex drive and cost different amounts at the pharmacy.  I have never had a positive pap smear, std or any other problem.  I have fairly light periods that are never a set amount of days apart.  Sometimes it is as little as 24 days sometimes 29.  I always have spotting between them and have started spotting after bm.  It is definately vaginal.  My dr.'s best suggestion has been endometrial ablation (burning off the lining of your uterus) but one of us has to be sterile to go through with the procedure.  No one can give me an answer or even a good explanation.  I also have a tilted uterus and have been on birth control for 14 years.  I am going to try the douche with vinegar like someone else suggested because I am open to anything that could make me \"normal\" again.  I am overjoyed to see I am not alone when I have felt that way for several years now.  God bless everyone of you and I hope there is a cure in our futures.",
            "post_id": "5613278",
            "timestamp": "1272258753",
            "user_id": "user_1292748",
            "user_link": "/personal_pages/user/1292748",
            "votes": "0"
        },
        {
            "answer": "I am having the exact same problem - bleeding during/after sex (more often without a bm that day), have had this four about 6 years. I also get bleeding before BM.I have had bleeding during all four pregnancies too. The bleeding was practically throughout pregnancy. No cause was ever found for any of this. The GP & gyno are scratching their heads.I get a dull pain sometimes during sex and i just 'know' i am bleeding.Anyone get any answers at all? It affects my sex life which is now basically non- existent because 9/10 times i bleed and am so conscious of bleeding (and checking every two minutes i am not) I can't enjoy sex.",
            "post_id": "5636832",
            "timestamp": "1272824660",
            "user_id": "user_1300237",
            "user_link": "/personal_pages/user/1300237",
            "votes": "0"
        },
        {
            "answer": "I have always been regular, had extremely painful periods as a girl trted with bc and eventually I outgrew., had 4 miscarriages a d+c then 4 healthy kids. With the secnd c sect I read the or report, the ob had burned off several fibroids before sewing my uterus up. My last pap was 2 yrs ago and the doc had abhell of a time getting to the cervex. I had papiloma virus 2+ yrs ago and an abdominal us neg 2 yrs ago (I was having painful ovulation) My husband was out of town a month and since he came back in feb, we haven't gone hardly 2 days without sex (3 mos) and the period that came when he got back was like 3 weeks late and hasn't stopped. Now its heavier and heavier....lasted about 7 weeks, I am under enourmous stress at work, spouse out of work just went back, my father died Jan 7th then my mom sis and bro turned against my husband and were super ****** to my kids.  I am afraid to go to the dr.",
            "post_id": "5644111",
            "timestamp": "1272990174",
            "user_id": "user_1302885",
            "user_link": "/personal_pages/user/1302885",
            "votes": "0"
        },
        {
            "answer": "I am 23 and have been experiencing this problem since the age 14.....I wish I had an answer to my problem :-(",
            "post_id": "5722553",
            "timestamp": "1274850951",
            "user_id": "user_1325925",
            "user_link": "/personal_pages/user/1325925",
            "votes": "0"
        },
        {
            "answer": "Well I said I would update and here is mine.. My doctor had me have an ultrasound and discovered that I have a tear in the lining of my uterus.. so that is what's causing my bleeding.. every time I have a BM or have sex it's worse because it tears it open more..Hope that helps at least a few people..",
            "post_id": "5740439",
            "timestamp": "1275320572",
            "user_id": "user_1230785",
            "user_link": "/personal_pages/user/1230785",
            "votes": "0"
        },
        {
            "answer": "for the last 4 days or so I have noticed vaginal bleeding only after a bowel movement, never experianced this before, I'm 25 and it's worried the hell out of me, it started after I was straining on the toilet, and lots of stretchy cervical mucus came out and it was blood tinged, then as the next couple of days past, it was just red blood I was noticing on tissue paper after BM, I dont need to wear a pad or anything, as it's not flowing out. but there's alot of it when I wipe myself.",
            "post_id": "5788293",
            "timestamp": "1276432337",
            "user_id": "user_1345497",
            "user_link": "/personal_pages/user/1345497",
            "votes": "0"
        },
        {
            "answer": "Does anyone here get a TON of blood during a b.m. (coming from the vagina?) Sometimes I get some bright red spotting on the tissues and other times it completely fills the toilet and this is so scary. Been through the works of tests and no answers. This has been happening a week before my period and also a week after. So with my 9 day period its like I am always bleeding.This will also happen during my period too. My flow will be very light and then when I have a b.m. it will completely fill up the toilet.",
            "post_id": "5791808",
            "timestamp": "1276516304",
            "user_id": "user_1222376",
            "user_link": "/personal_pages/user/1222376",
            "votes": "0"
        },
        {
            "answer": "Over the last year I've been going through tests regarding this problem.  I've had biopsies, sonograms, blood work, colonoscopy, etc.  Everything is always fine.  Recently I went to a hormonal doctor (out of pocket).  Turns out my progesterone is very very low.  And my estrogen to progesterone is also very very low.  I will begin taking bio identical progesterone this week. I'm hopeful that it will begin getting my body back to normal.  i'll let you all know.",
            "post_id": "5824149",
            "timestamp": "1277219689",
            "user_id": "user_954525",
            "user_link": "/personal_pages/user/954525",
            "votes": "0"
        },
        {
            "answer": "So glad to have found this forum, i was embarrassed when i kept bleeding during sex my bf didn't understand and i couldn't give and explanation. I also bleed during BM. I bleed a week or to before my actual period this all started january of this year, I don't see anyone my age having these problems cause i'm 19 soon to be 20. I was afraid to find out what it was cause i thought it might be cancer but now i think i have the courage to go the doctor because of this forum. Wish there was a straight answer for this 'thing' i hate i want it to go away!!",
            "post_id": "5843163",
            "timestamp": "1277627403",
            "user_id": "user_1361319",
            "user_link": "/personal_pages/user/1361319",
            "votes": "0"
        },
        {
            "answer": "i am also 19 and the same thing is happening to me. i have been to the docs cos i have been bleeding for 3 weeks now and really scared!i was taking the combined pill for 3 yrs and it was fine up until last year where i would bleed mid month, after sex and BM .the doctor thinks i may have a cervical polyp but she couldnt see one, i told my mam and she said after she came off the pill she had a cervical erosion. this is where the cervix is more sensitive and because of the oestrogen and can bleed easily, ie after sex, during sex and after BM. they are passed on in families too.also a polyp would do the same yet their more popular in people in their 20s and older with children.i am scared because their is a family history of cervical cancer and both membersof my family found it in their early 20s.i reccomend you all go to the doctors",
            "post_id": "5872426",
            "timestamp": "1278323047",
            "user_id": "user_1363597",
            "user_link": "/personal_pages/user/1363597",
            "votes": "0"
        },
        {
            "answer": "How is it that with so many women having such similar problems trained doctor's don't have answers.  I too suffer from vaginal bleeding after a bowel movement within a week or two of my period.  Also just before a bowel movement I have such terrible cramping it feels like I'm passing a cinder block and my ovaries feel like they're going to explode!  I have a tilted uterus and turned cervix.  I was told by my gyno that the ovaries and colon share nerve endings and that's why I have pain in my ovaries during a bm.  I have had a colonoscopy with no problems but now I'm having problems trying to have a baby (two miscarriages).  I do find comfort in knowing that so many women are going through the same thing but I'm so frustrated that with all the Dr's out there we don't have answers.  I started to see a fertility Dr. that has done significant blood work (everything coming back normal even hormones)  I do have follicles all over my ovaries and a fibroid in the lining of my uterus.  Don't know if any of this is the cause of the bleeding but I doubt I will receive any answers.  I believe that the problem we share is probably a result of our environment and what it's doing to our bodies. e.g. fibroids, cysts, cancer.  We are a product of our environment for sure.",
            "post_id": "5965518",
            "timestamp": "1280356279",
            "user_id": "user_1395920",
            "user_link": "/personal_pages/user/1395920",
            "votes": "0"
        },
        {
            "answer": "so glad to have found this site, thought i was the only one with these symptoms, i have been bleeding after sex, then started to bleed when i have been to the loo and now bleeding after passing a stool, its gradually getting worse, and i have a heavy feeling really low, gonna go to docs again 2morrow, last time she said i had an inflamed cervix, which was causing slight bleeding when having a smear, hope to get more answers",
            "post_id": "6003538",
            "timestamp": "1281257459",
            "user_id": "user_1406746",
            "user_link": "/personal_pages/user/1406746",
            "votes": "0"
        },
        {
            "answer": "I just happened upon this forum while googling my symptoms as well.  I've been experiencing the vaginal bleeding after BMs and after intercourse as well.  I am a 39 year old woman who until earlier this year, never had such symptoms.  I sometimes feel other such \"period\" symptoms, although at times I wonder if that is just psycho-somatic.  I am not on birth control, nor have I ever been, and the last time I had my pelvic exam the doctor told me that the lining of my uterus is \"fragile\".While all of this is a bit disconcerting, I'm glad to see that I am not alone with such symptoms.  Perhaps it's time for another doctor's check up.I hope everyone here finds out what is happening to their bodies.",
            "post_id": "6016042",
            "timestamp": "1281545010",
            "user_id": "user_1410349",
            "user_link": "/personal_pages/user/1410349",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing the same thing for years.  I am 25.  I've also always bled during sexual activity but all smears and swabs were clear.  My doctor was a bit confused and said it was probably because the two areas are close together and so have a poo, could cause vaginal bleeding.  Someone mentioned IBS... Maybe this is another side effect of that?  It's so common in women!  Someone somewhere must know!",
            "post_id": "6024808",
            "timestamp": "1281738259",
            "user_id": "user_1412683",
            "user_link": "/personal_pages/user/1412683",
            "votes": "0"
        },
        {
            "answer": "I can't beleive there's so many people with the same problem...Mine is a bit different, In March I decided to go off the 2 mnths injection, after only having it for 8 mnths ( 4 injections)  The reasons is that I bleed all the time since November, I had a period lasting 28 days, 28 days of heavy bleeding and when it stopped eventualy my husband and I jumped right back into having sex, only to find out about an hour afterwards that my period was back. Ever since then I would bleed for about 5 to 7 days with a 2 day break inbetween. What I also relized about a month ago is that I get an infection, or irritation, itching and burning sensation for about 2 days before I start bleeding.  And then there's the heavy bleeding during BM, I can feel the blood dripping from my Vagina and if I clean it, it will still be there the next time I go to the loo, except if I havent had a BM for a long time. ( yesterday I had 8 during the day) I will also start bleeding during sex and after.  I have spoken to my GP about this, and he only had an answer for the infection, say its because of my Diabetes and urenating alot, (about 30 times a day) We have sceduled a PAP about 3 times now, but I won't stop bleeding long enough for him to do it.  So we will just have to wait and see.",
            "post_id": "6110234",
            "timestamp": "1283770202",
            "user_id": "user_1437085",
            "user_link": "/personal_pages/user/1437085",
            "votes": "0"
        },
        {
            "answer": "Hi all-I have had bleeding before my periods, after intercourse and also occasionally after bowel movements for ~3 years. All tests came back normal and my doctors haven't been able to figure out what's going on.This year, I moved and went to a new doctor for my annual exam. He said that I have cervical ectropion (google it to find more info), which he could see during the colp. exam that he did. It's apparently a harmless condition that is associated with being on the pill-- I'm not on the pill but was for 10 years. It occurs when endometiral cells are present on the cervix, and he said it just happens sometimes. He said he can remove the cells (by freezing) if it's very bothersome, but would prefer to do nothing.I can't even begin to say what a relief it is to find out what's wrong. For years I've been worried everytime some bleeding occurs. I hope this helps someone else!!",
            "post_id": "6147481",
            "timestamp": "1284644830",
            "user_id": "user_1447746",
            "user_link": "/personal_pages/user/1447746",
            "votes": "0"
        },
        {
            "answer": "an addition to my previous post about being diagnosed with cervical ectropion:prior to this, I'd also been told I had a fragile cervix, chronic cervicitis, and a possible infection. i think these are things doctors say when they don't really know what's going on.",
            "post_id": "6147497",
            "timestamp": "1284645137",
            "user_id": "user_1447746",
            "user_link": "/personal_pages/user/1447746",
            "votes": "0"
        },
        {
            "answer": "To all of those with this problem, I to had this exact same problem, bleeding after intercourse, after bowel movement, and sometimes for no known reason,  this happened for months after my daughter was born and none of the doctors I seen, seemed to understand what was going on, all the tests came back normal, and I was getting really frusterated and scared.  I went and seen a new doctor because we were wanting to try for a second baby, and with all of the bleeding I did not know when I was ovulating.  This doctor put me on clomid for 4 months, and that brought my periods back to normal, and even after I stopped, and it has been months now, I am still back to my perfectly normal cycle, with none of the bleeding between periods.  I was never told why I was having the symptoms, but with what solved the problem, personally I believe my hormones were out of whack after giving birth,  Good luck everyone.",
            "post_id": "6157714",
            "timestamp": "1284872170",
            "user_id": "user_1450242",
            "user_link": "/personal_pages/user/1450242",
            "votes": "0"
        },
        {
            "answer": "I too have been experiencing vaginal bleeding upon straining during a BM for some time.  I have spoken to my GYN several times without success.  After reading many of these posts, I see many commonalities...HPV that required intervention including a colposcopy, cone biopsy, Leep procedure, etc.  My conclusion...each of these procedures has made our cervix weak or sensitive and therefore, when we strain to have a bowel movement or intercourse, our cervix bleeds.I am so thankful to have found this.  Although I did not find a diagnosis, I feel better knowing that I am not the only one with this problem.  Thanks ladies!",
            "post_id": "6627333",
            "timestamp": "1297176558",
            "user_id": "user_1593014",
            "user_link": "/personal_pages/user/1593014",
            "votes": "0"
        },
        {
            "answer": "I am just wondering if their is anybody out there who had these symptoms but was able to get pregnant regardless?  Been trying for 4-1/2 years.  Gone thru all the tests with no help.  Drs. want us to do hormonal injections to get pregnant, but we are not ready for that step.  Just looking for some hope.  Trying to keep our faith in God's plan.",
            "post_id": "6689606",
            "timestamp": "1298859308",
            "user_id": "user_1619596",
            "user_link": "/personal_pages/user/1619596",
            "votes": "0"
        },
        {
            "answer": "This is exactly the same thing happening to me! It scares me. I have vaginal bleeding with bm's and after sex, lower back pain, endometriosis. All tests come back negative, a picture of health. It's so frustrating and scary. Since everything comes back negative, the Dr keeps thinking that I am confessed and that thr blood might be rectal in nature, but i KNOW that it isn't. I'm just at a lessor what to do. I'm afraid if I let it go o., it could progress to something worse.",
            "post_id": "6893760",
            "timestamp": "1304985915",
            "user_id": "user_1681947",
            "user_link": "/personal_pages/user/1681947",
            "votes": "0"
        },
        {
            "answer": "Also, what color/ consistency? I see people saying bright red, but mine is dark brown and very thick, mucous-like. Is that \"normal\" for this problem?",
            "post_id": "6893796",
            "timestamp": "1304987045",
            "user_id": "user_1681947",
            "user_link": "/personal_pages/user/1681947",
            "votes": "0"
        },
        {
            "answer": "I have this same problem. Bleeding dark brown or bright red 4 days before and after my period. Its so annoying being done with your period only to have your painful painful feels like labor BM bring it back. I have a 3 week cycle it seems. I had this problem with bleeding after sex 2 years ago and actually went in to the dr on the last day of my period and there was a large cyst on my cervix my dr could touch and it would bleed. This was removed and the bleeding stopped for a year and a half. Its back. I had another small polyp removed in May. It helped a little with the hormone symptoms but not the bleeding. Its so frustraiting!!",
            "post_id": "7058313",
            "timestamp": "1310420414",
            "user_id": "user_1734512",
            "user_link": "/personal_pages/user/1734512",
            "votes": "0"
        },
        {
            "answer": "I've just started to have the same problem this week. I've been in and out of the doctors for 3 - 4 years now with intense period pain and pain on intercourse. Various things have been blamed and ruled out. I've had an ultrasound, kidney funtion, liver function and thyroid function tests. I had a laparoscopy about 4 weeks ago which found nothing abnormal. I had to have an ECG afterwards as my heart rate was high when i was coming around from the aneasthetic. I had sex again for the first time in months 4 days ago and have pretty much had some kind of vaginal bleeding and cramps since then. It started as red and then became a thick brown. It stops but then starts again for the rest of the day as soon as I have a BM.I'm on Cerazette at the moment as this was supposed to control the endometriosis they thought I had. This does mean that I haven't had a periodin about 3 months. I'm going back for a Gyne appointment in 2 weeks but I'm getting really stressed out with everything. I'm losing hair, constantly tired and still get cramps now and again and I don't know if its down the stress, the tablets or its a new sympton!",
            "post_id": "7060933",
            "timestamp": "1310500313",
            "user_id": "user_1735650",
            "user_link": "/personal_pages/user/1735650",
            "votes": "0"
        },
        {
            "answer": "I just read alll of your posts and too am having exact symptoms. I am 29/yo and have three kids with one pregnancy ending at 5 months followed by a D&C. I have been experiencing extra bleeding for about 6 months now, and have realized that it mostly occurs after intercourse or a bm. In the last 40 days I have bled for 29 of them :( I am early in all of this and have seen a doc for it only a couple times only to be told to use the nuva ring, i havent tried it yet, and went to the ER last night due to the severe pain on my left side near my ovaries and cramping all the way across, also with bad low back pain. I go to see the doc later today. I hope she will actually listen this time and take this seriously. Thank you all for sharing your stories and I hope to find an answer before going through all the unconclusive tests you guys have recieved. Ill let everyone know what they say...",
            "post_id": "7061233",
            "timestamp": "1310507336",
            "user_id": "user_1735743",
            "user_link": "/personal_pages/user/1735743",
            "votes": "0"
        },
        {
            "answer": "I am currently 10 weeks pregnant and started having bleeding with every BM just 3 weeks ago.  2 weeks ago I was given an ultrasound and everything appeared to be fine.  They are now regulating my hormone levels to make sure I'm not miscarrying.  I've never had this problem before (before pregnancy) but I have a feeling it's not pregnancy related.  I think it's just a coincidence that it's starting now.  I had no problems conceiving (first month of trying) and I have a 2 yr old already.  But I did have a miscarriage at 5 months last November and had to have a D&E (like a D&C) to remove the baby.  I too had HPV about 12 years ago, but was given a biopsy at that time and everything appeared to be fine.  Every pap since then has been negative for everything.Yesterday my cervix was swabbed for infection, and just the light swabbing hurt as I was so sensitive.  I'm interested to know whether it is an infection, and whether or not this pregnancy will continue.  I am still bleeding after every BM.  Bright red, dripping into the toilet.  I'm very nervous about this and wonder what effect it will have on baby.I will keep you posted on how things progress.",
            "post_id": "7101668",
            "timestamp": "1311789388",
            "user_id": "user_1749451",
            "user_link": "/personal_pages/user/1749451",
            "votes": "0"
        },
        {
            "answer": "Like all of you here, I am sharing the same symptoms, medical tests/experiences, and lack of information... and can echo how nice it was to find so many women talking about it!  By the same token, I can also echo your frustration!!!!  In an effort to sound an alarm, I wrote this letter to the two main OB/GYN societies in the U.S...  I just thought to share it with you (I hope you all don't mind that I included a link to this forum!) I don't expect an answer, but if I hear one I will certainly post again!\"To Whom It May Concern atThe American Congress of Obstetrics and Gynecologistsand The American Gynecological and Obstetrical Society,Thank you so much for taking the time to read this letter and for providing any assistance or information you may have to offer!  I will be as brief as I can be.In seeking answers to my own persistent symptoms of unusual vaginal bleeding over the last few years (with three different doctors) and finding no explanations, I turned, as many women do, to online sources for OB/GYN information.  In doing so, I discovered hundreds of women - of all ages and stages, with or without children - talking about exactly the same symptoms of a particular kind of vaginal bleeding and how they have all been \"living with it\" without accurate diagnoses for years.  I know that the internet is not necessarily a reliable source; however, I was mainly struck by how many of us describe the exact same experience - and the exact same frustration at finding no clear answers or solutions from our doctors. They seem to be STUMPED!  (Here is one example of such a discussion:http://www.medhelp.org/posts/Womens-Health/Vaginal-bleeding-after-during-sex-and-with-a-bowel-movement/show/31554)  So I am reaching out to you, as leaders in the OB/GYN profession, to seek guidance and some insight into the medical discussion of this topic.  I'm sure for every woman who has shared their symptoms with their doctors or online, there are many others who have not.Most commonly, this vaginal bleeding occurs at the same time in our cycles - after ovulation, during the luteal phase (beginning a few days up to 2 weeks prior to menstration and continuing until menstrual bleeding) - and can be seen during bowel movements or after/during sex.  The bleeding is most certainly vaginal, either bright bright red and dripping into the toilet or old and brown when we wipe.  For most of us, we have regular menstration and this is distinct from that.  Some have experienced pain along with this bleeding, but not all.  In addition to these shared symptoms, we all have one other important thing in common; our doctors have tried out many possibilities and found \"NOTHING WRONG.\"  Almost all of us have been to multiple GP's and OB/GYN's (in addition to GE's) and have had a whole range diagnostic procedures, thankfully ruling out cervical and uterine cancers, polyps, fibroid tumors, endomedriosis (some have it; most do not), vagicitis, and everything else under the sun.  Some of us have been told we might have things like \"disorganized endometrium\", \"friable cervix\", \"Tilted Uterus\", \"Hemorrhagic Cysts\" -  with procedures suggested that are more frightening than the original symptoms. Often these procedures - including hysterectomy - fail to stop the bleeding.  ALL of us have been on Oral Contraceptives (pill, nuvaring, IUD, etc.) and the onset of these symptoms begin to occur while taking them or after we stop.  Some women have even being prescribed them to help with these symptoms, with no result.  A few women seem to have had some success monitoring their hormone levels and increasing their body's natural production of progesterone (through natural creams, synthetic depositories, herbal medicines, and acupuncture) - learning from some wisdom in fertility treatments.  But many others have said that their doctors have refused to test their hormone levels. (For instance, my doctor did everything she could think of and then told me it was probably \"hormonal\" and, basically, to live with it (though my uterus is a little tilted.)  Others had doctors who were flat out dismissive, never heard of anything like it, or thought they were inventing it.))  Some have begun to try food allergies and to change their diets.  Results of all of this pending.Obviously, such cyclical and frequent vaginal bleeding interferes with our daily functioning, sexual and relationship health, and stress levels.  Additionally, we have many fears about - and many different success rates of - healthy conception and delivery.  Most importantly, all the women sharing their stories have also expressed extreme disappointment and frustration in the lack of expertise and knowledge about the topic by medical professionals, even when their symptoms have persisted for many years (in some cases decades).  It is possible that many OB/GYNs have seen these cases more than others, but this expertise does not seem to be widely shared.  I understand that every woman's body is different, that we all have different experiences/biologies/genetics/personal histories, and that there may be many factors.  However, it is surprising that our stories are all the same, and we are still left with so many questions.  Perhaps there is something broader going on - something environmental, dietary, or a shared side effect?  At the very least, if we had the information, we could made more responsible decisions.Can you tell me/us:  Is this topic being raised in discussion between OB/GYN doctors?  Is there any current research on these symptoms and possible causes?  Is anyone sounding any alarms about birth control, environmental toxins, food industry changes, or other hard-to-pinpoint possible causes of unusual vaginal bleeding late in the menstrual cycle?  (Is anyone presenting anything on the topic at your upcoming Conference in Chicago?)  If so, I hope that doctors will begin to share their knowledge and disseminate information more widely, so that the women going through this can feel more understood, listened to, cared for, taken seriously, and brought back to normal reproductive and sexual health - the main goals of your practices.Thank you so much for reading, and I hope to hear from you soon!\"---",
            "post_id": "7103102",
            "timestamp": "1311824905",
            "user_id": "user_1749859",
            "user_link": "/personal_pages/user/1749859",
            "votes": "0"
        },
        {
            "answer": "Thank you amanda_anne. for your detailed post. I truly do hope you find some answers and please post them when you do. I am 30 and just this year has experiance this in the last 6 months.I April  2011 I found out I was pregnant. at about 6 weeks I started spoting with BM, of course any blood when pregnant cause alarms to go off. I went to 2 different emergency rooms, 2 GP'S, and an OBGYN over the next 5 weeks. No one had any answers from anyone. at 13 weeks I went to the Emergency again for spotting and they informed me I was having a miscarriage.  After a long painful ordeal the bleeding had stoped and I though my body was getting back to normal. Had a regular period an have been trying to conceive again.Unfortunatley the bleeding has come back while I have a BM, I am not pregant and this has never happened before this year.If anyone can provide some insight it would be great appriecated.Thanks for reading.",
            "post_id": "7139171",
            "timestamp": "1313004509",
            "user_id": "user_1760077",
            "user_link": "/personal_pages/user/1760077",
            "votes": "0"
        },
        {
            "answer": "thank you for summing it up for us.  Have you received any response?",
            "post_id": "7168894",
            "timestamp": "1313897265",
            "user_id": "user_1769696",
            "user_link": "/personal_pages/user/1769696",
            "votes": "0"
        },
        {
            "answer": "thank you for summing it up for us.  Have you received any response?",
            "post_id": "7168897",
            "timestamp": "1313897338",
            "user_id": "user_1769696",
            "user_link": "/personal_pages/user/1769696",
            "votes": "0"
        },
        {
            "answer": "Very Helpful. THANKS",
            "post_id": "7295387",
            "timestamp": "1317778047",
            "user_id": "user_1828682",
            "user_link": "/personal_pages/user/1828682",
            "votes": "0"
        },
        {
            "answer": "There is another post that I have responded to regarding friable cervix onhttp://www.medhelp.org. It's a lot of people with similar symptoms as described in this post. I too have this condition \"friable cervix\". My OBGYN didn't seem too concerned & didn't recommend treatment. She did say she could do something to the cervix to try to make it less friable but I decided not to bother because every person I've heard of having it done, has had a reccurance of symptoms shortly after the procedure. I have never had HPV (seems common) and I've never had any children. I am currently 32 and this began when I was about 28. I do however have IBD and I wonder if inflammation has something to do with my cervix being friable. I do believe many of my issues are hormonal in nature and possibly have something to do with birth control pills. I have been on hormonal birth control for about 10 years. I recently switched to a non-estrogen pill called cerazette and it has helped a bit. I wouldn't say I am cured, I still have strange bleeding but I only seem to have it around my period - I can deal with that. I think I will see somoene about my hormones. Something is out of whack. I am sure I won't find any answers, if I do, I will report back.I find it very frustrating that so many of us are dealing with bleeding after sex & BM and we can't find any answers.",
            "post_id": "7300215",
            "timestamp": "1317917852",
            "user_id": "user_1644340",
            "user_link": "/personal_pages/user/1644340",
            "votes": "0"
        },
        {
            "answer": "I appreciate your letter to find answers, but I also share these symptoms with no apparent cause and you had said everyone was on birth control pills.  I am almost 49 years old and I have only taken birth control pills for a 3 month period around age 23 to stop irregular bleeding (which unbeknownst to me would cause me to become regular and thus could get pregnant).  I have two grown children, one miscarriage, had cramping and bleeding throughout the 2nd pregnancy, had a tubal 21 years back, and in the last 6 years have experienced severe cramping that only strong pain pills can control and extreme bleeding with periods.  My periods are debilitating and generally will cause at least one seriously embarrassing episode of unstoppable bleeding in public that no matter what protection I use doesn't stop it from getting everywhere.  I also occasionally bleed lightly after sex and more heavily during a BM 3-7 days before my period starts which is how I know it is coming.  I have had cervical displaysia 15 years ago that was frozen and no abnormal paps sinc. I have a retroverted uterus and a cervix that is in a direct 'firing line' position.  I have periods for 10+days that include days of bright red bleeding similar to a nosebleed, and days of regular menstruation with an incredible number and size of clots.  These clots are so large they escape my super heavy duty industrial size pads and end up in the floor at work, at the grocery, at a restaurant, and is humiliating.  I have been tested for everything to no avail.  All I've ever been diagnosed with is an abnormally thickened lining of the uterus.  I don't have fibroids or polyps that were found during D&C, but I do have colon polyps that were removed and a strong family history of colon cancer.  However, the blood is not coming from my colon.  I was negative for Endometriosis.  My doctor had the same reaction to bleeding during a BM as everyone else's.  I have just this week cancelled my hysterectomy because I'm just not ready to get old yet and I fear gaining weight. I'm having a uterine ablation in a few days although I feel pretty sure will not really help whatever this true cause is or help discover what it is, but should stop the ridiculous bleeding.  I have continuous abnominal pain, discomfort, and tenderness and cannot tolerate having it touched by anyone or any clothing.  I am thin, but my lower abdomen is larger than my breasts and it's impossible to find clothes to fit.  I had no idea this many people share my symptoms.  It seems to me that unless you have an obvious well understood disease the doctors don't know what the problem is.  I guess at least I know it might not be normal, but isn't serious.",
            "post_id": "7307428",
            "timestamp": "1318162173",
            "user_id": "user_1833871",
            "user_link": "/personal_pages/user/1833871",
            "votes": "0"
        },
        {
            "answer": "try vinegar douches.  I had the same thing - vaginal bleeding after intercourse and BM a year or so ago.  worried, researched, etc...  tried vinegar douches to naturally cleanse.  I used a much stronger vinegar solution than if you would buy it in the stores premade.  Sometimes almost all vinegar.  I did that for a while (over a few months whenever I worried about it or saw the blood)  Overtime the bleeding stopped and I haven't had it for about a year or so.  Now it has returned once or twice and I am going back to my vinegar douches.  I think Vinegar is a natural safe cleanser and helps more than we know.  It worked for me!  Maybe others could try and post their results...    Some stores douche bottles are easier to refill on your own than others.  Pick up a pack of a couple different brands and see what has the biggest opening to refill.  Good luck!",
            "post_id": "7323180",
            "timestamp": "1318603938",
            "user_id": "user_1062795",
            "user_link": "/personal_pages/user/1062795",
            "votes": "0"
        },
        {
            "answer": "Thank you so very much for your kindness, summing all of our problems and posting to the guys who knows best how to tackle these irregularities. i have the same problem, and really trust that some light will be shed upon all of us somehow. However, we can trust in our maker, God almighty to sail us through till clock menopause, since there are many women in their 70s,80s and 90s, who underwent the same problems and they triumphed through. Guys, keep a healthy lifestyle, relax and be happy to be wonderfully and fearfully created! We shall live and not die, for the blessings of God do not bring along any sorrow..the devil is a liar, our wombs are covered by the blood of Jesus!",
            "post_id": "7325887",
            "timestamp": "1318688399",
            "user_id": "user_1841666",
            "user_link": "/personal_pages/user/1841666",
            "votes": "0"
        },
        {
            "answer": "terrible when you can't talk about your situation, and spouse just wants sex and says your fine stop talking about it. I am  so uncomfortable having sex now, but I am going to try the vinager thing, has that helped anyone else's problem.",
            "post_id": "7357589",
            "timestamp": "1319733474",
            "user_id": "user_1856705",
            "user_link": "/personal_pages/user/1856705",
            "votes": "0"
        },
        {
            "answer": "Hey Ladies,Thank you so much for all your comments! It does make you feel more normal since there are so many people with the same symptoms. I am struggling to conceive and wondering whether it is linked. I am in my mid 20's. It would be interesting to note whether everyone has been on the contraceptive pill at one time or another before these symptoms commenced?Take care all :)",
            "post_id": "7370987",
            "timestamp": "1320218211",
            "user_id": "user_1869951",
            "user_link": "/personal_pages/user/1869951",
            "votes": "0"
        },
        {
            "answer": "bless us i also have bleeding after passing stools, having sex also sets my period off. i have been going to docs for two years now but still no joy of finding out what it can be. i have been going through towels like nobodys business. and has been getting worse since my sterilsation, i have also been told that this could be caused by a prolappsed womb, bladder or rectum.",
            "post_id": "7385907",
            "timestamp": "1320668830",
            "user_id": "user_1880925",
            "user_link": "/personal_pages/user/1880925",
            "votes": "0"
        },
        {
            "answer": "I was on this site a few weeks ago. I had symptoms of bright blood mid cycle that was expelled while urinating, defecating or simply pushing hard. I was convinced I had cervical cancer!!   I made appointment with an obgyn and during my pap exam she noticed that I had an old tampon that had been pushed inside of me!  She believed this was the cause of the bleeding!  I must have inadvertently thought I didn't have a tampon in and pushed it inside string and all with a second tampon!  Get examed asap if you are having bleeding mid cycle.... if this is your cause, you are at risk for toxic shock!",
            "post_id": "7489035",
            "timestamp": "1323621371",
            "user_id": "user_1937167",
            "user_link": "/personal_pages/user/1937167",
            "votes": "1"
        },
        {
            "answer": "Thanks to all of you for sharing your stories, all of your stories really helped me.I am 30 years old and I have been bleeding for a year now. I usually bleed between 10 and 7 days before my period, when I have a bowel movement or I push down, and when I have sex. It's usually fresh blood.I have had a history of non successful use of birth control pills, and by non successful I mean that every 3-8 month I would have to change it because I would have bloody discharge in the middle of the month. The last birth control I used was the ring, which worked for 6-8 months.I mentioned to my former doctor a year ago that I was having bloody discharge and bleeding after intercourse, she said it was not normal but  that \"maybe he was too big for me\".... I am not sure how my husband and sexual couple for 4 years can suddenly grow and hurt me that much :S.Around the same time, the ring \"stopped\" working, and at that moment we were thinking of having a family, so I stopped taking any birth control.By September 2011, the bleeding was more often and more quantity, for which I went to the doctor again, and she said that I had \" CERVICAL ECTROPION\" and I had to \"learn how to live with it\".I sought another opinion and my current doctor said it is called with different names, but that I have EVERSION which are cells from the cervix that come out and react to the hormones, that's why I bled mostly in the second part of the cycle. He also mentioned, he would never put me in the ring. He has also mentioned that I probably developed like this, and he does not know why this started beeing such a problem now....Currently, I have had two sessions of silver nitrate treatment in order to \"cauterize\" the cells that are bleeding.  I am also doing some acupuncture, in order to attack the problem on all areas! Hopefully they will work! I will keep you guys posted on the results....As far as conceiving, I haven't been able to, obviously, because the blood is changing the pH of the vagina and probably all the spermatozoides are being killed.... :(I would encourage you all to at least to get a second opinion on your diagnosis or to seek for a diagnosis for those who do not have one! Also seek for a possible treatment. I was worried, but I was to ignorant to question the first doctor.Good luck to you all and I hope the person who wrote to the Doctors received an answer.",
            "post_id": "7639413",
            "timestamp": "1327985278",
            "user_id": "user_2010555",
            "user_link": "/personal_pages/user/2010555",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies,I've experienced occasional vaginal bleeding during intercourse for the past 6-8 months. Results of my exam was normal, so my GYN concluded that it was likely due to vaginal tearing. Two days ago, I noticed bright red vaginal bleeding during bowel movement and it happened again today. Although my stool was very hard, it is still very concerning. I noticed a commonality in that many of us with this problem were diagnosed with HPV at some point. I was diagnosed about 15 years ago, received treatment, and have had normal PAPs since.My GYN referred a ultrasound to rule out fibroids.........hope to get answers.",
            "post_id": "7656542",
            "timestamp": "1328481007",
            "user_id": "user_2018722",
            "user_link": "/personal_pages/user/2018722",
            "votes": "0"
        },
        {
            "answer": "This post is almost 4 years old.  But I would like to thank you for this.  I am going to talk to my doctor about this procedure.  I have had tests and blank looks from my docture for over 3 years.  Until I found this forum, I really felt like I was the only person on earth with these symptoms.  Thank you everyone for sharing there experiences!",
            "post_id": "7666522",
            "timestamp": "1328760656",
            "user_id": "user_2023542",
            "user_link": "/personal_pages/user/2023542",
            "votes": "0"
        },
        {
            "answer": "I have been having this issue and found this site while googling my symptoms. I have spotting between periods which is darker blood, but the scary thing for me is that when I have a BM there is bright red blood in the water. I thought for a while that maybe it was a back passage problem, but it became obvious it was vaginal bleeding. I even checked using a tampon. I also get a dull ache in my lower abdomen and lower back. My medical history is one pregnancy and birth, and a history of cervical polyps which made pap tests difficult to the point that I stopped having them. I would just bleed like crazy as soon as the nurse touched me and they couldn't get a clear result. I have been single and sex-free for five years so i don't know if sex would result in bleeding though I assume it would. I'm 37. I've been getting this bleeding for 4 or 5 months. I've never taken any birth control, always used condoms. I have a low thyroid and take levothyroxine for that. It's also worth mentioning that I am currently overweight, that could be an issue. I'm about to embark on a high protein low carb diet. I'm also going to bite the bullet and seek medical advice! Good luck everyone!",
            "post_id": "7698641",
            "timestamp": "1329707743",
            "user_id": "user_2038017",
            "user_link": "/personal_pages/user/2038017",
            "votes": "0"
        },
        {
            "answer": "I also have these issues and the doctors can't find out why.  Here's my stats.  Age 32, been having them for about 8 months, TTC for about the same amount of time too.  I also get an achy, dull pain in the lower right pelvic area on and off throughout the month, sometimes it hurts worse than others.  Ever since we started trying to conceive, I have been getting none stop bacterial vaginosis infections.  Been to the doctor multiple times: pap is normal, ultra sound didn't show anything, pelvic exam nothing unusual.  I fear I might have Endometriosis because ever since going off BC pills (which I was on for about 10 years) 3 years ago I would get extremely painful cramps on the first day of my period.  But those went away when I started doing acupuncture.  I also get the painful deep penetration with sex.  I do have HPV and have had 2 LEEP procedures, but this has been 6 years ago and everything has been normal since.  Anytime I go to the dr for a pap test and they scrape my cervix I bleed a little.  I also have stomach issues, never really been diagnosed with anything, but had a polyp removed a couple years ago.  I would love to know if anyone has had success getting pregnant or found any answers for this.  Thanks!",
            "post_id": "7702882",
            "timestamp": "1329834775",
            "user_id": "user_2040085",
            "user_link": "/personal_pages/user/2040085",
            "votes": "0"
        },
        {
            "answer": "What worries me is that there's so many ladies experiencing this and a few different outcomes.I'm 23, have been on the pill for the last 5 years or so. I've recently had an STD check up and everything has come back negative. My periods are regular but I always seem to get spotting a couple of times a month after a strained bowel movement. I have IBS and often take Imodium to relieve symptoms, creating the adverse effect.The spotting is usually light brown or light pink, and sometimes is a once off, other times can be on and off for a couple of days.I've also noticed I've been getting stinging pains in my lower back, but I've no idea if it's connected.I am concerned that I keep spotting, I am worried mainly about my reproductive health and feel like I want answers sooner rather than later incase any problems can be resolved, but at the same time I'm scared of having invasive tests and potentially making my symptoms worse.I'd be interersted to see if Amanda Anne got a reply to the email she sent to the \"American Gynecological and Obstetrical Society\" as it seems like there is no knowledge on this subject. My doctor actually said to me stunned WHAT? When you have a BOWEL movement? As if she'd never heard it before. A little unnerving to say the least!I'd also be curious to see how many people have been on birth control or are currently, doctors have said to me it could just be effects of the pill but I find this hard to believe.ALSO! finally.there are a LOT of pregnant women online that write this as one of their symtoms, and it is considered fairly normal to spot during pregnancy within the first trimester apparently? This makes me wonder how pregnancy could cause this and why we would be suffering it too?",
            "post_id": "7725791",
            "timestamp": "1330470001",
            "user_id": "user_1649449",
            "user_link": "/personal_pages/user/1649449",
            "votes": "0"
        },
        {
            "answer": "Thank goodness I found this forum, to know I am not alone.  I have been having the same issues as all of you - vaginal bleeding after a bowel movement, particularly if it is a firm one.  I noticed it the first time about 6 - 8 months ago, but unlike many of you, it seemed to happen for me right around my period (a few days before and a few days after, when I was already having a bit of spotting).  I didn't think much of it, and assumed that it was just extra period blood being pushed through.However, I am now 13 weeks pregnant, and I am still having the vaginal bleeding after a bowel movement.  Clearly I am not having my period, and there is a small amount of red blood immediately after the BM.  It does not linger, and does not transfer to my panties.  I did have some other bleeding/spotting during my first trimester, but it has all stopped, except for when I have a BM.  I have another doctor's appointment scheduled for 3 weeks from now, and I will raise it with GP then.  However, based on the experience everyone here has had with their doctors, I am not too hopeful for an explanation!  If I receive one, I will post.",
            "post_id": "7829266",
            "timestamp": "1333487914",
            "user_id": "user_2100745",
            "user_link": "/personal_pages/user/2100745",
            "votes": "0"
        },
        {
            "answer": "ok i am 41 3 kids and the EXACT same thing started happening to me about 5 monthes ago my tubes are tied and have been for 21 years. my periods are always a week ahead of scheadule so say i start my period on the first in january and bleed for 5 days then i start it again the 24th jan then again 19th feb and so on but i know im going to start because when i have a bowel movement i bleed EXACTLY 2day before my period please keep me informed im scared and do not have health insurance so the more i know the better i feel i could not afford to be seen by a obgyn i did make an appointment with clinic but its not for another 7 weeks before i can be seen i thank you for your post",
            "post_id": "7860462",
            "timestamp": "1334395012",
            "user_id": "user_2113608",
            "user_link": "/personal_pages/user/2113608",
            "votes": "0"
        },
        {
            "answer": "This has been very enlightening!! I thought for certain I must be crazy. Turns out, not at all!I am 35, no kids, normal Paps, no STD's, doc told me years ago I most likely have Endometriosis, never had surgery for it and instead tried BCP as hormone therapy. I've always been very susceptible to yeast and bacterial infections, during which my Cervix becomes very sensitive and bleeds easily.About 7 months ago I got Mirena (IUD). Since the Mirena, I have had vaginal bleeding with bowel movements and sometimes with sex. At first I attributed it to my body adjusting to the Mirena but after several months of spotting, I knew something wasn't right. I called my OBGYN's office only to have the nurse laugh at me and mock me. Nice lady, huh?Now after reading so many comments left by so many ladies, I think my issue is the Mirena is being pushed on (by my bowels or during sex) and my Cervix or Uterus is expelling some blood. I have some pretty bad cramps along with it, which makes sense to me if my Cervix is irritated at all. Perhaps my Cervix pools a lot of blood, like some of the other ladies mentioned.This has been helpful! I hope none of you settle for just accepting it as part of being a woman. You shouldn't have to live in discomfort!!",
            "post_id": "7919344",
            "timestamp": "1336015481",
            "user_id": "user_2137823",
            "user_link": "/personal_pages/user/2137823",
            "votes": "0"
        },
        {
            "answer": "Oh sweety,I am sooooo on your page, this has been happening to me for yeeeeears now and I am also soo over it, I just at this point would love to have a hysterectamy and get it over with. I had a horrible procedure done by a gyno which was very painful, I have actually put off finding out the result, but I guess i should go, its just good toknow there are so many others who are going throught the same thing, although I a very sorry we are ALL going through it. It is so horrible and yes, it sooo puts you off having intercourse and really does not make you feel very attractive or desirable with all the painful bits that go along with it all.",
            "post_id": "7950279",
            "timestamp": "1336967327",
            "user_id": "user_2162953",
            "user_link": "/personal_pages/user/2162953",
            "votes": "0"
        },
        {
            "answer": "I\"m soooo glad i have found you guys!!! I'm 42 and have all this too! Bleeding with intercourse and with a BM. I\"ve had it for years and gone to a doctor years ago said my cervix was sensitive. Went to another doctor same thing so i gave up! My daughter is 4 years old now but all through my pregnancy I bled so bad I thought it was a miscarriage but the hospital would send me home with that saying unexplained bleeding! But anyway here I am still bleeding with BM's and intercourse. I also have 2 other children 21 years old and 11 years old. It's good to know I'm not lone. Sooo glad I found this.",
            "post_id": "7967339",
            "timestamp": "1337434396",
            "user_id": "user_2174451",
            "user_link": "/personal_pages/user/2174451",
            "votes": "0"
        },
        {
            "answer": "After 6 yrs of bleeding and no one knowing much, they found a fibroid the size of a softball in the muscle wall of my uterus.  Instead of having a hysterectomy I have a Uterine Artery Embolization.  I'm 4 weeks post surgery now and things have greatly improved.  I also had another fibroid, but smaller.  They found them doing a vaginal ultrasound, followed by a MRI with dye.  Surgery was at U of MN - they were very good !",
            "post_id": "8070900",
            "timestamp": "1340309366",
            "user_id": "user_1062795",
            "user_link": "/personal_pages/user/1062795",
            "votes": "0"
        },
        {
            "answer": "I am the 34 yr old mother of 3.  I have been having these symptoms for 2yrs now.  I am going to the doctor in Aug.  I have had no irregular Paps, no Endo, but was told that I had a dark shaded area in my uterus that was biopsied and neg.  I was also told that I have Ovarian cysts.I was deployed to iraq in 2010, and have had these symptoms since.   I hope that they find a cause.  I am concerned that maybe these cysts have grown, or that I may be following in my mothers footstep with uterin cancer.  Please continue to update this blog with findings.  It may help the rest of us when talking to our OB's.",
            "post_id": "8152300",
            "timestamp": "1342629995",
            "user_id": "user_3134587",
            "user_link": "/personal_pages/user/3134587",
            "votes": "0"
        },
        {
            "answer": "I have been experiencing abnormal bleeding and I have had every test done to figure out the cause. Unexplainable as all results have come back normal. That should be a relief but it’s not because I want to know why and fix it. I wish I would have found this site before I started on my quest for answers. This site has given me some relief because I have found some helpful information and I’m not alone. With that said I also find it terrifying that so many women have the same symptoms and no one seems to know the cause. I thought I would post the sites that I have looked at in hopes that they may help you with your quest for answers.Friable Uterine-http://www.allhealthlinks.com/friable-cervix.htmlAdenomyosis-http://women.webmd.com/adenomyosis-symptoms-causes-treatmentsCervical Ectropion-http://voices.yahoo.com/cervical-ectropion-common-cause-bleeding-after-7144566.htmlCervical Disorders-http://www.johnshopkinshealthalerts.com/symptoms_remedies/cervical_disorders/2259-1.htmlOther terms used-Disorganized endometrium-Sensitive cervix",
            "post_id": "8163569",
            "timestamp": "1342950470",
            "user_id": "user_3142283",
            "user_link": "/personal_pages/user/3142283",
            "votes": "0"
        },
        {
            "answer": "Hey I am having a similar problem, what came out of ur visit to  ur physician?",
            "post_id": "8254679",
            "timestamp": "1345488759",
            "user_id": "user_3204401",
            "user_link": "/personal_pages/user/3204401",
            "votes": "0"
        },
        {
            "answer": "I happened upon your comment, as I have been suffering from the same symptoms as all of us have been, and saw what you had done.  I know this was 4 years ago, and was curious if things stayed \"fixed\" for you?  I had a D&C 6 months ago, and things had been fine up until this past week, now it's back to the way things were.  I would love to know how things are for you since that procedure.  Thank you!",
            "post_id": "8295602",
            "timestamp": "1346655684",
            "user_id": "user_3238507",
            "user_link": "/personal_pages/user/3238507",
            "votes": "0"
        },
        {
            "answer": "I have had the same thing happening to me for years!  I bleed after a bowel movement  - bright bright red and it continues for days and can have clots.  I had a hysterectomy two years ago.  This was happening before and now after.  Everything but my cervix was taken.  I also get cramp like pains in my lower left side - reminds me of my horrible cramps I used to get with my periods.  I have had pap smears and all \"normal\". I have had ultrasounds vaginal and abdominal \"normal\".  I am 41 have had two children with no other problems.  I was so excited to never have a period again and this just ruins it for me.",
            "post_id": "8360181",
            "timestamp": "1348542171",
            "user_id": "user_3905310",
            "user_link": "/personal_pages/user/3905310",
            "votes": "0"
        },
        {
            "answer": "I too am so happy to have found this forum, I got an irregular pap smear, had a cone biopsy four months ago and then two months ago my periods would start with a week of having brown blood discharge, and another week of really heavy periods. I had another pap smear and bled right after it(this never used to happen), and bleed after sex. And to make matters worse, I now have red blood from my vagina when I have a bowel movement. I am at the doctors and gynecologists, and worry all the time. Now at least I don't feel as stressed because I know others have the same problems. My gynecologist wants to insert an IUD to see if my periods will settle down, and if this doesn't work is talking about a hysterectomy. I like all of you don't feel happy when the tests come back all clear and fine, because the symptoms don't go away. I want to be healthy and in shape but find that all I do is stress about this and feel alot of frustration, It would be lovely if some doctor somewhere could find a solution to this problem.",
            "post_id": "8375426",
            "timestamp": "1348969578",
            "user_id": "user_3995654",
            "user_link": "/personal_pages/user/3995654",
            "votes": "0"
        },
        {
            "answer": "I have bright red blood from my vagina every time I strain on a bowel movement ( I am sure it is not from the rectum). There is alot there for about three wipes then no more bleeding until I have another bowl movement.  This has happend all month long no matter what time in my cycle. I have been trying to get pregnant and was on clomid last month and it left a cyst behind. I went to my fertility doctor since this bleeding and she did an ultrasound and said my lining looked good at it was probably just hormones from the cyst? Does this sound right? I had a pap done 6 months ago that had some inflammation in the cells but came back negative for hpv. Could this bleeding be a sign of cervical cancer? I also have endometriosis could this cause it? I also have low progesterone after I ovulate which is impacting why I havent gotten pregnant. Does that seem a pattern to anyone experiencing this? It doesnt help that I was recently diagnosed with thyroid cancer so I am very sensitive to any problems right now!",
            "post_id": "8643626",
            "timestamp": "1356060667",
            "user_id": "user_4366680",
            "user_link": "/personal_pages/user/4366680",
            "votes": "0"
        },
        {
            "answer": "I am curious to know if we all have something in common like, we've all had a c-section or we've all had our tubes tied.  Have we all had a miscarriage followed by a DNC?  I have several sisters and they all had this problem but we all have shared the above procedures in common in some form or another.  In particular the DNC after miscarriage.  One sister said that the doctor told her her problem was 'inhesional tumors' that's scarring of the internal incision on the inside of the body.  Sometimes it will fuse to other internal parts in the body like the scar from a c-section fuses to part of the intestines during the healing process.  I am just wondering if there is really a common thread for us all.",
            "post_id": "8944968",
            "timestamp": "1363725199",
            "user_id": "user_5108874",
            "user_link": "/personal_pages/user/5108874",
            "votes": "0"
        },
        {
            "answer": "Hi Guys,I am having the same problem. I am 26, never had kids and not on any medication. I bleed from my vagina during and after a bowel movement, it's usually dark red and clotted. Got ultrasound, hysteroscopy, pap and all the blood test done, happy that everything came back normal but it still doesn't stop. Just a thought, I have had ulcerative colitis and IBS, the doctors are confused which one actually....could it be because of that??? Does any of you have any IBS sort of problem?",
            "post_id": "9172317",
            "timestamp": "1370426032",
            "user_id": "user_5587620",
            "user_link": "/personal_pages/user/5587620",
            "votes": "0"
        },
        {
            "answer": "Can any doctor help us here? I have the same problem too. bleed after BM. I have a polyps according to my doctor. Does that the reason for the bleed?",
            "post_id": "9191008",
            "timestamp": "1371001385",
            "user_id": "user_5616751",
            "user_link": "/personal_pages/user/5616751",
            "votes": "0"
        },
        {
            "answer": "Me also... The DR said no cancer in pap or uterus scrap... been having blood from vaginal when pooping also.. I am wondering... how many of you have had at one point Merina iud.ssss??  I didn't have this problem till after that point.. that's my thoughts..",
            "post_id": "9261323",
            "timestamp": "1373031750",
            "user_id": "user_5719861",
            "user_link": "/personal_pages/user/5719861",
            "votes": "0"
        },
        {
            "answer": "it sounds like pid pelvic inflammatory disease which if left untreated can cause you not to be able to have children this is the same for gonorrhea and Chlamydia ask to b checked for PID!",
            "post_id": "9353957",
            "timestamp": "1375545818",
            "user_id": "user_5857124",
            "user_link": "/personal_pages/user/5857124",
            "votes": "0"
        },
        {
            "answer": "hi really happy i've found this thread. i've had light bleeding for 34 days now. it started 5 days before my 'period' was due - which didn't come and ive realised the pattern now, when I have a BM in the morning I have a light bleed, maybe a little dark blood in the afternoon. I was due my 'period' again yesterday - which hasn't come. been to the doc's who have tested for pregnancy through bloods - negative, tested for STI's - negative. I will be making an appt tomorrow for more answers. I am 24, had my first child 2010, been off the birth control pill 10 months and got back to a normal 28 day cycle before all this started happening. it is early stages of this problem I know, but its not in anyway normal for me. I hope the doc will investigate further - fingers crossed.",
            "post_id": "9398590",
            "timestamp": "1376813187",
            "user_id": "user_5925680",
            "user_link": "/personal_pages/user/5925680",
            "votes": "0"
        },
        {
            "answer": "Just an update...... I have had a telephone appointment with a new doctor, She has sent a referral for an ultrasound and i'm going in to see her next Tuesday for more blood tests and an examination. I will keep updating, as this may help someone one day, ive spent hours and hours trying to find someone who has missed periods, negative home pregnancy test and bloods, and bleeding vaginally only with bowel movements.",
            "post_id": "9415296",
            "timestamp": "1377279155",
            "user_id": "user_5925680",
            "user_link": "/personal_pages/user/5925680",
            "votes": "0"
        },
        {
            "answer": "51 days of vaginal bleeding after a BM ..... no \"periods\" during this time. Tests have come back clear for thyroid, hormonal, bacterial problems and iron is fine too. i have an ultrasound appt October 2nd. refused a smear as i am only 24 8months old! Have to be 25 for nhs to do it! So inquired for private which a nurse will call me back with info. costs £125..... Alot but worth every penny where my life is concerned.",
            "post_id": "9452090",
            "timestamp": "1378306297",
            "user_id": "user_5925680",
            "user_link": "/personal_pages/user/5925680",
            "votes": "0"
        },
        {
            "answer": "Hi all, I'm joining in as I too have a similar story. I was on the cerazzette pill for 10 yrs. In Nov 2012 I reduced the dose to one every other day.. By January 2013 I started lightly spotting so I began to take the pill everyday again.  However the bleeding didn't stop.  In Jan 2013  I also started to suffer with lower back pain which I thought I'd hurt at the gym.Back ache continued and got worse.  In march doctor put me on Zapain and Naprosyn for pain relief.  This caused severe constipation.  The bleeding continued and became more regular. Practically every day, especially more after a bowel movement.  In May this Year I had the symptoms of a UTI, but all tests came back negative, I was given Trimethoprim for 3 days, within a day the symptoms came back and I was given a 7 day course of treatment.  This went on for 7 weeks. I was in agony, my bladder hurt so bad, the urge to pee was constant everyday, making it difficult to go anywhere without toilets near by.. A simple 2 mile drive to work, left me in tears, because with the urge came bladder pain.  On top of all that the bleeding got heavier, it did eventually stop for a few days , but after a hard bowel movement it started bleeding again.   I have been through hell since January, my back is still agony, I'm having physio at hospital but it's doing nothing.  I cry myself to sleep.After seeing an Urologist, I was put on a 2 week course of Trimethoprim which finished last week and now I'm on a 6 month course to kill the infection in my bladder. (Even though no infection is showing).  Very confusing..  Now I need to solve my bleeding, it's everyday, sometimes very lightly, sometimes it stops. When I pass a hard stool, or even strain to go, on wipe the tissue is covered in blood and clots. it's scary as he'll.   toilet bowl is bright red.. I'm going back to docs to have some more swabs taken and a pelvic exam. Fingers crossed ill get an answer but I'm not holding much hope. X",
            "post_id": "9516069",
            "timestamp": "1380216244",
            "user_id": "user_6309090",
            "user_link": "/personal_pages/user/6309090",
            "votes": "0"
        },
        {
            "answer": "i dont know if you'll read this scene its been years sense you've posted thank you for the knowledge of cervical ectropion it gives me at least something to say to my doctor maybe he'll have a clue were to go from here the bleeding thing is getting old and frankly quite a turn off every time me and my husband get close",
            "post_id": "9524271",
            "timestamp": "1380465162",
            "user_id": "user_6339376",
            "user_link": "/personal_pages/user/6339376",
            "votes": "0"
        },
        {
            "answer": "I must say, reading this has both calmed me down (knowing that others have my same issue and it's not life threatening) and made me nervous (seeing as many of you haven't been able to get answers...like myself). I've had vaginal bleeding during and after sex, and also when straining during BMs, for upwards of 5 years now.  I've seen two doctors and they have no clue what's going on with me.  My PAPs and ultrasounds are normal.  During my exam, when the doc touched my cervix it would bleed.  I too have been told I have a sensitive cervix.  At my last visit (April 2013) I tested positive for Ureaplasma. My doc said they recently starting testing for this with PAPs and it's actually very common.  I guess it's something that occurs naturally within a man and is sexually transmitted.  Both myself and my husband were treated with an antibiotic and we are now clear of it. So, I'm wondering if Ureaplasma has come up with anyone else?  I know this post is old, but the information is still relevant.",
            "post_id": "10244433",
            "timestamp": "1397613517",
            "user_id": "user_8313538",
            "user_link": "/personal_pages/user/8313538",
            "votes": "0"
        },
        {
            "answer": "Hi I am a 38 year old female, never had children about 8 months ago i started getting dark vaginal bleeding with stringy clots. My periods were always regular and the bleeding in between is a daily occurance, however i have noticed the blood is heavier and bright red when i have a bout of constipation or pass a hard BM. I have been to four different doctors, referred to two different gynos, one said endemeterious, then said it was not that, the other said ovarian cysts on either ovary however they are to small to remove, I am booked in for a further blood test this week as the last CA125 blood test was unusually high. I have now noticed my periods have stopped on the normal due date started to come 2 weeks later that happened last month and again i have passed the original date this month so expecting it this week about 18th will wait and see.I also had one doctor say it could be the start of menopause. I am trying natural remedies which has stopped the blood during the day but its there when i wake up and have first bowel movement and now stools have been soft for 3 weeks. I take raw natural coconut oil 1 Tea spoon every day and 1 tea spoon of Munukka honey 15+ UMF, I have cut out sugar in tea mostly all junk food, especially fried food from takeaways this seems to help with general health around and the weight just seems to stay off something good out of this depressing situation hope this helps other sufferers",
            "post_id": "10393026",
            "timestamp": "1399995275",
            "user_id": "user_8811960",
            "user_link": "/personal_pages/user/8811960",
            "votes": "0"
        },
        {
            "answer": "Hi.I've also have slight vaginal bleeding after orgasm or a bowel movement.  As though its the 'push down' that causes it.  I had an abnormal smear test result and tested positive for HPV and was cin2.  Had lletz ( laser) treatment and am all fine now.  This bleeding started after my colposcopy and lletz treatment.  I am now clear of HPV and my smear is normal.  It wasn't until I spoke to the nurse and my GP and they said this can be quite common when you are ovulating, if your body has been under stress.I am not medically trained in any way.  So please get checked out before you drive yourself crazy!!  X x x",
            "post_id": "11169723",
            "timestamp": "1411161504",
            "user_id": "user_10574998",
            "user_link": "/personal_pages/user/10574998",
            "votes": "0"
        },
        {
            "answer": "Yes! I had the Novasure procedure done also 2 years ago. Due to bleeding during & after intercourse. Unfortunately the Novasure procedure did not work for me. Now for the last 6 months I have had bleeding after a BM if it's close to my cycle time (within a week of my cycle) I have my yearly done in December. I hope to get answers then. I get concerned since I have had Kidney cancer and Atypical Ductal Hyperplasia with breast. So Anything odd with my body scares the mess out of me \"literally\"!",
            "post_id": "11422338",
            "timestamp": "1414468236",
            "user_id": "user_11001899",
            "user_link": "/personal_pages/user/11001899",
            "votes": "0"
        },
        {
            "answer": "I have had the same problem,I suffer with fibromyalgia and bone pain syndrome,I was told for years that I have iIBS, but after a colonoscopy I was told I hadnt,I have noticed when I need to open my bowels I'm passing blood from my front,but it only happens when I get this severe pain in my lower back,I've had a ablation done so I no longer have periods,and haven't done since it was done.yet I still bleed when opening my bowels once the pain is there,doctors seem baffled",
            "post_id": "12380916",
            "timestamp": "1428747050",
            "user_id": "user_13148669",
            "user_link": "/personal_pages/user/13148669",
            "votes": "0"
        },
        {
            "answer": "I have had the same problem,I suffer with fibromyalgia and bone pain syndrome,I was told for years that I have iIBS, but after a colonoscopy I was told I hadnt,I have noticed when I need to open my bowels I'm passing blood from my front,but it only happens when I get this severe pain in my lower back,I've had a ablation done so I no longer have periods,and haven't done since it was done.yet I still bleed when opening my bowels once the pain is there,doctors seem baffled",
            "post_id": "12380921",
            "timestamp": "1428747065",
            "user_id": "user_13148669",
            "user_link": "/personal_pages/user/13148669",
            "votes": "0"
        },
        {
            "answer": "I'm 39, have 2 children.  After my 2nd child was born I started taking the birth control pill Cerazette.  Soon after I started suffering nausea, abdominal pain and anxiety so after 3 months I stopped taking it.  The symptoms eased immediately but over the next few months gradually came back.  After about a year of suffering with the symptoms I went to the doctors and had a lot of tests all negative.  He told me I have IBS.  Now nearly 5 years later I have started experiencing vaginal bleeding after a bowel movement.  Happens when bowel movements are hard and difficult to get out, about 5 days before my period is due.  Doctor is not concerned.  He has tested me for bowel and ovarian cancer and ruled those out.  Interesting that a lot of people have mentioned IBS.",
            "post_id": "12513116",
            "timestamp": "1430246249",
            "user_id": "user_13503867",
            "user_link": "/personal_pages/user/13503867",
            "votes": "0"
        },
        {
            "answer": "Check out this thread too...http://www.medhelp.org/posts/Womens-Health/vaginal-bleeding-with-bowel-movement/show/32315I wrote on that thread what is below but after reading this, I feel like I should throw in some more information. I had PID when I was 18, then also had a miscarriage and a D&C. When I was 19 I got a pos HPV at my pap. They did a cone biopsy on my cervix and LEEP surgery and I never had another pos test. I had my first child at 22 and my second at 31. I also have IBS and am overweight.I am a married 37yo with a 15yo and a 6yo. This same thing started with me a little over a year ago. About a week or so before my period, when I have a BM I bleed. Sometimes it's a lot, sometimes it's a little, but I always have dull ache cramps to go with it. I also have a tilted uterus. I was on birth control when it started, the SAME birth control I had been on since my son was born, but my obgyn said it was just breakthrough bleeding. I stopped the birth control in August of last year and it is still happening. I have read that sometimes antidepressants can cause it, but the two that I am on (Celexa and Wellbutrin) are on the 'least likely to cause those side effects' list. My grandmother, aunt, and mother all had to have hysterectomies in their late 30's and early 40's so I hope that it is nothing too bad.",
            "post_id": "13332748",
            "timestamp": "1444079841",
            "user_id": "user_15935017",
            "user_link": "/personal_pages/user/15935017",
            "votes": "0"
        }
    ],
    "post_id": "122058",
    "question": "I have Endomertiosos and another condition called Adenomyosis. I have been plagued by the symptoms from those problems for years now. But recently I have a new symptom and I am worried. A few months ago I started bleeding vaginaly during a bowel movement which still happends often...it also happends during and after intercourse. I have been tested for STD's and everything was all negative I have even had an ultrasound done and nothing. I am waiting to get a pap done. Anyways I am sooo frusterated and have been reading alot about cervical cancer so now I am scared that I might be having symptoms of cervical cancer. But I am also thinking it may just be the endometriosis or that other thing. I did have Human Papiloma Virus years ago...no problems for about 9 years now. Can anyone give me any insight???? I have also been extremely fatigued and have alot of lower back pain. I just don't know what to do and the doctors are not taking me serious. Please help!!!!!",
    "timestamp": "1153630800",
    "title": "Vaginal bleeding after/during sex and with a bowel movement",
    "user_id": "user_149275",
    "user_link": "/personal_pages/user/149275"
}