{
    "answers": [
        {
            "answer": "After two c-sections I heard it has to be a c-section for the third. I had the same thing, breech and then tried v-bac only to end up with a second c-section anyway because they were afraid the uterus was tearing. It turns out the baby had troubles and it wasn't my uterus. I was told by my doc that it is dangerous to do labor after to c-sections. To much of a risk of rupture.",
            "post_id": "1171588",
            "timestamp": "1151902800",
            "user_id": "user_124387",
            "user_link": "/personal_pages/user/124387",
            "votes": "0"
        },
        {
            "answer": "VBACs can be very dangerous :(, sorry to tell you that. Your uterus can rupture, and if it does they need to perform a hysterectomy, in addition to other life saving measures (you would be bleeding out if you ruptured). I am a maternity nurse and when we hear about a rupture after a VBAC attempt we all pray for the family. I think the previous post was correct, after two C-sections I don't think a doctor would do a VBAC. But look at the bright side...you will be so much safer having another section, and your other little ones need you around :). Good luck with whatever you decided! :)",
            "post_id": "1171589",
            "timestamp": "1151902800",
            "user_id": "user_138529",
            "user_link": "/personal_pages/user/138529",
            "votes": "0"
        },
        {
            "answer": ":(.. Now am not sure if I should have another child. I loved my natural birth, and the thought of another c-section is awful. I hate surgery.",
            "post_id": "1171592",
            "timestamp": "1151902800",
            "user_id": "user_145557",
            "user_link": "/personal_pages/user/145557",
            "votes": "0"
        },
        {
            "answer": "momof3rugratz don't give up on another child :(. What is it you hate about the surgery? I know I can't stand the thought of scalpels touching me (and I am a nurse and see them all the time..go figure), so for any surgery I make the anesthesia doc knock me out completely. Was your pain control okay after surgery? Was the recovery too hard? Maybe a doc can work with you on those specific issues so having another child isn't out of reach for you!",
            "post_id": "1171596",
            "timestamp": "1151902800",
            "user_id": "user_138529",
            "user_link": "/personal_pages/user/138529",
            "votes": "0"
        },
        {
            "answer": "Really the only bad thing about my c-section was I did not see my baby right away and I hated the recovery process. :( I had pain but it was all ok. I just wanted a natural birth less time in the hospital no catheter. When I had the last 2 c-sections I did it knocked out. I did not want a needle in my back I was so scared for that.",
            "post_id": "1171605",
            "timestamp": "1151902800",
            "user_id": "user_145557",
            "user_link": "/personal_pages/user/145557",
            "votes": "0"
        },
        {
            "answer": "I am not sure if it is correct but someone did tell me that since it has been 6 yrs since my last csection or pregnancy that it was a lower risk and the fact it is a low incision single stitches and then I was stapled. Do you think this is true. I am doing a lot of reading and I also read that the risk it 1% for a repeat c-section compared to the 2.7% risk for just having a c-section that was because of other complication's. I had no complications just 1 was breech and I did not want to try to turn the baby.",
            "post_id": "1171608",
            "timestamp": "1151902800",
            "user_id": "user_145557",
            "user_link": "/personal_pages/user/145557",
            "votes": "0"
        },
        {
            "answer": "I just went through this same decision process myself.  I am 30 weeks pregnant with my 3rd child - the first two were c-sections (first was emergency, second was scheduled on doc's recommendation).  With this one I really wanted a natural birth.  I did A LOT of research, including printing and reading the practice guidlines for obstetricians in the US and Canada, and reading many of the research articles which formed the basis of those recommendations.  Basically, there is one worrisome study which compared rupture rates after 1 c-section versus after 2.  It was a small, but carefully controlled study.  They concluded the risk of rupture after two cesareans is 3-5%.  That's up to 1 in 20.  There is a lot of research going on to develop a way to assess an individual woman's risk.  One group is doing a thickness measurement of a particular segment of the uterine wall at 36 weeks, and claim they can assess the risk of rupture very well.  Unfortunately this is still experimental and I couldn't find a perinatologist who would do the measurement... so I ended up deciding to go with a cesarean.  I could never live with myself if something happened - up to 5% chance of rupture, and if it happens, 15% infant mortality.  The risks are just too high.  The goal is a healthy baby, and I have to accept that I won't get the natural birth that I've always wanted.  I wish you luck and hope you make a decision that you, your husband, and your ob or midwife are comfortable with.  Whatever you decide, I wish you the very best.  I've been there, and I know how hard a decision this can be.  *HUGS*",
            "post_id": "1171591",
            "timestamp": "1151902800",
            "user_id": "user_137019",
            "user_link": "/personal_pages/user/137019",
            "votes": "0"
        },
        {
            "answer": "As yucky as they are, they are over quickly.  Recovery DOES take a while, and isn't easy.  But just think about the beautiful baby that will grow into a beautiful child and then a beautiful adult... you get a lifetime in exchange for a few months of discomfort.  I've just decided to be positive about it - as much as I hate c-sections, I still can't wait.  We've got a birth plan, and have made all the same kinds of preparations that we would have if this was to be a natural birth.  My two little ones will wait at the hospital with their grandparents, and my husband will come in with me.  We're trying to make the best possible experience.   Good luck with whatever you decide!",
            "post_id": "1171598",
            "timestamp": "1151902800",
            "user_id": "user_137019",
            "user_link": "/personal_pages/user/137019",
            "votes": "0"
        },
        {
            "answer": "I did it, but I had a anesthesiologist and my ob there the whole time throughout labor. That was several years ago. I have been told that many insurance companies will not allow it now because the dangers are high for complications and they don't want to take the risk.I know it is hard to face yet another c section but the risks of a vbac that have been mentioned ( uterine rupture, yikes!)do exist so the safest route is a csection. That is not to say you can't find someone willing to do it, just that with each csection your risk for complications increases for a vbac because of the previous csections.",
            "post_id": "1171602",
            "timestamp": "1151902800",
            "user_id": "user_97026",
            "user_link": "/personal_pages/user/97026",
            "votes": "0"
        },
        {
            "answer": "If you have had two c-sections and the best medical advice is that it would be dangerous not to deliver that way again rather than vbac, and your main objection to another c-section is because you want to see the baby right away but you'd be knocked out, this can be handled by having an epidural instead.  But you have ruled this out because you don't want a needle in the back, and so this is leading you to say you are not sure you want a baby?  Just because of a needle in the back?  I would understand not wanting a fourth child for any number of reasons:  more work, more worry, isssues with the rest of the family, financial strain, emotional energy.  But if the ONLY reason you are saying you might not want another child is because you want to see the baby when it is born and don't want an epidural that would allow you to be awake, that seems like you are letting a bunch of your own decisions limit you too much in your options.  You might re-think your objection to epidurals, or else your objection to being knocked out.  Good luck!",
            "post_id": "1171642",
            "timestamp": "1151902800",
            "user_id": "user_134578",
            "user_link": "/personal_pages/user/134578",
            "votes": "0"
        },
        {
            "answer": "Ive had one c section and thot the needle in the back was nothing it was just like getting a normal injection to me but I guess everyone is different. I'm 19 weeks pregnant now and I was wanting a vaginal birth but looking at comments of ruptures I might elect a c section as it sounds a whole lot safer. One more c section wont hurt you they recommend you only have 3 as the risks get higher its all worth it in the end a gorgeous wee baby dont let a c section put you off having another baby good luck.",
            "post_id": "1171648",
            "timestamp": "1151902800",
            "user_id": "user_127553",
            "user_link": "/personal_pages/user/127553",
            "votes": "0"
        },
        {
            "answer": "I had a spinal with the first c-section, an epidural with the #2, and I couldn't feel either one of them going in. The spinal gave me better coverage throught the surgery, I felt alittle more pressure with the epidural and then they gave me morphine which took that away. (I did itch after the surgery from the morpine though). Overall the only pain was getting out of bed the next day, and soreness for a week.You can request they put the catheter in after the spinal or epidural, then the only pain will be when they take it out which isn't as bad. Good Luck!!!",
            "post_id": "1171651",
            "timestamp": "1151902800",
            "user_id": "user_124387",
            "user_link": "/personal_pages/user/124387",
            "votes": "0"
        },
        {
            "answer": "There is no reason why you cannot attempt to try for a VBAC. If your Dr. is uneasy about this attempt then find one that is not. They will monitor you closely and if there is any signs the baby or you are not doing well then the subject can the brought up. Remember to always bring your B.R.A.I.N.S. to labor and appts. Asks these questions when any kind of intervention is suggested. What are the Benefits, Risks, Alterative (including waiting), what do your Instincts say, does this have to be decided Now, and is it Safe. I would also like to recommend a Doula. Research has shown that having a doula reduces the need for pain meds, c-sections and augmentation of labor among many other benefits. Be encouraged!",
            "post_id": "1171680",
            "timestamp": "1151902800",
            "user_id": "user_145544",
            "user_link": "/personal_pages/user/145544",
            "votes": "0"
        },
        {
            "answer": "I had a c-section almost 21 yrs ago, so you cant really go by how long ago it's been since you had one, ie: 6yrs.  My obgyn told me that no dr would risk the possible rupture of the uterus by performing the vbac, he is adamant about delivering via c-section one week prior to my due date.  Remember, not only could it be harmful to you and your baby, but it could also prevent you from ever carrying a child again, should you want one.  I stronly urge you to elect for the c-section, it is the safest way for both of you.  Good luck!",
            "post_id": "1171762",
            "timestamp": "1151989200",
            "user_id": "user_143181",
            "user_link": "/personal_pages/user/143181",
            "votes": "0"
        },
        {
            "answer": "Well I think I am going to have baby #4 and my 3rd c-section. WIth all the excitment going on the last week. I missed 3 pills I took 1 when I noticed I was spoting. I looked at my pills to see why my period was here and well I missed them. SO now I just threw them all out and will let nature take course. Thank you everyone.",
            "post_id": "1172206",
            "timestamp": "1152162000",
            "user_id": "user_145557",
            "user_link": "/personal_pages/user/145557",
            "votes": "0"
        },
        {
            "answer": "I am pregnant with my fourth child.  I told the dr. that I absolutly didn't want another c-section.  They told me they can't force me to have surgury, but it was their job to make sure that I fully understand the risks.  The reason for my first was my daughter was 16 weeks early.  The second was because I wasn't dialating past 2.  I am allergic to a lot of things (medication that they give you, the staples,  and much more).  It is easier for me to go through with the VBAC instead of 3 to 4 months recovery.",
            "post_id": "1887473",
            "timestamp": "1189793771",
            "user_id": "user_276668",
            "user_link": "/personal_pages/user/276668",
            "votes": "0"
        },
        {
            "answer": "im pregnant with my third baby and my other two boys were c-section also one emergancy and the other one i wanted. and yes you have to have a c-section, my doc said something bout the incesion and that it wouldnt be very safe for a vaginal",
            "post_id": "1887796",
            "timestamp": "1189798036",
            "user_id": "user_276691",
            "user_link": "/personal_pages/user/276691",
            "votes": "0"
        },
        {
            "answer": "I had 2 sections and a 3rd baby would be a section.  A V-back can lead to too much bleeding, rupture the uterus....  Most Dr.'s would not risk a malpractice suit and schedule  you for anothe section.",
            "post_id": "1888836",
            "timestamp": "1189818461",
            "user_id": "user_275325",
            "user_link": "/personal_pages/user/275325",
            "votes": "0"
        },
        {
            "answer": "I am pregnant with my 3rd child.  I had to undergo Fertility treatments for this child due to blocked tubes which the Dr. says was caused by previous c-sections.  My recovery for my first child was quick.  I had to have a c-section with her because her heart rate was dropping.  My next child, the Dr. thought she was going to be too large and decided it would be best to have a c-section.  (She was less than 7lbs.) The recovery from the second c-section was much more difficult.  My children are 7 years apart.  I was told the recovery was more difficult because of the scar tissue.  My next child will be 6 1/2 years apart from my 2nd child. I am frightened at the thought of another difficult recovery because of more scar tissue. I very much would prefer a vbac and was also told of the possibilities of rupture so they advised against it.  Did anyone else have difficulties with scar tissue?",
            "post_id": "1908043",
            "timestamp": "1190382927",
            "user_id": "user_281860",
            "user_link": "/personal_pages/user/281860",
            "votes": "0"
        },
        {
            "answer": "i have the same problem have had 2 c sections the first in 2005 and the second in 2006 and am 30 weeks pregnant  but don't want another c section as all my kids will be under 2 but my doctor has said she will give me a chance by inducing me so i would be monitored from start to finish i was induced with my other 2 sons but it failed but i only had the tablet this time they are giving me the drip they are starting me of 14 November but if i haven't delivered within 24 hours i will have to have a c section which in my eyes is a fair compromise so will be able to let you know how it goes",
            "post_id": "1913997",
            "timestamp": "1190571087",
            "user_id": "user_283321",
            "user_link": "/personal_pages/user/283321",
            "votes": "0"
        },
        {
            "answer": "I just had my 2nd child by c-section and dont plan on having another for a couple of years but I also plan on having a v-bac the next time so, if you could please let me know how your procedure went I would greatly apreciate it. Thanks, Kristie",
            "post_id": "2054535",
            "timestamp": "1193979060",
            "user_id": "user_320949",
            "user_link": "/personal_pages/user/320949",
            "votes": "0"
        },
        {
            "answer": "I have had to casarean sections, both due to my severe pre-eclampsia. My first was born 4 weeks premature and my second born 8 weeks premature. With my severe pre-eclampsia, the doctors had to end my pregnancies early on as i was told i had a risk of dying. The doctors also told me that i shouldnt have anymore babies as the pre-eclampsia gets worse everytime. I had to stay in hospital for nearly two months to be constantly monitored.I long for having a vaginal birth but im scared. I cant help but think that i am less of a woman/mother for having a c-section. It took me time to bond with my children because of the trauma i went through. I aly awake at night and wonder how it feels to have a vaginal birth.I want to have atleast one more baby but i am horrified thats i could put my life in danger. Im going to wait a few years to even think about having another baby as my second child was born in July 2007.Do you think i should have another baby and would it be silly for me to think that i have a chance of a vaginal delivery after 2 traumatic casareans????England, London",
            "post_id": "2055852",
            "timestamp": "1194018888",
            "user_id": "user_321273",
            "user_link": "/personal_pages/user/321273",
            "votes": "0"
        },
        {
            "answer": "I just had my second baby by c-section my first was because she wouldnt come out and the second was by choice( a stupid choice at that) please let me know how your V-back went I would love to have a baby naturally it would be a wonderful experience.",
            "post_id": "2503515",
            "timestamp": "1202878065",
            "user_id": "user_418319",
            "user_link": "/personal_pages/user/418319",
            "votes": "0"
        },
        {
            "answer": "Hi everyone,really loved reading your comments. I have 4 children and have had 1 natural delivery, 1 emergency c section and 2 planned sections under medical insistance.  I really enjoy my family,  however stressful it can be,  as we all know. However I desperately long for just one more child and would like to hear if this would be frowned upon by the medical profession or classed as a risk that is my own to take, as I would need another c section.",
            "post_id": "3029669",
            "timestamp": "1213286235",
            "user_id": "user_534235",
            "user_link": "/personal_pages/user/534235",
            "votes": "0"
        },
        {
            "answer": "what a predicament. i had my first pregnancy in 2005 and at 39 weeks docs discovered i had preeclampsia, however my daughter died as a result of this, i had a normal vaginal birth, my second daughter was born at 29weeks due to my placenta abrupting and my third pregnancy went without a hitch but selected a csection at 38 weeks as i was terrified my baby would die at 39weeks. i have however found out i am expecting again and my heart is telling me to have a vaginal birth. is this possible?? x",
            "post_id": "6558882",
            "timestamp": "1295387509",
            "user_id": "user_1567192",
            "user_link": "/personal_pages/user/1567192",
            "votes": "0"
        },
        {
            "answer": "c-section is MAJOR ABDOMINAL SURGERY...and has too many complications and risks that the doctors tend to always forget to tell you about,  REad the facts..and compare and contrast vbac vs another c-section...do research.  it is not ALWAYS safer like they claim,..you  can have a vbac after TWo c-sections...",
            "post_id": "6745279",
            "timestamp": "1300419779",
            "user_id": "user_1638391",
            "user_link": "/personal_pages/user/1638391",
            "votes": "0"
        },
        {
            "answer": "HiI also have had 2 C.Sections and the percentages they throw around about the chances of uterine rupture is scaremongering. The real chances are 0.3% for normal women and 0.5% after 2 C.Sections. There's a lot of info, even online so don't let anyone dictate about your body or how many and how you have children!  Read for yourself and decide!",
            "post_id": "6822033",
            "timestamp": "1302722286",
            "user_id": "user_1661919",
            "user_link": "/personal_pages/user/1661919",
            "votes": "0"
        }
    ],
    "post_id": "1062376",
    "question": "Ok I have 3 boys. My first son I delivery was vaginal, My next son was breech and was a c-section, My 3rd son was fine but the doctor at the time would not let me do a vbac he said he did not preform them. Well I would like another child and am struggling because I would like a natural birth. I am hoping I can get others experiences before I decide what I would do. I am lost and I would really like a natural birth. I did hear it is very dangerous. I just want all the information I can get.",
    "timestamp": "1151902800",
    "title": "Vaginal Birth after 2 c-sections",
    "user_id": "user_145557",
    "user_link": "/personal_pages/user/145557"
}