{
    "answers": [
        {
            "answer": "Hehe! I know exacly how you feel. Each pregnancy the aches and pains get worse.  I have the pain you have discribed plus round ligiment pain that has me doubled over in tears. BH already and the head aches!! I am just glad I have desided to stop after #4 cause I can imagine how much worse this will get . I could go on and on..................Hey but the worst is still left to come:-) Summer time and pregnancy should not be allowed, lol. I am getting hot flashes just thinking about it!",
            "post_id": "4384659",
            "timestamp": "1240443946",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "I am also experiencing round ligament pains, and actually called the dr the other day because my entire uterus was cramped up for like 7 hours straight. He said it was BH, but i thought that a contraction would let up every now and then. It was tightened up continuously... never lessened and only got worse when i climbed stairs. I've never had BH before (or a real contraction for that matter). Is it possible for them to not let up for so long? One long contraction? It faded as soon as I got home and put my feet up.",
            "post_id": "4384791",
            "timestamp": "1240446559",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "the worst for me is my back its just killing me and when my dh is massaging it helping but hurts even worst. additional to that my kidneys hurt at least twice a month, and i got gallstones , but still i love my son and i will try for baby #2 after him",
            "post_id": "4385114",
            "timestamp": "1240451958",
            "user_id": "user_463595",
            "user_link": "/personal_pages/user/463595",
            "votes": "0"
        },
        {
            "answer": "My newest complaint is heartburn.  And I'm on Prilosec already!  This is kid is gonna have lots of hair!Lets see, I hate the fact that I can eat all the junk food I want, but as soon as I put something good for me in my mouth (like normal dinner food), I\"m nauseated!My hips are killing me at night.  I'm sleeping with a body pillow, but my hips hurt so much, they wake me up and cause me to turn over.  The pain starts in my hips and goes down to my upper thigh!I keep getting UTI symptoms during the evening, but as soon as I drink some extra fluids, it goes away.Surprisingly, my back isn't bothering me that bad right now (I probably just jinxed myself).  Considering my back surgery and everything, I figured it would be hurting more than it is.I think that's about it right now.  My constant headaches went away, so I can't complain about them anymore.  And I love that I can feel the little one moving around now to reassure me that he's doing well.  I can't wait until August to meet my little soccer player!",
            "post_id": "4385209",
            "timestamp": "1240453391",
            "user_id": "user_434822",
            "user_link": "/personal_pages/user/434822",
            "votes": "0"
        },
        {
            "answer": "I have a lot of heartburn/acid reflux too.  I say this child is going to come out with lots of hair too.Another thing is my hips.  They are hurting so bad at night.  They wake me up too but even when I roll over they still hurt so bad that I can't go back to sleep.  Last night I ended up having to prop myself up on an incline and sleep on my back.  That wasn't the most comfortable thing either.",
            "post_id": "4386177",
            "timestamp": "1240487378",
            "user_id": "user_400358",
            "user_link": "/personal_pages/user/400358",
            "votes": "0"
        },
        {
            "answer": "Yay! I can finally vent to people who understand my pain....First off let me just mention the 25lb weight gain....I am 6 months pregnant and I look like I am due next week....not to mention all the pain in my lower back. I've always had some pain because I am a bit large inthe chest area but this is horrible pain that makes me feel like I can't move. I also get alot of pressure right under my belly in the bikini area. I swear it's swollen.  Summer is gonna be GREAT!!! I know this will all be worth it after the baby is finally here but Good Lord I feel like I am 90 years old.....",
            "post_id": "4386286",
            "timestamp": "1240489862",
            "user_id": "user_652679",
            "user_link": "/personal_pages/user/652679",
            "votes": "0"
        },
        {
            "answer": "I really don't have any major complaints.  I realize though that I am not meant to be over weight and look forward to getting into shape again.  The only other thing is the worry that goes along with pregnancy.  I get so worried if he is kicking enough.  Other than the first 4 month of vomiting, everything has been going great (knock on wood!)  Granted, it's not easy, but I am loving it all!",
            "post_id": "4386511",
            "timestamp": "1240494279",
            "user_id": "user_551885",
            "user_link": "/personal_pages/user/551885",
            "votes": "0"
        },
        {
            "answer": "blueeyedtabbycat, you made me laugh when you said the worst is yet to come. I agree I've been trying to limit my whining. I'm saving it up for this summer! My dh and I were going to get air conditioning because it's stupid hot in my house all summer long. It's horrible. It's like 90 degrees in my bedroom at night. Well dh decided to use the money for a new sound sytem in our theater. Right because that's a fair investement that will make everyone happy. The old system was fine!Anyhow I'm just waiting to make his life miserable from about next week when it starts to get hot until I have the baby. Aside from that my only complaint is the constant headaches. It never seems to go away.",
            "post_id": "4386654",
            "timestamp": "1240497174",
            "user_id": "user_349463",
            "user_link": "/personal_pages/user/349463",
            "votes": "0"
        },
        {
            "answer": "I have to say this time I was really scared bc I have an older sister that is older than me and she loves telling me, Patty you are not 20 any more (*****) and she kept telling me that everything is going to be 10 times worse, well guess what I feel GREAT no complaints no vomiting ever no pains no bleeding NOTHING and I love telling her that. Except for a little swelling here and there but that is it.   THANK GOD",
            "post_id": "4387022",
            "timestamp": "1240503574",
            "user_id": "user_461551",
            "user_link": "/personal_pages/user/461551",
            "votes": "0"
        },
        {
            "answer": "heartburn, i got so ussed to them and tums that i dont even count it a symptom..",
            "post_id": "4387329",
            "timestamp": "1240508648",
            "user_id": "user_463595",
            "user_link": "/personal_pages/user/463595",
            "votes": "0"
        },
        {
            "answer": "I think age may be a factor, too.  I have been lucky to have extremely easy pregnancies, no morning sickness, back pain, headaches, nothing.  But with this one (#4), it is SOOO much harder than I remember from the previous three!  (Maybe I block it out?? LoL)  Of course, I was 20 with the first, and now I'm 30.I really would like to have another, but (though I would never admit it to DH), I am really not sure I want to do this again!!I am just plain exhausted; waddling already (!), feel like I am about to pop, and my belly button! Oh!  It *kills* me if somethig touches my belly button, and my youngest is constantly climbing on me and bumping it.  Owww!I try not to complain, ever, becuase I know so many women have it SO much worse than me.  Thanks for giving me a place to let it out! = )",
            "post_id": "4388628",
            "timestamp": "1240531384",
            "user_id": "user_719902",
            "user_link": "/personal_pages/user/719902",
            "votes": "0"
        },
        {
            "answer": "ohhhh, i LOVE this thread!!  lol  my big complaints are A.) How large i am already and B) People commenting on how large i am alreadyi was at my daughter's pre-school for a meeting yesterday and the director of the center says, \"Oh, my jeannie, you are so HUGE\" (like i didn't already know this, thank-you very much)  i waddle around like i am carrying 10 babies instead of 1.  i eat more tums than anything else AND my hips are rotating out which is extremely painful and makes it hard to walk for very long and any type of distance!!anywho, those are my complaints...can't wait to read and share in this thread when summer hits (it has snowed 7 in. today already...where or where could summer be?)  i can't wait for some nice weather, but i know i am going to be complaining when it does come!!  :)",
            "post_id": "4388652",
            "timestamp": "1240532013",
            "user_id": "user_519661",
            "user_link": "/personal_pages/user/519661",
            "votes": "0"
        },
        {
            "answer": "Well it got into the 80's today! I think it must be some kind of record! I live in Minnesota so the weather is usually pretty mild untill June. I have my a/c on as I type. I spent the day outside with the kids and I am so hot right now I cant imagine the next few months, UGH! I feel so sluggish! I still have to do laundry. I think im going to stick my head in the frezer for a few minutes to cool down more:-(",
            "post_id": "4388784",
            "timestamp": "1240534293",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "Oh and another thing! I am so tired of peeing my pants everytime I cough or sneeze, I constantly feel \"wet\". I threw up the other day and the force of it made me pee a little at the same time, lol:-) Will I never be the same again?? (Sigh)",
            "post_id": "4389406",
            "timestamp": "1240546913",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "tabitha~lol, i hear ya, chicky!!  i have the exact same problem....i have just been wearing a panty liner, especially when we are out and about, etc.  it's been a big problem, especially getting over this darned cold and flu bug!!  your not alone!!  lol  :)",
            "post_id": "4390463",
            "timestamp": "1240584816",
            "user_id": "user_519661",
            "user_link": "/personal_pages/user/519661",
            "votes": "0"
        },
        {
            "answer": "I can't sleep at night. I can't get comfortable.  My neck, shoulders and hips hurt when I get up.  I am still going to the BR a lot at night.   My nose is soo stuffy and I'm sneezing like crazy.    I was wondering if at one point the sneezing would make me miscarry.blueeyedtabbycat and drmwvrjean, I have taken to wearing a sanitary napkin for the issue you are discussing.  Many times when I get ready to sneeze I cross my legs and tighten.  Sometimes that doesn't always work, hence the sanitary napkin.  I seriously contemplated getting a light weight depends....this is ridiculous.   I am try not enjoying being pregnant.  It's not fun.   I can hardly wait until this is over.",
            "post_id": "4390872",
            "timestamp": "1240592017",
            "user_id": "user_178698",
            "user_link": "/personal_pages/user/178698",
            "votes": "0"
        },
        {
            "answer": "Oh and if you guys want to talk about temperature....first of all I'm always roasting because of this pregnancy.   I live in Phoenix and we've been running the A/C since about march.   This week we hit our first 100 degree day!  Not it will probaby be hot as you know what until November!!  This baby is coming at the end of August.  I'm not leaving my house unless it's to go somewhere cool!",
            "post_id": "4390881",
            "timestamp": "1240592202",
            "user_id": "user_178698",
            "user_link": "/personal_pages/user/178698",
            "votes": "0"
        },
        {
            "answer": "it's funny- hearing everyone else's complaints helps me feel so much better! Not only are some of you worse off (sorry to hear that!), but you make me feel like it's OK to not be feeling good, to not be enjoying every aspect of this pregnancy.I bought a maternity support belt last night. hopefully it will help with the pelvic pain. I stopped climbing stairs at work and the unpleasant hours-long contractions have disappeared. Plenty of pelvic pain, round ligament stretching, etc... lingers.Mrs. Fergie- I had that crazy swelling in the pubic area a few weeks ago. It wasn't vaginal- it was the pubic area right over the pelvis. It was so swollen it was scary. I could push the flesh in like an inch! and boy did it hurt. I recalled experiencing the same swelling at the very end of my pregnancy and for the first few weeks post partum. I got very nervous because i had preeclampsia last time, and i feared this was a sign. Remarkably, it disappeared the day i started to sleep with my Snoogle pillow again. Maybe it was being aggrevated by the position of my hips/pelvis while i slept?It's finally hot here too, but i am enjoying it (for now). When in the car, the AC has to be running, but I am enjoying being outdoors with DD.",
            "post_id": "4394165",
            "timestamp": "1240680285",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "okay, since this is the thread to complain, here i am!!  (again, lol)i am getting sick and tired of being sick and tired!!  since i have been pregnant i have had bronchitis, the flu, 2 chest colds and now i am coming down with another bout with the flu!!  ugghh!!  my ob says that it takes you twice as long to heal and get over crud when you are pregnant, but i swear, i have been focusing more on getting ME better than getting ready and planning for the baby!!  i feel like i am disabled or something...okay, enough of my ranting, hopefully it will boost my spirits just getting it off my chest!!",
            "post_id": "4415991",
            "timestamp": "1241199405",
            "user_id": "user_519661",
            "user_link": "/personal_pages/user/519661",
            "votes": "0"
        },
        {
            "answer": "wow... drmwvr... i don't know what i'd do with myself if i was sick all the time. I'd be miserable.I actually had a good week. My OB told me on Thursday to expect to start slowing down and feeling tired and anemic in the next few weeks as there is a shift/increase in volume. He said our blood becomes diluted as the body can't keep up with making red blood cells, and as a result we start to feel rundown. I asked if there's anything i can do to prevent it- eat more red meat, etc... he just smiled and shook his head.",
            "post_id": "4421230",
            "timestamp": "1241348455",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "got a new one!the past few days, i have been having some difficulty peeing. it makes me very uncomfortable while urinating. Feels like I gotta pee a river but am only letting a trickle out at a time. I think it's based on her position, because it comes and goes.",
            "post_id": "4423069",
            "timestamp": "1241394596",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "Agh!! I feel like im going into labor but I know that im not. I have so much pressure and pain in my lower regions! I leek urine constantly, they want to send me to see a \"special doctor\" lol! I cant get comfy at night even with my body pillow. I have been sleeping on the couch EVERY night because the baby wakes up and the only place I can lay him that he goes back to sleep is the play pen!! We close on our 1st house in 2 days and he will finally have his own room so im investing in moniters. I just wish it were August already and I were already moved and settled. 25.5 weeks today and this little lady is doing a number on me. My boys never caused this many problems WTH!! Well thats my vent for today:=) Hope everyone is feeling good!Ugh, I still have to pack!!!!",
            "post_id": "4454841",
            "timestamp": "1242162421",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "i'm just FRIGGING sick of weird feelings with this pregnancy that i didn't have with any of the others. sick of all the trips to hospital that have given no real answers. and sick of wondering what the hell things are. it's my 4th so i thought i'd know what was going on with my body by now but this baby has me utterly stumped. i've been told to go to hospital the past 2 days on the run and i've just refused. it's the same procedures and tests all the time that show up nothing and i was there a week ago so what's the point?",
            "post_id": "4455131",
            "timestamp": "1242167278",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "summer is going to hurt...now dont get me wrong, ladies, I, too, am THRILLED with being preggo. We fought long and hard to get here ... that being said...I may have to run over the next cute little thing I see walking down the street in summer attire. I am a cow. I havn't gained a lot of weight with the pregnancy at all, maybe 8lbs in 27 weeks,but I did gain 50lbs the year we were doing continual hormone therapy and in vitro. Beofre starting this process I was in the best shape of my adult life, and now that person is a memory :(WAAAAAAAAAAAAAH!!",
            "post_id": "4455428",
            "timestamp": "1242172608",
            "user_id": "user_544906",
            "user_link": "/personal_pages/user/544906",
            "votes": "0"
        },
        {
            "answer": "tired:  I'm having the same problem.  I literally feel like I go to the bathroom all the day long just for a tricklle to come out.My newest complaint is the baby is literally kicking me to a point where it feels like he is directly kicking my crotch, but on the inside.  I wish he would move into a different spot already, because my bladder is not a soccer ball, and it's getting a little uncomfortable getting kicked in the crotch all the time!",
            "post_id": "4455702",
            "timestamp": "1242177039",
            "user_id": "user_434822",
            "user_link": "/personal_pages/user/434822",
            "votes": "0"
        },
        {
            "answer": "anyone else absolutely dreading waddling around in a bathingsuit this summer? DD and I go to the town pool almost everyday during the summer.",
            "post_id": "4456734",
            "timestamp": "1242208411",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "I don't mind the bathing suite thing but I really do hate getting up every hour and a half to go to the bathroom every night.  I also can't get comfortable and am starting to feel pressure in the lower regions.  Is it normal to feel pressure this early?  I am only 27 wks.",
            "post_id": "4457069",
            "timestamp": "1242219887",
            "user_id": "user_400358",
            "user_link": "/personal_pages/user/400358",
            "votes": "0"
        },
        {
            "answer": "bathing suit?? Haha, not catching me in one of those, lol! We go to the lake alot and I wear a tighter fitting top and shorts. I would have wore a bathing suit with my 1 and 2 nd pregnancys but I had spring babies so it was cold most of my pregnancy's. This is my 2nd summer baby and im dreading the heat:( Maybe I will just stay inside and crank up the a/c all summer:=)",
            "post_id": "4457398",
            "timestamp": "1242225889",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "Funny to read everyone is heading into summer with their pregnancies! Ahhh! My son was born during summer and it wasn't fun. I had to wear nana type shoes with valcro because my feet were so swollen. Yuck. You will all hate me when I tell you that here in Australia we are in Autumn (Fall) and so my twins will be here in Winter (August)! Yay!I am 36 weeks in size, yet I am only 25 weeks gestation! Oh the horror, my ligaments havn't had time to stretch- instead they have been tearing. It feels like a burning tearing pain in the top half of my stomach whenever I am on my feet. I have had trouble sleeping at night too, I get a numb feeling hip and leg after laying on it for half an hour. Then to turn over takes a massive effect and a lot of groaning! Its like doing a 3 point turn. Pelvic pain, back pain, the usual times by 10. When people ask me how I am, I just say now \"Dont ask!\". Im such a chirpy blimp at the moment!!!",
            "post_id": "4460488",
            "timestamp": "1242289597",
            "user_id": "user_784127",
            "user_link": "/personal_pages/user/784127",
            "votes": "0"
        },
        {
            "answer": "This is my first pregnancy and I have to say that everything that hurts or tenses up scares me! I too am so happy to be pregnant yet have had a lot of stuff going on with my body since the beginning! I felt pretty good from weeks 16-25 but am once again feeling like a big whining baby. Here I go...I had been mis-diagnosed as having over-active bladder a couple years before I got pregnant...now they say that I have internal cystitis which I can take meds for but they aren't recommended during pregnancy so no way, even though my doctor keeps asking if I want them! So I am literally in the bathroom every 15-20 minutes and \"holding it\" constantly at work which hurts like crazy, but it's embarassing to go to the bathroom that much. I have gotten up to pee every couple hours, sometimes every hour or more, to pee, and have leaked every single time I go to pee, since the beginning. Ahhh!! The past few weeks, when baby kicks me in the bladder, I have to get to the bathroom PRONTO or I know I will have an accident. This is hard when you commute over an hour each way to work!!I have had a sore belly for a couple weeks now which makes it hard to move around much. My feet, ankles and calves swell so badly that my shins are killing me by the end of the day. Right now I can put my feet up some at work, but will be working at a very active summer camp the entire month of July and can't even imagine what hell that will be...not to mention how I will be able to pee all the time... I have had spotting, painful contractions, back pain and random pains in my abdomen which have had my docs worried about pre-term labor so I've had a bunch of internal exams and missing work due to appts which my boss is ticked about and yelled at me for yesterday and then another supervisor wants me to be on bed rest so I'm less of a problem. I have gained 28 lbs already and I am only 27 wks which seems like too much. I've had a ton of pelvic pain for over a week, especially on my long commute but I can't exactly change positions. I'm also exhausted all the time again, as I was the first 15 weeks.Positives: My baby shower is in a month, I have an amazingly supportive husband and I passed my gestational diabetes test today!",
            "post_id": "4479690",
            "timestamp": "1242772077",
            "user_id": "user_910641",
            "user_link": "/personal_pages/user/910641",
            "votes": "0"
        },
        {
            "answer": "it's WAY too hot in the uk and being 30+ weeks is NOT helping. I'm really, really tired all the time and am STILL getting morning sickness...i've never had it last this long before. i don't mind admitting it, i am utterly fed up of being pregnant and can't wait for baby to be here. i know i'll miss being pregnant once he is...but only when i forget what a pain in the butt this pregnancy has been",
            "post_id": "4522554",
            "timestamp": "1243938156",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "Now my vision is going! very frustrating, because one eye is much worse than the other. My normally better than 20/20 vision has disappeared. I know it's normal during pregnancy, but it's driving me crazy.",
            "post_id": "4522623",
            "timestamp": "1243941339",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "I have no energy. at all. EVER. this whole growing a person thing has taken the wind outta my sails...I realize its probably my age, but good note, Im TIRED!  :)",
            "post_id": "4522741",
            "timestamp": "1243945808",
            "user_id": "user_544906",
            "user_link": "/personal_pages/user/544906",
            "votes": "0"
        },
        {
            "answer": "i haven't been able to poop properly for days. i think it's caused tummy pains and made me throw up just now. so i gotta phone the midwives and ask what i can do to help me poop lol...so embarrassing",
            "post_id": "4536695",
            "timestamp": "1244275685",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "i hate the swelling....now that its summer and i only have six weeks left my ankles legs feet face hands everything is swelling....i asked the doctor about it and she said that im not showing signs of preclampsia and that its just natural...***** though i hate it...and recently i have been getting alot of back pain....i love being pregnant but i think the next time im gonna make sure not to be pregnant during the summer lol",
            "post_id": "4641604",
            "timestamp": "1247155637",
            "user_id": "user_961172",
            "user_link": "/personal_pages/user/961172",
            "votes": "0"
        },
        {
            "answer": "dunno if anyone else has been brave enough to say so but piles - OMG! i've had diarreah all day and it's played havoc with my piles",
            "post_id": "4642722",
            "timestamp": "1247173671",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "BACK! BACK! OW MAN, MY BACK!",
            "post_id": "4651495",
            "timestamp": "1247429135",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "I have no tolerence for the world and life in general right now. driving is a danger to myself and anyone whi happens to get in my way...Im convinced Im going to go into labor behind the wheel....since the baby has dropped I eat any/everything and IM STILL HUNGRY!!",
            "post_id": "4651518",
            "timestamp": "1247429979",
            "user_id": "user_544906",
            "user_link": "/personal_pages/user/544906",
            "votes": "0"
        },
        {
            "answer": "pain in my side! and PAIN whenever she kicks - man she's got some strong legs!",
            "post_id": "4654915",
            "timestamp": "1247518792",
            "user_id": "user_128458",
            "user_link": "/personal_pages/user/128458",
            "votes": "0"
        },
        {
            "answer": "can't sleep. Lucky if I get 2 consecutive hours, total 4 hours. Last night I was up from 2:45 to 5:00. And I have a toddler who likes to get up early.",
            "post_id": "4655160",
            "timestamp": "1247523147",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "i haven't gotten 2 consecutive hours in WEEKS! no joke - i pee every 30-50 minutes...and then it takes me like 10 minutes to fall back asleep. i'm a cranky mess. luckily - sienna likes to sleep in (6:45-7:15 usually) not that that really helps my peeing issues! i took a tylenol pm last night (or maybe it was a unisom) and actually slept for 3 hours stretches at a time before peeing. glorious!",
            "post_id": "4657724",
            "timestamp": "1247590329",
            "user_id": "user_128458",
            "user_link": "/personal_pages/user/128458",
            "votes": "0"
        },
        {
            "answer": "I know how you ladies feel:( Last week I acually slept for 4 hour straight before getting up to pee!! The only draw back was I was in more pain than usual because I had held it so long:( But usually I get up every hour on the hour. And I have this crazy habit of going to bed soooooooo late. I get maybe 4-5 hours total a night. We are just being prepared for when baby come though:()",
            "post_id": "4659608",
            "timestamp": "1247623090",
            "user_id": "user_419158",
            "user_link": "/personal_pages/user/419158",
            "votes": "0"
        },
        {
            "answer": "My hips feel like they are broken when I try to walk, I dread even walking across the room!I have serious heartburn every night! So Im guessing he should have tons of hair!He loves kicking me in the ribs ... no matter what position I move to...ahh! Feels as though I can't catch my breath...or how about someone sucker punching me ?? hahaI go to the bathroom about 4times a night now, never before did I ever wake up to use the bathroom this many times!!I get sharp shooting pains up in my 'whoo-ha' lol...which I could live without.. I had to go to the ER to get that checked out, and they made me bleed for a total of 4 days!! I never imagined seeing blood come out of me while pregnant..it was a scary moment.I feel exhausted even when I wake up in the morning, never ending tiredness! ..I guess he doesnt sleep when I do! Grr...now I know what to look forward to.I've had the 'runs' for about a month straight!!! Wow, why does this have to happen!! LOL Kind of embarrassing but true...3-4times a day I have to go rush to the bathroomAnd to top it all off, I have whole body swelling...its my legs, arms, hands, feet, face...So yes, this feels great to say....I can't wait for our little boy to come out!!",
            "post_id": "4687907",
            "timestamp": "1248326146",
            "user_id": "user_978523",
            "user_link": "/personal_pages/user/978523",
            "votes": "0"
        },
        {
            "answer": "the pressure of baby's fully engaged head on my groin is poop! and, i've seriously had enough. i want him out by the end of this weekend ( as long as he's ok to be...which i'm sure he is at 38 weeks...and now i'm just rambling lol",
            "post_id": "4693600",
            "timestamp": "1248462043",
            "user_id": "user_689265",
            "user_link": "/personal_pages/user/689265",
            "votes": "0"
        },
        {
            "answer": "my allergies are really starting to bother me, and I can't take anything that's actually useful. No runny nose or anything... just constant pressure and headaches.i feel like a pack-a-day smoker and sound like darth vader with my heavy breathing.I'm very cranky and b!tchy. i feel bad for DH, but I really can't help it.",
            "post_id": "4693906",
            "timestamp": "1248467424",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        },
        {
            "answer": "well i just got out of the hospital...AGAIN....they found 2 more kidney stones and pneumonia on top of it all!!  Gracie is doing fine, which is great, but they put me on some VERY HIGH PRICED antibiotics that we can't afford AND pain killers, which i hate taking while carrying her!!  so i go through this whole ordeal, get home having not slept in almost 48 hrs. and i am loopy and exhausted, crabby and hot and dearest DH wants me to just resume my normal routine and take care of HIS every need plus the 3 kids....\"I am hungry, what's for dinner?\"  and \"The kids are fighting and driving me nuts, what are you going to do about it?\"  well his frigging legs aren't broken!!  i finally got to sleep at 1 a.m. this morning and got up about 6 a.m. so he could take his daughter back to her mother, which is a HUGE relief, but he will be gone for 2 days and that leaves me without a car and sick as a dog!!  ugghh, MEN!!!",
            "post_id": "4696331",
            "timestamp": "1248539561",
            "user_id": "user_519661",
            "user_link": "/personal_pages/user/519661",
            "votes": "0"
        },
        {
            "answer": "sorry to hear that , kidney stones worst thing ever and with pregnancy terribble, try drinking cranberry juice, lots lots of fluids maybe you will pass them hope so.good luck",
            "post_id": "4698344",
            "timestamp": "1248584420",
            "user_id": "user_463595",
            "user_link": "/personal_pages/user/463595",
            "votes": "0"
        },
        {
            "answer": "oh my... don't I feel silly for complaining about being short of breath??how are you coping with all of this cr@p and not feeling well?",
            "post_id": "4701554",
            "timestamp": "1248690755",
            "user_id": "user_171768",
            "user_link": "/personal_pages/user/171768",
            "votes": "0"
        }
    ],
    "post_id": "4384631",
    "question": "OK... I am very greatful to be pregnant. I truly am. But oh man am I uncomfortable!! I don't like to whine on the maternal and child or pregnancy forums, because I know there are so many women out there dying to be pregnant. So i thought I'd start a venting forum. Whine about your discomforts, aches and pains. Know that others feel that way too.I'll start- first of all, baby #2 is sooo much harder on my physically than #1. My whoo-ha is KILLING me. And with so many weeks left to go :(  I waddle about, and when people ask what's wrong, i can't exactly say that my crotch hurts. I never had this with DD.",
    "timestamp": "1240443412",
    "title": "Vent About Your Symptoms Here!!!",
    "user_id": "user_171768",
    "user_link": "/personal_pages/user/171768"
}