{
    "answers": [
        {
            "answer": "They check it at 36 weeks. And it doesn't have any symptoms?? And it has nothing to do with protein in the urine? I think your confused about something. I have group b step also. You get the medicine right before you have your baby. I think your overreacting.",
            "post_id": "11850283",
            "timestamp": "1421468976",
            "user_id": "user_8930249",
            "user_link": "/personal_pages/user/8930249",
            "votes": "0"
        },
        {
            "answer": "You tell that to all the moms who.lost their kids to.this infection!how dare u say im.over reacting  that is cruel. Also im 26 weeks and yes it was found on me through the protein in my urine and that is what i have unless ir calling my doctors and the results a lie",
            "post_id": "11850304",
            "timestamp": "1421469317",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "And confused no honey obviously your uninformed read up before you even respond this is serious and many many women have lost their babies because of this !",
            "post_id": "11850309",
            "timestamp": "1421469411",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "Group B is not diagnosed by protein in your urine. Preclampsia is. Group B is diagnosed by a swab taken that is tested to see if it grows the bacteria. So as she said you are confused. Do not give inaccurate information.",
            "post_id": "11850363",
            "timestamp": "1421470370",
            "user_id": "user_7226538",
            "user_link": "/personal_pages/user/7226538",
            "votes": "0"
        },
        {
            "answer": "Hey mom,u say the doctor found protein n ur urine elixy protein n ur urine hace somthing to do wit ur kidneys not a infection it have something to do wit sugar I kno becuz i have diebetes n protein n my urine is very high n im pregnant 19weeks",
            "post_id": "11850375",
            "timestamp": "1421470567",
            "user_id": "user_11837277",
            "user_link": "/personal_pages/user/11837277",
            "votes": "0"
        },
        {
            "answer": "Protein in your urine means your not drinking enough water",
            "post_id": "11850386",
            "timestamp": "1421470722",
            "user_id": "user_10721980",
            "user_link": "/personal_pages/user/10721980",
            "votes": "0"
        },
        {
            "answer": "Protein n urine have some thing to do wit ur kidneys",
            "post_id": "11850415",
            "timestamp": "1421471230",
            "user_id": "user_11837277",
            "user_link": "/personal_pages/user/11837277",
            "votes": "0"
        },
        {
            "answer": "I Had Protein In My Urine At 32 Weeks & Just Got The Swab For The Strep B Infection At 37 Weeks & It Came Out Negative! (:",
            "post_id": "11850446",
            "timestamp": "1421471659",
            "user_id": "user_11482079",
            "user_link": "/personal_pages/user/11482079",
            "votes": "0"
        },
        {
            "answer": "I'm not saying it not serious. It is serious. But protein in your urine means something else. I didn't mean to upset you.",
            "post_id": "11850503",
            "timestamp": "1421472623",
            "user_id": "user_8930249",
            "user_link": "/personal_pages/user/8930249",
            "votes": "0"
        },
        {
            "answer": "Btw I have done research on it. I tested positive for this so I have talk to my doctor and looked online.",
            "post_id": "11850514",
            "timestamp": "1421472785",
            "user_id": "user_8930249",
            "user_link": "/personal_pages/user/8930249",
            "votes": "0"
        },
        {
            "answer": "GBS doesn't cause still borns. I have it. They check you for it between 34-37 weeks of pregnancy and they do it by a swab. Not only did I have my doctor give me all the info she could on it but I went home and looked it up myself. You are VERY poorly informed and giving expecting mothers false information that can scare them and stress them out is very messed up. We don't show symptoms of GBS and they can only do something about it AS you go into labor. They put antibiotics in your body through an IV. So please. Next time you try to \"help\" women out make sure you're properly informed. Thanks.",
            "post_id": "11850530",
            "timestamp": "1421473041",
            "user_id": "user_10464225",
            "user_link": "/personal_pages/user/10464225",
            "votes": "0"
        },
        {
            "answer": "Thank you fancynicole123!!!",
            "post_id": "11850536",
            "timestamp": "1421473120",
            "user_id": "user_8930249",
            "user_link": "/personal_pages/user/8930249",
            "votes": "0"
        },
        {
            "answer": "Um.. ive had protein in my urine from eating a candy bar before my appointment. At my 36 or 37 check up they tested for the b strep with the swab and I came out positive. Im getting induced monday morning and they're giving me the iv for it right when they induce me so it won't harm the baby.",
            "post_id": "11850543",
            "timestamp": "1421473239",
            "user_id": "user_10577068",
            "user_link": "/personal_pages/user/10577068",
            "votes": "0"
        },
        {
            "answer": "I agree 100% with fancynicole123",
            "post_id": "11850550",
            "timestamp": "1421473384",
            "user_id": "user_10577068",
            "user_link": "/personal_pages/user/10577068",
            "votes": "0"
        },
        {
            "answer": "GBS in its most serious from CAN cause miscarriages and still borns although it is very rare (Which is why many women don't think it's possible) GBS can also be detected by pregnant women who have reoccurring urine infections (I think the original poster may have meant this?)",
            "post_id": "11851134",
            "timestamp": "1421486724",
            "user_id": "user_11008609",
            "user_link": "/personal_pages/user/11008609",
            "votes": "0"
        },
        {
            "answer": "Actually ladies group b step can cause stillborns i know this because my friends baby died of this at 41wks pregnant. Having the infection usually has little harm if put on antibiotics during labor but in skme cases before baby is born and before ur waters have broken babies can some how get this infection and doctors dont know why and yes than it causes fetal death. So please be aware that most women with gbs their babies are fine but there is that chance baby can contract it. So elixy u are correct. Congrats ladies and goodluck",
            "post_id": "11851202",
            "timestamp": "1421489654",
            "user_id": "user_9754532",
            "user_link": "/personal_pages/user/9754532",
            "votes": "0"
        },
        {
            "answer": "I had gbs with my first son and they did not do anything different during my pregnancy until i went into labor. They give you a iv with antibiotics so they baby doesn't get it. They told me alot of women have it.",
            "post_id": "11851244",
            "timestamp": "1421491588",
            "user_id": "user_10919420",
            "user_link": "/personal_pages/user/10919420",
            "votes": "0"
        },
        {
            "answer": "Lpok idk if you guys know but protein in urine is also an indicator of having gbs of you dont believe me look it up or ask.your doctor thats why they were concerned at my hospital also it causes babies to come prematurely and i know about the preeclampsia they checked me for that uti etc everything came back fine it was the gbs that caused  it",
            "post_id": "11851851",
            "timestamp": "1421507366",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "@Fancy nicole obviously you didn't enough research look it up again because not only does it say on web md and many other websites that it causes still borns i have also rrad cointless stories of babies born.stillborns then they were diagnosed woth gbs when it was to.lateALSO LADIES START TAKONH PROBIOTICS THIS HELPS ELIMINATE BAD BACTERIA i heard many moms do this and it helped when they had the other kids to come out negative.",
            "post_id": "11851863",
            "timestamp": "1421507606",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "@Tashalee im so so sorry this happened to your friend my geart goes out to her.Ladies i didnt come to upset no mom its not intention or to scare her but many women brush this off or dont know about this like i didn't. Im only informing all the moms out there so this doesn't hurt their babies because being uninformed is the reason most baby's die if you have this may God be with I'm telling you my story so you can tell others or be informed. Please dont take my advice as a joke.",
            "post_id": "11851885",
            "timestamp": "1421508027",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "Elixy128...where exactly are you finding this information?  I've read several sites and nowhere does it say that group b strep is diagnosed by protein in your urine. If you know of sites with differing information from what we all see please share the websites with us.",
            "post_id": "11851895",
            "timestamp": "1421508123",
            "user_id": "user_11533339",
            "user_link": "/personal_pages/user/11533339",
            "votes": "0"
        },
        {
            "answer": "Ill post u the link or at least tge websites",
            "post_id": "11851898",
            "timestamp": "1421508170",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "Group b is a swab test? It's a test for a bacteria between your cooch and butt. They don't put you on antibiotics for it during pregnancy because once you're done with your prescription it comes back. They do put you on antibiotics during labor it's rare baby comes in contact with it but it's a precautionary measure. I have never heard of this being something that would harm your unborn baby. This sounds extremely inaccurate, the meeting I had with my nurse had gone into detail about this and nothing you just said was included into that conversation. I'm glad you and your baby are ok but I don't think you have the correct diagnosis. The urine sample they take at every visit is used to help determine if you have diabetes, kidney disease, or a bladder infection by measuring the levels of sugar, protein, bacteria, or other substances in your urine. Group b is on a whole other level.",
            "post_id": "11851985",
            "timestamp": "1421509594",
            "user_id": "user_11433444",
            "user_link": "/personal_pages/user/11433444",
            "votes": "0"
        },
        {
            "answer": "*****************.org says its tested through a swab of vaginal and rectal area. Not urine. I don't trust WebMD cuz not everything on there is true. I don't trust info from ANY site that is \".com\" cuz the \".com\" sites r the ones that ANYONE can post onto.",
            "post_id": "11851986",
            "timestamp": "1421509615",
            "user_id": "user_10973980",
            "user_link": "/personal_pages/user/10973980",
            "votes": "0"
        },
        {
            "answer": "If it was something life threatening to your baby your doctor should stress that it isn't something to brush off to begin with. I started flirting with preclampsia and my doctor took action right away. If your doctor isn't communicating your health well enough with you or missing things maybe you need a new doctor.",
            "post_id": "11852011",
            "timestamp": "1421509894",
            "user_id": "user_11433444",
            "user_link": "/personal_pages/user/11433444",
            "votes": "0"
        },
        {
            "answer": "And I read on WebMD just to see what u were talking about and it doesn't say any of that. It says it can cause phenomena and other complications. Please, don't scare me like this. I have so much going wrong with my pregnancy already, I don't need more to worry about like my baby being stillborn.",
            "post_id": "11852017",
            "timestamp": "1421509963",
            "user_id": "user_10973980",
            "user_link": "/personal_pages/user/10973980",
            "votes": "0"
        },
        {
            "answer": "Ok so go to google look up can protein in urine cause gbs click on the website ncbi. Its a government web site i also just found out the reason they dont take protein in women serious its because even if they dont fibd any you can still have gbs so i guess its not a straight indicator of gbs but if you do happen to have it why not get checked for gbs. Because like i said it can cause you to have a premiee baby which some dont even make it to 35 weeks of pregnancy.",
            "post_id": "11852022",
            "timestamp": "1421510063",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "@Ashrefa the reason they dont stress it is because 1. Most moms dont know about and 2 theres nothing the docs can do about it thats why its out of their hands all they can do is give u antibiotics four hours before you deliver and pray to god your baby doesnt get it and if your baby is unlucky  then they have a small chance of survival so please like i said dont down play this",
            "post_id": "11852037",
            "timestamp": "1421510287",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "I just read on *****************.org that in serious cases of gbs it can cause still borns. So I guess she was right. But that only happens in serious cases.",
            "post_id": "11852048",
            "timestamp": "1421510512",
            "user_id": "user_10028953",
            "user_link": "/personal_pages/user/10028953",
            "votes": "0"
        },
        {
            "answer": "Due at February i never said it was on webmd idk why you guys keep going their. Also hun protien in urine is an indicator of uti kidney infection all those thing can be caused by gbs and like stated im not trying to scare u trust me when I tell im in ur shoes i almost miscarried twice ive have a ****** pregnancy im try to inform you also buy some probiotics if you have gbs it will give your baby more of a fighting chance before birth ok it might even take it away i bought mine yesterday.",
            "post_id": "11852050",
            "timestamp": "1421510537",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "** American pregnancy. Org",
            "post_id": "11852052",
            "timestamp": "1421510553",
            "user_id": "user_10028953",
            "user_link": "/personal_pages/user/10028953",
            "votes": "0"
        },
        {
            "answer": "My mom had it when my brother was born then again when I was born. Back in the 80's they don't test. We figured it out because he and I were born with pneumonia",
            "post_id": "11852069",
            "timestamp": "1421511031",
            "user_id": "user_10174468",
            "user_link": "/personal_pages/user/10174468",
            "votes": "0"
        },
        {
            "answer": "The test is done by a simple swab in your nether regions. If youre pos. just remember you are and let a nurse know asap. But, its ideal to get hooked up to the IV 4hrs prior to giving birth (the IV they give u is peniciline, btw) my doc. Told me when she was doing the test (when i was 35wks) that they test for it more often now than before. Because years back women werent being tested for this and would end up getting sick off of serious sicknesses and die. If you get hooked up to the IV. Your baby should be fine because along with that medicine and your antibiotics you pass on to the baby. Im not saying its nothing serious bcause any percentage of anything bad is worth looking into. But, dont freak out. Now a days modern science and good doctors are your first line of battle and are very well informed.Best of luck to you all, im due anyday now! (41wks) possitive and no, i chose not to stress it. (stressing is actusactually worse for bby than being bstrap pos ;)  )",
            "post_id": "11852085",
            "timestamp": "1421511327",
            "user_id": "user_10058176",
            "user_link": "/personal_pages/user/10058176",
            "votes": "0"
        },
        {
            "answer": "Fear Mongering:P If we were to sit and lay out ever bad possible senerieo that could happen to you during pregnancy or child birth we would all probably have a heart attack. Do what you can to the best of your ability to have a happy healthy pregnancy and don't stress. Yes,unfortunate things happen, not everyday is promised. Do what you can, thanks for sharing your experience, but a majority of situations aren't as extreme as yours. No need to stress others out.",
            "post_id": "11852145",
            "timestamp": "1421512269",
            "user_id": "user_11433444",
            "user_link": "/personal_pages/user/11433444",
            "votes": "0"
        },
        {
            "answer": "But you did say that it was in WebMD and other sites when you responded to a comment to fancynicole. And I've always been tested for group b strep in all if my pregnancies.  I was told that it's routine to be cautious because you don't have symptoms of it if you do in fact have it. I don't think that this is something to take lightly at all, by all means better safe than sorry, but misinformation is just as bad as not having the information at all. The reasons I think Dr's don't make a huge deal out of it is because they are or at least should be routine checking all of their prenatal patients and is totally treatable when caught. I'm sure that there have been more serious cases that have led to stillborn births but I'm sure those are extreme cases and could possibly have had other complications.  If anyone is concerned about it then the best thing would be to speak directly to your dr and get the information from them.",
            "post_id": "11852481",
            "timestamp": "1421516678",
            "user_id": "user_11533339",
            "user_link": "/personal_pages/user/11533339",
            "votes": "0"
        },
        {
            "answer": "The chances of you having groupstrep b is a 5% chance and the chances of you baby contracting it during labor is a 0.5% chance. Not something to freak out other mother over if you don't explain the statistics. But if baby does happen to get it the there is a 50% mortality rate. And you could test positive for it and the it can go away before you give birth or visa versa. So in reality it is a pointless test.",
            "post_id": "11852533",
            "timestamp": "1421517740",
            "user_id": "user_5098230",
            "user_link": "/personal_pages/user/5098230",
            "votes": "0"
        },
        {
            "answer": "Gbs does not cause still born. The baby is safe inside the uterus protected from all bacteria. If you have Gbs and your baby get it (because a baby can still get it with or without antibiotics 0.1%) you child won't be affected until after birth which would show from the first 24 hours as long as up to a month your child wouldn't show signs.",
            "post_id": "11852564",
            "timestamp": "1421518358",
            "user_id": "user_5098230",
            "user_link": "/personal_pages/user/5098230",
            "votes": "0"
        },
        {
            "answer": "I understand ur only trying to inform. And u mentioned WebMD above which is y I mentioned it.",
            "post_id": "11852630",
            "timestamp": "1421519781",
            "user_id": "user_10973980",
            "user_link": "/personal_pages/user/10973980",
            "votes": "0"
        },
        {
            "answer": "I was talking about the stillborn part which is on practically every website and as for the person who said it doesnt cause stillborns you probably don't even know there is two tyes of gbs and on the early onset in can get into the placenta and cause serious birth deficiencies or death with also means still born baby look it up second remember as soon as ur water breaks that means the baby isnt covered by anything and the infection can contaminate them look it up again also there a 25-30% chance of woman having it and with out the iv and antibiotics they give at the hospital during labor the baby will most likely die or have birth defects. Im telling you truth uou can argue with me over me just trying to warn moms to take this serious and atleast get tested so they can protect their baby over and over again but unless you actually look it up and do research on this then stop being so insensitive because unlike most of you i dont think babies dying over something that can be treated if known should happen so yes ima continue spreading the word cause every mom needs to know this and this is a serious  thing. Because many moms were not informed about this their babies died im 27 weeks as of monday i started taking probiotics to help my baby so moms if they deny you the test say it can cause premiee labor and if you do have premiee labor make sure you ask to be tested to help your baby and if you dont have it thank god",
            "post_id": "11856111",
            "timestamp": "1421580013",
            "user_id": "user_11675935",
            "user_link": "/personal_pages/user/11675935",
            "votes": "0"
        },
        {
            "answer": "I tested positive for gbs and all my doctor said was that when I go into labor they have to give me antibiotics through my iv. and I asked if I should take antibiotics before I go into labor and he said no because it would just come back. I'm almost 39 weeks and I know my baby girl will be okay. But Telling us pregnant women that it can cause still borns isnt okay. I'm sure we all think of our babies coming out with something wrong and it terrifies us.",
            "post_id": "11856152",
            "timestamp": "1421581568",
            "user_id": "user_10340338",
            "user_link": "/personal_pages/user/10340338",
            "votes": "0"
        },
        {
            "answer": "Can't believe what you read on the Internet. Everyone has a different opinion, just get the test and take the proper precautions.",
            "post_id": "11856166",
            "timestamp": "1421582191",
            "user_id": "user_11258562",
            "user_link": "/personal_pages/user/11258562",
            "votes": "0"
        },
        {
            "answer": "EVERYONE KNOWS THE CAUSE HERE!!!If anyone has a problem or want to research more about SPEAK TO YOUR DAMN DOCTOR!!! UNLESS YOU ALL ARE DOCTORS THAT THINK KNOW FOR SURE?Geeze everyone gets all hot headed and sh!+",
            "post_id": "11856201",
            "timestamp": "1421583396",
            "user_id": "user_11077771",
            "user_link": "/personal_pages/user/11077771",
            "votes": "0"
        },
        {
            "answer": "Someone said above the IV they give you is penicillin. What if you're allergic to penicillin? What do they give you instead?",
            "post_id": "11856204",
            "timestamp": "1421583522",
            "user_id": "user_6759135",
            "user_link": "/personal_pages/user/6759135",
            "votes": "0"
        },
        {
            "answer": "I have researched gbs for 2 years and refuse to take the test and my children are just fine.",
            "post_id": "11860266",
            "timestamp": "1421650569",
            "user_id": "user_5098230",
            "user_link": "/personal_pages/user/5098230",
            "votes": "0"
        },
        {
            "answer": "Coming in as a nurse protein is not causative of infection bacteria is. Protein is broken down by the kidneys when dehydration, diabetes, or other diseases are present. As far as GBS goes if there were any possibilities of it getting into your blood stream during pregnancy I could se the risk of miscarriage. But if you tested positive and get treatment like its recommended in labor you and the baby will be fine but if it goes undetected and during labor when the baby is coming out and gets in contact with the bacteria the results could be detrimental and even fatal. But I wouldn't exactly believe everything you believe in the internet because it's not all true. Now encyclopedias are medical books that have been published those are good sources. A little old school but they had to be correct before being published. But good luck to all you moms and prayers for safe and healthy babies for you all :)",
            "post_id": "11860323",
            "timestamp": "1421651919",
            "user_id": "user_7680843",
            "user_link": "/personal_pages/user/7680843",
            "votes": "0"
        },
        {
            "answer": "Corrupted I was wondering the same thing. My doctor didn't say anything about it being penicillin. I'm allergic to that and I don't remember any of the reaserch I read saying that, but then again most of them just said that the doctors will provide an iv to prevent the infant from catching it on the way out. And to the poster, your doctor is SUPPOSED to test you between 34-37 weeks. If they didn't test you or refused to you need a new doctor. Quite frankly I think you need a new one any way and new places of \"research\" because you're still the only person saying the things that you are. What are the odds that EVERYONE but you, INCLUDING these women's doctors, have the wrong info and you are the ONLY one with the right one? Seriously, mothers have enough things to worry about with their pregnancy as is, providing information like this that apparently only you can find or have been told is seriously messed up. A lot of us have been tested properly. Have talked to our doctors. Have done our research. Yet we are still incorrect? Yeah...doesn't seem logical to me.",
            "post_id": "11860388",
            "timestamp": "1421653455",
            "user_id": "user_10464225",
            "user_link": "/personal_pages/user/10464225",
            "votes": "0"
        },
        {
            "answer": "I also just went and checked out the website that you keep referencing to and its not even sited. I don't even understand how the website is legally still on the internet. You really need to do more research.....and actually pay attention to the websites that you feel the need to reference. Especially since they have no references themselves.",
            "post_id": "11860502",
            "timestamp": "1421656791",
            "user_id": "user_10464225",
            "user_link": "/personal_pages/user/10464225",
            "votes": "0"
        },
        {
            "answer": "I can't believe this is still an active argument. Ladies if you have a question about anything medical talk to your doctor DO NOT BELIEVE RANDOM ladies ON THE INTERNET! and Elixy you are still wrong. Please get a new doctor and learn more about proper research methods.",
            "post_id": "11860511",
            "timestamp": "1421657048",
            "user_id": "user_7226538",
            "user_link": "/personal_pages/user/7226538",
            "votes": "0"
        }
    ],
    "post_id": "11850256",
    "question": "Hey Moms please at ur 2nd or third trimester and even when ur child is born check for group B strep please this is a serious thing most woman have it during pregnancy. I just found out i have this bacterial infection and im horrified but i'm grateful I found out early before my due date. I had never even heard of this and i had to go to the emergency labor room for them to test me on this my baby could have died because my obgyn found a lil bit of protein in my urine and dismissed it. Thankfully those doctors didnt. Please be safe then sorry and make your obgyn check if you have this bacterial infection so proper precautions can be taken to save your childs life many moms have never heard of this or know that this infection mostly causes no symptoms until its to late. I have no symptoms i went in for food poisoning but had them run test on me. Im grateful i went. Many moms get still borns from this and if their babies get the infection many complications occur even death but it can be prevented during labor please check.",
    "timestamp": "1421468554",
    "title": "VERY SERIOUS EVERY MOM SHOULD READ",
    "user_id": "user_11675935",
    "user_link": "/personal_pages/user/11675935"
}