{
    "answers": [
        {
            "answer": "I heard that on the radio too. I don't know how we can know who to believe with all of these opposing views. I do know that too much of any vitamin can be dangerous... especially the ones that aren't water soluble. I believe D is one of them.Maybe somebody will see this that has some real knowledge to share with us.Diane",
            "post_id": "6408134",
            "timestamp": "1291167865",
            "user_id": "user_1225178",
            "user_link": "/personal_pages/user/1225178",
            "votes": "0"
        },
        {
            "answer": "I was taking 1400 IU of vit D and when I had my level checked it was a lousy 17.  I now take 5400 IU and that has me right at the very low end of normal, 35.  I get bloodwork in a few months so I will see where I am at then.",
            "post_id": "6408151",
            "timestamp": "1291168046",
            "user_id": "user_475300",
            "user_link": "/personal_pages/user/475300",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies. I don't know who to believe either, Diane. I guess I better get my levels checked.",
            "post_id": "6408171",
            "timestamp": "1291168384",
            "user_id": "user_1464361",
            "user_link": "/personal_pages/user/1464361",
            "votes": "0"
        },
        {
            "answer": "There was a few doctors on world news tonight that had major concerns that the levels suggested were too low.  It gets to the point where you don't know who to believe but if it took 5000 IU daily to get my levels to low normal the 600IU that they are reccomending can't be enough for someone who is low.  Like I said I was taking 1400 IU daily and I wasn't even near low normal, I want mine to be in the middle or higher, but that is just me.Denise",
            "post_id": "6408228",
            "timestamp": "1291169204",
            "user_id": "user_475300",
            "user_link": "/personal_pages/user/475300",
            "votes": "0"
        },
        {
            "answer": "http://www.businessweek.com/news/2010-11-30/vitamin-d-calcium-supplements-may-be-unnecessary.html",
            "post_id": "6408230",
            "timestamp": "1291169207",
            "user_id": "user_105705",
            "user_link": "/personal_pages/user/105705",
            "votes": "0"
        },
        {
            "answer": "http://www.hivandhepatitis.com/2010_conference/easl/docs/0518_2010_b.html",
            "post_id": "6408297",
            "timestamp": "1291170590",
            "user_id": "user_979080",
            "user_link": "/personal_pages/user/979080",
            "votes": "0"
        },
        {
            "answer": "Interesting  , My Hepa, suggested taking 2000 IU  when on tx.",
            "post_id": "6408310",
            "timestamp": "1291170913",
            "user_id": "user_1480074",
            "user_link": "/personal_pages/user/1480074",
            "votes": "0"
        },
        {
            "answer": "loaded question...too little is no good and so is too much.GS GIRL< above,with the low D number may be low because your body is throwing it off to keep her calcium lower, she should have her PTH checked ASAP.the truth is this vitamin is essential to health, so much so that the skin will make it for you, enough to stay healthy with only 10 minutes of sunlight exposure per day.the truth also is that without enough you get sad, infections, more diebetes, and a whole host of other bad things with a deficiency.However too much can also cause issue....some docs now think 50 rather than 40 is a good number...however this might not be wisdom, there are issues with trying to keep it too high just as too low.Why.  Well for one thing, excess Vitamin A and D are stored in the liver...and too much of either can cause problems...severe overdoses of these fat soluble vitamins can even be fatal. Google Admiral Perry expedition, they died because they ate Polar bear liver, which has way more of these vitamins then humans can tolerate.The main issue for A & D is they help maintain bone, and prevent a variety of diseases as part of their effects on metabolism. The D will help you hold onto calcium, and keep your teeth and bones strong.  The only reason this can backfire is if you have a kidney insufficiency, kidney stones, or an overactive parathyroid. In those cases taking D can actually cause kidney stones, strokes and more.So the main thing is to make sure you need the vitamin by having a blood test done to check both the D level, and your calcium level.GS girl, If one takes D, and it still stays low, it may be the body is throwing it off to protect itself.Go to parathyroid.com and read up on the page on Vitamin D to understand how that works.If you want to take D go ahead, but I would ask for a Dexa scan, then you will have a base line to go by, and repeat this every 2 years to see how your bones are doing. If you are staying the same, keep your dose the same, if you are losing bone, up your dose, if you are gaining, then lower your dose. Too much can lead to bone spurs, stenosis, bursitis and other issues. Ergo high doses have a component of danger that the proponents of the higher doses never point out.I think the best thing is to get some sun, eat fish, things high in D, and then if you do supplement keep the dose fairlu low. 1-2000...higher than that and over time you could cause too much calcium to be stored, and like I said, the excess calcium gets stored in bad ways, like kidney stones, like plauques, like gall stones, like bone spurs and bursitis....so between high and low dose...somewhere in between lies sanity.Also, it depends on your diet how much you need, A piece of Salmon has about 700 IU,,,,fruits and veggies are high in vitamins, fresh food vs. processed, junk food is low...without knowing how you eat, it would be hard to say what your need is.Generally a fresh well balanced diet requires far less supplementation as the healthy foods supply the vitamins themselves.",
            "post_id": "6408314",
            "timestamp": "1291171017",
            "user_id": "user_233616",
            "user_link": "/personal_pages/user/233616",
            "votes": "0"
        },
        {
            "answer": "My primary care doctor monitors for both B and D vitamins, and has me supplement with both. I currently take 5000 units D¬¬3; I’ll discuss this with him again in mid December, and will try to post his thoughts then.--Bill",
            "post_id": "6408538",
            "timestamp": "1291175641",
            "user_id": "user_87972",
            "user_link": "/personal_pages/user/87972",
            "votes": "0"
        },
        {
            "answer": "Hmm… I was trying to subscript the ‘3’ in D3; formatting didn’t take, I see :o).",
            "post_id": "6408542",
            "timestamp": "1291175714",
            "user_id": "user_87972",
            "user_link": "/personal_pages/user/87972",
            "votes": "0"
        },
        {
            "answer": "I saw my PCP a month ago and asked her to run a test for my Vit. D level. It was at 20.3 - low by today's values-and this was after taking 800 IU's per day and spending plenty of time outdoors during the summer months. She recommended  that I up my dosage to 2000 IU's per day. I am seeing my liver Dr. next week and ask her about the level and dosage as well.",
            "post_id": "6409464",
            "timestamp": "1291209862",
            "user_id": "user_1477908",
            "user_link": "/personal_pages/user/1477908",
            "votes": "0"
        },
        {
            "answer": "IOM Report: Most North Americans Receive Enough Calcium, Vitamin DNovember 30, 2010 — Most North Americans receive enough calcium and vitamin D, according to a report containing updated dietary reference intakes that was released today by the Institute of Medicine.Catharine Ross, PhD, from Pennsylvania State University, in Philadelphia, chaired a committee of 14 experts appointed by the Institute of Medicine to assess current data of health outcomes associated with calcium and vitamin D intake.In the report issued today, the committee reviewed studies on the metabolism and physiology of calcium and vitamin D and their influence on health. Dietary reference intakes were determined using the estimated average requirement (EAR; the level at which 50% of the population's needs are met), recommended dietary allowance (level at which 95% of the population's needs are met), tolerable upper intake level, and adequate intake level.The suggested daily calcium EAR is 500 mg for children aged 1 to 3 years and 800 mg for those aged 4 to 8 years. Adolescents should consume at least 1100 mg calcium daily to support bone growth (the recommended dietary allowance for this age group is 1300 mg calcium/day). The EAR for women aged 19 to 50 years and men up to 71 years of age is 800 mg daily; for women older than 50 years and men older than 71 years, the EAR is 1000 mg, and the recommended dietary allowance is 1200 mg.The only group that did not meet EARs for calcium intake was girls aged 9 to 18 years. In contrast, most postmenopausal women met or exceeded recommendations with calcium supplementation; the report expresses concern that older women taking calcium supplements may be at increased risk for kidney stones. All groups met the EAR for vitamin D of 400 IU daily when considering dietary intake together with cutaneous synthesis from sun exposure, but not from food intake alone. As the committee highlights, this poses a challenging concern given the risk of skin cancer from sun exposure.The committee determined that risk for harm increases when consuming more than 2000 mg calcium or more than 4000 IU vitamin D daily.Several studies have reported widespread vitamin D deficiency in North American populations, which the committee attributes to inconsistent serum 25-hydroxyvitamin D cut-points that are often too high. The committee suggests that serum 25-hydroxyvitamin D levels of 50 nmol/L (20 ng/mL) are sufficient for all persons.The group concluded that there is insufficient evidence to link vitamin D intake with cancer, cardiovascular disease, type 2 diabetes, obesity, immune response, neuropsychological functioning, physical performance, falls, preeclampsia, or reproductive outcomes. However, this \"does not mean that future research will not reveal a compelling relationship between vitamin D and another health outcome,\" the committee writes.\"We could not find solid evidence that consuming more of either nutrient would protect the public from chronic disease ranging from cancer to diabetes to improved immune function,\" said Dr. Ross during a press conference about the new report. \"On the other hand, regarding bone health the amount of evidence that has been accumulating is really quite impressive.\"According to Dr. Ross, the take-home message to physicians is that now there has been a systematic, evidence-based review, and there is new evidence on which they should base their recommendations to patients.\"We are still very enthusiastic about [vitamin D] that regulates hundreds or even thousands of genes in the body,\" said panelist Glenville Jones, PhD, from the Queen's University, in Kingston, Ontario, Canada, during the press conference. \"What's missing is...a lack of translation of that information into public health recommendations.\"We have been quite amazed that the positive effects of vitamin D haven't been nearly as clear-cut as the advocates have suggested,\" he added.Dr. Ross pointed out that the recommendations are for total intake, both through diet and supplements. \"We think that many individuals will be able to obtain these recommended dietary allowances from diet, but we are not really specifying the source. A supplement may be appropriate for some age groups,\" she added.\"The major implications of this report are that after an extensive review of the data, the panel concluded that the strongest evidence was for the fact that vitamin D is helpful for bone health and reduction of fractures,\" said Sundeep Khosla, MD, president of the American Society on Bone and Mineral Research, in a telephone interview with Medscape Medical News.According to Dr. Khosla, the main thing clinicians can tell their patients is that there are now some very clear guidelines about calcium and vitamin D intake that are based on solid evidence. \"Vitamin D is hard to get from the diet, and the committee did not really advocate sun exposure because of risk of skin cancer, but it can be obtained through a multivitamin.\"Dr. Khosla added that it is important to note that \"the calcium level of 1000 to 1200 mg/day is to be obtained through diet plus supplement, and that each serving of a dairy product counts for 200 to 300 mg/day. If a patient is getting 4 servings of dairy product, they are probably getting enough calcium.\"Future research should focus on understanding the role of vitamin D in nonbone outcomes, he said.http://www.medscape.com/viewarticle/733318?sssdmh=dm1.651289&src=nldne&uac=39980BG",
            "post_id": "6409493",
            "timestamp": "1291210877",
            "user_id": "user_4336",
            "user_link": "/personal_pages/user/4336",
            "votes": "0"
        },
        {
            "answer": "Peary, not Perry.",
            "post_id": "6409564",
            "timestamp": "1291213148",
            "user_id": "user_96938",
            "user_link": "/personal_pages/user/96938",
            "votes": "0"
        },
        {
            "answer": "\"Google Admiral Perry expedition, they died because they ate Polar bear liver, which has way more of these vitamins then humans can tolerate. \"Where do you get this stuff from?  He lived to a ripe old age, for his time.",
            "post_id": "6409645",
            "timestamp": "1291215260",
            "user_id": "user_96938",
            "user_link": "/personal_pages/user/96938",
            "votes": "0"
        },
        {
            "answer": "Remember the acronym \"faked\" - meaning \"f\" for fat soluble vitamins (vitamins that your body will store in fat and that can become toxic) are the vitamins a, k, e, and d.Also, going out into the sun is great so long as you aren't covered head to toe in sun block ;).",
            "post_id": "6409799",
            "timestamp": "1291218018",
            "user_id": "user_1506542",
            "user_link": "/personal_pages/user/1506542",
            "votes": "0"
        },
        {
            "answer": "also remember while on tx you will most likely have to avoid sun becauseyour skin will be a lot more sensitive.if you are doing 48wks that`s a year in the shade ...on the other hand it takes a while to build up a good levelMy recommendation is check your VIT D level and bring it up withinyour lab reference. Personally i would go at least to 60-70That`s in the middle of my lab`s reference",
            "post_id": "6409894",
            "timestamp": "1291219767",
            "user_id": "user_979080",
            "user_link": "/personal_pages/user/979080",
            "votes": "0"
        },
        {
            "answer": "http://www.vitamindcouncil.org/vitaminDToxicity.shtml",
            "post_id": "6410271",
            "timestamp": "1291226758",
            "user_id": "user_979080",
            "user_link": "/personal_pages/user/979080",
            "votes": "0"
        },
        {
            "answer": "thanks for the way to remember which vitamins are not water soluble. I appreciate all the info from the people here. I did check with my PCP and she said the 1800 is's that I am taking is well lwithin the range of no harm. I will get my levels checked. It surprised me that my daughter, who is healthy, and spends her summers on the water, has very low levels of vitamin D. I guess it makes a difference how well the body makes it's own.",
            "post_id": "6410345",
            "timestamp": "1291227944",
            "user_id": "user_1464361",
            "user_link": "/personal_pages/user/1464361",
            "votes": "0"
        },
        {
            "answer": "Spoke to my doctor about this dilemma. Here's what he said \"If you are vitamin D deficient (your levels are low), you should take more than the required amount to bring the levels up. If you don't have a vitamin D deficiency, you should take the daily recommended dose only.Another interesting fact is that if you take multiple vitamins that already contain the daily suggested amount of vitamin D, you don't need to take extra doses. Keep in mind that milk, and many other products also contain vitamin D. Too much vitamin D can cause kidney stones, which is almost as painful as having a baby. Otherwise... it's up to you...Magnum",
            "post_id": "6410759",
            "timestamp": "1291234060",
            "user_id": "user_29837",
            "user_link": "/personal_pages/user/29837",
            "votes": "0"
        },
        {
            "answer": "\"Too much vitamin D can cause kidney stones, which is almost as painful as having a baby.\"Now Magnum, just how do you know this???  :-)",
            "post_id": "6411452",
            "timestamp": "1291246053",
            "user_id": "user_1464361",
            "user_link": "/personal_pages/user/1464361",
            "votes": "0"
        },
        {
            "answer": "Well, er, uh, hmmm. Spoke to a friend who passed a kidney stone and nearly wrote a suicide note. I would imagine some women feel like that when having a baby?Mag",
            "post_id": "6411978",
            "timestamp": "1291256600",
            "user_id": "user_29837",
            "user_link": "/personal_pages/user/29837",
            "votes": "0"
        },
        {
            "answer": "I bet you're right. I never passed a kidney stone but passing two babies almost 9 pounds was pretty painful.",
            "post_id": "6413390",
            "timestamp": "1291300945",
            "user_id": "user_1464361",
            "user_link": "/personal_pages/user/1464361",
            "votes": "0"
        },
        {
            "answer": "I had another Vit. D test run today, this time by my liver doc and it had only crept up to 23 from 20.3 in September after upping my dose to 2000 IU per day. She wrote me an Rx for 50,0000 IU's per week for 6 weeks and then a retest. I almost choked on the amount and had to clarify three times that it was 50 thou and not 15 thou. They want to see my level in the 50's and she said they need to hit it hard and then cut back. I asked about sx and she said maybe constipation, but the trade off could be less joint pain. :-/ I'm anxious to see if that is the case.Has anyone else done this high of a dose?",
            "post_id": "6431194",
            "timestamp": "1291777000",
            "user_id": "user_1477908",
            "user_link": "/personal_pages/user/1477908",
            "votes": "0"
        },
        {
            "answer": "Mixed Picture for Vitamin D Status in Frail ElderlyBy John Gever, Senior Editor, MedPage TodayPublished: December 08, 2010Both high and low levels of vitamin D were associated with frailty in elderly study participants, suggesting a more complex relationship between vitamin D and health status than has been commonly thought, researchers said.There was a U-shaped relationship between measures of frailty and serum levels of 25-hydroxyvitamin D (25-OH-D) in more than 6,000 women older than 68 in the Study of Osteoporotic Fractures, conducted by Kristine Ensrud, MD, MPH, of the University of Minnesota in Minneapolis, and colleagues.Among those with serum levels of at least 30 ng/mL -- the standard upper limit of normal -- the multivariate odds ratio for frailty was 1.32 (95% CI 1.06 to 1.63), the researchers reported in the December issue of the Journal of Clinical Endocrinology & Metabolism..The increased risk was similar to that seen in participants with serum 25-OH-D below 15 ng/mL (multivariate OR 1.47, 95% CI 1.19 to 1.82).On the other hand, among participants who weren't frail at baseline, only low 25-OH-D levels were associated with adverse outcomes during the study's average of 4.5 years of follow-up.Previous studies of vitamin D status and frailty \"have assumed a linear inverse association\" between them, the researchers noted.Ensrud and colleagues suggested that their findings highlight the importance of prospective, randomized trials of vitamin D supplements before they can be recommended for individuals with serum 25-OH-D levels already in or above the normal range.In an accompanying editorial, two independent researchers said that, in the interim, the most prudent approach in elderly patients is to use supplements when necessary to achieve serum 25-OH-D levels in the normal range of 20 to 30 ng/mL.Those levels can reasonably be accepted as \"safe as well as efficacious,\" wrote Clifford J. Rosen, MD, of Maine Medical Center in Scarborough, Maine, and JoAnn Manson, MD, DrPH, of Brigham and Women's Hospital in Boston.The multicenter study was a longitudinal project that began in 1986 with an original enrollment of some 9,700 women 65 and older. After six years, surviving participants were invited for a detailed follow-up examination. Another such exam was offered at year 10.Ensrud and colleagues focused on 6,307 participants who attended the year six exam, considered the baseline in the current analysis. Of those women, 4,551 were not frail and completed the year 10 exam or were known to have died.Frailty was assessed on five criteria: body weight loss of at least 5% since the previous exam, grip strength in the lowest quintile, self-reported lethargy, walking speed in the lowest quintile, and weekly walking duration in the lowest quintile.Participants with poor scores on at least three components were considered to be frail. Those with indications of frailty on one or two components were classified as intermediate.At baseline, 35% of the women were considered robust, 48% were in the intermediate stage, and the remaining 17% were already frail.The researchers determined that no single component of the frailty index appeared to drive the overall relationship between frailty classification and 25-OH-D levels. All five components were increased in those with levels below 15 ng/mL, and three of the five -- body shrinkage, gait slowness, and low activity level -- were increased in those with higher than normal levels.Participants could take vitamin D if they wished, and 42% chose to do so. More than two-thirds of women with 25-OH-D levels of 30 ng/mL or more were taking supplements, versus 49% of those in the normal range and 15% of those with levels below 15 ng/mL.These data raise the possibility that women who were already frail might have tried to compensate by taking supplements, thereby accounting for the increased rate of baseline frailty seen in those with higher 25-OH-D levels.However, Ensrud and colleagues noted, the U-shaped relationship between frailty status and 25-OH-D levels was also apparent in the participants not taking supplements, as well as in the entire cohort.Among the 4,551 participants not frail at baseline, 16% were classed as frail at their next exam and 9.5% had died.Levels of 25-OH-D that were out of the normal range showed small to modest, mostly nonsignificant relationships with incident frailty or death in multivariate analysis.The largest effects were seen for death in participants with low 25-OH-D. The adjusted odds ratio for death versus survival was 1.40 in patients with 25-OH-D below 15 ng/mL (95% CI 1.04 to 1.88).When 25-OH-D was categorized in quartiles, the risk of death was increased in the two lowest quartiles relative to the third by about 40% to 50%.There was also a trend toward increased risk of death or frailty versus classification as robust or intermediate in the two lower quartiles.High 25-OH-D levels, defined as either 30 ng/mL or more or as the highest quartile, did not appear associated with increased risk of incident frailty or death.Although Ensrud and colleagues were able to adjust for such factors as age, body mass index, smoking, education, and comorbidities in their calculations, they acknowledged that unmeasured confounders may still have been present.Other limitations included the study's exclusion of nonwhite women and the nonrandom use of vitamin D supplements.http://tinyurl.com/2agodes",
            "post_id": "6436055",
            "timestamp": "1291904717",
            "user_id": "user_4336",
            "user_link": "/personal_pages/user/4336",
            "votes": "0"
        },
        {
            "answer": "Thanks Mike. So interesting.",
            "post_id": "6436076",
            "timestamp": "1291905092",
            "user_id": "user_1464361",
            "user_link": "/personal_pages/user/1464361",
            "votes": "0"
        },
        {
            "answer": "To the questions…first let's congratulate each other on at least trying to ferret out the importance of these vitamins, and which drugs, vitamins, minerals, etc. might be helpful or hurtful.I get my Vitamin D checked regularly now, along with calcium, and suggest others do the same.A. .I know about D causing stones because of the work of Dr. Norman who is a top surgeon on parathyroid tumors.Most endocrinologist were not trained in how the body works regarding all this which he tries to remedy on his site.However MY SURGEON at OHSU also confirmed that the excess D could cause stones.Dr Norman’s work has been confirmed by others, note his reference to New England Journal of medicine, his primer on D points out that excess D can indeed lead to kidney stones, which is why I am offering the link. http://parathyroid.com/low-vitamin-d.htm...you’ll note that it is high D in the presense of high calcium that can cause this, Although, in my case, and in about 10% of cases, this happens without being considered high.Note, my hepatologist shrugged and did not think it needful to check me for parathyroid, my calcium was only at 10 or 10.5…It took going to 8 docs in all before resolving this, and they forced me to take extra D in SPITE of me printing out the page, above link, and showing it NOT ONE, but TWO endocrinologist…so this is NOT common knowledge….the end result….I got kidney stones…just as Dr. Norman predicted I would. This is but one case, mine…I leave it to the reader to decide which doctors were more informed.(It’s more complicated than any of you realize. For one thing D alone does not absorb well…it needs to be in a ration of 1 to 8 or there about with vitamin A to be absorbed well, another factor is the amount of calcium, magnesium in the meal at the time, the vitamins won’t absorb when the minerals are not present, and the reverse is also true. Taking larger and larger dose to compensate for a bad diet is not the optimal approach therefore. Eating things rich in nutrients is a better approach. Local foods, freshly picked and grown organically offer the best opportunity to solve the vitamin depletion. Eating the nutrient poor bad foods depletes us. White flour and sugar for instance have no nutrient value other than carbs…they have no vitamins or minerals to speak of.)(of course if we eat a lot of junk foods, then at least a supplement will help us to not get as sick as fast...but that's for another day maybe).I’m not saying don’t take vitamins, just not to take megadoses, your body was not designed to handle megadoses.B. I know about having babies, having experienced natural childbirth, and having been ripped apart by kidney stones…between to 2 I’d prefer another birth, and I was in labor 52 hours with my son…however at the end, I had something to show for it, a son…not so with kidney stones, just pure pain with nothing to show for it but shedded body parts.C. Admiral Peary (sorry I mispelled) had several men on his crew die. I though he succoumbed as well…but when I went and looked it up discovered he did not, but his men did.I learned of the connection in study for school, it was part of nursing and nutrition class at that time, and still to this day the info is available, the theory was that the ones who died had eaten the most polar bear liver, this later was confirmed in animal studys, that too much A and D are toxic to non-bears..  Because the polar bear must hibernate their liver is designed differently, and they can store far more of these vitamins than the average animal liver does without any apparent ill effects. Although all livers store these vitamins so that we creatures can make it through lean times (its a very important vitamin), too much can be hepotoxic, unless you happen to be a polar bear, which last I looked, wasn't us!!Just because someone has never before heard what I’ve “come up with” does not mean it’s not true or I got it off some cracker box.In other words,That one has not been informed, does not mean that I’m a wacko.mb",
            "post_id": "6540192",
            "timestamp": "1294882298",
            "user_id": "user_233616",
            "user_link": "/personal_pages/user/233616",
            "votes": "0"
        },
        {
            "answer": "thanks to this forum, I have now received a vitamin d test, awaiting results.",
            "post_id": "6540297",
            "timestamp": "1294884766",
            "user_id": "user_1360772",
            "user_link": "/personal_pages/user/1360772",
            "votes": "0"
        },
        {
            "answer": "The problem with the Polar Bear liver consumption analogy is that no one is recommending a supplement of anything near that much.  And it is not clear whether it was vast overcunsumption of Vitamin A or Vitamin D which did them in.It is pretty clear that the earlier RDA of 200 IU was far too low.  Now they seem to have decided that 2000 IU daily is a better level.   When more information is developed, I suspect it will be increased further to about 5000 IU, after the base level has been established.",
            "post_id": "6542786",
            "timestamp": "1294950177",
            "user_id": "user_1434407",
            "user_link": "/personal_pages/user/1434407",
            "votes": "0"
        }
    ],
    "post_id": "6408025",
    "question": "OK, now I'm really confused. I've been taking Calcium with 800 ius vitamin D daily. I decided to up my intake of D in preparation for upcoming treatment. So I started adding another 1000 iu's. Of course, lazy me, I did this without checking my levels but I figured if everyone is so low I must be as well. Today I hear that we are taking too much vitamin D and it is not healthy. They also are thinking of lowering the bottom of the normal range from 30 to 20. What is everyone doing?",
    "timestamp": "1291166174",
    "title": "Vitamin D ?",
    "user_id": "user_1464361",
    "user_link": "/personal_pages/user/1464361"
}