{
    "answers": [
        {
            "answer": "As sited from babyhopes.comEvening Primrose Oil (EPO) - Its Role In Trying to ConceiveWhat is Evening Primrose oil or EPO?Evening Primrose Oil is the oil derived from a North American wildflower called Evening Primrose. Evening Primrose is not really a primrose, but it gets its name from that flower because the plant looked similar to an English Primrose. The oil is rich in Vitamin E just like olives and nuts are. In addition, evening primrose oil also has gamma linolenic acid (GLA), an essential fatty acid. People that have difficulty creating in this fatty acid in their own bodies can benefit from its use.The Europeans were one of the first to make it popular. They brought it back to their native soil and crowned this oil a “King’s cure-all” because of its many useful properties that can cure a large number of diseases. In England, the oil is approved for use with eczema and high cholesterol. In women, it can especially be helpful for relieving breast pain, menstrual pains and improving the quality and fertility of cervical mucus.How does Evening Primrose Oil help you in getting pregnant?Evening Primrose Oil or EPO lowers cholesterol, helps to alleviate premenstrual syndrome symptoms and aids in the production of fertile quality cervical fluid. Evening Primrose Oil or EPO does a world of good in treating aliments of all sorts. Evening Primrose Oil or EPO is an essential fatty acid that contains gamma linolenic acid (GLA). This gamma linolenic acid (GLA) is converted to a hormone-like substance called prostaglandin E1 which has anti-inflammatory properties and may also act as a blood thinner and blood vessel dilator. These anti-inflammatory properties of evening primrose oil help people suffering from pains, aches and cramps.Evening Primrose Oil or EPO also has effects on premenstrual syndrome symptoms and cervical mucus. If you suffer from premenstrual syndrome, it could be because you are deficient in the fatty acid, gamma linolenic acid (GLA). Evening Primrose Oil or EPO can help your body to alleviate the premenstrual syndrome symptoms by replacing the gamma linolenic acid (GLA).Evening Primrose Oil or EPO helps women to produce more fertile quality cervical fluid also known as “egg white cervical mucus”. This type of cervical fluid is fertile, thin, watery, clear and “stretchy” and easily aids the sperm to swim through the uterus and into the fallopian tube, and to the egg. Also, this type of fluid helps the sperm to stay alive for up to five days inside the fallopian tube, thus enabling conception to happen even if you don’t have intercourse again by the time ovulation occurs.If your cervical fluid is thick, brown or dry, it can obstruct or prevent fertilization. Some women are very dry, and have problems in producing an adequate amount of fertile quality cervical fluid. Drinking a lot of water and taking the Evening Primrose Oil or EPO can certainly help in the production of fertile cervical fluid in these women.What is the dosage for Evening Primrose Oil or EPO?Evening Primrose Oil or EPO should only be taken from menstruation to ovulation. This is because Evening Primrose Oil or EPO can cause uterine contractions in pregnancy. The dosage taken should be 1500mg to 3000mg per day. Since essential fatty acids are necessary, you can take flax seed oil in place of Evening Primrose Oil or EPO after ovulation. This may be taken throughout pregnancy as well.There are many remedies out there to help with fertility, but few are as good as Evening Primrose Oil or EPO. Evening Primrose Oil or EPO is excellent for women because of the help it gives in alleviating premenstrual syndrome symptoms, and even menopausal women can benefit from taking it. There are a large number of women who will vouch for Evening Primrose Oil or EPO as a great agent to increase the fertile type cervical fluid.Like all herbs, the use of Evening Primrose Oil or EPO can take a month or two to build up, and produce the results you are looking for. It is essential that you chart your fertility symptoms and signs, so you can know when you have ovulated. By knowing this information, you can discontinue the Evening Primrose Oil or EPO after ovulation and start the flax seed oil. Unless you are very regular, charting your fertility signs is the best tool to determine where you are in your cycle.",
            "post_id": "3592091",
            "timestamp": "1225317029",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "sited from early-pregnancy-tests.comFrom Evening Primrose Oil to Pre-SeedFertility, Cervical Mucus, and EPOEvening primrose oil (EPO) is a favorite fertility aid for women. Historically considered a medicinal \"cure-all\", evening primrose oil is one of the more popular herbal supplements for female hormonal balance and fertility. Women who are trying-to-conceive use evening primrose oil to improve the quality of cervical mucus - or make the cervical mucus more fertile. However, evening primrose oil offers a wide array of purported benefits, including treating many ailments like breast pain, hot flashes, premenstrual symptoms (PMS), skin disorders, rheumatoid arthritis, and hormonal imbalance.The Evening Primrose is a wildflower (not actually a primrose, though it is similar in appearance). Evening primrose oil is derived from the seeds of the plant. Like other nuts and seeds (for example, flaxseed), evening primrose oil is rich in essential fatty acids and vitamin E. In addition, evening primrose oil also offers a high concentration of specific essential fatty acids, including Linolenic acid and gamma linolenic acid - or GLA.. Gamma linolenic acid is used in the body to produce prostaglandins (chemicals similar to hormones) which are important for a number of key body functions. Our evening primrose oil offers a very concentrated source of the fatty acid gamma linolenic acid with 10% of the oil's fatty acids available in the form of GLA.As Dr. J Lee notes, \"[It's the] remarkably rich stores of GLA in evening primrose oil [that] make it so valuable in healing. Taken internally, the body converts GLA into prostaglandins. These hormone-like compounds help regulate various body functions, controlling inflammation in some cases and promoting it in others. The prostaglandins produced from GLA fall into the anti-inflammatory category. Cell membranes also rely on the presence of GLA.\" As noted above, gamma linolenic acid is converted by the body into a hormone-like substance called prostaglandin which has anti-inflammatory properties.Evening Primrose Oil, Infertility, and CM (Cervical Mucus)How is Evening Primrose Oil used to increase fertility? A good question. For women who are trying-to-conceive, one of the benefits of evening primrose oil is that it may increase the quality of cervical mucus, making it a more fertile medium for sperm. To clarify this, we need to understand how cervical mucus contributes to fertility. One of the purposes of cervical mucus - during the fertile period when a woman ovulate - is to sustain sperm in a healthy medium, and to allow sperm to move freely through the cervix. When a woman ovulates, there should be an increase in cervical mucus, as well as a change in mucus texture - the mucus becoming more pliable, \"stretchable\", and slippery. This is \"fertile\" cervical mucus. You will often hear it compared to \"egg-whites\".The issue is that some women do not produce sufficient cervical mucus and/or cervical mucus that has infertile qualities. This latter type of cervical fluid is called \"hostile cervical mucus\". If the cervical mucus is absent, or does not provide a fertile, fluid medium for sperm, then the odds of conception may be decreased, as sperm do not have a fertile environment to propel or sustain themselves.Evening Primrose Oil helps women produce fertile quality cervical fluid, or \"egg white\" cervical mucus. This variety of cervical fluid is fertile, thinner, watery, more clear than cloudy, and stretchy or stretchable. It easily aids sperm in transport through the uterus and into the fallopian tube, and to the egg. Fertile cervical fluid helps sperm remain alive and mobile for several five days inside the uterus and fallopian tube, enabling conception to take place, even if ovulation occurs days after intercourse. The lubricant Pre-Seed (or Preseed) also offers a sperm-friendly transport medium that mimics natural body secretions and cervical fluids.Hostile Cervical Fluid, Evening Primrose Oil, and Pre-SeedHostile cervical mucus: If cervical fluid is thick or dry or a cloudy brown, it can obstruct the passage and moment of sperm and prevent fertilization. Many women experience the problem of dryness, and have issues producing fertile quality cervical fluid. Evening Primrose Oil has been shown to help in the production of fertile cervical fluid in such circumstances. Alternately, Pre-Seed is a non-supplement alternative to Evening Primrose Oil.Note that Evening Primrose Oil should only be taken from menstruation to ovulation, as EPO may cause uterine contractions. The dosage taken should be 1500mg to 3000mg per day. Since essential fatty acids are important, you can take flax seed oil in place of Evening Primrose Oil after ovulation takes place.",
            "post_id": "3592095",
            "timestamp": "1225317082",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Benefits of Fish OilAs sited from http://www.cbn.com/health/naturalhealth/drsears_fertility.aspxEven if you don’t suffer from infertility, high-dose fish oil is the most important supplement you can take during pregnancy for several reasons, but most importantly for the development of the child’s brain. Long-chain Omega-3 fatty acids are critical for fetal brain development to provide your child the best possible mental advantage coming into this world. The fetus’ need for DHA is greatest in the last trimester of the pregnancy as fetal brain cells are being created at a prodigious rate (more than 250,000 nerve cells per minute). If you don’t have adequate supplies of DHA in your body, your fetus’ brain is going to have trouble keeping up with the growing demand for DHA building blocks. Thus, pregnancy is a critical time to take fish oil supplements.Fish oil can also help pregnant women avoid two serious conditions that can occur during pregnancy: pregnancy-induced hypertension (pre-eclampsia) and gestational diabetes. Both of these conditions can be treated either by lowering insulin levels (gestational diabetes) or by decreasing the levels of “bad” eicosanoids (pre-eclampsia). To accomplish the first goal, pregnant women need to consume an optimal ratio of carbohydrates to protein. To accomplish the second, they need to take ultra – refined EPA / DHA fish oil concentrate supplements.Thus, the best diet to accomplish both goals and also provide adequate levels of DHA is one following my dietary recommendations. If you are pregnant you should be consuming extra calories beyond a typical woman’s nutritional needs—on the order of about 300 calories more a day. This simply means using a slightly larger plate at each meal, but still keeping the correct balance of foods. (Alternatively, you can consume an extra two or three glasses of low-fat milk every day, since milk has the appropriate balance of carbohydrates to protein.) Following my dietary plan during pregnancy will ensure adequate protein for both you and your fetus, and the increased consumption of fruits and vegetables will supply the necessary micronutrients for both. It’s never too late in your pregnancy to go on my dietary program—because your fetus actually gets the biggest benefits during the last trimester.After giving birth, new mothers should keep supplementing their diet with high-dose fish oil to lower their risk of getting post-partum depression. After birth, the levels of long-chain Omega-3 fatty acids (especially DHA) drop dramatically in the mother’s blood. This is similar to the decreased levels of long-chain Omega-3 fatty acids that are observed in depressed patients. By supplementing her diet with adequate levels of high-dose fish oil, a new mother can avoid that drop in long-chain Omega-3 fatty acids, and thus will likely avoid any resulting depression. Supplementation with ultra - refined EPA / DHA fish oil concentrate is also important for the mother who is breast feeding her child to maintain the DHA levels in her breast milk that are crucial for the development of a young baby’s still rapidly growing brain",
            "post_id": "3592139",
            "timestamp": "1225317547",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Vitamin C for menas sited from http://www.bellaonline.com/articles/art32665.aspVitamin C (1000mg) per day raised sperm counts by 140% in the first week in one study and 200 mg increased sperm counts by 112% in the first week. After 60 days the 200 mg group had caught up with the 1000mg group. All of these men had impregnated their wives by the end of the study",
            "post_id": "3592159",
            "timestamp": "1225317785",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "more Fish OilAs sited from http://www.bellaonline.com/articles/art32665.asp•Essential fatty acids (EFA) (1-7 grams per day) can help the health of your reproductive system, insulin levels, heart and brain. EFA reduce inflammation throughout the body (a possible cause of PCOS and other types of infertility) and promote overall health. The best source is purified fish oil (don’t take cod liver oil as it is too high in vitamins A & D and may prove toxic).",
            "post_id": "3592161",
            "timestamp": "1225317858",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "ok. I have NO IDEA how to cut and paste the info for pre-seed :)  I do know that it was developed by a fertility DR. to help the little swimmers get where they need to go.  I also just know by reading so many sites about what people did different to get their BFP and SO many said Pre-seed.",
            "post_id": "3592302",
            "timestamp": "1225319875",
            "user_id": "user_551885",
            "user_link": "/personal_pages/user/551885",
            "votes": "0"
        },
        {
            "answer": "I would post a link to my findings but MedHelp has told me they will freeze my account if i do that. so I will copy and paste as they have asked me to. there is so much info about taking fish oil during pregnancy. i am still trying to find the website that informs you to take fish oil over flax seed to get your omega-3Omega 3 During PregnancyIn the past decade or so, the importance of Omega 3 during pregnancy has been acknowledged. It is now known that Omega 3 actually plays a large role in the development and growth of your baby when it is in your uterus. Omega 3 helps to:* build the brain* form the retinas* develop the nervous systemOmega 3 is also necessary for your own pregnancy health and wellbeing. Omega 3 helps to:* reduce your chances of developing preeclampsia* reduce your risk for postpartum depression* minimize the chance of preterm labor.Omega 3 Deficiency During PregnancyHaving an Omega 3 deficiency while you are pregnant can prove very harmful to you and your baby. Your baby takes Omega 3 from the foods that you eat. The nutrients cross the placenta, helping your baby to grow and develop. However, if your baby does not get enough Omega-3 from the food you eat, he will begin to take it from your own stores. Researchers believe that these stores may be located in the brain, which can result in a loss of up to 3% of your brain cells. Omega 3 deficiency during pregnancy is linked with:The Future Benefits of Omega 3Taking Omega 3 during pregnancy has also been proven to help you and your baby out in the long run. Recent studies were performed on infants who were exposed to adequate levels of Omega 3 while in the womb. These babies showed advanced attention spans and greater visual acuity than non-exposed children. Their development was also two months ahead of non-exposed children. Other Omega 3 benefits include:During pregnancy, it is recommended that you get at least 250 mg of Omega 3 every day. However, Omega 3 oils are especially important during the final trimester. It is during this time that your baby uses Omega-3 to form approximately 70% of her brain system. She is also working on the rest of her nervous system.Good Omega 3 SourcesOmega 3 is best found in fish and fish oil products. High levels of Omega 3 are found in:* oily fish, like mackerel, herring, sardines, anchovies, salmon, and pilchards* Omega 3 fish oil supplements* fresh or frozen tunaOmega-3 supplements are available but check to make sure that your supplements are not made from fish livers. The liver can contain high amounts of retinol vitamin A, which has been linked to birth defects. Omega-3 supplements not derived from fish livers but rather from the body of the fish are less likely to contain this type of vitamin A. If you would prefer to err on the side of caution, you can always look for supplements that are made specifically for pregnant women.",
            "post_id": "3592308",
            "timestamp": "1225319905",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "Omega-3 and Pregnancy- Fish oil over flax seedPregnant women are often told to take fish oil capsules but must be careful to get the best quality, instead of cheap, generic stuff. The cheap fish oil may come from fish with contamination and may not be free of pollutants. Women should be careful about the types of fish and fish oil they consume when they are pregnant, nursing, or even when experiencing pregnancy symptoms.Flaxseed oil does have omega-3 in it and is preferred by some people however some doctors say flaxseed oil should not be taken by pregnant women.The reason is that flax seed, like soy or even more so, seems to have an effect on estrogen and hormones and might interfere with your body during pregnancy. Ask your doctor.One study on this was: Brooks JD, Ward WE, Lewis JE, et al. Supplementation with flaxseed alters estrogen metabolism in postmenopausal women to a greater extent than does supplementation with an equal amount of soy. Am J Clin Nutr 2004;Feb, 79(2):318-325.Also, flaxseed oil does not have as high an amount of DHA as fish oil, so fish oil is just better anyway at giving you the DHA you want.Meanwhile, fish oil has been found in some studies to greatly support pregnancy and healthy baby development, and may even help prevent miscarriage. This is very, very important.One such study was: Rossi E, Costa M., Fish oil derivatives as a prophylaxis of recurrent miscarriage associated with antiphospholipid antibodies (APL): a pilot study. Lupus 1993;2:319-23.Conclusion: Pregnant women should talk to their doctors about avoiding flaxseed oil and also taking the most pure fish oil pills on the market.If you want the best fish oil you should buy single-source fish oil, such as hoki fish oil capsules. And you should look for a pharmaceutical grade product that comes from healthy fish caught in pristine clean waters, then is quickly processed for purity and packaged under strict pharmaceutical conditions.What you do not want is some cheap oil from a motley collection of \"mystery fish\" caught in the polluted waters of some industrialized area, that has sat in unrefrigerated tanker ships and trucks while it traveled some long distances in the heat, then was packaged in less than pharmaceutical conditions. Can you say \"Burp?\" Don't go near that stuff.",
            "post_id": "3592334",
            "timestamp": "1225320378",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "here we go Dani-Trying to conceive (TTC) is a big issue. At least 90 million couples worldwide, 11 million in the US alone, are trying to become pregnant. With only a 20% average chance of becoming pregnant each cycle, it's no surprise that couples can become stressed.Intercourse on demand around ovulation can lead to anxiety and increased vaginal dryness. In fact, 75% of TTC couples report an increased frequency of vaginal dryness.In relieving vaginal dryness, couples do not want to create another problem. However, most personal lubricants and even saliva can harm sperm.  Research conducted on personal lubricants over the past three decades has clearly demonstrated their detrimental effects on sperm.",
            "post_id": "3592340",
            "timestamp": "1225320581",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "more for Dani- i forgot to say in the last post that it was for pre-seed lubricantPre~Seed   Intimate Moisturizer provides moisture inside, where you need it most, without harming sperm. For use even while trying to conceive – a time of increased vaginal dryness when other products should be avoided due to their detrimental effects on sperm.Pre~Seed  is the right solution for YOUR vaginal dryness.pH balanced to match fertile cervical mucusPatented, one-of-a-kind formula does not harm spermContains arabinogalactan for antioxidant supportInternal application coats vagina & cervixClinically tested and doctor recommended",
            "post_id": "3592348",
            "timestamp": "1225320733",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "So at GNC I bought GNC Softcap Fish Oil, 300mg total, and Coral Calcium.  GNC has a prenatal vit pack that includes DHA and extra calcium.  I already had the prenatals at home, so I just bought the supplements.  I think it's cheaper that way, for now.  You should have seen the look on my DH's face when I brought the bag in the house.  He said \"You're not making me take MORE **** are you\".  I told him no, these are for me.  I'm still having him take a 1000mg of flaxseed, do you know anything about males and flaxseed vs fish oil.  I hate to abandon the flaxseed, since I've spent money on it.  But will the fish oil help his swimmers more?  Oh, and how much Fish Oil do you think I should take?  During the whole cycle, or just when I'm not doing the EPO (like I do the flax seed)",
            "post_id": "3592577",
            "timestamp": "1225324138",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "I just saw your post on the folic acid.  My prenatal has 800mg and I just bought another 400mg supplement this afternoon.  I agree, from what I have read and what the GNC guy told me (how reliable is that?) you will pee out the extra.",
            "post_id": "3592593",
            "timestamp": "1225324362",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Pre-Seed infoSited from:  http://www.early-pregnancy-tests.comPre-Seed is the first and only “Sperm-Friendly\" Intimate Moisturizer that replenishes your natural moisture while providing an optimal environment for sperm. Pre-Seed’s moisture mimics natural body secretions to relieve vaginal dryness - with the same pH and osmolarity as semen. Pre~Seed also protects cell function and acts as an \"antioxidant\" - supporting both conception and pleasurable intercourse. Click here to read our chat with Dr. Joanna Ellington, inventor of Pre~Seed, to find out why it's the only lubricant suitable for trying to conceive purposes!",
            "post_id": "3592705",
            "timestamp": "1225326418",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "More Pre-Seed infoSited from:  http://www.babyhopes.comCustomer ReviewsAuthor: Kimberly and Mark YI just wanted to let you know that my husband and I purchased Pre-Seed through your website in November. It arrived just in time for us to try it out for that cycle and we ended up getting a BFP! I am now 9 1/2 weeks pregnant with our first child and we really attribute the success of that cycle to Pre-Seed. (The baby dust you sent must have really been blessed!)Thank you!Kimberly and Mark YAuthor: Michelle B.My husband and I tried like crazy to have a baby. Finally, I ordered your product, Pre-Seed, and that same month we found out I was pregnant. Thank you for making my baby wishes come true. Everyone who is having problems conceiving should try this product. It is worth the money and so much more. It will change your life.Sincerely, Michelle B.Author: LindseyI just wanted to say what a great product Pre-seed is. My husband and I tried for a month without it and no luck so we just decided to try using Pre-seed to see if it would make a difference and sure enough it worked on the first try using it. I am now 11 weeks pregnant and could not be happier. Thank you!Author: Amy S.I began using pre-seed in September 2007 and in January 08 I was 6 wks pregnant with my first child. I now have a beautiful baby boy. Your website is wonderful and the products you endorse really work",
            "post_id": "3592715",
            "timestamp": "1225326593",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "More . . . Pre SeedSited from:  http://www.ovulation-calculator.com/pre-seed.htmSo what's the Pre-Seed difference? What makes Pre-Seed unique is that other lubricants like KY or Replens act as a barrier to conception. See the diagram below. Pre-Seed lubricates and moisturizes - and at the same time provides a healthy environment for sperm to move, survive, and make their way to the ovum. Traditional lubricants may lubricate, but in doing so they set up an obstacle course to bog down sperm and hinder (or at least decrease the chance of) conception.The Problem of DrynessIf you are TTC, then you know that trying to conceive is a big issue. At least 90 million couples worldwide, 11 million in the US alone, are trying to become pregnant. With only a 20% average chance of becoming pregnant each cycle, it’s no surprise that couples can become stressed. And stress leads to dryness!Yes, \"intercourse on demand\" prior to ovulation can lead to anxiety, frustration, and increased vaginal dryness. In fact, 75% of ttc couples report an increased frequency of vaginal dryness.In relieving this common problem, couples do not want to create another problem: the \"sperm blockade\" caused by other lubricants. Indeed, personal lubricants and even saliva can harm sperm. Research conducted on personal lubricants over the past three decades has clearly demonstrated their detrimental effects on sperm.The Pre-Seed SolutionPre-Seed lubricant is the first \"sperm-friendly\" intimate moisturizer that mimics natural body secretions for an optimal sperm environment. Safe, effective, and designed to support both conception and trying-to-conceive pleasure!Pre~Seed Fun Facts- Designed by women reproductive physiologists!- pH balanced to semen (imitates natural body secretions)!- Manufactured in a FDA registered facility!- Available as single use applicators to be applied before making love for enhanced spontaneity!Technical Notes On Pre-SeedPre~Seed is the first “sperm-friendly\" Intimate Moisturizer that mimics natural body secretions to relieve vaginal dryness while providing an optimal sperm environment. Pre~Seed’s moisture is delivered in a fluid with the same pH and osmolarity as semen, so as not to harm sperm.Additionally, Pre~Seed contains a naturally occurring plant sugar (arabinogalactan) which protects cell function, including having antioxidant-like activity. Antioxidant levels can be severely decreased in semen from men with fertility problems (see Reference Library)Available as single use applicators which can be applied before making love for enhanced spontaneity. Pre~Seed comes in convenient single use vaginal applicators to coat the vagina and external cervix to replenish nature's moisture without harming sperm even while trying to conceive – a time of increased vaginal dryness when other personal lubricants should be avoided.Pre-Seed Testing Specifications:pH between 7.2 and 7.5Osmolarity between 300 and 380 mOsmo/kgNo harm to Mouse Embryos: assures that greater than 85% of one cell mouse embryos develop to the blastocyst stage when cultured with Pre~Seed. This analysis is the FDA test for all media solutions used in assisted reproduction such IUI or IVF. Sperm-friendliness: freshly ejaculated human sperm are cultured with Pre~Seed in media, and the percentage of sperm that swim must be equal to 85% or greater of sperm in IVF media alone (which is less thick).How Do Other Lubricants Damage Sperm?The optimum pH value for sperm migration and survival in the cervical mucus is between 7.0 and 8.5 (World Health Organization guidelines). Sperm are very sensitive to low (acidic) pH and, to a lesser extent, elevated (alkaline) pH. Below pH levels of 6.9, sperm die at a rate that increases with lowering pH. Sperm are also sensitive to both high and low osmolarities (ion concentration in solution) because these can cause them to either shrink or swell beyond their \"critical volume limits\". A physiologic osmolarity* around 360 mOsm/kg (that of semen) is best for sperm function.",
            "post_id": "3592727",
            "timestamp": "1225326824",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "okay i have just a few little bits to add:Fish oil   i was taking a prenatal with fish oil so im not sold on preventing m/c but i take it as just fish oil now. if you read the bottle make sure it says the oil has been purified to remove mercury, PCBs and Dioxins. mercury toxicity will make you crazy (mad hatters disease) i got the grocery store brand and it is fine.Prim rose you may want to stop after conception because you need extra cholesterol to make hormones for you and your baby but if your chol is high in the first place it may not hurt just ask the dr mine told me no.Folic acid   dont take too much it can cause problems. it is water soluble but  too much of anything can be dangerous. According to the National Academy of Sciences, the daily intake of folic acid in adults should not exceed 1,000 mcg (that is 0.1MG). Very high doses of this vitamin offer no additional therapeutic value. Very high doses (above 15,000 mcg or 15MG) can cause stomach problems, sleep problems, skin reactions, and seizures. Zinc, estrogen, anticonvulsant drugs, barbiturates, and sulfasalazine may not be absorbed as effectively when combined with folic acid.just a heads up on some things. sorry im a little neg. it all sounds good but moderation is the key",
            "post_id": "3593440",
            "timestamp": "1225337092",
            "user_id": "user_662447",
            "user_link": "/personal_pages/user/662447",
            "votes": "0"
        },
        {
            "answer": "sometimes there is conflicting info on the net about ... well, just about everything!!!! Grrrr...ok so I read up about Folic acid. this is what i foundwikipedia-   A 10000-patient study at Tufts University in 2007 concluded that excess folic acid worsens the effects of B12 deficiency and in fact may affect the absorption of B12.webMD-  Government guidelines recommend that all women who are of childbearing age get at least 400 micrograms (mcg) of folic acid each day. You'll also need to take this amount every day when you are trying to get pregnant and for the first three months of your pregnancy.If you are already pregnant, you'll need to increase the amount of folic acid to 600 mcg. And while you are breastfeeding, you should get at least 500 mcg of folic acid daily.If you have already had a child with spina bifida or anencephaly and are trying to get pregnant again, you will need much more folic acid -- 4,000 mcg beginning at least one to three months before conceiving and during the first three months of pregnancyand this from ahealthyme- How much folic acid do I need?The U.S. Public Health Service recommends that all women of childbearing age take at least 400 micrograms of folic acid a day, the amount contained in many multivitamins. However, most prenatal vitamins contain 800 micrograms, which is the amount recommended for pregnant women by the FDA. If you're pregnant or even hoping to conceive, your health-care provider will probably suggest that you take the higher amount. You don't need to be concerned about getting too much because folic acid is water-soluble, meaning your body will flush out any excess.fromma government website for woman- Most women need 400 micrograms (mcg) of folate each day, even if they are not planning to get pregnant. Folate is needed before and during the first weeks of pregnancy to help prevent birth defects. Because half of all pregnancies in the U.S. are not planned, women who can become pregnant should aim to get 400 mcg folate each day. That way, if they do become pregnant their babies will be less likely to have birth defects.Some women need more folate each day:* If you are pregnant, you need 600 mcg.* If you are breastfeeding, you need 500 mcg.Talk with your doctor about how much folic acid to take if:* You had a baby with spina bifida or anencephaly and want to get pregnant again. Your doctor may give you a prescription for 4,000 mcg folic acid. That is 10 times the normal dose. Taking this high dose of folic acid can reduce your chances of having another baby with these birth defects.* You have a family member with spina bifida. Your doctor may give you a prescription for 4,000 mcg folic acid.* You have spina bifida and want to get pregnant.* You are taking medicines that affect how your body uses folate. These include some of the medicines for:o Epilepsyo Type 2 diabeteso Rheumatoid arthritiso Psoriasiso Inflammatory bowel disease* You have kidney disease and are on dialysis.* You have liver disease.* You have celiac disease.* You abuse alcohol.So I have read to take 400mcg for any one that is of childbearing age, then go to 600mcg once pregnant than down to 500mcg once breastfeeding.and if you have a  history of spina bifida in your family then the dr may tell you to take 4000mcgI t is water soluble but i have also found that too much is not good but havent found how much is too much.my last pre-natal was 800mcg and the one i just started to take from GNC is 1000mcg,maybe I don't need the extra 400mcg?",
            "post_id": "3595104",
            "timestamp": "1225383848",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "JMO, but I don't think you need the extra 400, with a prenatal that has 1000.",
            "post_id": "3595220",
            "timestamp": "1225385021",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "fish oil-  I take two lemon flavored softgel 600mg a day to make a  total of 1200as for flaxseed oil for men. i found this article about how flex seed seems to be good but the oil is not so good unless the lignans are put back in. are you able to find out if yours has this lignan? I didnt find anything about helping his little swimmers... sorry! ill try and read up more about it but part of the article is as follows...Although flaxseed oil seems to be safe for women, I still haven't seen any data showing that it is safe for men. In October 2004, Nutrition Journal published an analysis of nutrition and cancer. One meta-analysis included in that publication reviewed nine studies that revealed an association between flaxseed oil intake or high blood levels of alpha-linolenic acid and increased risk of prostate cancer. The author speculated that the lignans in flaxseed are a major component of its anti-cancer effects and that the lack of lignans in most brands of flaxseed oil may explain why flaxseed oil is not beneficial. Until we know more about the risk flaxseed oil appears to present, I recommend that men avoid it, or at least stick to brands that put the lignans back in. Flaxseeds, however, present no danger to men.the crazy thing is that there are so many things that benifit us in some way and then be bad for something else.like evening primrose oil. I know a girl that took it to try and clear up her skin before she got married. she got pregnant pretty much on her honeymoon, that pregnancy turned into a vanishing baby, the next pregnancy she had twin to twin transfusion and delivered way too early but her babies survived but are way behind on development, then her third pregnancy ended with a totally healthy baby. could it have been the evening primrose that she was taking when she conceived the first baby!!!! goodness know!!!!",
            "post_id": "3595266",
            "timestamp": "1225385658",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "your right. ill take out the extra 400mcg and keep it for after i have had a baby and use it when im not needing pre-natal anymore... yah for when they days happens!!!!!",
            "post_id": "3595305",
            "timestamp": "1225386084",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "That is weird about the EPO.  I haven't seen anything like that online.  Like I said, when I see the RE in December I'm going to have a list of everything I and DH are taking and see what she says.Now I'm concerned about giving DH the flaxseed.  Why, oh why must everything be SO complicated??",
            "post_id": "3595402",
            "timestamp": "1225387256",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "You are right about the EPO, it should never be taken after O (in case conception occurs).  Just the first half of your cycle.",
            "post_id": "3595499",
            "timestamp": "1225388074",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Flaxseed Oil\"Canadian scientists are warning that pregnant women who consume flaxseed oil put themselves at risk of a premature delivery.The scientists from Montreal University have found that the risks of a premature birth quadruple if flaxseed oil is consumed in the last two trimesters of pregnancy.\"I'm going to check the bottle tonight about the Lingnans, but in all likelihood, will have DH stop taking it.",
            "post_id": "3595514",
            "timestamp": "1225388222",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "yea from what i got from the article its just the oil not the flaxseed itself that they shouldn't take. in fact they say that the actual flaxseed is good for a guy.",
            "post_id": "3595525",
            "timestamp": "1225388307",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "I think that article you just found is one that i found before.what about all this ladies that don't even think that about what supplements they take.I know that Drs ask what tablets you take when you visit them but maybe  a list of things could be more readily available about whats good and what not rather than us that have to search though the internet only to find conflicting info.I thought it was bad enough that the nurse didnt make sure I was taking pre-natals when i phoned for my first appointment when i was first pregnant, but there is so much more than just pre-natals to talk about. one could go overboard with what they take like i was with my folic acid.",
            "post_id": "3595552",
            "timestamp": "1225388687",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "Any expectorant that contains guaifenesin as the only active ingredient is fine to use. One should buy the plain kind with no letters after it. The only active ingredient is guaifenesin, and it contains 100 mg per teaspoon. It is very important to avoid the versions that contain decongestants as those may dry up cervical mucus. Also, there is some conflicting information about whether dextromethorphan, the DM in some cough medicine names, may be linked to birth defects such as neural tube defects and cleft palate.The recommended dose for improving cervical mucus, based on a 1982 article in Fertility and Sterility, is two teaspoons (200 mg) taken orally three times per day. If mucus still appears thick and doesn't have good spinnbarkeit (ability to stretch), one can take as much as four teaspoons (400 mg) four times per day (the maximum dose on this over the counter medication). Each dose should be taken with a full glass of water, and attention should be given to drinking plenty of fluids throughout the day -- one needs water to produce mucus.starting guaifenesin about five days before expected ovulation and continuing through ovulation day (six days total, for those with regular cycles). For those with irregular cycles, one should start taking guaifenesin about five days before the earliest day ovulation might be expected. For those taking Clomid (clomiphene citrate, Serophene) in a 5-day protocol, one can probably wait until the day after the last Clomid pill before starting the expectorant.just like the EPO I would stop taking this as soon as \"O\" takes place",
            "post_id": "3607959",
            "timestamp": "1225675386",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "I have Pre-Conception Plus lube. Sperm friendly moisterizer. Dont forget green tea with ginseng and honey for men, ginseng helps the men. :) also raspberry leaf w/ red clover and vitex are good for TTC but has the possiblilty for multiples, along with Yucca root.",
            "post_id": "3609935",
            "timestamp": "1225726863",
            "user_id": "user_624470",
            "user_link": "/personal_pages/user/624470",
            "votes": "0"
        },
        {
            "answer": "are you able to give more info on your suggestions? I am curious about what you said about multiples. i M/C twins and would love to get pregnant with twins again!",
            "post_id": "3609973",
            "timestamp": "1225727351",
            "user_id": "user_628735",
            "user_link": "/personal_pages/user/628735",
            "votes": "0"
        },
        {
            "answer": "Yes, please, I'm interested too. :)  Although, I swear I've read that green tea isn't good for women TTC.",
            "post_id": "3610050",
            "timestamp": "1225728176",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Bumping for Leah",
            "post_id": "3678156",
            "timestamp": "1227117449",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "bumping for the newbies :)",
            "post_id": "3899681",
            "timestamp": "1232549112",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "bumping again . . .",
            "post_id": "3958668",
            "timestamp": "1233882667",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Bam- When I was ttc there was a woman by the name of Beth Riley who had this guide to getting pregnant 7 tips to getting pregnant and for 7 days she would send helpful tips. Things I would never even thought of. After the 7 days like once a month she sends tips. I still get them periodically. If you are interested google her name and have her send the info to you. Here is a few she sent me:Hi Jenny,As you probably know, I am always in searchof new information on ways to improve fertility.Through my reading, I have become more andmore convinced that the tremendous increasein \"unexplained infertility\", which is aglobal phenomenon, is due in large part toenvironmental toxins, poor nutrition andunhealthy lifestyle practices.In my ebook, Personal Path To Pregnancy,I discuss many natural treatments to improvefertility.  One fertility boosting herb that Ihave just recently read about is called MACA.Maca is a Peruvian tuber that dries into abutterscotch-tasting powder. Its adaptogenicactions help normalize hormones.Maca is used to increase fertility and libidoin both men and women by its effects of decreasingestrogen, increasing progesterone and unbindingtestosterone, according to the research.You can read some more about Maca here:http://natural-fertility-info.com/maca-study-reveals-increase-in-sperm-production-and-libido.htmlIf you wish to purchase some maca, you can get some here:http://www.tipsgettingpregnant.com/maca.phpThat's it for now. Hope you find that helpful.Speak soon.BethP.S. Don't forget to check out my review ofFertilAid at http://fertilaid.weebly.comIt is the only doctor-approved, ObGyn-recommendedfertility supplement designed to enhance fertilityand improve reproductive health.==============================================================Beth Kiley is a researcher and author of the new book\"Personal Path to Pregnancy,\" which details amazing strategiesand tips for maximizing your fertility. You can read about it athttp://www.PersonalPathtoPregnancy.comP.O. Box 557New Providence, NJ 07974To unsubscribe or change subscriber options visit:http://www.aweber.com/z/r/?LOycDKyMtCxMbJycDByctGa0jBwcTOwMrA==2)Hi Jenny,I wanted to alert you to some information thatI just dug up in my research.Have you every heard of gossypol?  No?  Well,I hadn't either.  Turns out it is a  toxic substancefound in the cotton plant, which is mostly removedthrough hydrogenation when making cottonseedoil.  Why should you care?  Well, it turns out thatgossypol is basically like a male birth controlpill.  It greatly reduces male sperm count andsperm motility, and was actually being considered inChina for use as a male contraceptive.While most of the gossypol is removed fromthe cottonseed oil, some of it is still there.  So,to be on the safe side, it's probably best foryour partner to avoid products made withcottonseed oil.  This would typically be somesalad dressings and especially snack foods--such as potato chips.Please check out the labels and stay away. AsI discuss in my book, Personal Path To Pregnancy,there are several ways you can focus on nutritionto improve your fertility.  This includes eating moreof some things and definitely staying away from others.If you want to learn more about ways toincrease your chances of getting pregnant, checkout http://www.PersonalPathtoPregnancy.comWarm regards,Beth=============================================================Beth Kiley is a researcher and author of the new book\"Personal Path to Pregnancy,\" which details amazing strategiesand tips for maximizing your fertility. You can get access athttp://www.PersonalPathtoPregnancy.comP.O. Box 557New Providence, NJ 07974To unsubscribe or change subscriber options visit:http://www.aweber.com/z/r/?LOycDKyMtCxMbJycDByctGa0jBwcTOwMDA==3)Hi Jenny,As you know, I am always on the lookout fornew information on the topic of gettingpregnant.Improvements to your mental and physicalhealth can go a long way to improving yourodds of getting pregnant. Creating anoptimal environment for an embryo togrow by eating right, taking the rightsupplements, avoiding harmful toxins,are some examples of what you can doto improve your fertility.I recently came across an article that discussessomething you may never have thought of which couldbe harming your fertility.  It is about the toxiceffects of mercury.  I've already written aboutthe harmful effects of mercury, and the needto avoid fish with high levels.  But this isnot about fish.  It's about the mercury inyour teeth.Click the link and read more...http://www.wholebodymed.com/library_education_details.php?pid=31In my book, Personal Path To Pregnancy,there are many strategies offered tomake the necessary changes that willincrease your chances of getting pregnant.Check it out here:http://www.PersonalPathtoPregnancy.comSpeak soon,Beth=============================================================Beth Kiley is a researcher and author of the new book\"Personal Path to Pregnancy,\" which details amazing strategiesand tips for maximizing your fertility. You can get access athttp://www.PersonalPathtoPregnancy.comP.O. Box 557New Providence, NJ 07974To unsubscribe or change subscriber options visit:http://www.aweber.com/z/r/?LOycDKyMtCxMbJycDByctGa0jBwcTGycnA==4)Hi Jenny,I wanted to send you a quick note because overthe last few days, I've gotten a lot of emailsasking for my recommendation for a goodsupplement to improve the odds of getting pregnant.The truth is, I did do some research on this subject,and at the bottom of most of my emails I put alink to a site where you can read all about it.Maybe you never noticed it before:===============================http://Fertilaid.weebly.com===============================So I thought I would send out this note to letyou know that I do have a recommendation ona fertility supplement that seems to help a lotof women to get pregnant.  FertilAid.Remember though, these supplements are NOTmagic.  You still need to be doing things rightas far as diet and lifestyle to make sure youare maximizing your odds to conceive.  You canread more about that in my e-book, PersonalPath to Pregnancy, which you can get here ifyou don't already have it:======================================http://www.PersonalPathtoPregnancy.com======================================OK, back to the supplements...Read my review here about FertilAid:===============================http://Fertilaid.weebly.com===============================So that's all for today,Speak soon,BethP.O. Box 557New Providence, NJ 07974To unsubscribe or change subscriber options visit:http://www.aweber.com/z/r/?LOycDKyMtCxMbJycDByctGa0TEyMLKzsjA==Okay so here are just a few. What are you thoughts? Let me know.AP",
            "post_id": "3959205",
            "timestamp": "1233892106",
            "user_id": "user_623156",
            "user_link": "/personal_pages/user/623156",
            "votes": "0"
        },
        {
            "answer": "Thanks AP.  I actually found her early last month and got all 7 tips.  I'm telling you I don't think I've left any stone unturned :)That's great that you saved and posted them.  I wish I would have thought of that!",
            "post_id": "3960450",
            "timestamp": "1233932496",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Thanks Bam for posting all this info!! I am so happy to have it! I've got a ton of things that I need to try...:D Thanks again...so helpful!",
            "post_id": "3960472",
            "timestamp": "1233932969",
            "user_id": "user_663562",
            "user_link": "/personal_pages/user/663562",
            "votes": "0"
        },
        {
            "answer": "I posted a few up in the fertility forum and got no response so I figured maybe noone was interested. I'm glad though you looked into her she has some hints I would never have dreamed of. So I hope it has helped you. How is ttc going? I hope the month of love is your lucky one. If you ever need to vent I'm always here. If you have yahoo messenger leave me a message with your screen name and we can chat. I will ttyl..Hugs,AP",
            "post_id": "3960481",
            "timestamp": "1233933097",
            "user_id": "user_623156",
            "user_link": "/personal_pages/user/623156",
            "votes": "0"
        },
        {
            "answer": "Bumping, because I was asked to.",
            "post_id": "4055397",
            "timestamp": "1236193698",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Thanks Bam!!",
            "post_id": "4055557",
            "timestamp": "1236195759",
            "user_id": "user_715068",
            "user_link": "/personal_pages/user/715068",
            "votes": "0"
        }
    ],
    "post_id": "3591636",
    "question": "There a few of us who have been talking about what things you can do to increase quality CM.  I thought I would start a new post here, so all the info is in the same place.  Basically feel free to post about any supplements you are taking, how many, what brand.I've been taking Evening Primrose Oil (EPO) and will add a more detailed post tonight.  Nunu was talking about Fish Oil and I think Dani mentioned Pre-Seed.  So if you want to post any of your research here, that would be great!!Sorry Dani, for hijacking your AF post :)",
    "timestamp": "1225310715",
    "title": "Vitamin Supplements for Improved CM",
    "user_id": "user_549647",
    "user_link": "/personal_pages/user/549647"
}