{
    "answers": [
        {
            "answer": "Evening Primrose Oil (EPO) - Its Role In Trying to ConceiveWhat is Evening Primrose oil or EPO?Evening Primrose Oil is the oil derived from a North American wildflower called Evening Primrose. Evening Primrose is not really a primrose, but it gets its name from that flower because the plant looked similar to an English Primrose. The oil is rich in Vitamin E just like olives and nuts are. In addition, evening primrose oil also has gamma linolenic acid (GLA), an essential fatty acid. People that have difficulty creating in this fatty acid in their own bodies can benefit from its use.The Europeans were one of the first to make it popular. They brought it back to their native soil and crowned this oil a “King’s cure-all” because of its many useful properties that can cure a large number of diseases. In England, the oil is approved for use with eczema and high cholesterol. In women, it can especially be helpful for relieving breast pain, menstrual pains and improving the quality and fertility of cervical mucus.How does Evening Primrose Oil help you in getting pregnant?Evening Primrose Oil or EPO lowers cholesterol, helps to alleviate premenstrual syndrome symptoms and aids in the production of fertile quality cervical fluid. Evening Primrose Oil or EPO does a world of good in treating aliments of all sorts. Evening Primrose Oil or EPO is an essential fatty acid that contains gamma linolenic acid (GLA). This gamma linolenic acid (GLA) is converted to a hormone-like substance called prostaglandin E1 which has anti-inflammatory properties and may also act as a blood thinner and blood vessel dilator. These anti-inflammatory properties of evening primrose oil help people suffering from pains, aches and cramps.Evening Primrose Oil or EPO also has effects on premenstrual syndrome symptoms and cervical mucus. If you suffer from premenstrual syndrome, it could be because you are deficient in the fatty acid, gamma linolenic acid (GLA). Evening Primrose Oil or EPO can help your body to alleviate the premenstrual syndrome symptoms by replacing the gamma linolenic acid (GLA).Evening Primrose Oil or EPO helps women to produce more fertile quality cervical fluid also known as “egg white cervical mucus”. This type of cervical fluid is fertile, thin, watery, clear and “stretchy” and easily aids the sperm to swim through the uterus and into the fallopian tube, and to the egg. Also, this type of fluid helps the sperm to stay alive for up to five days inside the fallopian tube, thus enabling conception to happen even if you don’t have intercourse again by the time ovulation occurs.If your cervical fluid is thick, brown or dry, it can obstruct or prevent fertilization. Some women are very dry, and have problems in producing an adequate amount of fertile quality cervical fluid. Drinking a lot of water and taking the Evening Primrose Oil or EPO can certainly help in the production of fertile cervical fluid in these women.What is the dosage for Evening Primrose Oil or EPO?Evening Primrose Oil or EPO should only be taken from menstruation to ovulation. This is because Evening Primrose Oil or EPO can cause uterine contractions in pregnancy. The dosage taken should be 1500mg to 3000mg per day. Since essential fatty acids are necessary, you can take flax seed oil in place of Evening Primrose Oil or EPO after ovulation. This may be taken throughout pregnancy as well.There are many remedies out there to help with fertility, but few are as good as Evening Primrose Oil or EPO. Evening Primrose Oil or EPO is excellent for women because of the help it gives in alleviating premenstrual syndrome symptoms, and even menopausal women can benefit from taking it. There are a large number of women who will vouch for Evening Primrose Oil or EPO as a great agent to increase the fertile type cervical fluid.Like all herbs, the use of Evening Primrose Oil or EPO can take a month or two to build up, and produce the results you are looking for. It is essential that you chart your fertility symptoms and signs, so you can know when you have ovulated. By knowing this information, you can discontinue the Evening Primrose Oil or EPO after ovulation and start the flax seed oil. Unless you are very regular, charting your fertility signs is the best tool to determine where you are in your cycle.",
            "post_id": "4696043",
            "timestamp": "1248533855",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Evening Primrose Oil to Pre-SeedFertility, Cervical Mucus, and EPOEvening primrose oil (EPO) is a favorite fertility aid for women. Historically considered a medicinal \"cure-all\", evening primrose oil is one of the more popular herbal supplements for female hormonal balance and fertility. Women who are trying-to-conceive use evening primrose oil to improve the quality of cervical mucus - or make the cervical mucus more fertile. However, evening primrose oil offers a wide array of purported benefits, including treating many ailments like breast pain, hot flashes, premenstrual symptoms (PMS), skin disorders, rheumatoid arthritis, and hormonal imbalance.The Evening Primrose is a wildflower (not actually a primrose, though it is similar in appearance). Evening primrose oil is derived from the seeds of the plant. Like other nuts and seeds (for example, flaxseed), evening primrose oil is rich in essential fatty acids and vitamin E. In addition, evening primrose oil also offers a high concentration of specific essential fatty acids, including Linolenic acid and gamma linolenic acid - or GLA.. Gamma linolenic acid is used in the body to produce prostaglandins (chemicals similar to hormones) which are important for a number of key body functions. Our evening primrose oil offers a very concentrated source of the fatty acid gamma linolenic acid with 10% of the oil's fatty acids available in the form of GLA.As Dr. J Lee notes, \"[It's the] remarkably rich stores of GLA in evening primrose oil [that] make it so valuable in healing. Taken internally, the body converts GLA into prostaglandins. These hormone-like compounds help regulate various body functions, controlling inflammation in some cases and promoting it in others. The prostaglandins produced from GLA fall into the anti-inflammatory category. Cell membranes also rely on the presence of GLA.\" As noted above, gamma linolenic acid is converted by the body into a hormone-like substance called prostaglandin which has anti-inflammatory properties.Evening Primrose Oil, Infertility, and CM (Cervical Mucus)How is Evening Primrose Oil used to increase fertility? A good question. For women who are trying-to-conceive, one of the benefits of evening primrose oil is that it may increase the quality of cervical mucus, making it a more fertile medium for sperm. To clarify this, we need to understand how cervical mucus contributes to fertility. One of the purposes of cervical mucus - during the fertile period when a woman ovulate - is to sustain sperm in a healthy medium, and to allow sperm to move freely through the cervix. When a woman ovulates, there should be an increase in cervical mucus, as well as a change in mucus texture - the mucus becoming more pliable, \"stretchable\", and slippery. This is \"fertile\" cervical mucus. You will often hear it compared to \"egg-whites\".The issue is that some women do not produce sufficient cervical mucus and/or cervical mucus that has infertile qualities. This latter type of cervical fluid is called \"hostile cervical mucus\". If the cervical mucus is absent, or does not provide a fertile, fluid medium for sperm, then the odds of conception may be decreased, as sperm do not have a fertile environment to propel or sustain themselves.Evening Primrose Oil helps women produce fertile quality cervical fluid, or \"egg white\" cervical mucus. This variety of cervical fluid is fertile, thinner, watery, more clear than cloudy, and stretchy or stretchable. It easily aids sperm in transport through the uterus and into the fallopian tube, and to the egg. Fertile cervical fluid helps sperm remain alive and mobile for several five days inside the uterus and fallopian tube, enabling conception to take place, even if ovulation occurs days after intercourse. The lubricant Pre-Seed (or Preseed) also offers a sperm-friendly transport medium that mimics natural body secretions and cervical fluids.Hostile Cervical Fluid, Evening Primrose Oil, and Pre-SeedHostile cervical mucus: If cervical fluid is thick or dry or a cloudy brown, it can obstruct the passage and moment of sperm and prevent fertilization. Many women experience the problem of dryness, and have issues producing fertile quality cervical fluid. Evening Primrose Oil has been shown to help in the production of fertile cervical fluid in such circumstances. Alternately, Pre-Seed is a non-supplement alternative to Evening Primrose Oil.Note that Evening Primrose Oil should only be taken from menstruation to ovulation, as EPO may cause uterine contractions. The dosage taken should be 1500mg to 3000mg per day. Since essential fatty acids are important, you can take flax seed oil in place of Evening Primrose Oil after ovulation takes place.",
            "post_id": "4696045",
            "timestamp": "1248533889",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Benefits of Fish OilEven if you don’t suffer from infertility, high-dose fish oil is the most important supplement you can take during pregnancy for several reasons, but most importantly for the development of the child’s brain. Long-chain Omega-3 fatty acids are critical for fetal brain development to provide your child the best possible mental advantage coming into this world. The fetus’ need for DHA is greatest in the last trimester of the pregnancy as fetal brain cells are being created at a prodigious rate (more than 250,000 nerve cells per minute). If you don’t have adequate supplies of DHA in your body, your fetus’ brain is going to have trouble keeping up with the growing demand for DHA building blocks. Thus, pregnancy is a critical time to take fish oil supplements.Fish oil can also help pregnant women avoid two serious conditions that can occur during pregnancy: pregnancy-induced hypertension (pre-eclampsia) and gestational diabetes. Both of these conditions can be treated either by lowering insulin levels (gestational diabetes) or by decreasing the levels of “bad” eicosanoids (pre-eclampsia). To accomplish the first goal, pregnant women need to consume an optimal ratio of carbohydrates to protein. To accomplish the second, they need to take ultra – refined EPA / DHA fish oil concentrate supplements.Thus, the best diet to accomplish both goals and also provide adequate levels of DHA is one following my dietary recommendations. If you are pregnant you should be consuming extra calories beyond a typical woman’s nutritional needs—on the order of about 300 calories more a day. This simply means using a slightly larger plate at each meal, but still keeping the correct balance of foods. (Alternatively, you can consume an extra two or three glasses of low-fat milk every day, since milk has the appropriate balance of carbohydrates to protein.) Following my dietary plan during pregnancy will ensure adequate protein for both you and your fetus, and the increased consumption of fruits and vegetables will supply the necessary micronutrients for both. It’s never too late in your pregnancy to go on my dietary program—because your fetus actually gets the biggest benefits during the last trimester.After giving birth, new mothers should keep supplementing their diet with high-dose fish oil to lower their risk of getting post-partum depression. After birth, the levels of long-chain Omega-3 fatty acids (especially DHA) drop dramatically in the mother’s blood. This is similar to the decreased levels of long-chain Omega-3 fatty acids that are observed in depressed patients. By supplementing her diet with adequate levels of high-dose fish oil, a new mother can avoid that drop in long-chain Omega-3 fatty acids, and thus will likely avoid any resulting depression. Supplementation with ultra - refined EPA / DHA fish oil concentrate is also important for the mother who is breast feeding her child to maintain the DHA levels in her breast milk that are crucial for the development of a young baby’s still rapidly growing brain",
            "post_id": "4696049",
            "timestamp": "1248533927",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Vitamin C for menVitamin C (1000mg) per day raised sperm counts by 140% in the first week in one study and 200 mg increased sperm counts by 112% in the first week. After 60 days the 200 mg group had caught up with the 1000mg group. All of these men had impregnated their wives by the end of the study",
            "post_id": "4696051",
            "timestamp": "1248533956",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "more Fish Oil•Essential fatty acids (EFA) (1-7 grams per day) can help the health of your reproductive system, insulin levels, heart and brain. EFA reduce inflammation throughout the body (a possible cause of PCOS and other types of infertility) and promote overall health. The best source is purified fish oil (don’t take cod liver oil as it is too high in vitamins A & D and may prove toxic).",
            "post_id": "4696054",
            "timestamp": "1248533992",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "The following is a post from nunu1977/Vanessa:There is so much info about taking fish oil during pregnancy. i am still trying to find the website that informs you to take fish oil over flax seed to get your omega-3Omega 3 During PregnancyIn the past decade or so, the importance of Omega 3 during pregnancy has been acknowledged. It is now known that Omega 3 actually plays a large role in the development and growth of your baby when it is in your uterus. Omega 3 helps to:* build the brain* form the retinas* develop the nervous systemOmega 3 is also necessary for your own pregnancy health and wellbeing. Omega 3 helps to:* reduce your chances of developing preeclampsia* reduce your risk for postpartum depression* minimize the chance of preterm labor.Omega 3 Deficiency During PregnancyHaving an Omega 3 deficiency while you are pregnant can prove very harmful to you and your baby. Your baby takes Omega 3 from the foods that you eat. The nutrients cross the placenta, helping your baby to grow and develop. However, if your baby does not get enough Omega-3 from the food you eat, he will begin to take it from your own stores. Researchers believe that these stores may be located in the brain, which can result in a loss of up to 3% of your brain cells. Omega 3 deficiency during pregnancy is linked with:The Future Benefits of Omega 3Taking Omega 3 during pregnancy has also been proven to help you and your baby out in the long run. Recent studies were performed on infants who were exposed to adequate levels of Omega 3 while in the womb. These babies showed advanced attention spans and greater visual acuity than non-exposed children. Their development was also two months ahead of non-exposed children. Other Omega 3 benefits include:During pregnancy, it is recommended that you get at least 250 mg of Omega 3 every day. However, Omega 3 oils are especially important during the final trimester. It is during this time that your baby uses Omega-3 to form approximately 70% of her brain system. She is also working on the rest of her nervous system.Good Omega 3 SourcesOmega 3 is best found in fish and fish oil products. High levels of Omega 3 are found in:* oily fish, like mackerel, herring, sardines, anchovies, salmon, and pilchards* Omega 3 fish oil supplements* fresh or frozen tunaOmega-3 supplements are available but check to make sure that your supplements are not made from fish livers. The liver can contain high amounts of retinol vitamin A, which has been linked to birth defects. Omega-3 supplements not derived from fish livers but rather from the body of the fish are less likely to contain this type of vitamin A. If you would prefer to err on the side of caution, you can always look for supplements that are made specifically for pregnant women.",
            "post_id": "4696055",
            "timestamp": "1248534062",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Also from Vanessa:Omega-3 and Pregnancy- Fish oil over flax seedPregnant women are often told to take fish oil capsules but must be careful to get the best quality, instead of cheap, generic stuff. The cheap fish oil may come from fish with contamination and may not be free of pollutants. Women should be careful about the types of fish and fish oil they consume when they are pregnant, nursing, or even when experiencing pregnancy symptoms.Flaxseed oil does have omega-3 in it and is preferred by some people however some doctors say flaxseed oil should not be taken by pregnant women.The reason is that flax seed, like soy or even more so, seems to have an effect on estrogen and hormones and might interfere with your body during pregnancy. Ask your doctor.One study on this was: Brooks JD, Ward WE, Lewis JE, et al. Supplementation with flaxseed alters estrogen metabolism in postmenopausal women to a greater extent than does supplementation with an equal amount of soy. Am J Clin Nutr 2004;Feb, 79(2):318-325.Also, flaxseed oil does not have as high an amount of DHA as fish oil, so fish oil is just better anyway at giving you the DHA you want.Meanwhile, fish oil has been found in some studies to greatly support pregnancy and healthy baby development, and may even help prevent miscarriage. This is very, very important.One such study was: Rossi E, Costa M., Fish oil derivatives as a prophylaxis of recurrent miscarriage associated with antiphospholipid antibodies (APL): a pilot study. Lupus 1993;2:319-23.Conclusion: Pregnant women should talk to their doctors about avoiding flaxseed oil and also taking the most pure fish oil pills on the market.If you want the best fish oil you should buy single-source fish oil, such as hoki fish oil capsules. And you should look for a pharmaceutical grade product that comes from healthy fish caught in pristine clean waters, then is quickly processed for purity and packaged under strict pharmaceutical conditions.What you do not want is some cheap oil from a motley collection of \"mystery fish\" caught in the polluted waters of some industrialized area, that has sat in unrefrigerated tanker ships and trucks while it traveled some long distances in the heat, then was packaged in less than pharmaceutical conditions. Can you say \"Burp?\" Don't go near that stuff.",
            "post_id": "4696062",
            "timestamp": "1248534100",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "That's the jist from the post.  We also discuss pre-seed and an appropriate daily intake of folic acid.Take this information for what it is worth and I always recommend doing your own research and talking to your doctor.",
            "post_id": "4696070",
            "timestamp": "1248534276",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "bumping for Natalie",
            "post_id": "4885394",
            "timestamp": "1253306263",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        },
        {
            "answer": "Thanks ;)",
            "post_id": "4915515",
            "timestamp": "1254082669",
            "user_id": "user_958842",
            "user_link": "/personal_pages/user/958842",
            "votes": "0"
        },
        {
            "answer": "BUMP  :)",
            "post_id": "4963480",
            "timestamp": "1255265042",
            "user_id": "user_870652",
            "user_link": "/personal_pages/user/870652",
            "votes": "0"
        },
        {
            "answer": "I was asked to bump this :)",
            "post_id": "5094525",
            "timestamp": "1258594851",
            "user_id": "user_549647",
            "user_link": "/personal_pages/user/549647",
            "votes": "0"
        }
    ],
    "post_id": "4696042",
    "question": "I had originally posted this on a different forum, but I'm going to put it here as well for referance.Vanessa - can you believe this original post is from Oct 2008?!?There a few of us who have been talking about what things you can do to increase quality CM.  I thought I would start a new post here, so all the info is in the same place.  Basically feel free to post about any supplements you are taking, how many, what brand.I've been taking Evening Primrose Oil (EPO) and will add a more detailed post tonight.  Nunu was talking about Fish Oil and I think Dani mentioned Pre-Seed.  So if you want to post any of your research here, that would be great!!",
    "timestamp": "1248533812",
    "title": "Vitamin Supplements for Increased CM",
    "user_id": "user_549647",
    "user_link": "/personal_pages/user/549647"
}