{
    "answers": [
        {
            "answer": "I also tested positive for GBS (strep) this week....I was pretty upset about it too, especially because I really wanted to try for a natural birth, and this is going to complicate things. If my water breaks or I lose my plug, they'll want me to the hospital asap, even without contractions, to start me on antibiotics; then they'll probably want to induce, then I'll have to have an epidural, everything I was hoping to avoid!!! But I'm trying to keep in mind that no matter what happens, the only really important thing is a healthy Annabelle.....I'm getting really impatient, especially reading everybody's posts! It seems like I'm the only one without anything starting to happen, and I think I have the earliest due date, Feb. 1st. Other than some pretty uncomfortable BH, Annabelle seems to be pretty happy where she is right now....she's in the right position, but hasn't dropped yet. My midwife doesn't like to do internals either until there's a reason to, so I don't know yet if I've started to dilate or not.Oh well, I guess instead of being impatient, I should be savoring these last few weeks of peace and solitude!",
            "post_id": "3870730",
            "timestamp": "1231878160",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Well I am feeling really anxious right now!!  Yesterday I went to the doctor a couple days early due to feeling pressure in my bottom, cramping and I wiped pink.  Well turns out I have another UTI!  It makes sense based on the symptoms, since I had those same symptoms the last time I had a UTI.  But the symptoms I am having are also common for where we are at in our pregnancy.  Anyways, the doc also did the Strep B test but I won't know those results until I go back next week.  He did a pelvic exam, which highly disappointed me.  My cervix is closed.  He said my cervix is soft and not closed tight, but not open enough for dialation.  So he said he may or may not check me next week, it just depends on my symptoms next week.  I told hubby I need to think of something that will get him to check me because I want to know! LOL.  But I started my anti-biotics for the UTI today and will continue them for 7-10 days, so hopefully I start feeling better.  I too am getting more nausea and increased acid reflux - that's one thing I will NOT miss about being pregnant.",
            "post_id": "3870827",
            "timestamp": "1231879478",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "I had a dr. appt today at 10:15am. They did the StepB test and i will have the results by the next. Well in 2 weeks i put on 5lbs. Not great but i'll take it. I also found out i am 1cm dilated and about 70-80% effaced. I have my next appt on 1/21 which includes an u/s b/c at the last u/s Logan weighed in the 97% percentile and they want to check his weight. So it would appear things are moving along quite well. My doctor seems to think i will probably go before my due date. So now i am told to start looking for more contractions and start timing things to see how i am progressing.....Its so crazy to believe that he could come whenever he wants now. This weekend is my baby shower which i am very much looking forward to but also overwhelmed thinkin about.Had to go to the medical dr yesterday i am now on a z-pak for a throat infection ( i get them like every other month cuz i work in a group home and catch all their germs)thats all for now i think,Jonelle",
            "post_id": "3870907",
            "timestamp": "1231880600",
            "user_id": "user_354219",
            "user_link": "/personal_pages/user/354219",
            "votes": "0"
        },
        {
            "answer": "Solus-you can still have a natural birth! That was one of the first things I questioned because I also would like to go natural. And my doctor said Step B doesn't change that at all. They just like you to get to the hospital as soon as your water breaks so they can get you the IV of Antibiotics and they replace the IV every 4 hours until your deliver. So it won't change anything and doesn't at all mean you'll have to have an epidural. It just means you'll have an IV during the whole labor process. It also doesn't mean they'll induce you...thats completely up to you unless there is a problem and they absolutely need too. So I wouldn't worry, you can still aim to deliver naturally!Jonelle-why aren't you happy with 5 pounds? Thats a GREAT number! I am over 37 weeks and supposed to be putting on 1-2 pounds a week and I've only been putting on half a pound a week, so at your week, 5 pounds is a nice big number!We just gotta hold on a few more weeks ladies, we're almost there!!",
            "post_id": "3871140",
            "timestamp": "1231883703",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "Thanks for the encouragement! The only thing I was thinking is that it'll make the nurses more eager to induce me, if I have to go in the hospital after my water breaks but before contractions start. I've read that your water can break hours or even days before you actually start labor...not sure how likely that is, though? Oh well, I'm still planning on going natural if at all possible, and I'm excited to hear that you are as well!",
            "post_id": "3871217",
            "timestamp": "1231884829",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Oh i am happy with the number it just is like wow its crazy that i am finally gainging.",
            "post_id": "3871365",
            "timestamp": "1231887325",
            "user_id": "user_354219",
            "user_link": "/personal_pages/user/354219",
            "votes": "0"
        },
        {
            "answer": "Hi all,I put my update for Heather in a separate post.Am still in the hospital on IV drugs to stop contractions and strict bedrest, and will be here until baby comes.  They want her to wait another week until I'm 37 - 38 weeks.They've only done 2 IE since I've been here.  Once on the night I was admitted and once late last week - about 5 days ago.  Both times I was not dilated, but cervix very soft and anterior (I guess that means everything is ready to go).  So it seems they are not really into doing heaps of examinations.The main thing they do is check baby's HR twice a day.  She's usually at about 140 bpm.  That's apparently good.Am having intermittent contractions, and lots of pressure.  Hurts like h*ll when I cough and even peeing now hurts. Shooting pains at my cervix regularly.   Feeling quite nauseous often, but I don't know if that is the drugs or the pregnancy...I haven't been tested for the Step B. But I have just finished a course of antibiotics for chest infection....Don't know if I've gained weight (what on hospital diabetic meal!) as they haven't weighed me at all since I arrived. Am craving salt and flavourful foods.",
            "post_id": "3871785",
            "timestamp": "1231894511",
            "user_id": "user_231441",
            "user_link": "/personal_pages/user/231441",
            "votes": "0"
        },
        {
            "answer": "Solus-Yep your water can break and once that happens you are officially in labor but that doesn't mean your baby will be born right away! (we wish right!) so you will technically be in labor but like you said it could be hours or even a day! But once your water breaks they like to deliver within 24 hours for the babys safety. So unless you are nearing that 24th hour (or something is wrong with the baby) they wont induce you unless you ask them. It's your choice!Jonelle-You'll find you put on the most weight at this time! I put on so much weight between 28-35 weeks. It just started slowing down at my last appointment. But there was a time I thought I couldn't possibly gain anymore and I would!",
            "post_id": "3872329",
            "timestamp": "1231903248",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "well my last 3 appts. with my Dr. were cancelled. Finally had chance to c her today. And i am not thrilled, she kind of shruged off all my concerns. I asked her if we could set up and a c-section appt. she did, for Feb 23!! that 3 days before my due date. She had told me before she could do it 9days earlier, but today she said that she is to busy before that date..I have been having alot of HB, pressure, and back pain. I am still gaining weigh i am at teh weight i was the i delivered my previous 2!! Her only explenation for all this was maybe your doing to much!My mom and my husband are telling me that 9days won't make any difference to them maybe not ME!Sorry for going on for so long i am just frustrated!",
            "post_id": "3872492",
            "timestamp": "1231906421",
            "user_id": "user_573426",
            "user_link": "/personal_pages/user/573426",
            "votes": "0"
        },
        {
            "answer": "By the way, everyone, it's kind of late now to bring this up since we're all so close, but I got a regular stethascope and have been using it to listen to Annabelle's heartbeat for several months now. I was so excited to be able to hear it myself! They're not very expensive, and it's very comforting, anytime she's a little less active, to be able to make sure her heart rate is still what it should be. You guys have probably all thought of this already, but just thought I'd mention it!!",
            "post_id": "3873039",
            "timestamp": "1231931530",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        },
        {
            "answer": "Hi there girls....Week 38!!  I will be 38 weeks on Friday....and man, I want him out!!!I have been trying everything...sex 2x a day, walking, drinking red leaf tea 2x a day, eating pinapple, basil, oregano...all the old wives tales...Nothing!!  With my son at least I had braxton hicks everyday...telling me that my body was doing something, with this little boy..Nothing!!  My son was 8lbs10oz...and I am small, tilted pelvis...so it took 2 hours of pushing, and them using the vaccuum to suck him out, which caused an infection!!  So I don't want another big baby like that, and go through that...so a little earlier, and a little smaller won't hurt....if he is not that big now...my belly is huge!!  They never tell me weights at my Drs appt either...I know that he is head down and low..really low...I feel his hiccups in my pelvis, and man the pressure is intense!!  I was not dialated at my last appt, which was about 10 days ago....so hopefully I have done something.  I have another appt on Tues, but they usually do not check internally, the only reason she did was because she was down there anyway for a SB test....which I will find out the results then as well!!Sorry for all those that recieved a positive, but from what I understand it is pretty normal.  I understand what you mean about having to get to the hospital earlier then you want though....I made that mistake with my son...first one and all...once you are there, and laying on the bed, hooked up, and find out that you are only 5 cm dialated...and have hours to go...it is a lot harder to turn down drugs, then if you were at home, laboring on your own without that option....ask your partner to help you, one contraction at a time, messages, and try and talk you out of the drugs first...Will POWER!!Easier said then done!!!",
            "post_id": "3873136",
            "timestamp": "1231936641",
            "user_id": "user_643558",
            "user_link": "/personal_pages/user/643558",
            "votes": "0"
        },
        {
            "answer": "Speaking of trying everything to bring labor, my friend swears that spicy food put her in labor every time she had it later in pregnancy. its worth a shoot",
            "post_id": "3873653",
            "timestamp": "1231946507",
            "user_id": "user_573426",
            "user_link": "/personal_pages/user/573426",
            "votes": "0"
        },
        {
            "answer": "I have nothing new to really update. I had a doctors appt yesterday and they did the Strep B test..so I should have those results next week I would imagine. Everytime i go in my blood pressure seems to be high..and then go down after awhile..so they are watching me for preeclampsia.....which I really hope doesnt happen to me. They have not done another internal exam in the last two weeks..which I was kind of mad about..because I am having contractions..not regular ones..but I am having them...so, i dont know if i Have progressed at all...we will wait and see. Iam seeing the midwife that was the one who checked me in the hospital before next week so I have a feeling she will check me next thursday when i go in. Had to have another NST test done yesterday...which turned into 3 hours..but it all turned out okay. i have to go for another one tomorrow to see how that one comes out. They are just worried about my blood pressure being high and watching things closely. I am very uncomfortable..constantly cramping....and its just not fun. The docs just want me to make it one more week and then if i go into labor they said they will let me have this baby! I am super excited and anxious!",
            "post_id": "3874421",
            "timestamp": "1231957753",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Hi all!I am going to be 34 weeks complete on Friday, yay!  Then the 3-7 week wait.  lol.  I hope Daniel comes on his own at exactly 38 weeks...Valentine's Day!  :)  Anyway, I'm hoping they will check my cervix on Monday at my next appt.Things are great.  I feel so much bigger than even a week ago.  I think he may be sitting differently now.  and I'm getting increasing, longer BH contractions as well.  I like them though because it means my body is doing its thing to get ready.I am starting to get uncomfortable and can't wait for him to drop, since I breath heavy after doing nothing (I'm always stuff too, so that doesn't help).",
            "post_id": "3874550",
            "timestamp": "1231959579",
            "user_id": "user_368690",
            "user_link": "/personal_pages/user/368690",
            "votes": "0"
        },
        {
            "answer": "Hey ladies just wanted to add my two cents here, I have had the strep B both times and it is not a big deal - you need to stop reading about it on the internet because it will freak you out, my mistake my first pregnancy. The first time I was induced so there was plenty of time for the antibiotics as I sat around the first day on pitocin with absolutely nothing happening, I could of went natural but after the next day and 8 hours of contractions and still a long way to go I opted for the epidural which greatly sped up my dilation, I went from 6 to 9.5 in 15 minutes. With this delivery I was nervous as they rushed me in to the c-section but I asked them and they reassured me that they can get them in there in time. So I would advise for those of you who have it, when your water breaks go to the hospital or at least mention it to the on-call OB and see if they want you in immediatley or if you can wait for contractions to be closer together.",
            "post_id": "3874632",
            "timestamp": "1231960600",
            "user_id": "user_404232",
            "user_link": "/personal_pages/user/404232",
            "votes": "0"
        },
        {
            "answer": "hi ladieswell i    had  appointment  yesterday at 845 am yeah  really  early for me.  I  told the midwife that  pain ihave been having. ( lots of crmaping and  pelvic pain and  such ) She told me  that it was normal  unless it  happened with consistency which i already knew.  Told to drink  more water (  i already drink more than 10 glass ( full 16 oz glassses )  cause it is the only thing i can  drink  that  doesnt give me  heartburn. Well she measured the belly and  found out am i already measuring at  38-39 wks  by that. Now given my history seeing as my last baby  was 9lb6oz  i wasnt worried about  having another  big baby  kind of thought that was  what was going to happen this time  well to be  safe  she took me out of  work for the week cause of the constant  cramping and pelvic  pain  and the fact that i am  in medical  feild cant really  sit down that often  they want me off my feet. She  didnt  do the strep B test that is coming  next week even though that are thinking it is   going to be the same as it  was for the  last two   ( i tested postive both times) . SHe also  did  and NST  To rule out that i wasnt in  preterm  labor adn then  she sent me  for and  u/s well  upon  u/s little Mckenna  aint so little  they  have her a t almost 61/2 lbs and i am  34 wks and i have another six to go!!!!!!!!!!! i dont want to end up wiht a 12 lb  baby no thanks  ( ouch9 was bad enough)  So know they  also sent a  urine out to make  sure i  dont have a  UTI which  i work in lab   i ran the  UA and  culture on my self and everything  came  back normal so wanitng on thatthey are going to  dsicuss what they want to  so with me and  Her.    I left there today  after another u/s  and  u know i am  gettign kind of angry   i tried posing these  questions to the  midwife today and she wrote me off like my  worries about things that  could  go  wrong with  large  baby  were nothing  i think i have a  right to   worried  alittle you  know .JUst getting  tired of them not listening to  what i  say .   that is allwell here i am  34 wks  currently out of  work (  oh yeah that has my  job pissed too but that is another  story ) not  knowing what is going to happen  now  still have allthe cramping and the pelvic pain and pressure  but  was told that it is  all nothing  so who knows  hope everyone else is  feeling  better than i am  lol",
            "post_id": "3874812",
            "timestamp": "1231962841",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "I feel your frustration, I hate it when my dr does not listen to me. And it has been happening often lately, Just hang in there it will be over before you know it...Did your dr. tell you what she plans on doing if the baby gets to big? is she at least planing to have you induced early?? she should at least put ur mind at ease",
            "post_id": "3875091",
            "timestamp": "1231966943",
            "user_id": "user_573426",
            "user_link": "/personal_pages/user/573426",
            "votes": "0"
        },
        {
            "answer": "yeah i am trying to  hang in there .no plans yet altough all the  tests they ran arent back  yet so  hopefully i will  know something  by then  on 01/21  i am  not leaving the office with out some answers.  WE shall see what is happening .   THe Dh is  going  with me then   and he  is getting tired of  watching me   worry about grant u i want what is best for her and safest route for her.  so again we shall  see  right  Doesnt it  seem like they  dont want to  listen to u  cause they know it all  Dr sometimes the  drive me  nuts  it is like i am the patient u have to listen . Damn hormones they are going to make  me  go  crazy on the doc wednesday",
            "post_id": "3875401",
            "timestamp": "1231971734",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "above comment was a response to u  sorry  really tired frogot to put  in the  name lol see now i can  add no sleep to my lis complaints lol",
            "post_id": "3875406",
            "timestamp": "1231971807",
            "user_id": "user_487124",
            "user_link": "/personal_pages/user/487124",
            "votes": "0"
        },
        {
            "answer": "I hear ya ladies..I feel like the doctor I saw this week was not listening to me or answering my questions and it IS so frustrating. This is my first baby and I don't know everything and I have questions! It made me so mad!I too am concerned with having a big baby...mine measured to be about 6 to 6 in a half pounds at 36 in a half weeks. I am really tiny...100 pounds pre-pregnancy so my family seems to think its impossible to have a big baby but I know that doesnt matter at all! And my stomach is HUGE...like veiny and shiny and stretched to the max! So there has to be a big baby in there right? I mean my belly wouldn't be so big if there wasn't, right? So I am a little worried. I have to wait until my U/S on the 23rd to find out..but no options were even discussed if he was too big. And I feel like if I go full term he will be a 9 pounder! Soo turning 38 weeks on Friday I am SO ready!But I dunno, I don't think I've had any BH contractions unless their not painful and I just brush them off as my baby moving or turning. So that makes me think my body isn't ready...but than I've read things about women never getting or feeling them...AH so the wait continues! We gotta hang in there ladies, but it's tough!",
            "post_id": "3875555",
            "timestamp": "1231974251",
            "user_id": "user_341551",
            "user_link": "/personal_pages/user/341551",
            "votes": "0"
        },
        {
            "answer": "I'll be 38 weeks on Sunday, and I totally understand what you mean....I was 100 pre-pregnancy, too, with absolutely no hips, and I'm ready to get this baby out. My husband's mother is like 5 feet tall, and he weighed 9 1/2 lbs, so she had to have a c-section....hearing her horror stories is not making me feel better!!!I've read that doctors are not very accurate when it comes to estimating weight, though, so I don't know that I'd worry about it.Braxton Hicks are not painful....you'll just notice that your \"bump\" suddenly gets incredibly hard for 30 seconds or a minute or so. They don't really hurt, but they can be extremely uncomfortable, you just feel really hot and squeezy and sometimes it's hard to breathe. It's such a weird feeling! I was having 15 - 20 a day for awhile, and then I was less active for a couple of days, and the number went down....so I'm going to start walking a lot again, I'm ready to get this show on the road!!",
            "post_id": "3875895",
            "timestamp": "1231980083",
            "user_id": "user_543966",
            "user_link": "/personal_pages/user/543966",
            "votes": "0"
        }
    ],
    "post_id": "3870249",
    "question": "How is everyone doing?? We're nearing the end here girls!! Some of us are days away, some weeks...can you believe it!?? How is everyone feeling??Well I had my doctors appointment yesterday and the first thing my doctor told me, I tested positive for Strep B. I was so upset..and she acted like it was no big deal. I guess all they do is feed you Antibiotics through an IV during labor but after reading all this stuff about it, it just scares me! But she told me 40% of pregnant women have the bacteria and it was fine. So I still don't know what to think...I'm nervous but trying to deal with it. I've had such a healthy pregnancy, this kinda caught me by surprise.I didn't get an internal (which I was pissed about) I really wanted to see if I dilated more and progressed but she said they usually dont give another internal unless I've been having regular contractions. I swear, I think she was just making things up! Oh at my doctors, they have about 6 OB's and they like you to visit with each one at least once so when I deliver, I will know the on call doctor. So needless to say I did NOT like this particular doctor and PRAY she is not the one on call when I deliver! But anyways, so no internal...but my belly measured great again for the week I'm in..Caiden had a perfet heart beat...and she said he was still so active which is great at this time..means he's nice and healthy. It took her like 3 minutes to get his HB cuz he kept moving! My active little boy...Than she scheduled an U/S for me!!! Which at first freaked me out because I've always been told they don't give you one unless something appears wrong, but she said at this point she wants to check on his growth and make sure he's not too big for me to deliver naturally. She said he looks like an average baby by the size of my belly but you never know. And I haven't had an U/S since 23 weeks! And never had one here with these doctors...so after she explained to me the reasons and she told me there was no concern at all...I was excited! Except the next available appointment isn't until Jan 23rd! I'm not sure I'm going to still be Pregnant then..but if I am, I can't wait to see my baby again and finally find out how much he weighs! But it also makes me a lil uneasy that, this close to my due date I'm not seeing my doctor for 10 days as opposed to every 7 days like I'm used too. But oh well, I'll deal.So that was my appointment...kinda upsetting but happy about the U/S. Other than that I feel good! My nerve pain is completely gone! So I don't know if Caiden moved or what...but I am so happy I can walk and sit and not be in pain! Oh yea and my doctor also said he is still head down...so I can definitely feel that. Like when I stand I feel his head drop in my crotch and its so heavy! My belly feels like it weighs a million pounds! But other than that, I feel great! Still sleeping great and moving around good. Lately I've been getting weird nausea spells...but they go away very quickly and than I eat normally. He's still moving around like crazy...I think he's also getting anxious about coming out! So I am feeling MUCH better this week which makes me so happy being so close to the end..especially since I was in so much pain last week! But I'll be 38 weeks this Friday...AHH thats so surreal! I can't wait until we all start posting about our deliveries!How is everyone else doing??",
    "timestamp": "1231870788",
    "title": "Weekly Check-In  January 13th!",
    "user_id": "user_341551",
    "user_link": "/personal_pages/user/341551"
}