{
    "answers": [
        {
            "answer": "I first started 50mg Clomid spring 2008 and got a BFP 2nd or 3rd round of the 50mg. I didn't have any side effects. I m/c a little while later. The DH and I took some time off. I'm on CD 10 of my first 50mg Clomid cycle since 2008. (Everytime I take it CD 3-7). Again no side effects. I did notice that my BBT is higher this cycle than last (non-clomid cycle). I'm hoping to get my OPK today, too. Oh and as a side note, we have been ttc since end of 2006 and just took a break during 2009.",
            "post_id": "5493612",
            "timestamp": "1269266075",
            "user_id": "user_1227048",
            "user_link": "/personal_pages/user/1227048",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear about your MC. I heard of clomid thinn the linning and that why my doc said this will be my last round that he will not put me higher because the risks. I hope that all works out for you and that this time around you get your BFP and that it sticks real good.And I must agree that BBT is change when on Clomid or not on. I have seen that in mines too.keep me posted and I hope all works out for you... SSBD*",
            "post_id": "5493644",
            "timestamp": "1269266568",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Clomid helps you produce follicles but it doesn't guarentee ovulation.  I have to be given an HCG injection when the follicles are ready to guarentee ovulation.  I will be on 150 mg of Clomid this cycle.  I have been on it for 6 cycles or so... with a couple breaks in between because of hyperstimulation (I was not being monitered at this time and the follicle grew so huge and didn't release).  I'm hoping that this 150 mg will work count days 3-7 as well.",
            "post_id": "5493740",
            "timestamp": "1269268340",
            "user_id": "user_778044",
            "user_link": "/personal_pages/user/778044",
            "votes": "0"
        },
        {
            "answer": "Oh my I am gald to hear you are ok after that. thats scary to have hyperstimulation. I hope 150 works for you too.. I hope all goes well and that you get your BFP this time around. I take CLomid because I dont O I have PCOS and it makes it hard to O or even get AF. But have been doing well this time around with Clomid I got my numbers up this time so that is good it was not what the doctor wanted but we getting some where. Thats how I look at it any ways. I hope that Clomid works for us all and that it will bless us with a BFP... SSBD",
            "post_id": "5493995",
            "timestamp": "1269273339",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My lining was thin on 100 mg of Clomid last time. So, they put me on Estrace (estrogen) vaginal inserts.  2 mg a day from the time they start doing the follicle check until they confirm pregnancy.  It helped to build up my lining very quickly and effectively!! I'm sure I'll have to take it again this time around as my dose is 150 mg.  I'm still waiting for AF she hasn't come yet!!! GRRR..... The only time I want her to come and she isn't showing up.",
            "post_id": "5497339",
            "timestamp": "1269353512",
            "user_id": "user_778044",
            "user_link": "/personal_pages/user/778044",
            "votes": "0"
        },
        {
            "answer": "I am comming up to my 2nd round of clomid 100mg this time and also taking metformin this round. Here is my history:I have had PCOS since 1999.Worked out and lost 40pounds in 2006, accidently got pregnant with my wonderful son*.Had Mirena IUD placed and split from his* father.***Got married to a great man who has two kids. So now we have his 5yr boy, my 3yr old boy and his almost 3yr old girl.Took my IUD out July 2009 we'd like to try for a child of our own.8months TTC4 AF visits no ovulation so farapproaching my 2nd round of Clomid, first round though with MetforminAs for side effects.. I have def had hot and cold issues, bad dreams and exhausted, the first round of clomid I actually got sick (but it may have just been a bug). The metformin has made me have other stomic issues and cold alot, also the feeling of tired.I wish everyone luck...and lots of baby dust!!!We're praying for a happy healthy 9months and baby (secretly wishing for a girl).",
            "post_id": "5497387",
            "timestamp": "1269354332",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I don't have PCOS just simply haven't ovulated in 4 months. Last regular AF was November 09. All my other's have been Provera induced. Did clomid 50 mg last cycle and still didn't ovulate. This next cycle doing provera agian and clomid 100 mg. Hopefully I ovulated. Have my fingers crossed. SBD!",
            "post_id": "5497417",
            "timestamp": "1269354936",
            "user_id": "user_1031264",
            "user_link": "/personal_pages/user/1031264",
            "votes": "0"
        },
        {
            "answer": "Has your doc check to see why your not O. See with the not O and not getting AF that is the same that I have but my doc said that is because of PCOS I dont O or get AF on my own. I would find out why your not O if you dont have PCOS. That will be one of the causes that you dont have AF and O. Check into that with your doc because there is some much out there that can help you to O if they know why your not O or getting AF.I send SSBD to all and that clomid helps us all this time...",
            "post_id": "5497680",
            "timestamp": "1269359211",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Today is also my last day on CLomid so happy its over. I had vivison problems yesturday morning and this morning too it was really crazy because I have never had this side effect before and not even this late on clomid so I was freak out and looked up the side effects and yes it was one of the wonderful side effects of clomid..",
            "post_id": "5497685",
            "timestamp": "1269359367",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My doctor thought it was enviormental (exercise, stress...etc) as I just started to go do body pump right around that time. Every cycle before that was 30-31 days to the day!! So we will see.....",
            "post_id": "5497894",
            "timestamp": "1269363231",
            "user_id": "user_1031264",
            "user_link": "/personal_pages/user/1031264",
            "votes": "0"
        },
        {
            "answer": "Hi Ladies!!  I was on provera and finished on Sat.  My af came today so I'm excited to say I will be starting my first round of clomid this coming Sat March 27!!   My doc has me starting at 100mg(prob cause i didn't have af since july 09)  Anywhoo.  ....  im interested in knowing symptoms etc as this is my first time taking clomid.  Just curious though.  what opk's are people using (if any)?  i have the CB fertility monitor but i know it can scew the reading when on clomid.  What's working for you guys and what's not)ThanksSherry",
            "post_id": "5498017",
            "timestamp": "1269365231",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I use first respond OPK I start around day 10 or so. just to make sure I cover all my bases. I say you have a real good doc to start you on 100mg I had to wait 2 cycles before I was on 100mg. so thats great. and the other thing is that clomid may or may not help you O early on like I did last month I O on cd15 I never O so that was good but being that I didnt have high numbers of pergestorne he up to 150mg I take it on CD3-7 because that helps to get the most of the clomid to bring down more eggs.I wish you luck and SSBD let us know what happens with you on clomid and dont get worry about the side effects they are temp, but some are lucky and you wont even feel a thing. Also I would take them at night right before you go to bed and make sure to take them at the SAME TIME every day.",
            "post_id": "5498294",
            "timestamp": "1269368992",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My doc said take cd 5-9 (which is the norm) Would it really make a difference I f I took it  Cd 3-7???",
            "post_id": "5498376",
            "timestamp": "1269370014",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "They say it doesn't matter which cd you start taking. Each dr is different. Im taking mine from cd 3-7 as soon as AF shows from provera induced period.",
            "post_id": "5498545",
            "timestamp": "1269372963",
            "user_id": "user_1031264",
            "user_link": "/personal_pages/user/1031264",
            "votes": "0"
        },
        {
            "answer": "I've always been instructed to take my Clomid CD 3-7 to help induce ovulation. I have heard taking Clomid CD 5-9 is to help with the egg quality. I would call your doctor's office to see if it would be beneficial taking it on CD 3-7. The CB monitor shouldn't be too affected by the Clomid. It might get a little fussy the first Clomid cycles because levels are different from what it is used to seeing with your cycles. It should be fine by the 2nd Clomid cycle, and again, it might be fine from the very first Clomid cycle. Good Luck and Baby Dust!",
            "post_id": "5498706",
            "timestamp": "1269375942",
            "user_id": "user_1227048",
            "user_link": "/personal_pages/user/1227048",
            "votes": "0"
        },
        {
            "answer": "My DR also told me 5-9, but I starting counting my cycle days when I start spotting... cause my cycles sometimes last 8-12days so I need all the help I can get. I technically take my pills on 4-8. Last time I didnt O, nor have 1 for 8months.I have been getting more and more cramps thought after getting AF from Provera, then adding the Metformin and adding the Clomid.",
            "post_id": "5498799",
            "timestamp": "1269377625",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I agree with minney, I've always been instructed to take my Clomid CD 3-7 to help induce ovulation. I have heard taking Clomid CD 5-9 is to help with the egg quality. this what My RE said to me too about the days and yes it is day one of a FULL RED FLOW not spotting or brown that is NOT your cd1.  I have asked many questions to my RE and he is so helpful with these questions. I were you I would take it on 3-7 so that you make sure you get more eggs to Ovulate..",
            "post_id": "5499679",
            "timestamp": "1269396713",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Taking it count day 3-7 should help the follicles mature faster, which in turn would cause ovulation sooner, and be more ideal for pregnancy.",
            "post_id": "5499704",
            "timestamp": "1269397394",
            "user_id": "user_778044",
            "user_link": "/personal_pages/user/778044",
            "votes": "0"
        },
        {
            "answer": "Thanks!! so if i take cd3-7 when do i start bd'ing. tomorrow would be cd 3 for me :)",
            "post_id": "5500553",
            "timestamp": "1269432618",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "You can start BD on the CD10 and start testing with the OPK on CD12 thats what my RE told me to do, and you can bd every other day and on the day you see a + OPK then for those 4 days baby dance everyday.The lil swimmers live 3-5 days so they will ready to load when you O. I saw this show on history about the lil swimmers and they show why they live for 3-5 in a women. must see.. those lil swimmers have so much to deal with when in side our bodys. its crazy that our bodys will kill the lil swimmers, I guess that is a good thing because then we would be like dog having 8 -10 babies at a time... lol...wish you luck SSBD",
            "post_id": "5500697",
            "timestamp": "1269436727",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My dr said to start OPK on CD 10 and do BBT as well....plus Im going to try the CBFM agian. That things gives me so much anxiety as it hasn't worked for me since December but without it I guess I wouldn't of known I wasn't ovulating. The more information you have the better to take to your doctor each month to help them get the right dosage/combo of medicine for you to help you concieve!",
            "post_id": "5500722",
            "timestamp": "1269437292",
            "user_id": "user_1031264",
            "user_link": "/personal_pages/user/1031264",
            "votes": "0"
        },
        {
            "answer": "I start that day too cause I am on clomid and I think that I would O early and I dont want to miss my date. My RE just says to start it on cd12 I dont listen..lol.. I want to make sure I dont miss..and yes it does help much so that your doc can know what to do with you and help make things come alone...I will start my municex tom and I am so happy I am done with the clomid.. time for some BD lol... the municex help with the CM since I am on clomid 150mg the CM become more thick and that is not good for the lil swimmers so what ever I can do to help I will.. it works wonders n better then lube... My DH LOVE it too. SSBD",
            "post_id": "5500777",
            "timestamp": "1269438428",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Question: what do you think is the best OKP?Clearblue Easy Digital Ovulation Testor First Response Ovulation TestI have always used the ones for the internet and they really no good. So this time I will spend the money and get a better one to help get the right answer.So what do you think?",
            "post_id": "5500830",
            "timestamp": "1269439431",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I always used the clearblue digital (easier to read a smiley face)  lol.  I was using from Jul until around nov and it was detecting a surge but no af since july so im one of the few women who has false positives.  (I didn;t know this until last month).  I had gone and bought a clearblue fertility monitor and it had high reading but no peak fertility for 2 months then i just stopped using as i had my doc appt for my referral to start clomid.  I didn't want to waste money if it wasn't gonna work until i got af.  Im gonna try to use the fert monitor even though i know clomid can scew  reading a bit.  I got bought it new off ebay for $100 cdn the test strips are $56 but htats 30 sticks so could possibly be good for 3 months worth.",
            "post_id": "5500915",
            "timestamp": "1269440762",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I just bought 100 strips online from early-pregnancy-tests.com I think... it was only $49.50. My friend and I are going to split it, so 50 tests for $24.75!!I am excited, starting clomid today and my cycle is very light this time- thank god!!!",
            "post_id": "5501041",
            "timestamp": "1269442838",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I think I will get the smiley faces I think that would take out the guess out of it. I used First Response Ovulation Test last time and it was better then the online test. So I think smiles are better..lol...yeah I hear the fert monitor is the best but I dont have funs right now for that so will just get smiles lol... thanks girls.",
            "post_id": "5501130",
            "timestamp": "1269444046",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I have never ovulated to not know if they work well for me or not.... We'll see this time around and go from there. I will have more than enough and hopefully can give the rest to my friend when I fall pregnant!!I am for some reason skeptical on the digital tests... but my DR will know for sure once it is all said and done!!",
            "post_id": "5501274",
            "timestamp": "1269446088",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Yeah I know what your say I was too but it takes the whole guessing game out with the digital ones. I never knew if it was a yes or no and would have to wait for my CD21 to test to see if I did O.what ever way you look at it they all do the say things, so we will just see what happend this month for us all...SSBD",
            "post_id": "5501298",
            "timestamp": "1269446442",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My DR called.. My blood tests came back normal.. I am not at risk for Diabetes and we can continue doing the meds that I am on to try to get an O!!",
            "post_id": "5501515",
            "timestamp": "1269450200",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Thats great news. Let hope this is our month.. \"LETS GO CLOMID LETS GO\"!!!!I am so happy about this month for all of us... SSBD",
            "post_id": "5502738",
            "timestamp": "1269472528",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Man last night I had bad hot flashies. I was like a crazy person last night... dam clomid.. I thought since I was done with clomid that I would not have the effects after. thats crazy its never happen to me before but I guess every time is different.I started my Mucinex today and OPK testing so happy. I didnt see a smiley face today but will keep testing this week.SSBD",
            "post_id": "5504563",
            "timestamp": "1269524416",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Well  i think im gonna go against my doc doing cd5-9.  Im gonna do cd3-7 which means i start today!!! yeah :)   I went and bought my CBFM test sticks last night and went and did my day3 bloodwork and fasting test this morning.  Im extremely tired as my 4 yr old came home from pre school yesterday pukin her guts out :(  she was up all night so has made work today a little hard. (I made the hubby stay home with her)   lol This should be interesting cause it's always me who looks after her.    Anywhoo.... life is good, life is great, lets get this baby dancin started can't wait!!  :)  Cara looks like we'll be cycle buddies :)",
            "post_id": "5504694",
            "timestamp": "1269527001",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Hope you get a +opk.. I hope I get one too... I have never had one ever!I too hope this is the month for all of us!! Or a BFP in April, before I go to my sisters wedding (out of state). She is having one heck of a reception- so dont wanna drink with baby on board.",
            "post_id": "5504697",
            "timestamp": "1269527053",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "thanks I hope so too for all of us, as my doc said that I never did thanks to PCOS but I am hopefull this month. I so can wait for us to get our BFP!!! I this part of the game the (BD) is always fun. I just hate the TWW but I will love to see the at end BFP...I am happy that you girls are right behind me with CLomid. I hope you girls a good 5 days with no bad effects and that you girls O this month too.3-7 day is the best I love it cause I cant wait I like rolling the ball and getting things going fast. lol...SO GOOD LUCK TO ALL THIS MONTH AND THAT APRIL BRINGS US BFP!!!!!SSBD",
            "post_id": "5504850",
            "timestamp": "1269530333",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Lets hope.. I am on clomid day 2 and metformin I have been on for almost 2 weeks!!I keep praying and so does my hubby!!",
            "post_id": "5505142",
            "timestamp": "1269535455",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Yep Baby dust to us !!!!!  I'm starting at 100mg first round and will take first pills tonight before bed!!  I'm really excited. We've been trying for one year.",
            "post_id": "5505179",
            "timestamp": "1269536123",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "This is my first moth on clomid. I have been doing my BBT for forever now with no recent luck. They say I have a complete blockage in my right tube and that causes irregular ovulation. Yesterday was my last day on clomid. I was also instructed to take it cd 5-9??? I wad super moody and retarded tired the whole time I was on clomid and I got horrible headaches!!! But if it brings me a baby it will all be so worth it. I'm so greatful I joined this forum. I am learning so much from everyone. Good luck to all you ladies!!!",
            "post_id": "5505212",
            "timestamp": "1269536653",
            "user_id": "user_1252727",
            "user_link": "/personal_pages/user/1252727",
            "votes": "0"
        },
        {
            "answer": "The good thing for me starting today is I have the weekend to kinda get used to the effects if I have any. Nice to have a few women on similar cycle days - makes it easyier for us newbies!!  I also chart my BBT on fertility Friend. I just started to do it last month but was all over the place since I didnt have a period and a couple days i was sick so i had scewed #'s.  Hopefully this month it will start to look normal :)  Happy BD'ing!!!!!!",
            "post_id": "5505260",
            "timestamp": "1269537298",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "(((((\"LETS GO CLOMID LETS GO!!!!!\")))))SSBD to all and that this round brings us all our BFP!!! stay strong and + all will work out.Its great to have so many so we can share the love of clomid and getting our BFP soon...yes Happy BDing to all.. my spring break is def going to be fun... I am off this whole week and this is the week I should O so that is great timing.",
            "post_id": "5505636",
            "timestamp": "1269544860",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "good luck to you as well as the rest of us... Welcome to the fourm, Sobie and I have been chatting it up a few weeks now... sherry too!!the side effects for me were alright the first time, more expected this time- glad I dont have to worry about my eyes here at work. I am off tomorrow and for the weekend!I hope the Clomid works for all of us this time and we dont have to do another round. Speaking of headaches I have one now!",
            "post_id": "5506018",
            "timestamp": "1269551381",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "GL Ants!!  I started my 100mg clomid last night, so far so good, no side effects yet. Next week is gonna be a busy week!!  LOL",
            "post_id": "5508319",
            "timestamp": "1269613651",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "you know that I have been off of clomid for 3 days and man I still having hot flashes, thats crazy I hate being hot I live in fl so it feels worst to have these hot flashes...Yes next week is going to be a busy week..lol..",
            "post_id": "5508421",
            "timestamp": "1269616099",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Well I made it through the weekend on Clomid!! my last pills are tonight.  Lucky i've had no side effects :) thus far (knock on wood).  Happy BD'ing this week everyone!!!!",
            "post_id": "5516818",
            "timestamp": "1269863906",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "thats great sherry.. Happy BD to all",
            "post_id": "5517215",
            "timestamp": "1269873463",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Got baby dance fever?I am clomid free today, started the morning off great and hope to get a pos OPK. When should I start taking the tests....? I am on CD 10 I think and have like 30 tests... dont want to go 30days of testing before I get an O though.",
            "post_id": "5517260",
            "timestamp": "1269874214",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "did you take cycle day 5-9?  if so my doc said cd 12 you should start checking. I took Cd 3-7 so im gonna start checking this thursday!!",
            "post_id": "5517404",
            "timestamp": "1269876741",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "T technically took clomid days 4-8 (since I spot for the first day- which I count as cd 1). I would be elig to start OPKs then Wednesday or Thursday as well then.",
            "post_id": "5517561",
            "timestamp": "1269879371",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Well just had a call from the doctors office :(  my day 3 blood work and fasting test came back and my thyroid level is a little high??  They want me to go back and redo it.  If its not one thing its another!!!! I've never had a thyroid problem before.  This just put me in a bad mood :(",
            "post_id": "5517824",
            "timestamp": "1269883852",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear sherry.... everything should be just fine- maybe they messed it up.. Keep us updated. Much luck to you. I hope we get +OPKs this week or next!!!!",
            "post_id": "5518488",
            "timestamp": "1269894710",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "OMG I am sorry to hear that Sherry, I hope it was a mess up and you will be fine. I wish you the best and dont stress out mama.. I too hope you get a + OPK and SSBD to all",
            "post_id": "5518628",
            "timestamp": "1269896939",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I'm starting my 2nd round of 50 mg clomid tomorrow on cd 3.  But my periods have been so weird last few months. I get it really heavy and awful for a day and then its like goes to spotting for few days and done. I was really tired last cycle on clomid. And then when got period was few days late and no symptons til actually had it.  So...round 2 see what happens.",
            "post_id": "5519108",
            "timestamp": "1269907930",
            "user_id": "user_1170827",
            "user_link": "/personal_pages/user/1170827",
            "votes": "0"
        },
        {
            "answer": "I hope this round of clomid works for you. I was on 150mg on round three. I hope it works for us all.. SSBD to you and I hope you O and that all else works out for you.",
            "post_id": "5519458",
            "timestamp": "1269915355",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Thanks!!  The doc just said it was a lil high so he wanted me to redo it (PITA) Prob means more meds!! Sigh  Anywhoo, im going today to go do it and start bd this weekend!!",
            "post_id": "5520318",
            "timestamp": "1269950264",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "good to hear. have fun BDing.. SSBD",
            "post_id": "5520397",
            "timestamp": "1269952600",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I am out of sorts today, kind of emotional (not really sure why)  I heard a piano song this morning and started crying at work !!  google this and tell me what you think of this song?     http://www.youtube.com/watch?v=P_23saDFZGw",
            "post_id": "5520547",
            "timestamp": "1269956243",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "lol.. that is normal, that is due to clomid and it just the hormones working. I too would cry for every lil thing, that DH would say what DA you crying.. Thats one of the side effect of clomid. you will be fine it will soon pass.",
            "post_id": "5520552",
            "timestamp": "1269956395",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "My moods are always changing since TTC. Earlier my husband mad a comment about wanting to baby dance and I laughed at him, he replied trying to make a baby is a \"serious matter\" to me. Would you have chuckled to? LOLI cry to TV shows any more- ever since I had my son, my emotions are like a roller coaster!Cant wait to get a positive OPK... had lots of watery CM, so maybe I am closer than I think to Ovulate!!",
            "post_id": "5521685",
            "timestamp": "1269977738",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Thanks! I had a small cyst on left ovary from last round of clomid. I'm hoping no more of that.Hope it works for you too. Hope this is all our cycles!!! BDJust took my first clomid for this cycleCaralea-I understand! I have felt just like I'm on rollarcoaster recently! One minute I'm sad, then I'm doing pretty good, and then watch out!!! HahaHope you get a good OPK!!!",
            "post_id": "5522563",
            "timestamp": "1269996660",
            "user_id": "user_1170827",
            "user_link": "/personal_pages/user/1170827",
            "votes": "0"
        },
        {
            "answer": "Good luck to you too.",
            "post_id": "5524213",
            "timestamp": "1270045485",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Your getting close that is great... cant wait to hear that you got a +..nazor82wow I am sorry clomid did that to you I know them things hurt... I hope this time is a good round for you and that you get a + OPK and a BFP this time around..SSBD to all",
            "post_id": "5526025",
            "timestamp": "1270081150",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Congrats on your O... hope the TWW is well worth it and you get a BFP!!",
            "post_id": "5527606",
            "timestamp": "1270130850",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "thanks mama and I hope you get yours too.. SSBD",
            "post_id": "5529340",
            "timestamp": "1270166459",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "If you take Clomid for 5 days from 3/24/2010 to 3/28/2010,you would expect to ovulate between 4/2/2010 and 4/7/2010.You can start LH testing for ovulation on 3/31/2010.Optimally you would start making love every 1-2 days starting on 3/31/2010.So far no postive OPKs.. still praying hard though!!",
            "post_id": "5531079",
            "timestamp": "1270226014",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I am praying for you too mama I have faith it will happen dont stress out it not good for you and will not help to O. I thought I was not and I did. It will happen you mama just relax enjoy BDing and let all else in god hands.. SSBD",
            "post_id": "5532292",
            "timestamp": "1270255974",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Anyone else had problems with cysts from clomid? I just took fourth pill tonight in my second cycle of clomid. I'm worried about getting more and wondering when the one I have will go away. I\"m still having pretty constant crampy from it but right now doc isn't concerned because she said it is too small to cause any issues and it should just rupture on its own.Good luck to you all!!!",
            "post_id": "5532334",
            "timestamp": "1270257775",
            "user_id": "user_1170827",
            "user_link": "/personal_pages/user/1170827",
            "votes": "0"
        },
        {
            "answer": "OK, so I started on Clomid this last Saturday. I was feeling fine on Sunday until around 4pm or so.. I had a hot flash first and after a couple hours hubby and I were going through our budget and  I couldn't put my thoughts together, things didn't make much sense and when I realized it, I started crying.. haha. Then we went on to get some dinner and while we were waiting for our cook (Japanese steakhouse) I started having this surreal feeling, like if I was in a dream; it lasted about 10-15 min, then I was fine except for some hot flashes. Then this morning I woke up around 4am to go to the restroom and I was so dizzy I could barely walk.  Has anybody felt that before? I guess the good thing is that I know clomid is having an effect on me, hopefully a good effect!",
            "post_id": "5537774",
            "timestamp": "1270471148",
            "user_id": "user_1248719",
            "user_link": "/personal_pages/user/1248719",
            "votes": "0"
        },
        {
            "answer": "I am sorry to hear that Clomid is making you feel this way. What mg are you on? Hot flashes are normal and the dizzyness too Crying is also another one so all this is pretty normal it is due to the hormone change due to clomid, I had all that on a low mg of clomid as I went up to 100mg and 150mg I didnt have any side effects at all while on them but when I was done I had hot flashes and it went away after 2 days and I turn into a big cry baby after thanks to the hormones...but I hope it works out for you as I am on my 3rd round i hope my last.SSBD keep us updated... I hope it makes you O...",
            "post_id": "5537914",
            "timestamp": "1270474876",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I'm on 50mg. I feel better to know others have the same side effects. I don't seem to react good to strong medications and always end up getting most of the side effects. Anyways, good luck to you! Hope it's your last round. :o)",
            "post_id": "5537968",
            "timestamp": "1270476302",
            "user_id": "user_1248719",
            "user_link": "/personal_pages/user/1248719",
            "votes": "0"
        },
        {
            "answer": "CD 16 hoping still that either my OPKs missed my window.. I had lots of egg white CM yesterday- hubby loved it! sorry TMI. Hoping that I can just ovulate.100mg so far seeming positive. I am staying positive and very hopeful.Glad the symptoms werent as bad, but I still get hot flashes.. the metformin has help some keeping me grounded. LOLSSBD every one!!!",
            "post_id": "5538038",
            "timestamp": "1270477730",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear that meds make you have their side effects that sinks. I hope it works out for you and thanks. 50mg is the worst it will get better. I hope it works so you dont have to take another round of them. but stay + and all will work out.Caralea, I hope you O and those test where just wrong, if you had EWCM you should have O or will be soon. I wish you tons of luck and SSBD keep BDing and see if your CM changes.best of luck to all..",
            "post_id": "5538072",
            "timestamp": "1270478297",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "well im right behind cara on cd 14. my fert monitor still says high (im hoping i get peak) i guess if all goes the way it should - i  should O sometime this week.",
            "post_id": "5538109",
            "timestamp": "1270479056",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "So girls... question... does anyone else have lots of pressure in the uterine region?I feel like I have the pressure of needing to go pee, but it is all the time mainly. I know in the last few days I have had \"twinges\" or cramping on my left side... not sure if its ovulation- hoping so...I am guessing it is all normal after having a child 3yrs ago, but hoping that this round works!!Will be OPK testing here in a few.",
            "post_id": "5538203",
            "timestamp": "1270481023",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "hello ladies,i have a couple of questions. I have been reading all of the posting and I am glad to know that there are other women out there who are going through silimar things. I am about 4 wk out, I had my last pd on March 4. started the clomid on day 3. I spoted for the first 3 days, then became hevy for 3 days, then spotted again for 3 more days. A total of 10 of bding. 2 days go by and nothing. Then i start spotting, very very little, maybe 2 spots of pinkish blood. I took clomid for 5 days. This time around I was taking 150 mg daily. I had tried Clomid last year, and M/C my son at 7 months. After all the spotting, my husband and I, had our fun everyday for the week followed. I should note that when I was spotting, I didn't know I was having my pd, I thought it was just spotting after intercourse. So the week before and after were pretty much everyday of baby dancing. Now I am sitting here 4 wks letter and I am having the worest time ever!!! 2 wks ago, The middle of March, I started with just my really nausea, light headed. Thought it was just the side effects of the medication. Then I started with a couple of days of heart burn…umm ok? Then I went 4 days of just “morning sickness”. And feeling nauses, light headed all day long. Meanwhile I am going very frequently to the restroom. Now I looked myself in the mirror 2 wks ago, and I noticed that my breast were just a little perky and getting really swallow. I just put it as ok side effects! Now my menstrual cycle came natural this time. But I hadn’t had a menstrual cycle since December 2009. I took urine test all have come back negative.  Also now, I just don’t know when to take the test to see, nor what is going on. I called my doctor and he is out of the country on Vacation. GREAT!!  I am feeling so sick, and my breast hurt to the point that I would be more then happy to rip them off (sorry if I offened anyone), but that is to the point they are hurting. Dose anyone have any information on how long the side effects of Clomid should last?",
            "post_id": "5539159",
            "timestamp": "1270499165",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Ok when was your last AF?Second if you had all - then you are might be feeling these things due to clomid I had the same problem on 100mg of clomid I had all the prego problems and I was not I even had the doc think that I was and he was even happy cause I had all the signs and when we did blood work it came back - I was so hurt he said I was feeling that way because of the hormones that is due to clomid. clomid stays in you for 6months. I read this some where and you will have some effects due to the hormones in your body to make things ready for with baby.Now if your late a least a week late from AF you should test but due a blood test with your doc just to make sure.I wish you luck and I hope its that your with child....SSBD and welcome to the clomid family..",
            "post_id": "5539241",
            "timestamp": "1270501118",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "We will be making a new form this one is getting long.it will be named the same just with pg2 on it.What cycle of Clomid are you on?? any side effects?pg2",
            "post_id": "5539246",
            "timestamp": "1270501238",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "The pages keep continuing on and on... just so you dont have to make new ones sobie...Rain- sorry about your baby and that you're going through all these symptoms.. the hormone changes, hot & cold flashes, dizzy spills, neaseua- ALL SUCK. I have had them all the last 2 rounds of clomid, I am 6days post 100mg clomid, I think? and just waiting for that +OPK.Keeping positive for everyone and my self. lots of baby dust to all you girls!!",
            "post_id": "5539505",
            "timestamp": "1270507315",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I know the they keep getting bigger but it slows down the info on here that is why I started a new one its just way to long this one.",
            "post_id": "5539707",
            "timestamp": "1270512811",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Good Morning to all-6 months! wow, doc didn't tell me all that information. When I was reading for information on the internet, I don't think I read that much information as far as how long it would be in your system. I did read in a book, that states that the side effects would only last for as long as you take the medication. But today, I am feel horrible. I don’t know when to test, because I have been irregular, for the past 6 months. December , I had a cycle for 16 days. Then nothing until March 4th. Yesterday night, I feel asleep and for some reason I ended up sleeping on my stomach and I felt this crazy “butterfly” feeling. Which made me wake up, I thought my dog was under me or something(sometimes she jumps on the bed and gets under the covers). I am not sure,  when to test because this past month in March I was bleeding from March 4th until the March 13th. Then it stopped and then March 15 & 16th spotting but barly! So should I just wait until the 15th or 16th? I don’t want to make myself crazy, because I feel as though, you can make yourself feel and act pregnant. I know you should take care of yourself as if you are until you are for sure.",
            "post_id": "5541156",
            "timestamp": "1270561022",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Check out my new uploaded. I think I got my + OPK!!!!I am so excited.. I tested at 8pm last night and it was so close/dark. I hope it is a positive. I also have a test from this morning. We used our preseed last night and will do the BD for the rest of this week.  Oh pray for us to make this happen... almost 9months and I am pretty sure(96%) I finally got my pos OPK!!Let me know what you think!Lots of luck everyone.. I know how hard it is to try and try again.. 8+ months almost 9 and I may have a light at the end of this tunnel!!   Hope we get pregnant.BABY DUST ALL!",
            "post_id": "5541348",
            "timestamp": "1270564383",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Congrats Cara!!!!  Im hoping in a  couple days to get mine!!  My lower stomach feels weird today.  Kinda like constipated only i'm not - its a  dull pain - maybe thats telling me im gonna O soon?? or maybe a cyst growing?  Man oh man.  I've been using my fertility monitor but im only getting a  high reading.  Im hoping to see peak :) but im also gonna start to use the cheap O  pee sticks starting today to get 2nd opinion.  Anywhoo, happy BD'ing this week",
            "post_id": "5541375",
            "timestamp": "1270564833",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I starting having twinges a few days ago.. and more recently it has been a feeling of pressure/constipation/gotta pee. It is not very sharp or painfull but akward and noticeable druing the baby dance.Hope it works! Hope you get a BFP OPK too!!!",
            "post_id": "5541493",
            "timestamp": "1270566320",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "What would it feel like if a cyst in growing? I have been running to the restroom alot more for the past two weeks, and some pressure. I have this like \"butterfly\" feeling...not sure at all!",
            "post_id": "5541592",
            "timestamp": "1270567724",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "My DH and i have been ttc for 3 yrs now. Im currently on CD 23 of my 4th round of clomid 100mg. I had my progesterone test yesterday (since cd 21 was Sun) haven't gotten results yet, but over the past few months it is definitly helping in keeping my hormones more balanced and cycles regulate. I was dx with PCOS when I was 18. This month we've been using preseed and my doc added metformin 500mg to the mix. I don't use OPKs they never work for me, so we just do the BD like crazy from the time I get off the clomid till AF comes and hope for the best!  Good luck to everyone TTC trust me  I KNOW how difficult it is! BABY DUST TO ALL! :-DOh and Caralea.... I had that same pressure/ gotta pee/ feel constipated feeling last Friday not so much painful as annoying so maybe thats when I ovulated :-)",
            "post_id": "5541724",
            "timestamp": "1270569594",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "That sounds.. like ovulation.. I had similar things in the last week as well.. with a cyst you wont really feel the growing per say.. but you'll know if it ruptures..",
            "post_id": "5541772",
            "timestamp": "1270570248",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I would wait till AF is due to test, when did you O or have you not yet? I hope its good news.. With PCOS it suck not to be normal I know I have had this all my life and now I think my daughter too will have PCOS and I feel bad for her already and she is only 11. Keep your head up and I hope for the best...Hey any one knows what the stars are for??just saw that...",
            "post_id": "5541891",
            "timestamp": "1270572523",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I am guessing frequency on the forum?",
            "post_id": "5541961",
            "timestamp": "1270574051",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I've had one rupture before  when i was about 19 and its painful!!   i actually went to emerg cause the pain was so bad - they thought it might have been my apendix or etop preg - but it came back and said was prob a cyst that ruptured.",
            "post_id": "5542171",
            "timestamp": "1270577577",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Ok so I just got back from lunch and out of nowhere a fairly intense cramping in my lower left abdomen it me. Surely its not me ovulating this late in the cycle is it? Also do any of you experience a slight itching in the inside of your nipples (sorry tmi)? it happens off and on through out my clomid cycles but this month its more constant I just want to scratch like crazy! lol Oh and btw thanks for letting me join this group, I've stalked this site for months and finally chose to be part of its truly amazing support.",
            "post_id": "5542229",
            "timestamp": "1270578406",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "lin_z_ttc1: Welcome, I love everyone here! everyone is so nice to each other. I actually had the same thing happen last week. I had cramping, but I had already ovulated begining/middle of March. My nipples are on there own world right now..LOL! they itch, they hurt, they are tender! they are perky, and they are getting big. But I dont know about prego just yet..since I haven't checked yet. But I am having all of the sym. to go with it, but as you know they same symp go when you are expecting your monthly friend.",
            "post_id": "5542269",
            "timestamp": "1270579171",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Sobie: ok I am slow what does AF stand for? I thought I wrote this before but it is not showing up on here.",
            "post_id": "5542281",
            "timestamp": "1270579271",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "That is ok I didnt know what it was till I join here too. It means Aunt Flo (your period)",
            "post_id": "5542314",
            "timestamp": "1270579889",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "LOL! LOL! OMG! gotacha! well this is the thing, she has been very irregular! last time I had my AF was March 04th. Lasted until March 13th. So should I test now since it is the 6th or should I wait until the last day of the menstral cycle. Now this is also the catcher i am irrgular should that matter?",
            "post_id": "5542401",
            "timestamp": "1270581153",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "WELCOME!! Glad to know someone else has had the feelings I have.. I finally can join the TWW club here soon. This site is amazing!!!! I love the advice and that others are going through what I have. My Dr is a man and is great- but it is not the same as sharing will all of these wonderful women with the same things.I was on provera to get AFthen clomid 100mg days 5-9and I take 500mg metformin 2x dailyOPK+ yesterday 1st in 9months",
            "post_id": "5542417",
            "timestamp": "1270581378",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Mine were always very sporadic until i started the clomid now they're 34-35 days like clockwork. Did you ever get a pos opk? if so then i would say wait 14 days past the + to get an accurate reading. Or you could be like me and POS several times and not believe any of the BFNs until AF does show up lol.",
            "post_id": "5542453",
            "timestamp": "1270581894",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I agree Cara!!  This is a fantastic site.  Im 2 days behind ya so im hopin for my + opk very soon!!! There are just some things that my hubby wouldn't understand about pcos  so this is where i turn too and grateful for all the support from women going through the same things as I am.  A Place to laugh, cry, vent, educate.I was on Provera to get AFthen clomid 100mg cd3-7 (first round for me)",
            "post_id": "5542458",
            "timestamp": "1270582003",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Ok so my question to you is this... My gyno just wrote me the rx for the metformin w/ 3 months of refills, but she never told me if/when I should up the dosage. Will just 500x1 a day be as effective if I were to increase it? I keep hoping and praying that this is it. Its somewhat reassuring to know that I now get AF naturally (had to have provera back when we started the process last Nov.)  Heres what it was like: ( I always take it 5-9)provera+clomid 50mg= .6 21 day progesteroneclomid 100mg+prenatal vitamin= 7.4 21 dayclomid 100mg+prenatal vitamin= 13.8 21 daynow its clomid 100mg+500 met.+ preseed+prenatal vitamin= ? 21 day",
            "post_id": "5542496",
            "timestamp": "1270582462",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "lin_z_ttz1: because I am having so many sympthoms right now...my breast are hurting, lower back pain, nausea in the AM and sometime througout the day, and many more restroom breaks, I was and bought like 12 prego test last night. But I am scared to take it. I took one last week, and it didn't work, no even the control window poped up. So thats a no go. I should be getting my AF soon..IF i am not prego, and if she feels like coming. My ob is out of town right now, and I can't get to my PCP till next week. So I am on the waiting game. I am just hoping that I can find out why I am having all of these things going on...which could be the side effects of clomid...could be my monthly freind....or it could be all in my head. BUT I know that my breast are really bothering me, and I can't sleep on my tummy, because I get these feeling, then I want to run to the bathroom to throw up. TMI! sorry",
            "post_id": "5542525",
            "timestamp": "1270582908",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Yeah I know what you mean. I've had pseudo symptoms the first couple of rounds on the clomid where I KNEW I had to be pg only to find out nope. I've since decided I'm not going to test at all unless I go 40 days without a period lol. If I were feeling like you, I would probably take one in the morning for sure, just to see. Its weird for me because this is the first month I'm not feeling everything you are. I had the dreadful hot flashes and bloated feeling a couple of weeks ago, and now.... not a thing. I'm worried I've become immune to the clomid, and my dr. refuses to treat any of her patients with anything more than 100mg of clomid. I'm actually the first and only one thats talked her into letting me take metformin, she doesn't think it has any effect on ttc :-P",
            "post_id": "5542567",
            "timestamp": "1270583534",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "lin_z_ttc1: I have been on clomid for a year on and off. But since my special friend came by her self this past month, I said hey ill take clomid. doc said that was fine because we did a blood test and nothing. But it wasnt the same this month. Usually I am bleeding for a couple of day heavy. This time around, spotting for most of the time, so I didn't think I was on my period, because we had been bd alot during the week before hand and during 3 days of the spotting. Until I saw a little bit more, and I was like ok, she is back! But not really full blown like it normally comes. I have been having hot flashes like crazy, well now in my office I have a fan on me really all the time. But I had to buy a new bra cause these bad girls are on a different world that I am on right now.(I did that at lunch after my bra popped when coming into work) Last week I fealt bloated, LOL i looked like I was 5 mo prego. I was like OH NO! this week bloating is gone, but the girls are really bothering me to touch, to put clothes on them, to shower. Sick feeling, but then again it can be all in my head. Then mood swings. Oh hubby is like he married a crazy girl! he has never seen me like this, but neither have I. I have cried during movies, and shows on TV. I know that Clomid changes your emotions but 4 wks later?!?!?!?!??!",
            "post_id": "5542615",
            "timestamp": "1270584244",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Yeah I'm still dealing with the hot flashes and my last pill was 03/19. In past cycles my moods were AWFUL. Like it amazes me my hubby put up with me as well as he did. I was extremely irritable, depressed, very angry at people around me that were getting pregnant (there are 3 at my work right now). I would get terrible migraines, and cramps. My breasts would (and still do) sometimes feel kinda tingly, but nothing big or excruciating. Its hard for me because mine are pierced (tmi sorry) so I can't decifer if its med related, pg related, or just the rings snagged lol. My flow has always been a steady 5-6 days tapering off at the end. It is possible its still the meds, I heard the s/e can last up to 6 wks past the last pill, BUT we can still hope its from the little one in the making! :-)",
            "post_id": "5542660",
            "timestamp": "1270585050",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "as my husband would say: \"is my son baking yet!\"",
            "post_id": "5542702",
            "timestamp": "1270585784",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "HAHAHA yeah thats a good one. My husband and I just talk about what its going to be like when we have kids, I tease him about what it's going to be like when we have a teenage daughter (he's never had to deal with girls only boys) Its sad, we actually have 3 dogs and a cat and refer to them as \"the kids\" lol hmmmm.... someday..... I hope.....",
            "post_id": "5542750",
            "timestamp": "1270586685",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "My Dr started me on 500mg 2x a day for the metformin.. I have heard really good things about the effects w/ clomid and ttc. I just hope it works... with some pills (like clomid) the increased mg helps the effectiveness. I would say ask you Dr, doesnt hurt.*it could have to do with history and body type though.. like weight and age and such.Wish you luck hope it all works!!",
            "post_id": "5542861",
            "timestamp": "1270588460",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Yeah thats what I've heard too. It took me 3 mo to talk her into me taking the met, because she just doesn't think it does anything, but whatev, I'm on it now, lets just hope 500mg is enough to help! My last consult with her, she said she'd keep me on 100mg Clomid, add the met, and if I didn't get preg by June she'd have to refer me to an RE somewhere (there's none where I live). So i am hoping sooooooo much that it works because I do NOT want to do IVF. I'm just ready to be a mama! :-D ugh... out of nowhere in the past hour my nose started running and I'm sneezing like crazy.... maybe its a good sign?",
            "post_id": "5542931",
            "timestamp": "1270589536",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I had to talk my DR into it as well. I did provera 2x already and clomid 50mg then 100mg this last time.I am finally am ovulating with the help of provera to get AF and clomid for the egg and metformin just cause! LOL",
            "post_id": "5543056",
            "timestamp": "1270591431",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Waiting for peak time on my clearblue monitor. I'm on cycle day 10 and its been high bar since yesterday. I really hope I peak by friday as DH is going on a business trip.This is second cycle of 50mg of clomid for me. I too have been feeling bloated or constipated even though i'm not for a few days. Wierd.Baby dust to all!",
            "post_id": "5543100",
            "timestamp": "1270592229",
            "user_id": "user_1170827",
            "user_link": "/personal_pages/user/1170827",
            "votes": "0"
        },
        {
            "answer": "I know how you all feel I have been on and off clomid a total of 7 times this is the first time I have gone 3 months in a row. I was on round 3 150mg 3-7cd and man this clomid make me so bloated I look like I am 4months along I have people ask me when is the baby due and its funny when I  tell them I am not the reaction is the best ... HAHAHA I am happy to hear that I am not the only one that has this great side effect, it hard because I cant fit into my pants any more DH laughs and is like OMG what is that... I would play and say the twins..lol..when I was on 100mg on round 2 , and I O for the first time in forever. I had all the prego symptoms and I was so + that I was prego but doc told me no it was all clomid's doing and I was so hurt...But in your case it just might be that you are prego I would say if you want you can test if you see a - then wait till AF is due.I wish all the best for you all and tons and tons of Baby dust... I will not test on till AF is past due. I dont want another let down. I go in tom for my blood work of 21cd so I hope I have some awesome numbers showing I O good this time...",
            "post_id": "5543620",
            "timestamp": "1270601016",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Do clomid side affects get worse with each round? Cause my first cycle on it I felt pretty good, didn't really notice much besides a little tired while actually taking it. But this time around, I feel so emotional and bloated. I know everything about ttc makes you more emotional but this cycle it seems way worse for me.I won;t test til after AF is past due either. I think it just makes things worse for me.",
            "post_id": "5543979",
            "timestamp": "1270607120",
            "user_id": "user_1170827",
            "user_link": "/personal_pages/user/1170827",
            "votes": "0"
        },
        {
            "answer": "well i've been BD this week.  my temps look good.  I had a drop in temp this morning!!! and not really sure what to make of my opk. my CBFM says high reading and the pee stick one the line is almost as dark as the control line but looks like a  +.   I think I'll take a pic and post so you can tell me what you think.  Im crossing my fingers and hoping my O comes in the next couple days :)",
            "post_id": "5545062",
            "timestamp": "1270642775",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "lin_z_ttc1: your not the only one that calls their animals kids. My girl doberman is my daughter, and we have a puppy pitbull which is our son. So when I get home I am alwys talking to them as if they are kids. \"Did daddy take yall out today\", or ill ask hubby, \"lets go out with the kids\" then out bird is \"the baby\" LOL! You dont even want to know the worst part. I always buy my \"kids\", clothes, shoes, toys. ya I am one of those people. Not really clothes, but my daughter/dobi so when she was younger, it was bad! summer dresses, holidays. lordy my kids!!Last night I had a really really emotional evening. Out of the blue every time I sat next to hubby for some reason I was just wanting to tear up. He really thinks I am going crazy. I am still having really bad tenderess and heavy feeling in my breast. I try to eat but really dosn't go well with my tummy. Then the cramping I am having in my lower abdomn, and in my belly botton region. I dont know what is wrong with me. I dont like how I am feeling cause I hate complaining about feeling sick. Hopefully this all well turn into good news!",
            "post_id": "5545169",
            "timestamp": "1270644980",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Clomid makes your hormones crazy but not all rounds will give you the same affects. I had it bad on 50mg but on 100mg I had nothing at all  then on 150mg I was really emotional and hot flashes at night after the pill, had vision problems in the morning. So it all depends on what your hormones are that month I guess.Good to hear that everyone is moving on great and all is working out.. I cant wait to see success stories on here about how clomid worked for them...I send tons of BABY DUST ********** to all..",
            "post_id": "5545325",
            "timestamp": "1270647155",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Almost on the start of my TWW... we are going to continue the bad dead all week and pray for the best!!",
            "post_id": "5545474",
            "timestamp": "1270649524",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Yeah I know I cant wait and yes keep BDing make sure to cover all your bases... I am so happy for you...Tons of baby dust right at ya...",
            "post_id": "5545504",
            "timestamp": "1270650051",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Thank you. I just keep getting tingles and thinking happy thoughts!!I pray that this works and my son can have a baby sister. He just turned 3 in Mar, so at any rate he will be almost 4 and potty trained!!   My husbands two, his daughter will be 3 in June and his son 6 in Oct this year. I am excited to not have to keep buying a box of diapers every 2 weeks for the toddlers!!",
            "post_id": "5545556",
            "timestamp": "1270650918",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Well I went and worked out last night go me :-D I've heard exercise with met helps a lot and going really energized me. Me and DH were picking at eachother before we went so it was nice to get a good workout and forget about it... although the hot tub was nice after I couldn't feel my legs LOL. I haven't BD'd in a couple of days just been too tired, we did bd cd 9,10,12,14,16,17, and 2x19, so hopefully one of them were bound to do something. I'm still worried that I'm not feeling anything yet, its cd 24 for me.... shouldn't I be feeling something???",
            "post_id": "5545661",
            "timestamp": "1270652234",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I got my +OPK tonight!!  I tested this morning and i wasn't sure so i retested at 5 pm and it was a def positive!!  I will try to post a pic but the pics wouldn't turn out htat well.",
            "post_id": "5547589",
            "timestamp": "1270682202",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "well im kinda confused. I clearly got a + on the pee stick last night  (it was darker than the control line) but when I did my clearblue fertility monitor this morning it still only showed as \"High\"  not peak.  Not sure what to make of it.  I'll do the pee stick when i get home today from work and compare yesterdays to todays.",
            "post_id": "5549170",
            "timestamp": "1270727477",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I took clomid and one of the major side effects was hot flashes! I felt like I was going through menopause...however it was not too bad, it was my first cycle although I did not need it, I took it in hope of releasing more than one egg because my DH has low motility and were IUI's.  We became pregnant on the second IUI!! 6 week preg now.  We tried for 2.3 year naturally...I understand the dispair and fustration all too well! Keep your hope!",
            "post_id": "5549188",
            "timestamp": "1270727925",
            "user_id": "user_1270452",
            "user_link": "/personal_pages/user/1270452",
            "votes": "0"
        },
        {
            "answer": "I have pcos.i started my first dose of clomid after taking progesterone to initiate bleeding on day 3 of bleeding.(cd 3-7).on day 8 i started spotting. i'm scared this is the third day what can i do to stop it.then when would i ovulate.can i have sex with the spotting.",
            "post_id": "5549318",
            "timestamp": "1270730789",
            "user_id": "user_1273076",
            "user_link": "/personal_pages/user/1273076",
            "votes": "0"
        },
        {
            "answer": "Good Morning Everyone!! hope all is well. It is so hot in Maryland(97 during the day, and around 75ish at night) and with these hotflashes is not being nice right now! my AF is 4 days late, but then again it likes to come as she feels like it. Since it lasted for 12day last month do I wait until my last day and count 30 from there to get a somewhat accurate result? I have been extra tired lately, and very moody. But as everyone has been telling me these are the side effects of Clomid. I am just praying that it what me and my hubby are praying for. Any suggestions as to when I should test?",
            "post_id": "5549353",
            "timestamp": "1270731212",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "I have pcos.i started my first dose of clomid after taking progesterone to initiate bleeding on day 3 of bleeding.(cd 3-7).on day 8 i started spotting. i'm scared this is the third day what can i do to stop it.then when would i ovulate.can i have BD with DH whilespotting.",
            "post_id": "5549355",
            "timestamp": "1270731243",
            "user_id": "user_1273076",
            "user_link": "/personal_pages/user/1273076",
            "votes": "0"
        },
        {
            "answer": "love8226: I think it really depends on the persons if you are having sex while spotting. I myself, really didn't notice the spotting until I wipped. And then my hubby told me he saw something that looked like blood. But we still did it. I didn't know if it was cause I was still on my AF time, or from something else. So what I would say it just depends on how you and DH feel about that.TMI to some who may think that. SORRY",
            "post_id": "5549369",
            "timestamp": "1270731519",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "You would still O on the right time you would nee to OPK test on cd so that you cover all your bases. You can O early on with clomid so just keep testing on till you get a + OPK and you will be great as long as you keep BDing on till you O and two days after. You want the lil swimmers to be waiting for your egg so its best to BD a week before your O day and since you dont know when that is you need to start...Sherrycoup if your OPK test is darker then the control line your def Oing so I would count that day as O day.. Mines was this month I have never seen that and boy was I happy to see it.. Have fun baby dancing mama... you be in TWW...",
            "post_id": "5549493",
            "timestamp": "1270733832",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Thanks Sobie.  The pee stick was sort of dark in hte morning but was really dark at 5pm when i tested.  does that mean i o'd yesterday or Im about to in the next 24-36hrs?",
            "post_id": "5549544",
            "timestamp": "1270734919",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "So... I have some very odd symptoms... yesterday afternonn- it hit me like a rock, my nipples were so sore it felt like some one had just bit them. Then last night my son woke me up at 3am and when I tried to lay back down I was really nauseated.. I finally got back to sleep and this morning it is slightly there still. The nipples are still very tender.This is my first TWW ever... is this normal??",
            "post_id": "5549604",
            "timestamp": "1270736209",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "In past cycles I would feel on and off  \"twinges\" in my nipples, like if I was laying down, or sitting at my desk it would feel like they were being pinched from the inside. From what my dr. told me, that particular symptom (pg or not) comes from the elevated progesterone in our bodies, which is a good thing because the progesterone doesn't spike until after ovulation. Hence women that are 5-6 wks say its excruciating because their progesterone is through the roof. I'm feeling kinda down lately.... CD25 still not a single sign of pregnancy, or af, I don't know if this month is a bust or not. I just have a lingering hot flash every once in a while. Oh and last night i rolled over on my stomach and my nipples hurt some, not too bad. Any thoughts?",
            "post_id": "5549682",
            "timestamp": "1270737528",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "Lin, dont feel down with my first child I had no single sign that I was having a baby at all. I even did a HPT at the ER and it had came back -. I had went in to the ER that night because I didnt have AF for 5 months and was having some chest pains I know crazy ha but he told me to go home and just rest. I waitied a week and went into another ER and I told him what had happen the week before and he said no you look as if you are with child and sent me to do blood work I told him he was crazy I did a HPT at the other ER and was - and he told me to go and do my blood he was not going to do nothing else on till I did the blood and told me to come back in an hour and sure when I go back I was +. Yeah and I didnt even feel a thing I was so sock I call the doctor a lier...lol.. But I sure was..so keep your hope up and if your late for AF go get tested..",
            "post_id": "5549761",
            "timestamp": "1270739127",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "So that is good to know that I am post ovulation.. I took progestrone to get my AF back, but these are way different symptoms!Hope it all works out for this ovulation. How exciting.lin- I know it is tought to wait, and not know, and continue to try time after time. I am almost 9months post removal of my IUD and I got my first ovulation. I really hope this works and I dont have to do it all over again! Much luck to you!! Do you test with OPKs or anything?",
            "post_id": "5549820",
            "timestamp": "1270740415",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I have a question....When it comes to urination in early pregnacy...We all the know that you may have to run to the little girls room more often and that this is an early sign, even before a home prego test can be taken....But does the urine itself change? Color, Smell? even the look of it?",
            "post_id": "5549869",
            "timestamp": "1270741378",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Wow Rain, its so funny that you asked that. I've noticed more bathroom trips (my body refuses to hold onto any liquid) but what I've found different is my urine is much more cloudy and has a different smell. Not musky or manly per say, just different lol (sorry if this is tmi for some) I have been drinking more water lately ( although a soda a day is still my weekness)  sooo maybe theres something to it..... :-D. Oh and Cara.... I've used opks in the past, but my dr. said its better to just bd every other day because pcos women tend to either get no + or constant + because the elevated LH we have. *sigh* I'm just soo ready to start the family my husband and I day dream about constantly... HERES TO ALL OF US!!!!",
            "post_id": "5549989",
            "timestamp": "1270743201",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "EXACTLY! Lin: I promised hubby that I woudn't take a test in the am tommorow. But I am really irregular. So I am not sure if a home prego test will be accurate. I am just trying not to think about it, because if it is all in my head, I want to just take a step back. I am going to keep trying, but I dont want to make myself sick. Because honestly, I feel like that is what I am doing, since I want it to come true so badly!",
            "post_id": "5550063",
            "timestamp": "1270744209",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "EXACTLY! Lin: I promised hubby that I woudn't take a test in the am tommorow. But I am really irregular. So I am not sure if a home prego test will be accurate. I am just trying not to think about it, because if it is all in my head, I want to just take a step back. I am going to keep trying, but I dont want to make myself sick. Because honestly, I feel like that is what I am doing, since I want it to come true so badly!",
            "post_id": "5550067",
            "timestamp": "1270744270",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Oh yeah I know what you mean. Last cycle my dr. actually advised me to have a couple of drinks, because I was so stressed. This month, aside from cyberstalking this site, I'm much more relaxed. I can't tell if its because I've been through it enough to know what to expect, or if I'm losing hope that the clomid will work for me. I'm still diligently following all of the steps, just in case, but I'm not losing it over every symptom I have either. This month I'm leaving it up to GOD to give me the family I want so much. Any idea when you're going to test yet?",
            "post_id": "5550636",
            "timestamp": "1270753674",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "lin_z_ttc1: in the morning, I would tonight, but I am going to play it by the book. Yeah this time around with the Clomid, I did exactly what the doc told me to do. BUT the only thing that my doc didn't do was have me go for an u/s. He stopped doing that after he saw my tubes and ovary \"looking great!\" i was like yeah but they an't working! lol! I have just been taking it easy. Had rough begining on the month in March with some family things, but I just want a child. I feel like I am really ready. Yeah I am finishing up school and what not, but apart of me, if just so focused in school because I am so less stressed with work and home life. Hubby has been doing really good. So I guess I am just going to have to wait till tommorow Morning. Praying like crazy right now! I just hope that all these things aren't in my head and they really are happening for a reason. I would feel very bad treating my hubby the way i have been if it isn't that. :(",
            "post_id": "5550696",
            "timestamp": "1270754851",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "OMG OMG OMG!!!! I have some awesome news Clomid works, I got my 21cd blood work back and OMG I went from a 1 last month to a 26.5 yes 26.5 I didnt even know it went that high I was wanting a 6 and man I got a 26 wow god is so good... I hope Clomid works for you girls too have faith I OV for the first time in 11years yeah 11 years.. I hope my TWW ends this awesome. I am so happy that it works more then anything....",
            "post_id": "5550925",
            "timestamp": "1270759151",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "im excited for you Sobie!!!  I go for my cd21 on monday!!  I have major cramping today (hurts to even sit down).  My opk was still + today s owe're still BD.!!",
            "post_id": "5551136",
            "timestamp": "1270762962",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Wow Sobie, thats great! I'm excited for you. I had my bloodwork on Mon, still haven't heard what the results were (we don't have a lab here, so it all gets sent off ) but now I'm hoping mine is as high as yours. I have seen a gradual improvment from .6 to 7.4 to13.8 so I'm praying it will keep climbing all the way through the BFP I'm going to have soon :-Dlol!",
            "post_id": "5551209",
            "timestamp": "1270764200",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "Thanks girls I am happy that I even O. Lin your numbers are awesome I never had numbers like that in my life you will get your BFP!!! I am happy that everyone is doing great with the clomid... Sherry keep bding your O and cant wait till your in TWW and get your BFP this month...woooooohoooo girls so happy your all doing great... clomid great work...;0)",
            "post_id": "5551293",
            "timestamp": "1270765763",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Woo Hoo....how exciting to have such a high progesterine level!!! I hope to see you bbt keep rising and your BFP here real soon :) My last day of clomid (100 mg) will be tomorrow (thank goodness) and then waiting on my O...........hopefully this mg works. SSBD",
            "post_id": "5551930",
            "timestamp": "1270778312",
            "user_id": "user_1031264",
            "user_link": "/personal_pages/user/1031264",
            "votes": "0"
        },
        {
            "answer": "Well Im still bding  - i think my hubby is getting tired!!  lol  Weird though my temp went up lots this morning.  take a peek at my tracker and tell me if thats normal?  Went from like 35.7 to 36.58.  Just seems weird to me but bbt is all new to me also so any help would be great!!.",
            "post_id": "5553069",
            "timestamp": "1270817216",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Thanks I am happy that clomid worked and I know it will for you too have faith. I am gald I didnt give up on my 2nd cycle.. I did one more and boom I O with flying colors you too will have that happen no worry I am praying so much for all you girls..... I hope to see some good new of others that O and get their BFP..... Sending Blessed Baby Dust to you all...",
            "post_id": "5553075",
            "timestamp": "1270817248",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Well I took a test this last night and it came back negitive. I am not happy with that, just cause I know something is up. I just hate the thought that my body is feeling pregnet with everything that is happening. I am so hurt right now.Sobie: congrats!!!! thats wonderful news!",
            "post_id": "5553126",
            "timestamp": "1270818232",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Sorry to hear it was - could be from the clomid that happend to me on my first cycle with clomid. I would still do blood work just to make sure.and thanks I am happy clomid work for me I never O in 11 years I am happy that I even did I thought I would never O but god listens.I wish you girls luck with clomid....",
            "post_id": "5553413",
            "timestamp": "1270823502",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Just wanted to let you know that I have seen your posts in several threads. I know you are trying so hard and wanted to pass along a note that I am praying for you. Sorry you didn't pass your test...my mama would say to study harder, but I think in this case study and research can drive you crazy if done too much. I will certainly keep you on my prayer list. It's a tought thing us ladies are dealing with, but support and prayer always works!",
            "post_id": "5553531",
            "timestamp": "1270825034",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "I am on my first round of clomid.  I have hot flashes, nausea, mood swings, and I'm sleepy.",
            "post_id": "5553557",
            "timestamp": "1270825378",
            "user_id": "user_1242992",
            "user_link": "/personal_pages/user/1242992",
            "votes": "0"
        },
        {
            "answer": "CD 26 here, still not feeling much symptoms wise other than not wanting to get out of bed this morning, and getting REALLY angry at DH this morning. I do get really moody before AF so I'm scared thats why :'(. After 4 cycles of hoping, praying, and anxiously waiting for this to work, I'm trying to stay positive, but its getting harder to do....",
            "post_id": "5553631",
            "timestamp": "1270826686",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "CONGRATS GIRL!!! So what is this test on CD 21.. my DR didnt say anything to me about testing.. but I got to an OBGYN and no fertility is covered. So maybe he is trying to save me a buck and go the old fashon way with luck, baby dust, faith and prayers that I get pregnant.",
            "post_id": "5553639",
            "timestamp": "1270826751",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "Hi Cara,!!!  I go to an obgyn.  I was told to go get a cd21 progesterone test done.  It will tell you if you've actually O'd or not. That is how they know to up your dosage or not.  My ob gave me  pre filled out 3 req's to get progestrone test done and 3 preggy tests.",
            "post_id": "5553698",
            "timestamp": "1270827877",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "how many days past a +opk should you BD?? a full week?",
            "post_id": "5553709",
            "timestamp": "1270828045",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I am covering all my basis and going to do it every day for 1 week and then every other for the 2nd week.. LOLI should call my DR.",
            "post_id": "5553815",
            "timestamp": "1270830006",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "PRAISE GOD! OMG I AM SOO EXCITED!!!! DR. JUST CALLED AND TOLD ME MY CD 21 PROGESTERONE WAS 22.2!!!!! AHHHHH HOPE THIS WAS THE MONTH THAT WE FINALLY GET THE MUCH ANTICIPATED BFP! I'M PRAYING THAT ALL OF YOU RECEIVE THE SAME NEWS THAT SOBIE AND I RECEIVED! GOOD LUCK TO ALL OF US! :-D YAY!",
            "post_id": "5554400",
            "timestamp": "1270840084",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "Congrats Lin!!!!!!!  I am going for my cd21 test on Monday morning!! and looking forward to results good or bad - either way im heading in the right direction and will keep trying for baby #2.  Its been a really long year..   I'm thinking this is goingn to be a good month for a bunch of us!!!!   Nice to share this with other ladies as my family doesn;t know we've been trying for over a year to conceive or that i was diagnosed with pcos a couple months ago.  So Cheers to all - have a great weekend adn i think im going to enjoy a nice glass of wine tonight!!",
            "post_id": "5554637",
            "timestamp": "1270843672",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "That is awesome... My dr doesnt want to do any testing on CD 21... so I just pray for the best that the OPK was accurate and we get pregnant on my first ovulation in a long time. I had an IUD for 2+yrs (with no af or ovulation) and then the 9months aft no ovulation. My 1 and only bio-son is 3 already.. so that is 4years of no ovulation!!!I pray that this is it for all of us and I can close this account out till the next baby!! LOL",
            "post_id": "5554767",
            "timestamp": "1270845899",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "CONGRATS mama wooohooo thats a great number anything above 2 is Oing so getting a 22 that is awesome very good egg... I hope the best for all of us...Caralea I am sorry to hear that your doc wont do the test. Thats crazy he dont want to do it how will he know what mg to give you or if you had a good O I would ask him to give you the blood work it is covered by insurance mine is even that I am seeing a RE but nothing else is covered... thats crazy mama I tell me doc to send you one..lol...SSBD",
            "post_id": "5555068",
            "timestamp": "1270851252",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I'm just so relieved that its working, now its up tp God and DH's swim team to do the rest :o). I really believe that it was the metformin that helped me respond to the clomid so well, so I advise, if your not seeing the results you want, then nag, nag, and nag somemore your OB,RE, or whomever your seeing to prescribe that with your clomid next cycle. The side effects are less than desirable, but if it helps clomid work, then its worth it. I only see a midwife, and shes been able to rx everything I've need this far. I'm going to an RE in June if I'm not pg by then.... hoping and praying that this is it! Gosh now I just want to go all POAS Crazy!!! hahahaa",
            "post_id": "5555085",
            "timestamp": "1270851732",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I have PCOS and have been on metformin (850 mg 2xdaily) for 9 weeks now. I started my first cycle on clomid (100mg) and tomorrow is my last day. The only side effects I have had are HOT FLASHES! I really hope I O...I will start OPK on CD10. I have been ttc for 2 years. I hope this works.",
            "post_id": "5555242",
            "timestamp": "1270854771",
            "user_id": "user_1268191",
            "user_link": "/personal_pages/user/1268191",
            "votes": "0"
        },
        {
            "answer": "I haven't learned much about progesterone. Can someone help me here. I know I go on day 21 to do testing and it indicates ovulation...but what are good numbers or bad ones? Also, do progesterone levels indicate pregnancy? Also, I am getting a bit confused. My understanding was that when u ovulate, you will get af. But from what i am reading, ovulating and releasing an egg and af do not always go together. I thought I had a good grip on this stuff, but I just can't seem to grasp these concepts! Thanks all for you help!",
            "post_id": "5555591",
            "timestamp": "1270863705",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "Can you guys look at my OPK pics i put up?  I'm kinda confused now.  CD16 am was darker than the control line and cd 17 was dark as well.  cd18 (yesterday) went light but today cd19 - went dark again (same as control line).  I'm not sure what to make of it. I also track my temps on her also if you wanna peek at htose also.  Thanks for all your help and support!!  I'm still bd'in this week to cover my bases",
            "post_id": "5556889",
            "timestamp": "1270911817",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "hello Ladies,I was put on 50mg of Clomid  CD 4-8 went on Cd 10 for Ultrasound and RE said that follies were still very small so he said that he didnt want to cancle this cycle and said to take more Clomid100mg CD 10-15 and come back for another ultasound on Cd 15. Has anyone had to do this before ? I've do alot of research and cant find anyone who had to do this? So confused",
            "post_id": "5557837",
            "timestamp": "1270935406",
            "user_id": "user_1275791",
            "user_link": "/personal_pages/user/1275791",
            "votes": "0"
        },
        {
            "answer": "Ok first of all, women can have af without ovulation, its called annovulatory cycles, most women that have it have PCOS. Oh and the progesterone testing.... I was told anything over 5 is ovulation, but on an unmedicated cycle dr.s want it to be atleast over 10 for  a good quality egg, and over 15 on a medicated cycle (ie clomid, femara, etc.) it took me 4 cycles and adding metformin to get the good numbers 22.2. Its still no indication of pregnancy, but the number does spike after ovulation, and should continue to climb if your are pregnant, because thats what creates a womb to maintain the fetus. If you don't get preg. your body stops production of progesterone and you have af a week later. I'm still so excited mine was that high this month.... can't wait to test :0)",
            "post_id": "5558347",
            "timestamp": "1270948562",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "That is great news!!!  Hopefully this is the month for you.  I'm feeling a good vibe that this is going to be a great month for alot of us.  I just finished provera yesterday and will start my first round of Clomid on CD 3.  It looks like I'm spotting today.  Does anyone know if that would be considered CD 1?  I just don't want to be off a day or two either way?  Good luck to everyone :-)",
            "post_id": "5559912",
            "timestamp": "1271003847",
            "user_id": "user_1268398",
            "user_link": "/personal_pages/user/1268398",
            "votes": "0"
        },
        {
            "answer": "CD day one is the first day of red flow.I wish you luck and hope this is a good month..SSBD..",
            "post_id": "5560036",
            "timestamp": "1271006030",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Thanks so much for the info! It is much more clear to me now. Congrats on the good levels too! I do have PCOS, so your explination helped me to understand a lot more. Another question. I took bc in jan and feb. I bled the whole time. In march I got no af. I haven't done u/s in a long time, but i've had serious cramping since jan. Having PCOS, I know that my eggs do not mature all the time. So, my question is two fold: Having af for two months straight, will that clear out any unrelased eggs/cysts and will provera help with that too?",
            "post_id": "5561359",
            "timestamp": "1271034790",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "well I went to go get my cd21 bloodwork done this morning before work only to walk in at (7am when it opens) and there like a 1 hour wait.  So looks like I'll have to go after work today.  I was just hoping to get it over and done with.  I also was very tired yesterday (i actually had to take an hour nap in the afternoon)  the tww *****!! just sit by and wait and wait and wait.  Anyhwoo enough venting for today :)",
            "post_id": "5562521",
            "timestamp": "1271073904",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Good Morning everyone! I hope everyone had a wonderful weekend! Well now today I am offically 8 days late...no sign of AF...but all signs of preg. but still no poistive test. According to bloodwork I did O last month. I haven't gone to the docs for a blood test to r/u pregnancy. This weekend I continue to have so many signs, but then again they cold be side effects. Heart burn(and I never get heart burn!), morning sickness (with and without vomiting), and I have been extra tried lastely. Me and Hubby were suppose to go out on Friday but after I got home cleaned a little bit, I was going to get ready and slipped in bed for a 5 mins nap, well didn't happen for 5 mins! :(. then saturday, I was in walmart and a rush for nausea came up...it was bad. So I dont know. Just getting really really tired of not knowing.",
            "post_id": "5562667",
            "timestamp": "1271076638",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "i'm gettin some serious hot flashes this morning!!I think the hormones are kickin in. I didn't even have hot flashes while taking clomid.",
            "post_id": "5563075",
            "timestamp": "1271084122",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Well I hope everyone else had a good weekend! I have a question for you (tmi I'm sorry) but have any of you tww-ers noticed a jump in your libido lately? This weekend poor DH couldn't keep up with me and I know I'm not o-ing now, so I was just... aroused? LOL. Oh and something funny happened to me yesterday, DH got some chinese food ( I loathe it) and he gave me a fortune cookie that said \"A small lucky package is on its way to you soon\" :0) WOW I was shocked lol.Amandamae1126: I'm not sure, but I think that long of an AF would help shed old lining and eggs, the provera is just progesterone. you take it, then when you go off, it signals an AF in your body. I would ask your dr. to make sure your lining isn't too thinned out so that implantation can occur. What cocktail of meds are you on now?I'm really feeling positive about this thread and I'm really feeling like that we're going to see a lot of BFPs soon (Hoping that I am definitely one of them) GOOD LUCK SSBD!!!",
            "post_id": "5563176",
            "timestamp": "1271085759",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I was taking the provera, but was finished on 4/10. I am supposed to start taking clomid on day 5. I have started taking baby asprin too, but thats the end of my cocktail. Figured I would take it easy on the first cycle. Another question I have is about stress. I've had a death in the family and some other high drama going on. Being almost 3 weeks late and getting ready to start af soon, you can only imagine my stress levels and the accompanying tears. Can this high stress prevent my af from coming?",
            "post_id": "5563301",
            "timestamp": "1271088073",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "amandamae1126: thanks for your prayers and kinds words. I am glad I found this website, because along with you and everyone else here has helped me through the last couple of weeks!Thanks",
            "post_id": "5563382",
            "timestamp": "1271089577",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Yes stress can prevent AF, thats how I went 15 months without it. However, I'm not sure if it will affect it if its provera induced, you would think that the meds would force it despite your stress level, but I'm not sure.",
            "post_id": "5563390",
            "timestamp": "1271089618",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "Thanks lin. I was hoping to hear that it might not stop the provera enduced. I am so weepy and just need to get this going!",
            "post_id": "5563501",
            "timestamp": "1271091772",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "It's been a rough morning, big news from SIL today.. and I feel so guilty that I'm not all that happy for them, I'm a little jealous, and I feel bad, but I can't help it. There's so many people I know  that are pregnant and then it only takes them 1 -3 months to get there... anyway...RainLos27: I really hope you get good news. I've heard of a lot of people's home test being negative and then going for blood work and it coming back positive!!!  (I really do mean it, it would give us all hope!)Sherrycoupe: I've been gettting a ton of hot flashes too.. hopefully they will go away soon!All:Is anyone taking robitussin for CM? I've heard that a lot of people take some to help with CM but I asked my nurse and she said she's never heard about it, and that there was no need to take it unless I was sick.",
            "post_id": "5563909",
            "timestamp": "1271098054",
            "user_id": "user_1248719",
            "user_link": "/personal_pages/user/1248719",
            "votes": "0"
        },
        {
            "answer": "wantmy1stbaby: thanks for your kind words. I took robitussin last month, after taking the clomid. My doc thought I was crazy, because he stated I had no need for it! but I have heard through studies via books and websites (webmd.com) of Robitussin really does work. BUT you have to find the one that has guaifenesin as the only active ingredient. If you use the other robitussin that have other active ingredient it may not work the way you want it to. Happy bding!!!!",
            "post_id": "5564065",
            "timestamp": "1271100831",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "oh and I should add that the generic form of Robitussin in OK, as long as it has guaifenesin as the only active ingredient.",
            "post_id": "5564097",
            "timestamp": "1271101274",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "I started my first cycle on clomid this month. I took it on CD 3-7 it is now CD 9 and still have AF. Is it normal to finish clomid and still have AF. I am suppose to start OPKs tomorrow?",
            "post_id": "5564742",
            "timestamp": "1271113002",
            "user_id": "user_1268191",
            "user_link": "/personal_pages/user/1268191",
            "votes": "0"
        },
        {
            "answer": "Went and got my cd21 bloodwork done yesterday!!  The nurse killed my arm. She couldn't find my vein so she decided she would move the needle around inside to find it.  I was peeved!!.  Anywhoo now its just the waiting game.  My temps keeps rising so thats a good thing. Looking forward to see how clomid was for my first round!!",
            "post_id": "5566284",
            "timestamp": "1271159251",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "I bet your numbers will be high your temps are awesome way better then mine, your on the right track to see you BFP this month... Sooo happy for you mama.Rainlos I took mucenix last month and this month I say it works wonders my RE told me to start it the last day of Clomid till I O and man my DH loved it..lol..wish you all luck and SSBD to all",
            "post_id": "5566458",
            "timestamp": "1271163354",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "How early can you take a pregnancy test?  my ob (in the pamphlet he game me) said on cd 35 if no af then test.  Can you test earlier than that?",
            "post_id": "5566478",
            "timestamp": "1271163711",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "My Dr says the same thing... you can test 14days after ovulation, but they told me since I have PCOS and are irregular.. I should wait and test later to save money on tests. My window for me.. is TWW over/1st test able on 4/20.. if I decide to wait till CD 35 it would be 4/25 or so... Really not that much difference and for me works either way.me getting sick this week has been a real downer... hubby and I havent been able to BD for 4 days.. hope I didnt ruin my chances...",
            "post_id": "5566819",
            "timestamp": "1271169051",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "We only bd 4 times at Ovulation.  My temp keeps rising good though :)  I went for my cd21 bloodwork yesterday so hopefully i'll get good #'s back.  I feel kinda nausiated today but not sure if its just the whole stress of waiting kicking in!!. Im also very tired as my 4 yr old decided she was gonna wake up at 4 am and go downstairs to watch tv!!  So when I get up at 6 for work - 4am came a lil early.  I need a nap already",
            "post_id": "5566981",
            "timestamp": "1271171580",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Girl I feel you I been so sleepy I get home and take a hour nap before I pick up my kids from school, the other thing is waking up up to 3 times at night to pee and then cant fall back to sleep. Crazy... I almost trow up yesturday too but then I ate and the feeling went away. I had two headaches in the last 3 days and thats not normal for me. I dont know what to think of it, I think might just be the hormones for pergestrone.I hope your numbers come back high when will  you get the your blood work back?",
            "post_id": "5567078",
            "timestamp": "1271173350",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I have had symptoms too... mainly sore boobs.. but I am not letting it get to my head, since this is my first TWW. I never had symptoms with my son until I was like 8weeks along, I went out for my 21st birthday (oops- not knowing I was pregnant) and my \"hang over\" lasted for 3 days.. I finally was tired of it, asked my mom and she bought me a home test. It came back positive way before the control line showed up. I was pregnant!!I am just keeping track quietly and trying to stay positive, no stress!! This cold has really kicked my butt, but I am still trucking a long!!Hoping I dont see AF in a week... but still keeping positive if she does I can get right back up and try again.",
            "post_id": "5567173",
            "timestamp": "1271174890",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I'm CD 30 today I'm not going to test until atleast Sat. or Sun. Since I've been on clomid my cycles have become more regular 34-36 days long. I'm not really feeling to much other than an occasional twinge in my nipples, and more CM than usual (i'm typically uncomfortably dry from now till AF). Honestly haven't been paying too much attention to it since yesterday morning, when I received the most devastating news. Two 18 year old boys, set to graduate next month, best friends to my bro, were found dead yesterday morning from Carbon Monoxide poisoning. Our families are extremely close (rancher families are very close around here) I looked at those 2 as my own brothers, and ever since I heard the news, I've been very weepy (which also happens around af) and I've been putting all of my prayers into those families, and not so much in me.Please pray for me, confort me, give me the hope I abruptly ran out of........",
            "post_id": "5567249",
            "timestamp": "1271176002",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "I am so sorry for the losses of those boys. We are all praying for you around here!!",
            "post_id": "5567264",
            "timestamp": "1271176282",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "sorry to hear about the boys I know how hard it can be and yes we will keep you in our prayers I know I never put my self first I always put others before me. I will hope this week brings you good news. SSBD your way.",
            "post_id": "5567332",
            "timestamp": "1271177624",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I'm so sorry to hear that. I'll be praying for you.",
            "post_id": "5567351",
            "timestamp": "1271178026",
            "user_id": "user_1248719",
            "user_link": "/personal_pages/user/1248719",
            "votes": "0"
        },
        {
            "answer": "my prayers are with you and your families!!!sobie: I should prob get results back tomorrow I would think - the lab is in the same building as my OB :)I think tonight will be an early bedtime for me. Paige goes to bed at 6:45pm so i think i'll go around 8:30 :)   maybe with a glass of wine to help me sleep!!",
            "post_id": "5567366",
            "timestamp": "1271178241",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Oh girl, I will certainly pray for you! Sorry sorry to hear about the boys. What a tragic thing. I will certainly pray for thier families too.On a better note, I finally got af today after 3 days off provera. Now maybe these death cramps will go away...I can already feel them easing. And I finally get to start counting! Here goes...cd1!Sherry - good luck getting your results back! Also, I'm late in discovering your story...how long have you been trying? I'll def keep you in my thoughts and prayers too!",
            "post_id": "5567809",
            "timestamp": "1271184417",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "Thank you so very much for your kind words and support, I know that no amount of pain I'm feeling can compare to the families of the boys. It breaks my heart just thinking about it. Even though I am not a mother (yet :0) ) I couldn't imagine losing a child. I feel somewhat guilty for the hope and optimism I have in thinking that I might be bringing a new life into the world, and finding out about such joyous news at the end of the week, when they will put to rest their children at around the same time.Slightly different note... is a 2 day headache considered a symptom of pregnancy? Did any of you mothers have that when you were preg? I'm trying hard not to get my hopes up that it worked this month, but... with the high progesterone... maybe???",
            "post_id": "5567864",
            "timestamp": "1271185281",
            "user_id": "user_1270719",
            "user_link": "/personal_pages/user/1270719",
            "votes": "0"
        },
        {
            "answer": "HI Amanda, my dh and I have a 4 year old (that we concieved with no problem)  We've been ttc # 2 since last March.  I have always been irregular and stoped having periods in July 09. so I finall got my reffereal to my ob and he said i most likely have pcos as per symtoms and gave me provera to induce af and started me on 100mg of clomid    cd3-7.  Not sure rwhy he started me a t 100mg but i'll take it!!  Im now on cd 22 so I should be getting my bloodwork results back hopefully tomorrow to tell me if I've o'd (but my chart looks pretty good so  i think i did) now im into the dreaded tww and will test on the 26th.",
            "post_id": "5567960",
            "timestamp": "1271186977",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "As tragic as it is, I have always found that someone has to go to make room for other people in this world. My aunt passed away on Thursday and my sister found out she was preggo just a few days later. I hope you do get to bring new life into this world soon!Sherry, lucky you to jump ahead of the game with the 100mg! Be sure to keep us posted on your test results. When do you expect to get them back? Does the dr usually call you with results or do you have to wait unitl day 30?",
            "post_id": "5568334",
            "timestamp": "1271192070",
            "user_id": "user_1271927",
            "user_link": "/personal_pages/user/1271927",
            "votes": "0"
        },
        {
            "answer": "Good luck on your CD 1 and clomid.. the symptoms seem to be half the trouble besides the waiting.Sherry- isnt it funny we conceive with our first child with ease (mine was a complete accident but he is a wonderful one!!) but then when we want another PCOS tries to defeat our wants! I hope we have luck this month.. I am going to wait to test as long as I can stand it.. I dont want to test early and get my hopes up. I have not really had any symptoms while sick- or at least havent noticed cause of how crappy I feel at this time.",
            "post_id": "5568411",
            "timestamp": "1271192975",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        },
        {
            "answer": "I too have been having headaches for two days I had it from Friday to saturday then monday and today I know it crazy and man I hate them, I just hope its a good sign for us. I am not trying to read to much into it but I have high hopes.Wish you luck and hopes for your BFP... SSBD",
            "post_id": "5568588",
            "timestamp": "1271195967",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "Hi there.  sounds like alot is going on today.lin:  So sorry to hear about the two boys.  That is so sad.  My prayers go out to you!sherrycoup:  good luck on getting your results back.amanda:  that's awesome you got af today.  let the countdown begin.caralea:  I'm in the same boat with you as far as I had no problem getting pregnant with my daughter but different story with #2I started my first day of Clomid today and am very excited.   I am feeling a good vibe on here.  I think lots of good things are going to happen for everyone which definitely gives me hope.  Good luck to all of you in the tww.  it's hard to know what you're feeling is related to pregnancy or not.  But the only thing that I experienced before I found out I was pregnant with my daughter was about CD32 I came home and was tired after work.  Told my DH that I wanted to take a quick nap and that was around 6:30pm, well let's just say it wasn't a quick nap because I woke up the next morning :-)  I think someone said that just happend to them.  That was definitely my body telling me to slow down and take it easy.  So baby dust to everyone.  I'm excited to hear everyone's good news :-)",
            "post_id": "5569456",
            "timestamp": "1271210283",
            "user_id": "user_1268398",
            "user_link": "/personal_pages/user/1268398",
            "votes": "0"
        },
        {
            "answer": "Good luck to all of you in the tww... I can't wait for this cycle to be over and test myself. I'm on day 16 and have not ovulated yet. I've been doing OPK's but no + yet. I'm hoping to get there sometime this weekend.Yesterday, I was so moody, I was so angry for no reason, and I knew that anything I could come up to be upset about was not worth being upset about but I couldn't help it. I then realized it was probably the clomid messing with my hormones, but I still couldn't let it go. DH was so sweet, he came into the room and even though I yelled at him and said I wanted to be alone he just stayed by my side until I felt better. I'm so blessed. We had a talk after that and he mentioned I needed to slow down and not be so consumed about having a baby, and having it NOW! hehe. He sad he loved me even if we could never have a baby, even though we haven't been trying for that long yet (>1yr). Being reminded of that and that I am loved makes me feel so much better.I'm trying not to work myself up with this being pregnant thing, but I want it so bad. I want to be a mom, I want to know how it feels to have my baby inside me and care for it before it even comes into the world.Needless to say I'll try to relax and trust that God has a time for everything and no matter how much I want something and try to get it, it's still going to happen on HIS time not mine.Lots of baby dust for all of us.. I hope we all get our BFP pretty soon. Just remember to relax and trust always, I think sometimes we get so carried away with our feelings (and messed up hormones/emotions) that we forget what it's all about.",
            "post_id": "5570456",
            "timestamp": "1271246619",
            "user_id": "user_1248719",
            "user_link": "/personal_pages/user/1248719",
            "votes": "0"
        },
        {
            "answer": "well i had a lil drop in temp but not sure if its because im extremely tired today.  My hubby started a new job and the alarm went off at 4:45 am!!  he's one of those people that has to have the volume jacked up or cant hear it.  Scared the cr*p outta me  yesterday and today- made me jump then im supposed to try to go back to sleep until 6?  Sigh.  Is there a spot on the Ovul tracker to mark down tiredness?",
            "post_id": "5570509",
            "timestamp": "1271247737",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "That happend because you woke up to early, that same thing happend to me on saturday my temp dip a lil then went back up the next day nothing to worry just try to get some sleep. lol...wantmy1stbaby- Clomid will make your hormones wacko trust me my first round I was like a crazy person I was mad one min then crying the next. I have been on and off clomid 7 times and I know these pills are no joke. This is the first time I have been on them 3 months in a row and every time is a different effect. I understand your pain but think of it like this it will all pay out in the long run. I wish you luck and SSBD your way. And welcome to our lil clomid family.CarlisMaMa- Welcome to our Clomid family I wish you the best on this round. SSBD",
            "post_id": "5570613",
            "timestamp": "1271249662",
            "user_id": "user_1160836",
            "user_link": "/personal_pages/user/1160836",
            "votes": "0"
        },
        {
            "answer": "I took my temp at the same time 6 am but i think with getting up 2 hours prior screwed me up!!.  There are so many us us right now in our ttw!!  Im actually excited to hear results from a few!!!   And happy too see new people in here also.  This is the greatest forum ever. I don't know what I would have done without all the information, stories, and support from all you ladies!!  I just keep telling myself - its not that we can't get preggo - it just takes us a lil longer than others.  Our time will come when it's right.Im hoping to get my results from my cd21 test today!!!! But judging by my chart and my opk's (pics postd) Im pretty sure I O'ed!!!!",
            "post_id": "5570716",
            "timestamp": "1271251424",
            "user_id": "user_1121300",
            "user_link": "/personal_pages/user/1121300",
            "votes": "0"
        },
        {
            "answer": "Good Morning everyone! I haven't been on here in two days, so many crazy things happening in life right now that I am really not myself. First my father had a heart attack while driving to work yesterday morning. This my hubby was hit by a person backing up from a parking space. OMG! can anything else go wrong? Well I have be able to get caught up with everyone postings, I am glad that many of us are having wonderful numbers this month. My AF is still late, 10 days late as of today. And still a BFN on a hpt. Still having very awful side effects n symptoms, and now they are a little worse and a lot of constant. So I am just waiting for my docs appt so I can go see about a preg blood test.Happy BDing to all! Baby dust to everyone!Lin: sorry to hear about the two boys. I will defiantly have to pray for your family and the boys family.",
            "post_id": "5571009",
            "timestamp": "1271256153",
            "user_id": "user_1269817",
            "user_link": "/personal_pages/user/1269817",
            "votes": "0"
        },
        {
            "answer": "Welcome newbies!! Lots of luck and Baby Dust on your TTC journey!! Clomid is horrible with the hormones.. I still get hot flashes like crazy.. this morning I had to completly undress after getting ready to try and cool off. OMG- this has been a loooooonnnnnggggg road!Good luck Sherry on your news.. You, Sobie and I are really close in our TWW hope the all turn out with some BFPs!!I am trying really hard to stay confident.. but also scared to death that I didnt O and I read the test wrong. Praying that I did- but only time will tell.  My only symptom is occational nausea and sore nipples. Hope this works... come on BFP!",
            "post_id": "5571048",
            "timestamp": "1271256705",
            "user_id": "user_982668",
            "user_link": "/personal_pages/user/982668",
            "votes": "0"
        }
    ],
    "post_id": "5493577",
    "question": "Hello everyone I think that this form will be very helpful for all that are on Clomid or that will start Clomid soon.Let me start by saying that I have PCOS and I have 11 year old daughter I have been TTC on and off the last 7 years but since I been married a year ago we been trying faithfully. I was on Clomid in Nov. 2009 I was taking 50mg 3-7cd I was told that I didnt O on this round and that I would need to go up on my next round. Dec came and went no AF so went in to see if I was Pergo but no I was not so they put me on provrea then Clomid on 3-7 100mg. I am now on my 3 and last round of Clomid I am on 150mg 3-7 days and I hope that this time I O because on my last round they told me I O early on cd 15 I have never O in 11 years so that was a good thing. But doc said that the numbers where not where he wanted them to be at so that is why he up my clomid this time.As for side effects on 50mg I had mood swings and hot flashes and the wonderful headaches... On 100mg I thank god I did not have any but did have crazy dreams with them. And with 150mg I had the vision problems. I just hope that this time works.Would love to hear your stories on Clomid and hear how long before you got your BFP on Clomid...",
    "timestamp": "1269265379",
    "title": "What cycle of Clomid are you on?? any side effects?",
    "user_id": "user_1160836",
    "user_link": "/personal_pages/user/1160836"
}