{
    "answers": [
        {
            "answer": "I am 31 weeks 4 days pregnant - and have a doctor's appointment this afternoon.  I am always excited to hear my little man's heart beat!  Hopefully we schedule another ultrasound.  The only one that I have had was at 18 weeks and that was when they pushed my due date back 2 weeks 2 days ( baby was measuring small).  The doctor mentioned it, but my insurance only pays for one, and he said he would have to special order it to get insurance to pay, so I hope he does.  I still have a cold - but am getting over it, so I am feeling much better today than earlier this week.",
            "post_id": "3504632",
            "timestamp": "1223476924",
            "user_id": "user_408496",
            "user_link": "/personal_pages/user/408496",
            "votes": "0"
        },
        {
            "answer": "Mumita - I know it is difficult decision to make, I would like to be a SAHM - but can't simply because of health insurance (DH's work offers some but it is like $400 +/month) We can't afford that and a pay cut too.  It ***** staying with a job because of benefits or lack thereof!",
            "post_id": "3504635",
            "timestamp": "1223477032",
            "user_id": "user_408496",
            "user_link": "/personal_pages/user/408496",
            "votes": "0"
        },
        {
            "answer": "Hey All,I am also down today and could use a \"vent.\"I went to the Dr. yesterday to follow up after last weeks scare (I was in hospital for 3 days having contractions, but the pre-term labour test came back negative for labor in the next 72 hours..whatever..  totally terrifying) I am feeling slightly better and NO CONTRACTIONS!! Yay! I am only 25 weeks. Anyway, my blood pressure was high yesterday and they found I have protein in my urine... Can you say I am freaking out that I may end up w/ preeclampsia. My coworker lost her son at 8 months due to undiagnosed preeclampsia.. I am a nervous wreck..I also still have a marginal placenta previa.. This pregnancy has been so stressful.. Between the medical aspects and all the drama w/ my ex.. I feel like I may have breakdown.Not only that. I am soo sick of my job. I dont feel up to working.. EVER.., I just want to sleep. And they have been such a$$holes about last week. No card, no nothing. I actually have 3 unearned days that they wouldnt allow me to use even though I was in the FRIGGEN hopsital..((end rant!))Bad day for me..",
            "post_id": "3504638",
            "timestamp": "1223477150",
            "user_id": "user_304970",
            "user_link": "/personal_pages/user/304970",
            "votes": "0"
        },
        {
            "answer": "First ... **big hugs** to Mumita and LauraB!!!  So sorry for all your stress ... I hope things get better!!!As for my Wednesday ... as always, I'm waiting to talk to my Mom and Gma.  We always have our wonderful Wed. convo's.  =D  They did give me a quick call earlier 'cause my Mom couldn't stand not being able to 'spill the beans' about the baby's gender to my Gma.  =D  lol  But we'll be having our full convo after they get their errands done for the day!Otherwise, I'm just sitting here, blissfully thinking about the baby and completely fawning over the pictures I got yesterday!!  =D  Hehe ...yay!!!",
            "post_id": "3504789",
            "timestamp": "1223479447",
            "user_id": "user_550546",
            "user_link": "/personal_pages/user/550546",
            "votes": "0"
        },
        {
            "answer": "i'm really sorry to hear this coz my boss is really nice. so much that i wish i didn't get pregnant so soon, been with him for just 15 months. Now I'm applying for my 3 months leave which should start by the end of next week. I would not have applied this early if i wasn't going off to my MIL's which is 5 hours drive from where we stay. i really look forward to having my baby and getting back to work.",
            "post_id": "3504805",
            "timestamp": "1223479686",
            "user_id": "user_281953",
            "user_link": "/personal_pages/user/281953",
            "votes": "0"
        },
        {
            "answer": "I had protein in my urine the last doc appt and they said it could possibly be something I ate, so they retested a couple days later and there was nothing ther.edont get too worried about preeclampsia.....it may have just been something sweet that you ate/drank that day...",
            "post_id": "3504815",
            "timestamp": "1223479836",
            "user_id": "user_525485",
            "user_link": "/personal_pages/user/525485",
            "votes": "0"
        },
        {
            "answer": "Oh on second vent, a good couple-friends of ours got pregnant for their second on the first month of ttc! Geez, must be nice to be so fertile!  Don't get me wrong I'm happy for them but pregnant on the first month of ttc!!?Anyway, just waiting til fri or sat for AF or hopefully BFP.",
            "post_id": "3504827",
            "timestamp": "1223479937",
            "user_id": "user_461781",
            "user_link": "/personal_pages/user/461781",
            "votes": "0"
        },
        {
            "answer": "I know what you mean by hating your job! I am getting so sick of this job! I am so underpaid for what I know and do. I'm getting tired of the same ol crud everyday! I want something closer to home...even if it pays a little less then this. Well I guess I wouldn't want to be paid less...but hey you know what I mean! And yesterday my mom and I were so mad! There's a burger place/restuarant that was celebrating its 24th anniversary with selling their signature burgers for a dollar! Well the girl that's in the same position as me decided she wanted to go there for lunch, even though she wasn't planning on getting that burger! So we told her that it was going to be a madhouse there and that it would take forever! Well she wanted to go anyway! We are customer service, we answer the phone when it rings and it rings all day...its the two of us and the others in the office only answer when they have to. We have 30 min lunches too because of the hours we work/opperate. So she finally leaves at 11:30. I am starving too so I tell them not to take forever because I am hungry!(jokingly of course) Time passes...45 minutes...an hour...We are so busy while she's gone I am constantly on the phone. It was another girl's birthday so she took a longer minute lunch but left a little after 11:30. So that girl gets back at almost 12:30..no biggy its her bday.  So my stomach is starting to hurt because I am so hungry...More time goes by..then one of the guys she went with comes back and tells us they're still waiting for their food! Its like a fast food place...like kfc kind of. I am getting kind of annoyed at this point. Since the other girl came back either my mom or I can go get food but we normally take lunch together, but this time one of us would have to eat at our desk to help with the phones which we don't feel like doing. They finally get back at 1:15! Then the girl has the nerve to ask me why my mom didnt go get me food!? I told her its because we didn't want to eat here. \"Well don't go to Culvers!\" I just wanted to slap her. She didn't even apologize for taking almost 2 hours to get her lunch...I am getting so sick of the people I work with...its like high school, drama and selfishness...I am TIRED OF IT! lol...I just want a new job...but I really hate the whole hiring process and interviews...oy..lol",
            "post_id": "3504858",
            "timestamp": "1223480324",
            "user_id": "user_285848",
            "user_link": "/personal_pages/user/285848",
            "votes": "0"
        },
        {
            "answer": "Laura - I hope everything is okay with you.  I'm sure it is. :-D  And Mumita - I totally get the frustration of people who conceive their first month.  I'm happy for them, but can't help but feel envious.  *sigh*Anyway - Today I had my day 3 labs.  Next week I get my HSG Test to make sure my tubes are open and to identify the object my nurse practioner (NP) thought was a polyp in my uterus.  After the HSG Test, I meet with the NP to go over ALL the blood results from the past couple of weeks as well as talk about a plan to get me pregnant going forward.  It's an understatement to say I'm nervous!  I'm preparing for the worst, like the news that my hubby and I will never conceive.  So scared. :-(",
            "post_id": "3505311",
            "timestamp": "1223486219",
            "user_id": "user_423860",
            "user_link": "/personal_pages/user/423860",
            "votes": "0"
        },
        {
            "answer": "my 2 vents...I am an esthetician who started a new job over the summer. Sept/Oct is our slow time of year BUT i have had NO clients monday and today and nothing booked in for friday yet. We are broke as it is, my mom had to buy us bread and milk and next week has a unpaid holiday (canada thanksgiving). I am FREAKING out!!! I would be doing better on umemplyment since we get to use our 15 best pays of the last year to base it on, luckily my family Dr said as soon as i want to i can go off on sick leave (trying to make it to 20 weeks) then i get 15 weeks of sick leave, and the 52 weeks of mat leaveWhy do trades people not show up when they say???? Been waiting ALL DAY for the electrician to come, she was here yesterday and even left her tools here. carpet installers didn't show up 3 days in a row last week. and cabinet guy forgot to send over our sink (when the installer was here, so now he's gotta come back) and when i picked it up, it was cracked and a chunk out of it so they have to reorder....GRRRRRRRR i just want my house back",
            "post_id": "3505363",
            "timestamp": "1223486881",
            "user_id": "user_414635",
            "user_link": "/personal_pages/user/414635",
            "votes": "0"
        },
        {
            "answer": "evthing4reason - Can I just say I wished I lived in Canada.  You guys get 52 weeks of mat leave, and most people in the US get 6!  I hope the US changes it's policies! :-D",
            "post_id": "3505421",
            "timestamp": "1223487708",
            "user_id": "user_423860",
            "user_link": "/personal_pages/user/423860",
            "votes": "0"
        },
        {
            "answer": "Atia- I am hoping everything goes well and you and dh get some much needed great news!! =)evthing - WHAT? you can go on sick leave at 20 weeks and then you get 52 weeks of maternity leave? That's all unpaid, right?I dont get ANY paid maternity leave and found out that if I do end up getting taken out of work, I can't even get disability?? WTF?",
            "post_id": "3505479",
            "timestamp": "1223488335",
            "user_id": "user_304970",
            "user_link": "/personal_pages/user/304970",
            "votes": "0"
        },
        {
            "answer": "LauraB I'm pretty sure that the sick leave and maternity leave in Canada is Paid.  If I didn't hate cold weather sooo much, I'd consider moving to Canada.",
            "post_id": "3505502",
            "timestamp": "1223488498",
            "user_id": "user_461781",
            "user_link": "/personal_pages/user/461781",
            "votes": "0"
        },
        {
            "answer": "I am thinking about it now.. I hate my life today... Uggh..Poor Laura.. =(=)",
            "post_id": "3505510",
            "timestamp": "1223488556",
            "user_id": "user_304970",
            "user_link": "/personal_pages/user/304970",
            "votes": "0"
        },
        {
            "answer": "Mumita - You could always move to Europe, they have the same policy there. :-DLaura - I can't believe you don't get any paid time off?  That should be illegal.  So sad. ;Honestly, I do think our country needs to give more benefits to mothers.",
            "post_id": "3505515",
            "timestamp": "1223488590",
            "user_id": "user_423860",
            "user_link": "/personal_pages/user/423860",
            "votes": "0"
        },
        {
            "answer": "Wellllllllllllll... I'm going to vent about the fact that my preschooler goes into her sister's bedroom every morning and moves the crib over to the dresser, climbs into the crib, and pulls out ALL of the clothes in the dresser. Daddy and I are trying to come up with some form of punishment to keep her from doing this EVERY single morning!This morning was a little different. I came in and my baby was in her crib, naked except for a bead necklace. *SIGH*",
            "post_id": "3505524",
            "timestamp": "1223488697",
            "user_id": "user_376739",
            "user_link": "/personal_pages/user/376739",
            "votes": "0"
        },
        {
            "answer": "I know.. It's insane..And to think...I work for an insurance company and we have a sh!tty HMO and policies that only benefit employees that have worked here 10+ years. Its ridiculous. You would think they would have something in place.Unpaid maternity leave should be illegal..",
            "post_id": "3505531",
            "timestamp": "1223488731",
            "user_id": "user_304970",
            "user_link": "/personal_pages/user/304970",
            "votes": "0"
        },
        {
            "answer": "We get about 55% of our wage. i can take 15 weeks sick leave...so if i start when i reach 20 weeks, i can then start the mat leave at 35 weeks with no interruption in the payments. We are very lucky, orgianlly i was only going to take 3 months off after the baby, but my Dr has suggested a career change because of my back.When i lost my baby at 19 weeks i was able to take 15 weeks off (which i needed as i had many complications after) if i had of been further i would've been eligible for the year)Also the other good thing about canada is that the men can also take paternity leave...not at the same time as the women and it is deducted from the amount of weeks the women can take. as with some companies in the states, some will top off the mat leave for the whole year too",
            "post_id": "3505779",
            "timestamp": "1223491647",
            "user_id": "user_414635",
            "user_link": "/personal_pages/user/414635",
            "votes": "0"
        },
        {
            "answer": "Thats insane.. WHo pays for that?",
            "post_id": "3505828",
            "timestamp": "1223492293",
            "user_id": "user_304970",
            "user_link": "/personal_pages/user/304970",
            "votes": "0"
        },
        {
            "answer": "My guess is taxes.  Makes socialism seem not so bad. :-D",
            "post_id": "3506068",
            "timestamp": "1223495070",
            "user_id": "user_423860",
            "user_link": "/personal_pages/user/423860",
            "votes": "0"
        },
        {
            "answer": "Hey I'd pay higher taxes if I could actually reap the benefits from them.  Instead, I pay taxes and only the lower income people get to reap the benefits on social programs like Medicaid, WIC, food Stamps etc.  I would never be able to apply for any of those programs, 30% of my paycheck goes for taxes AND I have to pay my own health insurance, short term dissability, all of my child's food etc.  AND I get UNPAID 12 weeks off.  How does that make sense?! Our system *****!",
            "post_id": "3506121",
            "timestamp": "1223495775",
            "user_id": "user_461781",
            "user_link": "/personal_pages/user/461781",
            "votes": "0"
        },
        {
            "answer": "The government probably!! I live in FL and we see a lot of snowbirds here.  During the summer months there are always sooo many Europeans.  Reason being - they all get 2 months vacation paid!! If you go to Europe in the summer months, sometimes places will be closed since all their employees are on vacation.  In Europe they also get automatic healthcare.  BUT, the reason they have all those benefits is due to high taxing.  They have a tax for social services which helps with all that, plus they also have a low poverty level for the same reason.  I have my degree in Social Work so I learned all about that stuff in school.  I think they pay some 24% tax or something.  Don't quote me, LOL.",
            "post_id": "3506133",
            "timestamp": "1223495932",
            "user_id": "user_402052",
            "user_link": "/personal_pages/user/402052",
            "votes": "0"
        },
        {
            "answer": "Im up to no good lol! Just browsing online! Im getting ready to move to my house which is great im so excited me and DH have not had our own place since we were first dating so its going to be fun and great to finally start that chapter of owning our first home as a married couple! Theres still so much work that has to be done and lists to be made of things me must have to live there!! AAAAHHH so much to do!  lol! Im still out of the TTC game my appt was for this week but wouldnt you know AF would show today plus w/moving and other things cannot afford the appt this week and the next available one is not till next month sooo grrr still have to wait but guess its for the best with my bad pap pregnancy is not an option plus still fighting Candia's butt!! Man i hate it i feel bad if any of you ladies have had this yeast infection its so persistant and annoying!!  but to all the ladies still in the game GL!! and to those stressing try not to lol i know its hard but we must in order to move forward!!",
            "post_id": "3506295",
            "timestamp": "1223497747",
            "user_id": "user_362249",
            "user_link": "/personal_pages/user/362249",
            "votes": "0"
        },
        {
            "answer": "I'm anxiously awaiting my 12w ultrasound tomorrow (I'll be 12w1d)...sooo nervous that something will go wrong =(  We had a really good 8w ultrasound with a little baby and a hb of 160 =)  I just worry...I hate worrying!I don't even want to get started on our maternity leave here in the US...I have no idea how people can be stay at home moms!  I can barely afford a maternity leave!  Luckily, I have sick days saved up for 5 weeks and then we'll have to use savings to cover the extra 2 weeks that I plan to take.Hugs to Mumita and Laura!",
            "post_id": "3506796",
            "timestamp": "1223504848",
            "user_id": "user_435139",
            "user_link": "/personal_pages/user/435139",
            "votes": "0"
        },
        {
            "answer": "Boy do I need to vent.  I have been ttc for 3 months now.  The first two I was off on my dates a bit so I never got my hopes up, but this time I was right on and was very excited.  I was expecting AF next Saturday.  Monday I got a tiny bit of spotting and yesterday too.  I thought it was IB.  Last night milk decided to leak a bit.  I obviously thought it may have been an early pregnancy symptom.  Today AF came full force.  I am so exhausted.  I feel like I could sleep for a week.  I spent all day just laying on the couch.  At least I dont have cramps...yet!",
            "post_id": "3506994",
            "timestamp": "1223507793",
            "user_id": "user_218870",
            "user_link": "/personal_pages/user/218870",
            "votes": "0"
        },
        {
            "answer": "Oh I can go on the venting thing too....First off DH calls me at work talking about our power has been cut off.  At 10 this morning then man comes in a van and replaces the spinner thing and boom..power gone.  So I leave work (which now I'm pissed about) go  to the electric company and tell them I've paid my bill.  It was not late or anything.  The lady said no you should have power...so then I had to wait an hour and a half to talk to someone to find out they turned off the wrong power.  When the computer printed the cut off schedule they switched two numbers and mine was the one that got cut off.So then I go back to work and my boss fusses at me and tells me I can't leave work anymore it's not fair and all this bs and I've NEVER left work...NEVER.  Especially not to do something on my personal time.So then I come home and study for my Anatomy and Physiology test.  She gave us a study guide....NOTHING was on the test that was on the study guide...talking about being mad...So I just failed the test.  So if it was not already bad enough with me failing the test... I have my lab practical on monday night...ahhh...will it ever end?Sorry for being long winded....just frustrated.",
            "post_id": "3507165",
            "timestamp": "1223510438",
            "user_id": "user_332691",
            "user_link": "/personal_pages/user/332691",
            "votes": "0"
        },
        {
            "answer": "I guess I could vent about my stupid stroller breaking!  While my two kids were in it!  In the middle of a freaking huge a$$ mall none the less....  I had to carry my heffer of a boy, 15 lbs purse, 30 lb diaper bag while chasing my freaking daughter around!!!But on another note...In WA state you can take 12 weeks of maternity leave, and when I was pregnant with my daughter i was working and had 12 weeks of PAID maternity and then took 6 weeks of PAID sick leave...  So every state is different.But I am a SAHM now, and I can stay home because it's cheaper to stay home then pay daycare out the a$$ for my kids.  Plus my Dh has a high paying job but he's gone for 18 hours a day,.....  ***** but good I guess..",
            "post_id": "3507972",
            "timestamp": "1223522158",
            "user_id": "user_561451",
            "user_link": "/personal_pages/user/561451",
            "votes": "0"
        }
    ],
    "post_id": "3504608",
    "question": "Well I'll tell you what's up today!  VENTING, THAT'S WHAT'S UP!I'm venting today because My boss has decided that she's going to treat me like an idiot and I'm ultra mad.  I want a new job.  The sad part is, I already have accumulated enough time here that if I got pregnant I am eligible for maternity leave.  If I found a new job and I got pregnant, I wouldn't have enough time accumulated for maternity leave, I don't know what to do.  But I'm sick of this bs.Thanks for listening!Please use this time to say anything about your life, how's it going, venting, anything!",
    "timestamp": "1223476469",
    "title": "What's up Wednesday?!",
    "user_id": "user_461781",
    "user_link": "/personal_pages/user/461781"
}