{
    "answers": [
        {
            "answer": "Definately keep it.  It was given to you for a reason.  Babies are a gift...you don't ask questions and you don't deny them because something may be different.  besides life throws you cards all the time to see what you can handle.  What would that lady do if the baby was born healthy and then later down the road something tragic happened....would she regret or love it less? I dont know I am with you blondie I want one so bad and lost one too.  It saddens me that someone would choose to get rid of a baby for that.",
            "post_id": "1096738",
            "timestamp": "1080021600",
            "user_id": "user_59821",
            "user_link": "/personal_pages/user/59821",
            "votes": "0"
        },
        {
            "answer": "No one has the right to judge someone in there decision.  If the woman chooses to abort that is her wish.  If you guys feel that you would keep no matter what, then that is your choice.  The world is made up of freedom and lots of choices to be made.  No one can make them for yourself but you.",
            "post_id": "1096741",
            "timestamp": "1080021600",
            "user_id": "user_47729",
            "user_link": "/personal_pages/user/47729",
            "votes": "0"
        },
        {
            "answer": "First off let me say NOONE is judging anyone here or anywhere.  Just like we have freedom to make choices we are also free to have an OPINION and that is all this is.  Yes I am totally against abortion for any reason but I do not look down or judge people because they have had one.  I was just asking what people would do in this case.  I am looking for honest answers.  If you think you could terminate the pg then fine that is your decision I myself would choose not to and that is my decision.  Thank You",
            "post_id": "1096747",
            "timestamp": "1080021600",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "I agree we should not judge, however, I also must say that there is absolutly NOTHING wrong with women who have lost several babies to be angered by the flippant decision of those who can easily get pregnant to terminate because that fetus does not meet their ideals of perfection.I am reminded of a story from California when I was considering being a surrogate mother. A surrogate agreed to the testing requested by the \"expectant\" couple. DH sperm, donor egg. The testing came back with the fetus being pos for Down's. the couple asked her to terminate and she refused. They sued her before the baby was even born and 3 months later she had a perfectly healthy baby girl WITHOUT down's. Teh couple sued for custody and was rewarded with only visitation beacuse \"they didn't accept the baby as is before birth and only wanted contact when they realized she was indeed healthy.\" It was considered that these parents couldn't unconditionally love this child and so did not deserve to raise her.As for the question of a defect that would make life impossible for the baby to live...I agree with you blondie. I would rather have my baby go to God from my arms that to be ripped from my womb and killed in the process.And let's face it. A couple can TRY to terminate ALL the pregnancies it wants in search for the \"perfect\" baby, and all they are left with is a child who has to try to live up to those parents unfair expectations.",
            "post_id": "1096749",
            "timestamp": "1080021600",
            "user_id": "user_59607",
            "user_link": "/personal_pages/user/59607",
            "votes": "0"
        },
        {
            "answer": "I have to say, I do agree with steph183.  Nobody should be judged for their actions even if you yourself would not take that route.  I don't know what I would if I found out the child I was carrying had severe defects.  I don't think anyone who has not actually been in that situation could really know what decision they would make.",
            "post_id": "1096750",
            "timestamp": "1080021600",
            "user_id": "user_59527",
            "user_link": "/personal_pages/user/59527",
            "votes": "0"
        },
        {
            "answer": "What a controversial subject to bring up!  I think that's just looking for a reason to stir up trouble.  I agree with \"stillhopeful\".  Who knows what you would do until you're put in that situation.  This is a very private subject that's best left alone.",
            "post_id": "1096763",
            "timestamp": "1080021600",
            "user_id": "user_32869",
            "user_link": "/personal_pages/user/32869",
            "votes": "0"
        },
        {
            "answer": "Good point Machelle.  I agree completely.  I did not have the test when I was pregnant with my daughter and I won't have it this time either.In my girlfriend's case as I exampled above she found out during a routine ultrasound so sometimes those decisions that have to be made don't always come out of the amnio testing but found during very routine exams and checkups.",
            "post_id": "1096779",
            "timestamp": "1080021600",
            "user_id": "user_55779",
            "user_link": "/personal_pages/user/55779",
            "votes": "0"
        },
        {
            "answer": "Well you have hit the one subject that I struggle with on a daily basis.  I pray and pray and pray that my baby will be healthy, but the odds are greatly against me.  I am 40 and I think the chance of having problem are 1 in like 150.  So what will I do is the question, I pray I will never ever need to make any kind of decision.  The thought of the likelyhood makes me cry.",
            "post_id": "1096781",
            "timestamp": "1080021600",
            "user_id": "user_61311",
            "user_link": "/personal_pages/user/61311",
            "votes": "0"
        },
        {
            "answer": "Well since I am opinionated and like to offer as well as hear other's opinions I am always up for a good discussion.  I don't think that I myself would terminate any pregnancy because testing has come back that the baby may be less than perfect or have some defect.However, I do have a friend who was carrying a baby with severe kidney defects and the doctors told her to abort as the baby would not be able to live outside the womb and she would not carry to term but she decided to carry it.  She was having continous ultrasounds once a week and they were basically waiting to find no heartbeat.  Eventually she went in and there was no heartbeat and she ended being induced and delivering the baby who was stillborn.  The severe physical and emotional strain for her was so great that she now says she wishes that she would have aborted because she is having so many psychological issues to deal with.  Now maybe she would have had those same issues either way but I think the delivery for her was so traumatic and has a great deal to do with her psychological state.So I guess in the end you really don't know what you would do until you have walked in those shoes.  You can say one thing and circumstances might dictate another.My heart really goes out to anyone, no matter what their final decision is, who would have to make that type of decision.",
            "post_id": "1096770",
            "timestamp": "1080021600",
            "user_id": "user_55779",
            "user_link": "/personal_pages/user/55779",
            "votes": "0"
        },
        {
            "answer": "Well honestly, it would not matter either way. I would keep my baby and love him/her as my others. That is one reason why dh and I have opt not to do any of those test. All I want to know is if the baby is doing well in my womb (and maybe the sex..lol). But other then that, it doesnt matter to us. I remember my doc wanted me to have an amino with my second son, and I had refused to do that. Not only does this procedure have some risk to it, but I wouldnt care either way if my baby had a defect or not. But hey, that just us:)Machelle'DS(6)DS(3)~i~(4/03)EDD 8-6-04(its a boy)",
            "post_id": "1096777",
            "timestamp": "1080021600",
            "user_id": "user_30868",
            "user_link": "/personal_pages/user/30868",
            "votes": "0"
        },
        {
            "answer": "Personally, I don't plan on having the tests done. If God wishes for me to be faced with adversity, then I see it as my job to take it on. Does it upset me that people would do this? Of course, because I have lost a baby NOT by my choice. I agree with blondie that this is an opinion- not me saying what someone else should or should not do.I was VERY early when I was born, and the doctors told my parents there was no hope of me ever leading a normal life. Happy to report, I have a bachelors, masters degree, and a very happy life. Believe it or not- DOCTORS CAN BE WRONG! and so can their tests!",
            "post_id": "1096784",
            "timestamp": "1080021600",
            "user_id": "user_65133",
            "user_link": "/personal_pages/user/65133",
            "votes": "0"
        },
        {
            "answer": "This is one of those taboo subjects that your not supposed to bring up, but since you did.  there is a family that goes to my church they found out they were having twins they thought they were so blessed.  as time went on mom started having preeclampsia (sorry for spelling) it only worsened to the point were the doc said she either deliver very eaarly or surely all three of them would die, or they could continue the pregnancy and give the twins a better chance at survival but mom then would most curtainly die or at the least stroke out.wow talk about a decision, by the time they made their decision the condition had worsened to the point that before they took her in for the c-section they brought each of her family members and lastly her husband to say good bye because they didn't think she would live through surgerygood ending she lived babies had complications some severe but are now strong and healthy.moral....God works in misterious ways",
            "post_id": "1096786",
            "timestamp": "1080021600",
            "user_id": "user_65183",
            "user_link": "/personal_pages/user/65183",
            "votes": "0"
        },
        {
            "answer": "Opinion. That is what everyone is entitled to. It depends on the situation and what the mother to be feels is the best for her un-born child. I can't say what I would do or what I wouldn't do. I am not in that situation. I don't think that you can fully decide what you would do, because every situation is different and needs certain planning and decisions made. I don't know if someone says yes I would abort it if there was something wrong... Ok what could be wrong? What would it take to abort your baby or keep him/her? I would be so excited to be pregnant, that I would probably do anything to keep my baby, just like all of you would try. But if there is no chance for the baby to survive outside of your womb, they why not let him/her go home sooner, than to suffer longer?",
            "post_id": "1096797",
            "timestamp": "1080021600",
            "user_id": "user_65892",
            "user_link": "/personal_pages/user/65892",
            "votes": "0"
        },
        {
            "answer": "Oh, you poor thing!!  ((((((hugs)))))  I have no answers, but you have my sympathy and support.As far as the other question is concerned...I think it is wrong to abort.I think it is right for parents to have that choice.I might judge someone for aborting a child because it wasn't 'perfect' - hey, I'm only human!  But I don't make it a habit because I think people pretty much are doing their best in life, and unless I have walked in their shoes I cannot know their struggles.",
            "post_id": "1096825",
            "timestamp": "1080021600",
            "user_id": "user_43487",
            "user_link": "/personal_pages/user/43487",
            "votes": "0"
        },
        {
            "answer": "Hey! I just noticed you're havin another boy! I have three sons too! =) How fun! =) I just had to say somethin! Congrats! =)Kellie",
            "post_id": "1096803",
            "timestamp": "1080021600",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "Christie: I would have to agree with you.  I don't know why anyone would even get on this subject.  It's such a personal issue.  I personally don't think it's right to even bring it up.  Whatever decision a family makes if put into that situation would not be the right one in someone's eyes.Machelle:  Conrats!  I didn't know you found out what you were having.",
            "post_id": "1096806",
            "timestamp": "1080021600",
            "user_id": "user_32869",
            "user_link": "/personal_pages/user/32869",
            "votes": "0"
        },
        {
            "answer": "Thanks. Actually we just found out last week at our 20wks u/s and check-up. I knew we were having a boy all along so Im very excited. :)Machelle'",
            "post_id": "1096813",
            "timestamp": "1080021600",
            "user_id": "user_30868",
            "user_link": "/personal_pages/user/30868",
            "votes": "0"
        },
        {
            "answer": "This is a forum to discuss ANYTHING!!!!!!  I was not being controversial I was just wanting to know how many people might actually do this.  I thought the numbers would be surprising.  NOONE was judged here & NOONE should be offended by anything that was said here.  This was a question of the day brought up at work once & thought it was very interesting.  Like I said even I would have to think about it.  I brought it up to my husband & he made me realize that if that is God's plan who are we to mess with that.  Sorry to have offended anybody.",
            "post_id": "1096814",
            "timestamp": "1080021600",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "You have not offended anyone.  But by making statements such as \"my husband made me realize this is God's plan\" you are implying that if someone else thinks otherwise, they are against \"God's plan\".This is obviously a hot button issue for all concerned here.  There are many desperate to conceive here.  There are some who come for unwanted pregnancy advice.  Some are just interested in maternal-child issues.  We all hold very different views, so bringing this up could raise tempers and hurt feelings.I would like to think we can all discuss anything, but abortion and other issues have been brought up in the not to distant past, and almost destroyed this forum.  Just look what happens anyone posts here looking for unwanted pregnancy advice.",
            "post_id": "1096817",
            "timestamp": "1080021600",
            "user_id": "user_21786",
            "user_link": "/personal_pages/user/21786",
            "votes": "0"
        },
        {
            "answer": "Amen!  I couldn't have said it better myself.I am a Christian, with a very strong faith in God, and if faced with such a tough decision, I'm not sure what we would do.  I'm sure after lots of prayer and thought as to the quality of life my child would be faced with, our decision would be based solely on that and NOT on the opinion of total strangers on a forum.  I think this forum is so wonderful for lots of support, but I'd never come hear looking for advice on a subject so fragile as this.Blondie72:  I am in no way lashing out at you or criticizing you for bringing this up, I just have seen it happen so many times on this forum, where subjects like this are brought up, and nothing gets accomplished except a huge cat fight.  It's one of those issues better left alone, because no matter what's said, someone will become offended.  There's just no right answer here.  So, on a lighter note......How are you feeling?",
            "post_id": "1096820",
            "timestamp": "1080021600",
            "user_id": "user_32869",
            "user_link": "/personal_pages/user/32869",
            "votes": "0"
        },
        {
            "answer": "ok i'm on day 5 of AF and the clots are unbearable.  I always have had 7 day periods but this is ridiculous...at least by day 3 they are usually calmer.  I'm going nuts, and i'm SO cranky i'm driving everyone around me insane.  WHY am i having such horrible periods since my ectopic? I hate this!",
            "post_id": "1096824",
            "timestamp": "1080021600",
            "user_id": "user_45294",
            "user_link": "/personal_pages/user/45294",
            "votes": "0"
        },
        {
            "answer": "This is a pretty inflammatory opinion poll.Everyone (thankfully) still has the right to make these decisions based on their own personal feelings and particular situation.It is not right to judge anyone else for what they would do in a heartbreaking and tragic situation.",
            "post_id": "1096798",
            "timestamp": "1080021600",
            "user_id": "user_21786",
            "user_link": "/personal_pages/user/21786",
            "votes": "0"
        },
        {
            "answer": "A lot of the entries on here seems to be saying \"don't be judgemental\". However, aren't you being judgemental of those of us against such a thing? I at least never said anyone was wrong for expressing his/ her opnion, or \"out of line\". Aren't those of us opposed to it just as entitled to our beliefs as those of you who could see a reason for it? You are right, EVERYONE is entitled to his/ her beliefs. That includes those of us who oppose it. Just because some people don't agree with what I believe doesn't mean I don't have a right to express my opinion WHEN ASKED!Blondie posed the question as a \"what would you do?\" and that is what most of us were doing: telling what we would do and why. Personally, I think I can make that decision. Why you ask? Because I have already told my doctor I decline the tests. Again, because that is MY belief and right.",
            "post_id": "1096830",
            "timestamp": "1080108000",
            "user_id": "user_65133",
            "user_link": "/personal_pages/user/65133",
            "votes": "0"
        },
        {
            "answer": "When I went in for the appointment when we found out my son was gone, the nurse asked me (before we knew he was gone)if I wanted my baby to be tested for defects.  We told her that we would just to know. she told us they were having a lot of false positives and asked if it would change our situation.  We told her in no uncertain terms that we would not end the pregnancy no matter what. She then suggested not testing to save us from worring. It ended up not mattering, but I am really glad that she and the doctors knew that we wanted our baby no matter what.I don't judge people that have abortions.  I don't agree with it but I have never been in their shoes.  I personally would not have an abortion, but they are entitled to their opinion.  I do get upset over the lost of the baby, because I wanted my son so much and loss him anyway and they decide not to continue the life of their baby.  It makes me mad, but at the loss, not the person.  I know that everyone has a different life and make different choices.",
            "post_id": "1096836",
            "timestamp": "1080108000",
            "user_id": "user_64371",
            "user_link": "/personal_pages/user/64371",
            "votes": "0"
        },
        {
            "answer": "I want to thank everyone who did answer this honestly and who actually supported me in this question.  Like I said it was not meant to anger anyone or hurt anyones feelings.  I really never thought it would.  Like gopokes said I asked what would YOU do????  No one needed to go into a big heated argument about this a simple I would or I would not or an I don't know would have been sufficient.  To christie (I believe this is who commented on this)  when I said my husband made me realize it is Gods plan and who are WE to mess with that I was talking about my husband & I.  I am speaking of myself personally here.  I did not mean WE as in all of us here on this forum.  To Silo I am sorry you were not happy with this question and by the way I am not feeling to bad it just hurts like hell right now in my back whenever I take a deep breath.  Well I think maybe we can leave this subject alone now.  Again thank you especially to you gopokes for the support on this.",
            "post_id": "1096856",
            "timestamp": "1080108000",
            "user_id": "user_56216",
            "user_link": "/personal_pages/user/56216",
            "votes": "0"
        },
        {
            "answer": "Hello,Well Cheesetoo I am wondering where you get your stats. I helped deliver a baby for a 47 year old mother and the baby was born perfect. I don't tend to pay attention to the world's stats because I know who is in control. So please don't worry so much but spend your time more constructively in prayer.LOL I will be praying for you. As for the question in this post, I don't have any intrusive tests when I am pregnant and I would not terminate a gift from God no matter the curcumstances. I have a sister who was told early in her pregnancy that her child had Triosomy 18 and was urged to abort based on a blood test only! She declined and I delivered a perfect little baby girl for her. I also have a sister in law who had a still birth for unkown reasons and would not have done it any other way. I only know what it is like to have first trimester miscarriages but through the pain I trust God completely. I don't mean to sound rude, I am also opinionated. This forum has been a true blessing for me. Thanks,Helen",
            "post_id": "1097066",
            "timestamp": "1080280800",
            "user_id": "user_59804",
            "user_link": "/personal_pages/user/59804",
            "votes": "0"
        }
    ],
    "post_id": "1054927",
    "question": "I was reading a post the other day from a different site and I came across one that a women wanted to have the amnio test done because she wanted to know if her baby would be born with a defect because if it were so she was going to terminate that pregnancy.  I have actually heard a few people say they would do that. It really angers me to hear such things.  Especially after I had already lost a very wanted baby.  How can you purposely kill it just because it is not perfect.  I myself was asked this question and it sickens me now but I actually had to think about it.  I can't believe I would even think about it.  I would never terminate a pg for any reason.  I think even if my childs defects were life threatening I would want to have the chance to hold my baby and let it feel loved before the Dear Lord chose to take them from me.  So my question to all of you is this.  WHAT WOULD YOU DO???Thank You,",
    "timestamp": "1080021600",
    "title": "What would you do???  This is for everyone (like a survey)",
    "user_id": "user_56216",
    "user_link": "/personal_pages/user/56216"
}