{
    "answers": [
        {
            "answer": "LOL... I have my c-section scheduled for October 11th. I probably won't make it til then. I was hoping more for a September baby. I just hope she's not born on my nephews birthday which is the 9th of October. My daughter already shares her birthday with her cousin, I don't want another kid of mine sharing their birthday. I actually had my daughter at 37 weeks so hopefully the same with this baby. How is everyone else going? Anyone else think they'll have thier baby before thier due date?",
            "post_id": "6149103",
            "timestamp": "1284670952",
            "user_id": "user_915119",
            "user_link": "/personal_pages/user/915119",
            "votes": "0"
        },
        {
            "answer": "Well I officially have 3 weeks 2 days until my due date which is kinda freaking me out. I had my last daughter at 38 weeks and that is only 9 days away from where I am now... yikes! 2 1/2 weeks ago I was 2 cm 60% effaced and a -1 station but I wasn't checked this appointment since I'm not on bed rest anymore (YAY!) so I don't know if I've made any progress or not. I'm kinda hoping I haven't since I am determined to have a Libra baby and the sign of Libra doesn't start for 8 more days. Baby is supposedly measuring in at about 5 lbs 4 ozs so she could be a small one like Aspen was. Kinda glad I stocked up on that preemie clothes during bed rest. I tested negative for GBS this time around so I only have to be at the hospital 24 hours and actually not have an iv this time! Means I can walk and mess around during labor instead of being shackled to my bed like a prisoner! I haven't packed my hospital bag yet but my sister is supposed to be returning my suitcase to me tonight so I might do it either later tonight or tomorrow or next week some time. I do however have Navy's hospital bag packed and ready! I have her going home outfit and her possible picture outfit. Although I'm thinking of getting her newborn pictures taken somewhere other than the hospital so we'll see if it is actually needed. The room is finally 100% complete and is sitting in pristine condition waiting for her to arrive. The other day I got this huge cleaning urge and actually pulled out the washer and dryer to scrub behind them. DH wasn't happy. Hmm... other than that nothing really big happening. Still getting contractions on and off and they are starting to get worse... but that is expected at the end of pregnancy. I just wish I knew when she was coming. With Aspen my water broke and so I knew I had to go to the hospital and that was it. This time I'm worried I won't know when I am actually in labor and I am so stubborn I refuse to go to the hospital unless I am 100% certain. This could be bad if she decides to come fast. Oh and DH decided that he is going to take a week off when the baby is born! I think it is very sweet of him to be there with us for the first couple days. I'm going to need that help!",
            "post_id": "6149131",
            "timestamp": "1284671353",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "Oh and I forgot to say that Snewell already had her baby so I think she is the first October mommy to give birth! Not sure if anyone else has yet.",
            "post_id": "6149144",
            "timestamp": "1284671547",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "lol. Alaysha is correct! Jett arrived on aug. 30. I had placental abrubtion and had to have an emergency c-section. It was a very scary situation and I am so luck that everything ended up ok. I was cooking dinner and blood starting running down my leg. I had no pain and drove myself to the hospital. It was very quick and painless. The only thing that really scared me was doing it all alone. My husband was 3 hours away.  Jett was 4 lbs. 15 ounces and 18.5\". He had to stay in the NICU for 9 days. He is finally home and doing great. He is now 5 lbs and 19\" long and as cute as a button! lol. Thanks for all the prayers! Good luck to everyone else!!! And just to let you first time moms know....(if you're having a c-section) it's not bad at all. The epidural didn't hurt a bit. Nothing was half as bad as I expected it to be. Even getting the staples taken out 3 days after the delivery didn't hurt at all. Oh and the baby weight seems to be coming off  pretty easy too. Without working out! The only thing that isn't working for me is breastfeeding. And that is because he was in the NICU with a feeding tube and then they introduced bottles right away. So he doesn't want to breastfeed and it's hard to keep my supply up. But I\"m trying everything I can to keep pumping so he can have as much as I can give him!Good Luck Ladies!!!!",
            "post_id": "6149403",
            "timestamp": "1284676035",
            "user_id": "user_1036906",
            "user_link": "/personal_pages/user/1036906",
            "votes": "0"
        },
        {
            "answer": "And P.S. ----this job cannot be done by 1 person. My DH is traveling with work and I have someone here to help me until he gets home in 3 months. I tried doing it all by myself the first day and I won't ever be that stupid again! Get all the help you can....don't be afraid to ask. If not you will never sleep again!",
            "post_id": "6149413",
            "timestamp": "1284676183",
            "user_id": "user_1036906",
            "user_link": "/personal_pages/user/1036906",
            "votes": "0"
        },
        {
            "answer": "I've had a big feeling that my little bubbs will come early too. I'm thinking sometime when I'm 38 weeks! LOL I could be so wrong and probably have him late. The hospital bag is packed and diaper bag is packed. I'm just thinking now about adding some snacks in the bag but unsure of what to actually take. I'm also going to stock the car with a couple pillows too so it's all in there so we don't forget.I'm glad Jett is doing good snewell!! It must be difficult without DH there!I can't believe how close all of us are now...time has flown by~",
            "post_id": "6149716",
            "timestamp": "1284681978",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "I am due October 28th, but my doctor said on Tuesday at my 34 week checkup that I will be having my baby girl within the next two weeks due to my cervix being SO short and I am already dilated. She said they wouldn't stop me, so we shall see! I am on bedrest, but it doesn't seem to be helping all that much. I have been on Prometrium too for contractions, but that also hasn't helped much. Baby is measuring big and so am I, so I guess they don't think it will be a big deal if I do go into labor anytime soon! There is a full moon on the 23rd (and I know that it doesn't really say much as it doesn't happen to everyone and we can't really say if its true or not) and I can see if I apply to that or not..lol!I am glad I found this forum b/c its so neat being able to talk to others who are due the same month I am!!!!",
            "post_id": "6149756",
            "timestamp": "1284682621",
            "user_id": "user_188576",
            "user_link": "/personal_pages/user/188576",
            "votes": "0"
        },
        {
            "answer": "I would put all my egg in delivering early just due to dilation. Freshlove has been like 3 cm and pretty effaced for weeks and hasn't delivered. I was put on bed rest at 32 weeks and told I wouldn't make it to term and I'm 2 cm 60% effaced and she is almost fully engaged and that was 2 weeks ago (don't know what I am now) but I am now 36 weeks almost 37 and off bed rest and still nothing. I heard that its common to dilate early with the more pregnancies you have so being dilated if we've already had one isn't unusual. Wouldn't it be amazing if doctors could give us a legitimate time line for delivery? I have to admit I'm slightly po'ed that I was told I would have her early went through all that stress and the steroid shots to develop her lungs had to be bored out of my mind and leave work a month early for NOTHING. I wish I hadn't even listened to their advice. I know they did it as a precaution but god how annoying. My sister even took work off for 2 weeks to come and watch my child since I wasn't allowed to get up to even open the fridge for her.",
            "post_id": "6149970",
            "timestamp": "1284686880",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "I don't have much to update, lots of BH contractions. Several times I've gone 5 to 6 hours with regular contractions, but I tell Jacob it isn't time yet and they magically stop- weird right? I'm determined to have an October baby! I feel like I'll go earlier than expected, but I bet I'm wrong. I am due the 10th which happens to be my dad's 50th birthday... so for lunch I celebrate his birthday, then for dinner I celebrate my father-in-law's 50th birthday (seriously how does that even happen). That was the ONLY day that worked for BOTH parties so everyone could make it. So I'll probably be one of the 3% (I think it is) women who delivers ON her due date hahaha.I haven't packed a hospital bag- I know they say not to do that when you go into labor, but I have a very specific list of what I want to take and I'm probably going to wait until I am convinced I'm in real labor to pack and go. I don't know if I'll have a fast labor or not so I don't want to get to the Birth Center too early! If I should happen to go fast, I have all the stuff I would need to deliver at home- including and oxygen tank and scale! haha I think I have my bases covered!So now we're kind of all in the worst TWW ever haha. Except we don't know if we will make it two weeks (or more)!",
            "post_id": "6150342",
            "timestamp": "1284694987",
            "user_id": "user_1149221",
            "user_link": "/personal_pages/user/1149221",
            "votes": "0"
        },
        {
            "answer": "I dont know when my little girl will come but I have 2 weeks and 4 days till my due date and would love for her to come early. Having some seriously painful contractions today and yesterday but nothing regular. Dont know if I have dilated any since last week  since they didnt check me this week. Hope that when I go in Wednesday I will get some good news. I cant wait for my little girl to get here so I can hold her and see her. Its sad to think its almost over. But at the same time so exciting. Not to mention how close yet far away it seems.",
            "post_id": "6150351",
            "timestamp": "1284695225",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "Well at my 27 week apt on Wednesday I was 75% effaced and 2 cm diolated, that's exactly where I was when I went into labor with my first (two weeks late though).  My contractions have increased in amount and intensity.  I've started keeping tabs on about how far apart, I think I'm at about 10-15 min, but there still considered random because there are some times during the day where they are longer between.  I've been having such horrible back pain with most of the contractions and my MIL and SIL both feel that I'll go into labor in the next day or two.  She's also dropped as low as she can get with out actually being born!  I'm in so much pain and walking is the only thing that is remotely comfortable, although that even is painful!  I feel like my body is falling apart!  I feel worse right now than I did when I was waiting for my first to be born, so I hope that's a sign that She'll be here soon!Last night DH packed the hospital bag and the bag for our son.  We've got a few options for our baby's photo outfit at the hospital as well as some nice cute warm ones to take her home in.  (We even grabbed some of our boy clothing from our son in case she ends up a boy).  AND we finally picked a name!!  Elinor, although were still working on figuring out how to spell it.  My MIL even picked up a bottle of wine for us while she was out shopping, I actually feel ready.  The only thing left we need to do is get the crib set back up, but that won't take long.I'm so excited to start hearing about all of us who are so close, it's just a waiting game now!",
            "post_id": "6151371",
            "timestamp": "1284728723",
            "user_id": "user_1128483",
            "user_link": "/personal_pages/user/1128483",
            "votes": "0"
        },
        {
            "answer": "I'm not sad that it's almost over at all. I ready. LOL I think people at work are actually on stand by and so is my husband. Every morning when I get to work my co-workers say I guess it's not happening today. LOL@snewell Congratulation are indeed the 1st Oct mom to deliever.When I went to the hospital the drs said I was 50% effaced and a -1 something or another lol. I'm confused about what this means. I guess my cervix is thinning out but not there yet.",
            "post_id": "6151374",
            "timestamp": "1284728765",
            "user_id": "user_933846",
            "user_link": "/personal_pages/user/933846",
            "votes": "0"
        },
        {
            "answer": "Whew, I missed this post a while back I guess... I'm due OCTOBER 3rd, but I I'm hoping he comes on the 1st!! Just a slightly cooler birthday I guess. 10-1-10 but either way... I'm early October. I'm 1cm dilated and 50% effaced and on Tuesday at my next doctors appointment, we'll see if anything has changed.",
            "post_id": "6151575",
            "timestamp": "1284732683",
            "user_id": "user_1205562",
            "user_link": "/personal_pages/user/1205562",
            "votes": "0"
        },
        {
            "answer": "OOoh my birthday is the 23rd!! I wonder if any of us will have a baby on my bday! One of you can....I personally don't want to be in pain on my own birthday! LOLMaybe since it's a full moon then there will be a lot on that day!!",
            "post_id": "6152905",
            "timestamp": "1284749574",
            "user_id": "user_689528",
            "user_link": "/personal_pages/user/689528",
            "votes": "0"
        },
        {
            "answer": "For September the majority of them went on the new moon. Next new moon is like October 7th. Lets see which one actually gets more births the new moon or the full moon!",
            "post_id": "6152932",
            "timestamp": "1284750020",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "I am due Oct 27th and I will probably not go early LOL I am just going to let baby boy cook as long as he likes, as long as he does not go past 42 weeks :) I cant wait to see his little face and have his big sister love on him. We are planning a home birth and I am excited to see how that will go, I had a hospital birth with my first with all the intervention stuff that happens and I hope that my natural home birth will be everything I expect.",
            "post_id": "6153684",
            "timestamp": "1284763396",
            "user_id": "user_173526",
            "user_link": "/personal_pages/user/173526",
            "votes": "0"
        },
        {
            "answer": "I'm due 9 October but my doc doesn't think that I'll make it that far.  She went from scheduling a 1 Oct c-section to changing it to 6 Oct.  But with my high blood pressure and gestational diabetes, she's just glad that we made it to 37 weeks and is heavily debating on delivering next week 20-22 Sept.  Since she's been wishy washy as of late, I'm not going to get my hopes up too high.  I will see her again on Monday for another one of my twice a week NSTs and she'll make the decision then.  I've had low dull backaches and whenever I get up to walk around my belly is rock solid tight.  The only time it lets up is if I lay down, so I've been chilling out catching up on some shows that I've missed while doing my college classes.  I'm trying my hardest to be patient, but it's been 15 yrs since my last baby and I can't wait to see him!!!!! I've packed and repacked our bags, rearranged his room, and this weekend will be spent prepping dinners for my husband kids to eat while I'm the hospital.  I'm too excited!!",
            "post_id": "6154378",
            "timestamp": "1284779742",
            "user_id": "user_1186671",
            "user_link": "/personal_pages/user/1186671",
            "votes": "0"
        },
        {
            "answer": "I'm due on the 17th everyone thinks I will go earlier butttt I don't think so",
            "post_id": "6155243",
            "timestamp": "1284815852",
            "user_id": "user_357635",
            "user_link": "/personal_pages/user/357635",
            "votes": "0"
        },
        {
            "answer": "I have 4 weeks left to go. I walk alot at work due to construction that has been going on all year long. (about 45-1 hour a day) I think she will be here earlier than her due date but I would like it if she stayed in til the date.When I went to my last dr appt they did a sono and told me her weight was about 5.5oz-5.11 oz I'm guessing she might gain another 2 or so pounds before delivery if I go all the way. (That kinda scares me if its more) lolPretty much ready for her and we have everything we need. Her room isn't quite finished as yet because we have her crib in our bedroom. But my husband did surprise me and painted her room yesterday while I was at work so it's coming along :)Going to the dr every week now. Do they check you at every visit now t see if you've dilated? Just curious since they did for my past 2 visits and I haven't as yet.We're almost there girls :))",
            "post_id": "6155949",
            "timestamp": "1284828568",
            "user_id": "user_1166767",
            "user_link": "/personal_pages/user/1166767",
            "votes": "0"
        },
        {
            "answer": "I'm scheduled to be induced on sept 27th. Super excited! Can't wait to meet my lo! Nothing much going on besides insomnia and pain . I just stArted to pack my bag so I need to get a move on that. Good luck ladies!!!",
            "post_id": "6160588",
            "timestamp": "1284962848",
            "user_id": "user_1415827",
            "user_link": "/personal_pages/user/1415827",
            "votes": "0"
        },
        {
            "answer": "As I posted last week the doc said I would go within the next two weeks, but here it is a week later and nothing and I am little upset b/c today I went in and had to see the PA. I am not being mean or anything, but I go to a specialist and pay $50 each visit and to see a PA, ugh! I have seen her more than my actual doctor and its starting to get annoying! There are two partners and the PA. I think I have actually seen my doctor maybe 4 times this whole pregnancy and usually that would be a lot, but for me, someone who has been in every two weeks since I was about 24 weeks and then at 30 weeks I started to go every week and it adds up! I just hate paying money for the specialist if I am going to see a PA!So last week my doctor told me I was 4cm and that my cervix was so short (she didn't use effaced) that it was 0.76 and that meant that I could go at anytime b/c only .76 of a cm was holding it in like a cork. She told me to take it easy but that I didn't have to be on bedrest seeing that the baby was measuring 3 weeks ahead and big and that she looked great and if I went into labor they would not stop it.Well, today the PA said that they would stop me if I did go into labor, even though she was measuring 6lbs 2oz roughly at 35 weeks and that she said I was only 2cm???? My cervix was still 0.76cm and she told me that I could not do anything or go anywhere and even complained about the fact that I had my 2 year old with me, but I have had a hard time this go around with help....I can't ask my family to take off for months before she even comes! They have helped but can't continue until after she is born. My daughter has to go to VPK otherwise she will get kicked out and I can't afford a nanny or to take my 2  year old to daycare other than the two days she is already going! I have no choice! And my MIL the one that can help has stage 4 cancer, so I can't depend on her b/c she is getting treatment plus working full time to pay for it all and is tired most of the time! I guess I am just venting, but I wish they would schedule me a date or something or stick with what one is saying! Oh well, just praying my little one comes soon since she is so big;) Guess I am just wishing too much!",
            "post_id": "6163780",
            "timestamp": "1285031938",
            "user_id": "user_188576",
            "user_link": "/personal_pages/user/188576",
            "votes": "0"
        },
        {
            "answer": "I know how you feel. I went into preterm labor at 32+6 weeks and was on bed rest until 36 weeks...my doc didn't even think I'd make it that long. I was in the hospital for 5 days got the steroid shots and everything, had to take procardia every 6hrs to make sure didn't have contractions. I'm now 38+6 weeks, almost 5cm and between 60 to 70% effaced, and having contractions 10 to 12min apart daily but STILL PREGNANT! lol.Hopefully I'm the next to go :)",
            "post_id": "6173443",
            "timestamp": "1285260098",
            "user_id": "user_1181036",
            "user_link": "/personal_pages/user/1181036",
            "votes": "0"
        },
        {
            "answer": "Well Ladies, my baby girl arrived on Monday, September 20, 2010 at 12:44 pm via c-section, I was scheduled to have her on the 28th of September, but she could not wait to be here. I woke up to slight bleeding and the doctor decided that she was ready at 38 weeks. Everything is going well. I am nursing and I had to supplement with formula, but hopefully once I get home I will produce enough milk. I really want to breastfeed her. I am up and walking around and feel great.Melissa's stats:Weight at birth 7 lbs 2 oz, length 19 inches.She is beautiful! I can not believe she is here. We get to go home today!",
            "post_id": "6173583",
            "timestamp": "1285262310",
            "user_id": "user_590782",
            "user_link": "/personal_pages/user/590782",
            "votes": "0"
        },
        {
            "answer": "Aww congrats!!! I am excited she is here and doing well! Id completely panic if I saw blood!",
            "post_id": "6173716",
            "timestamp": "1285264029",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "Congratulations!! I think we are all jealous. LOL",
            "post_id": "6173889",
            "timestamp": "1285266955",
            "user_id": "user_933846",
            "user_link": "/personal_pages/user/933846",
            "votes": "0"
        },
        {
            "answer": "As many of you know, baby Ian Andrew was born on September 20 @1812.  6lbs 7ozs and 19inches.  After 3 days in the hospital we're home now and enjoying every second with him.  Posting birth story on profile soon.  Good luck to those October mommies left!!",
            "post_id": "6184268",
            "timestamp": "1285537476",
            "user_id": "user_1186671",
            "user_link": "/personal_pages/user/1186671",
            "votes": "0"
        },
        {
            "answer": "Well after a trip to L&D friday I got sent home b/c I wasnt dilating any more. Was still at 1cm with 75% but found out she was at -3. Have my next OB appointment Wednesday hoping to go in a they will send me on over to L&D. Guess we will see what happens. Tried BD with DH to see if that would help no contractions though. Gonna walk a lot tomorrow since we are going out to run errands then I have class. DH is gonna drive me just in case.",
            "post_id": "6184833",
            "timestamp": "1285550735",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "I tried walking and that actually slowed the contractions I was having. Right now I am with very little contractions, but yesterday they were coming often, although they are not painful at all. I just feel a lot of pressure when I get contractions and then I feel very crampy in my lower abdomen. I think we all just want these babies out of us!!!",
            "post_id": "6184926",
            "timestamp": "1285552424",
            "user_id": "user_915119",
            "user_link": "/personal_pages/user/915119",
            "votes": "0"
        },
        {
            "answer": "I know what u mean about the contractions stopping i was having them pretty regular yesterday and the day before but very few today. Feeling crampy and lots of pain and pressure down there. I guess we will see what happens.",
            "post_id": "6185095",
            "timestamp": "1285556869",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "When is your next dr. appointment? I have mine on Tuesday so hopefuly there has been change in my cervix. Last time I was still at a 2 but the dr. did say he was able to feel her head. That was a change from my last dr. visit. Have you tried doing workout on a workout ball? I had been doing those before my last appointment and when I went in they did say her head was there. I was also walking about 2 miles a day. Let's just hope these babies pop out of us as soon as possible.",
            "post_id": "6185172",
            "timestamp": "1285558523",
            "user_id": "user_915119",
            "user_link": "/personal_pages/user/915119",
            "votes": "0"
        },
        {
            "answer": "Tiffiepooh hopefully your contractions pick back up and cause you to dilate more. But with only being 1 cm 75% effaced and a -3 (0 is head is engaged -5 is free floating) they wont admit you unless you are in labor or your water breaks. I think we all just want them out.",
            "post_id": "6185301",
            "timestamp": "1285560748",
            "user_id": "user_187316",
            "user_link": "/personal_pages/user/187316",
            "votes": "0"
        },
        {
            "answer": "Ugh, so I have a feeling I'm going to go past my due date. I just got slightly panicked thinking about my schedule the next few weeks. My husband is a farmer- so not only does he already work sun up to sun down with his regular carpentry job and side jobs his brothers and him do, he has crops to harvest and we have cows we have to get home from pasture. Then on October 10th- ya my due date- I have my dads 50th bday celebration at noon and then my father in laws at 6... Both of which I'm the planner and host of. I need to go through and make my house party ready, but I can't get motivated at all. Then the weekend after that were headed 4 hours west to my husbands uncles so they can finish his basement- that means either I'm huge and my husband might miss delivery due to the distance, or I'll have a very small newborn to travel with. I also have midterms and papers due mid-October and I haven't had the energy to focus on it cuz I'm used to doing homework after everyone goes to bed, but I'm just too tired to stay up anymore. Blah! Why did I do this to myself goodness!?",
            "post_id": "6186543",
            "timestamp": "1285601063",
            "user_id": "user_1149221",
            "user_link": "/personal_pages/user/1149221",
            "votes": "0"
        },
        {
            "answer": "You sound busy!!!! I know the feeling! I am in school with two girls under the age of 4 and am so ready for this baby! You need to just take it easy and do things a little at a time. You still have awhile, so maybe you could work you your homework, rest, clean/get ready for the parties, rest, and so on;) That's how I have been doing it lately. I clean and my girls mess up, so I have learned that when they go to bed, I pick up and then rest or hit the sack. Or I wait til the morning to pick up before they go to preschool and then get them ready to go and then come home and rest while they both or just one is gone. Today I haven't felt like doing much, as I cleaned all weekend, and luckily the class I am taking only requires one day a week to do the homework, test, or writings. Last semester was super hard b/c I had more than I could handle, but I managed to get through it and I see this semester being a breeze, even when the baby is born!Are you sure your gonna want to travel with a newborn? You might not feel up to it. The first three months were so hard for me to get into a routine, b/c I was so tired!Well, good luck to you and hopefully your little one will come sooner than your due date!",
            "post_id": "6186592",
            "timestamp": "1285601938",
            "user_id": "user_188576",
            "user_link": "/personal_pages/user/188576",
            "votes": "0"
        },
        {
            "answer": "I have been trying to work things in randomly throughout the day but these last few days I've just been so darn exhausted feeling that I can't force myself off the couch. I have never been this exhausted in my life! I think I'm going to pay my brother and sister to come clean my house and car and send my son to his grandmas so I can do homework. I guess taking a full class load was a dumb idea! I'm not worried about traveling with a newborn, but I am worried about all I have to worry about and how a weekend away will take from my list of work! I need to hire a nanny to come during a few days a week I supose. Or teach my toddler to babysit ;)",
            "post_id": "6189158",
            "timestamp": "1285647438",
            "user_id": "user_1149221",
            "user_link": "/personal_pages/user/1149221",
            "votes": "0"
        },
        {
            "answer": "My next appointment is Wednesday. And I dont have a work out ball was wanting to get one but idk if I will get a chance to before she decides to come. Good luck at your appointment.",
            "post_id": "6189281",
            "timestamp": "1285650606",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "Yeah I found out that much the other night at L&D. But I am hoping when I go in for my appointment Wednesday there will be some more change maybe enough they will send me to the hospital. I guess we will see.",
            "post_id": "6189287",
            "timestamp": "1285650696",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "Elias Quinn was born September 19th at 5:58am after being induced on September 17th at 8:45PM. I presented with preeclampsia at my 37 wk appt and then got admitted. I was due October 7th. I ended up having an emergency C-section because my blood pressure hit 160/99. He's healthy and wonderful. He weighed 7lb 11oz and 20 inches long. He's such a good baby. Can't imagine my life without him. I'm so in love. Good luck to the rest of the October ladies still waiting.",
            "post_id": "6190936",
            "timestamp": "1285694174",
            "user_id": "user_1108141",
            "user_link": "/personal_pages/user/1108141",
            "votes": "0"
        },
        {
            "answer": "Wow congrats. Glad to hear though things started badly that everything is going good now. Cant wait to see pics.",
            "post_id": "6191093",
            "timestamp": "1285696433",
            "user_id": "user_1083673",
            "user_link": "/personal_pages/user/1083673",
            "votes": "0"
        },
        {
            "answer": "Congrats!! Happy to hear that everything turned out good and you finally have your baby!!",
            "post_id": "6191930",
            "timestamp": "1285709540",
            "user_id": "user_915119",
            "user_link": "/personal_pages/user/915119",
            "votes": "0"
        },
        {
            "answer": "Thanks ladies! I have been reading everyone's updates as much as I can with a new one. I don't miss those last few weeks of miserable. I hope everyone gets to see their babies real soon!",
            "post_id": "6203109",
            "timestamp": "1285960345",
            "user_id": "user_1108141",
            "user_link": "/personal_pages/user/1108141",
            "votes": "0"
        },
        {
            "answer": "Finally getting around to Ian's birth story.  I went into docs office for my weekly NST.  She had noticed the week before that my blood pressure had gone up slightly so she said she would monitor my day by day.  Monday rolled around, BP was elevated, pre-eclampsia was setting in and she didn't want to risk it any longer.  She called over to L&D across the street and told them to schedule me for a c-section late that afternoon.  My husband was at work, I called him and told him to just finish up his work (since he would be on leave for the next 3 weeks with us) and then head over to hospital.  I went home and got ALL the bags, a pillow, some snacks...I was ready.  Got to the hospital at 10am and had to wait until 6pm for the c-section.  Longest day ever!  After sitting around for hours, all of a sudden right after the nurses shift change, I had 3 nurses in my room prepping me for the surgery.  An IV, shaving, cathedar, all the fun stuff and the next you know, I was being wheeled across the hall to the OR.  I was nervous about the epidural, especially since the guy giving me the shot hardly spoke english, he had a heavy korean accent and the nurses had to clear things up for me.  Epidural kicked right in and I was watching my husband walk in when I realized that the doc had already began cutting me!!!! SCARY! We were all talking and the nurses commented that the baby had a full head of hair when I felt what was like a moose on my chest.  It was the other doc and a nurse pushing my upper belly to try and push him out, they had to use a vaccum three times on him to try and get him out.  My doc is only 4\" 11 so she was on a stool pulling and tugging on my little baby.  She finally said that she got him out and he cried right away.  That's the best sound in the world besides the time when they first call you 'momma'.  The rest of the surgery went smoothly and recovery since then hasn't been bad at all.  Ian is the best blessing our family has had.  His 17 yr old brother and 15 yr old sister are enamored by him and love on him as soon as they walk in the door after school.  Dad is amazed by his son and I'm excited to watch him grow.  I don't miss being pregnant, maybe a little, but its definitely been worth going through the fertility treatments, IVF, and the wait to have him.  To all you other ladies, hang in there and your time will soon be here.  Best of luck to all those trying to conceive.  SSBD!!!",
            "post_id": "6217650",
            "timestamp": "1286336704",
            "user_id": "user_1186671",
            "user_link": "/personal_pages/user/1186671",
            "votes": "0"
        }
    ],
    "post_id": "6148983",
    "question": "So which one of us October mom are going to deliever first? I was just thinking about this and it seems like a few of us are almost there. My c-section is scheduled for Oct 6th but my doctor doesnt think I will make it til then. I'm guessing it will be the end of September again. My daughter was born 5 years ago on September 27th. Funny part is I told her that Peri may come early and she was excited. I asked her if she could come on her birthday and she said YEAH...then I said well that means you won't be able to have a party. She looked mad and said well NO!. LOL Funny! I finally packed my hospital bag and decided on the coming home outfit, however I dont have the picture outfit. I picked out the dress my other daughter wore as a back up but I'll be at Babies R Us this wkn to look for something else. I had 2 showers and they both were very girly and great. I am amazed that I got more this time around then my first. I have scheduled my last two drs appointment for this pregnancy and then the big c-section. I'm so ready to have my baby and ready to kiss and spoil her. The doctor thinks that she is already 6.5 lbs so Im not worried about her weight anymore. People at work have started to countdown my days. Every day someone sees me they say not today huh? LOLWhat's your update?",
    "timestamp": "1284669184",
    "title": "Whose going to be 1st/Weekly Update",
    "user_id": "user_933846",
    "user_link": "/personal_pages/user/933846"
}