{
    "sokalsneath": [
        {
            "answer": "Did you take her blood sugar when she was having the stomach aches? I guess I am just wondering if you discovered a pattern.  Maybe if you made a chart of when she gets the stomach aches and documented what she ate or activities she does on those days you might see a pattern and maybe be able to figure out if something triggers the lows or highs and stomach aches.  I do know that I have patterns myself--mostly due to hormones-like when I am ovulating my blood sugars rise and I must compensate with more insulin.   I know she is probably too young for that but now that I know what triggers my highs I can compensate and make my life easier.",
            "id": "2432280",
            "rank": 1
        },
        {
            "answer": "Has your child been tested for celiac disease?",
            "id": "2436449",
            "rank": 1
        },
        {
            "answer": "My 7 year old DD is doing the same thing. We get stomach complaints almost everyday. I have tried to find a pattern, but cannot. The pain she complains of is different than when her sugar is high and she has stomach pain. She is not constipated, but does sometimes complain of diarrhea. We followed all the foods she has eaten when it happens and nothing. We had the pediatrician run Thyroid and Celiac screenings and both were negative. We are taking her tomorrow to the gastro doctor just to be safe, but it is really bothering us. I hope we can get some answers.",
            "id": "2436451",
            "rank": 1
        },
        {
            "answer": "I have been a Type 1 diabetic for almostt 22 years. (I am 28 now).  When I was younger, probably between the ages of 12-15, I would get severe stomach pains where I would be doubled over almost unable to breathe.  They could never find any patterns or anything wrong.  Finally they told me to take Tums at the onset of it to try to get rid of it.  Sometimes it helped, sometimes it didn't.  There were a couple of instances where my sugar was low, but most of the time it was normal.  I eventually out grew them.Now, if my sugar is low I do get just an upset stomach, really uneasy, but is fine once I eat something light to get back up.",
            "id": "2436470",
            "rank": 19
        },
        {
            "answer": "Thank you all for your comments. I have not had her tested for thyroid or celiac disease.  I will definitely consult with her doctor about it.  For now I have been trying to see a pattern, nothing jumps out quite yet.  It does seem like it occurs most when she is high but not always. So it has been hard to discern whats causing the stomach aches.",
            "id": "2436472",
            "rank": 1
        },
        {
            "answer": "My daughter is 10 and is currently suffering from all of the symptoms that you are all talking about. I will go to the doctor and see what we can find. Her levels have been high and are now stabilizing - there has been no real reason as to this. We'll go and check it out!! Thankyou to all!",
            "id": "4335210",
            "rank": 1
        },
        {
            "answer": "Our daughter is in the same situation, she is 8 and was diagnosed 3 months ago.   Occassionaly shy complains of pain but it is not sore to touch.   It sometimes seems to be after a 'heavy' meal, e,g, including potatoes & turnips, but we haven't been able to see a pattern.  Our diabetes team dismissed same as being unrelated to Type 1.",
            "id": "6422428",
            "rank": 1
        },
        {
            "answer": "so frustrated....my nine year old was diagnosed type 1 a month ago....her numbers are doing so good but the poor thg feels like crap so frequently that it is affectting things more than the counting carbs and shots!!! she gets numerous tummy aches every day....it is making her grumpy and difficult....endocronologist does not believe its diabetes related but started the same time as diagnosis... wth????? cant find any trends....not only with highs...sometimes shes normal...before meals after meals.....super frustated....negative foe celiacs....any suggestions?",
            "id": "6637039",
            "rank": 1
        },
        {
            "answer": "To everyone on here I have a stepdaughter who is type 1 also and she has pains for a while it was most often than anything but after calling her endocrinologist he suggest we check her keytones and every time her stomach hurt and we checked her keytones they were always high.  All you can really do for it is have them drink water as much as they can and keep drinking water until their keytones come down.  After she drank water and water and water where she didn't want to drink anymore she had to keep drinking because after a little while she felt better.  The stomach pain went away.  Please I stress to much who anyone who had newly diagnosed type 1 kids to drink lots of water it is the cure to everything to make them stay feeling normal.",
            "id": "8955137",
            "rank": 1
        },
        {
            "answer": "To everyone on here I have a stepdaughter who is type 1 also and she has pains for a while it was most often than anything but after calling her endocrinologist he suggest we check her keytones and every time her stomach hurt and we checked her keytones they were always high.  All you can really do for it is have them drink water as much as they can and keep drinking water until their keytones come down.  After she drank water and water and water where she didn't want to drink anymore she had to keep drinking because after a little while she felt better.  The stomach pain went away.  Please I stress to much who anyone who had newly diagnosed type 1 kids to drink lots of water it is the cure to everything to make them stay feeling normal.",
            "id": "8955144",
            "rank": 1
        },
        {
            "answer": "I'm Sophie, and I was diagnosed with Type 1 Diabetes about 2 weeks ago. I'm 15 years old. I'm coping well with everything, including the injections, however when I actually inject the insulin it stings/burns. The actual pain of the needle prick is bearable but this burning sensation is not. Does this sound familiar to anyone? Anyway, back to the abdominal pain. It started about 3 days ago and although it is a constant 'severe hunger' sensation I get bursts/spasms of excruciating pain every hour or so. I returned to hospital and the doctor found that the glands in my neck were severely swelled and that I had trapped gas and knotting of intestines. He explained that these symptoms gave him the impression of a stomach bug/viral infection. 3 hours ago I gratefully swallowed two Buscopan tablets and although it took a while to kick in, the pain is finally easing.",
            "id": "9724415",
            "rank": 18
        },
        {
            "answer": "Cold insulin can cause the pain/burn when injected. Try bringing it to room temperature.",
            "id": "10480742",
            "rank": 1
        },
        {
            "answer": "Hi, I'm a member of a family with a little 3 year old girl with Type 1 Diabetes. She also complains of stomache pains.Reading these posts, and seeing some suggestions (Which we will try). I was thinking that maybe these pains might be a affect of the injections themselves (albeit maybe harmless).A bit like when someone sleeps in a draft and wakes up with a stiff neck. Or someone who is constantly in an uncomfortable postion, then complains of aches and pain. I myself suffer from shoulder pain, which was do not keeping my shoulders relaxed (Took a physiotherapist to spot that. lol).It was this that made me think that the pains may be a result of the nearby muscles or organs having to adjust to the repeated injections.I have noticed that our little girls stomach looks like an upside down shelf, from all the injections.When our little girl has her injection, she has a choice of areas to have the injection, though she favours the stomache usually.This is just a thought.",
            "id": "10534091",
            "rank": 17
        },
        {
            "answer": "I've been checking this topic this am as my 10yo son has been in the bathroom an hour with stomach pain. His sugar was high. 358 this am. Wondering if this has something to do with it or no?  Gonna get so e water in him and hope he gets to school. Late is better than not at all.",
            "id": "10990608",
            "rank": 1
        },
        {
            "answer": "I am reading all your comments and i must say what i found and think. My 20 year old son was diagnosed with type1 D almost a year and a half ago. I remember that before his diagnosis he was complaining of stomach pains on and off. He has been on insulin for a month after the diagnosis and then he started having lows all the time so we decided to stop the insulin. That was almost  1.5 years ago. His sugar readings were normal. Now he started having the pains again and his sugar is high again. So i think this is definitely related to the high sugar. Something in the stomach triggers something off and causes the sugars to go up. Im not a doctor but i think this should be looked into by some professionals. Obviously there is a pattern. Your body is giving you signs that something is going on that is not right. I'm shocked that doctors dont even bother to relate one thing to another instead they eliminate unrelated things like gas etc.  I hope all of us here with sick children with this disease will somehow try to connect the dots and maybe someone will hear.",
            "id": "11134995",
            "rank": 1
        },
        {
            "answer": "My son Sean has been type 1 since he was 10, he is now 25, and for the last over 3 yrs, he has had constant lower right abdominal pain,to the point where he has no life,no friends, and goes in and out of depression, and sometimes, he feels like he just can't handle life anymore!!!the pain gets even worse after eating,sometimes he only eats once a day because the pain is worse! his sugar levels get higher the more pain he is in! its like a vicious cycle,but his sugar can be in normal range,even when his pain is bad,it never changes he's always in pain. Been to the hospital over 65 times in 3 years,seen multiple dr.s and still no real answers,and not much help from any dr. Including any pain dr.,no help is tearing our family apart! HELP! Desperate!!!",
            "id": "11849482",
            "rank": 1
        },
        {
            "answer": "have they considered chronic appendicitis?",
            "id": "11866141",
            "rank": 1
        },
        {
            "answer": "Hi my daughter is type 1 diagnosed at age 7 two years ago and has had on and off busts of the pain in stomach.  we have been to numerous appointments clinic saying its unrelated and doctors saying anything from colic to IBS and have put her on omeprazole.firstly she was on injections in legs and still stomach pain, she is now on pump and still there so I don't think site injections are connected.  Her levels are really great on pump and still pain.  her levels will go higher when her belly is sore as pain of any kind will raise the levels as does stress so not sure the levels are causing the pain or the pain causing the levels.  we have with pump a keytone meter and check these every day and have to say she never has keytones with pain unless she has been unwell which will cause the keytones.  im at a lost cause really I would love them to put a camera down and see what they can find.to the lady who say drink loads and get rid of keytones yes this is true water will help but keytones are mostly caused by lack of insulin and not the high levels so it would be better to take much more insulin and flush them.  just a suggestion to clear your keytones quicker :)  high levels will only cause keytones if left hgh for long periods in other words lack of insulin.Jo",
            "id": "12188944",
            "rank": 1
        },
        {
            "answer": "my son is 16 and has had t1d for 4 years now. he is home from school said he has a stomach ache. he is going through a stage where he doesnt to his nighttime  shot and gets mad when i reminded him or ask him about his diabetes. this morning I asked him to check himself and he was over 400 so he took a correction. within 5 or so mins he said he was better.  I asked him if he took his nighttime and he said no. I am in tears and don't know what to do. a friend of mine is selling Plexus does anyone know about it? they said it has a carb blocker.",
            "id": "13748447",
            "rank": 1
        },
        {
            "answer": "I'm a 17 year old Type 1 diabetic, and I have stomach pains. It does not feel like a stomach ache, it is more of a sharp pain and it can be extremely painful sometimes. I have noticed that it happens when my blood sugar changes drastically/quickly or is running high for an extended period of time.",
            "id": "14142938",
            "rank": 20
        }
    ],
    "votes": [
        {
            "answer": "Did you take her blood sugar when she was having the stomach aches? I guess I am just wondering if you discovered a pattern.  Maybe if you made a chart of when she gets the stomach aches and documented what she ate or activities she does on those days you might see a pattern and maybe be able to figure out if something triggers the lows or highs and stomach aches.  I do know that I have patterns myself--mostly due to hormones-like when I am ovulating my blood sugars rise and I must compensate with more insulin.   I know she is probably too young for that but now that I know what triggers my highs I can compensate and make my life easier.",
            "id": "2432280",
            "rank": 1
        },
        {
            "answer": "Has your child been tested for celiac disease?",
            "id": "2436449",
            "rank": 1
        },
        {
            "answer": "My 7 year old DD is doing the same thing. We get stomach complaints almost everyday. I have tried to find a pattern, but cannot. The pain she complains of is different than when her sugar is high and she has stomach pain. She is not constipated, but does sometimes complain of diarrhea. We followed all the foods she has eaten when it happens and nothing. We had the pediatrician run Thyroid and Celiac screenings and both were negative. We are taking her tomorrow to the gastro doctor just to be safe, but it is really bothering us. I hope we can get some answers.",
            "id": "2436451",
            "rank": 1
        },
        {
            "answer": "I have been a Type 1 diabetic for almostt 22 years. (I am 28 now).  When I was younger, probably between the ages of 12-15, I would get severe stomach pains where I would be doubled over almost unable to breathe.  They could never find any patterns or anything wrong.  Finally they told me to take Tums at the onset of it to try to get rid of it.  Sometimes it helped, sometimes it didn't.  There were a couple of instances where my sugar was low, but most of the time it was normal.  I eventually out grew them.Now, if my sugar is low I do get just an upset stomach, really uneasy, but is fine once I eat something light to get back up.",
            "id": "2436470",
            "rank": 1
        },
        {
            "answer": "Thank you all for your comments. I have not had her tested for thyroid or celiac disease.  I will definitely consult with her doctor about it.  For now I have been trying to see a pattern, nothing jumps out quite yet.  It does seem like it occurs most when she is high but not always. So it has been hard to discern whats causing the stomach aches.",
            "id": "2436472",
            "rank": 1
        },
        {
            "answer": "My daughter is 10 and is currently suffering from all of the symptoms that you are all talking about. I will go to the doctor and see what we can find. Her levels have been high and are now stabilizing - there has been no real reason as to this. We'll go and check it out!! Thankyou to all!",
            "id": "4335210",
            "rank": 1
        },
        {
            "answer": "Our daughter is in the same situation, she is 8 and was diagnosed 3 months ago.   Occassionaly shy complains of pain but it is not sore to touch.   It sometimes seems to be after a 'heavy' meal, e,g, including potatoes & turnips, but we haven't been able to see a pattern.  Our diabetes team dismissed same as being unrelated to Type 1.",
            "id": "6422428",
            "rank": 1
        },
        {
            "answer": "so frustrated....my nine year old was diagnosed type 1 a month ago....her numbers are doing so good but the poor thg feels like crap so frequently that it is affectting things more than the counting carbs and shots!!! she gets numerous tummy aches every day....it is making her grumpy and difficult....endocronologist does not believe its diabetes related but started the same time as diagnosis... wth????? cant find any trends....not only with highs...sometimes shes normal...before meals after meals.....super frustated....negative foe celiacs....any suggestions?",
            "id": "6637039",
            "rank": 1
        },
        {
            "answer": "To everyone on here I have a stepdaughter who is type 1 also and she has pains for a while it was most often than anything but after calling her endocrinologist he suggest we check her keytones and every time her stomach hurt and we checked her keytones they were always high.  All you can really do for it is have them drink water as much as they can and keep drinking water until their keytones come down.  After she drank water and water and water where she didn't want to drink anymore she had to keep drinking because after a little while she felt better.  The stomach pain went away.  Please I stress to much who anyone who had newly diagnosed type 1 kids to drink lots of water it is the cure to everything to make them stay feeling normal.",
            "id": "8955137",
            "rank": 1
        },
        {
            "answer": "To everyone on here I have a stepdaughter who is type 1 also and she has pains for a while it was most often than anything but after calling her endocrinologist he suggest we check her keytones and every time her stomach hurt and we checked her keytones they were always high.  All you can really do for it is have them drink water as much as they can and keep drinking water until their keytones come down.  After she drank water and water and water where she didn't want to drink anymore she had to keep drinking because after a little while she felt better.  The stomach pain went away.  Please I stress to much who anyone who had newly diagnosed type 1 kids to drink lots of water it is the cure to everything to make them stay feeling normal.",
            "id": "8955144",
            "rank": 1
        },
        {
            "answer": "I'm Sophie, and I was diagnosed with Type 1 Diabetes about 2 weeks ago. I'm 15 years old. I'm coping well with everything, including the injections, however when I actually inject the insulin it stings/burns. The actual pain of the needle prick is bearable but this burning sensation is not. Does this sound familiar to anyone? Anyway, back to the abdominal pain. It started about 3 days ago and although it is a constant 'severe hunger' sensation I get bursts/spasms of excruciating pain every hour or so. I returned to hospital and the doctor found that the glands in my neck were severely swelled and that I had trapped gas and knotting of intestines. He explained that these symptoms gave him the impression of a stomach bug/viral infection. 3 hours ago I gratefully swallowed two Buscopan tablets and although it took a while to kick in, the pain is finally easing.",
            "id": "9724415",
            "rank": 1
        },
        {
            "answer": "Cold insulin can cause the pain/burn when injected. Try bringing it to room temperature.",
            "id": "10480742",
            "rank": 20
        },
        {
            "answer": "Hi, I'm a member of a family with a little 3 year old girl with Type 1 Diabetes. She also complains of stomache pains.Reading these posts, and seeing some suggestions (Which we will try). I was thinking that maybe these pains might be a affect of the injections themselves (albeit maybe harmless).A bit like when someone sleeps in a draft and wakes up with a stiff neck. Or someone who is constantly in an uncomfortable postion, then complains of aches and pain. I myself suffer from shoulder pain, which was do not keeping my shoulders relaxed (Took a physiotherapist to spot that. lol).It was this that made me think that the pains may be a result of the nearby muscles or organs having to adjust to the repeated injections.I have noticed that our little girls stomach looks like an upside down shelf, from all the injections.When our little girl has her injection, she has a choice of areas to have the injection, though she favours the stomache usually.This is just a thought.",
            "id": "10534091",
            "rank": 1
        },
        {
            "answer": "I've been checking this topic this am as my 10yo son has been in the bathroom an hour with stomach pain. His sugar was high. 358 this am. Wondering if this has something to do with it or no?  Gonna get so e water in him and hope he gets to school. Late is better than not at all.",
            "id": "10990608",
            "rank": 1
        },
        {
            "answer": "I am reading all your comments and i must say what i found and think. My 20 year old son was diagnosed with type1 D almost a year and a half ago. I remember that before his diagnosis he was complaining of stomach pains on and off. He has been on insulin for a month after the diagnosis and then he started having lows all the time so we decided to stop the insulin. That was almost  1.5 years ago. His sugar readings were normal. Now he started having the pains again and his sugar is high again. So i think this is definitely related to the high sugar. Something in the stomach triggers something off and causes the sugars to go up. Im not a doctor but i think this should be looked into by some professionals. Obviously there is a pattern. Your body is giving you signs that something is going on that is not right. I'm shocked that doctors dont even bother to relate one thing to another instead they eliminate unrelated things like gas etc.  I hope all of us here with sick children with this disease will somehow try to connect the dots and maybe someone will hear.",
            "id": "11134995",
            "rank": 1
        },
        {
            "answer": "My son Sean has been type 1 since he was 10, he is now 25, and for the last over 3 yrs, he has had constant lower right abdominal pain,to the point where he has no life,no friends, and goes in and out of depression, and sometimes, he feels like he just can't handle life anymore!!!the pain gets even worse after eating,sometimes he only eats once a day because the pain is worse! his sugar levels get higher the more pain he is in! its like a vicious cycle,but his sugar can be in normal range,even when his pain is bad,it never changes he's always in pain. Been to the hospital over 65 times in 3 years,seen multiple dr.s and still no real answers,and not much help from any dr. Including any pain dr.,no help is tearing our family apart! HELP! Desperate!!!",
            "id": "11849482",
            "rank": 1
        },
        {
            "answer": "have they considered chronic appendicitis?",
            "id": "11866141",
            "rank": 1
        },
        {
            "answer": "Hi my daughter is type 1 diagnosed at age 7 two years ago and has had on and off busts of the pain in stomach.  we have been to numerous appointments clinic saying its unrelated and doctors saying anything from colic to IBS and have put her on omeprazole.firstly she was on injections in legs and still stomach pain, she is now on pump and still there so I don't think site injections are connected.  Her levels are really great on pump and still pain.  her levels will go higher when her belly is sore as pain of any kind will raise the levels as does stress so not sure the levels are causing the pain or the pain causing the levels.  we have with pump a keytone meter and check these every day and have to say she never has keytones with pain unless she has been unwell which will cause the keytones.  im at a lost cause really I would love them to put a camera down and see what they can find.to the lady who say drink loads and get rid of keytones yes this is true water will help but keytones are mostly caused by lack of insulin and not the high levels so it would be better to take much more insulin and flush them.  just a suggestion to clear your keytones quicker :)  high levels will only cause keytones if left hgh for long periods in other words lack of insulin.Jo",
            "id": "12188944",
            "rank": 1
        },
        {
            "answer": "my son is 16 and has had t1d for 4 years now. he is home from school said he has a stomach ache. he is going through a stage where he doesnt to his nighttime  shot and gets mad when i reminded him or ask him about his diabetes. this morning I asked him to check himself and he was over 400 so he took a correction. within 5 or so mins he said he was better.  I asked him if he took his nighttime and he said no. I am in tears and don't know what to do. a friend of mine is selling Plexus does anyone know about it? they said it has a carb blocker.",
            "id": "13748447",
            "rank": 1
        },
        {
            "answer": "I'm a 17 year old Type 1 diabetic, and I have stomach pains. It does not feel like a stomach ache, it is more of a sharp pain and it can be extremely painful sometimes. I have noticed that it happens when my blood sugar changes drastically/quickly or is running high for an extended period of time.",
            "id": "14142938",
            "rank": 1
        }
    ]
}